{
  "links": "https://www.ycombinator.com/companies/222",
  "name": "222",
  "headline": "marketplace facilitating IRL social experiences at local venues",
  "batch": "W23",
  "description": "222 is a full-stack social experiences platform to generate real-life experiences at curated hyperlocal venues where we can reliably predict you will like both the people & place.",
  "activity_status": "Active",
  "website": "https://222.place",
  "founded_date": 2021.0,
  "team_size": 6.0,
  "location": "New York",
  "group_partner": "Aaron Epstein",
  "group_partner_yc": "https://www.ycombinator.com/people/aaron-epstein",
  "company_linkedin": null,
  "company_twitter": null,
  "tags": "industry:machine-learning; industry:marketplace; industry:consumer; industry:social; industry:ai; location:new-york",
  "founders": [
    {
      "name": "Keyan Kazemian, Founder",
      "description": "accelerating chance social encounters @ www.222.place",
      "linkedin": "https://linkedin.com/in/kaaazemian"
    },
    {
      "name": "Danial Hashemi, Founder",
      "description": "Iranian immigrant building a new solution to social",
      "linkedin": "https://www.linkedin.com/in/danialhashemi/"
    },
    {
      "name": "Arman Roshannai, Founder",
      "description": "engineering serendipity @ 222\n-\nexcited about tech that improves the human experience",
      "linkedin": "https://www.linkedin.com/in/arman-roshannai/"
    }
  ],
  "status": true,
  "markdown": "raw_markdown='![](https://222.place/_next/image?url=%2Flogos%2Ftwotwotwo-offwhite.png&w=3840&q=75)\\n# choose chance - meet new people, discover your city & deepen your relationships - no profiles, no DMs, no scrolling, no swiping - how to meet new people in NYC, how to meet new people in LA, how to make friends in NYC, how to make friends in LA, this must be the place - 222, angel numbers, meet new people and discover your city, only in LA, only in NYC - accelerating chance social encounters.\\nprivacy policy\\n|\\nterms of service\\n' markdown_with_citations='![](https://222.place/_next/image?url=%2Flogos%2Ftwotwotwo-offwhite.png&w=3840&q=75)\\n# choose chance - meet new people, discover your city & deepen your relationships - no profiles, no DMs, no scrolling, no swiping - how to meet new people in NYC, how to meet new people in LA, how to make friends in NYC, how to make friends in LA, this must be the place - 222, angel numbers, meet new people and discover your city, only in LA, only in NYC - accelerating chance social encounters.\\nprivacy policy\\n|\\nterms of service\\n' references_markdown='\\n\\n## References\\n\\n' fit_markdown='' fit_html=''",
  "generated_description": "### Company Summary: 222\n\n**Name**: 222  \n**Founded**: 2021  \n**Location**: New York, NY  \n**Team Size**: 6 employees  \n**Y Combinator Batch**: W23  \n**Website**: [222.place](https://222.place)  \n\n---\n\n**Mission**:  \n222 is setting out to redefine how we connect with people in real life by facilitating social experiences at local venues. It's all about helping you meet new people, discover your surroundings, and deepen relationships without the usual distractions of modern dating apps. \n\n**What They're Building**:  \nThe heart of 222’s vision is a marketplace for \"real-life\" social experiences. Think of it as a curated platform where you can engage with both people and places—where they can almost predict you'll enjoy your interactions. There’s no need for profiles, DMs, scrolling, or swiping. It’s about embracing chance encounters—whether you’re in New York City or Los Angeles. They aim to accelerate connection by taking away the noise of typical social interactions and focusing on genuine engagement.\n\n**Unique Tagline**:  \n\"Choose chance - meet new people, discover your city & deepen your relationships.\"\n\n---\n\n**Key Notes**:  \n- **Focus on Human Interaction**: The company emphasizes organic socialization by facilitating events and engagements rather than relying on digital screens.\n- **Niche Target**: Primarily focused on urban dwellers in NYC and LA, providing opportunities to form friendships and connections in these bustling cities.\n- **Technology Usage**: Leveraging machine learning to enhance the matchmaking process between users and local venues/events, ensuring the experiences are as enjoyable as possible.\n\n**Leadership**:  \nAaron Epstein serves as a Group Partner, bringing expertise to the small yet capable team at 222.\n\nAs the world slowly opens up, 222 is poised to capitalize on a growing desire for authentic human experiences—making it not just a service but a movement towards genuine connection in our hyper-connected lives. If you’re in either of these cities and looking for ways to expand your social circles, 222 just might be the place for you."
}