{
  "links": "https://www.ycombinator.com/companies/adni",
  "name": "Adni",
  "headline": "AI agents to recruit & retain nurses",
  "batch": "S21",
  "description": "Adni is the first AI-powered nurse recruiting and retention platform. With our professional network of nurses and talent experience software, employers who use Adni hire nurses 2x faster and retain them 2x longer – all 4x cheaper than alternatives. What Doximity (IPO 2021) did for doctors, Adni is doing for nurses.",
  "activity_status": "Active",
  "website": "https://www.adni.co/",
  "founded_date": 2021.0,
  "team_size": 5.0,
  "location": "San Francisco",
  "group_partner": "Brad Flora",
  "group_partner_yc": "https://www.ycombinator.com/people/brad-flora",
  "company_linkedin": null,
  "company_twitter": null,
  "tags": "industry:marketplace; industry:saas; industry:b2b; industry:recruiting; industry:healthcare; location:san-francisco-bay-area",
  "founders": [
    {
      "name": "Anthony Scarpone-Lambert, Founder",
      "description": "Co-Founder & CEO at Adni (Formerly Lumify), Registered Nurse, UPenn Alum (Nursing, Wharton), and two-time Broadway performer from Philadelphia, PA. Currently based in NYC. Feel free to reach out at anthony@adni.co to connect!",
      "linkedin": "https://www.linkedin.com/in/anthony-scarpone-lambert-669052138/"
    },
    {
      "name": "Jennifferre Mancillas, Founder",
      "description": "Founder & COO at Adni, Nurse, California 2021 Nurse of the Year, and Johnson & Johnson Innovation Fellow from Fresno, CA. Feel free to reach out at jennifferre@adni.co to connect!",
      "linkedin": "https://www.linkedin.com/in/jennifferre-mancillas/"
    }
  ],
  "status": true,
  "markdown": "raw_markdown='\\n' markdown_with_citations='\\n' references_markdown='\\n\\n## References\\n\\n' fit_markdown='' fit_html=''",
  "generated_description": "**Adni: Revolutionizing Nurse Hiring and Retention**\n\nFounded in 2021 and proudly a member of Y Combinator’s Batch S21, Adni is on a mission to transform the healthcare recruiting landscape with its innovative AI-powered platform. Based in San Francisco, Adni aims to solve a significant problem in the healthcare sector: the rapid hiring and retention of nurses, which is crucial for maintaining quality patient care.\n\nAdni's platform leverages a robust professional network of nurses alongside advanced talent experience software, enabling employers to hire nurses twice as fast and retain them four times longer than traditional methods. In straightforward terms, this means that Adni not only streamlines the hiring process but also ensures that healthcare facilities can keep their staff longer, all at a cost that is four times cheaper than conventional alternatives. \n\nIt’s a bold claim, but then again, Adni stands on the shoulders of giants, drawing comparisons to Doximity (which went public in 2021), but with a laser focus on the nursing profession. This specialized approach fills a crucial gap in healthcare recruitment, which has often lagged behind other sectors.\n\nWith a small, dedicated team of five, led by visionary Group Partner Brad Flora, Adni is carving a niche in the bustling marketplaces of SaaS and B2B healthcare recruiting. They’re part of a growing trend that recognizes the need for modern solutions in an industry that’s often stuck in outdated practices.\n\nAdni’s impact transcends just recruitment; it’s about fostering a sustainable and supportive working environment for nurses, ensuring that they not only find jobs but thrive in them. \n\nFor employers, this means accessing a more efficient, effective way to secure nursing talent in an increasingly competitive market—a necessity as the demand for healthcare professionals continues to surge.\n\nIn summary, Adni is not just about hiring nurses; it's about reshaping how healthcare providers approach staffing, making it faster, cheaper, and more sustainable. You can explore more about Adni and their offerings on their website: [Adni](https://www.adni.co/). \n\n**Key Points:**\n- Founded in 2021, part of Y Combinator Batch S21.\n- AI-powered nurse recruiting and retention platform.\n- Claims to hire nurses 2x faster and retain them 2x longer, 4x cheaper than alternatives.\n- Based in San Francisco with a team of 5.\n- Focused on the healthcare market.\n"
}