{
  "links": "https://www.ycombinator.com/companies/adventris-pharmaceuticals",
  "name": "Adventris Pharmaceuticals",
  "headline": "Adventris makes cancer vaccines",
  "batch": "W23",
  "description": "Adventris makes cancer vaccines. Our platform solves the problem of targeting poorly immunogenic oncogenes. Our first \"off-the-shelf\" vaccine targets KRAS, the most common cancer oncogene. In the long run, we envision a world where every adult receives our pan-cancer vaccines annually – preventing the majority of cancer deaths.\r\n\nIf you are interested in learning more about our approach to treat and prevent cancer, please reach out to us at contact@adventris.com",
  "activity_status": "Active",
  "website": "https://adventris.com",
  "founded_date": 2022.0,
  "team_size": 7.0,
  "location": "Baltimore, MD",
  "group_partner": null,
  "group_partner_yc": null,
  "company_linkedin": null,
  "company_twitter": null,
  "tags": "industry:biotech; industry:healthcare; industry:therapeutics; industry:drug-discovery; industry:oncology",
  "founders": [
    {
      "name": "Jen Herbach, Founder",
      "description": "Jen Herbach is the CEO of Adventris Pharmaceuticals. She has more than a decade of biotech industry experience bringing novel oncology drugs to market, across companies including Onyx/Amgen, InterMune/Genentech, Exelixis, and Amunix. She holds an MBA from Harvard Business School and a Masters from the University of Cambridge.",
      "linkedin": "https://www.linkedin.com/in/jennylesser/"
    },
    {
      "name": "William Collis, Founder",
      "description": "William Collis is a serial entrepreneur with multiple exits, most recently the data platform Genji. His research has been published in Harvard Business review and featured as a TED talk with over 1.5M views. He holds an MBA from Harvard Business School where he was named a Baker Scholar. He is lifelong friends with his co-founders Jen Herbach and Mark Yarchoan, since meeting as roommates at Amherst College.",
      "linkedin": "https://www.linkedin.com/in/william-collis-145a2511/"
    },
    {
      "name": "Mark Yarchoan, Founder",
      "description": "Mark Yarchoan, M.D, is an Associate Professor of Medical Oncology at Johns Hopkins. Dr. Yarchoan runs an NCI-funded laboratory focused on developing novel immunotherapies, with a focus on cancer vaccines. He has led multiple international clinical trials of immunotherapy agents including neoantigen-targeted cancer vaccines. Dr. Yarchoan has received multiple honors, including the ASCO Young Investigator Award and the ASCO Career Development Award.",
      "linkedin": null
    }
  ],
  "status": true,
  "markdown": "raw_markdown='[](https://adventris.com/</>)[ Skip to main content ](https://adventris.com/<#content>)\\n> Adventris is a biotechnology company focusing on cancer immunotherapy\\nFor more information or partnership opportunities, contact us at: contact@adventris.com\\n[](https://adventris.com/<#>)\\nMove to next frame\\nMove to previous frame\\nClose modal\\n' markdown_with_citations='[](https://adventris.com/</>) Skip to main content ⟨1⟩\\n> Adventris is a biotechnology company focusing on cancer immunotherapy\\nFor more information or partnership opportunities, contact us at: contact@adventris.com\\n[](https://adventris.com/<#>)\\nMove to next frame\\nMove to previous frame\\nClose modal\\n' references_markdown='\\n\\n## References\\n\\n⟨1⟩ https://adventris.com/<#content>:  Skip to main content \\n' fit_markdown='' fit_html=''",
  "generated_description": "**Adventris Pharmaceuticals Overview**\n\nFounded in 2022 and part of the Y Combinator Batch W23, Adventris Pharmaceuticals is a promising player in the biotech sector, specifically focused on cancer immunotherapy. Located in Baltimore, MD, the company operates with a compact yet dedicated team of seven employees.\n\n**Mission and Vision**\n\nAdventris is dedicated to revolutionizing cancer treatment through its innovative cancer vaccines. The company's core mission is to develop effective vaccines that target poorly immunogenic oncogenes, with their first product aimed squarely at KRAS, the most prevalent oncogene in cancers. Looking forward, Adventris envisions a future where pan-cancer vaccines are delivered annually to all adults, significantly reducing the rate of cancer fatalities.\n\n**Key Focus Areas**\n\nAdventris’s focus is firmly rooted in a set of key areas: biotech, healthcare, therapeutics, drug discovery, and oncology. This multifaceted approach positions them well within the broader landscape of cancer treatment and prevention.\n\n**Engagement and Partnerships**\n\nIf you're keen on exploring how Adventris is tackling the challenges of cancer immunotherapy or are interested in partnership opportunities, they encourage you to reach out. You can contact them directly via email at contact@adventris.com.\n\nFor more detailed insights into their groundbreaking work, visit their website at [Adventris.com](https://adventris.com).\n\nIn summary, Adventris Pharmaceuticals is not just another biotech startup; it's a forward-thinking venture poised to make cancer prevention a norm rather than an exception, aiming to change the future of healthcare for everyone."
}