{
  "links": "https://www.ycombinator.com/companies/adyn",
  "name": "adyn",
  "headline": "The first test designed to prevent birth control side effects",
  "batch": "S20",
  "description": null,
  "activity_status": "Active",
  "website": "https://www.adynhealth.com",
  "founded_date": 2019.0,
  "team_size": 7.0,
  "location": "Seattle, WA",
  "group_partner": "Gustaf Alstromer",
  "group_partner_yc": "https://www.ycombinator.com/people/gustaf-alstromer",
  "company_linkedin": null,
  "company_twitter": null,
  "tags": "industry:fertility-tech; industry:machine-learning; industry:consumer-health-services; location:seattle",
  "founders": [
    {
      "name": "Elizabeth Ruzzo, Founder",
      "description": "Born & raised in Seattle. Extrovert. Soccer. Amateur chef.\n\nPhD in human genomics from Duke University & Postdoctoral Fellowship from UCLA. Accomplished human genetics researcher (author of 20+ peer-reviewed publications, Charles J. Epstein Trainee Awardee for Excellence in Human Genetics Research, Jo Rae Wright Fellowship for Outstanding Women in Science, Neurobehavioral Genetics Fellow, and Ray J. Tysor Graduate Fellowship awardee) with a passion for using big data to transform health care.",
      "linkedin": "https://www.linkedin.com/in/elizabeth-ruzzo-706133b3/"
    }
  ],
  "status": true,
  "markdown": null,
  "generated_description": "Adyn is an innovative company that aims to revolutionize the landscape of birth control by creating the first test specifically designed to prevent the side effects often associated with contraceptives. Founded in 2019, Adyn is part of the Y Combinator Batch S20 and is based in Seattle, WA. \n\nWith a small but focused team of seven employees, Adyn leverages cutting-edge technology, particularly in areas like machine learning, to enhance consumer health services related to fertility. The company’s mission aligns with a growing demand for personalized health solutions, especially in the realm of sexual and reproductive health.\n\nAlthough details on their current projects are sparse, it's clear that Adyn is at the intersection of fertility technology and innovative healthcare solutions—domains that are ripe for disruption. Led by Group Partner Gustaf Alstromer, the team is well-positioned to tackle these challenges.\n\nFor more information about Adyn and its mission, you can visit their website at [Adyn Health](https://www.adynhealth.com). In an age where health tech is continually evolving, Adyn is a noteworthy player striving to create better experiences for those using birth control."
}