{
  "links": "https://www.ycombinator.com/companies/ajaib",
  "name": "Ajaib",
  "headline": "Consumer fintech for Indonesia",
  "batch": "S18",
  "description": "Ajaib is an online brokerage that allows Indonesians to buy and sell stocks, ETFs and mutual funds. We are Indonesia's leading financial technology platform driven by a mission to educate the importance of investing for the future.\r\n\nGuided by the three principles; Everyone is an owner, a growth mindset, and a will to win, we aim to increase the number of financial inclusion within Indonesians through investment. Ajaib is committed to opening the door to access safe, trusted and affordable investment instruments. We transformed the way young generations invested when we first established in 2018.\r\n\nToday, Ajaib is the third-largest brokerage by the number of transactions in Indonesia, with over 1 million investors based on our platform and titled as the fastest-growing unicorn in South East Asia.",
  "activity_status": "Active",
  "website": "https://www.ajaib.co.id/",
  "founded_date": 2019.0,
  "team_size": 300.0,
  "location": "Jakarta, Indonesia",
  "group_partner": null,
  "group_partner_yc": null,
  "company_linkedin": null,
  "company_twitter": null,
  "tags": "industry:fintech; industry:consumer",
  "founders": [
    {
      "name": "Anderson Sumarli, Founder",
      "description": "Co-founder & CEO of Ajaib",
      "linkedin": "https://www.linkedin.com/in/andersonsumarli/"
    },
    {
      "name": "Yada Piyajomkwan, Founder",
      "description": null,
      "linkedin": "https://www.linkedin.com/in/yada-piyajomkwan-88713865/"
    }
  ],
  "status": true,
  "markdown": null,
  "generated_description": "Ajaib is making waves in Indonesia’s fintech landscape, driven by a mission to democratize investment opportunities. Founded in 2019 and based in Jakarta, Ajaib started as an online brokerage platform that empowers Indonesians to buy and sell stocks, ETFs, and mutual funds. It’s more than just a platform; Ajaib stands as a beacon for financial literacy, emphasizing the importance of investing for a prosperous future.\n\nThe company operates on three core principles: **Everyone is an owner**, which fosters a sense of community and shared purpose; **a growth mindset**, encouraging adaptation and learning; and a **will to win**, instilling resilience and determination. These principles guide Ajaib's dedication to enhancing financial inclusion for Indonesians, making investment accessible, safe, and affordable.\n\nSince its inception, Ajaib has quickly risen to become the third-largest brokerage in Indonesia based on transaction volume. Boasting over 1 million investors on its platform, it has earned a reputation as the fastest-growing unicorn in Southeast Asia. Part of Y Combinator's Summer 2018 batch, the company has a team of around 300 committed employees working toward transforming the investment landscape for younger generations.\n\nWith its robust growth trajectory, Ajaib is not just about numbers; it’s about changing the financial narrative for many Indonesians, paving the way for a brighter economic future. If you're curious to learn more, check out their website at [Ajaib](https://www.ajaib.co.id/)."
}