{
  "links": "https://www.ycombinator.com/companies/anniecannons",
  "name": "AnnieCannons",
  "headline": "Connecting Survivors to Careers in Tech",
  "batch": "S18",
  "description": "AnnieCannons (AC) is a 501(c)3 nonprofit dedicated to training survivors of human trafficking and gender-based violence to be programmers, giving them both the economic and technological empowerment to invent solutions to overcome the hardships they have survived, and the capacity to support themselves and their families.",
  "activity_status": "Active",
  "website": "https://www.anniecannons.com",
  "founded_date": 2015.0,
  "team_size": 14.0,
  "location": "Oakland, CA",
  "group_partner": null,
  "group_partner_yc": null,
  "company_linkedin": null,
  "company_twitter": null,
  "tags": "industry:assistive-tech; industry:saas; industry:civic-tech; location:san-francisco-bay-area",
  "founders": [],
  "status": true,
  "markdown": null,
  "generated_description": "AnnieCannons is a nonprofit organization based in Oakland, California, that champions a powerful mission: connecting survivors of human trafficking and gender-based violence to careers in tech. Founded in 2015 and a proud member of Y Combinator’s S18 batch, AnnieCannons combines empathy with tech education, training these survivors to become programmers. \n\nWith a dedicated team of 14 employees, the organization is focused on economic and technological empowerment. Their approach not only equips individuals with the skills to thrive in the tech industry but also enables them to craft solutions that reflect their personal experiences and challenges. \n\nAnnieCannons is positioned at the intersection of assistive tech, civic tech, and SaaS, all while deeply rooted in the San Francisco Bay Area community. The organization operates under the belief that the right training and support can transform lives, fostering self-sufficiency and hope among those who've faced great adversity.\n\nWhile the specifics of their current activities weren't detailed, it’s clear that their ongoing efforts are dedicated to enhancing the skills and opportunities for their participants, and reinforcing the idea that technology can be a vehicle for change. You can learn more about their inspiring work at [AnnieCannons.com](https://www.anniecannons.com)."
}