{
  "links": "https://www.ycombinator.com/companies/arc-2",
  "name": "Arc",
  "headline": "Banking & Funding for Startups",
  "batch": "W22",
  "description": "Arc empowers startups with a better banking experience. With Arc, you can store deposits,  schedule and manage payments, diversify cash across asset classes, and access non-dilutive financing all in one place. Arc is based in San Francisco and is funded by Left Lane Capital, NFX, Bain Capital Ventures, Clocktower Technology Ventures, Torch Capital, and Y Combinator, among others. To learn more, visit www.arc.tech.",
  "activity_status": "Active",
  "website": "https://www.joinarc.com/",
  "founded_date": 2021.0,
  "team_size": 40.0,
  "location": "San Francisco",
  "group_partner": "Jared Friedman",
  "group_partner_yc": "https://www.ycombinator.com/people/jared-friedman",
  "company_linkedin": null,
  "company_twitter": null,
  "tags": "industry:fintech; industry:saas; industry:b2b; location:san-francisco-bay-area",
  "founders": [
    {
      "name": "Don Muir, Founder",
      "description": "Co-Founder / CEO @ Arc Technologies\n\nEx-investor & consultant turned fintech junkie, passionate about helping startups unlock growth through technology.",
      "linkedin": "https://www.linkedin.com/in/don-muir"
    },
    {
      "name": "Raven Jiang, Founder",
      "description": "Engineer and technologist who loves to tinker and build. Early adopter of most things and cryptocurrency enthusiast. Grew up in Singapore and came to California for college. I've been here ever since.",
      "linkedin": "https://www.linkedin.com/in/ravenjiang/"
    },
    {
      "name": "Nick Lombardo, Founder",
      "description": "Co-Founder / President @ Arc Technologies. Helping startups grow through modern financial products.",
      "linkedin": "https://www.linkedin.com/in/nicholas-m-lombardo/"
    }
  ],
  "status": true,
  "markdown": "raw_markdown='Products\\n  * [Cash Management](https://www.joinarc.com/</operating>)\\n  * [Treasury](https://www.joinarc.com/</treasury>)\\n  * [Global Treasury](https://www.joinarc.com/</global-treasury>)\\n  * [Capital Markets](https://www.joinarc.com/</capital-markets>)\\n  * [Working Capital](https://www.joinarc.com/</working-capital>)\\n  * [Venture Debt](https://www.joinarc.com/</venture-debt>)\\n  * [Arc Intelligence ](https://www.joinarc.com/</ai>)\\n\\n\\nCompany\\n  * [2023 Recap](https://www.joinarc.com/<https:/2023.arc.tech/>)\\n  * [Pricing](https://www.joinarc.com/</pricing>)\\n  * [Investment Options](https://www.joinarc.com/</treasury-investment-options>)\\n  * [About Arc](https://www.joinarc.com/</about>)\\n  * [Careers](https://www.joinarc.com/</careers>)\\n  * [Case Studies](https://www.joinarc.com/</case-studies>)\\n  * [Contact](https://www.joinarc.com/</contact>)\\n  * [Media Kit](https://www.joinarc.com/</media-kit>)\\n  * [News Room](https://www.joinarc.com/</newsroom>)\\n  * [Partner Benefits](https://www.joinarc.com/</partners>)\\n\\n\\nResources\\n  * [Blog](https://www.joinarc.com/</blog>)\\n  * [The Startup Encyclopedia ](https://www.joinarc.com/</encyclopedia>)\\n  * [Calculator](https://www.joinarc.com/</calculator>)\\n  * [Learning Center](https://www.joinarc.com/</learning-center>)\\n  * [Guides](https://www.joinarc.com/</guides>)\\n\\n\\n[Log in](https://www.joinarc.com/<https:/app.joinarc.com/login>)[Get started](https://www.joinarc.com/<https:/app.joinarc.com/signup>)\\n[Introducing Arc Intelligence — The First AI Platform For Private Credit • Learn More ](https://www.joinarc.com/</ai>)\\n[](https://www.joinarc.com/</>)\\n[Download logo](https://www.joinarc.com/<https:/storage.googleapis.com/website-cms-uploads/logos_0007f577c9/logos_0007f577c9.zip?updated_at=2022-08-15T15:23:07.427Z>)[Download media kit](https://www.joinarc.com/<https:/storage.googleapis.com/website-cms-uploads/arc_media_kit_3cd8c15e6c/arc_media_kit_3cd8c15e6c.zip?updated_at=2022-08-15T15:20:36.100Z>)\\n  * [Cash Management](https://www.joinarc.com/</operating>)\\n  * [Treasury](https://www.joinarc.com/</treasury>)\\n  * [Capital Markets](https://www.joinarc.com/</capital-markets>)\\n[Arc IntelligenceExplore the first AI Analyst for private credit.](https://www.joinarc.com/</ai>)\\n  * [Pricing](https://www.joinarc.com/</pricing>)\\n[PricingFind everything you need to know about features, fees, and yield with Arc, so you can save time and make informed decisions.](https://www.joinarc.com/</pricing>)\\n[Treasury Investment OptionsView the options available today within your Treasury account held at BNY Mellon Pershing, along with their gross market APYs.](https://www.joinarc.com/</treasury-investment-options>)\\n  * [Company](https://www.joinarc.com/</about>)\\n[AboutArc is the future of finance providing software startups with the customized financial products they deserve.](https://www.joinarc.com/</about>)\\n[CareersJoin us in reinventing the future of finance for startups.](https://www.joinarc.com/</careers>)\\n[Media KitHelpful information about our product, our traction and our team. ](https://www.joinarc.com/</media-kit>)\\n[News RoomBrowse recent press releases and media coverage finance for startups.](https://www.joinarc.com/</newsroom>)\\n[Partner Benefits Discover discounts on essential business software to help you grow.](https://www.joinarc.com/</partners>)\\n\\n\\n  * [Log in](https://www.joinarc.com/<https:/app.joinarc.com/login>)\\n  * [Get started](https://www.joinarc.com/<https:/app.joinarc.com/signup>)\\n\\n\\n# Capital management for ambitious businesses\\nManage finances, generate yield, and secure funding. All with Arc.\\n[Get started](https://www.joinarc.com/<https:/app.joinarc.com/signup>)[Book a demo](https://www.joinarc.com/<https:/calendly.com/client-team-7r_e/learn-about-arc>)\\n![Treasury Dashboard](https://storage.googleapis.com/website-cms-uploads/business_account_2024_new_1db4c7e46b/business_account_2024_new_1db4c7e46b.png)\\n# Cash Management essentials built for scale\\n[![](https://storage.googleapis.com/website-cms-uploads/operating_29e413f682/operating_29e413f682.png)Cash ManagementManage everyday business financesUnlimited free wires, ACH, and cards empower CFOs to operate their business with confidence.Learn more](https://www.joinarc.com/</operating>)\\n[![](https://storage.googleapis.com/website-cms-uploads/treasury_96bba9781e/treasury_96bba9781e.png)TreasuryGenerate yield with a Treasury accountInvest in Money Market Funds and Treasury Bills that earn up to 4.45%² net yield.Learn more](https://www.joinarc.com/</treasury>)\\n[![](https://storage.googleapis.com/website-cms-uploads/debt_capital_slider_e50ddf2cd9/debt_capital_slider_e50ddf2cd9.png)Capital MarketsOutsource your debt raise with ArcLeverage Arc to find and negotiate a customized debt solution on your behalf.Learn more](https://www.joinarc.com/</capital-markets>)\\n# Enterprise-grade security and support comes standard\\n![](https://storage.googleapis.com/website-cms-uploads/bank_security_b36d154564/bank_security_b36d154564.png)\\nBuilt with security in mind\\nProtect your Arc account and financial data with multi-factor authentication and granular employee permissions.\\n![](https://storage.googleapis.com/website-cms-uploads/frictionless_experience_e9e67a006e/frictionless_experience_e9e67a006e.png)\\nFrictionless experience\\nApplying for an Arc account takes minutes and once approved, access all the cash management essentials in one platform.\\n![](https://storage.googleapis.com/website-cms-uploads/support_b5f7f90e15/support_b5f7f90e15.png)\\nWhite-glove support\\nArc offers around the clock support to answer your most pressing questions and propel your business forward.\\n![James Slezak, CEO & Founder of Swayable portrait](https://storage.googleapis.com/website-cms-uploads/james_12e6021488/james_12e6021488.jpg)\\n#### Arc is the future of cash management for Silicon Valley. Swayable received multiple Venture Debt term sheets in days with Arc’s AI-powered Capital platform. We instantly deposited the funds into our Arc account, putting cash management on autopilot while earning market leading APY and the protection of the world’s largest banks.\\n— James Slezak, CEO & Founder of Swayable\\n## Get access to the capital and cash management experience built for scale.\\nAll without minimums and usage-based fees.\\n[Get started](https://www.joinarc.com/<https:/app.joinarc.com/signup>)\\n**Arc is a financial technology company, not a bank.**\\n**Arc partners with**[** _Stripe Payments Company_**](https://www.joinarc.com/<https:/stripe.com>)**for money transmission services and account services.** “Business” accounts are financial accounts provided by Stripe Payments Company with funds held at Fifth Third Bank, Member FDIC; \"Wallet\" and \"Reserve\" accounts are financial accounts provided by Stripe Payments Company with funds held at Evolve Bank & Trust, Member FDIC.\\nArc cards are issued by Celtic Bank and serviced by Stripe, Inc. and its affiliate Stripe Servicing, Inc.\\n**For Arc “Treasury” accounts, investment advisory services are provided by Arc Advisory LLC (“Arc Advisory”) or Atomic Invest LLC (“Atomic Invest”).**\\nFor Arc Treasury accounts with advisory services provided by Arc Advisory LLC: \\nArc Advisory is an SEC-registered investment advisor. Technology services may be provided by Arc Technologies, Inc. For more details about Arc Advisory, please see the [ _Form ADV and Wrap Fee Disclosure Brochure_](https://www.joinarc.com/<https:/adviserinfo.sec.gov/firm/brochure/330258>) and [ _Privacy Policy_](https://www.joinarc.com/<https:/vault.pactsafe.io/s/302d718c-fd8b-4f36-8743-b75c207b8fac/legal.html#arc-privacy-policy>).\\nArc Advisory LLC has an engagement with Atomic Brokerage LLC (“Atomic Brokerage”), a registered broker-dealer and member of [FINRA](https://www.joinarc.com/<https:/www.finra.org/#/>) and [SIPC,](https://www.joinarc.com/<https:/www.sipc.org/>) to bring you the opportunity to open a brokerage account. Brokerage services for customers of Arc Advisory LLC are provided by Atomic Brokerage. For more details about Atomic Brokerage, please see the [ _Form CRS_](https://www.joinarc.com/<https:/reports.adviserinfo.sec.gov/crs/crs_313255.pdf>) _,_ the [Atomic Brokerage  _General Disclosures_](https://www.joinarc.com/<https:/legal.atomicvest.com/usa.broker.disclosures.003464f3-f6bd-41c3-bbdf-7050e50b43a2.pdf>) , and the [ _Privacy Policy_](https://www.joinarc.com/<https:/legal.atomicvest.com/usa.privacy.de3d0277-78f7-4741-9e9f-755f6b4f03ba.pdf>). Check the background of Atomic Brokerage on FINRA’s [ _BrokerCheck_](https://www.joinarc.com/<https:/brokercheck.finra.org/>). Fees such as regulatory fees, transaction fees, fund expenses, brokerage commissions and services fees may apply to your brokerage account.\\nFor Arc Treasury accounts with advisory services provided by [Atomic Invest LLC](https://www.joinarc.com/<https:/legal.atomicvest.com/usa.disclosures.e1dc8c5c-1742-453e-9157-51e09deee88b.pdf>):\\nArc has an engagement with Atomic Invest LLC (“Atomic Invest”), an SEC-registered investment adviser, to bring you the opportunity to open an investment advisory account. Investment advisory services are provided by Atomic Invest. Companies which are engaged by Atomic Invest receive compensation of 0% to 0.85% annualized, payable monthly, based upon assets under management for each referred client who establishes an account with Atomic Invest (i.e., exact payment will differ). Atomic Invest also shares a percentage of compensation received from margin interest and free cash interest earned by customers with Arc. Arc is not a client of Atomic Invest, but our engagement with Atomic Invest gives us an incentive to refer you to Atomic Invest instead of another investment adviser. This conflict of interest affects our ability to provide you with unbiased, objective information about the services of Atomic Invest. This could mean that the services of another investment adviser with whom we are not engaged could be more appropriate for you than Atomic Invest. For more details about Atomic Invest, please see their [Form CRS](https://www.joinarc.com/<https:/reports.adviserinfo.sec.gov/crs/crs_313255.pdf>), [Form ADV Part 2A](https://www.joinarc.com/<https:/files.adviserinfo.sec.gov/IAPD/Content/Common/crd_iapd_Brochure.aspx?BRCHR_VRSN_ID=863222>), the [Privacy Policy](https://www.joinarc.com/<https:/legal.atomicvest.com/usa.privacy.de3d0277-78f7-4741-9e9f-755f6b4f03ba.pdf>), and other disclosures. Brokerage services for Atomic Invest are provided by Pershing Advisor Solutions LLC, a registered broker-dealer and member of [FINRA](https://www.joinarc.com/<https:/www.finra.org/#/>) and [SIPC](https://www.joinarc.com/<https:/www.sipc.org/>). \\nNone of Arc Advisory, Atomic Invest, Atomic Brokerage, or any of their affiliates, are a bank. Investments in securities are Not FDIC insured, Not Bank Guaranteed, and May Lose Value. Investing involves risk, including the possible loss of principal. Before investing, consider your investment objectives and the fees and expenses charged. Advisory services are designed to assist clients in achieving a favorable outcome in their investment portfolio. They are not intended to provide tax advice or financial planning with respect to every aspect of a client’s financial situation and do not include investments that clients may hold outside of their Arc Treasury account.\\nCustodial and clearing services for all Arc Treasury accounts are provided by Pershing LLC, a BNY Mellon company. Technology services may be provided by AtomicVest, Inc. \\n**Cash Sweep Program**\\nFor Arc Treasury Accounts with Arc Advisory or Atomic Invest, Pershing LLC (“Pershing”) offers a cash sweep program. Funds in transit to or from Program Banks are generally not FDIC-insured. The Sweep Program is administered by Pershing LLC. Deposits at each Program Bank are insured by the FDIC up to $250,000 for each insurable capacity. Based on eligibility criteria, the two FDIC-insured programs (“Bank Deposit Programs”) offered are 1) [**Dreyfus Insured Deposits (DIDI)**](https://www.joinarc.com/<https:/www.dreyfus.com/sitelets/insured-deposits/dreyfus-insured-deposit-program-i-didi.html>) and 2) [**Liquid Insured Deposits**](https://www.joinarc.com/<https:/www.pershing.com/us/en/rates.html>). Funds deposited into each sweep program, in aggregate, are eligible for up to $2,500,000 of FDIC insurance. The sweep programs can be configured so that once the funds reach one or more Program Banks (up to $250,000 for each insurable capacity at up to ten Program Banks), then the next Bank Deposit Program will be initiated. Although certain types of accounts, such as trust accounts may be eligible for additional FDIC insurance based on the number of beneficiaries, funds will be allocated to each Program Bank in such a way that provides up to $250,000 of FDIC insurance for individual accounts and $250,000 of FDIC insurance for trust and other corporate account types, in each case per Program Bank. If clients elect to exclude one or more Program Banks from receiving deposits, the amount of FDIC insurance available through the Arc Treasury account may be lower. Clients are responsible for monitoring their total assets at each Program Bank, including existing deposits held at Program Banks outside of the Arc Treasury account, to ensure FDIC insurance limits are not exceeded, which could result in some funds being uninsured. For more information on FDIC insurance please visit [**http://www.fdic.gov/**](https://www.joinarc.com/<http:/www.fdic.gov/>). Deposits held in Program Banks are not protected by SIPC. \\n**For financial accounts provided by Stripe (“Business,” “Wallet,” and “Reserve” accounts):** Business, Wallet, and Reserve accounts are eligible for FDIC pass-through deposit insurance if they meet certain requirements. The accounts are eligible only to the extent pass-through insurance is permitted by the rules and regulations of the FDIC, and if the requirements for pass-through insurance are satisfied. The FDIC insurance applies up to 250,000 USD per depositor, per financial institution, for deposits held in the same type of account. Neither Stripe nor Arc is an FDIC-insured institution. The FDIC’s deposit insurance coverage only protects against the failure of an FDIC-insured depository institution.\\nYield paid by Arc related to cash balances held in Stripe accounts is subject to change over time without notice based on prevailing market conditions. Today\\'s yield rates reflect the Annual Percentage Yield (APY) paid by Arc to customers, where payments are completed on a monthly basis according to daily cash balances held over the prior calendar month.\\n**Arc Capital Markets and Arc Intelligence** are products of Arc Technologies, Inc.\\n**Screen images for illustration purposes only** All user experience screenshots and screen images provided are for illustrative purposes only and any performance figures displayed should not be considered representative of actual performance.\\n[1](https://www.joinarc.com/<#disclaimer-1>)\\nUp to $5,000,000 FDIC insurance eligibility available through the cash sweep products available through your Arc Treasury account (by Arc Advisory LLC or Atomic Invest LLC, through a clearing relationship with Pershing LLC). For more cash sweep details, including member bank information for each offering, see the “Cash Sweep Program” section of Arc’s [ _General Disclosures_](https://www.joinarc.com/<https:/www.joinarc.com/general-disclosures>).\\n[2](https://www.joinarc.com/<#disclaimer-2>)\\nReflects yield net of fees on fixed income investments within the Arc Treasury account (e.g., Treasury Bills and Money Market Funds) for companies on Arc\\'s Premium plan (unless otherwise noted) based on market rates as of the most recent business day. See [**Investment Options**](https://www.joinarc.com/<https:/www.joinarc.com/treasury-investment-options>) page for breakdown of investment options, gross market yields, and associated pricing on the Arc Treasury account.\\nTreasury Bill (\"T-Bill\") yield is an annualized T-Bill rate when held to maturity. The rate shown is subject to price fluctuation and is net of fees. T-Bills are purchased at a discount to par (par= $1,000), with the price being subject to market fluctuation. The amount of T-Bills available at a particular yield will depend upon the sellers’ offer size; any remaining cash balance after the purchase may not earn the same yield. In general the bond market is volatile, and fixed income securities carry interest rate risk. Fixed income securities are subject to increased loss of principal during periods of rising interest rates. Fixed income securities also carry other risks, including inflation risk, liquidity risk, call risk, and credit and default risks for both issuers and counterparties.\\nThe SEC yield for a money market fund is calculated by annualizing its daily income distributions for the previous 7 days. You should consider the investment objectives, risks, charges, and expenses of a money market fund carefully before investing. This and other information is found in the fund’s prospectus. Please read the prospectus before investing. An investment in a money market fund is not insured or guaranteed by the Federal Deposit Insurance Corporation or any other government agency. Although a money market fund seeks to preserve the value of your investment at $1.00 per share, it is possible to lose money by investing in a money market fund. Yields fluctuate and past performance is no guarantee of future results.\\n[3](https://www.joinarc.com/<#disclaimer-3>)\\nFinancial partners for Arc’s accounts include Fifth Third Bank, Member FDIC (“Business” account, provided by Stripe Payments Company), Arc Advisory LLC or Atomic Invest LLC (“Treasury” account, with brokerage accounts provided by Atomic Brokerage LLC and Pershing Advisor Solutions, respectively; custodial and clearing services provided by Pershing LLC, a BNY Mellon company), and Evolve Bank & Trust (“Wallet” and “Reserve” accounts, provided by Stripe Payments Company). Cash sweep offerings are available through the Treasury account (cash sweep products offered by Arc Advisory LLC or Atomic Invest LLC through a clearing relationship with Pershing LLC), with funds held across dozens of FDIC member banks. For more cash sweep details, including member bank information for each offering, see the “Cash Sweep Program” section of Arc’s [ _general disclosures_](https://www.joinarc.com/<https:/www.joinarc.com/general-disclosures>).\\n[4](https://www.joinarc.com/<#disclaimer-4>)\\nArc Global Treasury is only available to qualifying companies in select jurisdictions. Local restrictions and minimum requirements apply. U.K. applicants must qualify as high net worth companies—bodies corporate with either (i) 20+ members and at least £500,000 in called-up share capital or net assets; or (ii) £5 million in called-up share capital or net assets. Non-qualifying applicants should not apply.\\n[5](https://www.joinarc.com/<#disclaimer-5>)\\nBrokerage services for customers of Arc Advisory LLC are provided by Atomic Brokerage LLC, a registered broker-dealer and member of [FINRA](https://www.joinarc.com/<https:/www.finra.org/#/>) and [SIPC](https://www.joinarc.com/<https:/www.sipc.org/>). Brokerage services for Atomic Invest are provided by Pershing Advisor Solutions, a registered broker-dealer and member of [FINRA](https://www.joinarc.com/<https:/www.finra.org/#/>) and [SIPC](https://www.joinarc.com/<https:/www.sipc.org/>).\\n[6](https://www.joinarc.com/<#disclaimer-6>)\\nSpecific company experiences are unique to each company. They may not represent outcomes for other clients. Past performance does not guarantee future results.\\n[7](https://www.joinarc.com/<#disclaimer-7>)\\nFinancial analysis available through Arc Intelligence has been tested to a 99% accuracy standard on completed tasks in internal benchmark testing, including composite scores from replicated trials. Production performance depends on data inputs and may vary.\\n[](https://www.joinarc.com/</>)\\n[Download logo](https://www.joinarc.com/<https:/storage.googleapis.com/website-cms-uploads/logos_0007f577c9/logos_0007f577c9.zip?updated_at=2022-08-15T15:23:07.427Z>)[Download media kit](https://www.joinarc.com/<https:/storage.googleapis.com/website-cms-uploads/arc_media_kit_3cd8c15e6c/arc_media_kit_3cd8c15e6c.zip?updated_at=2022-08-15T15:20:36.100Z>)\\nProducts\\n  * [Cash Management ](https://www.joinarc.com/</operating>)\\n  * [Treasury ](https://www.joinarc.com/</treasury>)\\n  * [Global Treasury ](https://www.joinarc.com/</global-treasury>)\\n  * [Capital Markets ](https://www.joinarc.com/</capital-markets>)\\n  * [Working Capital ](https://www.joinarc.com/</working-capital>)\\n  * [Venture Debt ](https://www.joinarc.com/</venture-debt>)\\n  * [Arc Intelligence ](https://www.joinarc.com/</ai>)\\n\\n\\nCompany\\n  * [About ](https://www.joinarc.com/</about>)\\n  * [Careers ](https://www.joinarc.com/</careers>)\\n  * [Case Studies ](https://www.joinarc.com/</case-studies>)\\n  * [Contact Us ](https://www.joinarc.com/</contact>)\\n  * [Newsroom ](https://www.joinarc.com/</newsroom>)\\n  * [Media Kit ](https://www.joinarc.com/</media-kit>)\\n\\n\\nResources\\n  * [Blog ](https://www.joinarc.com/</blog>)\\n  * [Startup Encyclopedia ](https://www.joinarc.com/</encyclopedia>)\\n  * [Funding Calculator ](https://www.joinarc.com/</calculator>)\\n  * [Learning Center ](https://www.joinarc.com/</learning-center>)\\n  * [Pricing ](https://www.joinarc.com/</pricing>)\\n  * [Guides ](https://www.joinarc.com/</guides>)\\n\\n\\nSign up for Newsletter\\nEmailJoin Newsletter\\n© 2025 Arc Technologies Inc. All rights reserved.\\n[General Disclosures](https://www.joinarc.com/</general-disclosures>)[Terms of Use](https://www.joinarc.com/</terms-of-use>)[Privacy Policy](https://www.joinarc.com/</privacy>)[Referral Agreement](https://www.joinarc.com/</referral-agreement>)Cookies\\n[](https://www.joinarc.com/<https:/twitter.com/join_arc> \"Twitter\")\\n[](https://www.joinarc.com/<https:/www.linkedin.com/company/join-arc/> \"LinkedIn\")\\n[](https://www.joinarc.com/<https:/www.instagram.com/join_arc/> \"Instagram\")\\n' markdown_with_citations='Products\\n  * Cash Management⟨1⟩\\n  * Treasury⟨2⟩\\n  * Global Treasury⟨3⟩\\n  * Capital Markets⟨4⟩\\n  * Working Capital⟨5⟩\\n  * Venture Debt⟨6⟩\\n  * Arc Intelligence ⟨7⟩\\n\\n\\nCompany\\n  * 2023 Recap⟨8⟩\\n  * Pricing⟨9⟩\\n  * Investment Options⟨10⟩\\n  * About Arc⟨11⟩\\n  * Careers⟨12⟩\\n  * Case Studies⟨13⟩\\n  * Contact⟨14⟩\\n  * Media Kit⟨15⟩\\n  * News Room⟨16⟩\\n  * Partner Benefits⟨17⟩\\n\\n\\nResources\\n  * Blog⟨18⟩\\n  * The Startup Encyclopedia ⟨19⟩\\n  * Calculator⟨20⟩\\n  * Learning Center⟨21⟩\\n  * Guides⟨22⟩\\n\\n\\nLog in⟨23⟩Get started⟨24⟩\\nIntroducing Arc Intelligence — The First AI Platform For Private Credit • Learn More ⟨7⟩\\n[](https://www.joinarc.com/</>)\\nDownload logo⟨25⟩Download media kit⟨26⟩\\n  * Cash Management⟨1⟩\\n  * Treasury⟨2⟩\\n  * Capital Markets⟨4⟩\\nArc IntelligenceExplore the first AI Analyst for private credit.⟨7⟩\\n  * Pricing⟨9⟩\\nPricingFind everything you need to know about features, fees, and yield with Arc, so you can save time and make informed decisions.⟨9⟩\\nTreasury Investment OptionsView the options available today within your Treasury account held at BNY Mellon Pershing, along with their gross market APYs.⟨10⟩\\n  * Company⟨11⟩\\nAboutArc is the future of finance providing software startups with the customized financial products they deserve.⟨11⟩\\nCareersJoin us in reinventing the future of finance for startups.⟨12⟩\\nMedia KitHelpful information about our product, our traction and our team. ⟨15⟩\\nNews RoomBrowse recent press releases and media coverage finance for startups.⟨16⟩\\nPartner Benefits Discover discounts on essential business software to help you grow.⟨17⟩\\n\\n\\n  * Log in⟨23⟩\\n  * Get started⟨24⟩\\n\\n\\n# Capital management for ambitious businesses\\nManage finances, generate yield, and secure funding. All with Arc.\\nGet started⟨24⟩Book a demo⟨27⟩\\n![Treasury Dashboard⟨28⟩]\\n# Cash Management essentials built for scale\\n![⟨29⟩Cash ManagementManage everyday business financesUnlimited free wires, ACH, and cards empower CFOs to operate their business with confidence.Learn more](https://www.joinarc.com/</operating>)\\n![⟨30⟩TreasuryGenerate yield with a Treasury accountInvest in Money Market Funds and Treasury Bills that earn up to 4.45%² net yield.Learn more](https://www.joinarc.com/</treasury>)\\n![⟨31⟩Capital MarketsOutsource your debt raise with ArcLeverage Arc to find and negotiate a customized debt solution on your behalf.Learn more](https://www.joinarc.com/</capital-markets>)\\n# Enterprise-grade security and support comes standard\\n![](https://storage.googleapis.com/website-cms-uploads/bank_security_b36d154564/bank_security_b36d154564.png)\\nBuilt with security in mind\\nProtect your Arc account and financial data with multi-factor authentication and granular employee permissions.\\n![](https://storage.googleapis.com/website-cms-uploads/frictionless_experience_e9e67a006e/frictionless_experience_e9e67a006e.png)\\nFrictionless experience\\nApplying for an Arc account takes minutes and once approved, access all the cash management essentials in one platform.\\n![](https://storage.googleapis.com/website-cms-uploads/support_b5f7f90e15/support_b5f7f90e15.png)\\nWhite-glove support\\nArc offers around the clock support to answer your most pressing questions and propel your business forward.\\n![James Slezak, CEO & Founder of Swayable portrait⟨32⟩]\\n#### Arc is the future of cash management for Silicon Valley. Swayable received multiple Venture Debt term sheets in days with Arc’s AI-powered Capital platform. We instantly deposited the funds into our Arc account, putting cash management on autopilot while earning market leading APY and the protection of the world’s largest banks.\\n— James Slezak, CEO & Founder of Swayable\\n## Get access to the capital and cash management experience built for scale.\\nAll without minimums and usage-based fees.\\nGet started⟨24⟩\\n**Arc is a financial technology company, not a bank.**\\n**Arc partners with**** _Stripe Payments Company_**⟨33⟩**for money transmission services and account services.** “Business” accounts are financial accounts provided by Stripe Payments Company with funds held at Fifth Third Bank, Member FDIC; \"Wallet\" and \"Reserve\" accounts are financial accounts provided by Stripe Payments Company with funds held at Evolve Bank & Trust, Member FDIC.\\nArc cards are issued by Celtic Bank and serviced by Stripe, Inc. and its affiliate Stripe Servicing, Inc.\\n**For Arc “Treasury” accounts, investment advisory services are provided by Arc Advisory LLC (“Arc Advisory”) or Atomic Invest LLC (“Atomic Invest”).**\\nFor Arc Treasury accounts with advisory services provided by Arc Advisory LLC: \\nArc Advisory is an SEC-registered investment advisor. Technology services may be provided by Arc Technologies, Inc. For more details about Arc Advisory, please see the  _Form ADV and Wrap Fee Disclosure Brochure_⟨34⟩ and  _Privacy Policy_⟨35⟩.\\nArc Advisory LLC has an engagement with Atomic Brokerage LLC (“Atomic Brokerage”), a registered broker-dealer and member of FINRA⟨36⟩ and SIPC,⟨37⟩ to bring you the opportunity to open a brokerage account. Brokerage services for customers of Arc Advisory LLC are provided by Atomic Brokerage. For more details about Atomic Brokerage, please see the  _Form CRS_⟨38⟩ _,_ the Atomic Brokerage  _General Disclosures_⟨39⟩ , and the  _Privacy Policy_⟨40⟩. Check the background of Atomic Brokerage on FINRA’s  _BrokerCheck_⟨41⟩. Fees such as regulatory fees, transaction fees, fund expenses, brokerage commissions and services fees may apply to your brokerage account.\\nFor Arc Treasury accounts with advisory services provided by Atomic Invest LLC⟨42⟩:\\nArc has an engagement with Atomic Invest LLC (“Atomic Invest”), an SEC-registered investment adviser, to bring you the opportunity to open an investment advisory account. Investment advisory services are provided by Atomic Invest. Companies which are engaged by Atomic Invest receive compensation of 0% to 0.85% annualized, payable monthly, based upon assets under management for each referred client who establishes an account with Atomic Invest (i.e., exact payment will differ). Atomic Invest also shares a percentage of compensation received from margin interest and free cash interest earned by customers with Arc. Arc is not a client of Atomic Invest, but our engagement with Atomic Invest gives us an incentive to refer you to Atomic Invest instead of another investment adviser. This conflict of interest affects our ability to provide you with unbiased, objective information about the services of Atomic Invest. This could mean that the services of another investment adviser with whom we are not engaged could be more appropriate for you than Atomic Invest. For more details about Atomic Invest, please see their Form CRS⟨38⟩, Form ADV Part 2A⟨43⟩, the Privacy Policy⟨40⟩, and other disclosures. Brokerage services for Atomic Invest are provided by Pershing Advisor Solutions LLC, a registered broker-dealer and member of FINRA⟨36⟩ and SIPC⟨37⟩. \\nNone of Arc Advisory, Atomic Invest, Atomic Brokerage, or any of their affiliates, are a bank. Investments in securities are Not FDIC insured, Not Bank Guaranteed, and May Lose Value. Investing involves risk, including the possible loss of principal. Before investing, consider your investment objectives and the fees and expenses charged. Advisory services are designed to assist clients in achieving a favorable outcome in their investment portfolio. They are not intended to provide tax advice or financial planning with respect to every aspect of a client’s financial situation and do not include investments that clients may hold outside of their Arc Treasury account.\\nCustodial and clearing services for all Arc Treasury accounts are provided by Pershing LLC, a BNY Mellon company. Technology services may be provided by AtomicVest, Inc. \\n**Cash Sweep Program**\\nFor Arc Treasury Accounts with Arc Advisory or Atomic Invest, Pershing LLC (“Pershing”) offers a cash sweep program. Funds in transit to or from Program Banks are generally not FDIC-insured. The Sweep Program is administered by Pershing LLC. Deposits at each Program Bank are insured by the FDIC up to $250,000 for each insurable capacity. Based on eligibility criteria, the two FDIC-insured programs (“Bank Deposit Programs”) offered are 1) **Dreyfus Insured Deposits (DIDI)**⟨44⟩ and 2) **Liquid Insured Deposits**⟨45⟩. Funds deposited into each sweep program, in aggregate, are eligible for up to $2,500,000 of FDIC insurance. The sweep programs can be configured so that once the funds reach one or more Program Banks (up to $250,000 for each insurable capacity at up to ten Program Banks), then the next Bank Deposit Program will be initiated. Although certain types of accounts, such as trust accounts may be eligible for additional FDIC insurance based on the number of beneficiaries, funds will be allocated to each Program Bank in such a way that provides up to $250,000 of FDIC insurance for individual accounts and $250,000 of FDIC insurance for trust and other corporate account types, in each case per Program Bank. If clients elect to exclude one or more Program Banks from receiving deposits, the amount of FDIC insurance available through the Arc Treasury account may be lower. Clients are responsible for monitoring their total assets at each Program Bank, including existing deposits held at Program Banks outside of the Arc Treasury account, to ensure FDIC insurance limits are not exceeded, which could result in some funds being uninsured. For more information on FDIC insurance please visit **http://www.fdic.gov/**⟨46⟩. Deposits held in Program Banks are not protected by SIPC. \\n**For financial accounts provided by Stripe (“Business,” “Wallet,” and “Reserve” accounts):** Business, Wallet, and Reserve accounts are eligible for FDIC pass-through deposit insurance if they meet certain requirements. The accounts are eligible only to the extent pass-through insurance is permitted by the rules and regulations of the FDIC, and if the requirements for pass-through insurance are satisfied. The FDIC insurance applies up to 250,000 USD per depositor, per financial institution, for deposits held in the same type of account. Neither Stripe nor Arc is an FDIC-insured institution. The FDIC’s deposit insurance coverage only protects against the failure of an FDIC-insured depository institution.\\nYield paid by Arc related to cash balances held in Stripe accounts is subject to change over time without notice based on prevailing market conditions. Today\\'s yield rates reflect the Annual Percentage Yield (APY) paid by Arc to customers, where payments are completed on a monthly basis according to daily cash balances held over the prior calendar month.\\n**Arc Capital Markets and Arc Intelligence** are products of Arc Technologies, Inc.\\n**Screen images for illustration purposes only** All user experience screenshots and screen images provided are for illustrative purposes only and any performance figures displayed should not be considered representative of actual performance.\\n1⟨47⟩\\nUp to $5,000,000 FDIC insurance eligibility available through the cash sweep products available through your Arc Treasury account (by Arc Advisory LLC or Atomic Invest LLC, through a clearing relationship with Pershing LLC). For more cash sweep details, including member bank information for each offering, see the “Cash Sweep Program” section of Arc’s  _General Disclosures_⟨48⟩.\\n2⟨49⟩\\nReflects yield net of fees on fixed income investments within the Arc Treasury account (e.g., Treasury Bills and Money Market Funds) for companies on Arc\\'s Premium plan (unless otherwise noted) based on market rates as of the most recent business day. See **Investment Options**⟨50⟩ page for breakdown of investment options, gross market yields, and associated pricing on the Arc Treasury account.\\nTreasury Bill (\"T-Bill\") yield is an annualized T-Bill rate when held to maturity. The rate shown is subject to price fluctuation and is net of fees. T-Bills are purchased at a discount to par (par= $1,000), with the price being subject to market fluctuation. The amount of T-Bills available at a particular yield will depend upon the sellers’ offer size; any remaining cash balance after the purchase may not earn the same yield. In general the bond market is volatile, and fixed income securities carry interest rate risk. Fixed income securities are subject to increased loss of principal during periods of rising interest rates. Fixed income securities also carry other risks, including inflation risk, liquidity risk, call risk, and credit and default risks for both issuers and counterparties.\\nThe SEC yield for a money market fund is calculated by annualizing its daily income distributions for the previous 7 days. You should consider the investment objectives, risks, charges, and expenses of a money market fund carefully before investing. This and other information is found in the fund’s prospectus. Please read the prospectus before investing. An investment in a money market fund is not insured or guaranteed by the Federal Deposit Insurance Corporation or any other government agency. Although a money market fund seeks to preserve the value of your investment at $1.00 per share, it is possible to lose money by investing in a money market fund. Yields fluctuate and past performance is no guarantee of future results.\\n3⟨51⟩\\nFinancial partners for Arc’s accounts include Fifth Third Bank, Member FDIC (“Business” account, provided by Stripe Payments Company), Arc Advisory LLC or Atomic Invest LLC (“Treasury” account, with brokerage accounts provided by Atomic Brokerage LLC and Pershing Advisor Solutions, respectively; custodial and clearing services provided by Pershing LLC, a BNY Mellon company), and Evolve Bank & Trust (“Wallet” and “Reserve” accounts, provided by Stripe Payments Company). Cash sweep offerings are available through the Treasury account (cash sweep products offered by Arc Advisory LLC or Atomic Invest LLC through a clearing relationship with Pershing LLC), with funds held across dozens of FDIC member banks. For more cash sweep details, including member bank information for each offering, see the “Cash Sweep Program” section of Arc’s  _general disclosures_⟨48⟩.\\n4⟨52⟩\\nArc Global Treasury is only available to qualifying companies in select jurisdictions. Local restrictions and minimum requirements apply. U.K. applicants must qualify as high net worth companies—bodies corporate with either (i) 20+ members and at least £500,000 in called-up share capital or net assets; or (ii) £5 million in called-up share capital or net assets. Non-qualifying applicants should not apply.\\n5⟨53⟩\\nBrokerage services for customers of Arc Advisory LLC are provided by Atomic Brokerage LLC, a registered broker-dealer and member of FINRA⟨36⟩ and SIPC⟨37⟩. Brokerage services for Atomic Invest are provided by Pershing Advisor Solutions, a registered broker-dealer and member of FINRA⟨36⟩ and SIPC⟨37⟩.\\n6⟨54⟩\\nSpecific company experiences are unique to each company. They may not represent outcomes for other clients. Past performance does not guarantee future results.\\n7⟨55⟩\\nFinancial analysis available through Arc Intelligence has been tested to a 99% accuracy standard on completed tasks in internal benchmark testing, including composite scores from replicated trials. Production performance depends on data inputs and may vary.\\n[](https://www.joinarc.com/</>)\\nDownload logo⟨25⟩Download media kit⟨26⟩\\nProducts\\n  * Cash Management ⟨1⟩\\n  * Treasury ⟨2⟩\\n  * Global Treasury ⟨3⟩\\n  * Capital Markets ⟨4⟩\\n  * Working Capital ⟨5⟩\\n  * Venture Debt ⟨6⟩\\n  * Arc Intelligence ⟨7⟩\\n\\n\\nCompany\\n  * About ⟨11⟩\\n  * Careers ⟨12⟩\\n  * Case Studies ⟨13⟩\\n  * Contact Us ⟨14⟩\\n  * Newsroom ⟨16⟩\\n  * Media Kit ⟨15⟩\\n\\n\\nResources\\n  * Blog ⟨18⟩\\n  * Startup Encyclopedia ⟨19⟩\\n  * Funding Calculator ⟨20⟩\\n  * Learning Center ⟨21⟩\\n  * Pricing ⟨9⟩\\n  * Guides ⟨22⟩\\n\\n\\nSign up for Newsletter\\nEmailJoin Newsletter\\n© 2025 Arc Technologies Inc. All rights reserved.\\nGeneral Disclosures⟨56⟩Terms of Use⟨57⟩Privacy Policy⟨58⟩Referral Agreement⟨59⟩Cookies\\n[](https://www.joinarc.com/<https:/twitter.com/join_arc> \"Twitter\")\\n[](https://www.joinarc.com/<https:/www.linkedin.com/company/join-arc/> \"LinkedIn\")\\n[](https://www.joinarc.com/<https:/www.instagram.com/join_arc/> \"Instagram\")\\n' references_markdown='\\n\\n## References\\n\\n⟨1⟩ https://www.joinarc.com/</operating>: Cash Management\\n⟨2⟩ https://www.joinarc.com/</treasury>: Treasury\\n⟨3⟩ https://www.joinarc.com/</global-treasury>: Global Treasury\\n⟨4⟩ https://www.joinarc.com/</capital-markets>: Capital Markets\\n⟨5⟩ https://www.joinarc.com/</working-capital>: Working Capital\\n⟨6⟩ https://www.joinarc.com/</venture-debt>: Venture Debt\\n⟨7⟩ https://www.joinarc.com/</ai>: Arc Intelligence \\n⟨8⟩ https://www.joinarc.com/<https:/2023.arc.tech/>: 2023 Recap\\n⟨9⟩ https://www.joinarc.com/</pricing>: Pricing\\n⟨10⟩ https://www.joinarc.com/</treasury-investment-options>: Investment Options\\n⟨11⟩ https://www.joinarc.com/</about>: About Arc\\n⟨12⟩ https://www.joinarc.com/</careers>: Careers\\n⟨13⟩ https://www.joinarc.com/</case-studies>: Case Studies\\n⟨14⟩ https://www.joinarc.com/</contact>: Contact\\n⟨15⟩ https://www.joinarc.com/</media-kit>: Media Kit\\n⟨16⟩ https://www.joinarc.com/</newsroom>: News Room\\n⟨17⟩ https://www.joinarc.com/</partners>: Partner Benefits\\n⟨18⟩ https://www.joinarc.com/</blog>: Blog\\n⟨19⟩ https://www.joinarc.com/</encyclopedia>: The Startup Encyclopedia \\n⟨20⟩ https://www.joinarc.com/</calculator>: Calculator\\n⟨21⟩ https://www.joinarc.com/</learning-center>: Learning Center\\n⟨22⟩ https://www.joinarc.com/</guides>: Guides\\n⟨23⟩ https://www.joinarc.com/<https:/app.joinarc.com/login>: Log in\\n⟨24⟩ https://www.joinarc.com/<https:/app.joinarc.com/signup>: Get started\\n⟨25⟩ https://www.joinarc.com/<https:/storage.googleapis.com/website-cms-uploads/logos_0007f577c9/logos_0007f577c9.zip?updated_at=2022-08-15T15:23:07.427Z>: Download logo\\n⟨26⟩ https://www.joinarc.com/<https:/storage.googleapis.com/website-cms-uploads/arc_media_kit_3cd8c15e6c/arc_media_kit_3cd8c15e6c.zip?updated_at=2022-08-15T15:20:36.100Z>: Download media kit\\n⟨27⟩ https://www.joinarc.com/<https:/calendly.com/client-team-7r_e/learn-about-arc>: Book a demo\\n⟨28⟩ https://storage.googleapis.com/website-cms-uploads/business_account_2024_new_1db4c7e46b/business_account_2024_new_1db4c7e46b.png: Treasury Dashboard\\n⟨29⟩ https://storage.googleapis.com/website-cms-uploads/operating_29e413f682/operating_29e413f682.png: ![\\n⟨30⟩ https://storage.googleapis.com/website-cms-uploads/treasury_96bba9781e/treasury_96bba9781e.png: ![\\n⟨31⟩ https://storage.googleapis.com/website-cms-uploads/debt_capital_slider_e50ddf2cd9/debt_capital_slider_e50ddf2cd9.png: ![\\n⟨32⟩ https://storage.googleapis.com/website-cms-uploads/james_12e6021488/james_12e6021488.jpg: James Slezak, CEO & Founder of Swayable portrait\\n⟨33⟩ https://www.joinarc.com/<https:/stripe.com>: ** _Stripe Payments Company_**\\n⟨34⟩ https://www.joinarc.com/<https:/adviserinfo.sec.gov/firm/brochure/330258>:  _Form ADV and Wrap Fee Disclosure Brochure_\\n⟨35⟩ https://www.joinarc.com/<https:/vault.pactsafe.io/s/302d718c-fd8b-4f36-8743-b75c207b8fac/legal.html#arc-privacy-policy>:  _Privacy Policy_\\n⟨36⟩ https://www.joinarc.com/<https:/www.finra.org/#/>: FINRA\\n⟨37⟩ https://www.joinarc.com/<https:/www.sipc.org/>: SIPC,\\n⟨38⟩ https://www.joinarc.com/<https:/reports.adviserinfo.sec.gov/crs/crs_313255.pdf>:  _Form CRS_\\n⟨39⟩ https://www.joinarc.com/<https:/legal.atomicvest.com/usa.broker.disclosures.003464f3-f6bd-41c3-bbdf-7050e50b43a2.pdf>: Atomic Brokerage  _General Disclosures_\\n⟨40⟩ https://www.joinarc.com/<https:/legal.atomicvest.com/usa.privacy.de3d0277-78f7-4741-9e9f-755f6b4f03ba.pdf>:  _Privacy Policy_\\n⟨41⟩ https://www.joinarc.com/<https:/brokercheck.finra.org/>:  _BrokerCheck_\\n⟨42⟩ https://www.joinarc.com/<https:/legal.atomicvest.com/usa.disclosures.e1dc8c5c-1742-453e-9157-51e09deee88b.pdf>: Atomic Invest LLC\\n⟨43⟩ https://www.joinarc.com/<https:/files.adviserinfo.sec.gov/IAPD/Content/Common/crd_iapd_Brochure.aspx?BRCHR_VRSN_ID=863222>: Form ADV Part 2A\\n⟨44⟩ https://www.joinarc.com/<https:/www.dreyfus.com/sitelets/insured-deposits/dreyfus-insured-deposit-program-i-didi.html>: **Dreyfus Insured Deposits (DIDI)**\\n⟨45⟩ https://www.joinarc.com/<https:/www.pershing.com/us/en/rates.html>: **Liquid Insured Deposits**\\n⟨46⟩ https://www.joinarc.com/<http:/www.fdic.gov/>: **http://www.fdic.gov/**\\n⟨47⟩ https://www.joinarc.com/<#disclaimer-1>: 1\\n⟨48⟩ https://www.joinarc.com/<https:/www.joinarc.com/general-disclosures>:  _General Disclosures_\\n⟨49⟩ https://www.joinarc.com/<#disclaimer-2>: 2\\n⟨50⟩ https://www.joinarc.com/<https:/www.joinarc.com/treasury-investment-options>: **Investment Options**\\n⟨51⟩ https://www.joinarc.com/<#disclaimer-3>: 3\\n⟨52⟩ https://www.joinarc.com/<#disclaimer-4>: 4\\n⟨53⟩ https://www.joinarc.com/<#disclaimer-5>: 5\\n⟨54⟩ https://www.joinarc.com/<#disclaimer-6>: 6\\n⟨55⟩ https://www.joinarc.com/<#disclaimer-7>: 7\\n⟨56⟩ https://www.joinarc.com/</general-disclosures>: General Disclosures\\n⟨57⟩ https://www.joinarc.com/</terms-of-use>: Terms of Use\\n⟨58⟩ https://www.joinarc.com/</privacy>: Privacy Policy\\n⟨59⟩ https://www.joinarc.com/</referral-agreement>: Referral Agreement\\n' fit_markdown='' fit_html=''",
  "generated_description": "**Arc: Elevating Startup Banking**\n\nFounded in 2021 and based in San Francisco, Arc is on a mission to revolutionize banking and funding for startups. Operating under the umbrella of Y Combinator’s Batch W22, Arc simplifies financial management, offering a suite of robust tools for modern businesses. Backed by notable investors such as Left Lane Capital, NFX, Bain Capital Ventures, Clocktower Technology Ventures, Torch Capital, and Y Combinator itself, the company is built to empower ambitious startups in navigating their financial needs.\n\n### What Does Arc Offer?\n\nArc combines banking and funding functionalities in one platform, enabling startups to:\n- **Manage cash efficiently** through products like Cash Management, Treasury, and Global Treasury. \n- **Access non-dilutive financing options** such as Venture Debt and customized Capital Markets solutions.\n- **Gain insights** with Arc Intelligence, an AI-driven tool for private credit analysis.\n\n### Key Features\n- **Cash Management**: Unlimited free wires, ACH transfers, and cards for seamless financial operations.\n- **Treasury Accounts**: Investment options that allow startups to earn up to 4.45% net yield on deposits through Money Market Funds and Treasury Bills.\n- **24/7 Support**: Arc promises white-glove service to assist businesses at critical junctures.\n\n### The Team\nWith a dedicated team of 40 people, Arc is guided by Group Partner Jared Friedman. Their focus on fintech, SaaS, and B2B solutions positions them at the heart of the startup ecosystem in the San Francisco Bay Area.\n\n### The Future of Startup Finance\nIn an era where financial operations can either propel a startup forward or hold it back, Arc stands out by offering crucial capabilities without burdensome minimum requirements or usage-based fees. The future looks promising, and for startups seeking a financial partner that understands their unique challenges, Arc is certainly one to watch.\n\nFor a deeper dive into their offerings or to get started, check out their [website](https://www.joinarc.com/) and embrace a new way to manage your startup's financial health."
}