{
  "links": "https://www.ycombinator.com/companies/askmyclass",
  "name": "AskMyClass",
  "headline": "Audio learning assistant for teachers and students.",
  "batch": "S18",
  "description": "AskMyClass, is a learning assistant that helps teachers save time and enhance learning, using smart speakers like Alexa, and help students get back-on-task quickly and build life skills through classroom management, social-emotional learning, and lesson support.",
  "activity_status": "Active",
  "website": "https://goaskmyclass.com/",
  "founded_date": 2017.0,
  "team_size": 2.0,
  "location": "Menlo Park, CA",
  "group_partner": null,
  "group_partner_yc": null,
  "company_linkedin": null,
  "company_twitter": null,
  "tags": "industry:ai-enhanced-learning; industry:education; location:san-francisco-bay-area",
  "founders": [
    {
      "name": "Aparna Ramanathan, Founder",
      "description": "Aparna worked for 11 years as a medical doctor in Australian hospitals. Moving to the U.S. in 2011, she provided accessible mental health support and stress management coaching to professional women. In 2016, using screen-free, low-cost voice technology, she began supporting children to build social and mental resilience skills. A year later, Aparna built an interactive mental health game on Alexa for the home and launched AskMyClass, to provide behavioral support for the PK-6 classroom.",
      "linkedin": "https://www.linkedin.com/in/2aparna/"
    },
    {
      "name": "Deeps Ramanathan, Founder",
      "description": "Engineer, Product and Marketing expert. Passionate about building product and marketing strategies that creates value for consumers and businesses, across digital, media, advertising, technology, and education. 8.5 years at Google. 8 years at IBM. 2 years at Twitter. 3 years building a YCombinator-backed AI and Voice startup called AskMyClass. 4 years of part-time consulting as an advisor.",
      "linkedin": "https://www.linkedin.com/in/2deeps"
    }
  ],
  "status": true,
  "markdown": "raw_markdown=\"![](https://goaskmyclass.com/)\\nEarly child development meets emerging voice technologies and AI\\nWhat if every child had a learning co-pilot to help support their social, emotional, and academic journey?\\nTEACHER ASSISTANT\\nAskMyClass\\nPioneering elementary teacher's assistant on Alexa called AskMyClass, now used by over 3000 teachers globally. Ask out loud for activities to build student focus, listening skills, SEL skills, and academic practice.\\nFOUNDATIONAL LITERACY\\nSound Town\\nUsing interactive voice technology on all smart devices to equitably help young children build pre-reading skills through playful micro-lessons both for the 3-4-year-olds at preschool and for the 40% at home.\\n[Learn more](https://goaskmyclass.com/<https:/www.mysoundtown.com>)\\n© Hoogalit Inc 2025.\\n![](https://d1muf25xaso8hp.cloudfront.net/https%3A%2F%2F6aeb048cfb65ebb44fc35e51851d738a.cdn.bubble.io%2Ff1618101231549x507012560946313660%2Fhoogalit-logo.png?w=192&h=32&auto=compress&fit=crop&dpr=1)\\n\" markdown_with_citations=\"![](https://goaskmyclass.com/)\\nEarly child development meets emerging voice technologies and AI\\nWhat if every child had a learning co-pilot to help support their social, emotional, and academic journey?\\nTEACHER ASSISTANT\\nAskMyClass\\nPioneering elementary teacher's assistant on Alexa called AskMyClass, now used by over 3000 teachers globally. Ask out loud for activities to build student focus, listening skills, SEL skills, and academic practice.\\nFOUNDATIONAL LITERACY\\nSound Town\\nUsing interactive voice technology on all smart devices to equitably help young children build pre-reading skills through playful micro-lessons both for the 3-4-year-olds at preschool and for the 40% at home.\\nLearn more⟨1⟩\\n© Hoogalit Inc 2025.\\n![](https://d1muf25xaso8hp.cloudfront.net/https%3A%2F%2F6aeb048cfb65ebb44fc35e51851d738a.cdn.bubble.io%2Ff1618101231549x507012560946313660%2Fhoogalit-logo.png?w=192&h=32&auto=compress&fit=crop&dpr=1)\\n\" references_markdown='\\n\\n## References\\n\\n⟨1⟩ https://goaskmyclass.com/<https:/www.mysoundtown.com>: Learn more\\n' fit_markdown='' fit_html=''",
  "generated_description": "### AskMyClass: Revolutionizing Learning with AI\n\n**Overview**  \nFounded in 2017 and hailing from the innovative ecosystem of Y Combinator (Batch S18), AskMyClass is an educational tech company based in Menlo Park, California. With a small team of two, they are on a mission to create an audio learning assistant that makes teaching and learning easier and more engaging.\n\n**What They Do**  \nAskMyClass leverages smart speaker technology—think Alexa—to function as a virtual teaching assistant. The platform is designed to help over 3000 teachers globally streamline their classroom management, enhance student focus, and facilitate social-emotional learning. By providing voice-activated activities and prompts, AskMyClass aims to keep students on-task and foster essential life skills.\n\nTheir secondary initiative, **Sound Town**, utilizes interactive voice technology to support early childhood literacy. It offers fun, micro-lessons aimed at preschoolers (ages 3-4) and children learning at home, helping them develop foundational reading skills in an engaging way.\n\n**Key Features**  \n- **Teacher's Assistant**: A pioneering tool available on Alexa that aids teachers with activities to improve students' attention, listening, and learning skills.\n- **Foundational Literacy**: Playful lessons for young learners that can be accessed via smart devices, promoting equitable educational opportunities.\n\n**Tagline**  \n“Early child development meets emerging voice technologies and AI.” \n\nFor more information and to explore their offerings, check out their website at [AskMyClass](https://goaskmyclass.com/).\n\n**Conclusion**  \nIn a world where technology continually shapes education, AskMyClass is at the forefront, providing tools that help teachers and students thrive. With a focus on audio learning and real-time engagement, they’re making strides to enhance educational experiences, one classroom at a time."
}