{
  "links": "https://www.ycombinator.com/companies/athenahq",
  "name": "AthenaHQ",
  "headline": "Get Your Brand Discovered on ChatGPT.",
  "batch": "W25",
  "description": "Make sure your brand doesn't get left behind by the paradigm shift from traditional search to generative search.\r\n\nAthenaHQ helps your brand get discovered on generative engines like ChatGPT, Perplexity, Claude, Gemini, and more.\r\n\nGenerative engine search is expected to overtake traditional search in the next 3 years. Currently, there is no de facto solution for managing a brand's perception on these generative engines. We are building AthenaHQ to fill that gap.\r\n\nTeam of former product manager on Google Search's information acquisition team, Deepmind Generative Media team, and ChatGPT superusers.",
  "activity_status": "Active",
  "website": "https://www.athenahq.ai",
  "founded_date": 2025.0,
  "team_size": 2.0,
  "location": "San Francisco",
  "group_partner": "Harj Taggar",
  "group_partner_yc": "https://www.ycombinator.com/people/harj-taggar",
  "company_linkedin": null,
  "company_twitter": null,
  "tags": "industry:analytics; industry:marketing; industry:ai; location:san-francisco-bay-area",
  "founders": [
    {
      "name": "Andrew Yan, Co-Founder, CEO",
      "description": "Co-founder AthenaHQ--helping brands get discovered on ChatGPT. Formerly @googlesearch @deepmind @usarmylab @columbia\n\nIn previous life, played in the band that inspired the Oscar-winning movie Whiplash.",
      "linkedin": "https://www.linkedin.com/in/andrew-yan-200"
    },
    {
      "name": "Alan Yao, Co-Founder",
      "description": "Co-founder & CTO at AthenaHQ",
      "linkedin": "https://linkedin.com/in/alanya0"
    }
  ],
  "status": true,
  "markdown": "raw_markdown='## Application error: a client-side exception has occurred (see the browser console for more information).\\n' markdown_with_citations='## Application error: a client-side exception has occurred (see the browser console for more information).\\n' references_markdown='\\n\\n## References\\n\\n' fit_markdown='' fit_html=''",
  "generated_description": "### AthenaHQ: Your Brand's Guide to the Generative Future\n\n**Mission**: AthenaHQ exists with a clear vision—to help brands get discovered on generative search engines like ChatGPT. As the digital landscape evolves, the company aims to ensure that brands don’t get lost in the shift from traditional search to the more advanced generative search technologies.\n\n**The Landscape**: With generative search expected to eclipse traditional search in the next few years, there’s a significant gap in the market. Brands need a strategy to manage their presence on platforms like ChatGPT, Claude, and Gemini, and AthenaHQ is stepping up to fill that void.\n\n**The Team**: Founded in 2025, AthenaHQ is powered by a small but experienced team based in San Francisco, featuring former product managers from teams at Google Search and DeepMind, along with ChatGPT enthusiasts. This blend of talent ensures that they have the insights and skills necessary to navigate the changing search paradigms.\n\n**Affiliation**: AthenaHQ is part of Y Combinator's Batch W25, giving them a springboard into the startup ecosystem and access to invaluable resources and mentorship.\n\n**Location and Size**: With a compact team of just two, AthenaHQ is lean and agile—traits that are crucial in the fast-paced tech landscape of the Bay Area.\n\n**Leadership**: They have the mentorship of Harj Taggar as their Group Partner, adding to the wealth of knowledge guiding the company.\n\n**Focus Areas**: AthenaHQ is centered around analytics, marketing, and AI, leveraging these fields to create innovative solutions that put brands at the forefront of generative search.\n\n**Why It Matters**: In a world rapidly moving towards generative technology, AthenaHQ recognizes that the ability to be discovered online is more critical than ever. With their expertise and focus, they are not just another startup; they are an essential partner for brands looking to thrive in the future of search.\n\nFor more insights and updates, check out their [website](https://www.athenahq.ai)."
}