{
  "links": "https://www.ycombinator.com/companies/atlas-3",
  "name": "Atlas",
  "headline": "Modern spend management & concierge.",
  "batch": "W19",
  "description": null,
  "activity_status": "Active",
  "website": "https://atlascard.com",
  "founded_date": 2022.0,
  "team_size": 25.0,
  "location": "San Francisco",
  "group_partner": "Dalton Caldwell",
  "group_partner_yc": "https://www.ycombinator.com/people/dalton-caldwell",
  "company_linkedin": null,
  "company_twitter": null,
  "tags": "industry:fintech; location:san-francisco-bay-area",
  "founders": [
    {
      "name": "Patrick Mrozowski, Founder",
      "description": "Co-founder of Atlas (fka Point)",
      "linkedin": "https://www.linkedin.com/in/patrickmrozowski/"
    },
    {
      "name": "Sid Parihar, Founder",
      "description": "-",
      "linkedin": null
    },
    {
      "name": "Kenan Pulak, Founder",
      "description": "Previously to founding Point - Founder of 2 startups in the Social & CRM space, 1st engineer at Motiv and Metal Pay, and 1st mobile engineer at The RealReal. Built & launched 7 production apps from scratch.",
      "linkedin": "https://www.linkedin.com/in/kenanpulak"
    }
  ],
  "status": true,
  "markdown": "raw_markdown='[ ](https://atlascard.com/</>) ![Atlas Runner](https://atlascard.com/assets/images/alex_loader.webp)\\n[ Request Invite ](https://atlascard.com/</request-invite>) [ Sign In To Atlas ](https://atlascard.com/<https:/app.atlascard.com/>)\\nYour key to the world. \\nAccess coveted dining, hotels, And events.† [ ](https://atlascard.com/<#top-content>)\\nWith Atlas, you can finally get tables at the hardest-to-book restaurants, find the perfect suite at the world’s best hotels, sit front row at sold-out concerts and sporting events—and much more. All seamlessly brought to you inside a card and app that’s as intuitive, as it is powerful. \\n[ Request Invite  ](https://atlascard.com/</request-invite>)\\nAtlas membership is invite-only. Join the waitlist and we’ll contact you if it’s a fit. \\n![An image of the moody interior dining space at Sartiano\\'s restaurant in New York City.](https://atlascard.com/assets/images/carousel-1-mobile.webp)\\nReserve exclusive tables at the world’s hottest restaurants.\\nSartiano’s, NYC\\n![An image of a tranquil indoor swimming pool and spa overlooking the Tokyo skyline at Aman Tokyo hotel in Tokyo, Japan.](https://atlascard.com/assets/images/carousel-2-mobile.webp)\\nBook stays from a selection of the world’s finest hotels.\\nAman Tokyo, Japan\\n![An image of a fast moving racing car blurring past at high speed at a Formula 1 racing event.](https://atlascard.com/assets/images/carousel-3-mobile.webp)\\nAttend today’s most exhilarating events with front-row access.\\nF1 Paddock Club\\nImpossible reservations made easy.\\nAtlas Dining\\nYou want to eat at great restaurants. So does everyone else. The difference is—you’ve got Atlas. Discover the hottest restaurants around town with Atlas Dining, and reserve your tables during peak hours.\\n![An image of the wooden sushi bar with minimalist design ready to serve guests at the restaurant ITO in New York City.](https://atlascard.com/assets/images/dining-mobile.webp)\\nITO\\nIto, NYC\\nNew York City\\nSet in downtown Manhattan and designed with a modern Japanese approach. The 16-seat Omakase counter is a space where Chef/owners Masa Ito and Kevin Kim share their inventive interpretation on traditional sushi. Carefully hand selected, the fish is flown in directly from Japan for the excellent course of nigiri. With appetizers like kampachi with yuzu chive oil or desserts like strawberry panna cotta. Book a table at ITO and more on Atlas.\\nDedicated Atlas Reservations\\nBook a table at the very best restaurants in NYC, LA, SF, Miami, and worldwide—directly inside Atlas app or by texting your Atlas concierge.¹\\nUp-And-Coming Recommendations\\nAtlas is always on top of the hottest dining spots in your city—so you can get early access to up-and-coming new restaurants that are still under the radar.\\nReserve Primetime Tables\\nGet reservations at a time that is ideal for you, instead of times that are too early or too late in the day, because that’s all that was available.²\\nLearn More About Atlas Dining\\nA world of options.\\nChoose from top restaurants in NYC, LA, SF, Miami, and more. All inside Atlas app. \\nFilter by location inside Atlas App.\\nBook in an instant.\\nNo need to navigate clunky reservation sites. You’re ready to go in just a couple of taps. \\nBook your table in seconds.\\nSee everything, all at once.\\nView or change your upcoming reservations inside Atlas app, right at your fingertips. \\nStay on top of upcoming reservations.\\nThink of it as an amuse-bouche.\\nWith hundreds of incredible restaurants to choose from, here are a few highlights to give you a sense of what’s in store. \\nSartiano’s\\nNew York, New York\\nHorses\\nLos Angeles, California\\nSons & Daughters\\nSan Francisco, California\\nCafé Chelsea\\nNew York, New York\\nMeduza Mediterrania\\nNew York, New York\\nFelix Trattoria\\nLos Angeles, California\\nIto\\nNew York, New York\\nSushi by Scratch\\nMiami, Florida\\nMother Wolf\\nLos Angeles, California\\nContessa\\nMiami, Florida\\nCecconi’s\\nLos Angeles, California\\nCucina Alba\\nNew York, New York\\nCotogna\\nSan Francisco, California\\nRaf’s\\nNew York, New York\\nFish Cheeks\\nNew York, New York\\nOlivetta\\nLos Angeles, California\\nCatch LA\\nLos Angeles, California\\nLure Fishbar\\nNew York, New York\\nCasa Madera\\nLos Angeles, California\\nSexy Fish\\nMiami, Florida\\nEstela\\nNew York, New York\\nCasa Cruz\\nNew York, New York\\nSushi by Scratch\\nLos Angeles, California\\nMila\\nMiami, Florida\\nWant to join Atlasas a dining partner? \\nIf you are a restaurant owner, and would like to partner with us, please contact us below. \\nBecome an Atlas Dining Partner –>\\nThe fastest way to your paradise.\\nAtlas Hotels\\nExperience the best way to book stays at the world’s finest hotels. Browse a curated selection in app, find your paradise, then book with points or preferred rates, for better deals than anywhere else.\\n![An image of a large pool of calm water situated inside a courtyard with exquisite Moorish architecture at The Oberoi hotel in Marrakech, Morocco.](https://atlascard.com/assets/images/hotels-mobile.webp)\\nThe Oberoi Marrakech\\nThe Oberoi, Marrakech, Morocco\\nMarrakech, Morocco\\nSet in Marrakech, 12 km from Yves Saint Laurent Museum, The Oberoi Marrakech offers accommodation with a restaurant, free private parking, free bikes and an outdoor swimming pool. Each accommodation at the 5-star hotel has garden views, and guests can enjoy access to a bar and to a garden. The hotel features an indoor pool, fitness centre, evening entertainment and a 24-hour front desk. Book The Oberoi Marrakech and more on Atlas.\\nCurated Luxury Hotels\\nChoose from a unique collection of the most decorated hotels in the world, with selections located in the top luxury travel destinations globally.\\nBook With Points\\nUse points you’ve earned with Atlas to book stays at incredible redemption rates, and get 3x points for every dollar spent on hotel bookings inside the app.³\\nFind a Room in Seconds\\nBooking with Atlas is a breeze—discover the destination, hotel, and room that’s just right for you inside Atlas app, and book your stay in (literal) seconds.\\nLearn More About Atlas Hotels\\nFind your vibe.\\nAtlas Hotels is made to explore. Swipe, tap, and filter by vibe to discover the destination that’s just right for you. \\nDiscover your next dream stay.\\nAdvanced search filters.\\nSearch by city, country, or even by a specific hotel property. \\nRefine your search for the perfect hotel. \\nBook with a single tap.\\nNo need to enter your Atlas card information—we’ve got that. Just find what you like, and book. \\nDesigned to get you on your way. Fast.\\nEverything in one place.\\nView all your relevant reservation information inside Atlas app in the days leading up to your trip. \\nStay on top of upcoming bookings.\\nThe greatest hotels in the world.\\nHere’s a quick preview of a few of the most popular properties on Atlas Hotels. \\n1 Hotel Hanalei Bay\\nKauai, Hawaii\\nAman Tokyo\\nTokyo, Japan\\nAmangiri\\nCanyon Point, Utah\\nBadrutt’s Palace Hotel\\nSt. Moritz, Switzerland\\nCheval Blanc Paris\\nParis, France\\nClaridge’s\\nLondon, United Kingdom\\nDorchester\\nLondon, United Kingdom\\nEquinox Hotel New York\\nNew York City, New York\\nFaena Hotel Miami Beach\\nMiami Beach, Florida\\nHôtel de Crillon A Rosewood Hotel\\nParis, France\\nHotel Fasano Rio de Janeiro\\nRio De Janeiro, Brazil\\nHotel Le Toiny\\nSt. Barths\\nMaroma, A Belmond Hotel, Riviera Maya\\nRiviera Maya, Mexico\\nMauna Lani, Auberge Resorts Collection\\nIsland of Hawai’i, Hawaii\\nMontage Big Sky\\nBig Sky, Montana\\nOne&Only Palmilla, Los Cabos\\nCabo, Mexico\\nParadero Todos Santos\\nTodos Santos, Mexico\\nPost Ranch Inn\\nBig Sur, California\\nRosewood São Paulo\\nSão Paulo, Brazil\\nSix Senses Rome\\nRome, Italy\\nThe Barcelona Edition\\nBarcelona, Spain\\nThe Beverly Hills Hotel\\nLos Angeles, California\\nThe Little Nell\\nAspen, Colorado\\nThe Maybourne Beverly Hills\\nLos Angeles, California\\nThe Oberoi Marrakech\\nMarrakech, Morocco\\nReady to find your next stay? \\n[ Request Invite –> ](https://atlascard.com/</request-invite>)\\nExperience the action up close.\\nAtlas Experiences\\nGet unique access to exclusive experiences, from backstage passes at sold-out concerts, to front-row seats at the biggest sporting events, all through one text to your Atlas concierge.\\n![An image of large crowds watching on-stage performances at Coachella festival, while the sun sets over Indio, California.](https://atlascard.com/assets/images/experiences-mobile.webp)\\nCoachella Artist Pass\\nCoachella Artist Pass, Indio\\nIndio, California\\nGet the exclusive Coachella Artist Pass and experience the largest music festival in the US with premium access. Move more freely within the festival grounds—with closer access to performances and more comfortable amenities. The Artist Pass offers the highest level of credentials available allowing access to all of the VIP areas, private viewing sections, exclusive entrances/exits, and golf carts behind the stages. Book this and more exclusive experiences with Atlas.\\nJust One Text Away\\nFrom securing event passes, to ensuring you have the best seats in the house, your Atlas concierge is just a text away to take care of it all for you.⁴\\nYour Favorite Sporting Events\\nCourtside at the US Open Tennis Championships, or the Paddock Club at a Formula 1 Grand Prix, name your event and Atlas can get you in.⁵\\nTickets to Sold-Out Concerts\\nFrom Coachella to sold-out concerts, get yourself into events that aren’t accessible to everyone—Atlas is there for you, so you can witness magic.⁶\\nBenefits to keep you moving.\\nAtlas Benefits\\nHassle-free travel, health and well-being, plus a whole range of other unique benefits, made for a faster and smoother life on the go—all part of Atlas membership.\\n![An image of a Blade helicopter flying past Verrazzano-Narrows Bridge during its usual route from JFK Airport to the Blade Heliport in Manhattan, New York City.](https://atlascard.com/assets/images/benefits-mobile.webp)\\nBLADE Airport\\nBLADE Airport, NYC\\nNew York City\\nSkip the traffic and arrive in minutes. Getting from NYC to airports in the area can take hours. Book a private BLADE helicopter to fly you from Manhattan to either JFK or EWR in 5 minutes. Atlas members get 5x points on every ride, a 7.5% discount, and the meet and greet service—a private SUV transfer to your terminal. Spend over $20,000 a month on Atlas and receive Blade Airport Pass—$100 off every ride, a companion pass, and rides starting at $95.\\nAtlas FlexPass\\nPlans can change last-minute—that’s why we created FlexPass—so you can change or cancel any flight booked with your Atlas card, and get reimbursed for any fees you incur up to $600 a year.⁷\\nBLADE Private Jets\\nGet 5x points, and 7.5% off, plus priority availability and waived card processing fees when you use Atlas to book a private jet charter with BLADE.⁸\\nBLADE Helicopter Rides\\nGet 5x points, and 7.5% off, plus meet & greet for airport transfers. Spend more than $20,000 per month with Atlas, and you’ll also receive a BLADE Airport Pass, which gets you $100 off every airport flight, a companion pass, and flights starting at $95 with your pass discount.⁹\\nLearn More About Benefits\\nOne place for all your benefits.\\nAccess all your membership benefits right inside the app.\\nSwipe through your benefits with ease.\\n![Atlas FlexPass](https://atlascard.com/assets/icons/AtlasFlexPass.svg) Atlas FlexPass\\nChange or cancel any flight for any reason, and Atlas will reimburse you for any incurred fees up to $600 a year.⁷\\n![Blade](https://atlascard.com/assets/icons/Blade.svg) BLADE Anywhere\\nGet 5x points, and 7.5% off, plus priority availability and waived card processing fees when you use Atlas to book a private jet charter with BLADE.⁸\\n![Blade](https://atlascard.com/assets/icons/Blade.svg) BLADE Airport\\nGet 5x points, and 7.5% off, plus meet & greet for airport transfers. Spend more than $20,000 per month with Atlas, and you’ll also receive a BLADE Airport Pass, which gets you $100 off every airport flight, a companion pass, and flights starting at $95 with your pass discount.⁹\\n![Erewhon Cafe](https://atlascard.com/assets/icons/Erewhon.svg) Erewhon\\nReceive complimentary access to Erewhon Cafe Annual Membership.¹⁷\\n![One Medical](https://atlascard.com/assets/icons/OneMedical.svg) One Medical\\nComplimentary $199 statement credit when you enroll for an annual membership with Atlas card.¹⁸\\n![Priority Pass](https://atlascard.com/assets/icons/PriorityPass.svg) Priority Pass\\nPriority Pass™ Select membership. Access over 1,300 airport lounges worldwide.¹⁹\\n![Future Personal Training](https://atlascard.com/assets/icons/FutureFitness.svg) Future\\n$300 in annual statement credits for Future personal training membership with your Atlas card.²⁰\\n![Tablet Hotels](https://atlascard.com/assets/icons/TabletHotels.svg) Tablet® Hotels\\nTablet® Plus hotels membership. Room upgrades, late checkout, complimentary dining and more.²¹\\n![Hertz](https://atlascard.com/assets/icons/Hertz.svg) Hertz\\nPriority service with Hertz Gold Plus. Complimentary upgrades and special savings on special models.²²\\n![Avis](https://atlascard.com/assets/icons/Avis.svg) Avis\\nAvis Preferred Plus membership. Get free weekend rentals and up to 30% off base rates on rentals.²³\\n![National](https://atlascard.com/assets/icons/National.svg) National\\nEmeraldClub® Executive membership. Receive faster access, special offers, upgrades, and more.²⁴\\n![Visa Infinite](https://atlascard.com/assets/icons/Visa.svg) Visa Infinite\\nTravel perks and purchase protection. Discover all the inclusive Visa Infinite benefits [here](https://atlascard.com/</visa-infinite>).²⁵\\nA card that reflects who you are.\\nAtlas Card\\nTwenty-one grams of mirror-finished steel. Heavy in the hand—the thing could damn near cut diamonds. Sleek, but also smart. And genuinely one-of-a-kind.†\\n![A close-up, detailed image showcasing the polished surface and the deeply engraved text carved in to an Atlas card.](https://atlascard.com/assets/images/CardInHand-mobile.webp)\\nLearn More About the Card\\nAdvanced construction.\\n21 grams of high density steel, CNC-milled and engraved, then polished to a brilliant mirror finish that is unlike any other card. \\n![A close-up detailed image, highlighting the detailed engravings and mirror-like polished steel surface of an Atlas card.](https://atlascard.com/assets/images/cardfront.webp)\\nDesigned and engineered. Front to back. \\nEnhanced privacy.\\nWith no visible card number on its surface, Atlas keeps your privacy where it belongs.²⁶ \\n![An image of the back of an Atlas card, highlighting that there is no visible card number for added security.](https://atlascard.com/assets/images/cardback.webp)\\nMade with privacy and security in mind. \\nPersonalized for you.\\nFeaturing a personal icon by your name—pick from a range of fun icons to make it yours. \\n![An image of the back of an Atlas card, highlighting the ability to subtly personalize your card by engraving your name and an icon of your choice.](https://atlascard.com/assets/images/CardBackCorner.webp)\\nMake Atlas Card yours with an engraved icon.\\nNo Pre-set Spending Limits\\nThe way you spend is unique to you—Atlas card has no pre-set limits and is designed to smartly adapt to your personal spending preferences.¹⁰\\nPremium Purchase Protection\\nLife can be full of surprises—that’s why Atlas Card covers your purchases up to $50,000 a year toward any repairs, replacements, or reimbursements.¹¹\\nPersonalized For You\\nCustomize your Atlas card with a personal icon next to your name—just one of the many thoughtful details that makes your Atlas card uniquely yours.\\nAn app designed to outperform.\\nAtlas App\\nTake refuge from a world of clunky, disorganized, booking websites and card apps. Find your next adventure, book in seconds, and manage your spend—all inside one powerful, yet intuitive experience.\\nLearn More About the App\\nOrganize with virtual cards.\\nCreate virtual cards for any purchases you want to easily track—from your Tokyo trip, to your company dinners. \\nCreate virtual atlas cards with just a tap. \\nNotifications without the noise.\\nBe instantly notified whenever a purchase is made with your card, get statement summaries, and timely confirmations about your upcoming reservations. \\nInstant notifications to keep you in the loop. \\nYour latest adventure, mapped.\\nSee your most recent dining or travel purchase visualized inside Atlas app, as a memento of your latest adventure. \\nIt wouldn’t be an atlas without a map.\\nLight or dark.\\nYou decide. Atlas app is native iOS optimized in countless thoughtful ways, including Light and Dark Mode. \\n![Dark mode of the Atlas app](https://atlascard.com/assets/images/app_darkmode.webp)\\n![Light mode of the Atlas app](https://atlascard.com/assets/images/app_lightmode.webp)\\nLight and dark mode support inside atlas app.\\nUnlimited Virtual Cards\\nCreate as many virtual cards as you (or your assistants, or family) need for travel, business, and more—organizing your spending couldn’t be simpler.¹²\\nPurchases Made Beautiful\\nAtlas app makes it easy to find any of your purchases by beautifully rendering purchase details, such as location info and important booking information.\\nButtery-Smooth Performance\\nAtlas app is designed and engineered to outperform the sea of slow, laggy, travel, dining, and card apps out there—finally here’s an app that’s a joy to use.\\n![A wheel icon](https://atlascard.com/assets/icons/wheel.svg) ![A plane icon](https://atlascard.com/assets/icons/plane.svg) ![A heart icon](https://atlascard.com/assets/icons/heart.svg) ![A shirt icon](https://atlascard.com/assets/icons/shirt.svg)\\n![A bag icon](https://atlascard.com/assets/icons/bag.svg) ![A bed icon](https://atlascard.com/assets/icons/bed.svg) ![A car icon](https://atlascard.com/assets/icons/car.svg) ![A utensil icon](https://atlascard.com/assets/icons/utensils.svg)\\n![A basket icon](https://atlascard.com/assets/icons/basket.svg) ![A lamp icon](https://atlascard.com/assets/icons/lamp.svg) ![A drink icon](https://atlascard.com/assets/icons/drink.svg) ![A comb icon](https://atlascard.com/assets/icons/comb.svg)\\n![A shirt icon](https://atlascard.com/assets/icons/shirt.svg) ![A utensil icon](https://atlascard.com/assets/icons/utensils.svg) ![A comb icon](https://atlascard.com/assets/icons/comb.svg)\\n![A heart icon](https://atlascard.com/assets/icons/heart.svg) ![A car icon](https://atlascard.com/assets/icons/car.svg) ![A drink icon](https://atlascard.com/assets/icons/drink.svg)\\n![A plane icon](https://atlascard.com/assets/icons/plane.svg) ![A bed icon](https://atlascard.com/assets/icons/bed.svg) ![A lamp icon](https://atlascard.com/assets/icons/lamp.svg)\\n![A wheel icon](https://atlascard.com/assets/icons/wheel.svg) ![A bag icon](https://atlascard.com/assets/icons/bag.svg) ![A basket icon](https://atlascard.com/assets/icons/basket.svg)\\nRewards as dynamic as you.\\nAtlas Rewards\\nA card that always gets you the maximum possible points without any effort on your part? That’s Atlas dynamic rewards. Redeem points for luxury hotel stays or statement credits at incredible redemption rates.\\n5x Points on BLADE Flights\\nBook a helicopter or private jet charter with BLADE using your Atlas card and get 5x points for your trip.¹³\\n3x Points on Your Top Category Every Month\\nWhether you spend the most on hotels one month, or flights the next, you automatically get 3x points for that category every month. It’s that simple.¹⁴\\n3x Points on Atlas Hotels\\nAtlas Hotels is the best way to book your next luxury hotel stay—made even better with 3x points for every dollar spent on hotel bookings inside the app.¹⁵\\n1x Points on Everything Else\\nYou’re always rewarded with Atlas—every purchase you make earns at least a minimum of 1x points, and the bonus points just keep adding up from there.¹⁶\\nBegin your adventure with Atlas.\\nAtlas Membership\\nTake your next step towards a world of access—with tables at the hottest restaurants, stays at decorated hotels, and exclusive entry to sold-out events—made easy with exceptional concierge service and an extraordinary product experience.\\n[ Request Invite  ](https://atlascard.com/</request-invite>)\\n$1,000/yr.\\n[ ](https://atlascard.com/</>) [ ](https://atlascard.com/</>)\\n[Dining](https://atlascard.com/</#supper-club>) [Hotels](https://atlascard.com/</#hotels>) [Concierge](https://atlascard.com/</#concierge>)\\n[Benefits](https://atlascard.com/</#benefits>) [Card](https://atlascard.com/</#card>) [App](https://atlascard.com/</#app>)\\nEmail  [ Twitter ](https://atlascard.com/<https:/twitter.com/atlascardhq>) [ Instagram ](https://atlascard.com/<https:/instagram.com/atlascardhq>)\\n[ Statement Disclosure ](https://atlascard.com/</legal/statement-disclosure>) [ Privacy Policy ](https://atlascard.com/</legal/privacy>) [ Terms of Use ](https://atlascard.com/</legal/terms>)\\n[Download App](https://atlascard.com/</download>) [ Media Kit ](https://atlascard.com/<https:/assets.atlascard.com/media/atlas_media_kit.zip>)\\n![](https://atlascard.com/assets/images/alex_loader-dark.webp)\\nAtlas dining Reservations are available on a first come, first serve basis exclusively to Atlas cardholders. The Atlas dining Code of Conduct ([atlascard.com/code-of-conduct](https://atlascard.com/</code-of-conduct>)) and the cancelation policy of the applicable restaurant apply for each reservation. Listed restaurants are subject to change any time without prior notice. \\nlast-minute Reservations subject to availability.\\nPoints earned for purchases with Atlas card are posted to your account per statement period after payment of your statement balance. Your available points balance can be utilized to pay for Atlas Hotels bookings in part or in full. Atlas Hotels bookings do not accrue points when paying for a stay with your points balance. 3x points (3 POINTs FOR EVERY DOLLAR SPENT) are earned when paying for Atlas Hotels bookings using your Atlas card. Subject to restrictions and Rewards & Benefit Terms of use. \\nPasses, tickets, or other various forms of entry at specific seating and/or event access levels available exclusively to atlas cardholders subject to availability. CARDHOLDER IS RESPONSIBLE FOR THE COST OF PURCHASES OF GOODS AND SERVICES AND/OR THIRD PARTY EXPENSES AND SERVICES INCURRED IN RELATION TO ANY FULFILLED REQUESTS. \\nsporting event access available exclusively to atlas cardholders subject to availability. CARDHOLDER IS RESPONSIBLE FOR THE COST OF PURCHASES OF GOODS AND SERVICES AND/OR THIRD PARTY EXPENSES AND SERVICES INCURRED IN RELATION TO ANY FULFILLED REQUESTS. \\naccess to specific concert events available exclusively to atlas cardholders subject to availability. CARDHOLDER IS RESPONSIBLE FOR THE COST OF PURCHASES OF GOODS AND SERVICES AND/OR THIRD PARTY EXPENSES AND SERVICES INCURRED IN RELATION TO ANY FULFILLED REQUESTS. \\nATLAS CARDHOLDERS ARE ELIGIBLE TO RECEIVE REIMBURSEMENT FOR UP TO $600 PER YEAR OF CANCELATION/CHANGE FEE INCURRED WITH RESPECT TO ELIGIBLE AIRFARE PURCHASES THAT ARE CANCELED FOR ANY REASON, FOR WHICH REIMBURSEMENT IS SOUGHT BEFORE THE BENEFIT END DATE, AND IF THE ELIGIBLE CARDHOLDER IS NOT ELIGIBLE TO RECEIVE A REIMBURSEMENT FROM ANOTHER SOURCE. $100 MAXIMUM REIMBURSEMENT PER REQUEST. VISIT [HTTPS://ATLASCARD.COM/FLEXPASS](https://atlascard.com/<https:/atlascard.com/flexpass>) TO LEARN MORE. \\n5x points (5 POINTs FOR EVERY DOLLAR SPENT) for BLADE private jet charter services applies to eligible blade transactions. points are calculated and applied after the end of the applicable statement period that includes fully settled blade transactions, upon payment of statement balance. Subject to restrictions and Rewards & Benefit Terms of use. \\n5x points (5 POINTs FOR EVERY DOLLAR SPENT) for BLADE helicopter services applies to eligible blade transactions. points are calculated and applied after the end of the applicable statement period that includes fully settled blade transactions, upon payment of statement balance. Subject to restrictions and Rewards & Benefit Terms of use. \\nAtlas Card is a charge card with No pre-set spending limits and does not incur interest payments. Unlike typical credit cards, the amount you can spend on a purchase is approved based on a range of factors, such as your purchase history, statement balance payments, and credit history. With a Charge Card, you need to pay off your full statement balance each month to continue utilizing card services. non-payment of an outstanding statement balance may incur a late payment charge. please refer to the cardholder agreement for more details on the full schedule of service fees. \\nPurchase Security protects new retail purchases made with Your atlas card within the first ninety (90) days from the date of purchase. To be eligible for this coverage, You need to purchase either a portion or the entire cost of the item using your atlas card. At the discretion of the benefit Administrator, this benefit replaces, repairs, or reimburses You, up to the total purchase price of Your item for a maximum of $10,000.00 per claim and $50,000.00 per cardholder, in the event of theft or damage. \\nCreate unlimited new virtual atlas cards inside atlas app, with up to five (5) active cards at any one given time. \\n5X POINTS (5 POINTs FOR EVERY DOLLAR SPENT) for BLADE APPLIES TO ALL ELIGIBLE BLADE SERVICES. points are calculated and applied after the end of the applicable statement period that includes fully settled blade transactions, upon payment of statement balance. Subject to restrictions and Rewards & Benefit Terms of use. \\nELIGIBLE REWARDED CATEGORIES WILL ACCRUE 3 POINTs FOR EVERY DOLLAR SPENT (3X POINTS). Categories INCLUDE – DINING, HOTELS, FLIGHTS, RIDESHARES, NIGHTLIFE, FASHION, GROCERIES, WELLNESS, HEALTH, HOME, AUTO SERVICES, and ad spend. POINTS UPGRADE IS CALCULATED AND APPLIED after THE END OF EACH STATEMENT PERIOD ON eligible SETTLED TRANSACTIONS WITHIN YOUR TOP spend CATEGORY based on DOLLAR AMOUNT. OUTSIDE OF THE TOP SPEND CATEGORY, SETTLED TRANSACTIONS FOR PRODUCTS AND SERVICES PROVIDED BY MERCHANTS AND/OR CATEGORIES NOT SUBJECT TO ANOTHER POINTS MULTIPLIER, WILL ACCRUE 1 POINT FOR EVERY DOLLAR SPENT (1X POINTS) AFTER THE APPLICABLE BILLING CYCLE. SUBJECT TO RESTRICTIONS AND THE REWARDS & BENEFIT TERMS. \\n3x points (3 POINTs FOR EVERY DOLLAR SPENT) are earned when paying for Atlas Hotels bookings using your Atlas card. Subject to restrictions and Rewards & Benefit Terms of use. \\nSETTLED TRANSACTIONS FOR PRODUCTS AND SERVICES PROVIDED BY MERCHANTS AND/OR CATEGORIES NOT SUBJECT TO ANOTHER POINTS MULTIPLIER, WILL ACCRUE 1 POINT FOR EVERY DOLLAR SPENT (1X POINTS) AFTER THE APPLICABLE BILLING CYCLE. SUBJECT TO RESTRICTIONS AND THE REWARDS & BENEFIT TERMS. \\nCOMPLIMENTARY $100 ANNUAL EREWHON CAFE MEMBERSHIP. BENEFIT ENROLLMENT INSTRUCTIONS PROVIDED IN APP. \\nPROVIDED AS A $199 STATEMENT CREDIT TO YOUR ATLAS ACCOUNT UPON PURCHASE OF ONE MEDICAL ANNUAL MEMBERSHIP WITH YOUR ATLAS CARD. VISIT [ONEMEDICAL.COM/ATLAS/](https://atlascard.com/<https:/onemedical.com/atlas/>) TO LEARN MORE. \\nPriority pass offered to atlas cardholders as part of visa infinite. visit [HTTPS://ATLASCARD.COM/VISA-INFINITE](https://atlascard.com/<https:/atlascard.com/visa-infinite>) TO LEARN MORE. \\nUP TO $300 IN ANNUAL STATEMENT CREDITS ($25/MONTH). GET YOUR FIRST MONTH FREE BY USING THE FUTURE FITNESS ATLAS CARDHOLDER ENROLLMENT PAGE. VISIT [HTTPS://FUTURE.CO/ATLASCARD](https://atlascard.com/<https:/future.co/atlascard>) TO LEARN MORE. \\nTablet Hotels offers exclusive privileges at their collection of Tablet Plus hotels, Visit <https://tablethotels.com/plus-list> to learn more. Benefits include room upgrades, food and beverage credits, late checkout and more. For bookings, text your Atlas concierge at 650-539-2701. \\nVisit [HTTPS://ATLASCARD.COM/VISA-INFINITE](https://atlascard.com/<https:/atlascard.com/visa-infinite>) TO LEARN MORE about Hertz rental services offered to atlas cardholders as part of visa infinite. \\nVisit [HTTPS://ATLASCARD.COM/VISA-INFINITE](https://atlascard.com/<https:/atlascard.com/visa-infinite>) TO LEARN MORE about Avis rental services offered to atlas cardholders as part of visa infinite. \\nVisit [HTTPS://ATLASCARD.COM/VISA-INFINITE](https://atlascard.com/<https:/atlascard.com/visa-infinite>) TO LEARN MORE about National rental services offered to atlas cardholders as part of visa infinite. \\nVisit [HTTPS://ATLASCARD.COM/VISA-INFINITE](https://atlascard.com/<https:/atlascard.com/visa-infinite>) TO LEARN MORE about visa infinite services offered as part of atlas membership. \\nPhysical card details are available to access any time inside atlas app.\\n†Issued by Lead Bank | Membership $1,000/yr.\\n2024 © Atlas Exploration, Inc is a technology company, not a bank. Atlas Card is issued by Lead Bank (\"Issuer\"). An application is required. Cardholders must be at least 18 years old and a citizen of the United States, or a permanent resident with a valid social security number (SSN) or ITIN. Financing is subject to Issuer\\'s approval. Payment of account balance due in full monthly. Fees may be assessed on overdue amounts. An annual membership fee applies. \\n' markdown_with_citations=' ⟨1⟩ ![Atlas Runner⟨2⟩]\\n Request Invite ⟨3⟩  Sign In To Atlas ⟨4⟩\\nYour key to the world. \\nAccess coveted dining, hotels, And events.†  ⟨5⟩\\nWith Atlas, you can finally get tables at the hardest-to-book restaurants, find the perfect suite at the world’s best hotels, sit front row at sold-out concerts and sporting events—and much more. All seamlessly brought to you inside a card and app that’s as intuitive, as it is powerful. \\n Request Invite  ⟨3⟩\\nAtlas membership is invite-only. Join the waitlist and we’ll contact you if it’s a fit. \\n![An image of the moody interior dining space at Sartiano\\'s restaurant in New York City.⟨6⟩]\\nReserve exclusive tables at the world’s hottest restaurants.\\nSartiano’s, NYC\\n![An image of a tranquil indoor swimming pool and spa overlooking the Tokyo skyline at Aman Tokyo hotel in Tokyo, Japan.⟨7⟩]\\nBook stays from a selection of the world’s finest hotels.\\nAman Tokyo, Japan\\n![An image of a fast moving racing car blurring past at high speed at a Formula 1 racing event.⟨8⟩]\\nAttend today’s most exhilarating events with front-row access.\\nF1 Paddock Club\\nImpossible reservations made easy.\\nAtlas Dining\\nYou want to eat at great restaurants. So does everyone else. The difference is—you’ve got Atlas. Discover the hottest restaurants around town with Atlas Dining, and reserve your tables during peak hours.\\n![An image of the wooden sushi bar with minimalist design ready to serve guests at the restaurant ITO in New York City.⟨9⟩]\\nITO\\nIto, NYC\\nNew York City\\nSet in downtown Manhattan and designed with a modern Japanese approach. The 16-seat Omakase counter is a space where Chef/owners Masa Ito and Kevin Kim share their inventive interpretation on traditional sushi. Carefully hand selected, the fish is flown in directly from Japan for the excellent course of nigiri. With appetizers like kampachi with yuzu chive oil or desserts like strawberry panna cotta. Book a table at ITO and more on Atlas.\\nDedicated Atlas Reservations\\nBook a table at the very best restaurants in NYC, LA, SF, Miami, and worldwide—directly inside Atlas app or by texting your Atlas concierge.¹\\nUp-And-Coming Recommendations\\nAtlas is always on top of the hottest dining spots in your city—so you can get early access to up-and-coming new restaurants that are still under the radar.\\nReserve Primetime Tables\\nGet reservations at a time that is ideal for you, instead of times that are too early or too late in the day, because that’s all that was available.²\\nLearn More About Atlas Dining\\nA world of options.\\nChoose from top restaurants in NYC, LA, SF, Miami, and more. All inside Atlas app. \\nFilter by location inside Atlas App.\\nBook in an instant.\\nNo need to navigate clunky reservation sites. You’re ready to go in just a couple of taps. \\nBook your table in seconds.\\nSee everything, all at once.\\nView or change your upcoming reservations inside Atlas app, right at your fingertips. \\nStay on top of upcoming reservations.\\nThink of it as an amuse-bouche.\\nWith hundreds of incredible restaurants to choose from, here are a few highlights to give you a sense of what’s in store. \\nSartiano’s\\nNew York, New York\\nHorses\\nLos Angeles, California\\nSons & Daughters\\nSan Francisco, California\\nCafé Chelsea\\nNew York, New York\\nMeduza Mediterrania\\nNew York, New York\\nFelix Trattoria\\nLos Angeles, California\\nIto\\nNew York, New York\\nSushi by Scratch\\nMiami, Florida\\nMother Wolf\\nLos Angeles, California\\nContessa\\nMiami, Florida\\nCecconi’s\\nLos Angeles, California\\nCucina Alba\\nNew York, New York\\nCotogna\\nSan Francisco, California\\nRaf’s\\nNew York, New York\\nFish Cheeks\\nNew York, New York\\nOlivetta\\nLos Angeles, California\\nCatch LA\\nLos Angeles, California\\nLure Fishbar\\nNew York, New York\\nCasa Madera\\nLos Angeles, California\\nSexy Fish\\nMiami, Florida\\nEstela\\nNew York, New York\\nCasa Cruz\\nNew York, New York\\nSushi by Scratch\\nLos Angeles, California\\nMila\\nMiami, Florida\\nWant to join Atlasas a dining partner? \\nIf you are a restaurant owner, and would like to partner with us, please contact us below. \\nBecome an Atlas Dining Partner –>\\nThe fastest way to your paradise.\\nAtlas Hotels\\nExperience the best way to book stays at the world’s finest hotels. Browse a curated selection in app, find your paradise, then book with points or preferred rates, for better deals than anywhere else.\\n![An image of a large pool of calm water situated inside a courtyard with exquisite Moorish architecture at The Oberoi hotel in Marrakech, Morocco.⟨10⟩]\\nThe Oberoi Marrakech\\nThe Oberoi, Marrakech, Morocco\\nMarrakech, Morocco\\nSet in Marrakech, 12 km from Yves Saint Laurent Museum, The Oberoi Marrakech offers accommodation with a restaurant, free private parking, free bikes and an outdoor swimming pool. Each accommodation at the 5-star hotel has garden views, and guests can enjoy access to a bar and to a garden. The hotel features an indoor pool, fitness centre, evening entertainment and a 24-hour front desk. Book The Oberoi Marrakech and more on Atlas.\\nCurated Luxury Hotels\\nChoose from a unique collection of the most decorated hotels in the world, with selections located in the top luxury travel destinations globally.\\nBook With Points\\nUse points you’ve earned with Atlas to book stays at incredible redemption rates, and get 3x points for every dollar spent on hotel bookings inside the app.³\\nFind a Room in Seconds\\nBooking with Atlas is a breeze—discover the destination, hotel, and room that’s just right for you inside Atlas app, and book your stay in (literal) seconds.\\nLearn More About Atlas Hotels\\nFind your vibe.\\nAtlas Hotels is made to explore. Swipe, tap, and filter by vibe to discover the destination that’s just right for you. \\nDiscover your next dream stay.\\nAdvanced search filters.\\nSearch by city, country, or even by a specific hotel property. \\nRefine your search for the perfect hotel. \\nBook with a single tap.\\nNo need to enter your Atlas card information—we’ve got that. Just find what you like, and book. \\nDesigned to get you on your way. Fast.\\nEverything in one place.\\nView all your relevant reservation information inside Atlas app in the days leading up to your trip. \\nStay on top of upcoming bookings.\\nThe greatest hotels in the world.\\nHere’s a quick preview of a few of the most popular properties on Atlas Hotels. \\n1 Hotel Hanalei Bay\\nKauai, Hawaii\\nAman Tokyo\\nTokyo, Japan\\nAmangiri\\nCanyon Point, Utah\\nBadrutt’s Palace Hotel\\nSt. Moritz, Switzerland\\nCheval Blanc Paris\\nParis, France\\nClaridge’s\\nLondon, United Kingdom\\nDorchester\\nLondon, United Kingdom\\nEquinox Hotel New York\\nNew York City, New York\\nFaena Hotel Miami Beach\\nMiami Beach, Florida\\nHôtel de Crillon A Rosewood Hotel\\nParis, France\\nHotel Fasano Rio de Janeiro\\nRio De Janeiro, Brazil\\nHotel Le Toiny\\nSt. Barths\\nMaroma, A Belmond Hotel, Riviera Maya\\nRiviera Maya, Mexico\\nMauna Lani, Auberge Resorts Collection\\nIsland of Hawai’i, Hawaii\\nMontage Big Sky\\nBig Sky, Montana\\nOne&Only Palmilla, Los Cabos\\nCabo, Mexico\\nParadero Todos Santos\\nTodos Santos, Mexico\\nPost Ranch Inn\\nBig Sur, California\\nRosewood São Paulo\\nSão Paulo, Brazil\\nSix Senses Rome\\nRome, Italy\\nThe Barcelona Edition\\nBarcelona, Spain\\nThe Beverly Hills Hotel\\nLos Angeles, California\\nThe Little Nell\\nAspen, Colorado\\nThe Maybourne Beverly Hills\\nLos Angeles, California\\nThe Oberoi Marrakech\\nMarrakech, Morocco\\nReady to find your next stay? \\n Request Invite –> ⟨3⟩\\nExperience the action up close.\\nAtlas Experiences\\nGet unique access to exclusive experiences, from backstage passes at sold-out concerts, to front-row seats at the biggest sporting events, all through one text to your Atlas concierge.\\n![An image of large crowds watching on-stage performances at Coachella festival, while the sun sets over Indio, California.⟨11⟩]\\nCoachella Artist Pass\\nCoachella Artist Pass, Indio\\nIndio, California\\nGet the exclusive Coachella Artist Pass and experience the largest music festival in the US with premium access. Move more freely within the festival grounds—with closer access to performances and more comfortable amenities. The Artist Pass offers the highest level of credentials available allowing access to all of the VIP areas, private viewing sections, exclusive entrances/exits, and golf carts behind the stages. Book this and more exclusive experiences with Atlas.\\nJust One Text Away\\nFrom securing event passes, to ensuring you have the best seats in the house, your Atlas concierge is just a text away to take care of it all for you.⁴\\nYour Favorite Sporting Events\\nCourtside at the US Open Tennis Championships, or the Paddock Club at a Formula 1 Grand Prix, name your event and Atlas can get you in.⁵\\nTickets to Sold-Out Concerts\\nFrom Coachella to sold-out concerts, get yourself into events that aren’t accessible to everyone—Atlas is there for you, so you can witness magic.⁶\\nBenefits to keep you moving.\\nAtlas Benefits\\nHassle-free travel, health and well-being, plus a whole range of other unique benefits, made for a faster and smoother life on the go—all part of Atlas membership.\\n![An image of a Blade helicopter flying past Verrazzano-Narrows Bridge during its usual route from JFK Airport to the Blade Heliport in Manhattan, New York City.⟨12⟩]\\nBLADE Airport\\nBLADE Airport, NYC\\nNew York City\\nSkip the traffic and arrive in minutes. Getting from NYC to airports in the area can take hours. Book a private BLADE helicopter to fly you from Manhattan to either JFK or EWR in 5 minutes. Atlas members get 5x points on every ride, a 7.5% discount, and the meet and greet service—a private SUV transfer to your terminal. Spend over $20,000 a month on Atlas and receive Blade Airport Pass—$100 off every ride, a companion pass, and rides starting at $95.\\nAtlas FlexPass\\nPlans can change last-minute—that’s why we created FlexPass—so you can change or cancel any flight booked with your Atlas card, and get reimbursed for any fees you incur up to $600 a year.⁷\\nBLADE Private Jets\\nGet 5x points, and 7.5% off, plus priority availability and waived card processing fees when you use Atlas to book a private jet charter with BLADE.⁸\\nBLADE Helicopter Rides\\nGet 5x points, and 7.5% off, plus meet & greet for airport transfers. Spend more than $20,000 per month with Atlas, and you’ll also receive a BLADE Airport Pass, which gets you $100 off every airport flight, a companion pass, and flights starting at $95 with your pass discount.⁹\\nLearn More About Benefits\\nOne place for all your benefits.\\nAccess all your membership benefits right inside the app.\\nSwipe through your benefits with ease.\\n![Atlas FlexPass⟨13⟩] Atlas FlexPass\\nChange or cancel any flight for any reason, and Atlas will reimburse you for any incurred fees up to $600 a year.⁷\\n![Blade⟨14⟩] BLADE Anywhere\\nGet 5x points, and 7.5% off, plus priority availability and waived card processing fees when you use Atlas to book a private jet charter with BLADE.⁸\\n![Blade⟨14⟩] BLADE Airport\\nGet 5x points, and 7.5% off, plus meet & greet for airport transfers. Spend more than $20,000 per month with Atlas, and you’ll also receive a BLADE Airport Pass, which gets you $100 off every airport flight, a companion pass, and flights starting at $95 with your pass discount.⁹\\n![Erewhon Cafe⟨15⟩] Erewhon\\nReceive complimentary access to Erewhon Cafe Annual Membership.¹⁷\\n![One Medical⟨16⟩] One Medical\\nComplimentary $199 statement credit when you enroll for an annual membership with Atlas card.¹⁸\\n![Priority Pass⟨17⟩] Priority Pass\\nPriority Pass™ Select membership. Access over 1,300 airport lounges worldwide.¹⁹\\n![Future Personal Training⟨18⟩] Future\\n$300 in annual statement credits for Future personal training membership with your Atlas card.²⁰\\n![Tablet Hotels⟨19⟩] Tablet® Hotels\\nTablet® Plus hotels membership. Room upgrades, late checkout, complimentary dining and more.²¹\\n![Hertz⟨20⟩] Hertz\\nPriority service with Hertz Gold Plus. Complimentary upgrades and special savings on special models.²²\\n![Avis⟨21⟩] Avis\\nAvis Preferred Plus membership. Get free weekend rentals and up to 30% off base rates on rentals.²³\\n![National⟨22⟩] National\\nEmeraldClub® Executive membership. Receive faster access, special offers, upgrades, and more.²⁴\\n![Visa Infinite⟨23⟩] Visa Infinite\\nTravel perks and purchase protection. Discover all the inclusive Visa Infinite benefits here⟨24⟩.²⁵\\nA card that reflects who you are.\\nAtlas Card\\nTwenty-one grams of mirror-finished steel. Heavy in the hand—the thing could damn near cut diamonds. Sleek, but also smart. And genuinely one-of-a-kind.†\\n![A close-up, detailed image showcasing the polished surface and the deeply engraved text carved in to an Atlas card.⟨25⟩]\\nLearn More About the Card\\nAdvanced construction.\\n21 grams of high density steel, CNC-milled and engraved, then polished to a brilliant mirror finish that is unlike any other card. \\n![A close-up detailed image, highlighting the detailed engravings and mirror-like polished steel surface of an Atlas card.⟨26⟩]\\nDesigned and engineered. Front to back. \\nEnhanced privacy.\\nWith no visible card number on its surface, Atlas keeps your privacy where it belongs.²⁶ \\n![An image of the back of an Atlas card, highlighting that there is no visible card number for added security.⟨27⟩]\\nMade with privacy and security in mind. \\nPersonalized for you.\\nFeaturing a personal icon by your name—pick from a range of fun icons to make it yours. \\n![An image of the back of an Atlas card, highlighting the ability to subtly personalize your card by engraving your name and an icon of your choice.⟨28⟩]\\nMake Atlas Card yours with an engraved icon.\\nNo Pre-set Spending Limits\\nThe way you spend is unique to you—Atlas card has no pre-set limits and is designed to smartly adapt to your personal spending preferences.¹⁰\\nPremium Purchase Protection\\nLife can be full of surprises—that’s why Atlas Card covers your purchases up to $50,000 a year toward any repairs, replacements, or reimbursements.¹¹\\nPersonalized For You\\nCustomize your Atlas card with a personal icon next to your name—just one of the many thoughtful details that makes your Atlas card uniquely yours.\\nAn app designed to outperform.\\nAtlas App\\nTake refuge from a world of clunky, disorganized, booking websites and card apps. Find your next adventure, book in seconds, and manage your spend—all inside one powerful, yet intuitive experience.\\nLearn More About the App\\nOrganize with virtual cards.\\nCreate virtual cards for any purchases you want to easily track—from your Tokyo trip, to your company dinners. \\nCreate virtual atlas cards with just a tap. \\nNotifications without the noise.\\nBe instantly notified whenever a purchase is made with your card, get statement summaries, and timely confirmations about your upcoming reservations. \\nInstant notifications to keep you in the loop. \\nYour latest adventure, mapped.\\nSee your most recent dining or travel purchase visualized inside Atlas app, as a memento of your latest adventure. \\nIt wouldn’t be an atlas without a map.\\nLight or dark.\\nYou decide. Atlas app is native iOS optimized in countless thoughtful ways, including Light and Dark Mode. \\n![Dark mode of the Atlas app⟨29⟩]\\n![Light mode of the Atlas app⟨30⟩]\\nLight and dark mode support inside atlas app.\\nUnlimited Virtual Cards\\nCreate as many virtual cards as you (or your assistants, or family) need for travel, business, and more—organizing your spending couldn’t be simpler.¹²\\nPurchases Made Beautiful\\nAtlas app makes it easy to find any of your purchases by beautifully rendering purchase details, such as location info and important booking information.\\nButtery-Smooth Performance\\nAtlas app is designed and engineered to outperform the sea of slow, laggy, travel, dining, and card apps out there—finally here’s an app that’s a joy to use.\\n![A wheel icon⟨31⟩] ![A plane icon⟨32⟩] ![A heart icon⟨33⟩] ![A shirt icon⟨34⟩]\\n![A bag icon⟨35⟩] ![A bed icon⟨36⟩] ![A car icon⟨37⟩] ![A utensil icon⟨38⟩]\\n![A basket icon⟨39⟩] ![A lamp icon⟨40⟩] ![A drink icon⟨41⟩] ![A comb icon⟨42⟩]\\n![A shirt icon⟨34⟩] ![A utensil icon⟨38⟩] ![A comb icon⟨42⟩]\\n![A heart icon⟨33⟩] ![A car icon⟨37⟩] ![A drink icon⟨41⟩]\\n![A plane icon⟨32⟩] ![A bed icon⟨36⟩] ![A lamp icon⟨40⟩]\\n![A wheel icon⟨31⟩] ![A bag icon⟨35⟩] ![A basket icon⟨39⟩]\\nRewards as dynamic as you.\\nAtlas Rewards\\nA card that always gets you the maximum possible points without any effort on your part? That’s Atlas dynamic rewards. Redeem points for luxury hotel stays or statement credits at incredible redemption rates.\\n5x Points on BLADE Flights\\nBook a helicopter or private jet charter with BLADE using your Atlas card and get 5x points for your trip.¹³\\n3x Points on Your Top Category Every Month\\nWhether you spend the most on hotels one month, or flights the next, you automatically get 3x points for that category every month. It’s that simple.¹⁴\\n3x Points on Atlas Hotels\\nAtlas Hotels is the best way to book your next luxury hotel stay—made even better with 3x points for every dollar spent on hotel bookings inside the app.¹⁵\\n1x Points on Everything Else\\nYou’re always rewarded with Atlas—every purchase you make earns at least a minimum of 1x points, and the bonus points just keep adding up from there.¹⁶\\nBegin your adventure with Atlas.\\nAtlas Membership\\nTake your next step towards a world of access—with tables at the hottest restaurants, stays at decorated hotels, and exclusive entry to sold-out events—made easy with exceptional concierge service and an extraordinary product experience.\\n Request Invite  ⟨3⟩\\n$1,000/yr.\\n ⟨1⟩  ⟨1⟩\\nDining⟨43⟩ Hotels⟨44⟩ Concierge⟨45⟩\\nBenefits⟨46⟩ Card⟨47⟩ App⟨48⟩\\nEmail   Twitter ⟨49⟩  Instagram ⟨50⟩\\n Statement Disclosure ⟨51⟩  Privacy Policy ⟨52⟩  Terms of Use ⟨53⟩\\nDownload App⟨54⟩  Media Kit ⟨55⟩\\n![](https://atlascard.com/assets/images/alex_loader-dark.webp)\\nAtlas dining Reservations are available on a first come, first serve basis exclusively to Atlas cardholders. The Atlas dining Code of Conduct (atlascard.com/code-of-conduct⟨56⟩) and the cancelation policy of the applicable restaurant apply for each reservation. Listed restaurants are subject to change any time without prior notice. \\nlast-minute Reservations subject to availability.\\nPoints earned for purchases with Atlas card are posted to your account per statement period after payment of your statement balance. Your available points balance can be utilized to pay for Atlas Hotels bookings in part or in full. Atlas Hotels bookings do not accrue points when paying for a stay with your points balance. 3x points (3 POINTs FOR EVERY DOLLAR SPENT) are earned when paying for Atlas Hotels bookings using your Atlas card. Subject to restrictions and Rewards & Benefit Terms of use. \\nPasses, tickets, or other various forms of entry at specific seating and/or event access levels available exclusively to atlas cardholders subject to availability. CARDHOLDER IS RESPONSIBLE FOR THE COST OF PURCHASES OF GOODS AND SERVICES AND/OR THIRD PARTY EXPENSES AND SERVICES INCURRED IN RELATION TO ANY FULFILLED REQUESTS. \\nsporting event access available exclusively to atlas cardholders subject to availability. CARDHOLDER IS RESPONSIBLE FOR THE COST OF PURCHASES OF GOODS AND SERVICES AND/OR THIRD PARTY EXPENSES AND SERVICES INCURRED IN RELATION TO ANY FULFILLED REQUESTS. \\naccess to specific concert events available exclusively to atlas cardholders subject to availability. CARDHOLDER IS RESPONSIBLE FOR THE COST OF PURCHASES OF GOODS AND SERVICES AND/OR THIRD PARTY EXPENSES AND SERVICES INCURRED IN RELATION TO ANY FULFILLED REQUESTS. \\nATLAS CARDHOLDERS ARE ELIGIBLE TO RECEIVE REIMBURSEMENT FOR UP TO $600 PER YEAR OF CANCELATION/CHANGE FEE INCURRED WITH RESPECT TO ELIGIBLE AIRFARE PURCHASES THAT ARE CANCELED FOR ANY REASON, FOR WHICH REIMBURSEMENT IS SOUGHT BEFORE THE BENEFIT END DATE, AND IF THE ELIGIBLE CARDHOLDER IS NOT ELIGIBLE TO RECEIVE A REIMBURSEMENT FROM ANOTHER SOURCE. $100 MAXIMUM REIMBURSEMENT PER REQUEST. VISIT HTTPS://ATLASCARD.COM/FLEXPASS⟨57⟩ TO LEARN MORE. \\n5x points (5 POINTs FOR EVERY DOLLAR SPENT) for BLADE private jet charter services applies to eligible blade transactions. points are calculated and applied after the end of the applicable statement period that includes fully settled blade transactions, upon payment of statement balance. Subject to restrictions and Rewards & Benefit Terms of use. \\n5x points (5 POINTs FOR EVERY DOLLAR SPENT) for BLADE helicopter services applies to eligible blade transactions. points are calculated and applied after the end of the applicable statement period that includes fully settled blade transactions, upon payment of statement balance. Subject to restrictions and Rewards & Benefit Terms of use. \\nAtlas Card is a charge card with No pre-set spending limits and does not incur interest payments. Unlike typical credit cards, the amount you can spend on a purchase is approved based on a range of factors, such as your purchase history, statement balance payments, and credit history. With a Charge Card, you need to pay off your full statement balance each month to continue utilizing card services. non-payment of an outstanding statement balance may incur a late payment charge. please refer to the cardholder agreement for more details on the full schedule of service fees. \\nPurchase Security protects new retail purchases made with Your atlas card within the first ninety (90) days from the date of purchase. To be eligible for this coverage, You need to purchase either a portion or the entire cost of the item using your atlas card. At the discretion of the benefit Administrator, this benefit replaces, repairs, or reimburses You, up to the total purchase price of Your item for a maximum of $10,000.00 per claim and $50,000.00 per cardholder, in the event of theft or damage. \\nCreate unlimited new virtual atlas cards inside atlas app, with up to five (5) active cards at any one given time. \\n5X POINTS (5 POINTs FOR EVERY DOLLAR SPENT) for BLADE APPLIES TO ALL ELIGIBLE BLADE SERVICES. points are calculated and applied after the end of the applicable statement period that includes fully settled blade transactions, upon payment of statement balance. Subject to restrictions and Rewards & Benefit Terms of use. \\nELIGIBLE REWARDED CATEGORIES WILL ACCRUE 3 POINTs FOR EVERY DOLLAR SPENT (3X POINTS). Categories INCLUDE – DINING, HOTELS, FLIGHTS, RIDESHARES, NIGHTLIFE, FASHION, GROCERIES, WELLNESS, HEALTH, HOME, AUTO SERVICES, and ad spend. POINTS UPGRADE IS CALCULATED AND APPLIED after THE END OF EACH STATEMENT PERIOD ON eligible SETTLED TRANSACTIONS WITHIN YOUR TOP spend CATEGORY based on DOLLAR AMOUNT. OUTSIDE OF THE TOP SPEND CATEGORY, SETTLED TRANSACTIONS FOR PRODUCTS AND SERVICES PROVIDED BY MERCHANTS AND/OR CATEGORIES NOT SUBJECT TO ANOTHER POINTS MULTIPLIER, WILL ACCRUE 1 POINT FOR EVERY DOLLAR SPENT (1X POINTS) AFTER THE APPLICABLE BILLING CYCLE. SUBJECT TO RESTRICTIONS AND THE REWARDS & BENEFIT TERMS. \\n3x points (3 POINTs FOR EVERY DOLLAR SPENT) are earned when paying for Atlas Hotels bookings using your Atlas card. Subject to restrictions and Rewards & Benefit Terms of use. \\nSETTLED TRANSACTIONS FOR PRODUCTS AND SERVICES PROVIDED BY MERCHANTS AND/OR CATEGORIES NOT SUBJECT TO ANOTHER POINTS MULTIPLIER, WILL ACCRUE 1 POINT FOR EVERY DOLLAR SPENT (1X POINTS) AFTER THE APPLICABLE BILLING CYCLE. SUBJECT TO RESTRICTIONS AND THE REWARDS & BENEFIT TERMS. \\nCOMPLIMENTARY $100 ANNUAL EREWHON CAFE MEMBERSHIP. BENEFIT ENROLLMENT INSTRUCTIONS PROVIDED IN APP. \\nPROVIDED AS A $199 STATEMENT CREDIT TO YOUR ATLAS ACCOUNT UPON PURCHASE OF ONE MEDICAL ANNUAL MEMBERSHIP WITH YOUR ATLAS CARD. VISIT ONEMEDICAL.COM/ATLAS/⟨58⟩ TO LEARN MORE. \\nPriority pass offered to atlas cardholders as part of visa infinite. visit HTTPS://ATLASCARD.COM/VISA-INFINITE⟨59⟩ TO LEARN MORE. \\nUP TO $300 IN ANNUAL STATEMENT CREDITS ($25/MONTH). GET YOUR FIRST MONTH FREE BY USING THE FUTURE FITNESS ATLAS CARDHOLDER ENROLLMENT PAGE. VISIT HTTPS://FUTURE.CO/ATLASCARD⟨60⟩ TO LEARN MORE. \\nTablet Hotels offers exclusive privileges at their collection of Tablet Plus hotels, Visit <https://tablethotels.com/plus-list> to learn more. Benefits include room upgrades, food and beverage credits, late checkout and more. For bookings, text your Atlas concierge at 650-539-2701. \\nVisit HTTPS://ATLASCARD.COM/VISA-INFINITE⟨59⟩ TO LEARN MORE about Hertz rental services offered to atlas cardholders as part of visa infinite. \\nVisit HTTPS://ATLASCARD.COM/VISA-INFINITE⟨59⟩ TO LEARN MORE about Avis rental services offered to atlas cardholders as part of visa infinite. \\nVisit HTTPS://ATLASCARD.COM/VISA-INFINITE⟨59⟩ TO LEARN MORE about National rental services offered to atlas cardholders as part of visa infinite. \\nVisit HTTPS://ATLASCARD.COM/VISA-INFINITE⟨59⟩ TO LEARN MORE about visa infinite services offered as part of atlas membership. \\nPhysical card details are available to access any time inside atlas app.\\n†Issued by Lead Bank | Membership $1,000/yr.\\n2024 © Atlas Exploration, Inc is a technology company, not a bank. Atlas Card is issued by Lead Bank (\"Issuer\"). An application is required. Cardholders must be at least 18 years old and a citizen of the United States, or a permanent resident with a valid social security number (SSN) or ITIN. Financing is subject to Issuer\\'s approval. Payment of account balance due in full monthly. Fees may be assessed on overdue amounts. An annual membership fee applies. \\n' references_markdown=\"\\n\\n## References\\n\\n⟨1⟩ https://atlascard.com/</>:  \\n⟨2⟩ https://atlascard.com/assets/images/alex_loader.webp: Atlas Runner\\n⟨3⟩ https://atlascard.com/</request-invite>:  Request Invite \\n⟨4⟩ https://atlascard.com/<https:/app.atlascard.com/>:  Sign In To Atlas \\n⟨5⟩ https://atlascard.com/<#top-content>:  \\n⟨6⟩ https://atlascard.com/assets/images/carousel-1-mobile.webp: An image of the moody interior dining space at Sartiano's restaurant in New York City.\\n⟨7⟩ https://atlascard.com/assets/images/carousel-2-mobile.webp: An image of a tranquil indoor swimming pool and spa overlooking the Tokyo skyline at Aman Tokyo hotel in Tokyo, Japan.\\n⟨8⟩ https://atlascard.com/assets/images/carousel-3-mobile.webp: An image of a fast moving racing car blurring past at high speed at a Formula 1 racing event.\\n⟨9⟩ https://atlascard.com/assets/images/dining-mobile.webp: An image of the wooden sushi bar with minimalist design ready to serve guests at the restaurant ITO in New York City.\\n⟨10⟩ https://atlascard.com/assets/images/hotels-mobile.webp: An image of a large pool of calm water situated inside a courtyard with exquisite Moorish architecture at The Oberoi hotel in Marrakech, Morocco.\\n⟨11⟩ https://atlascard.com/assets/images/experiences-mobile.webp: An image of large crowds watching on-stage performances at Coachella festival, while the sun sets over Indio, California.\\n⟨12⟩ https://atlascard.com/assets/images/benefits-mobile.webp: An image of a Blade helicopter flying past Verrazzano-Narrows Bridge during its usual route from JFK Airport to the Blade Heliport in Manhattan, New York City.\\n⟨13⟩ https://atlascard.com/assets/icons/AtlasFlexPass.svg: Atlas FlexPass\\n⟨14⟩ https://atlascard.com/assets/icons/Blade.svg: Blade\\n⟨15⟩ https://atlascard.com/assets/icons/Erewhon.svg: Erewhon Cafe\\n⟨16⟩ https://atlascard.com/assets/icons/OneMedical.svg: One Medical\\n⟨17⟩ https://atlascard.com/assets/icons/PriorityPass.svg: Priority Pass\\n⟨18⟩ https://atlascard.com/assets/icons/FutureFitness.svg: Future Personal Training\\n⟨19⟩ https://atlascard.com/assets/icons/TabletHotels.svg: Tablet Hotels\\n⟨20⟩ https://atlascard.com/assets/icons/Hertz.svg: Hertz\\n⟨21⟩ https://atlascard.com/assets/icons/Avis.svg: Avis\\n⟨22⟩ https://atlascard.com/assets/icons/National.svg: National\\n⟨23⟩ https://atlascard.com/assets/icons/Visa.svg: Visa Infinite\\n⟨24⟩ https://atlascard.com/</visa-infinite>: here\\n⟨25⟩ https://atlascard.com/assets/images/CardInHand-mobile.webp: A close-up, detailed image showcasing the polished surface and the deeply engraved text carved in to an Atlas card.\\n⟨26⟩ https://atlascard.com/assets/images/cardfront.webp: A close-up detailed image, highlighting the detailed engravings and mirror-like polished steel surface of an Atlas card.\\n⟨27⟩ https://atlascard.com/assets/images/cardback.webp: An image of the back of an Atlas card, highlighting that there is no visible card number for added security.\\n⟨28⟩ https://atlascard.com/assets/images/CardBackCorner.webp: An image of the back of an Atlas card, highlighting the ability to subtly personalize your card by engraving your name and an icon of your choice.\\n⟨29⟩ https://atlascard.com/assets/images/app_darkmode.webp: Dark mode of the Atlas app\\n⟨30⟩ https://atlascard.com/assets/images/app_lightmode.webp: Light mode of the Atlas app\\n⟨31⟩ https://atlascard.com/assets/icons/wheel.svg: A wheel icon\\n⟨32⟩ https://atlascard.com/assets/icons/plane.svg: A plane icon\\n⟨33⟩ https://atlascard.com/assets/icons/heart.svg: A heart icon\\n⟨34⟩ https://atlascard.com/assets/icons/shirt.svg: A shirt icon\\n⟨35⟩ https://atlascard.com/assets/icons/bag.svg: A bag icon\\n⟨36⟩ https://atlascard.com/assets/icons/bed.svg: A bed icon\\n⟨37⟩ https://atlascard.com/assets/icons/car.svg: A car icon\\n⟨38⟩ https://atlascard.com/assets/icons/utensils.svg: A utensil icon\\n⟨39⟩ https://atlascard.com/assets/icons/basket.svg: A basket icon\\n⟨40⟩ https://atlascard.com/assets/icons/lamp.svg: A lamp icon\\n⟨41⟩ https://atlascard.com/assets/icons/drink.svg: A drink icon\\n⟨42⟩ https://atlascard.com/assets/icons/comb.svg: A comb icon\\n⟨43⟩ https://atlascard.com/</#supper-club>: Dining\\n⟨44⟩ https://atlascard.com/</#hotels>: Hotels\\n⟨45⟩ https://atlascard.com/</#concierge>: Concierge\\n⟨46⟩ https://atlascard.com/</#benefits>: Benefits\\n⟨47⟩ https://atlascard.com/</#card>: Card\\n⟨48⟩ https://atlascard.com/</#app>: App\\n⟨49⟩ https://atlascard.com/<https:/twitter.com/atlascardhq>:  Twitter \\n⟨50⟩ https://atlascard.com/<https:/instagram.com/atlascardhq>:  Instagram \\n⟨51⟩ https://atlascard.com/</legal/statement-disclosure>:  Statement Disclosure \\n⟨52⟩ https://atlascard.com/</legal/privacy>:  Privacy Policy \\n⟨53⟩ https://atlascard.com/</legal/terms>:  Terms of Use \\n⟨54⟩ https://atlascard.com/</download>: Download App\\n⟨55⟩ https://atlascard.com/<https:/assets.atlascard.com/media/atlas_media_kit.zip>:  Media Kit \\n⟨56⟩ https://atlascard.com/</code-of-conduct>: atlascard.com/code-of-conduct\\n⟨57⟩ https://atlascard.com/<https:/atlascard.com/flexpass>: HTTPS://ATLASCARD.COM/FLEXPASS\\n⟨58⟩ https://atlascard.com/<https:/onemedical.com/atlas/>: ONEMEDICAL.COM/ATLAS/\\n⟨59⟩ https://atlascard.com/<https:/atlascard.com/visa-infinite>: HTTPS://ATLASCARD.COM/VISA-INFINITE\\n⟨60⟩ https://atlascard.com/<https:/future.co/atlascard>: HTTPS://FUTURE.CO/ATLASCARD\\n\" fit_markdown='' fit_html=''",
  "generated_description": "### Overview of Atlas\n\n**Company Name**: Atlas  \n**Founded**: 2022  \n**Location**: San Francisco, CA  \n**Team Size**: 25 employees  \n**Website**: [atlascard.com](https://atlascard.com)  \n**Y Combinator Batch**: W19  \n**Group Partner**: Dalton Caldwell  \n**Industry Tags**: Fintech, San Francisco Bay Area\n\n---\n\n### Mission and Services\n\nAtlas operates at the intersection of modern spend management and concierge services, aiming to simplify luxurious experiences for its members. Whether it’s snagging reservations at the hottest restaurants or booking stays at upscale hotels, Atlas turns ordinary tasks into seamless luxury experiences. With an invite-only membership model, users gain access to exclusive dining, hotel, and event experiences that are usually just out of reach.\n\n---\n\n### Key Features\n\n1. **Dining Reservations**:\n   - Members can reserve tables at highly sought-after restaurants like Sartiano’s in NYC and ITO. Atlas aggregates the best dining spots and allows for peak-hour reservations effortlessly through its app or concierge text service.\n\n2. **Hotel Bookings**:\n   - The Atlas app includes a curated selection of luxury hotels, enabling members to book with points or exclusive rates. Notable properties include Aman Tokyo and Badrutt’s Palace Hotel in St. Moritz.\n\n3. **Event Access**:\n   - Atlas offers front-row access to sold-out concerts and major sporting events via a simple text to your dedicated concierge. This includes exclusive passes for events like Coachella.\n\n4. **Luxury Concierge Services**:\n   - Members enjoy personalized assistance with all bookings. The concierge manages requests, ensuring a frictionless experience for travel and leisure.\n\n5. **Unique Benefits**:\n   - Atlas members enjoy distinctive perks such as helicopter rides with BLADE, flexible flight changes via the Atlas FlexPass, and comprehensive purchase protections.\n\n---\n\n### Membership and Card Features\n\n- **Membership Cost**: $1,000 per year  \n- **Card Design**: The Atlas card is crafted from 21 grams of mirror-finished steel, offering a tactile and visually striking experience. It emphasizes privacy with no visible card number and can be personalized with an engraved icon.\n\n- **Reward Points System**:\n   - Earn 5x points on BLADE flights and 3x on hotel bookings through the Atlas app. Membership ensures dynamic rewards—ranging from dining to travel—tailored based on your spending habits.\n\n---\n\n### Conclusion\n\nAtlas is revolutionizing the way affluent consumers manage their spending and experiences, making the once elite accessible through smart technology and a touch of personal service. If you're into hassle-free luxury and exclusive access, this membership might just be worth your while. But remember, it’s not for everyone; only the select few can claim this key to the world. Want in? [Request an Invite](https://atlascard.com/<request-invite>).\n\n--- \n\nAtlas embodies what modern fintech can achieve: a blend of exclusivity and digital convenience. Through its member-centric approach and high-touch services, it’s paving the way for a new era of spend management."
}