{
  "links": "https://www.ycombinator.com/companies/banabo",
  "name": "Banabo",
  "headline": "ML Marketing Infrastructure",
  "batch": "S22",
  "description": "Banabo is the first Marketing Attribution OS with the mission of getting a company’s marketing waste to zero. We help companies achieve this goal by mapping a website visitor’s entire journey through a sale, and showcasing the true impact of each touchpoint. \r\n\nAccurate attribution previously wasn’t possible due to GDPR in the EU, CCPA in California, and the iOS 14 Privacy Changes. And with Google banning tracking cookies in 2023, we’ve built the first fully cookieless marketing attribution solution, using zero personal data.",
  "activity_status": "Active",
  "website": "https://www.banabo.io/",
  "founded_date": 2022.0,
  "team_size": 2.0,
  "location": "San Francisco",
  "group_partner": "Nicolas Dessaigne",
  "group_partner_yc": "https://www.ycombinator.com/people/nicolas-dessaigne",
  "company_linkedin": null,
  "company_twitter": null,
  "tags": "industry:saas; industry:b2b; industry:analytics; location:san-francisco-bay-area",
  "founders": [
    {
      "name": "Colin Snyder, Founder",
      "description": "Co-Founder @ Banabo, the first fully cookieless marketing attribution platform.\nEx-Product @ Tesla, Facebook, & Microsoft\nFeel free to say hi: colin@banabo.io",
      "linkedin": "https://www.linkedin.com/in/colin7snyder/"
    }
  ],
  "status": true,
  "markdown": "raw_markdown='![Namecheap banner](https://img.sedoparking.com/templates/images/hero_nc.svg)\\nThis domain has recently been registered with Namecheap. \\n# banabo.io\\nThis webpage was generated by the domain owner using [Sedo Domain Parking](https://www.banabo.io/<https:/www.sedo.com/services/parking.php3>). Disclaimer: Sedo maintains no relationship with third party advertisers. Reference to any specific service or trade mark is not controlled by Sedo nor does it constitute or imply its association, endorsement or recommendation. \\n[ Privacy Policy ](https://www.banabo.io/<#>)\\n' markdown_with_citations='![Namecheap banner⟨1⟩]\\nThis domain has recently been registered with Namecheap. \\n# banabo.io\\nThis webpage was generated by the domain owner using Sedo Domain Parking⟨2⟩. Disclaimer: Sedo maintains no relationship with third party advertisers. Reference to any specific service or trade mark is not controlled by Sedo nor does it constitute or imply its association, endorsement or recommendation. \\n Privacy Policy ⟨3⟩\\n' references_markdown='\\n\\n## References\\n\\n⟨1⟩ https://img.sedoparking.com/templates/images/hero_nc.svg: Namecheap banner\\n⟨2⟩ https://www.banabo.io/<https:/www.sedo.com/services/parking.php3>: Sedo Domain Parking\\n⟨3⟩ https://www.banabo.io/<#>:  Privacy Policy \\n' fit_markdown='' fit_html=''",
  "generated_description": "**Company Overview: Banabo**\n\n**Founded:** 2022  \n**Location:** San Francisco  \n**Team Size:** 2 employees  \n**Y Combinator Batch:** S22  \n**Website:** [banabo.io](https://www.banabo.io)  \n**Tags:** SaaS, B2B, Analytics, San Francisco Bay Area  \n\n### Mission\nBanabo is on a mission to revolutionize marketing attribution. The company aims to eliminate marketing waste—essentially, ensuring that every dollar spent on marketing is accounted for and effective. Their focus is on tracing the entire journey of a website visitor leading up to a sale, thereby highlighting the true impact of each marketing touchpoint.\n\n### The Problem It Solves\nIn the evolving landscape of digital privacy, accurate marketing attribution has become a challenge. GDPR in the EU, CCPA in California, and significant changes from iOS 14 have complicated how companies track user behavior. To add to that, Google’s ban on tracking cookies in 2023 has left many companies scrambling for solutions. Enter Banabo, with its innovative, fully cookieless marketing attribution system that respects user privacy by not relying on personal data.\n\n### What They Offer\nBanabo provides a unique attribution operating system (OS) that enables businesses to measure the effectiveness of their marketing efforts without the need for cookies or personal data. This positions them not only as a tool to allocate marketing spend efficiently but also as a compliant solution in a world increasingly concerned with digital privacy.\n\n### Key Partner\nNicolas Dessaigne serves as the Group Partner at Banabo, contributing valuable expertise to the startup's growth journey.\n\n### Current Status\nThough still early in its development with a small team, Banabo is setting itself up as a pioneering force in marketing analytics, catering primarily to B2B clients who want to maximize their marketing ROI while remaining compliant with privacy regulations.\n\nIn summary, Banabo isn't just building a product; they’re redefining how businesses understand their marketing performance in a cookie-less, privacy-conscious world. If your company is ready to ditch marketing waste, Banabo might just be the partner you’ve been looking for."
}