{
  "links": "https://www.ycombinator.com/companies/bellabeat",
  "name": "Bellabeat",
  "headline": "Tech-powered women's wellness.",
  "batch": "W14",
  "description": "Founded in 2014, Bellabeat is a data-centered wellness femtech company behind some of the most fashionably designed tech-powered wellness products and one of the fastest-growing wellness subscription services for women. Throughout the years, Bellabeat built the go-to wellness brand with a compelling ecosystem of solutions and services focused on women’s health. The success of the Leaf and Ivy wearables enabled the brand to expand to international markets and kickstart industry discussions on the importance of innovating in the design and development of tech products. Today, Bellabeat is leading the market shift with hyper-personalized holistic wellness offerings aligned with a women’s menstrual cycle.",
  "activity_status": "Active",
  "website": "http://bellabeat.com",
  "founded_date": 2014.0,
  "team_size": 134.0,
  "location": "San Francisco",
  "group_partner": "Michael Seibel",
  "group_partner_yc": "https://www.ycombinator.com/people/michael-seibel",
  "company_linkedin": null,
  "company_twitter": null,
  "tags": "industry:fitness; industry:health-&-wellness; industry:femtech; location:san-francisco-bay-area",
  "founders": [
    {
      "name": "Urska Srsen, Founder/CCO",
      "description": "Urska Srsen is the co­founder and CCO of Bellabeat Inc. Urska is the detail­ obsessed execution force behind Bellabeat’s brand and products.\nIn 2016 Urska was chosen by Forbes as the ambassador of the Technology field for their first European 30 under 30 list. She was nominated as best female entrepreneur in Croatia in 2016 by Veuve Clicquot and has also received the Jabolko Navdiha (Apple of Inspiration) award from the President of the Republic of Slovenia.",
      "linkedin": null
    },
    {
      "name": "Sandro Mur, Founder",
      "description": null,
      "linkedin": null
    }
  ],
  "status": true,
  "markdown": "raw_markdown=\"# 504 Gateway Timeout ERROR\\n## The request could not be satisfied.\\nWe can't connect to the server for this app or website at this time. There might be too much traffic or a configuration error. Try again later, or contact the app or website owner. If you provide content to customers through CloudFront, you can find steps to troubleshoot and help prevent this error by reviewing the CloudFront documentation. ```\\nGenerated by cloudfront (CloudFront) HTTP3 Server\\nRequest ID: IeUG6CYc8Exvtc-tBhyoPZmTANePDwtYYrOLwYAmtikXAlKgHRbOxw==\\n\\n```\\n\\n\" markdown_with_citations=\"# 504 Gateway Timeout ERROR\\n## The request could not be satisfied.\\nWe can't connect to the server for this app or website at this time. There might be too much traffic or a configuration error. Try again later, or contact the app or website owner. If you provide content to customers through CloudFront, you can find steps to troubleshoot and help prevent this error by reviewing the CloudFront documentation. ```\\nGenerated by cloudfront (CloudFront) HTTP3 Server\\nRequest ID: IeUG6CYc8Exvtc-tBhyoPZmTANePDwtYYrOLwYAmtikXAlKgHRbOxw==\\n\\n```\\n\\n\" references_markdown='\\n\\n## References\\n\\n' fit_markdown='' fit_html=''",
  "generated_description": "**Bellabeat: Empowering Women's Wellness Through Technology**\n\nFounded in 2014, Bellabeat is a standout player in the femtech space, positioning itself as a tech-powered champion of women's wellness. With a mission to provide data-centered health solutions tailored specifically for women, Bellabeat has made significant strides over the years, particularly with its stylish wearables—the Leaf and Ivy. These products not only look good but actively engage users in tracking their health metrics in a fashionable way.\n\nThe company initially gained recognition as part of Y Combinator's W14 cohort, and it has blossomed into a recognized brand with a strong ecosystem of wellness solutions. Today, Bellabeat leads the market with offerings focused on holistic, personalized wellness strategies that align with women's menstrual cycles—an innovative approach that highlights the importance of understanding female biology in health technology.\n\nOperating out of San Francisco, Bellabeat boasts a dedicated team of 134 employees and is under the guidance of Michael Seibel as their Group Partner. Their scope of influence spans across several sectors, making them relevant in fitness, health & wellness, and femtech.\n\nAs a brand, Bellabeat is not only about creating products; it's about starting conversations and driving awareness around the necessity of thoughtful design and development in tech for women. With its rapid growth and expansion into international markets, Bellabeat is paving the way for a future where women's health is prioritized in the tech industry.\n\nFor more information on their offerings, you can visit their website at [bellabeat.com](http://bellabeat.com)."
}