{
  "links": "https://www.ycombinator.com/companies/brainhi",
  "name": "BrainHi",
  "headline": "Automated receptionist that answers missed calls for local businesses",
  "batch": "S18",
  "description": "BrainHi is an automated receptionist for local businesses.  Local businesses are in search of new clients and revenue, yet 25% of phone calls to local businesses are missed and 80% of potential clients don’t leave voicemails.\r\n\nBrainHi uses AI to create an automated receptionist that answers  missed calls 24/7 and chats with clients to schedule appointments and answer admin questions, resulting in more business. Cofounders Emmanuel and Israel started BrainHi after Hurricane Maria made communicating with doctors offices nearly impossible on the island of Puerto Rico.",
  "activity_status": "Active",
  "website": "https://www.brainhi.com",
  "founded_date": 2017.0,
  "team_size": 18.0,
  "location": "San Juan, Puerto Rico",
  "group_partner": "Gustaf Alstromer",
  "group_partner_yc": "https://www.ycombinator.com/people/gustaf-alstromer",
  "company_linkedin": null,
  "company_twitter": null,
  "tags": "industry:artificial-intelligence; industry:saas",
  "founders": [],
  "status": true,
  "markdown": null,
  "generated_description": "**BrainHi: Your AI-Powered Receptionist**\n\nFounded in 2017, BrainHi has carved out a niche in the realm of customer communication for local businesses. The brainchild of co-founders Emmanuel and Israel, their journey began in the aftermath of Hurricane Maria, during a time when accessing essential services like medical care in Puerto Rico became a challenge due to poor communication. Seeing an opportunity to help local businesses thrive, they developed BrainHi—an automated receptionist powered by artificial intelligence.\n\nThe mission of BrainHi is straightforward yet significant: to tackle the frustrating problem of missed calls. With 25% of calls to local businesses going unanswered and a staggering 80% of potential clients opting not to leave voicemails, the need for a solution was evident. BrainHi steps in to not only answer these missed calls 24/7 but also engage with clients through chat—scheduling appointments, answering administrative questions, and ultimately driving more revenue for businesses.\n\nBased in San Juan, Puerto Rico, BrainHi has grown its team to 18 dedicated employees and has gained recognition as part of the esteemed Y Combinator Batch S18. They are strategically positioned within the tech landscape, tagged under 'artificial-intelligence' and 'saas', which reflects their commitment to leveraging technology for practical business solutions. \n\nUnder the guidance of Group Partner Gustaf Alstromer, BrainHi continues to innovate and refine its offerings, helping local businesses stay connected with their clients in an increasingly competitive market. For those interested in revolutionizing their customer interaction processes, BrainHi could very well be the partner you need.\n\nYou can learn more about their services and mission at [BrainHi's website](https://www.brainhi.com)."
}