{
  "links": "https://www.ycombinator.com/companies/caremessage",
  "name": "CareMessage",
  "headline": "Patient engagement for low-income populations",
  "batch": "W14",
  "description": "CareMessage is the technology non-profit building the largest patient engagement platform for low-income populations in the United States. Powered by the Health Equity Engine™, the platform enables organizations to combine messaging, data, and interoperability to increase access to care, improve clinical outcomes, and address social drivers of health.\r\n\nWith 20 million patients reached since 2013, CareMessage is the only patient engagement solution proven to improve health equity at scale. The team, many with lived experiences in these communities, leverages a nonprofit model to reinvest revenue into impact. CareMessage is the partner of choice for organizations committed to advancing health equity.",
  "activity_status": "Active",
  "website": "http://caremessage.org",
  "founded_date": 2012.0,
  "team_size": 45.0,
  "location": "San Francisco",
  "group_partner": null,
  "group_partner_yc": null,
  "company_linkedin": null,
  "company_twitter": null,
  "tags": "industry:health-tech; industry:digital-health; location:san-francisco-bay-area",
  "founders": [
    {
      "name": "Cecilia Corral, Founder/Vice President of Product",
      "description": "Driven by her experiences growing up in a low-income immigrant household, Cecilia takes a patient-centric approach to product development with a relentless focus on user research. Outside of her work at CareMessage, she is an advocate for Diversity and Inclusion in the tech industry through collecting and publishing data on Latina Tech Founders. Cecilia was on the 2019 Forbes 30 under 30 list for Healthcare and graduated with a B.S. in Product Design Engineering from Stanford University.",
      "linkedin": "https://www.linkedin.com/in/ceciliacorral"
    },
    {
      "name": "Vineet Singal, Founder/CEO",
      "description": "Vineet Singal is the Co-Founder and CEO of CareMessage. Previously, he conducted and\npublished peer-reviewed research in molecular biology and epidemiology at the Mount\nSinai School of Medicine and the National Institutes of Health. Vineet has served as a\nstudent representative on the Stanford Board of Trustees and the Stanford Medicine\nCommunity Council and graduated with University Distinction from Stanford.",
      "linkedin": "https://www.linkedin.com/in/vineetsingal/"
    }
  ],
  "status": true,
  "markdown": "raw_markdown='Please enable cookies.\\n# Sorry, you have been blocked\\n## You are unable to access caremessage.org\\n## Why have I been blocked?\\nThis website is using a security service to protect itself from online attacks. The action you just performed triggered the security solution. There are several actions that could trigger this block including submitting a certain word or phrase, a SQL command or malformed data.\\n## What can I do to resolve this?\\nYou can email the site owner to let them know you were blocked. Please include what you were doing when this page came up and the Cloudflare Ray ID found at the bottom of this page.\\nCloudflare Ray ID: **914790760c3f3a2c** • Your IP: Click to reveal 103.97.165.190 • Performance & security by [Cloudflare](http://caremessage.org/<https:/www.cloudflare.com/5xx-error-landing>)\\n' markdown_with_citations='Please enable cookies.\\n# Sorry, you have been blocked\\n## You are unable to access caremessage.org\\n## Why have I been blocked?\\nThis website is using a security service to protect itself from online attacks. The action you just performed triggered the security solution. There are several actions that could trigger this block including submitting a certain word or phrase, a SQL command or malformed data.\\n## What can I do to resolve this?\\nYou can email the site owner to let them know you were blocked. Please include what you were doing when this page came up and the Cloudflare Ray ID found at the bottom of this page.\\nCloudflare Ray ID: **914790760c3f3a2c** • Your IP: Click to reveal 103.97.165.190 • Performance & security by Cloudflare⟨1⟩\\n' references_markdown='\\n\\n## References\\n\\n⟨1⟩ http://caremessage.org/<https:/www.cloudflare.com/5xx-error-landing>: Cloudflare\\n' fit_markdown='' fit_html=''",
  "generated_description": "### CareMessage: Bridging the Gap to Health Equity\n\n**Overview:**  \nFounded in 2012 and part of the Y Combinator Batch W14, CareMessage is a San Francisco-based nonprofit on a mission to enhance patient engagement among low-income populations across the United States. With a robust team of 45 employees, CareMessage has made significant strides in healthcare technology—reaching over 20 million patients since its inception.\n\n**The Mission:**  \nAt its core, CareMessage is dedicated to promoting health equity. Leveraging its proprietary Health Equity Engine™, the organization integrates messaging, data, and interoperability into its platform. This holistic approach allows healthcare providers to increase access to care, improve clinical outcomes, and tackle the social factors that contribute to health disparities.\n\n**Impact:**  \nCareMessage stands out as the only proven patient engagement solution delivering scalable improvements in health equity. It collaborates closely with organizations committed to this cause, reinvesting its revenue back into impactful initiatives that benefit the communities it serves.\n\n**Technology and Innovation:**  \nThe platform’s capabilities enable healthcare organizations to create personalized communication with patients, ensuring that individuals receive timely and relevant health information. This is especially vital in underserved communities where access to care is often limited.\n\n**Community and Culture:**  \nMany team members at CareMessage come from the communities they serve, bringing invaluable lived experience and insight into the challenges faced by low-income populations. This connection to the community shapes the organization's innovative solutions and empathetic approach to patient engagement.\n\n**Future Directions:**  \nAs CareMessage continues to expand its reach and refine its technology, it remains focused on its mission to foster health equity. The nonprofit model allows it to adapt swiftly, addressing emerging challenges in health access and outcomes.\n\nFor more information about CareMessage and its initiatives, visit [caremessage.org](http://caremessage.org).\n\nIn summary, CareMessage isn't just another health-tech company; it's a mission-driven organization that integrates community insights with technology to push for a healthier and more equitable future."
}