{
  "links": "https://www.ycombinator.com/companies/circle-medical",
  "name": "Circle Medical",
  "headline": "Modern primary care via video and in-person",
  "batch": "S15",
  "description": "Circle Medical is a venture-backed Y-Combinator healthcare startup on a mission to bring quality, delightful primary care to everyone on the planet. Built by top-tier physicians, engineers, and designers, our medical practice and underlying technology have pioneered how people find and receive care.\r\n\nOur focus on building directly for our patients and providers to address serious care accessibility issues has enabled us to grow over 3X year-over-year. We’re now using our most recent round of funding from WELL Health, backed by Sir Li Ka-shing, to continue building out our hybrid in-clinic and telemedicine model across all fifty states.\r\n\nAs we enter the hypergrowth phase, we are looking for deeply motivated team players who are driven to solve some of the biggest challenges in healthcare so that people can live longer and healthier lives.\r\n\nMore about us can be found on our website!",
  "activity_status": "Active",
  "website": "https://circlemedical.com",
  "founded_date": 2015.0,
  "team_size": 153.0,
  "location": "San Francisco",
  "group_partner": "Dalton Caldwell",
  "group_partner_yc": "https://www.ycombinator.com/people/dalton-caldwell",
  "company_linkedin": null,
  "company_twitter": null,
  "tags": "industry:consumer-health-services; industry:primary-care; location:san-francisco-bay-area",
  "founders": [
    {
      "name": "JS Boulanger, Founder/CTO",
      "description": "Cofounder and CTO at Circle Medical.",
      "linkedin": "https://www.linkedin.com/in/jsboulanger"
    },
    {
      "name": "George Favvas, Founder/CEO",
      "description": "Cofounder of Circle Medical, the fastest-growing digital-first primary care practice.",
      "linkedin": "https://www.linkedin.com/in/georgefavvas"
    },
    {
      "name": "Brent LaRue, Founder/VP Product & Patient Experience",
      "description": "Co-founder, VP of Product & Patient Experience at Circle Medical (YCS15)\nVenture Partner at Pioneer Fund\nPreviously Co-founder, CPO at iollo (YCS22)\n2012 Olympic Semi-Finalist, 400m Hurdles",
      "linkedin": "https://www.linkedin.com/in/laruebrent"
    }
  ],
  "status": true,
  "markdown": "raw_markdown=\"## Pricing and Insurance\\nCash pay\\n$179\\nWith insurance\\n$0-$40*\\n[ Book Appointment ](https://circlemedical.com/<https:/booking-v2.circlemedical.com/>)\\n*75% of patients that used accepted insurance to pay for Video ADHD Appointments paid $40 or less per appointment. \\n![Close icon](https://circlemedical.com/_image?href=%2F_astro%2FdarkClose.WOpVBCqE.svg&w=24&h=24&f=svg)\\n## Pricing and Insurance\\nCash pay\\n$179\\nWith insurance\\n$0-$40*\\n[ Book Appointment ](https://circlemedical.com/<https:/booking-v2.circlemedical.com/>)\\n*75% of patients that used accepted insurance to pay for Video Appointments paid $40 or less per appointment. \\n![Close icon](https://circlemedical.com/_image?href=%2F_astro%2FdarkClose.WOpVBCqE.svg&w=24&h=24&f=svg)\\n![Close icon](https://circlemedical.com/_image?href=%2F_astro%2FdarkClose.WOpVBCqE.svg&w=24&h=24&f=svg)\\n## Pricing and Insurance\\nCash pay\\n$149\\nWith insurance\\n$0-$40*\\n[ Book Appointment ](https://circlemedical.com/<https:/booking-v2.circlemedical.com/>)\\n*75% of patients that used accepted insurance to pay for Video Appointments paid $40 or less per appointment. \\n![Close icon](https://circlemedical.com/_image?href=%2F_astro%2FdarkClose.WOpVBCqE.svg&w=24&h=24&f=svg)\\n![Insurance modal hero](https://circlemedical.com/_image?href=%2F_astro%2Finsurance-logos.CzfmTm-x.webp&f=webp)\\n##  Verify your insurance coverage without entering payment details. \\nTo see if your plan is in network, select a provider and time and create an account. You will be able to check if your plan is in network without having to confirm your appointment or enter any payment information. \\n[ View Available Times ](https://circlemedical.com/<https:/booking-v2.circlemedical.com/>) ![Close icon](https://circlemedical.com/_image?href=%2F_astro%2FdarkClose.WOpVBCqE.svg&w=24&h=24&f=svg)\\n## 4.9\\n(3,401) \\nFull names have been changed in compliance with federal patient privacy laws. \\n[ View Providers ](https://circlemedical.com/<https:/booking-v2.circlemedical.com/>) ![Reviews hero](https://circlemedical.com/_image?href=%2F_astro%2FreviewModalHero.FcHaNqJJ.webp&f=webp)\\n##  Real ADHD patient reviews \\n#### Alexis\\nI could not believe that I got an appointment for ADHD within hours. I had a terrible time trying to get an appointment with the group my insurance recommended. The health practitioner is knowledgeable and kind, and I feel like I'm getting both good physical and psychological support. \\n#### Adalyn\\nI have ADHD and this format of meeting with providers is very ADHD friendly. It makes it easy to make appointments and the reminds and app are helpful. \\n#### Nathen\\nI find the staff and doctors to be very friendly and helpful. Going with Circle Medical has made treatment for ADHD so much easier for me! \\n#### Emerson\\nI've already recommended it to someone else frustrated by their doctor not taking their ADHD symptoms seriously, which is so often the case. \\n#### Shyla\\nCircle Medical helped me get diagnosed for ADHD. It absolutely changed my life for the better. I've already recommended it to multiple people. Access to affordable care like this is amazing and I want everyone to benefit from it. \\n#### Jewel\\nBecause I felt very heard and wasn't embarrassed or shamed for needing to look into ADD medication in my 30s. \\n#### Jasper\\nIt is a very well organized system, efficient and easy. My provider has specific ADHD training and you let us know how your ADHD program rolls (up front). No one likes surprises. My provider was kind and helpful and I got a follow up on our discussion and what I can do to empower myself NOW. Thanks Circle. \\n#### Cloe\\nSo fast and flexible getting an appointment. As someone with ADHD and anxiety looking for a doctor is a daunting task and keeps you from getting the care you need. They also actually listen to you and what's bothering you, working with you to come up with the best course of action. \\n#### Darryl\\nMy provider heard me out and helped me with my ADHD. I really appreciate how smooth it all was. Y'all are great! \\n#### Katherine\\nLove the convenience of the video consultations for refills on my ADHD medication!!! This is wonderful!!! Also love my health practitioner— he is fantastic!!! A++++++ \\n#### Sharon\\nThey are quick, professional, and responsive by app. They also take my insurance — what more can I ask for? \\n#### Matthew\\nMy provider is great. To be honest, for me it started out with wanting to privately get my ADD addressed. But now it is so much more. She seems genuinely concerned about my health and asks questions that help me address and focus on issues as needed. Highly recommend. \\n#### Kyle\\nI have already recommended it to many people. I'm a college student and my university health center has several barriers that make it almost impossible for anyone to afford the services required to get ADHD treatment through them, even with insurance. Circle Medical is convenient and being an app with reminders that I can call from anywhere makes it helpful to remember and make appointments. \\n#### Yvonne\\nThis service is a godsend. I am a single mom of 2 beautiful boys under the age of 5, at home full time as well as working full time. Having the ability to see my provider on a schedule that works for me and takes my insurance is awesome! Thank you guys for all your guidance and support on my journey through life! \\n#### Leland\\nThe scheduling experience is really easy. The provider I chose was on time and she was great. She listened well and I didn't feel rushed or judged. Even though the journey to ask ADHD diagnosis has been a bit scary and anxiety inducing, I left the appointment feeling pretty good about everything. \\n#### Giada\\nJoining Circle Medical has saved my life. I was so lost and didn't know why or what was wrong with me. I took a chance and downloaded the app, and had an appointment in the comfort of my own home within a week. I'm now getting the help I always needed and it has been a game changer. \\n#### Eliza\\nI finally found a provider who cares about me as a patient. She took time to go over my medical history and went to great lengths to go over how ADHD has affected me and we came up with goals that I want to achieve under her care. Medication isn't the only avenue for someone living with ADHD. \\n#### Uriah\\nMy practitioner was extremely friendly and empathetic, and an expert at ADHD and ADD so he knew exactly how to help me and with questions to ask. \\n#### Justin\\nDidn't feel like my last doctor's appointments. My provider felt genuinely compassionate about helping me manage my life obstacles with my ADHD. Was skeptical at first but so glad I made the decision. Super affordable for the quality of care. \\n#### Edwin\\nAs someone who has ADHD, simply setting up an account on the site was so easy. You can tell that this was made with neurodivergent people in mind. Things are just SIMPLE. \\n#### Madalynn\\nThis system, the efficiency, and care behind it is the best that I have come across. I have been uncomfortable addressing issues like ADD and ADHD as an adult, so I put this off for years. My provider has already helped in 2 sessions and I started my prescription within days. I have to say, I am already feeling better simply taking the initial steps. A big thanks to this team! \\n#### Reginald\\nIt has been a good experience for me. If I have any friends or family members who are looking for ADHD help, I will recommend Circle Medical. \\n#### Natalya\\nAs a person with ADHD, going to the doctor in person can be really difficult. I used to put off making appointments because it felt like too many steps and I'd go without seeing a doctor for a few years at a time. Circle Medical allows me to access quality care from home and I never miss my appointments thanks to this convenience. \\n#### Braeden\\nLocally, I've been on a waiting list for seeking an ADHD diagnosis for several months. But then I found this app, and within a few days, it's done! I finally have that peace of mind and can move forward with a treatment plan. Thank you. \\n#### Simone\\nADHD assessment was tailored to adult women. The expert gave nuanced additions and clarification to questions or statements. I feel much better equipped to handle life and am making progress in ways that seemed impossible before. \\n#### June\\nMy provider has been so kind, validating, and understanding. She's helped me understand my ADHD and treat it. \\n#### Zander\\nFinding a good and reliable remote healthcare provider to diagnose and treat ADHD is extremely difficult. Circle Medical has made this process easy for me and I am thankful I chose Circle Medical. \\n#### Immanuel\\nFast and clear appointment and scheduling process. Knowledgeable providers. Responsive support staff. \\n#### Ben\\nMy first interaction with my provider was a positive experience. He listened to my story and we had many things in common. I love having a provider that is also diagnosed with ADHD. This way we can treat my condition properly on a common ground approach. Thank you for being there for me! \\n#### Eric\\nIt is so difficult to access mental health care services right now especially for ADHD, so far I have received immediate and responsive care that has already improved my quality of life, thank you. \\n#### Abdiel\\nHelped me get my ADHD medication renewed when I couldn't find an in-person provider after moving across the country. My provider is amazing and has listened to me, and followed through with my requests beautifully, making sure I'm educated and know what to expect each time I do make a decision/request. \\n#### Camryn\\nMy provider is very professional and knowledgeable about ADHD. She also asks for and listens to my opinions about my treatment. The available hours are convenient. I don't have to take any time off from work. \\n#### Deanna\\nI am very happy with my treatment and my provider has been really great and helpful. I came to Circle from Done, and Circle is far better at patient follow-up and working with me so that I can manage my ADHD in the best way possible. Also, I am very happy with the communication with Circle Medical. \\n#### Van\\nI'm very likely to recommend Circle Medical because of the progress that I have made. My provider has made it possible for me to accept and understand my ADHD with the upmost positivity and total honesty. I have never been able to love and accept myself till now. \\n3,367 more reviews available upon request \\n![Close icon](https://circlemedical.com/_image?href=%2F_astro%2FdarkClose.WOpVBCqE.svg&w=24&h=24&f=svg)\\n## 4.98\\n(1,759) \\nFull names have been changed in compliance with federal patient privacy laws. \\n[ View Providers ](https://circlemedical.com/<https:/booking-v2.circlemedical.com/>) ![Reviews hero](https://circlemedical.com/_image?href=%2F_astro%2FreviewModalHero.FcHaNqJJ.webp&f=webp)\\n##  Real Hormone Therapy patient reviews \\n#### Hailey\\nExcellent bedside manner, honest and trustworthy. A fantastic Physician and an amazing ally to have throughout my transition journey. She will slow me down if it's needed and I always feel she's doing her due diligence in my case. \\n#### Cynthia\\nI am so grateful to have found Dr. Mirza. She was warm, patient, wise, and always leaves me feeling seen and heard. \\n#### Frannie\\nShe is awesome as always. She always makes sure that I feel better and comfortable. She really takes good care of my health too. She does not just give me meds but made sure that I'd be healthy. You can ask her anything without feeling anxious. \\n#### Dahlia\\nDaniela was great. She explained the process of care and path quite well. I felt seen, heard, and possessed self-agency during the visit. I would highly recommend Daniela. \\n#### Beatrice\\nMs. Smith has been the best PCP I have ever worked with. I'm very glad for both my physical and emotional health, she listens to every one of my concerns and ACTUALLY addresses them! \\n#### Katherine\\nLove the convenience of the video consultations for refills on my ADHD medication!!! This is wonderful!!! Also love my health practitioner— he is fantastic!!! A++++++ \\n#### Giada\\nMy first time ever having a consultation about hormone therapy and Dr. Ibarra made it the best! \\n#### George\\nI am so happy with Dr. Lauren, she has been so understanding and compassionate towards my health and wellbeing. I would give her a 1000 star rating if it let me. Much Light, Love, and Positivity to Dr. Lauren and all of the wonderful folks at Circle Medical. \\n#### Evelyn\\nWhat a phenomenal person Mia is. She was kind, compassionate, and knowledgeable. I am grateful to her for her fantastic care and looking forward to talking further with her about my journey. Thanks Mia!! \\n#### George\\nElizabeth is amazing! She takes excellent care of me during appointments and in-between. \\n#### Ava\\nAlways friendly! I always feel comfortable talking to him and he asks me my thoughts on his treatment plans and allows it to be more of a collaborative process. I love it! \\n#### Darryl\\nI love Dr Fontanilla. I have never felt so comfortable receiving gender-affirming care before. Thank you so much, Dr. Fontanilla!!! \\n#### Bradley\\nVery kind and informative. Absolutely one of the best interactions I have ever had with a health care provider. \\n#### Andrew\\nI appreciate it a lot with my follow ups and medication for my journey along the way. \\n#### Alexandra\\nI have nothing but good things to say. Very professional, detailed, and polite. The best experience I've ever had with a medical professional. \\n#### Jeremy\\nShe has a level of care I need and I was pleasantly surprised at the depth of social concern she has. I'm excited to continue working with her! \\n#### Lawrence\\nKatelyn was very helpful and provided a lot of great direction in our conversation. I felt like she genuinely cared about my medical needs, and was a great conversationalist, in addition to providing great care. \\n#### Frederique\\nAwesome Doctor, Listens and Cares. \\n1,000+ more reviews available upon request \\n![Close icon](https://circlemedical.com/_image?href=%2F_astro%2FdarkClose.WOpVBCqE.svg&w=24&h=24&f=svg)\\n## 4.97\\n(70,053) \\nFull names have been changed in compliance with federal patient privacy laws. \\n[ View Providers ](https://circlemedical.com/<https:/booking-v2.circlemedical.com/>) ![Reviews hero](https://circlemedical.com/_image?href=%2F_astro%2FreviewModalHero.FcHaNqJJ.webp&f=webp)\\n##  Patient Reviews \\n#### Neil\\nQuick and thorough appointment! Was able to help me with my needs and do some follow up! \\n#### Kathy\\nMy provider was attentive, compassionate, and professional, I’m absolutely recommending Circle Medical. \\n#### Yona\\nHas been wonderful! My provider makes each appt feel so comfortable. I'm able to talk about anything, express concerns, and fill her in on my progress without worry of judgement. She also gives input to reassure me that things I notice are normal and gave possible options for helping manage it. I highly suggest working with Circle Medical! \\n#### Steve\\nMy provider was great. He listened to my concerns and what I felt I needed. He gave me great feedback a plan for success and resources that I didn't know about. I will definitely go back to Circle Medical. \\n#### Danny\\nI am in a very good place now with a big thanks going out to Circle Medical. I can't express just how much they have helped me. I am truly grateful. \\n#### Carla\\nI am so happy with my provider, she has been so understanding and compassionate towards my health and wellbeing. I would give her a 1000 star rating if it let me. Much Light, Love and Positivity to my provider and all of the wonderful folks at Circle Medical. \\n#### Vance\\nMy provider seems to genuinely care about his patients and the problems they are experiencing. He truly listened to what I had to say and was a wealth of knowledge for what I’ve been dealing with. I would recommend Circle to anyone as my provider is very personable, professional, and a wealth of knowledge. I have been very pleased with him along with the Circle Medical service. \\n#### Kylie\\nMy provider was excellent! She made me feel comfortable, put my mind at ease and gave me some really good suggestions for my health. I would highly recommend Circle. \\n#### Faith\\nMy initial experience with my provider was perfect. She had a wonderful attitude and everything you would want in a virtual visit. I didn't expect to even use the services with Circle Medical but I'm 100% going to now. I'm all in, with all of my treatment needs. \\n#### Selina\\nOutstanding Job! My provider cares and takes her time to review the details as well as find the best solutions to help with my situation. I'm glad I chose her and look forward to working with her on a better note than being sick. \\n#### Avery\\nExceptional care provider. Mindful. Organized. Informed. Could not give enough positive feedback about my provider or Circle Medical. Thank you both! \\n#### Azalea\\nMy provider is very pleasant and easy to talk to. This appointment she was able to squeeze me in on a weekend kind of last minute. I'm glad I switched to Circle Medical and am under her care. The video appointments are extremely convenient for me. \\n#### Jules\\nWonderful provider. Very thorough and clear with diagnosis and suggestions. I am so thankful for Circle Medical. \\n#### Joy\\nMy provider is an incredibly good listener, cares about my well being, and is very detailed and thorough. As an individual who struggled to find good care, I'm so happy I found her through Circle!!! \\n#### Felix\\nVery thorough. I love my primary provider at Circle, but I also love that if I need a last minute appointment, all of the heath professionals are amazing. \\n#### Jamil\\nSuper informative and polite! Will definitely be switching over to Circle Medical! \\n#### Ruby\\nPhenomenal — I am a person who is cautious of doctors appointments due to being treated poorly by providers in the past. My provider at Circle Medical was very professional, very sensitive and addressed my concerns. \\n#### Braiden\\nAll of my appointments have been efficient and thorough. Circle Medical is easy to navigate and convenient. \\n#### Bailey\\nCircle has helped me change my life. I don't know how to explain without taking 8 hrs but since I have been with my provider, he has helped transform my life with ADHD Treatment plus general overall heath, yearly blood tests and whatever health concerns I have had over the last 2 years. I can't thank him enough along with Circle Medical. \\n#### Mark\\nI’m extremely satisfied with the customer service, my provider is very knowledgeable and caring for her patients. Always follows up with me, to check my mental and physical health condition. Thank you so much again. \\n#### Kristin\\nMy provider is the absolute best! She answered all my questions via messages, helped me get this appointment early, and then gave me reassurances that I am indeed on the right path, as well as explained to me more questions I had. I'm so glad I have her as my Dr! \\n#### Zora\\nLiterally incredible!!! Made me feel so comfortable and understood!!! \\n#### Bernadette\\nMy provider is the best provider I’ve ever had. She’s caring, so intelligent, and really listens to me and hears me. I adore her, and would highly recommend Circle Medical to anyone looking primary care! \\n#### Aiden\\nExtremely kind and straight to the point. My provider listened to all my concerns and addressed them thoroughly, I also appreciate how she treated me like a person and not just another patient. Very professional and am extremely satisfied with how she was able to get to the root of the problem without rushing to it. Definitely recommend. \\n#### Florence\\nThis was the best experience I’ve had with a doctor! she listened to all of my concerns & was able to guide me in the right direction. I will continue to see her for my follow-up appointments and am feeling very hopeful. \\n#### Dianna\\nFor the first time ever, I finally feel like I had a real substantial visit with a provider. I learned more about my diagnosis, medication, treatment plan, etc. in this one 20-minute appointment then I’ve had in two years. Very kind, friendly, professional. I’m looking forward to more appointments like this one. This is how telemedicine should be. \\n#### Immanuel\\nThis was an extremely helpful and productive visit for me. The doctor needed to coordinate my records and prescriptions with new upcoming laws. I appreciate knowing I am in such good hands. I am so thankful for telemedicine because I have been unable to get into a doctors office in person. Thank you to Circle Medical for offering this amazing platform for medicine it will always be my go to. And thank you to the amazing doctors on Circle Medical. \\n#### Evan\\nMy provider is my absolute FAVORITE Doctor/NP EVER! She's understanding, patient, empathetic, attentive and incredibly encouraging. I'm SOO HAPPY that I made the decision to go with Circle. I've only just begun care/ treatment and its already been life changing. Thanks to my provider! You're seriously my hero! \\n#### Gary\\nThis was my first virtual medical visit. Not only was this visit convenient, the provider was personable and patient and made my concerns were addressed. I’m so happy to have found Circle Medical. This was the most personable medical visit…and it was virtual. Your passion for what you do is acknowledged and truly appreciated! Thank you. \\n#### Mariana\\nI was nervous at first, but my provider was able to make me feel comfortable. She explained everything. Thank you. \\nThousands more reviews available upon request \\n![Close icon](https://circlemedical.com/_image?href=%2F_astro%2FdarkClose.WOpVBCqE.svg&w=24&h=24&f=svg)\\n## 4.95\\n(495,613) \\nFull names have been changed in compliance with federal patient privacy laws. \\n[ View Providers ](https://circlemedical.com/<https:/booking-v2.circlemedical.com/>) ![Reviews hero](https://circlemedical.com/_image?href=%2F_astro%2FreviewModalHero.FcHaNqJJ.webp&f=webp)\\n##  Patient Reviews \\n#### Alexandra\\nI have nothing but good things to say. Very professional, detailed, and polite. The best experience I've ever had with a medical professional. \\n#### Darryl\\nI love Dr Fontanilla. I have never felt so comfortable receiving gender-affirming care before. Thank you so much, Dr. Fontanilla!!! \\n#### Ava\\nAlways friendly! I always feel comfortable talking to him and he asks me my thoughts on his treatment plans and allows it to be more of a collaborative process. I love it! \\n#### Beatrice\\nMs. Smith has been the best PCP I have ever worked with. I'm very glad for both my physical and emotional health, she listens to every one of my concerns and ACTUALLY addresses them! \\n#### Frannie\\nShe is awesome as always. She always makes sure that I feel better and comfortable. She really takes good care of my health too. She does not just give me meds but made sure that I'd be healthy. You can ask her anything without feeling anxious. \\n#### Giada\\nMy first time ever having a consultation about hormone therapy and Dr. Ibarra made it the best! \\n#### Cynthia\\nI am so grateful to have found Dr. Mirza. She was warm, patient, wise, and always leaves me feeling seen and heard. \\n#### Frederique\\nAwesome Doctor, Listens and Cares. \\n#### Bradley\\nVery kind and informative. Absolutely one of the best interactions I have ever had with a health care provider. \\n#### Dahlia\\nDaniela was great. She explained the process of care and path quite well. I felt seen, heard, and possessed self-agency during the visit. I would highly recommend Daniela. \\n#### Andrew\\nI appreciate it a lot with my follow ups and medication for my journey along the way. \\n#### Evelyn\\nWhat a phenomenal person Mia is. She was kind, compassionate, and knowledgeable. I am grateful to her for her fantastic care and looking forward to talking further with her about my journey. Thanks Mia!! \\n#### George\\nElizabeth is amazing! She takes excellent care of me during appointments and in-between. \\n#### George\\nI am so happy with Dr. Lauren, she has been so understanding and compassionate towards my health and wellbeing. I would give her a 1000 star rating if it let me. Much Light, Love, and Positivity to Dr. Lauren and all of the wonderful folks at Circle Medical. \\n#### Lawrence\\nKatelyn was very helpful and provided a lot of great direction in our conversation. I felt like she genuinely cared about my medical needs, and was a great conversationalist, in addition to providing great care. \\n#### Hailey\\nExcellent bedside manner, honest and trustworthy. A fantastic Physician and an amazing ally to have throughout my transition journey. She will slow me down if it's needed and I always feel she's doing her due diligence in my case. \\n#### Katherine\\nLove the convenience of the video consultations for refills on my ADHD medication!!! This is wonderful!!! Also love my health practitioner— he is fantastic!!! A++++++ \\n#### Jeremy\\nShe has a level of care I need and I was pleasantly surprised at the depth of social concern she has. I'm excited to continue working with her! \\n1,000+ more reviews available upon request \\n![Close icon](https://circlemedical.com/_image?href=%2F_astro%2FdarkClose.WOpVBCqE.svg&w=24&h=24&f=svg)\\n![Sleep mask icon](https://circlemedical.com/_image?href=%2F_astro%2Fsleep-mask-icon.JihqulMX.svg&f=svg)\\n##  Sleep Evaluation \\nYour provider will perform a comprehensive sleep and health evaluation during your first appointment in order to diagnose the causes of your disrupted sleep, and possibly recommend an At-Home Sleep Study. Depending on the results, your provider will then determine the appropriate treatment. \\n[ Book Appointment ](https://circlemedical.com/<https:/booking-v2.circlemedical.com/>) ![Provider Nikki Tsang](https://circlemedical.com/_image?href=%2F_astro%2Fjennifer-herrera.CPQqhpIe.webp&w=24&h=24&f=webp)\\nSame-day Availabilities \\n![Insurance modal hero](https://circlemedical.com/_image?href=%2F_astro%2Fsleep-mask.ozH9OCaO.webp&f=webp) ![Close icon](https://circlemedical.com/_image?href=%2F_astro%2Fclose.CrQlWPOt.webp&w=24&h=24&f=webp)\\n[ ![Circle Medical logo](https://circlemedical.com/_image?href=%2F_astro%2Flogo.B6HQVoip.webp&w=190&f=webp) ](https://circlemedical.com/</>)\\nWhat we treat  [FAQs](https://circlemedical.com/<https:/help.circlemedical.com/>) [ Providers ](https://circlemedical.com/<https:/booking-v2.circlemedical.com/providers>) [ Locations ](https://circlemedical.com/</circle-locations>) [ About ](https://circlemedical.com/</about-circle>)\\n  * [ Log in ](https://circlemedical.com/<https:/booking-v2.circlemedical.com/homepage/?utm_source=cm-landings>)\\n  * [ Book Now ](https://circlemedical.com/<https:/booking-v2.circlemedical.com/>)\\n\\n\\n![Trust icon](https://circlemedical.com/_image?href=%2F_astro%2Ftrust-icon.vP_3AAue.webp&w=48&h=48&f=webp)\\n### Trusted by over 50,000 patients every month.\\nFeatured\\n[ ADHD ](https://circlemedical.com/</what-we-treat/adhd>)[ Annual Checkup ](https://circlemedical.com/</what-we-treat/annual-checkup>)[ Gender Affirming Care ](https://circlemedical.com/</what-we-treat/hormone-therapy>)[ Mental Health ](https://circlemedical.com/</what-we-treat/mental-health>)[ Sleep Apnea ](https://circlemedical.com/</what-we-treat/sleep-apnea>)[ Weight Loss ](https://circlemedical.com/</what-we-treat/weight-loss>)\\nPrimary Care\\n[ Allergies ](https://circlemedical.com/</what-we-treat/allergies>)[ Anemia ](https://circlemedical.com/</what-we-treat/anemia-care>)[ Asthma ](https://circlemedical.com/</what-we-treat/asthma>)[ Annual Checkup ](https://circlemedical.com/</what-we-treat/annual-checkup>)[ Bronchitis ](https://circlemedical.com/</what-we-treat/bronchitis>)[ Diabetes ](https://circlemedical.com/</what-we-treat/diabetes-care-circle>)[ Heartburn ](https://circlemedical.com/</what-we-treat/heartburn>)[ Hair Loss Treatment ](https://circlemedical.com/</what-we-treat/hair-loss>)[ Hypertension ](https://circlemedical.com/</what-we-treat/hypertension>)\\nPrimary Care (continued)\\n[ Irritable Bowel Syndrome (IBS) ](https://circlemedical.com/</what-we-treat/ibs>)[ Injury and Illness ](https://circlemedical.com/</what-we-treat/injury-illness>)[ Migraines ](https://circlemedical.com/</what-we-treat/migraines>)[ Skincare ](https://circlemedical.com/</what-we-treat/skincare-circle>)[ Sinus Infections ](https://circlemedical.com/</what-we-treat/sinusitis>)[ Strep Throat ](https://circlemedical.com/</what-we-treat/strep-throat-and-tonsillitis>)[ Thyroid Care ](https://circlemedical.com/</what-we-treat/thyroid>)[ Tobacco Cessation ](https://circlemedical.com/</what-we-treat/tobacco-cessation>)[ Vaccinations ](https://circlemedical.com/</what-we-treat/vaccinations>)[ Weight Loss ](https://circlemedical.com/</what-we-treat/weight-loss>)\\nWomen's Health\\n[ Preventative Care ](https://circlemedical.com/</what-we-treat/womens-health>)[ Menopause Hormone Therapy ](https://circlemedical.com/</what-we-treat/menopause-hormone-therapy>)[ UTI Care ](https://circlemedical.com/</what-we-treat/uti-care>)[ Contraception ](https://circlemedical.com/</what-we-treat/contraception>)\\nMen's Health\\n[ Male Pattern Baldness ](https://circlemedical.com/</what-we-treat/hair-loss>)[ Preventative Care ](https://circlemedical.com/</what-we-treat/mens-health>)\\nBehavioral Health\\n[ ADHD ](https://circlemedical.com/</what-we-treat/adhd>)[ Anxiety ](https://circlemedical.com/</what-we-treat/anxiety>)[ Depression ](https://circlemedical.com/</what-we-treat/depression>)[ Mental Health ](https://circlemedical.com/</what-we-treat/mental-health>)\\nSleep Care\\n[ Sleep Care ](https://circlemedical.com/</what-we-treat/sleep-medicine>)[ Insomnia ](https://circlemedical.com/</what-we-treat/insomnia>)[ Sleep Apnea ](https://circlemedical.com/</what-we-treat/sleep-apnea>)[ Sleep Disorders ](https://circlemedical.com/</what-we-treat/sleep-and-migraines>)[ At-Home Sleep Study ](https://circlemedical.com/</what-we-treat/sleep-study>)\\nLGBTQ+ Health\\n[ Gender Affirming Care ](https://circlemedical.com/</what-we-treat/hormone-therapy>)[ PrEP ](https://circlemedical.com/</what-we-treat/prep>)\\n[ ![Circle Medical logo](https://circlemedical.com/_image?href=%2F_astro%2Flogo.B6HQVoip.webp&w=159&f=webp) ](https://circlemedical.com/</>)\\nWhat we treat \\n![Trust icon](https://circlemedical.com/_image?href=%2F_astro%2Ftrust-icon.vP_3AAue.webp&w=48&h=48&f=webp)\\n### Trusted by over 50,000 patients every month.\\nFeatured\\n[ ADHD ](https://circlemedical.com/</what-we-treat/adhd>)[ Annual Checkup ](https://circlemedical.com/</what-we-treat/annual-checkup>)[ Gender Affirming Care ](https://circlemedical.com/</what-we-treat/hormone-therapy>)[ Mental Health ](https://circlemedical.com/</what-we-treat/mental-health>)[ Sleep Apnea ](https://circlemedical.com/</what-we-treat/sleep-apnea>)[ Weight Loss ](https://circlemedical.com/</what-we-treat/weight-loss>)\\nPrimary Care\\n[ Allergies ](https://circlemedical.com/</what-we-treat/allergies>)[ Anemia ](https://circlemedical.com/</what-we-treat/anemia-care>)[ Asthma ](https://circlemedical.com/</what-we-treat/asthma>)[ Annual Checkup ](https://circlemedical.com/</what-we-treat/annual-checkup>)[ Bronchitis ](https://circlemedical.com/</what-we-treat/bronchitis>)[ Diabetes ](https://circlemedical.com/</what-we-treat/diabetes-care-circle>)[ Heartburn ](https://circlemedical.com/</what-we-treat/heartburn>)[ Hair Loss Treatment ](https://circlemedical.com/</what-we-treat/hair-loss>)[ Hypertension ](https://circlemedical.com/</what-we-treat/hypertension>)\\nPrimary Care (continued)\\n[ Irritable Bowel Syndrome (IBS) ](https://circlemedical.com/</what-we-treat/ibs>)[ Injury and Illness ](https://circlemedical.com/</what-we-treat/injury-illness>)[ Migraines ](https://circlemedical.com/</what-we-treat/migraines>)[ Skincare ](https://circlemedical.com/</what-we-treat/skincare-circle>)[ Sinus Infections ](https://circlemedical.com/</what-we-treat/sinusitis>)[ Strep Throat ](https://circlemedical.com/</what-we-treat/strep-throat-and-tonsillitis>)[ Thyroid Care ](https://circlemedical.com/</what-we-treat/thyroid>)[ Tobacco Cessation ](https://circlemedical.com/</what-we-treat/tobacco-cessation>)[ Vaccinations ](https://circlemedical.com/</what-we-treat/vaccinations>)[ Weight Loss ](https://circlemedical.com/</what-we-treat/weight-loss>)\\nWomen's Health\\n[ Preventative Care ](https://circlemedical.com/</what-we-treat/womens-health>)[ Menopause Hormone Therapy ](https://circlemedical.com/</what-we-treat/menopause-hormone-therapy>)[ UTI Care ](https://circlemedical.com/</what-we-treat/uti-care>)[ Contraception ](https://circlemedical.com/</what-we-treat/contraception>)\\nMen's Health\\n[ Male Pattern Baldness ](https://circlemedical.com/</what-we-treat/hair-loss>)[ Preventative Care ](https://circlemedical.com/</what-we-treat/mens-health>)\\nBehavioral Health\\n[ ADHD ](https://circlemedical.com/</what-we-treat/adhd>)[ Anxiety ](https://circlemedical.com/</what-we-treat/anxiety>)[ Depression ](https://circlemedical.com/</what-we-treat/depression>)[ Mental Health ](https://circlemedical.com/</what-we-treat/mental-health>)\\nSleep Care\\n[ Sleep Care ](https://circlemedical.com/</what-we-treat/sleep-medicine>)[ Insomnia ](https://circlemedical.com/</what-we-treat/insomnia>)[ Sleep Apnea ](https://circlemedical.com/</what-we-treat/sleep-apnea>)[ Sleep Disorders ](https://circlemedical.com/</what-we-treat/sleep-and-migraines>)[ At-Home Sleep Study ](https://circlemedical.com/</what-we-treat/sleep-study>)\\nLGBTQ+ Health\\n[ Gender Affirming Care ](https://circlemedical.com/</what-we-treat/hormone-therapy>)[ PrEP ](https://circlemedical.com/</what-we-treat/prep>)\\nFeatured \\n[ ADHD ](https://circlemedical.com/</what-we-treat/adhd>)[ Annual Checkup ](https://circlemedical.com/</what-we-treat/annual-checkup>)[ Gender Affirming Care ](https://circlemedical.com/</what-we-treat/hormone-therapy>)[ Mental Health ](https://circlemedical.com/</what-we-treat/mental-health>)[ Sleep Apnea ](https://circlemedical.com/</what-we-treat/sleep-apnea>)[ Weight Loss ](https://circlemedical.com/</what-we-treat/weight-loss>)\\nPrimary Care \\n[ Allergies ](https://circlemedical.com/</what-we-treat/allergies>)[ Anemia ](https://circlemedical.com/</what-we-treat/anemia-care>)[ Asthma ](https://circlemedical.com/</what-we-treat/asthma>)[ Annual Checkup ](https://circlemedical.com/</what-we-treat/annual-checkup>)[ Bronchitis ](https://circlemedical.com/</what-we-treat/bronchitis>)[ Diabetes ](https://circlemedical.com/</what-we-treat/diabetes-care-circle>)[ Heartburn ](https://circlemedical.com/</what-we-treat/heartburn>)[ Hair Loss Treatment ](https://circlemedical.com/</what-we-treat/hair-loss>)[ Hypertension ](https://circlemedical.com/</what-we-treat/hypertension>)\\nPrimary Care (continued) \\n[ Irritable Bowel Syndrome (IBS) ](https://circlemedical.com/</what-we-treat/ibs>)[ Injury and Illness ](https://circlemedical.com/</what-we-treat/injury-illness>)[ Migraines ](https://circlemedical.com/</what-we-treat/migraines>)[ Skincare ](https://circlemedical.com/</what-we-treat/skincare-circle>)[ Sinus Infections ](https://circlemedical.com/</what-we-treat/sinusitis>)[ Strep Throat ](https://circlemedical.com/</what-we-treat/strep-throat-and-tonsillitis>)[ Thyroid Care ](https://circlemedical.com/</what-we-treat/thyroid>)[ Tobacco Cessation ](https://circlemedical.com/</what-we-treat/tobacco-cessation>)[ Vaccinations ](https://circlemedical.com/</what-we-treat/vaccinations>)[ Weight Loss ](https://circlemedical.com/</what-we-treat/weight-loss>)\\nWomen's Health \\n[ Preventative Care ](https://circlemedical.com/</what-we-treat/womens-health>)[ Menopause Hormone Therapy ](https://circlemedical.com/</what-we-treat/menopause-hormone-therapy>)[ UTI Care ](https://circlemedical.com/</what-we-treat/uti-care>)[ Contraception ](https://circlemedical.com/</what-we-treat/contraception>)\\nMen's Health \\n[ Male Pattern Baldness ](https://circlemedical.com/</what-we-treat/hair-loss>)[ Preventative Care ](https://circlemedical.com/</what-we-treat/mens-health>)\\nBehavioral Health \\n[ ADHD ](https://circlemedical.com/</what-we-treat/adhd>)[ Anxiety ](https://circlemedical.com/</what-we-treat/anxiety>)[ Depression ](https://circlemedical.com/</what-we-treat/depression>)[ Mental Health ](https://circlemedical.com/</what-we-treat/mental-health>)\\nSleep Care \\n[ Sleep Care ](https://circlemedical.com/</what-we-treat/sleep-medicine>)[ Insomnia ](https://circlemedical.com/</what-we-treat/insomnia>)[ Sleep Apnea ](https://circlemedical.com/</what-we-treat/sleep-apnea>)[ Sleep Disorders ](https://circlemedical.com/</what-we-treat/sleep-and-migraines>)[ At-Home Sleep Study ](https://circlemedical.com/</what-we-treat/sleep-study>)\\nLGBTQ+ Health \\n[ Gender Affirming Care ](https://circlemedical.com/</what-we-treat/hormone-therapy>)[ PrEP ](https://circlemedical.com/</what-we-treat/prep>)\\n[ FAQs ](https://circlemedical.com/<https:/help.circlemedical.com/>) [ Providers ](https://circlemedical.com/<https:/booking-v2.circlemedical.com/providers>) [ Locations ](https://circlemedical.com/</circle-locations>) [ About ](https://circlemedical.com/</about-circle>)\\n[ Book Now ](https://circlemedical.com/<https:/booking-v2.circlemedical.com/>) [ Log in ](https://circlemedical.com/<https:/booking-v2.circlemedical.com/homepage/?utm_source=cm-landings>)\\n![](https://arttrk.com/pixel/?ad_log=referer&action=lead&pixid=7303a09c-db2c-4abe-b123-6c1e0acb2017)\\n# Accessible Primary Care.\\n# Over video and in person.\\n  * ![Calendar icon](https://circlemedical.com/_image?href=%2F_astro%2Fcalendar.CIb-Vsk0.svg&f=svg) Same and next day availabilities\\n  * ![Health shield icon](https://circlemedical.com/_image?href=%2F_astro%2Fhealth-shield.JfPlXNq5.svg&f=svg) In network with most PPO's\\n  * ![People icon](https://circlemedical.com/_image?href=%2F_astro%2Fpeople.OLn01eJZ.svg&f=svg) 2 million+ video appointments held\\n  * ![Pill icon](https://circlemedical.com/_image?href=%2F_astro%2Fpill.D2ljIGMq.svg&f=svg) Prescriptions when clinically appropriate\\n\\n\\n[ Book Appointment ](https://circlemedical.com/<https:/booking-v2.circlemedical.com>)\\n![Provider Nikki Tsang](https://circlemedical.com/_image?href=%2F_astro%2Fnikki-tsang.BHKI55_A.webp&w=24&h=24&f=webp)\\nAvailabilities Today \\n![Home hero](https://circlemedical.com/_image?href=%2F_astro%2Fhome-hero.nuteqkZ2.webp&f=webp)\\nFrequently accepted plans with \\n![Blue Cross](https://circlemedical.com/_image?href=%2F_astro%2Fblue-cross-blue-shield.C8IcIoWW.webp&h=32&f=webp) ![United Healthcare](https://circlemedical.com/_image?href=%2F_astro%2Funited-healthcare.BfxgyswI.webp&h=32&f=webp) ![Anthem](https://circlemedical.com/_image?href=%2F_astro%2Fanthem.D5ZtbkAy.webp&h=32&f=webp) ![Aetna](https://circlemedical.com/_image?href=%2F_astro%2Faetna.DvgSqnj4.webp&h=32&f=webp) ![Cigna](https://circlemedical.com/_image?href=%2F_astro%2Fcigna.DKP2MSbA.webp&h=32&f=webp) ![Blue California](https://circlemedical.com/_image?href=%2F_astro%2Fblue-california.CE0jYQVC.webp&h=32&f=webp) ![UMR](https://circlemedical.com/_image?href=%2F_astro%2Fumr.DaVJNtMO.webp&h=32&f=webp) ![Health Net](https://circlemedical.com/_image?href=%2F_astro%2Fhealth-net.Wrm1SfTs.webp&h=32&f=webp) ![Meritain Health](https://circlemedical.com/_image?href=%2F_astro%2Fmeritain-health.B_TEttIr.webp&h=32&f=webp)\\nMany more!\\n##  Why 300,000+ patients have rated our providers 4.95/5 on average. \\n[ View Availabilities ](https://circlemedical.com/<https:/booking-v2.circlemedical.com>)\\n## Primary Care, Centered on You\\nWe offer same and next-day appointments with board-certified primary care providers in just a few clicks, and accept most PPO insurance. Your primary care provider is your first stop on your healthcare journey, and can work with you to treat a wide range of conditions and ailments. If medically appropriate, your provider will be able to evaluate your symptoms, answer your questions, and offer treatment plans that may include certain prescription medications which can be sent to your local pharmacy for pickup. We also offer [in-person care](https://circlemedical.com/</circle-locations>) in a number of locations. Depending on your medical needs and the evaluation of your provider, we may refer you to a specialist or in-person provider after your initial telemedicine appointment to ensure you get the care you need. \\n[ View Availabilities ](https://circlemedical.com/<https:/booking-v2.circlemedical.com/>)\\n[ ![ADHD treatment](https://circlemedical.com/_image?href=%2F_astro%2Fadhd.BezInrVk.webp&f=webp) ADHD ![Learn more about ADHD treatment](https://circlemedical.com/_image?href=%2F_astro%2Farrow.Bo5Q5HTc.svg&f=svg) ](https://circlemedical.com/</what-we-treat/adhd>)[ ![Hair Loss treatment](https://circlemedical.com/_image?href=%2F_astro%2Fhair-loss.B1RrbIcz.webp&f=webp) Hair Loss ![Learn more about Hair Loss treatment](https://circlemedical.com/_image?href=%2F_astro%2Farrow.Bo5Q5HTc.svg&f=svg) ](https://circlemedical.com/</what-we-treat/hair-loss>)[ ![Sleep Apnea treatment](https://circlemedical.com/_image?href=%2F_astro%2Fsleep-apnea.MX0sNOP5.webp&f=webp) Sleep Apnea ![Learn more about Sleep Apnea treatment](https://circlemedical.com/_image?href=%2F_astro%2Farrow.Bo5Q5HTc.svg&f=svg) ](https://circlemedical.com/</what-we-treat/sleep-apnea>)[ ![Hormone Therapy treatment](https://circlemedical.com/_image?href=%2F_astro%2Fhormone-therapy.ybEscg4K.webp&f=webp) Hormone Therapy ![Learn more about Hormone Therapy treatment](https://circlemedical.com/_image?href=%2F_astro%2Farrow.Bo5Q5HTc.svg&f=svg) ](https://circlemedical.com/</what-we-treat/hormone-therapy>)[ ![Skin Care treatment](https://circlemedical.com/_image?href=%2F_astro%2Fskin-care.xi9rcIZM.webp&f=webp) Skin Care ![Learn more about Skin Care treatment](https://circlemedical.com/_image?href=%2F_astro%2Farrow.Bo5Q5HTc.svg&f=svg) ](https://circlemedical.com/</what-we-treat/skincare-circle>)[ ![Other treatments](https://circlemedical.com/_image?href=%2F_astro%2Fall-areas-of-care.RBBmMA0p.webp&f=webp) All areas of care ![Learn more about Other treatments](https://circlemedical.com/_image?href=%2F_astro%2Farrow.Bo5Q5HTc.svg&f=svg) ](https://circlemedical.com/</what-we-treat/services-and-treatments>)\\n## Selection\\n400+ active providers\\n![Selection](https://circlemedical.com/_image?href=%2F_astro%2Fselection.ejgGyQL5.webp&f=webp)\\n## Coverage\\nLicensed in 30 states\\n![Coverage](https://circlemedical.com/_image?href=%2F_astro%2Fcoverage.8OdzJ874.webp&f=webp)\\n## Convenience\\nManage care in our app\\n![Convenience](https://circlemedical.com/_image?href=%2F_astro%2Fconvenience.BIlq9Ogp.webp&f=webp)\\n## Availability\\nBook around your schedule\\n![Availability](https://circlemedical.com/_image?href=%2F_astro%2Favailability.Bd0DsB1V.webp&f=webp)\\nTreating thousands of patients daily in:\\n  * AZ\\n  * CA\\n  * CO\\n  * CT\\n  * DC\\n  * FL\\n  * GA\\n  * IL\\n  * IA\\n  * KY\\n  * ME\\n  * MD\\n  * MA\\n  * MI\\n  * MN\\n  * NV\\n  * NJ\\n  * NM\\n  * NY\\n  * NC\\n  * OH\\n  * OK\\n  * OR\\n  * PA\\n  * SC\\n  * TN\\n  * TX\\n  * UT\\n  * VT\\n  * VA\\n  * WA\\n  * WI\\n\\n\\n##  A complete doctor's office in one simple app. \\n![Book appointment](https://circlemedical.com/_image?href=%2F_astro%2Fbook.CLEPMRK-.svg&f=svg)\\nBook\\n![Cancel appointment](https://circlemedical.com/_image?href=%2F_astro%2Fcancel.CqUE80i8.svg&f=svg)\\nCancel\\n![Chat with Doctor](https://circlemedical.com/_image?href=%2F_astro%2Fchat.DVA4-_99.svg&f=svg)\\nChat\\n![View prescriptions](https://circlemedical.com/_image?href=%2F_astro%2Fprescriptions.CFDKtvAA.svg&f=svg)\\nPrescriptions\\n![View Appointment Summaries](https://circlemedical.com/_image?href=%2F_astro%2Fappointment-summaries.CdR9joAJ.svg&f=svg)\\nAppointment Summaries\\n![Reschedule Appointment](https://circlemedical.com/_image?href=%2F_astro%2Freschedule.Dw_AhDQ0.svg&f=svg)\\nReschedule\\n![View Lab Results](https://circlemedical.com/_image?href=%2F_astro%2Flab-results.CTWZIOol.svg&f=svg)\\nLab Results\\n![Abstract background](https://circlemedical.com/_image?href=%2F_astro%2Fcomplete-drs-office-bg.DQB6t58d.svg&f=svg)\\n![iPhone showing app booking interface](https://circlemedical.com/_image?href=%2F_astro%2Fapp-book.mq1vn3m8.webp&f=webp)![iPhone showing app cancel interface](https://circlemedical.com/_image?href=%2F_astro%2Fapp-cancel.CR5eArPG.webp&f=webp)![iPhone showing app chat interface](https://circlemedical.com/_image?href=%2F_astro%2Fapp-chat.BsmRDRrQ.webp&f=webp)![iPhone showing app prescriptions interface](https://circlemedical.com/_image?href=%2F_astro%2Fapp-prescriptions.CnoTIIZN.webp&f=webp)![iPhone showing app appointments summary interface](https://circlemedical.com/_image?href=%2F_astro%2Fapp-appointments-summary.DC0c-5iN.webp&f=webp)![iPhone showing app reschedule interface](https://circlemedical.com/_image?href=%2F_astro%2Fapp-reschedule.DRuxK87z.webp&f=webp)![iPhone showing app lab results interface](https://circlemedical.com/_image?href=%2F_astro%2Fapp-lab-results.DzBYdqzG.webp&f=webp)\\n![Genuine relationship](https://circlemedical.com/_image?href=%2F_astro%2Fgenuine-relationship.Ch0tV8CQ.webp&f=webp)\\n##  Build a genuine, trusting relationship. \\nVirtual care can seem scary - but we make it feel just like an in-person encounter. Our primary care providers share one goal: to learn what makes you unique so they can guide you on your journey towards achieving and maintaining optimal health. \\n![Video thumbnail](https://circlemedical.com/_image?href=%2F_astro%2Fvideo-thumbnail.Dkm9shds.webp&f=webp) ![Play button](https://circlemedical.com/_image?href=%2F_astro%2Fthumbnail-play-button.CKOxNCiy.svg&f=svg)\\n### Hear it from a real patient.\\nSloane's story (2 min)\\n## 400+ Providers.\\n## 100% Confidence.\\nHeld to an exceptionally high standard of evidence-based care. \\n[ All providers ](https://circlemedical.com/</providers>)\\n![Dr. Nicole Tsang](https://circlemedical.com/_image?href=%2F_astro%2Fnicole-tsang.B9LLD7o7.webp&f=webp)\\n### Dr. Nicole Tsang\\nBoard Certified, Family Medicine,\\n17 years of experience\\n[ Learn More Learn more about Dr. Nicole Tsang ![Read more arrow](https://circlemedical.com/_image?href=%2F_astro%2Farrow.BcvjUB1O.svg&f=svg) ](https://circlemedical.com/<https:/booking-v2.circlemedical.com/provider/?slug=nicole-tsang-d-o>)\\n![Kerri Taylor, PA-C](https://circlemedical.com/_image?href=%2F_astro%2Fkerri-taylor.Cj13S-gj.webp&f=webp)\\n### Kerri Taylor, PA-C\\nBoard Certified, Primary Care,\\n3 years of experience\\n[ Learn More Learn more about Kerri Taylor, PA-C ![Read more arrow](https://circlemedical.com/_image?href=%2F_astro%2Farrow.BcvjUB1O.svg&f=svg) ](https://circlemedical.com/<https:/booking-v2.circlemedical.com/provider/?slug=kerri-taylor-pa-c>)\\n![Jeanne Bird, PA-C](https://circlemedical.com/_image?href=%2F_astro%2Fjeanne-bird.piP2uPYP.webp&f=webp)\\n### Jeanne Bird, PA-C\\nBoard Certified, Family Medicine,\\n20 years of experience\\n[ Learn More Learn more about Jeanne Bird, PA-C ![Read more arrow](https://circlemedical.com/_image?href=%2F_astro%2Farrow.BcvjUB1O.svg&f=svg) ](https://circlemedical.com/<https:/booking-v2.circlemedical.com/provider/?slug=jeanne-bird-pa-c>)\\n![Steven Winslow, PA-C](https://circlemedical.com/_image?href=%2F_astro%2Fsteven-winslow.Dte5VqGY.webp&f=webp)\\n### Steven Winslow, PA-C\\nBoard Certified, Internal Medicine,\\n27 years of experience\\n[ Learn More Learn more about Steven Winslow, PA-C ![Read more arrow](https://circlemedical.com/_image?href=%2F_astro%2Farrow.BcvjUB1O.svg&f=svg) ](https://circlemedical.com/<https:/booking-v2.circlemedical.com/provider/?slug=steven-winslow-pa-c>)\\n## In person visits when you need them.\\nSometimes virtual doesn't cut it. We have three flagship locations in New York, San Francisco, and Beverly Hills, and satellite clinics across the country. \\n[ View Locations ](https://circlemedical.com/</circle-locations>)\\n![House with Fat Pipe logo](https://circlemedical.com/_image?href=%2F_astro%2Fimg1.CbCOSUBR.webp&f=webp)![Panoramic shot of a building](https://circlemedical.com/_image?href=%2F_astro%2Fpanoramic-building.CtzMkmba.webp&f=webp)![Texas Med front house shot](https://circlemedical.com/_image?href=%2F_astro%2Ftexas-med.Dro5a0kx.webp&f=webp)![Circle Medical sitting area](https://circlemedical.com/_image?href=%2F_astro%2Fimg4.Ccc2PWNU.webp&f=webp)\\n![Medco Share meeting's room entrance](https://circlemedical.com/_image?href=%2F_astro%2Fmedcoshare.DS1UGUYF.webp&f=webp)![Office with a vault for door](https://circlemedical.com/_image?href=%2F_astro%2Fvault.FV7aku7F.webp&f=webp)![Font desk of Spaces](https://circlemedical.com/_image?href=%2F_astro%2Fspaces-front-desk.x1WH2t3L.webp&f=webp)\\n![Building with big windows](https://circlemedical.com/_image?href=%2F_astro%2Fbuilding-with-big-windows.DLZvKkFS.webp&f=webp)![Spacious wooden floor sitting area](https://circlemedical.com/_image?href=%2F_astro%2Fspacious-wooden-sitting-area.DkrwIxrH.webp&f=webp)\\n![Modern waiting area](https://circlemedical.com/_image?href=%2F_astro%2Fmodern-waiting-area.CsGM6FKN.webp&f=webp)![Building entrance](https://circlemedical.com/_image?href=%2F_astro%2Fbuilding-entrance.XrZ7YDHT.webp&f=webp)\\n![Wide shot of the street](https://circlemedical.com/_image?href=%2F_astro%2Fstreet-wide-shot.CeICRnSc.webp&f=webp)![Reception with mask sign](https://circlemedical.com/_image?href=%2F_astro%2Freception-with-mask-sign.rlPumjs9.webp&f=webp)![House driveway with a parking lot next to it](https://circlemedical.com/_image?href=%2F_astro%2Fparking-lot.DNXFt_kV.webp&f=webp)\\n![Spacious reception with wooden floor](https://circlemedical.com/_image?href=%2F_astro%2Fspacious-reception-with-wooden-floor.CAVmXYsf.webp&f=webp)![Reception with wooden floor](https://circlemedical.com/_image?href=%2F_astro%2Freception-with-wooden-floor.6fvkqXdv.webp&f=webp)![Sitting area with chairs](https://circlemedical.com/_image?href=%2F_astro%2Fsitting-area-with-chairs.BoYmQv0O.webp&f=webp)![Reception with marble front](https://circlemedical.com/_image?href=%2F_astro%2Freception-with-marble-front.F99SadBj.webp&f=webp)\\n##  Primary Care Visits with Circle Medical \\n[ Get Started ](https://circlemedical.com/<https:/booking-v2.circlemedical.com/providers>)\\nSame-day availability\\nVideo visits\\nIn person visits\\nManage care via app\\nTime required\\nCheck-ups\\nPrescriptions available, when appropriate\\nIn app appt. summaries\\n![Circle Medical](https://circlemedical.com/icon.png)\\n20-30min. \\nDoctor'soffice \\nHours\\n##  Don't take our word for it. \\nWe are trusted by over 50,000 patients every month. Here's what they have to say. \\n  * ![Quote](https://circlemedical.com/_image?href=%2F_astro%2Fquote.CFK1LnVI.webp&h=24&f=webp)\\nEasy, fast booking, respectful treatment, great documentation and communication. My provider listens to me, takes my input into account and treats me like an equal, not like an annoyance. Can't recommend enough, A+++++\\nTim\\n  * ![Quote](https://circlemedical.com/_image?href=%2F_astro%2Fquote.CFK1LnVI.webp&h=24&f=webp)\\nEase of use, flexibility with schedule, and the provider was informative on the medical issue while delivering care with a nonbiased approach.\\nChristopher\\n  * ![Quote](https://circlemedical.com/_image?href=%2F_astro%2Fquote.CFK1LnVI.webp&h=24&f=webp)\\nI found an amazing provider who has helped me more in the last few months than a team of specialists over the course of nearly a decade of care.\\nMala\\n  * ![Quote](https://circlemedical.com/_image?href=%2F_astro%2Fquote.CFK1LnVI.webp&h=24&f=webp)\\nProviders are compassionate, supportive and clear\\nHailey\\n  * ![Quote](https://circlemedical.com/_image?href=%2F_astro%2Fquote.CFK1LnVI.webp&h=24&f=webp)\\nMy provider made it easy to talk about my medical past, was understanding and listened to what was going on.\\nDerek\\n  * ![Quote](https://circlemedical.com/_image?href=%2F_astro%2Fquote.CFK1LnVI.webp&h=24&f=webp)\\nEasy process, you can do it in the own comfort of your home.\\nAna\\n  * ![Quote](https://circlemedical.com/_image?href=%2F_astro%2Fquote.CFK1LnVI.webp&h=24&f=webp)\\nI feel completely secure with my providers from Circle Medical to give me wholistic care above and beyond just the symptoms. I trust them, and that's very important to me.\\nSkyler\\n  * ![Quote](https://circlemedical.com/_image?href=%2F_astro%2Fquote.CFK1LnVI.webp&h=24&f=webp)\\nMr provider is great. I feel he is thorough and cares about my well being. I also like that it's affordable even without insurance.\\nAmiah\\n  * ![Quote](https://circlemedical.com/_image?href=%2F_astro%2Fquote.CFK1LnVI.webp&h=24&f=webp)\\nI love the provider I've been consulting with. She's attentive and helps me make informed decisions on any adjustments to medication.\\nCesar\\n  * ![Quote](https://circlemedical.com/_image?href=%2F_astro%2Fquote.CFK1LnVI.webp&h=24&f=webp)\\nFinding a good and reliable remote healthcare provider to diagnose and treat ADHD is extremely difficult. Circle Medical has made this process easy for me and I am thankful I chose Circle Medical.\\nZander\\n  * ![Quote](https://circlemedical.com/_image?href=%2F_astro%2Fquote.CFK1LnVI.webp&h=24&f=webp)\\nThe services provided by Circle Medical are excellent and all my questions and concerns have been answered. I have had nothing but great experiences with them.\\nSanai\\n  * ![Quote](https://circlemedical.com/_image?href=%2F_astro%2Fquote.CFK1LnVI.webp&h=24&f=webp)\\nCare is personal and effective. I appreciate them taking a moment to understand how I am doing. Never rushed.\\nPrecious\\n  * ![Quote](https://circlemedical.com/_image?href=%2F_astro%2Fquote.CFK1LnVI.webp&h=24&f=webp)\\nMy provider makes things so easy to understand, she's kind and upfront, and very knowledgeable. I always leave our meetings feeling confident about what we're doing.\\nSteve\\n  * ![Quote](https://circlemedical.com/_image?href=%2F_astro%2Fquote.CFK1LnVI.webp&h=24&f=webp)\\nThe care I've received from my providers has been excellent. They genuinely care about you as a person.\\nMadalynn\\n  * ![Quote](https://circlemedical.com/_image?href=%2F_astro%2Fquote.CFK1LnVI.webp&h=24&f=webp)\\nThe practitioners are very knowledgeable, trustworthy, understanding, kind & they listen! I have been using Circle Medical for almost a year & I highly recommend it! :-)\\nRosemary\\n  * ![Quote](https://circlemedical.com/_image?href=%2F_astro%2Fquote.CFK1LnVI.webp&h=24&f=webp)\\nIt's easy to get an appointment. It's nice to be able to not have to sit in an office waiting to be seen. My provider makes me feel like she actually remembers me and I'm not just another folder slapped on her desk. It's very nice. She also discusses treatment with me instead of just throwing pills at me and saying do this or do that. I feel involved and in charge of my own health.\\nLouis\\n  * ![Quote](https://circlemedical.com/_image?href=%2F_astro%2Fquote.CFK1LnVI.webp&h=24&f=webp)\\nGreat experience and exceptional customer service! Made my experience so easy and manageable.\\nTerry\\n  * ![Quote](https://circlemedical.com/_image?href=%2F_astro%2Fquote.CFK1LnVI.webp&h=24&f=webp)\\nVery smooth and easy process to get in touch with knowledgeable providers who care. The patient care team is always quick to respond in resolving issues as well. Highly recommend!\\nTerrence\\n  * ![Quote](https://circlemedical.com/_image?href=%2F_astro%2Fquote.CFK1LnVI.webp&h=24&f=webp)\\nInformed, polite, and consistent staff, operating under an obviously organized system to provide quality care.\\nLanden\\n  * ![Quote](https://circlemedical.com/_image?href=%2F_astro%2Fquote.CFK1LnVI.webp&h=24&f=webp)\\nSo easy to work with and around my busy schedule. My provider is amazing and I am loving the medical care that I am receiving.\\nNathanael\\n  * ![Quote](https://circlemedical.com/_image?href=%2F_astro%2Fquote.CFK1LnVI.webp&h=24&f=webp)\\nMy provider has been really attentive. When I reached out for customer support on what I thought were side effects of a new medication, I received replies promptly.\\nShelby\\n  * ![Quote](https://circlemedical.com/_image?href=%2F_astro%2Fquote.CFK1LnVI.webp&h=24&f=webp)\\nIt has been fast and easy. The clinicians are great and I found my primary care through this. I love how they are even knowledgeable about LGBTQ+ stuff which is exactly what I've been looking for.\\nEmerson\\n  * ![Quote](https://circlemedical.com/_image?href=%2F_astro%2Fquote.CFK1LnVI.webp&h=24&f=webp)\\nIt was a very personal and safe experience that made me feel absolutely comfortable talking about my personal problems and helping me find a solution.\\nSam\\n  * ![Quote](https://circlemedical.com/_image?href=%2F_astro%2Fquote.CFK1LnVI.webp&h=24&f=webp)\\nThey accepted my insurance, easy to schedule an appointment, easy to communicate with my doctor and they have been helping me with my health in the comfort of my home.\\nMJ\\n  * ![Quote](https://circlemedical.com/_image?href=%2F_astro%2Fquote.CFK1LnVI.webp&h=24&f=webp)\\nMy provider is truly a pleasure to work with. She is very informative understanding and has impeccable bedside manner.\\nDeshawn\\n  * ![Quote](https://circlemedical.com/_image?href=%2F_astro%2Fquote.CFK1LnVI.webp&h=24&f=webp)\\nAccess and personal connection. The three providers I interacted with seem to have gone out of their way to make things easy for me. It was a seamless experience from assessment/consultation, labs, and medications; it all just worked. As an NP I now know I want to work for an organization like Circle.\\nRolando\\n  * ![Quote](https://circlemedical.com/_image?href=%2F_astro%2Fquote.CFK1LnVI.webp&h=24&f=webp)\\nCircle Medical has in all honesty provided me with the most attentive, compassionate, and informed health care I've ever received. Being able to get care that fits with my demanding and unusual work schedule is a game-changer. So many times in the past I've been unable to access care I needed, or follow-up care, because of travel issues, time constraints, and my own anxiety & depression.\\nSelah\\n  * ![Quote](https://circlemedical.com/_image?href=%2F_astro%2Fquote.CFK1LnVI.webp&h=24&f=webp)\\nCircle Medical makes getting medical services easy and convenient. Also, their customer service has been great all around. When issues with medication come up with the pharmacy, Circle Medical personnel have quickly resolved the issues.\\nHannah\\n  * ![Quote](https://circlemedical.com/_image?href=%2F_astro%2Fquote.CFK1LnVI.webp&h=24&f=webp)\\nThe provider was extremely kind and thorough, the app is very easy to use, and I had no problems picking up my prescription.\\nCarlo\\n  * ![Quote](https://circlemedical.com/_image?href=%2F_astro%2Fquote.CFK1LnVI.webp&h=24&f=webp)\\nThe process to schedule was easy, appointments were available quickly, and the practitioner was thorough, friendly, professional, and compassionate.\\nXiomara\\n  * ![Quote](https://circlemedical.com/_image?href=%2F_astro%2Fquote.CFK1LnVI.webp&h=24&f=webp)\\nI have already referred friends to Circle for mental health treatment. It's been life-changing for me.\\nCelia\\n  * ![Quote](https://circlemedical.com/_image?href=%2F_astro%2Fquote.CFK1LnVI.webp&h=24&f=webp)\\nEasy to schedule and do appointments, the biggest plus for me is that the prescription is sent immediately after the appointment to my desired pharmacy with no delay, and if I need to change pharmacies that's also extremely quick.\\nMegan\\n  * ![Quote](https://circlemedical.com/_image?href=%2F_astro%2Fquote.CFK1LnVI.webp&h=24&f=webp)\\nI can take the appointment anywhere. I couldn't find a psychiatrist nearby and resorted to virtual. Circle Medical is a doctor in your pocket and I love it. I love my provider too.\\nDemarcus\\n  * ![Quote](https://circlemedical.com/_image?href=%2F_astro%2Fquote.CFK1LnVI.webp&h=24&f=webp)\\nI love the app. Excellent. You could book on an appt early or on weekends. The provider I work with is knowledgeable, friendly, compassionate and very supportive and thorough!!!\\nJames\\n  * ![Quote](https://circlemedical.com/_image?href=%2F_astro%2Fquote.CFK1LnVI.webp&h=24&f=webp)\\nSuper convenient. Compassionate, amazing practitioner who takes a holistic approach to my care.\\nArianna\\n  * ![Quote](https://circlemedical.com/_image?href=%2F_astro%2Fquote.CFK1LnVI.webp&h=24&f=webp)\\nCircle Medical was able to get me the help and care I needed when I needed it most. Local doctors and health services were too booked to be able to help me soon enough. Circle got me connected with health professionals quickly and with ease. Quite simply, Circle saved my life.\\nReese\\n  * ![Quote](https://circlemedical.com/_image?href=%2F_astro%2Fquote.CFK1LnVI.webp&h=24&f=webp)\\nExtremely convenient! The provider I had was extremely empathetic, thorough, and listened. No more worrying about finding time to drive to the doctors.\\nOliver\\n  * ![Quote](https://circlemedical.com/_image?href=%2F_astro%2Fquote.CFK1LnVI.webp&h=24&f=webp)\\nOh my word! This experience has changed my life. No more wasted time in traffic, being exposed to others' germs, long waits in the ‘waiting' room. I've gotten the help I didn't know I needed. And the providers are consistently working with me to tweak things or address anything else that might not be quite right. I have cried tears of happiness at having hope again, and how much better I feel!\\nLindsay\\n  * ![Quote](https://circlemedical.com/_image?href=%2F_astro%2Fquote.CFK1LnVI.webp&h=24&f=webp)\\nThey are absolutely amazing!!\\nJoe\\n  * ![Quote](https://circlemedical.com/_image?href=%2F_astro%2Fquote.CFK1LnVI.webp&h=24&f=webp)\\nVery understanding!! And absolutely adore the chat portal, where I can express how I'm feeling!!! Thank you Circle Medical 🙏 This journey wouldn't be possible without y'all's help! ❤.\\nCasey\\n  * ![Quote](https://circlemedical.com/_image?href=%2F_astro%2Fquote.CFK1LnVI.webp&h=24&f=webp)\\nEasy, fast booking, respectful treatment, great documentation and communication. My provider listens to me, takes my input into account and treats me like an equal, not like an annoyance. Can't recommend enough, A+++++\\nTim\\n  * ![Quote](https://circlemedical.com/_image?href=%2F_astro%2Fquote.CFK1LnVI.webp&h=24&f=webp)\\nEase of use, flexibility with schedule, and the provider was informative on the medical issue while delivering care with a nonbiased approach.\\nChristopher\\n  * ![Quote](https://circlemedical.com/_image?href=%2F_astro%2Fquote.CFK1LnVI.webp&h=24&f=webp)\\nI found an amazing provider who has helped me more in the last few months than a team of specialists over the course of nearly a decade of care.\\nMala\\n  * ![Quote](https://circlemedical.com/_image?href=%2F_astro%2Fquote.CFK1LnVI.webp&h=24&f=webp)\\nProviders are compassionate, supportive and clear\\nHailey\\n\\n\\n##  Frequently Asked Questions \\nGeneral\\n#  Do new patients need to prepare anything for their first appointment at Circle Medical? \\nFor a detailed breakdown of what you need for your first appointment with Circle Medical, read the article below: \\n[ How to Prepare for Your First Appointment ](https://circlemedical.com/<https:/help.circlemedical.com/en/articles/9592028-how-to-prepare-for-your-first-appointment>)\\n#  Why would I choose a virtual telemedicine appointment over going to my doctor's office? \\nWith Circle Medical, you don't have to. We have flagship clinics in San Francisco, Beverly Hills, and New York City, with more coming soon, and offer limited in-person clinic availability for our established ADHD patients at 24 shared clinic locations. \\nVirtual appointments allow our patients to see their providers in the comfort of their own homes, without the hassle of travel, finding parking, or taking time off of work. Our providers are also able to offer more flexible hours beyond what in-person doctor's offices provide. \\n#  What if I need in-person testing or examinations? \\nFor virtual appointments, if any in-person care is needed, such as bloodwork, vaccinations, or other testing, our providers are able to send the appropriate request to a nearby lab. Results will be integrated with our HIPAA-compliant mobile app so that patients have access to all of their medical records in one secure place. \\n#  How much does this cost me? \\nFor those with insurance, cost will depend on the specific type of care you receive and the coverage of your insurance plan. We provide a cost estimate based on each patient's insurance plan when they book an appointment. \\nFor those without insurance, we provide the self-pay costs of each appointment when a patient is booking their appointment. \\n#  What states do you operate in? \\nTo see our list of currently available states, begin booking an appointment. \\nYou must be currently residing in the state of treatment as well as have your primary pharmacy be in that same state in order to be a patient at our practice. \\nBilling\\n#  How do I know how much my specific appointment will cost? \\nWe provide a cost estimate when you are booking your appointment. For those with insurance, your actual cost is determined after we submit the insurance claim for your appointment. Once we submit the claim, insurance companies will pay for a portion of the appointment and pass on any remaining cost to you. Once we know what this cost is, we will update you with an invoice within the app. \\n#  When do I get charged for my appointment? \\nFor those with insurance, it typically takes 1-3 weeks for the insurance claim to be processed. Once processed, we'll send you an invoice within the app with any remaining costs. You can then opt to pay through the app, or we will automatically charge the payment card on file after 48 hours of sending you the invoice. \\nFor those without insurance (or with out of network insurance), we will send you the invoice 1-2 days after your appointment is completed. You can then opt to pay through the app, or we will automatically charge the payment card on file after 48 hours of sending you the invoice. \\nInsurance\\n#  How long are the appointments? \\nThe first intake appointment is 30 minutes. Follow-up appointments are 20 minutes each. \\n#  What insurance do you accept? \\nWe accept over 1,500+ insurance plans. We cover most of the major PPO insurance companies (payors) across the United States. The best way to confirm coverage of your insurance plan is to begin booking an appointment on our website or via our mobile app. During the booking process, you'll be prompted to enter your insurance information for a real-time verification of your insurance plan. \\n#  What if I am having issues verifying my insurance plan coverage? \\nCall the Member Services number on the back of your insurance card to confirm coverage. You can reference our NPI: 1134596091. For additional assistance, use our in-app chat to message our team. \\n#  What is the total cost of diagnosis and treatment? \\nYour per-appointment costs are set by your insurance plan. If the costs seem high, you may be on a high deductible health plan (HDHP). This means that you have an annual out-of-pocket amount that you must pay on healthcare in a given year before your insurance plan will cover more of your per-appointment costs. \\nIf you are on an HDHP and have confirmed your insurance information in our mobile app, your remaining deductible for the year will be displayed on the “Book Appointment” page. Note that this amount may be outdated if you have had recent insurance claims processed. \\n[ ![Circle Medical Logo](https://circlemedical.com/_image?href=%2F_astro%2Flogo.B6HQVoip.webp&f=webp) ](https://circlemedical.com/</>)\\nMedical services provided by Circle Medical Care of California, an independent medical practice. CA Medical Board permit #FNP3274. \\nCompany [Home](https://circlemedical.com/</>) [About Circle](https://circlemedical.com/</about-circle>) [Become a Provider](https://circlemedical.com/</become-a-circle-medical-provider>) [Locations](https://circlemedical.com/</circle-locations>) [Providers](https://circlemedical.com/<https:/booking-v2.circlemedical.com/providers>) [Reviews](https://circlemedical.com/</reviews>) [Blog](https://circlemedical.com/</blog>) [Insurance](https://circlemedical.com/</insurance>) [What we Treat](https://circlemedical.com/</what-we-treat/services-and-treatments>) [App features](https://circlemedical.com/</app-features>) [Careers](https://circlemedical.com/</careers>)\\nWe're hiring\\nResources [Help Center](https://circlemedical.com/<https:/help.circlemedical.com/en>) [COVID-19 Testing](https://circlemedical.com/</covid>) [Investor Relations](https://circlemedical.com/<https:/www.well.company/for-investors/stock-information>) [Terms of Use](https://circlemedical.com/</legal/terms-of-use>) [Privacy Policy](https://circlemedical.com/</legal/privacy-policy>) [Human-AI Principles](https://circlemedical.com/</human-ai-principles>) [Patient Rights and Responsibilities](https://circlemedical.com/</legal/patient-rights-and-responsibilities>) [Consent to Treatment](https://circlemedical.com/</legal/consent-to-treatment>)\\nDownload\\n[ ![Download on the App Store](https://circlemedical.com/_image?href=%2F_astro%2Fapp-store-download.D3LuLGPX.svg&f=svg) ](https://circlemedical.com/<https:/itunes.apple.com/us/app/circle-medical-doctor-house/id1003540833>) [ ![Download on Google Play](https://circlemedical.com/_image?href=%2F_astro%2Fgoogle-play-download.DLgSzPTq.svg&f=svg) ](https://circlemedical.com/<https:/play.google.com/store/apps/details?id=co.circlemedical.patient>)\\n![Send email to Circle Medical](https://circlemedical.com/_image?href=%2F_astro%2Femail.cYyduyfL.webp&f=webp) [ ![Facebook logo](https://circlemedical.com/_image?href=%2F_astro%2Ffacebook.T5SLZ7RN.webp&f=webp) ](https://circlemedical.com/<https:/www.facebook.com/circlemedical>) [ ![Linkedin logo](https://circlemedical.com/_image?href=%2F_astro%2Flinkedin.CmWqeV51.webp&f=webp) ](https://circlemedical.com/<https:/www.linkedin.com/company/circle-medical>) [ ![Twitter logo](https://circlemedical.com/_image?href=%2F_astro%2Ftwitter.lT4U7MsQ.webp&f=webp) ](https://circlemedical.com/<https:/twitter.com/circlemd>)\\n* Patient names and identities have been changed to protect Patient Health Information (PHI)\\n© 2015-2025 Circle Medical Technologies, Inc. 333 1st Street #A, San Francisco, CA, 94105\\n\" markdown_with_citations=\"## Pricing and Insurance\\nCash pay\\n$179\\nWith insurance\\n$0-$40*\\n Book Appointment ⟨1⟩\\n*75% of patients that used accepted insurance to pay for Video ADHD Appointments paid $40 or less per appointment. \\n![Close icon⟨2⟩]\\n## Pricing and Insurance\\nCash pay\\n$179\\nWith insurance\\n$0-$40*\\n Book Appointment ⟨1⟩\\n*75% of patients that used accepted insurance to pay for Video Appointments paid $40 or less per appointment. \\n![Close icon⟨2⟩]\\n![Close icon⟨2⟩]\\n## Pricing and Insurance\\nCash pay\\n$149\\nWith insurance\\n$0-$40*\\n Book Appointment ⟨1⟩\\n*75% of patients that used accepted insurance to pay for Video Appointments paid $40 or less per appointment. \\n![Close icon⟨2⟩]\\n![Insurance modal hero⟨3⟩]\\n##  Verify your insurance coverage without entering payment details. \\nTo see if your plan is in network, select a provider and time and create an account. You will be able to check if your plan is in network without having to confirm your appointment or enter any payment information. \\n View Available Times ⟨1⟩ ![Close icon⟨2⟩]\\n## 4.9\\n(3,401) \\nFull names have been changed in compliance with federal patient privacy laws. \\n View Providers ⟨1⟩ ![Reviews hero⟨4⟩]\\n##  Real ADHD patient reviews \\n#### Alexis\\nI could not believe that I got an appointment for ADHD within hours. I had a terrible time trying to get an appointment with the group my insurance recommended. The health practitioner is knowledgeable and kind, and I feel like I'm getting both good physical and psychological support. \\n#### Adalyn\\nI have ADHD and this format of meeting with providers is very ADHD friendly. It makes it easy to make appointments and the reminds and app are helpful. \\n#### Nathen\\nI find the staff and doctors to be very friendly and helpful. Going with Circle Medical has made treatment for ADHD so much easier for me! \\n#### Emerson\\nI've already recommended it to someone else frustrated by their doctor not taking their ADHD symptoms seriously, which is so often the case. \\n#### Shyla\\nCircle Medical helped me get diagnosed for ADHD. It absolutely changed my life for the better. I've already recommended it to multiple people. Access to affordable care like this is amazing and I want everyone to benefit from it. \\n#### Jewel\\nBecause I felt very heard and wasn't embarrassed or shamed for needing to look into ADD medication in my 30s. \\n#### Jasper\\nIt is a very well organized system, efficient and easy. My provider has specific ADHD training and you let us know how your ADHD program rolls (up front). No one likes surprises. My provider was kind and helpful and I got a follow up on our discussion and what I can do to empower myself NOW. Thanks Circle. \\n#### Cloe\\nSo fast and flexible getting an appointment. As someone with ADHD and anxiety looking for a doctor is a daunting task and keeps you from getting the care you need. They also actually listen to you and what's bothering you, working with you to come up with the best course of action. \\n#### Darryl\\nMy provider heard me out and helped me with my ADHD. I really appreciate how smooth it all was. Y'all are great! \\n#### Katherine\\nLove the convenience of the video consultations for refills on my ADHD medication!!! This is wonderful!!! Also love my health practitioner— he is fantastic!!! A++++++ \\n#### Sharon\\nThey are quick, professional, and responsive by app. They also take my insurance — what more can I ask for? \\n#### Matthew\\nMy provider is great. To be honest, for me it started out with wanting to privately get my ADD addressed. But now it is so much more. She seems genuinely concerned about my health and asks questions that help me address and focus on issues as needed. Highly recommend. \\n#### Kyle\\nI have already recommended it to many people. I'm a college student and my university health center has several barriers that make it almost impossible for anyone to afford the services required to get ADHD treatment through them, even with insurance. Circle Medical is convenient and being an app with reminders that I can call from anywhere makes it helpful to remember and make appointments. \\n#### Yvonne\\nThis service is a godsend. I am a single mom of 2 beautiful boys under the age of 5, at home full time as well as working full time. Having the ability to see my provider on a schedule that works for me and takes my insurance is awesome! Thank you guys for all your guidance and support on my journey through life! \\n#### Leland\\nThe scheduling experience is really easy. The provider I chose was on time and she was great. She listened well and I didn't feel rushed or judged. Even though the journey to ask ADHD diagnosis has been a bit scary and anxiety inducing, I left the appointment feeling pretty good about everything. \\n#### Giada\\nJoining Circle Medical has saved my life. I was so lost and didn't know why or what was wrong with me. I took a chance and downloaded the app, and had an appointment in the comfort of my own home within a week. I'm now getting the help I always needed and it has been a game changer. \\n#### Eliza\\nI finally found a provider who cares about me as a patient. She took time to go over my medical history and went to great lengths to go over how ADHD has affected me and we came up with goals that I want to achieve under her care. Medication isn't the only avenue for someone living with ADHD. \\n#### Uriah\\nMy practitioner was extremely friendly and empathetic, and an expert at ADHD and ADD so he knew exactly how to help me and with questions to ask. \\n#### Justin\\nDidn't feel like my last doctor's appointments. My provider felt genuinely compassionate about helping me manage my life obstacles with my ADHD. Was skeptical at first but so glad I made the decision. Super affordable for the quality of care. \\n#### Edwin\\nAs someone who has ADHD, simply setting up an account on the site was so easy. You can tell that this was made with neurodivergent people in mind. Things are just SIMPLE. \\n#### Madalynn\\nThis system, the efficiency, and care behind it is the best that I have come across. I have been uncomfortable addressing issues like ADD and ADHD as an adult, so I put this off for years. My provider has already helped in 2 sessions and I started my prescription within days. I have to say, I am already feeling better simply taking the initial steps. A big thanks to this team! \\n#### Reginald\\nIt has been a good experience for me. If I have any friends or family members who are looking for ADHD help, I will recommend Circle Medical. \\n#### Natalya\\nAs a person with ADHD, going to the doctor in person can be really difficult. I used to put off making appointments because it felt like too many steps and I'd go without seeing a doctor for a few years at a time. Circle Medical allows me to access quality care from home and I never miss my appointments thanks to this convenience. \\n#### Braeden\\nLocally, I've been on a waiting list for seeking an ADHD diagnosis for several months. But then I found this app, and within a few days, it's done! I finally have that peace of mind and can move forward with a treatment plan. Thank you. \\n#### Simone\\nADHD assessment was tailored to adult women. The expert gave nuanced additions and clarification to questions or statements. I feel much better equipped to handle life and am making progress in ways that seemed impossible before. \\n#### June\\nMy provider has been so kind, validating, and understanding. She's helped me understand my ADHD and treat it. \\n#### Zander\\nFinding a good and reliable remote healthcare provider to diagnose and treat ADHD is extremely difficult. Circle Medical has made this process easy for me and I am thankful I chose Circle Medical. \\n#### Immanuel\\nFast and clear appointment and scheduling process. Knowledgeable providers. Responsive support staff. \\n#### Ben\\nMy first interaction with my provider was a positive experience. He listened to my story and we had many things in common. I love having a provider that is also diagnosed with ADHD. This way we can treat my condition properly on a common ground approach. Thank you for being there for me! \\n#### Eric\\nIt is so difficult to access mental health care services right now especially for ADHD, so far I have received immediate and responsive care that has already improved my quality of life, thank you. \\n#### Abdiel\\nHelped me get my ADHD medication renewed when I couldn't find an in-person provider after moving across the country. My provider is amazing and has listened to me, and followed through with my requests beautifully, making sure I'm educated and know what to expect each time I do make a decision/request. \\n#### Camryn\\nMy provider is very professional and knowledgeable about ADHD. She also asks for and listens to my opinions about my treatment. The available hours are convenient. I don't have to take any time off from work. \\n#### Deanna\\nI am very happy with my treatment and my provider has been really great and helpful. I came to Circle from Done, and Circle is far better at patient follow-up and working with me so that I can manage my ADHD in the best way possible. Also, I am very happy with the communication with Circle Medical. \\n#### Van\\nI'm very likely to recommend Circle Medical because of the progress that I have made. My provider has made it possible for me to accept and understand my ADHD with the upmost positivity and total honesty. I have never been able to love and accept myself till now. \\n3,367 more reviews available upon request \\n![Close icon⟨2⟩]\\n## 4.98\\n(1,759) \\nFull names have been changed in compliance with federal patient privacy laws. \\n View Providers ⟨1⟩ ![Reviews hero⟨4⟩]\\n##  Real Hormone Therapy patient reviews \\n#### Hailey\\nExcellent bedside manner, honest and trustworthy. A fantastic Physician and an amazing ally to have throughout my transition journey. She will slow me down if it's needed and I always feel she's doing her due diligence in my case. \\n#### Cynthia\\nI am so grateful to have found Dr. Mirza. She was warm, patient, wise, and always leaves me feeling seen and heard. \\n#### Frannie\\nShe is awesome as always. She always makes sure that I feel better and comfortable. She really takes good care of my health too. She does not just give me meds but made sure that I'd be healthy. You can ask her anything without feeling anxious. \\n#### Dahlia\\nDaniela was great. She explained the process of care and path quite well. I felt seen, heard, and possessed self-agency during the visit. I would highly recommend Daniela. \\n#### Beatrice\\nMs. Smith has been the best PCP I have ever worked with. I'm very glad for both my physical and emotional health, she listens to every one of my concerns and ACTUALLY addresses them! \\n#### Katherine\\nLove the convenience of the video consultations for refills on my ADHD medication!!! This is wonderful!!! Also love my health practitioner— he is fantastic!!! A++++++ \\n#### Giada\\nMy first time ever having a consultation about hormone therapy and Dr. Ibarra made it the best! \\n#### George\\nI am so happy with Dr. Lauren, she has been so understanding and compassionate towards my health and wellbeing. I would give her a 1000 star rating if it let me. Much Light, Love, and Positivity to Dr. Lauren and all of the wonderful folks at Circle Medical. \\n#### Evelyn\\nWhat a phenomenal person Mia is. She was kind, compassionate, and knowledgeable. I am grateful to her for her fantastic care and looking forward to talking further with her about my journey. Thanks Mia!! \\n#### George\\nElizabeth is amazing! She takes excellent care of me during appointments and in-between. \\n#### Ava\\nAlways friendly! I always feel comfortable talking to him and he asks me my thoughts on his treatment plans and allows it to be more of a collaborative process. I love it! \\n#### Darryl\\nI love Dr Fontanilla. I have never felt so comfortable receiving gender-affirming care before. Thank you so much, Dr. Fontanilla!!! \\n#### Bradley\\nVery kind and informative. Absolutely one of the best interactions I have ever had with a health care provider. \\n#### Andrew\\nI appreciate it a lot with my follow ups and medication for my journey along the way. \\n#### Alexandra\\nI have nothing but good things to say. Very professional, detailed, and polite. The best experience I've ever had with a medical professional. \\n#### Jeremy\\nShe has a level of care I need and I was pleasantly surprised at the depth of social concern she has. I'm excited to continue working with her! \\n#### Lawrence\\nKatelyn was very helpful and provided a lot of great direction in our conversation. I felt like she genuinely cared about my medical needs, and was a great conversationalist, in addition to providing great care. \\n#### Frederique\\nAwesome Doctor, Listens and Cares. \\n1,000+ more reviews available upon request \\n![Close icon⟨2⟩]\\n## 4.97\\n(70,053) \\nFull names have been changed in compliance with federal patient privacy laws. \\n View Providers ⟨1⟩ ![Reviews hero⟨4⟩]\\n##  Patient Reviews \\n#### Neil\\nQuick and thorough appointment! Was able to help me with my needs and do some follow up! \\n#### Kathy\\nMy provider was attentive, compassionate, and professional, I’m absolutely recommending Circle Medical. \\n#### Yona\\nHas been wonderful! My provider makes each appt feel so comfortable. I'm able to talk about anything, express concerns, and fill her in on my progress without worry of judgement. She also gives input to reassure me that things I notice are normal and gave possible options for helping manage it. I highly suggest working with Circle Medical! \\n#### Steve\\nMy provider was great. He listened to my concerns and what I felt I needed. He gave me great feedback a plan for success and resources that I didn't know about. I will definitely go back to Circle Medical. \\n#### Danny\\nI am in a very good place now with a big thanks going out to Circle Medical. I can't express just how much they have helped me. I am truly grateful. \\n#### Carla\\nI am so happy with my provider, she has been so understanding and compassionate towards my health and wellbeing. I would give her a 1000 star rating if it let me. Much Light, Love and Positivity to my provider and all of the wonderful folks at Circle Medical. \\n#### Vance\\nMy provider seems to genuinely care about his patients and the problems they are experiencing. He truly listened to what I had to say and was a wealth of knowledge for what I’ve been dealing with. I would recommend Circle to anyone as my provider is very personable, professional, and a wealth of knowledge. I have been very pleased with him along with the Circle Medical service. \\n#### Kylie\\nMy provider was excellent! She made me feel comfortable, put my mind at ease and gave me some really good suggestions for my health. I would highly recommend Circle. \\n#### Faith\\nMy initial experience with my provider was perfect. She had a wonderful attitude and everything you would want in a virtual visit. I didn't expect to even use the services with Circle Medical but I'm 100% going to now. I'm all in, with all of my treatment needs. \\n#### Selina\\nOutstanding Job! My provider cares and takes her time to review the details as well as find the best solutions to help with my situation. I'm glad I chose her and look forward to working with her on a better note than being sick. \\n#### Avery\\nExceptional care provider. Mindful. Organized. Informed. Could not give enough positive feedback about my provider or Circle Medical. Thank you both! \\n#### Azalea\\nMy provider is very pleasant and easy to talk to. This appointment she was able to squeeze me in on a weekend kind of last minute. I'm glad I switched to Circle Medical and am under her care. The video appointments are extremely convenient for me. \\n#### Jules\\nWonderful provider. Very thorough and clear with diagnosis and suggestions. I am so thankful for Circle Medical. \\n#### Joy\\nMy provider is an incredibly good listener, cares about my well being, and is very detailed and thorough. As an individual who struggled to find good care, I'm so happy I found her through Circle!!! \\n#### Felix\\nVery thorough. I love my primary provider at Circle, but I also love that if I need a last minute appointment, all of the heath professionals are amazing. \\n#### Jamil\\nSuper informative and polite! Will definitely be switching over to Circle Medical! \\n#### Ruby\\nPhenomenal — I am a person who is cautious of doctors appointments due to being treated poorly by providers in the past. My provider at Circle Medical was very professional, very sensitive and addressed my concerns. \\n#### Braiden\\nAll of my appointments have been efficient and thorough. Circle Medical is easy to navigate and convenient. \\n#### Bailey\\nCircle has helped me change my life. I don't know how to explain without taking 8 hrs but since I have been with my provider, he has helped transform my life with ADHD Treatment plus general overall heath, yearly blood tests and whatever health concerns I have had over the last 2 years. I can't thank him enough along with Circle Medical. \\n#### Mark\\nI’m extremely satisfied with the customer service, my provider is very knowledgeable and caring for her patients. Always follows up with me, to check my mental and physical health condition. Thank you so much again. \\n#### Kristin\\nMy provider is the absolute best! She answered all my questions via messages, helped me get this appointment early, and then gave me reassurances that I am indeed on the right path, as well as explained to me more questions I had. I'm so glad I have her as my Dr! \\n#### Zora\\nLiterally incredible!!! Made me feel so comfortable and understood!!! \\n#### Bernadette\\nMy provider is the best provider I’ve ever had. She’s caring, so intelligent, and really listens to me and hears me. I adore her, and would highly recommend Circle Medical to anyone looking primary care! \\n#### Aiden\\nExtremely kind and straight to the point. My provider listened to all my concerns and addressed them thoroughly, I also appreciate how she treated me like a person and not just another patient. Very professional and am extremely satisfied with how she was able to get to the root of the problem without rushing to it. Definitely recommend. \\n#### Florence\\nThis was the best experience I’ve had with a doctor! she listened to all of my concerns & was able to guide me in the right direction. I will continue to see her for my follow-up appointments and am feeling very hopeful. \\n#### Dianna\\nFor the first time ever, I finally feel like I had a real substantial visit with a provider. I learned more about my diagnosis, medication, treatment plan, etc. in this one 20-minute appointment then I’ve had in two years. Very kind, friendly, professional. I’m looking forward to more appointments like this one. This is how telemedicine should be. \\n#### Immanuel\\nThis was an extremely helpful and productive visit for me. The doctor needed to coordinate my records and prescriptions with new upcoming laws. I appreciate knowing I am in such good hands. I am so thankful for telemedicine because I have been unable to get into a doctors office in person. Thank you to Circle Medical for offering this amazing platform for medicine it will always be my go to. And thank you to the amazing doctors on Circle Medical. \\n#### Evan\\nMy provider is my absolute FAVORITE Doctor/NP EVER! She's understanding, patient, empathetic, attentive and incredibly encouraging. I'm SOO HAPPY that I made the decision to go with Circle. I've only just begun care/ treatment and its already been life changing. Thanks to my provider! You're seriously my hero! \\n#### Gary\\nThis was my first virtual medical visit. Not only was this visit convenient, the provider was personable and patient and made my concerns were addressed. I’m so happy to have found Circle Medical. This was the most personable medical visit…and it was virtual. Your passion for what you do is acknowledged and truly appreciated! Thank you. \\n#### Mariana\\nI was nervous at first, but my provider was able to make me feel comfortable. She explained everything. Thank you. \\nThousands more reviews available upon request \\n![Close icon⟨2⟩]\\n## 4.95\\n(495,613) \\nFull names have been changed in compliance with federal patient privacy laws. \\n View Providers ⟨1⟩ ![Reviews hero⟨4⟩]\\n##  Patient Reviews \\n#### Alexandra\\nI have nothing but good things to say. Very professional, detailed, and polite. The best experience I've ever had with a medical professional. \\n#### Darryl\\nI love Dr Fontanilla. I have never felt so comfortable receiving gender-affirming care before. Thank you so much, Dr. Fontanilla!!! \\n#### Ava\\nAlways friendly! I always feel comfortable talking to him and he asks me my thoughts on his treatment plans and allows it to be more of a collaborative process. I love it! \\n#### Beatrice\\nMs. Smith has been the best PCP I have ever worked with. I'm very glad for both my physical and emotional health, she listens to every one of my concerns and ACTUALLY addresses them! \\n#### Frannie\\nShe is awesome as always. She always makes sure that I feel better and comfortable. She really takes good care of my health too. She does not just give me meds but made sure that I'd be healthy. You can ask her anything without feeling anxious. \\n#### Giada\\nMy first time ever having a consultation about hormone therapy and Dr. Ibarra made it the best! \\n#### Cynthia\\nI am so grateful to have found Dr. Mirza. She was warm, patient, wise, and always leaves me feeling seen and heard. \\n#### Frederique\\nAwesome Doctor, Listens and Cares. \\n#### Bradley\\nVery kind and informative. Absolutely one of the best interactions I have ever had with a health care provider. \\n#### Dahlia\\nDaniela was great. She explained the process of care and path quite well. I felt seen, heard, and possessed self-agency during the visit. I would highly recommend Daniela. \\n#### Andrew\\nI appreciate it a lot with my follow ups and medication for my journey along the way. \\n#### Evelyn\\nWhat a phenomenal person Mia is. She was kind, compassionate, and knowledgeable. I am grateful to her for her fantastic care and looking forward to talking further with her about my journey. Thanks Mia!! \\n#### George\\nElizabeth is amazing! She takes excellent care of me during appointments and in-between. \\n#### George\\nI am so happy with Dr. Lauren, she has been so understanding and compassionate towards my health and wellbeing. I would give her a 1000 star rating if it let me. Much Light, Love, and Positivity to Dr. Lauren and all of the wonderful folks at Circle Medical. \\n#### Lawrence\\nKatelyn was very helpful and provided a lot of great direction in our conversation. I felt like she genuinely cared about my medical needs, and was a great conversationalist, in addition to providing great care. \\n#### Hailey\\nExcellent bedside manner, honest and trustworthy. A fantastic Physician and an amazing ally to have throughout my transition journey. She will slow me down if it's needed and I always feel she's doing her due diligence in my case. \\n#### Katherine\\nLove the convenience of the video consultations for refills on my ADHD medication!!! This is wonderful!!! Also love my health practitioner— he is fantastic!!! A++++++ \\n#### Jeremy\\nShe has a level of care I need and I was pleasantly surprised at the depth of social concern she has. I'm excited to continue working with her! \\n1,000+ more reviews available upon request \\n![Close icon⟨2⟩]\\n![Sleep mask icon⟨5⟩]\\n##  Sleep Evaluation \\nYour provider will perform a comprehensive sleep and health evaluation during your first appointment in order to diagnose the causes of your disrupted sleep, and possibly recommend an At-Home Sleep Study. Depending on the results, your provider will then determine the appropriate treatment. \\n Book Appointment ⟨1⟩ ![Provider Nikki Tsang⟨6⟩]\\nSame-day Availabilities \\n![Insurance modal hero⟨7⟩] ![Close icon⟨8⟩]\\n ![Circle Medical logo⟨9⟩ ](https://circlemedical.com/</>)\\nWhat we treat  FAQs⟨10⟩  Providers ⟨11⟩  Locations ⟨12⟩  About ⟨13⟩\\n  *  Log in ⟨14⟩\\n  *  Book Now ⟨1⟩\\n\\n\\n![Trust icon⟨15⟩]\\n### Trusted by over 50,000 patients every month.\\nFeatured\\n ADHD ⟨16⟩ Annual Checkup ⟨17⟩ Gender Affirming Care ⟨18⟩ Mental Health ⟨19⟩ Sleep Apnea ⟨20⟩ Weight Loss ⟨21⟩\\nPrimary Care\\n Allergies ⟨22⟩ Anemia ⟨23⟩ Asthma ⟨24⟩ Annual Checkup ⟨17⟩ Bronchitis ⟨25⟩ Diabetes ⟨26⟩ Heartburn ⟨27⟩ Hair Loss Treatment ⟨28⟩ Hypertension ⟨29⟩\\nPrimary Care (continued)\\n Irritable Bowel Syndrome (IBS) ⟨30⟩ Injury and Illness ⟨31⟩ Migraines ⟨32⟩ Skincare ⟨33⟩ Sinus Infections ⟨34⟩ Strep Throat ⟨35⟩ Thyroid Care ⟨36⟩ Tobacco Cessation ⟨37⟩ Vaccinations ⟨38⟩ Weight Loss ⟨21⟩\\nWomen's Health\\n Preventative Care ⟨39⟩ Menopause Hormone Therapy ⟨40⟩ UTI Care ⟨41⟩ Contraception ⟨42⟩\\nMen's Health\\n Male Pattern Baldness ⟨28⟩ Preventative Care ⟨43⟩\\nBehavioral Health\\n ADHD ⟨16⟩ Anxiety ⟨44⟩ Depression ⟨45⟩ Mental Health ⟨19⟩\\nSleep Care\\n Sleep Care ⟨46⟩ Insomnia ⟨47⟩ Sleep Apnea ⟨20⟩ Sleep Disorders ⟨48⟩ At-Home Sleep Study ⟨49⟩\\nLGBTQ+ Health\\n Gender Affirming Care ⟨18⟩ PrEP ⟨50⟩\\n ![Circle Medical logo⟨51⟩ ](https://circlemedical.com/</>)\\nWhat we treat \\n![Trust icon⟨15⟩]\\n### Trusted by over 50,000 patients every month.\\nFeatured\\n ADHD ⟨16⟩ Annual Checkup ⟨17⟩ Gender Affirming Care ⟨18⟩ Mental Health ⟨19⟩ Sleep Apnea ⟨20⟩ Weight Loss ⟨21⟩\\nPrimary Care\\n Allergies ⟨22⟩ Anemia ⟨23⟩ Asthma ⟨24⟩ Annual Checkup ⟨17⟩ Bronchitis ⟨25⟩ Diabetes ⟨26⟩ Heartburn ⟨27⟩ Hair Loss Treatment ⟨28⟩ Hypertension ⟨29⟩\\nPrimary Care (continued)\\n Irritable Bowel Syndrome (IBS) ⟨30⟩ Injury and Illness ⟨31⟩ Migraines ⟨32⟩ Skincare ⟨33⟩ Sinus Infections ⟨34⟩ Strep Throat ⟨35⟩ Thyroid Care ⟨36⟩ Tobacco Cessation ⟨37⟩ Vaccinations ⟨38⟩ Weight Loss ⟨21⟩\\nWomen's Health\\n Preventative Care ⟨39⟩ Menopause Hormone Therapy ⟨40⟩ UTI Care ⟨41⟩ Contraception ⟨42⟩\\nMen's Health\\n Male Pattern Baldness ⟨28⟩ Preventative Care ⟨43⟩\\nBehavioral Health\\n ADHD ⟨16⟩ Anxiety ⟨44⟩ Depression ⟨45⟩ Mental Health ⟨19⟩\\nSleep Care\\n Sleep Care ⟨46⟩ Insomnia ⟨47⟩ Sleep Apnea ⟨20⟩ Sleep Disorders ⟨48⟩ At-Home Sleep Study ⟨49⟩\\nLGBTQ+ Health\\n Gender Affirming Care ⟨18⟩ PrEP ⟨50⟩\\nFeatured \\n ADHD ⟨16⟩ Annual Checkup ⟨17⟩ Gender Affirming Care ⟨18⟩ Mental Health ⟨19⟩ Sleep Apnea ⟨20⟩ Weight Loss ⟨21⟩\\nPrimary Care \\n Allergies ⟨22⟩ Anemia ⟨23⟩ Asthma ⟨24⟩ Annual Checkup ⟨17⟩ Bronchitis ⟨25⟩ Diabetes ⟨26⟩ Heartburn ⟨27⟩ Hair Loss Treatment ⟨28⟩ Hypertension ⟨29⟩\\nPrimary Care (continued) \\n Irritable Bowel Syndrome (IBS) ⟨30⟩ Injury and Illness ⟨31⟩ Migraines ⟨32⟩ Skincare ⟨33⟩ Sinus Infections ⟨34⟩ Strep Throat ⟨35⟩ Thyroid Care ⟨36⟩ Tobacco Cessation ⟨37⟩ Vaccinations ⟨38⟩ Weight Loss ⟨21⟩\\nWomen's Health \\n Preventative Care ⟨39⟩ Menopause Hormone Therapy ⟨40⟩ UTI Care ⟨41⟩ Contraception ⟨42⟩\\nMen's Health \\n Male Pattern Baldness ⟨28⟩ Preventative Care ⟨43⟩\\nBehavioral Health \\n ADHD ⟨16⟩ Anxiety ⟨44⟩ Depression ⟨45⟩ Mental Health ⟨19⟩\\nSleep Care \\n Sleep Care ⟨46⟩ Insomnia ⟨47⟩ Sleep Apnea ⟨20⟩ Sleep Disorders ⟨48⟩ At-Home Sleep Study ⟨49⟩\\nLGBTQ+ Health \\n Gender Affirming Care ⟨18⟩ PrEP ⟨50⟩\\n FAQs ⟨10⟩  Providers ⟨11⟩  Locations ⟨12⟩  About ⟨13⟩\\n Book Now ⟨1⟩  Log in ⟨14⟩\\n![](https://arttrk.com/pixel/?ad_log=referer&action=lead&pixid=7303a09c-db2c-4abe-b123-6c1e0acb2017)\\n# Accessible Primary Care.\\n# Over video and in person.\\n  * ![Calendar icon⟨52⟩] Same and next day availabilities\\n  * ![Health shield icon⟨53⟩] In network with most PPO's\\n  * ![People icon⟨54⟩] 2 million+ video appointments held\\n  * ![Pill icon⟨55⟩] Prescriptions when clinically appropriate\\n\\n\\n Book Appointment ⟨56⟩\\n![Provider Nikki Tsang⟨57⟩]\\nAvailabilities Today \\n![Home hero⟨58⟩]\\nFrequently accepted plans with \\n![Blue Cross⟨59⟩] ![United Healthcare⟨60⟩] ![Anthem⟨61⟩] ![Aetna⟨62⟩] ![Cigna⟨63⟩] ![Blue California⟨64⟩] ![UMR⟨65⟩] ![Health Net⟨66⟩] ![Meritain Health⟨67⟩]\\nMany more!\\n##  Why 300,000+ patients have rated our providers 4.95/5 on average. \\n View Availabilities ⟨56⟩\\n## Primary Care, Centered on You\\nWe offer same and next-day appointments with board-certified primary care providers in just a few clicks, and accept most PPO insurance. Your primary care provider is your first stop on your healthcare journey, and can work with you to treat a wide range of conditions and ailments. If medically appropriate, your provider will be able to evaluate your symptoms, answer your questions, and offer treatment plans that may include certain prescription medications which can be sent to your local pharmacy for pickup. We also offer in-person care⟨12⟩ in a number of locations. Depending on your medical needs and the evaluation of your provider, we may refer you to a specialist or in-person provider after your initial telemedicine appointment to ensure you get the care you need. \\n View Availabilities ⟨1⟩\\n ![ADHD treatment⟨68⟩ ADHD ![Learn more about ADHD treatment⟨69⟩] ](https://circlemedical.com/</what-we-treat/adhd>) ![Hair Loss treatment⟨70⟩ Hair Loss ![Learn more about Hair Loss treatment⟨69⟩] ](https://circlemedical.com/</what-we-treat/hair-loss>) ![Sleep Apnea treatment⟨71⟩ Sleep Apnea ![Learn more about Sleep Apnea treatment⟨69⟩] ](https://circlemedical.com/</what-we-treat/sleep-apnea>) ![Hormone Therapy treatment⟨72⟩ Hormone Therapy ![Learn more about Hormone Therapy treatment⟨69⟩] ](https://circlemedical.com/</what-we-treat/hormone-therapy>) ![Skin Care treatment⟨73⟩ Skin Care ![Learn more about Skin Care treatment⟨69⟩] ](https://circlemedical.com/</what-we-treat/skincare-circle>) ![Other treatments⟨74⟩ All areas of care ![Learn more about Other treatments⟨69⟩] ](https://circlemedical.com/</what-we-treat/services-and-treatments>)\\n## Selection\\n400+ active providers\\n![Selection⟨75⟩]\\n## Coverage\\nLicensed in 30 states\\n![Coverage⟨76⟩]\\n## Convenience\\nManage care in our app\\n![Convenience⟨77⟩]\\n## Availability\\nBook around your schedule\\n![Availability⟨78⟩]\\nTreating thousands of patients daily in:\\n  * AZ\\n  * CA\\n  * CO\\n  * CT\\n  * DC\\n  * FL\\n  * GA\\n  * IL\\n  * IA\\n  * KY\\n  * ME\\n  * MD\\n  * MA\\n  * MI\\n  * MN\\n  * NV\\n  * NJ\\n  * NM\\n  * NY\\n  * NC\\n  * OH\\n  * OK\\n  * OR\\n  * PA\\n  * SC\\n  * TN\\n  * TX\\n  * UT\\n  * VT\\n  * VA\\n  * WA\\n  * WI\\n\\n\\n##  A complete doctor's office in one simple app. \\n![Book appointment⟨79⟩]\\nBook\\n![Cancel appointment⟨80⟩]\\nCancel\\n![Chat with Doctor⟨81⟩]\\nChat\\n![View prescriptions⟨82⟩]\\nPrescriptions\\n![View Appointment Summaries⟨83⟩]\\nAppointment Summaries\\n![Reschedule Appointment⟨84⟩]\\nReschedule\\n![View Lab Results⟨85⟩]\\nLab Results\\n![Abstract background⟨86⟩]\\n![iPhone showing app booking interface⟨87⟩]![iPhone showing app cancel interface⟨88⟩]![iPhone showing app chat interface⟨89⟩]![iPhone showing app prescriptions interface⟨90⟩]![iPhone showing app appointments summary interface⟨91⟩]![iPhone showing app reschedule interface⟨92⟩]![iPhone showing app lab results interface⟨93⟩]\\n![Genuine relationship⟨94⟩]\\n##  Build a genuine, trusting relationship. \\nVirtual care can seem scary - but we make it feel just like an in-person encounter. Our primary care providers share one goal: to learn what makes you unique so they can guide you on your journey towards achieving and maintaining optimal health. \\n![Video thumbnail⟨95⟩] ![Play button⟨96⟩]\\n### Hear it from a real patient.\\nSloane's story (2 min)\\n## 400+ Providers.\\n## 100% Confidence.\\nHeld to an exceptionally high standard of evidence-based care. \\n All providers ⟨97⟩\\n![Dr. Nicole Tsang⟨98⟩]\\n### Dr. Nicole Tsang\\nBoard Certified, Family Medicine,\\n17 years of experience\\n Learn More Learn more about Dr. Nicole Tsang ![Read more arrow⟨99⟩ ](https://circlemedical.com/<https:/booking-v2.circlemedical.com/provider/?slug=nicole-tsang-d-o>)\\n![Kerri Taylor, PA-C⟨100⟩]\\n### Kerri Taylor, PA-C\\nBoard Certified, Primary Care,\\n3 years of experience\\n Learn More Learn more about Kerri Taylor, PA-C ![Read more arrow⟨99⟩ ](https://circlemedical.com/<https:/booking-v2.circlemedical.com/provider/?slug=kerri-taylor-pa-c>)\\n![Jeanne Bird, PA-C⟨101⟩]\\n### Jeanne Bird, PA-C\\nBoard Certified, Family Medicine,\\n20 years of experience\\n Learn More Learn more about Jeanne Bird, PA-C ![Read more arrow⟨99⟩ ](https://circlemedical.com/<https:/booking-v2.circlemedical.com/provider/?slug=jeanne-bird-pa-c>)\\n![Steven Winslow, PA-C⟨102⟩]\\n### Steven Winslow, PA-C\\nBoard Certified, Internal Medicine,\\n27 years of experience\\n Learn More Learn more about Steven Winslow, PA-C ![Read more arrow⟨99⟩ ](https://circlemedical.com/<https:/booking-v2.circlemedical.com/provider/?slug=steven-winslow-pa-c>)\\n## In person visits when you need them.\\nSometimes virtual doesn't cut it. We have three flagship locations in New York, San Francisco, and Beverly Hills, and satellite clinics across the country. \\n View Locations ⟨12⟩\\n![House with Fat Pipe logo⟨103⟩]![Panoramic shot of a building⟨104⟩]![Texas Med front house shot⟨105⟩]![Circle Medical sitting area⟨106⟩]\\n![Medco Share meeting's room entrance⟨107⟩]![Office with a vault for door⟨108⟩]![Font desk of Spaces⟨109⟩]\\n![Building with big windows⟨110⟩]![Spacious wooden floor sitting area⟨111⟩]\\n![Modern waiting area⟨112⟩]![Building entrance⟨113⟩]\\n![Wide shot of the street⟨114⟩]![Reception with mask sign⟨115⟩]![House driveway with a parking lot next to it⟨116⟩]\\n![Spacious reception with wooden floor⟨117⟩]![Reception with wooden floor⟨118⟩]![Sitting area with chairs⟨119⟩]![Reception with marble front⟨120⟩]\\n##  Primary Care Visits with Circle Medical \\n Get Started ⟨11⟩\\nSame-day availability\\nVideo visits\\nIn person visits\\nManage care via app\\nTime required\\nCheck-ups\\nPrescriptions available, when appropriate\\nIn app appt. summaries\\n![Circle Medical⟨121⟩]\\n20-30min. \\nDoctor'soffice \\nHours\\n##  Don't take our word for it. \\nWe are trusted by over 50,000 patients every month. Here's what they have to say. \\n  * ![Quote⟨122⟩]\\nEasy, fast booking, respectful treatment, great documentation and communication. My provider listens to me, takes my input into account and treats me like an equal, not like an annoyance. Can't recommend enough, A+++++\\nTim\\n  * ![Quote⟨122⟩]\\nEase of use, flexibility with schedule, and the provider was informative on the medical issue while delivering care with a nonbiased approach.\\nChristopher\\n  * ![Quote⟨122⟩]\\nI found an amazing provider who has helped me more in the last few months than a team of specialists over the course of nearly a decade of care.\\nMala\\n  * ![Quote⟨122⟩]\\nProviders are compassionate, supportive and clear\\nHailey\\n  * ![Quote⟨122⟩]\\nMy provider made it easy to talk about my medical past, was understanding and listened to what was going on.\\nDerek\\n  * ![Quote⟨122⟩]\\nEasy process, you can do it in the own comfort of your home.\\nAna\\n  * ![Quote⟨122⟩]\\nI feel completely secure with my providers from Circle Medical to give me wholistic care above and beyond just the symptoms. I trust them, and that's very important to me.\\nSkyler\\n  * ![Quote⟨122⟩]\\nMr provider is great. I feel he is thorough and cares about my well being. I also like that it's affordable even without insurance.\\nAmiah\\n  * ![Quote⟨122⟩]\\nI love the provider I've been consulting with. She's attentive and helps me make informed decisions on any adjustments to medication.\\nCesar\\n  * ![Quote⟨122⟩]\\nFinding a good and reliable remote healthcare provider to diagnose and treat ADHD is extremely difficult. Circle Medical has made this process easy for me and I am thankful I chose Circle Medical.\\nZander\\n  * ![Quote⟨122⟩]\\nThe services provided by Circle Medical are excellent and all my questions and concerns have been answered. I have had nothing but great experiences with them.\\nSanai\\n  * ![Quote⟨122⟩]\\nCare is personal and effective. I appreciate them taking a moment to understand how I am doing. Never rushed.\\nPrecious\\n  * ![Quote⟨122⟩]\\nMy provider makes things so easy to understand, she's kind and upfront, and very knowledgeable. I always leave our meetings feeling confident about what we're doing.\\nSteve\\n  * ![Quote⟨122⟩]\\nThe care I've received from my providers has been excellent. They genuinely care about you as a person.\\nMadalynn\\n  * ![Quote⟨122⟩]\\nThe practitioners are very knowledgeable, trustworthy, understanding, kind & they listen! I have been using Circle Medical for almost a year & I highly recommend it! :-)\\nRosemary\\n  * ![Quote⟨122⟩]\\nIt's easy to get an appointment. It's nice to be able to not have to sit in an office waiting to be seen. My provider makes me feel like she actually remembers me and I'm not just another folder slapped on her desk. It's very nice. She also discusses treatment with me instead of just throwing pills at me and saying do this or do that. I feel involved and in charge of my own health.\\nLouis\\n  * ![Quote⟨122⟩]\\nGreat experience and exceptional customer service! Made my experience so easy and manageable.\\nTerry\\n  * ![Quote⟨122⟩]\\nVery smooth and easy process to get in touch with knowledgeable providers who care. The patient care team is always quick to respond in resolving issues as well. Highly recommend!\\nTerrence\\n  * ![Quote⟨122⟩]\\nInformed, polite, and consistent staff, operating under an obviously organized system to provide quality care.\\nLanden\\n  * ![Quote⟨122⟩]\\nSo easy to work with and around my busy schedule. My provider is amazing and I am loving the medical care that I am receiving.\\nNathanael\\n  * ![Quote⟨122⟩]\\nMy provider has been really attentive. When I reached out for customer support on what I thought were side effects of a new medication, I received replies promptly.\\nShelby\\n  * ![Quote⟨122⟩]\\nIt has been fast and easy. The clinicians are great and I found my primary care through this. I love how they are even knowledgeable about LGBTQ+ stuff which is exactly what I've been looking for.\\nEmerson\\n  * ![Quote⟨122⟩]\\nIt was a very personal and safe experience that made me feel absolutely comfortable talking about my personal problems and helping me find a solution.\\nSam\\n  * ![Quote⟨122⟩]\\nThey accepted my insurance, easy to schedule an appointment, easy to communicate with my doctor and they have been helping me with my health in the comfort of my home.\\nMJ\\n  * ![Quote⟨122⟩]\\nMy provider is truly a pleasure to work with. She is very informative understanding and has impeccable bedside manner.\\nDeshawn\\n  * ![Quote⟨122⟩]\\nAccess and personal connection. The three providers I interacted with seem to have gone out of their way to make things easy for me. It was a seamless experience from assessment/consultation, labs, and medications; it all just worked. As an NP I now know I want to work for an organization like Circle.\\nRolando\\n  * ![Quote⟨122⟩]\\nCircle Medical has in all honesty provided me with the most attentive, compassionate, and informed health care I've ever received. Being able to get care that fits with my demanding and unusual work schedule is a game-changer. So many times in the past I've been unable to access care I needed, or follow-up care, because of travel issues, time constraints, and my own anxiety & depression.\\nSelah\\n  * ![Quote⟨122⟩]\\nCircle Medical makes getting medical services easy and convenient. Also, their customer service has been great all around. When issues with medication come up with the pharmacy, Circle Medical personnel have quickly resolved the issues.\\nHannah\\n  * ![Quote⟨122⟩]\\nThe provider was extremely kind and thorough, the app is very easy to use, and I had no problems picking up my prescription.\\nCarlo\\n  * ![Quote⟨122⟩]\\nThe process to schedule was easy, appointments were available quickly, and the practitioner was thorough, friendly, professional, and compassionate.\\nXiomara\\n  * ![Quote⟨122⟩]\\nI have already referred friends to Circle for mental health treatment. It's been life-changing for me.\\nCelia\\n  * ![Quote⟨122⟩]\\nEasy to schedule and do appointments, the biggest plus for me is that the prescription is sent immediately after the appointment to my desired pharmacy with no delay, and if I need to change pharmacies that's also extremely quick.\\nMegan\\n  * ![Quote⟨122⟩]\\nI can take the appointment anywhere. I couldn't find a psychiatrist nearby and resorted to virtual. Circle Medical is a doctor in your pocket and I love it. I love my provider too.\\nDemarcus\\n  * ![Quote⟨122⟩]\\nI love the app. Excellent. You could book on an appt early or on weekends. The provider I work with is knowledgeable, friendly, compassionate and very supportive and thorough!!!\\nJames\\n  * ![Quote⟨122⟩]\\nSuper convenient. Compassionate, amazing practitioner who takes a holistic approach to my care.\\nArianna\\n  * ![Quote⟨122⟩]\\nCircle Medical was able to get me the help and care I needed when I needed it most. Local doctors and health services were too booked to be able to help me soon enough. Circle got me connected with health professionals quickly and with ease. Quite simply, Circle saved my life.\\nReese\\n  * ![Quote⟨122⟩]\\nExtremely convenient! The provider I had was extremely empathetic, thorough, and listened. No more worrying about finding time to drive to the doctors.\\nOliver\\n  * ![Quote⟨122⟩]\\nOh my word! This experience has changed my life. No more wasted time in traffic, being exposed to others' germs, long waits in the ‘waiting' room. I've gotten the help I didn't know I needed. And the providers are consistently working with me to tweak things or address anything else that might not be quite right. I have cried tears of happiness at having hope again, and how much better I feel!\\nLindsay\\n  * ![Quote⟨122⟩]\\nThey are absolutely amazing!!\\nJoe\\n  * ![Quote⟨122⟩]\\nVery understanding!! And absolutely adore the chat portal, where I can express how I'm feeling!!! Thank you Circle Medical 🙏 This journey wouldn't be possible without y'all's help! ❤.\\nCasey\\n  * ![Quote⟨122⟩]\\nEasy, fast booking, respectful treatment, great documentation and communication. My provider listens to me, takes my input into account and treats me like an equal, not like an annoyance. Can't recommend enough, A+++++\\nTim\\n  * ![Quote⟨122⟩]\\nEase of use, flexibility with schedule, and the provider was informative on the medical issue while delivering care with a nonbiased approach.\\nChristopher\\n  * ![Quote⟨122⟩]\\nI found an amazing provider who has helped me more in the last few months than a team of specialists over the course of nearly a decade of care.\\nMala\\n  * ![Quote⟨122⟩]\\nProviders are compassionate, supportive and clear\\nHailey\\n\\n\\n##  Frequently Asked Questions \\nGeneral\\n#  Do new patients need to prepare anything for their first appointment at Circle Medical? \\nFor a detailed breakdown of what you need for your first appointment with Circle Medical, read the article below: \\n How to Prepare for Your First Appointment ⟨123⟩\\n#  Why would I choose a virtual telemedicine appointment over going to my doctor's office? \\nWith Circle Medical, you don't have to. We have flagship clinics in San Francisco, Beverly Hills, and New York City, with more coming soon, and offer limited in-person clinic availability for our established ADHD patients at 24 shared clinic locations. \\nVirtual appointments allow our patients to see their providers in the comfort of their own homes, without the hassle of travel, finding parking, or taking time off of work. Our providers are also able to offer more flexible hours beyond what in-person doctor's offices provide. \\n#  What if I need in-person testing or examinations? \\nFor virtual appointments, if any in-person care is needed, such as bloodwork, vaccinations, or other testing, our providers are able to send the appropriate request to a nearby lab. Results will be integrated with our HIPAA-compliant mobile app so that patients have access to all of their medical records in one secure place. \\n#  How much does this cost me? \\nFor those with insurance, cost will depend on the specific type of care you receive and the coverage of your insurance plan. We provide a cost estimate based on each patient's insurance plan when they book an appointment. \\nFor those without insurance, we provide the self-pay costs of each appointment when a patient is booking their appointment. \\n#  What states do you operate in? \\nTo see our list of currently available states, begin booking an appointment. \\nYou must be currently residing in the state of treatment as well as have your primary pharmacy be in that same state in order to be a patient at our practice. \\nBilling\\n#  How do I know how much my specific appointment will cost? \\nWe provide a cost estimate when you are booking your appointment. For those with insurance, your actual cost is determined after we submit the insurance claim for your appointment. Once we submit the claim, insurance companies will pay for a portion of the appointment and pass on any remaining cost to you. Once we know what this cost is, we will update you with an invoice within the app. \\n#  When do I get charged for my appointment? \\nFor those with insurance, it typically takes 1-3 weeks for the insurance claim to be processed. Once processed, we'll send you an invoice within the app with any remaining costs. You can then opt to pay through the app, or we will automatically charge the payment card on file after 48 hours of sending you the invoice. \\nFor those without insurance (or with out of network insurance), we will send you the invoice 1-2 days after your appointment is completed. You can then opt to pay through the app, or we will automatically charge the payment card on file after 48 hours of sending you the invoice. \\nInsurance\\n#  How long are the appointments? \\nThe first intake appointment is 30 minutes. Follow-up appointments are 20 minutes each. \\n#  What insurance do you accept? \\nWe accept over 1,500+ insurance plans. We cover most of the major PPO insurance companies (payors) across the United States. The best way to confirm coverage of your insurance plan is to begin booking an appointment on our website or via our mobile app. During the booking process, you'll be prompted to enter your insurance information for a real-time verification of your insurance plan. \\n#  What if I am having issues verifying my insurance plan coverage? \\nCall the Member Services number on the back of your insurance card to confirm coverage. You can reference our NPI: 1134596091. For additional assistance, use our in-app chat to message our team. \\n#  What is the total cost of diagnosis and treatment? \\nYour per-appointment costs are set by your insurance plan. If the costs seem high, you may be on a high deductible health plan (HDHP). This means that you have an annual out-of-pocket amount that you must pay on healthcare in a given year before your insurance plan will cover more of your per-appointment costs. \\nIf you are on an HDHP and have confirmed your insurance information in our mobile app, your remaining deductible for the year will be displayed on the “Book Appointment” page. Note that this amount may be outdated if you have had recent insurance claims processed. \\n ![Circle Medical Logo⟨124⟩ ](https://circlemedical.com/</>)\\nMedical services provided by Circle Medical Care of California, an independent medical practice. CA Medical Board permit #FNP3274. \\nCompany Home⟨125⟩ About Circle⟨13⟩ Become a Provider⟨126⟩ Locations⟨12⟩ Providers⟨11⟩ Reviews⟨127⟩ Blog⟨128⟩ Insurance⟨129⟩ What we Treat⟨130⟩ App features⟨131⟩ Careers⟨132⟩\\nWe're hiring\\nResources Help Center⟨133⟩ COVID-19 Testing⟨134⟩ Investor Relations⟨135⟩ Terms of Use⟨136⟩ Privacy Policy⟨137⟩ Human-AI Principles⟨138⟩ Patient Rights and Responsibilities⟨139⟩ Consent to Treatment⟨140⟩\\nDownload\\n ![Download on the App Store⟨141⟩ ](https://circlemedical.com/<https:/itunes.apple.com/us/app/circle-medical-doctor-house/id1003540833>)  ![Download on Google Play⟨142⟩ ](https://circlemedical.com/<https:/play.google.com/store/apps/details?id=co.circlemedical.patient>)\\n![Send email to Circle Medical⟨143⟩]  ![Facebook logo⟨144⟩ ](https://circlemedical.com/<https:/www.facebook.com/circlemedical>)  ![Linkedin logo⟨145⟩ ](https://circlemedical.com/<https:/www.linkedin.com/company/circle-medical>)  ![Twitter logo⟨146⟩ ](https://circlemedical.com/<https:/twitter.com/circlemd>)\\n* Patient names and identities have been changed to protect Patient Health Information (PHI)\\n© 2015-2025 Circle Medical Technologies, Inc. 333 1st Street #A, San Francisco, CA, 94105\\n\" references_markdown=\"\\n\\n## References\\n\\n⟨1⟩ https://circlemedical.com/<https:/booking-v2.circlemedical.com/>:  Book Appointment \\n⟨2⟩ https://circlemedical.com/_image?href=%2F_astro%2FdarkClose.WOpVBCqE.svg&w=24&h=24&f=svg: Close icon\\n⟨3⟩ https://circlemedical.com/_image?href=%2F_astro%2Finsurance-logos.CzfmTm-x.webp&f=webp: Insurance modal hero\\n⟨4⟩ https://circlemedical.com/_image?href=%2F_astro%2FreviewModalHero.FcHaNqJJ.webp&f=webp: Reviews hero\\n⟨5⟩ https://circlemedical.com/_image?href=%2F_astro%2Fsleep-mask-icon.JihqulMX.svg&f=svg: Sleep mask icon\\n⟨6⟩ https://circlemedical.com/_image?href=%2F_astro%2Fjennifer-herrera.CPQqhpIe.webp&w=24&h=24&f=webp: Provider Nikki Tsang\\n⟨7⟩ https://circlemedical.com/_image?href=%2F_astro%2Fsleep-mask.ozH9OCaO.webp&f=webp: Insurance modal hero\\n⟨8⟩ https://circlemedical.com/_image?href=%2F_astro%2Fclose.CrQlWPOt.webp&w=24&h=24&f=webp: Close icon\\n⟨9⟩ https://circlemedical.com/_image?href=%2F_astro%2Flogo.B6HQVoip.webp&w=190&f=webp:  ![Circle Medical logo\\n⟨10⟩ https://circlemedical.com/<https:/help.circlemedical.com/>: FAQs\\n⟨11⟩ https://circlemedical.com/<https:/booking-v2.circlemedical.com/providers>:  Providers \\n⟨12⟩ https://circlemedical.com/</circle-locations>:  Locations \\n⟨13⟩ https://circlemedical.com/</about-circle>:  About \\n⟨14⟩ https://circlemedical.com/<https:/booking-v2.circlemedical.com/homepage/?utm_source=cm-landings>:  Log in \\n⟨15⟩ https://circlemedical.com/_image?href=%2F_astro%2Ftrust-icon.vP_3AAue.webp&w=48&h=48&f=webp: Trust icon\\n⟨16⟩ https://circlemedical.com/</what-we-treat/adhd>:  ADHD \\n⟨17⟩ https://circlemedical.com/</what-we-treat/annual-checkup>:  Annual Checkup \\n⟨18⟩ https://circlemedical.com/</what-we-treat/hormone-therapy>:  Gender Affirming Care \\n⟨19⟩ https://circlemedical.com/</what-we-treat/mental-health>:  Mental Health \\n⟨20⟩ https://circlemedical.com/</what-we-treat/sleep-apnea>:  Sleep Apnea \\n⟨21⟩ https://circlemedical.com/</what-we-treat/weight-loss>:  Weight Loss \\n⟨22⟩ https://circlemedical.com/</what-we-treat/allergies>:  Allergies \\n⟨23⟩ https://circlemedical.com/</what-we-treat/anemia-care>:  Anemia \\n⟨24⟩ https://circlemedical.com/</what-we-treat/asthma>:  Asthma \\n⟨25⟩ https://circlemedical.com/</what-we-treat/bronchitis>:  Bronchitis \\n⟨26⟩ https://circlemedical.com/</what-we-treat/diabetes-care-circle>:  Diabetes \\n⟨27⟩ https://circlemedical.com/</what-we-treat/heartburn>:  Heartburn \\n⟨28⟩ https://circlemedical.com/</what-we-treat/hair-loss>:  Hair Loss Treatment \\n⟨29⟩ https://circlemedical.com/</what-we-treat/hypertension>:  Hypertension \\n⟨30⟩ https://circlemedical.com/</what-we-treat/ibs>:  Irritable Bowel Syndrome (IBS) \\n⟨31⟩ https://circlemedical.com/</what-we-treat/injury-illness>:  Injury and Illness \\n⟨32⟩ https://circlemedical.com/</what-we-treat/migraines>:  Migraines \\n⟨33⟩ https://circlemedical.com/</what-we-treat/skincare-circle>:  Skincare \\n⟨34⟩ https://circlemedical.com/</what-we-treat/sinusitis>:  Sinus Infections \\n⟨35⟩ https://circlemedical.com/</what-we-treat/strep-throat-and-tonsillitis>:  Strep Throat \\n⟨36⟩ https://circlemedical.com/</what-we-treat/thyroid>:  Thyroid Care \\n⟨37⟩ https://circlemedical.com/</what-we-treat/tobacco-cessation>:  Tobacco Cessation \\n⟨38⟩ https://circlemedical.com/</what-we-treat/vaccinations>:  Vaccinations \\n⟨39⟩ https://circlemedical.com/</what-we-treat/womens-health>:  Preventative Care \\n⟨40⟩ https://circlemedical.com/</what-we-treat/menopause-hormone-therapy>:  Menopause Hormone Therapy \\n⟨41⟩ https://circlemedical.com/</what-we-treat/uti-care>:  UTI Care \\n⟨42⟩ https://circlemedical.com/</what-we-treat/contraception>:  Contraception \\n⟨43⟩ https://circlemedical.com/</what-we-treat/mens-health>:  Preventative Care \\n⟨44⟩ https://circlemedical.com/</what-we-treat/anxiety>:  Anxiety \\n⟨45⟩ https://circlemedical.com/</what-we-treat/depression>:  Depression \\n⟨46⟩ https://circlemedical.com/</what-we-treat/sleep-medicine>:  Sleep Care \\n⟨47⟩ https://circlemedical.com/</what-we-treat/insomnia>:  Insomnia \\n⟨48⟩ https://circlemedical.com/</what-we-treat/sleep-and-migraines>:  Sleep Disorders \\n⟨49⟩ https://circlemedical.com/</what-we-treat/sleep-study>:  At-Home Sleep Study \\n⟨50⟩ https://circlemedical.com/</what-we-treat/prep>:  PrEP \\n⟨51⟩ https://circlemedical.com/_image?href=%2F_astro%2Flogo.B6HQVoip.webp&w=159&f=webp:  ![Circle Medical logo\\n⟨52⟩ https://circlemedical.com/_image?href=%2F_astro%2Fcalendar.CIb-Vsk0.svg&f=svg: Calendar icon\\n⟨53⟩ https://circlemedical.com/_image?href=%2F_astro%2Fhealth-shield.JfPlXNq5.svg&f=svg: Health shield icon\\n⟨54⟩ https://circlemedical.com/_image?href=%2F_astro%2Fpeople.OLn01eJZ.svg&f=svg: People icon\\n⟨55⟩ https://circlemedical.com/_image?href=%2F_astro%2Fpill.D2ljIGMq.svg&f=svg: Pill icon\\n⟨56⟩ https://circlemedical.com/<https:/booking-v2.circlemedical.com>:  Book Appointment \\n⟨57⟩ https://circlemedical.com/_image?href=%2F_astro%2Fnikki-tsang.BHKI55_A.webp&w=24&h=24&f=webp: Provider Nikki Tsang\\n⟨58⟩ https://circlemedical.com/_image?href=%2F_astro%2Fhome-hero.nuteqkZ2.webp&f=webp: Home hero\\n⟨59⟩ https://circlemedical.com/_image?href=%2F_astro%2Fblue-cross-blue-shield.C8IcIoWW.webp&h=32&f=webp: Blue Cross\\n⟨60⟩ https://circlemedical.com/_image?href=%2F_astro%2Funited-healthcare.BfxgyswI.webp&h=32&f=webp: United Healthcare\\n⟨61⟩ https://circlemedical.com/_image?href=%2F_astro%2Fanthem.D5ZtbkAy.webp&h=32&f=webp: Anthem\\n⟨62⟩ https://circlemedical.com/_image?href=%2F_astro%2Faetna.DvgSqnj4.webp&h=32&f=webp: Aetna\\n⟨63⟩ https://circlemedical.com/_image?href=%2F_astro%2Fcigna.DKP2MSbA.webp&h=32&f=webp: Cigna\\n⟨64⟩ https://circlemedical.com/_image?href=%2F_astro%2Fblue-california.CE0jYQVC.webp&h=32&f=webp: Blue California\\n⟨65⟩ https://circlemedical.com/_image?href=%2F_astro%2Fumr.DaVJNtMO.webp&h=32&f=webp: UMR\\n⟨66⟩ https://circlemedical.com/_image?href=%2F_astro%2Fhealth-net.Wrm1SfTs.webp&h=32&f=webp: Health Net\\n⟨67⟩ https://circlemedical.com/_image?href=%2F_astro%2Fmeritain-health.B_TEttIr.webp&h=32&f=webp: Meritain Health\\n⟨68⟩ https://circlemedical.com/_image?href=%2F_astro%2Fadhd.BezInrVk.webp&f=webp:  ![ADHD treatment\\n⟨69⟩ https://circlemedical.com/_image?href=%2F_astro%2Farrow.Bo5Q5HTc.svg&f=svg: Learn more about ADHD treatment\\n⟨70⟩ https://circlemedical.com/_image?href=%2F_astro%2Fhair-loss.B1RrbIcz.webp&f=webp:  ![Hair Loss treatment\\n⟨71⟩ https://circlemedical.com/_image?href=%2F_astro%2Fsleep-apnea.MX0sNOP5.webp&f=webp:  ![Sleep Apnea treatment\\n⟨72⟩ https://circlemedical.com/_image?href=%2F_astro%2Fhormone-therapy.ybEscg4K.webp&f=webp:  ![Hormone Therapy treatment\\n⟨73⟩ https://circlemedical.com/_image?href=%2F_astro%2Fskin-care.xi9rcIZM.webp&f=webp:  ![Skin Care treatment\\n⟨74⟩ https://circlemedical.com/_image?href=%2F_astro%2Fall-areas-of-care.RBBmMA0p.webp&f=webp:  ![Other treatments\\n⟨75⟩ https://circlemedical.com/_image?href=%2F_astro%2Fselection.ejgGyQL5.webp&f=webp: Selection\\n⟨76⟩ https://circlemedical.com/_image?href=%2F_astro%2Fcoverage.8OdzJ874.webp&f=webp: Coverage\\n⟨77⟩ https://circlemedical.com/_image?href=%2F_astro%2Fconvenience.BIlq9Ogp.webp&f=webp: Convenience\\n⟨78⟩ https://circlemedical.com/_image?href=%2F_astro%2Favailability.Bd0DsB1V.webp&f=webp: Availability\\n⟨79⟩ https://circlemedical.com/_image?href=%2F_astro%2Fbook.CLEPMRK-.svg&f=svg: Book appointment\\n⟨80⟩ https://circlemedical.com/_image?href=%2F_astro%2Fcancel.CqUE80i8.svg&f=svg: Cancel appointment\\n⟨81⟩ https://circlemedical.com/_image?href=%2F_astro%2Fchat.DVA4-_99.svg&f=svg: Chat with Doctor\\n⟨82⟩ https://circlemedical.com/_image?href=%2F_astro%2Fprescriptions.CFDKtvAA.svg&f=svg: View prescriptions\\n⟨83⟩ https://circlemedical.com/_image?href=%2F_astro%2Fappointment-summaries.CdR9joAJ.svg&f=svg: View Appointment Summaries\\n⟨84⟩ https://circlemedical.com/_image?href=%2F_astro%2Freschedule.Dw_AhDQ0.svg&f=svg: Reschedule Appointment\\n⟨85⟩ https://circlemedical.com/_image?href=%2F_astro%2Flab-results.CTWZIOol.svg&f=svg: View Lab Results\\n⟨86⟩ https://circlemedical.com/_image?href=%2F_astro%2Fcomplete-drs-office-bg.DQB6t58d.svg&f=svg: Abstract background\\n⟨87⟩ https://circlemedical.com/_image?href=%2F_astro%2Fapp-book.mq1vn3m8.webp&f=webp: iPhone showing app booking interface\\n⟨88⟩ https://circlemedical.com/_image?href=%2F_astro%2Fapp-cancel.CR5eArPG.webp&f=webp: iPhone showing app cancel interface\\n⟨89⟩ https://circlemedical.com/_image?href=%2F_astro%2Fapp-chat.BsmRDRrQ.webp&f=webp: iPhone showing app chat interface\\n⟨90⟩ https://circlemedical.com/_image?href=%2F_astro%2Fapp-prescriptions.CnoTIIZN.webp&f=webp: iPhone showing app prescriptions interface\\n⟨91⟩ https://circlemedical.com/_image?href=%2F_astro%2Fapp-appointments-summary.DC0c-5iN.webp&f=webp: iPhone showing app appointments summary interface\\n⟨92⟩ https://circlemedical.com/_image?href=%2F_astro%2Fapp-reschedule.DRuxK87z.webp&f=webp: iPhone showing app reschedule interface\\n⟨93⟩ https://circlemedical.com/_image?href=%2F_astro%2Fapp-lab-results.DzBYdqzG.webp&f=webp: iPhone showing app lab results interface\\n⟨94⟩ https://circlemedical.com/_image?href=%2F_astro%2Fgenuine-relationship.Ch0tV8CQ.webp&f=webp: Genuine relationship\\n⟨95⟩ https://circlemedical.com/_image?href=%2F_astro%2Fvideo-thumbnail.Dkm9shds.webp&f=webp: Video thumbnail\\n⟨96⟩ https://circlemedical.com/_image?href=%2F_astro%2Fthumbnail-play-button.CKOxNCiy.svg&f=svg: Play button\\n⟨97⟩ https://circlemedical.com/</providers>:  All providers \\n⟨98⟩ https://circlemedical.com/_image?href=%2F_astro%2Fnicole-tsang.B9LLD7o7.webp&f=webp: Dr. Nicole Tsang\\n⟨99⟩ https://circlemedical.com/_image?href=%2F_astro%2Farrow.BcvjUB1O.svg&f=svg:  Learn More Learn more about Dr. Nicole Tsang ![Read more arrow\\n⟨100⟩ https://circlemedical.com/_image?href=%2F_astro%2Fkerri-taylor.Cj13S-gj.webp&f=webp: Kerri Taylor, PA-C\\n⟨101⟩ https://circlemedical.com/_image?href=%2F_astro%2Fjeanne-bird.piP2uPYP.webp&f=webp: Jeanne Bird, PA-C\\n⟨102⟩ https://circlemedical.com/_image?href=%2F_astro%2Fsteven-winslow.Dte5VqGY.webp&f=webp: Steven Winslow, PA-C\\n⟨103⟩ https://circlemedical.com/_image?href=%2F_astro%2Fimg1.CbCOSUBR.webp&f=webp: House with Fat Pipe logo\\n⟨104⟩ https://circlemedical.com/_image?href=%2F_astro%2Fpanoramic-building.CtzMkmba.webp&f=webp: Panoramic shot of a building\\n⟨105⟩ https://circlemedical.com/_image?href=%2F_astro%2Ftexas-med.Dro5a0kx.webp&f=webp: Texas Med front house shot\\n⟨106⟩ https://circlemedical.com/_image?href=%2F_astro%2Fimg4.Ccc2PWNU.webp&f=webp: Circle Medical sitting area\\n⟨107⟩ https://circlemedical.com/_image?href=%2F_astro%2Fmedcoshare.DS1UGUYF.webp&f=webp: Medco Share meeting's room entrance\\n⟨108⟩ https://circlemedical.com/_image?href=%2F_astro%2Fvault.FV7aku7F.webp&f=webp: Office with a vault for door\\n⟨109⟩ https://circlemedical.com/_image?href=%2F_astro%2Fspaces-front-desk.x1WH2t3L.webp&f=webp: Font desk of Spaces\\n⟨110⟩ https://circlemedical.com/_image?href=%2F_astro%2Fbuilding-with-big-windows.DLZvKkFS.webp&f=webp: Building with big windows\\n⟨111⟩ https://circlemedical.com/_image?href=%2F_astro%2Fspacious-wooden-sitting-area.DkrwIxrH.webp&f=webp: Spacious wooden floor sitting area\\n⟨112⟩ https://circlemedical.com/_image?href=%2F_astro%2Fmodern-waiting-area.CsGM6FKN.webp&f=webp: Modern waiting area\\n⟨113⟩ https://circlemedical.com/_image?href=%2F_astro%2Fbuilding-entrance.XrZ7YDHT.webp&f=webp: Building entrance\\n⟨114⟩ https://circlemedical.com/_image?href=%2F_astro%2Fstreet-wide-shot.CeICRnSc.webp&f=webp: Wide shot of the street\\n⟨115⟩ https://circlemedical.com/_image?href=%2F_astro%2Freception-with-mask-sign.rlPumjs9.webp&f=webp: Reception with mask sign\\n⟨116⟩ https://circlemedical.com/_image?href=%2F_astro%2Fparking-lot.DNXFt_kV.webp&f=webp: House driveway with a parking lot next to it\\n⟨117⟩ https://circlemedical.com/_image?href=%2F_astro%2Fspacious-reception-with-wooden-floor.CAVmXYsf.webp&f=webp: Spacious reception with wooden floor\\n⟨118⟩ https://circlemedical.com/_image?href=%2F_astro%2Freception-with-wooden-floor.6fvkqXdv.webp&f=webp: Reception with wooden floor\\n⟨119⟩ https://circlemedical.com/_image?href=%2F_astro%2Fsitting-area-with-chairs.BoYmQv0O.webp&f=webp: Sitting area with chairs\\n⟨120⟩ https://circlemedical.com/_image?href=%2F_astro%2Freception-with-marble-front.F99SadBj.webp&f=webp: Reception with marble front\\n⟨121⟩ https://circlemedical.com/icon.png: Circle Medical\\n⟨122⟩ https://circlemedical.com/_image?href=%2F_astro%2Fquote.CFK1LnVI.webp&h=24&f=webp: Quote\\n⟨123⟩ https://circlemedical.com/<https:/help.circlemedical.com/en/articles/9592028-how-to-prepare-for-your-first-appointment>:  How to Prepare for Your First Appointment \\n⟨124⟩ https://circlemedical.com/_image?href=%2F_astro%2Flogo.B6HQVoip.webp&f=webp:  ![Circle Medical Logo\\n⟨125⟩ https://circlemedical.com/</>: Home\\n⟨126⟩ https://circlemedical.com/</become-a-circle-medical-provider>: Become a Provider\\n⟨127⟩ https://circlemedical.com/</reviews>: Reviews\\n⟨128⟩ https://circlemedical.com/</blog>: Blog\\n⟨129⟩ https://circlemedical.com/</insurance>: Insurance\\n⟨130⟩ https://circlemedical.com/</what-we-treat/services-and-treatments>: What we Treat\\n⟨131⟩ https://circlemedical.com/</app-features>: App features\\n⟨132⟩ https://circlemedical.com/</careers>: Careers\\n⟨133⟩ https://circlemedical.com/<https:/help.circlemedical.com/en>: Help Center\\n⟨134⟩ https://circlemedical.com/</covid>: COVID-19 Testing\\n⟨135⟩ https://circlemedical.com/<https:/www.well.company/for-investors/stock-information>: Investor Relations\\n⟨136⟩ https://circlemedical.com/</legal/terms-of-use>: Terms of Use\\n⟨137⟩ https://circlemedical.com/</legal/privacy-policy>: Privacy Policy\\n⟨138⟩ https://circlemedical.com/</human-ai-principles>: Human-AI Principles\\n⟨139⟩ https://circlemedical.com/</legal/patient-rights-and-responsibilities>: Patient Rights and Responsibilities\\n⟨140⟩ https://circlemedical.com/</legal/consent-to-treatment>: Consent to Treatment\\n⟨141⟩ https://circlemedical.com/_image?href=%2F_astro%2Fapp-store-download.D3LuLGPX.svg&f=svg:  ![Download on the App Store\\n⟨142⟩ https://circlemedical.com/_image?href=%2F_astro%2Fgoogle-play-download.DLgSzPTq.svg&f=svg:  ![Download on Google Play\\n⟨143⟩ https://circlemedical.com/_image?href=%2F_astro%2Femail.cYyduyfL.webp&f=webp: Send email to Circle Medical\\n⟨144⟩ https://circlemedical.com/_image?href=%2F_astro%2Ffacebook.T5SLZ7RN.webp&f=webp:  ![Facebook logo\\n⟨145⟩ https://circlemedical.com/_image?href=%2F_astro%2Flinkedin.CmWqeV51.webp&f=webp:  ![Linkedin logo\\n⟨146⟩ https://circlemedical.com/_image?href=%2F_astro%2Ftwitter.lT4U7MsQ.webp&f=webp:  ![Twitter logo\\n\" fit_markdown='' fit_html=''",
  "generated_description": "**Circle Medical Summary**\n\n**Overview:**\nCircle Medical, founded in 2015 and part of Y Combinator's S15 batch, is a healthcare startup based in San Francisco, with a mission to deliver modern primary care through both video and in-person consultations. Think of it as your friendly neighborhood doc—just way more tech-savvy and convenient.\n\n**Mission:**\nThe core aim of Circle Medical is to bring quality primary care to everyone, addressing accessibility issues with the help of advanced technology and a dedicated healthcare team. They focus on making healthcare not just accessible, but genuinely delightful for both patients and providers.\n\n**Growth and Scale:**\nTheir unusual approach has led to a growth of over 3X year-over-year, backed by substantial funding, including their latest round from WELL Health—a move that allows them to expand their hybrid care model across all fifty states. They are keen on entering a hypergrowth phase, which means they are actively on the lookout for motivated team members ready to tackle some of healthcare’s toughest challenges.\n\n**Services:**\nCircle Medical offers a range of care options, from mental health and ADHD treatments to general wellness checkups. Appointments are convenient, with same or next-day availability. Pricing varies based on insurance but typically ranges from $0-$40 with coverage; cash pay is around $179. Here’s a quick snapshot of services:\n\n- **ADHD Care**: Accessible evaluations tailored for adults, leveraging flexible video consultations.\n- **Primary Care**: Comprehensive services including wellness checkups, chronic disease management, and more.\n- **Gender-Affirming Care**: Specialized support for LGBTQ+ patients, providing a safe and affirming environment.\n\n**Technology Integration:**\nPatients can manage their healthcare needs through a user-friendly app, facilitating appointments, prescriptions, and secure messaging all in one place. This level of integration is designed to keep the healthcare experience seamless and easily navigable.\n\n**Team and Community:**\nWith a robust team of 153 top-tier physicians, engineers, and care providers, Circle Medical emphasizes a supportive environment. Their stellar reviews (4.95/5 on various platforms) speak volumes about patient satisfaction. \n\n**Conclusion:**\nIn essence, Circle Medical is redefining what it means to seek primary care by blending compassion, technology, and accessibility into a single platform. If you're looking for a healthcare model that's designed with modern needs in mind, this is one to keep an eye on. For more details, check out their website [Circle Medical](https://circlemedical.com)."
}