{
  "links": "https://www.ycombinator.com/companies/clipboard-health",
  "name": "Clipboard Health",
  "headline": "Connects healthcare facilities with nurses nearby.",
  "batch": "W17",
  "description": "Clipboard Health exists to lift as many people up the socioeconomic ladder as possible. We dramatically improve lives by letting healthcare professionals turn extra time and ambition into career growth and financial opportunity. We achieve this with our app-based marketplace that connects healthcare facilities and healthcare professionals, allowing healthcare professionals to book on-demand shifts and healthcare facilities to access on-demand talent. Our mission is to enable healthcare professionals to work when and where they want and to enable healthcare facilities to meet their talent needs.\r\n\nClipboard Health is a fast-growing Series C startup with classic two-sided network effects. We have product-market fit, generate substantial revenue, and we are helping nurses fix healthcare one shift at a time.\r\n\nClipboard Health is a diverse and inclusive company with a global, remote-first team of hundreds of people. We’ve been featured on YC’s Top Companies and grown our revenue 25x in the last 18 months. We need your help to keep growing so we can serve more healthcare professionals, healthcare facilities, and patients.",
  "activity_status": "Active",
  "website": "https://www.clipboardhealth.com/careers",
  "founded_date": null,
  "team_size": 600.0,
  "location": null,
  "group_partner": null,
  "group_partner_yc": null,
  "company_linkedin": null,
  "company_twitter": null,
  "tags": "industry:marketplace; industry:consumer-health-services; industry:health-tech; industry:digital-health; industry:healthcare",
  "founders": [
    {
      "name": "Wei Deng, Founder/CEO",
      "description": "I'm a graduate of Yale and Yale Law School. Have done law, finance, product and operations, and am currently running a company that matches healthcare facilities with available nurses nearby.",
      "linkedin": "https://www.linkedin.com/in/dengwei"
    }
  ],
  "status": true,
  "markdown": "raw_markdown='[![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/63d7e4dcc375a62efe51e399_bunnylogo.png)](https://www.clipboardhealth.com/</>)\\nFacilities\\n[Acute Care](https://www.clipboardhealth.com/</acute-care>)[Skilled Nursing](https://www.clipboardhealth.com/</facilities>)[Assisted Living](https://www.clipboardhealth.com/</facilities>)[Behavioral Health](https://www.clipboardhealth.com/</facilities>)[Rehabilitation](https://www.clipboardhealth.com/</facilities>)[Ambulatory Surgery](https://www.clipboardhealth.com/</facilities>)[Long-term Acute Care](https://www.clipboardhealth.com/</facilities>)[Dental](https://www.clipboardhealth.com/</facilities>)[Home health](https://www.clipboardhealth.com/</facilities>)[Pharmacy](https://www.clipboardhealth.com/</facilities>)\\n[Facilities](https://www.clipboardhealth.com/<https:/clipboard.health/workplace/get-access>)[Professionals](https://www.clipboardhealth.com/</professionals>)[Resources](https://www.clipboardhealth.com/<https:/support.clipboardhealth.com/hc/en-us>)[About](https://www.clipboardhealth.com/</about>)[Engineering](https://www.clipboardhealth.com/</engineering>)[Contact](https://www.clipboardhealth.com/</contact>)[Search](https://www.clipboardhealth.com/</search-results>)[Sign Up](https://www.clipboardhealth.com/<#>)[Facility Log In](https://www.clipboardhealth.com/<https:/clipboard.health/enter>)\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/660d776dc447990a8bf631bf_careers-hero--image.svg)\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/633ee8841c78f88763c6694b_magdiel-lagos-7hjh_X3xsDA-unsplash.jpg)\\n## Make a differencewith us\\nJoin us and discover a rewarding career path as we work to lift individuals and communities up the socio-economic ladder.\\n[Apply now](https://www.clipboardhealth.com/<https:/boards.greenhouse.io/clipboardhealth?gh_src=b2e829504us>)\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/660d776dc447990a8bf631bf_careers-hero--image.svg)\\n### Where we are today\\n[550+team members in 40+ countries (and counting!)](https://www.clipboardhealth.com/<#>)[$1.3Bin valuation](https://www.clipboardhealth.com/<https:/www.fiercehealthcare.com/health-tech/clipboard-health-online-hiring-platform-notches-80m>)[$80Min funding, backed by Sequoia & IVP](https://www.clipboardhealth.com/<https:/techcrunch.com/2022/04/18/clipboard-health-which-matches-health-workers-with-facilities-raises-80m/>)[#69in Y Combinator’s top 100 companies](https://www.clipboardhealth.com/<https:/www.ycombinator.com/topcompanies/valuation>)[100%remote since day 1](https://www.clipboardhealth.com/<#>)\\n20X+\\ngrowth sinceJanuary 2021\\n50%+\\nYoY growth in active Health Care Professionals\\n30%+\\nYoY growth in active Health Care Facilities\\n50%+\\nYoY growth in Shifts posted on our platform\\n### Meet our visionary founder\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/660d89d6db3b2294aa8dc00c_founder-profile-image.png)\\nWei Deng is the founder and CEO of Clipboard Health, a series C Sequoia-backed start-up valued at $1.3B. Before founding Clipboard Health, Wei attended Yale College, and graduated from Yale Law School. She started her career as a lawyer working at one of the nation\\'s most prestigious law firms, Davis Polk & Wardwell. She then worked as an Investment Banking Associate at Moelis & Company before she became the second non-engineering hire (Product Manager and Business Operations) at Sendwave, a remittance startup for the African diaspora, and was responsible for opening the UK and European corridor which was later on acquired for $500M.Listen to Wei as she talks about why she started Clipboard Health with podcaster George Quraishi from Artifact.\\n[Listen now](https://www.clipboardhealth.com/<https:/www.heyartifact.com/creations/how-wei-deng-built-clipboard-health/>)\\n### What makes ourculture unique\\nWe define culture as nothing less and nothing more than the set of behaviors perceived to be rewarded or punished within an organization.\\n[Join us now](https://www.clipboardhealth.com/<https:/boards.greenhouse.io/clipboardhealth?gh_src=b2e829504us>)\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/660d94cc5271e86e247cdec9_group-of-people.png)\\n### Behaviors = Values\\nAt Clipboard Health, our values are the guiding principles that shape our culture and define who we are as a company. They inspire us, guide our decisions, and drive our actions every day. Here\\'s a glimpse into what we stand for:\\n### 01\\n### Noticing & Curiosity\\nWe are annoyingly curious. We notice clues to issues or opportunities when others may not. We ask “why” and “how” many times in a row with the intention to get to the root of a problem or situation, because we really want to understand it deeply from first principles. We continually challenge our own understanding of our customers, our market, and our business. We avoid unexamined assumptions and think through our actions from first principles starting with the end goal in mind. We actively look for clues to disconfirm our deepest held beliefs and are continuously updating our mental model of the world. What was the reason, and what may have been right yesterday, is no longer so today. \\u200d\\n### 02\\n### Ownership\\nWe take full responsibility and accountability for our domain areas and our results, and we own the outcome. We believe that we have agency over what we do, and that no one else is to blame. We own up to where things fall short, and we figure out how we can improve our world through our actions alone. We seek and fix problems beyond our immediate designated areas, so nothing falls “between the cracks.” We fix problems we see quickly, and put processes in place to make sure they stay fixed and don’t happen again. We are proactive - we 1) notice subtle clues that may portend more systematic issues, 2) dig to find out the root issue, and 3) fix the root issue that improves our business for the long run.\\u200d\\n### 03\\n### Initiative & Persistence\\nWe have a bias for action. We know many decisions are reversible, and take calculated risks daily to deliver results today rather than tomorrow (much less next week) because our customers are suffering today. We are scrappy & self reliant, stretching ourselves to “get the MVP out the door today” rather than wade through meetings and coordination just to get a first version out. When we are a stakeholder, we don\\'t just say no; say yes to something else; we try to push forward towards a solution rather than just push back against a proposal with “but what about…” sentences. We will never have all the information we want to make a decision, and analysis paralysis can kill us as a startup. We are proactive & deep: when something goes wrong we ask, root cause it deeply and extract all the learnings we can personally and for our team. We learn by doing, not by discussion in a committee. Speed matters. We don’t worry about “stepping on toes” - we don’t have toes here, nobody has a monopoly on work they’re not doing.\\n### 04\\n### Judgment & Decisiveness\\nWe have strong judgment and good instincts. We are detail oriented, at the correct level of detail for the situation. We know when to be scrappy experimenters & when to build hardened scalable solutions; very few items are in between. We are quick & decisive. We step up and make the call, knowing we’ll make mistakes but hey that’s better than putting off the decision or asking yet another person for their opinion. In summary: we make the right decision, quickly.\\u200d\\n### 05\\n### Think from First Principles\\nAnti-incremental thinking. We don’t believe in asking “how can we be 10% better” because the status quo is the wrong starting point. Instead, we imagine the ideal impossible customer experience from scratch and back our way into reality. We seek the fundamental truths, and reason up from there. This applies to how we work as well: we re-imagine how product, operations, engineering and every part of the org should be; not what they’re like in other companies and how we can improve on that.\\u200d\\n### 06\\n### Humble\\nWe’re low ego. We care about getting to the best results, not about who is right. We care about how much we learned, not how much we know. We care about doing what’s best for the team & mission, not what’s best for ourselves today. We are gracious to each other. We look for ways to encourage and help when possible, even if it doesn’t fall in our “designated” domain. We readily admit it when we don’t know something, and act swiftly to rectify. We want to become better versions of ourselves, so we actively search for our own faults. We cherish feedback, seeing it as the gift it is to help us improve, and acting on it as appropriate with haste & vigor.\\u200d\\n### 07\\n### Customer Centricity\\nWe feel each customer’s pain viscerally, even though we must fix things systematically. Talking to customers and fixing a particular customer’s job is everyone’s job. We obsess over how to improve customers\\' lives immediately and in the long term.\\u200d\\n### 08\\n### Uncomfortably High Standards\\nWe have uncomfortably high standards for ourselves, our teams, and our peers. We believe in quality and speed. We surprise and delight our customers and each other with outcomes that are far better than expected. We imagine what a magical outcome would be, and aim for that, executing with exceptional effort and creativity. We set the standard for our industry in Operational Excellence. We push ourselves & each other towards something that seemed impossible just weeks ago. We are proud of what we create and our reputation with our customers, our industry, and our community. When customers work with us, or when a new employee joins us, we want them to say: “wow, every part of their organization is excellent.\"\\n### 09\\n### Unreasonably Fast \\nWe set our operational cadence to “run”, not walk. When someone asks us if they can get back to us about something next week, we reply ‘how about tomorrow morning’ even if it’s unreasonable, because you’ll never know until you try. We’re known as the place that reaches out to candidates within hours of them posting their profile, and always first. When we promise something to a customer, instead of saying “next week” we say “in two hours” because it is easy to differentiate ourselves by being faster, yet so few bother to do it because slow is comfortable. We constantly ask ourselves: “can I get this done faster?”\\n### 10\\n### Relish Discomfort\\nWe have the courage to do what’s needed even if it’s uncomfortable; especially if it’s uncomfortable. Need to jump into analytics but know you’re weak at math? We put in the extra time to learn it and jump in with both feet. Need to tell someone their work wasn’t up to your high standards? We don’t look away or delay despite discomfort and instead act quickly & decisively without sugar coating it.\\u200d\\n### 11\\n### See for Yourself\\n### See for Yourself\\nWe Dive Deep. Touch reality yourself. We stay connected to the details, audit frequently, and are skeptical when metrics and anecdotes differ. We start at the lowest level of detail. We touch reality by seeing for ourselves: \\u200d- We talk to customers, not just read other people’s customer conversation notes. - We listen to support calls, not just read reports or look at metrics. - We pull random (or particularly bad) ops & support tickets and read what happened, who said what, look at timestamps. We read pull requests, not just ask managers how the project went or what happened. - We secret shop the experience our team is giving customers, i.e. by calling our own support number and asking for help on our own Clipboard account. Our managers know their metrics deeply & are excellent at the craft they lead. They obsess over metrics and customer conversations to better understand their business “to the metal” and make well considered data driven decisions when possible. No task is beneath them, or “above their pay grade”. We realize the one customer complaint they happened to hear about probably isn’t unique, and take it as a clue to seek out the truth at scale.\\n### 12\\n### Hire, Develop and “Rehire” the Best\\nWe raise the performance bar with every hire and promotion. They recognize exceptional talent, and willingly move them throughout the organization including to other teams to learn & deliver. Leaders realize when they’ve hired someone unexceptional and unapologetically hands that person an exit package to make space for someone exceptional in that role. We focus our precious coaching and development time on growing and rounding out exceptional talent so they can become the next generation of leaders, instead of shoring up underperformers hoping they’ll magically improve. Leaders know that with every new month, every new quarter, they are “rehiring” the person already in a seat for that seat for the next month or quarter, and their high standards are no different for rehiring that person than for hiring him or her in the first place.\\u200d\\n### 13\\n### Accurately Self Aware\\nThe more senior your role, the more you have to rely on your own self awareness (in addition to humility, and asking for feedback). Though not necessary, most people will stop giving you the critical feedback needed to improve if you’ve been here longer, are their manager, or simply are perceived to be “respected” by others. Do you have a list of your own mistakes? Do you acknowledge them publicly so others can see & learn from your humility? Are you accurate in your self assessment? (Because generic humility or needless self deprecation is also unhelpful). If I asked you what person A, person B, or person C who works with or for you thought were your strengths and weaknesses, would you get it right? Have you asked them? (You don’t have to agree with them; self awareness is understanding how you’re perceived separate of whether you agree).\\u200d\\n### Life at Clipboard Health\\n**Work 100% Remote**\\nUnlimited Paid Time Off\\nCompetitive Family Leave Options\\nCompetitiveFamily Leave Options\\n[Join our team](https://www.clipboardhealth.com/<https:/boards.greenhouse.io/clipboardhealth?gh_src=b2e829504us>)\\n### Want to take a closer look at our work life?\\n[Learn more](https://www.clipboardhealth.com/</how-we-work>)\\n### What employees are saying\\n“Working at Clipboard Health has been more than just a job; it\\'s been a journey of personal and professional growth. I am grateful to be surrounded by supportive teams and inspiring leaders who encourage me to think creatively and pursue my passions. I enjoy our vibrant culture and am proud to be part of a company that genuinely values its employees and fosters an environment where we can thrive.”\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/660ea50e43b46f2c84c5c09f_drea-bent.png)\\nDrae Bent\\nAccounts Payable Manager\\n“Joining Clipboard Health was an easy choice for me. Their customer-centric approach, vibrant startup culture, and flexible work-from-anywhere policy were exactly what I was looking for. I\\'m excited to contribute to its continued success.\" \\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/660db61c7dc159a0372e8a12_Alex.png)\\nAlex Van de Kleut\\nSenior Software Engineer\\n“What made me join Clipboard Health? Well, I was most excited about the writing culture here. I love to write, do it for fun, and am unapologetic about how great writing and great thinking are inseparable. From the start of the interview process, I knew Clipboard Health lived and breathed writing, which was a major plus for me.”\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/660ea5ebbf0deba7c93f0236_riley-wilson.png)\\nRiley Wilson\\nStrategy & Operations\\n“I joined Clipboard Health because I don\\'t want to be just ‘good’: I want to be the best. Clipboard Health is a big company, solving big problems, and comes with the relatively de-risked outcomes that go with being a big, profitable unicorn startup. Despite its bigness, Clipboard still has all the DNA of a small startup: people here are relentless, they move outrageously fast, they take ownership and don\\'t tolerate complacency. Working here is not for everyone: it\\'s only for the best. And that\\'s exactly why I joined.”\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/660ea55c4bba79e52bb554e2_alex-friedman.png)\\nAlex Friedman\\nProduct Manager\\n“I joined Clipboard Health because of the chance to work autonomously, with other skilled and motivated engineers, at a company allergic to red tape and pointless meetings. While discussion is important, there is an emphasis on doing.”\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/660db61c9fe9d55d816e0b1c_Jack.png)\\nJack Sullivan\\nSenior Software Engineer, Security\\n“I have found my experience with Clipboard Health to be exceptionally rewarding. This company provides ample opportunities for personal growth, including leadership training that I have been able to apply effectively in my role. Moreover, the opportunity to take on diverse responsibilities has been invaluable in broadening my skill set and fostering continuous learning. I particularly appreciate the accessibility of our managers and senior leadership, who readily offer valuable insights and guidance, creating an environment where I feel both respected and encouraged to excel.”\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/660db61b9dc0c6af45d358b5_Christine.png)\\nChristine Presto\\nTechnical Support Manager\\n“I\\'ve been part of the Clipboard Health team for nearly three years, and it\\'s been nothing but the best. Aside from the convenience of remote work, I\\'ve been consistently impressed by the company\\'s attention to detail in delivering high-quality services and also the professionalism of the folks working in the company. Each colleague I\\'ve had the privilege of collaborating with demonstrates a remarkable level of competence and expertise. Moreover, your dedication is duly recognized and rewarded here!”\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/660db61b052d95057ad6d900_Darwin.png)\\nDarwin Alfonso\\nHospital Supply Recruiter\\n“Working at Clipboard Health changed my life. Having the freedom to work from anywhere, with people from all over the globe, and in a super pleasant environment. As a Legal Assistant, I learn every day from the best lawyers that make up Clipboard\\'s legal team. Something remarkable: Wei and Bo, Clipboard\\'s CEOs, are very present in daily work, and are super accessible if you need them. This makes me feel confident and supported. Without a doubt, Clipboard opened the door for me to a world of opportunities that I could never have imagined!”\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/660db61be35a79641a8ab6d2_Kelly.png)\\nKelly Taurizano\\nLegal Assistant \\n“Working at Clipboard Health has been more than just a job; it\\'s been a journey of personal and professional growth. I am grateful to be surrounded by supportive teams and inspiring leaders who encourage me to think creatively and pursue my passions. I enjoy our vibrant culture and am proud to be part of a company that genuinely values its employees and fosters an environment where we can thrive.”\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/660ea50e43b46f2c84c5c09f_drea-bent.png)\\nDrae Bent\\nAccounts Payable Manager\\n“Joining Clipboard Health was an easy choice for me. Their customer-centric approach, vibrant startup culture, and flexible work-from-anywhere policy were exactly what I was looking for. I\\'m excited to contribute to its continued success.\" \\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/660db61c7dc159a0372e8a12_Alex.png)\\nAlex Van de Kleut\\nSenior Software Engineer\\n“What made me join Clipboard Health? Well, I was most excited about the writing culture here. I love to write, do it for fun, and am unapologetic about how great writing and great thinking are inseparable. From the start of the interview process, I knew Clipboard Health lived and breathed writing, which was a major plus for me.”\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/660ea5ebbf0deba7c93f0236_riley-wilson.png)\\nRiley Wilson\\nStrategy & Operations\\n“I joined Clipboard Health because I don\\'t want to be just ‘good’: I want to be the best. Clipboard Health is a big company, solving big problems, and comes with the relatively de-risked outcomes that go with being a big, profitable unicorn startup. Despite its bigness, Clipboard still has all the DNA of a small startup: people here are relentless, they move outrageously fast, they take ownership and don\\'t tolerate complacency. Working here is not for everyone: it\\'s only for the best. And that\\'s exactly why I joined.”\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/660ea55c4bba79e52bb554e2_alex-friedman.png)\\nAlex Friedman\\nProduct Manager\\n“I joined Clipboard Health because of the chance to work autonomously, with other skilled and motivated engineers, at a company allergic to red tape and pointless meetings. While discussion is important, there is an emphasis on doing.”\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/660db61c9fe9d55d816e0b1c_Jack.png)\\nJack Sullivan\\nSenior Software Engineer, Security\\n“I have found my experience with Clipboard Health to be exceptionally rewarding. This company provides ample opportunities for personal growth, including leadership training that I have been able to apply effectively in my role. Moreover, the opportunity to take on diverse responsibilities has been invaluable in broadening my skill set and fostering continuous learning. I particularly appreciate the accessibility of our managers and senior leadership, who readily offer valuable insights and guidance, creating an environment where I feel both respected and encouraged to excel.”\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/660db61b9dc0c6af45d358b5_Christine.png)\\nChristine Presto\\nTechnical Support Manager\\n“I\\'ve been part of the Clipboard Health team for nearly three years, and it\\'s been nothing but the best. Aside from the convenience of remote work, I\\'ve been consistently impressed by the company\\'s attention to detail in delivering high-quality services and also the professionalism of the folks working in the company. Each colleague I\\'ve had the privilege of collaborating with demonstrates a remarkable level of competence and expertise. Moreover, your dedication is duly recognized and rewarded here!”\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/660db61b052d95057ad6d900_Darwin.png)\\nDarwin Alfonso\\nHospital Supply Recruiter\\n“Working at Clipboard Health changed my life. Having the freedom to work from anywhere, with people from all over the globe, and in a super pleasant environment. As a Legal Assistant, I learn every day from the best lawyers that make up Clipboard\\'s legal team. Something remarkable: Wei and Bo, Clipboard\\'s CEOs, are very present in daily work, and are super accessible if you need them. This makes me feel confident and supported. Without a doubt, Clipboard opened the door for me to a world of opportunities that I could never have imagined!”\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/660db61be35a79641a8ab6d2_Kelly.png)\\nKelly Taurizano\\nLegal Assistant \\n“Working at Clipboard Health has been more than just a job; it\\'s been a journey of personal and professional growth. I am grateful to be surrounded by supportive teams and inspiring leaders who encourage me to think creatively and pursue my passions. I enjoy our vibrant culture and am proud to be part of a company that genuinely values its employees and fosters an environment where we can thrive.”\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/660ea50e43b46f2c84c5c09f_drea-bent.png)\\nDrae Bent\\nAccounts Payable Manager\\n“Joining Clipboard Health was an easy choice for me. Their customer-centric approach, vibrant startup culture, and flexible work-from-anywhere policy were exactly what I was looking for. I\\'m excited to contribute to its continued success.\" \\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/660db61c7dc159a0372e8a12_Alex.png)\\nAlex Van de Kleut\\nSenior Software Engineer\\n“What made me join Clipboard Health? Well, I was most excited about the writing culture here. I love to write, do it for fun, and am unapologetic about how great writing and great thinking are inseparable. From the start of the interview process, I knew Clipboard Health lived and breathed writing, which was a major plus for me.”\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/660ea5ebbf0deba7c93f0236_riley-wilson.png)\\nRiley Wilson\\nStrategy & Operations\\n“I joined Clipboard Health because I don\\'t want to be just ‘good’: I want to be the best. Clipboard Health is a big company, solving big problems, and comes with the relatively de-risked outcomes that go with being a big, profitable unicorn startup. Despite its bigness, Clipboard still has all the DNA of a small startup: people here are relentless, they move outrageously fast, they take ownership and don\\'t tolerate complacency. Working here is not for everyone: it\\'s only for the best. And that\\'s exactly why I joined.”\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/660ea55c4bba79e52bb554e2_alex-friedman.png)\\nAlex Friedman\\nProduct Manager\\n“I joined Clipboard Health because of the chance to work autonomously, with other skilled and motivated engineers, at a company allergic to red tape and pointless meetings. While discussion is important, there is an emphasis on doing.”\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/660db61c9fe9d55d816e0b1c_Jack.png)\\nJack Sullivan\\nSenior Software Engineer, Security\\n“I have found my experience with Clipboard Health to be exceptionally rewarding. This company provides ample opportunities for personal growth, including leadership training that I have been able to apply effectively in my role. Moreover, the opportunity to take on diverse responsibilities has been invaluable in broadening my skill set and fostering continuous learning. I particularly appreciate the accessibility of our managers and senior leadership, who readily offer valuable insights and guidance, creating an environment where I feel both respected and encouraged to excel.”\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/660db61b9dc0c6af45d358b5_Christine.png)\\nChristine Presto\\nTechnical Support Manager\\n“I\\'ve been part of the Clipboard Health team for nearly three years, and it\\'s been nothing but the best. Aside from the convenience of remote work, I\\'ve been consistently impressed by the company\\'s attention to detail in delivering high-quality services and also the professionalism of the folks working in the company. Each colleague I\\'ve had the privilege of collaborating with demonstrates a remarkable level of competence and expertise. Moreover, your dedication is duly recognized and rewarded here!”\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/660db61b052d95057ad6d900_Darwin.png)\\nDarwin Alfonso\\nHospital Supply Recruiter\\n“Working at Clipboard Health changed my life. Having the freedom to work from anywhere, with people from all over the globe, and in a super pleasant environment. As a Legal Assistant, I learn every day from the best lawyers that make up Clipboard\\'s legal team. Something remarkable: Wei and Bo, Clipboard\\'s CEOs, are very present in daily work, and are super accessible if you need them. This makes me feel confident and supported. Without a doubt, Clipboard opened the door for me to a world of opportunities that I could never have imagined!”\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/660db61be35a79641a8ab6d2_Kelly.png)\\nKelly Taurizano\\nLegal Assistant \\n“Working at Clipboard Health has been more than just a job; it\\'s been a journey of personal and professional growth. I am grateful to be surrounded by supportive teams and inspiring leaders who encourage me to think creatively and pursue my passions. I enjoy our vibrant culture and am proud to be part of a company that genuinely values its employees and fosters an environment where we can thrive.”\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/660ea50e43b46f2c84c5c09f_drea-bent.png)\\nDrae Bent\\nAccounts Payable Manager\\n“Joining Clipboard Health was an easy choice for me. Their customer-centric approach, vibrant startup culture, and flexible work-from-anywhere policy were exactly what I was looking for. I\\'m excited to contribute to its continued success.\" \\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/660db61c7dc159a0372e8a12_Alex.png)\\nAlex Van de Kleut\\nSenior Software Engineer\\n“What made me join Clipboard Health? Well, I was most excited about the writing culture here. I love to write, do it for fun, and am unapologetic about how great writing and great thinking are inseparable. From the start of the interview process, I knew Clipboard Health lived and breathed writing, which was a major plus for me.”\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/660ea5ebbf0deba7c93f0236_riley-wilson.png)\\nRiley Wilson\\nStrategy & Operations\\n“I joined Clipboard Health because I don\\'t want to be just ‘good’: I want to be the best. Clipboard Health is a big company, solving big problems, and comes with the relatively de-risked outcomes that go with being a big, profitable unicorn startup. Despite its bigness, Clipboard still has all the DNA of a small startup: people here are relentless, they move outrageously fast, they take ownership and don\\'t tolerate complacency. Working here is not for everyone: it\\'s only for the best. And that\\'s exactly why I joined.”\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/660ea55c4bba79e52bb554e2_alex-friedman.png)\\nAlex Friedman\\nProduct Manager\\n“I joined Clipboard Health because of the chance to work autonomously, with other skilled and motivated engineers, at a company allergic to red tape and pointless meetings. While discussion is important, there is an emphasis on doing.”\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/660db61c9fe9d55d816e0b1c_Jack.png)\\nJack Sullivan\\nSenior Software Engineer, Security\\n“I have found my experience with Clipboard Health to be exceptionally rewarding. This company provides ample opportunities for personal growth, including leadership training that I have been able to apply effectively in my role. Moreover, the opportunity to take on diverse responsibilities has been invaluable in broadening my skill set and fostering continuous learning. I particularly appreciate the accessibility of our managers and senior leadership, who readily offer valuable insights and guidance, creating an environment where I feel both respected and encouraged to excel.”\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/660db61b9dc0c6af45d358b5_Christine.png)\\nChristine Presto\\nTechnical Support Manager\\n“I\\'ve been part of the Clipboard Health team for nearly three years, and it\\'s been nothing but the best. Aside from the convenience of remote work, I\\'ve been consistently impressed by the company\\'s attention to detail in delivering high-quality services and also the professionalism of the folks working in the company. Each colleague I\\'ve had the privilege of collaborating with demonstrates a remarkable level of competence and expertise. Moreover, your dedication is duly recognized and rewarded here!”\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/660db61b052d95057ad6d900_Darwin.png)\\nDarwin Alfonso\\nHospital Supply Recruiter\\n“Working at Clipboard Health changed my life. Having the freedom to work from anywhere, with people from all over the globe, and in a super pleasant environment. As a Legal Assistant, I learn every day from the best lawyers that make up Clipboard\\'s legal team. Something remarkable: Wei and Bo, Clipboard\\'s CEOs, are very present in daily work, and are super accessible if you need them. This makes me feel confident and supported. Without a doubt, Clipboard opened the door for me to a world of opportunities that I could never have imagined!”\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/660db61be35a79641a8ab6d2_Kelly.png)\\nKelly Taurizano\\nLegal Assistant \\n“Working at Clipboard Health has been more than just a job; it\\'s been a journey of personal and professional growth. I am grateful to be surrounded by supportive teams and inspiring leaders who encourage me to think creatively and pursue my passions. I enjoy our vibrant culture and am proud to be part of a company that genuinely values its employees and fosters an environment where we can thrive.”\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/660ea50e43b46f2c84c5c09f_drea-bent.png)\\nDrae Bent\\nAccounts Payable Manager\\n“Joining Clipboard Health was an easy choice for me. Their customer-centric approach, vibrant startup culture, and flexible work-from-anywhere policy were exactly what I was looking for. I\\'m excited to contribute to its continued success.\" \\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/660db61c7dc159a0372e8a12_Alex.png)\\nAlex Van de Kleut\\nSenior Software Engineer\\n“What made me join Clipboard Health? Well, I was most excited about the writing culture here. I love to write, do it for fun, and am unapologetic about how great writing and great thinking are inseparable. From the start of the interview process, I knew Clipboard Health lived and breathed writing, which was a major plus for me.”\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/660ea5ebbf0deba7c93f0236_riley-wilson.png)\\nRiley Wilson\\nStrategy & Operations\\n“I joined Clipboard Health because I don\\'t want to be just ‘good’: I want to be the best. Clipboard Health is a big company, solving big problems, and comes with the relatively de-risked outcomes that go with being a big, profitable unicorn startup. Despite its bigness, Clipboard still has all the DNA of a small startup: people here are relentless, they move outrageously fast, they take ownership and don\\'t tolerate complacency. Working here is not for everyone: it\\'s only for the best. And that\\'s exactly why I joined.”\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/660ea55c4bba79e52bb554e2_alex-friedman.png)\\nAlex Friedman\\nProduct Manager\\n“I joined Clipboard Health because of the chance to work autonomously, with other skilled and motivated engineers, at a company allergic to red tape and pointless meetings. While discussion is important, there is an emphasis on doing.”\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/660db61c9fe9d55d816e0b1c_Jack.png)\\nJack Sullivan\\nSenior Software Engineer, Security\\n“I have found my experience with Clipboard Health to be exceptionally rewarding. This company provides ample opportunities for personal growth, including leadership training that I have been able to apply effectively in my role. Moreover, the opportunity to take on diverse responsibilities has been invaluable in broadening my skill set and fostering continuous learning. I particularly appreciate the accessibility of our managers and senior leadership, who readily offer valuable insights and guidance, creating an environment where I feel both respected and encouraged to excel.”\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/660db61b9dc0c6af45d358b5_Christine.png)\\nChristine Presto\\nTechnical Support Manager\\n“I\\'ve been part of the Clipboard Health team for nearly three years, and it\\'s been nothing but the best. Aside from the convenience of remote work, I\\'ve been consistently impressed by the company\\'s attention to detail in delivering high-quality services and also the professionalism of the folks working in the company. Each colleague I\\'ve had the privilege of collaborating with demonstrates a remarkable level of competence and expertise. Moreover, your dedication is duly recognized and rewarded here!”\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/660db61b052d95057ad6d900_Darwin.png)\\nDarwin Alfonso\\nHospital Supply Recruiter\\n“Working at Clipboard Health changed my life. Having the freedom to work from anywhere, with people from all over the globe, and in a super pleasant environment. As a Legal Assistant, I learn every day from the best lawyers that make up Clipboard\\'s legal team. Something remarkable: Wei and Bo, Clipboard\\'s CEOs, are very present in daily work, and are super accessible if you need them. This makes me feel confident and supported. Without a doubt, Clipboard opened the door for me to a world of opportunities that I could never have imagined!”\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/660db61be35a79641a8ab6d2_Kelly.png)\\nKelly Taurizano\\nLegal Assistant \\n### Where we are today\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/650c3fc20c5b35956bcc456a_Frame%201321314658.svg)\\nPost Series C, $1.3B in valuation\\nAccusantium saepe minus quos similique qui voluptatum.\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/65141b1d393f30f4cbce889d_Vector%20\\\\(20\\\\).svg)\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/650c3fc20c5b35956bcc456a_Frame%201321314658.svg)\\nProfitable since 2022\\nAccusantium saepe minus quos similique qui voluptatum.\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/65141bc135afa2d134ad9ff2_Frame%201321314612.svg)\\nRaised $80M, backed by sequoia and IVP\\nAccusantium saepe minus quos similique qui voluptatum.\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/65141bd0265d9bb8310ee332_ycombinator-logo-ee6c80faf1d1ce2491d8%201.svg)\\nA Y Combinator Company, rank #71\\nAccusantium saepe minus quos similique qui voluptatum.\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/65141bf0a63b5ea8ab589cce_Frame%201321314658%20\\\\(1\\\\).svg)\\n6.2M+ unique Shift posted till date on our platform\\nAccusantium saepe minus quos similique qui voluptatum.\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/65141c095c7d32b3e44a2269_Frame%201321314612%20\\\\(1\\\\).svg)\\n650,000 downloads across Playstore and Appstore\\nAccusantium saepe minus quos similique qui voluptatum.\\n### Let the stats speak louder than words!\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/650c4de7b34e9c42eea9117d_Frame.png)\\n### Unveiling Our Growth Journey: Healthcare facilities using our platform\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/650c5090978b05dc7f18faab_Button%20\\\\(1\\\\).svg)\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/650c509bf848e526a4eb46f3_Button.svg)\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/650c4de7b34e9c42eea9117d_Frame.png)\\n### Unveiling Our Growth Journey: Healthcare facilities using our platform\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/650c5090978b05dc7f18faab_Button%20\\\\(1\\\\).svg)\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/650c509bf848e526a4eb46f3_Button.svg)\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/650c4de7b34e9c42eea9117d_Frame.png)\\n### Unveiling Our Growth Journey: Shifts posted on our platform\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/650c5090978b05dc7f18faab_Button%20\\\\(1\\\\).svg)\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/650c509bf848e526a4eb46f3_Button.svg)\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/65141c936f2839cea5cfff91_Frame%20\\\\(1\\\\).png)\\n### Unveiling Our Growth Journey: App Downloads\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/650c5090978b05dc7f18faab_Button%20\\\\(1\\\\).svg)\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/650c509bf848e526a4eb46f3_Button.svg)\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/65141cb2a71a74c8a4d5a105_Frame%20\\\\(2\\\\).png)\\n### Unveiling Our Growth Journey: Net Revenue\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/650c5090978b05dc7f18faab_Button%20\\\\(1\\\\).svg)\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/650c509bf848e526a4eb46f3_Button.svg)\\n### How we came to be\\nOur founder Wei Deng explores Clipboard Health\\'s Journey.\\n## From Then to Now: Our Journey and Our Vision\\nVoluptatum dolor harum quia debitis facere qui necessitatibus totam et nemo aperiam aut aut.\\n[Evolution of our Marketplace](https://www.clipboardhealth.com/<#w-tabs-0-data-w-pane-0>)[The future of work](https://www.clipboardhealth.com/<#w-tabs-0-data-w-pane-1>)[Making a difference](https://www.clipboardhealth.com/<#w-tabs-0-data-w-pane-2>)\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/6511553a9919b1e21843a9e7_arrow-right%202.svg)\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/6511553a9919b1e21843a9e7_arrow-right%202.svg)\\n### Shift Reliability\\nOne of the biggest challenges for any marketplace lies in consistently delivering on promises, particularly in terms of reliability. When we make commitments to our customers, such as providing a certain shift on a specific day, failing to fulfill these promises can erode our credibility. So, how do we guarantee that the shifts booked on our platform are reliably filled? Employing a combination of strategies designed to enhance the actual volume of shifts filled while concurrently reducing instances of No call No shows. Through an iterative and data-driven approach, we have achieved significant progress in maintaining our commitment to reliability, ultimately safeguarding our customers\\' trust in our platform.\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/65115268344b427fd4751318_Group%201761871.png)\\n### Instantpay\\nOne unique feature that our customers truly love and that sets us apart from the competition is our InstantPay service, launched in January 2022. InstantPay allows you to get paid for your scheduled shift immediately after uploading your timesheet. As of now, all shifts posted on our platform are covered under InstantPay.Nurses use our platform for a lot of reasons, from schedule control to workplace choice. Sometimes those reasons are related to an immediate need for extra funds, and we are incredibly proud of 100% InstantPay’s success in making sure they can get those funds as soon as possible.\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/651152943b1baa67e77c00ce_Group%201761865.png)\\n### License Manager\\nEvery healthcare professional in the US has at least one license that allows them to work, but many have multiple licenses for multiple qualifications, each allowing them to do different kinds of work, work in different places, or work for different facilities.To accommodate this, we built a streamlined license upload process, verification standard, and organization structure we call License Manager. With License Manager, a professional can upload as many licenses as they need and quickly see any and all shifts available to them through any of their various qualifications.**Since releasing License Manager:**\\n  * ![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/651152e3ff2d3e4c6bc67f05_Vector%20\\\\(66\\\\).svg)\\nOver 22,000 new licenses were uploaded in the 2 weeks following License Manager shipping\\n  * ![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/651152e3ff2d3e4c6bc67f05_Vector%20\\\\(66\\\\).svg)\\nThe proportion of shifts worked with a user’s non-primary license has increased 400%\\n  * ![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/651152e3ff2d3e4c6bc67f05_Vector%20\\\\(66\\\\).svg)\\nSome users have seen their weekly income nearly double due to the increased availability of shifts\\n\\n\\nLicense Manager represents an improvement to a previous process, one that worked but did not work perfectly. We are proud to say we never stop working on a problem until it’s really solved; License Manager represents an example of a time that paid off in a big way for our customers. You can learn more about the license manager feature [here.](https://www.clipboardhealth.com/<https:/support.clipboardhealth.com/hc/en-us/articles/9334754026519-Worker-Licenses>)\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/651153904162cd123e740e4c_Add%20files-rafiki%201.png)\\n### Urgent shift\\nUrgent Shifts is a feature within the Clipboard Health platform that addresses the challenges of last-minute staffing gaps in healthcare facilities. When an urgent staffing need is detected, the associated shift is marked as urgent (hence, becoming an Urgent Shift) and we notify and incentivize eligible professionals in the marketplace to fill the need.Urgent Shifts also create additional earning potential for healthcare professionals who are available to step in at short notice. These shifts are compensated at a higher rate than regular shifts, providing an incentive for healthcare professionals to respond promptly and fill the urgent staffing needs. You can learn more about urgent shift feature[ here.](https://www.clipboardhealth.com/<https:/support.clipboardhealth.com/hc/en-us/articles/10240850117399-Urgent-Shift-FAQs#:~:text=What%20is%20an%20Urgent%20Shift,any%20additional%20cost%20to%20you!>)\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/651153f7d9d3260d5d256bfe_Group%201761864%20\\\\(1\\\\).png)\\n### Priority Access\\nPriority Access is a feature that healthcare facilities can offer to highly-rated professionals who are on their Favorites list. With Priority Access, professionals can access shifts at the facility up to 6 hours before others. Temporary Priority Access is also available for those with a high attendance rate and no “no-shows”. Users can check their Priority Access days on their calendar, enabled through push notifications. As of September 2023, we have 42,000 registered nurses enjoying priority access, having collectively claimed over 710,000 shifts. You can learn more about this feature [here](https://www.clipboardhealth.com/<https:/support.clipboardhealth.com/hc/en-us/articles/10294524931607>).\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/65115438c9875b400127a71b_Group%201761863%20\\\\(1\\\\).png)\\n### Timesheets 2.0: Digital TS and Auto-Verification\\nWe implemented an on-site clock-in system for healthcare professionals (HCPs) in order to streamline the timekeeping process and reduce errors.The goal was to improve the accuracy of timekeeping, reduce the paperwork burden for HCPs and healthcare facilities (HCFs), and ultimately provide a more reliable and fraud-resistant system. You can learn more about this feature [here](https://www.clipboardhealth.com/<https:/support.clipboardhealth.com/hc/en-us/articles/12903032586903-Digital-Timesheets>).\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/65115480877f98f4d7da31b6_Group%201761858.png)\\n### Work with Friends\\nThe \"Work with Friends\" feature on Clipboard Health allows healthcare professionals to collaborate with colleagues/friends they prefer or have had positive working experiences with. They can enlist either a member who is already a user or invite their new friends to the platform. Users can view the number of professionals needed for a shift, book shifts with friends, and invite friends to work together. This collaboration often results in higher ratings from healthcare facilities, granting users earlier access to well-paying shifts through Priority Access..You can learn more about Work with Friends feature [here.](https://www.clipboardhealth.com/<https:/support.clipboardhealth.com/hc/en-us/articles/10411040507031-Work-with-Friends-FAQ#:~:text=You%20can%20add%20friends%20by,can%20send%20to%20your%20friends.>)\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/651154ae8a8e1ab8aedbdacd_Group%201761862.png)\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/6511553a9919b1e21843a9e7_arrow-right%202.svg)\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/6511553a9919b1e21843a9e7_arrow-right%202.svg)\\n### Our New verticals\\nStarting from 2021, Clipboard Health achieved remarkable success in addressing the demand-supply challenge for Long Term Care facilities (LTCs), emerging as the most dependable and preferred platform for LTCs seeking to fill per diem and urgent shifts. In early 2022, we recognized the potential to replicate this successful model across various labor segments driven by demand (Healthcare and outside of healthcare). Our vision is to excel in creating and managing labor marketplaces on a global scale, and throughout 2023 and 2024, our primary focus will be on expanding our marketplace well beyond LTCs to encompass a wide array of new verticals. While this list is not exhaustive, here are some of the new verticals currently in our pipeline with growth metrics:\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/651420e14af6e0d14635044c_Group%201761867.png)\\n### New Vertical: Hospitals\\nGMV growth from Hospital Vertical\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/65115d726cc8f89e5ec1cb2a_Frame%20\\\\(2\\\\).png)\\n### New Vertical: Dentistry\\n# of Weekly Distinct Dental shifts booked on our Platform\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/65142183732321989d2fc8b9_Frame%20\\\\(3\\\\).png)\\n### New Vertical: Pharmacy\\n# of Distinct Pharmacy Shift Posted (MoM)\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/651421aa2016730fdd75fd44_Frame%20\\\\(4\\\\).png)\\n### Maple: Scheduling and Timekeeping\\nMaple is an all-in-one platform for saving on costs, managing your schedule, and timekeeping & attendance. Best of all, it works across your in-house staff and agency partners — all in one place. Check out the product here.\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/651421c73d7771a5a1617322_Frame%20\\\\(5\\\\).png)\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/6511553a9919b1e21843a9e7_arrow-right%202.svg)\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/6511553a9919b1e21843a9e7_arrow-right%202.svg)\\n### We take pride in empowering our nurses to boost their income potential\\nAccording to the Bureau of Labor and Statistics, the median hourly wage for registered nurses is approximately $37. However, in 2022, we found that nurses using Clipboard Health were earning an average hourly rate of over $54. This substantial increase in income is not just a statistic; it\\'s a tangible difference that we believe matters.\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/65116b021a226284afb3f760_Group%201761868.png)\\n### Freedom to work on your own Terms!\\nOur platform empowers nurses with the freedom to shape their work according to their unique needs and aspirations. Whether it\\'s crafting a schedule that harmonizes with family life or dedicating time to advance their careers and education, our platform caters to individual preferences.Our nurses have the autonomy to select shifts that align with their life circumstances. This flexibility allows them to explore diverse healthcare facilities or cultivate deep relationships with a select few, all based on their specific requirements.We\\'re dedicated to aiding nurses in building the experience that perfectly aligns with their career trajectories and objectives\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/65116b6ed02c4ee5de2515ec_Group%201761869.png)\\n### We\\'re Here to Ensure Facilities Never Miss a Shift\\nAccording to this [UCSF article](https://www.clipboardhealth.com/<https:/nursing.ucsf.edu/news/nursing-shortage-national-problem-how-we-can-solve-it>), the US is experiencing a massive shortage of healthcare providers.According to this UCSF article, the US is experiencing a massive shortage of healthcare providers.As of September 2023, Clipboard Health has successfully filled over 4 million shifts across the facilities we serve. Each of these shifts translates to improved care for multiple patients precisely when they needed it most.\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/65116bd27f6074539f8b3daa_Group%201761871%20\\\\(1\\\\).png)\\n## Come, be a part of our success story!\\nJoin a truly global team: Teammates from 40+ countries would like to say hello!\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/65113ea550d46c486f10918f_Map.png)\\n### Join a growing team\\nStarting with just 6 members in 2018, we\\'re on track to become 750 strong by the end of this year.\\n[Join us now](https://www.clipboardhealth.com/</professionals>)\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/65113fe60a1a2d29d77d80e4_Frame%201321314664.jpg)\\n[![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/65114147cef785bd1419485b_united%20states.svg)United States](https://www.clipboardhealth.com/<#w-tabs-1-data-w-pane-0>)[![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/6511411633a997b6eba8e80b_globe%201.svg)Rest of the world](https://www.clipboardhealth.com/<#w-tabs-1-data-w-pane-1>)\\n### Your benefits\\nQui officia accusamus laboriosam repellat et provident dolorum et minima eaque voluptatum.\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/65114284c370dd7b591325a3_briefcase-24%202.svg)\\nRemote\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/65141f5bdaff1d5c70290af3_pig%201.svg)\\n401K\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/65141f715c7d32b3e44e2c8a_loan%201.svg)\\nEquity\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/65141f8208606a91578ef187_coins%201.svg)\\nBonus\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/65141f9303693ef8f10e2483_security%201.svg)\\nInsurance\\n### Your benefits\\nQui officia accusamus laboriosam repellat et provident dolorum et minima eaque voluptatum.\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/65114284c370dd7b591325a3_briefcase-24%202.svg)\\nRemote\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/65141fe4296860c93beee3c3_Vector%20\\\\(21\\\\).svg)\\nFlexible hours\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/65141f8208606a91578ef187_coins%201.svg)\\nPerformance bonus\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/6514201fbe0323ee902d437a_round-dollar%201.svg)\\nUS Dollars\\n## What makes our culture unique\\n1\\nOur Mission\\nSince day one, our goal has been to empower healthcare workers to achieve higher income, ascend the socio-economic ladder, and maintain full control over their working hours and preferences. Does that resonate with you?\\n1\\nHumility\\nOur every team-member are remarkably humble, devoid of ego-driven traits. We foster a culture of unwavering support and collaboration without silos, allowing you to dive into projects freely.\\n1\\nAutonomy\\nSince day one, our goal has been to empower healthcare workers to achieve higher income, ascend the socio-economic ladder, and maintain full control over their working hours and preferences. Does that resonate with you?\\nInterested in learning more about our work culture?\\nCheck out what Life/culture at Clipboard Health looks like\\n[Join us now](https://www.clipboardhealth.com/</professionals>)\\n## Join our team\\nOur philosophy is simple — hire a team of diverse, passionate people and foster a culture that empowers you to do you best work.\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/6511493ee85856d5f3ffc3f6_Group%201761861.png)\\n### Meet our Product and Strategy Team\\nOu Product and Strategy Team is a dynamic group that combines innovative thinking with practical expertise to shape our nursing solutions. They drive advancements in patient care by leveraging cutting-edge technology and strategic insights to deliver impactful products and services.\\n[Read more](https://www.clipboardhealth.com/</professionals>)\\n### Explore our engineering team\\nOur approach emphasizes ownership, where engineers guide projects from idea to release, facilitated by automated testing and continuous deployment.\\n[Read more](https://www.clipboardhealth.com/</professionals>)\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/65114a2c3b1baa67e77374df_Cross-platform%20software-amico%20\\\\(1\\\\)%201.png)\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/65114a3e1208b2bc9c5e4ea0_Group%201761860.png)\\n### Explore our customer operations team\\nOur Product and Strategy Team is a dynamic group that combines innovative thinking with practical expertise to shape our nursing solutions. They drive advancements in patient care by leveraging cutting-edge technology and strategic insights to deliver impactful products and services.\\n[Read more](https://www.clipboardhealth.com/</professionals>)\\n# Splide arrow style\\n## We have just begun to scratch the surface of what’s possible\\nJoin us in our journey as we revolutionize the labor marketplace.\\n[Apply now](https://www.clipboardhealth.com/<https:/boards.greenhouse.io/clipboardhealth?gh_src=b2e829504us>)\\n[![clipboard health logo](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/6331fdeac211b108ced7743f_CLIPBOARD%20HEALTH%20footer.svg)](https://www.clipboardhealth.com/</>)\\n![badge](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/6331fdeac211b15088d77437_GoldSeal_RBG%201.webp)\\nClipboard is Joint Commission Certified\\nMore info\\n[About](https://www.clipboardhealth.com/</about>)[Contact Us](https://www.clipboardhealth.com/</contact>)[Facilities](https://www.clipboardhealth.com/</facilities>)[Blog](https://www.clipboardhealth.com/</blog>)\\nCareers\\n[Corporate Careers](https://www.clipboardhealth.com/</careers>)[Engineering](https://www.clipboardhealth.com/</engineering>)\\nConnect\\n[Facebook](https://www.clipboardhealth.com/<https:/www.facebook.com/ClipboardHealth/>)[LinkedIn](https://www.clipboardhealth.com/<https:/www.linkedin.com/company/clipboard-health/>)[Twitter](https://www.clipboardhealth.com/<https:/twitter.com/clipboardhealth>)[YouTube](https://www.clipboardhealth.com/<https:/www.youtube.com/channel/UCm2AbFANEIWCyakf6dPBvbQ>)[Pinterest](https://www.clipboardhealth.com/<https:/www.pinterest.com/ClipboardHealth/_created/>)\\nLEGAL\\n[Terms of Service](https://www.clipboardhealth.com/</terms-of-service>)[Privacy Policy](https://www.clipboardhealth.com/</privacy-policy>)[CA Privacy Note](https://www.clipboardhealth.com/</ca-privacy-notice>)[Do Not Sell My Personal Information](https://www.clipboardhealth.com/</do-not-sell-my-personal-information>)[Support](https://www.clipboardhealth.com/<https:/support.clipboardhealth.com/hc/en-us>)\\nGET THE PROFESSIONALS APP\\n[![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/639b04ff5c967f21bb99d8f1_Mobile%20app%20store%20badge.svg)](https://www.clipboardhealth.com/<https:/clipboardhealth.sng.link/Dgvtq/7gqs/59sd>)[![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/639b05000c5a45a1e7b83dc2_Mobile%20app%20google%20badge.svg)](https://www.clipboardhealth.com/<https:/play.google.com/store/apps/details?id=health.clipboard.worker&pcampaignid=web_share>)\\nGET THE FACILITY APP\\n[![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/639b04ff5c967f21bb99d8f1_Mobile%20app%20store%20badge.svg)](https://www.clipboardhealth.com/<https:/clipboardhealth.sng.link/Dtggv/piew/hqom>)[![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/639b05000c5a45a1e7b83dc2_Mobile%20app%20google%20badge.svg)](https://www.clipboardhealth.com/<https:/play.google.com/store/apps/details?id=com.clipboardstaffing.facility&pcampaignid=web_share>)\\nClipboard Health is a service of Twomagnets LLC\\n![](https://t.co/1/i/adsct?bci=4&dv=Asia%2FCalcutta%26en-US%26Google%20Inc.%26Win32%26255%261080%26600%2612%2624%261080%26600%260%26na&eci=3&event=%7B%7D&event_id=4626ccf1-152d-4b71-8a43-a942451af8dd&integration=gtm&p_id=Twitter&p_user_id=0&pl_id=64d8b5fd-919e-49d5-8b35-b83f21c22897&tw_document_href=https%3A%2F%2Fwww.clipboardhealth.com%2Fcareers&tw_iframe_status=0&txn_id=o96p7&type=javascript&version=2.3.31)![](https://analytics.twitter.com/1/i/adsct?bci=4&dv=Asia%2FCalcutta%26en-US%26Google%20Inc.%26Win32%26255%261080%26600%2612%2624%261080%26600%260%26na&eci=3&event=%7B%7D&event_id=4626ccf1-152d-4b71-8a43-a942451af8dd&integration=gtm&p_id=Twitter&p_user_id=0&pl_id=64d8b5fd-919e-49d5-8b35-b83f21c22897&tw_document_href=https%3A%2F%2Fwww.clipboardhealth.com%2Fcareers&tw_iframe_status=0&txn_id=o96p7&type=javascript&version=2.3.31)\\n' markdown_with_citations='![⟨1⟩](https://www.clipboardhealth.com/</>)\\nFacilities\\nAcute Care⟨2⟩Skilled Nursing⟨3⟩Assisted Living⟨3⟩Behavioral Health⟨3⟩Rehabilitation⟨3⟩Ambulatory Surgery⟨3⟩Long-term Acute Care⟨3⟩Dental⟨3⟩Home health⟨3⟩Pharmacy⟨3⟩\\nFacilities⟨4⟩Professionals⟨5⟩Resources⟨6⟩About⟨7⟩Engineering⟨8⟩Contact⟨9⟩Search⟨10⟩Sign Up⟨11⟩Facility Log In⟨12⟩\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/660d776dc447990a8bf631bf_careers-hero--image.svg)\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/633ee8841c78f88763c6694b_magdiel-lagos-7hjh_X3xsDA-unsplash.jpg)\\n## Make a differencewith us\\nJoin us and discover a rewarding career path as we work to lift individuals and communities up the socio-economic ladder.\\nApply now⟨13⟩\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/660d776dc447990a8bf631bf_careers-hero--image.svg)\\n### Where we are today\\n550+team members in 40+ countries (and counting!)⟨11⟩$1.3Bin valuation⟨14⟩$80Min funding, backed by Sequoia & IVP⟨15⟩#69in Y Combinator’s top 100 companies⟨16⟩100%remote since day 1⟨11⟩\\n20X+\\ngrowth sinceJanuary 2021\\n50%+\\nYoY growth in active Health Care Professionals\\n30%+\\nYoY growth in active Health Care Facilities\\n50%+\\nYoY growth in Shifts posted on our platform\\n### Meet our visionary founder\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/660d89d6db3b2294aa8dc00c_founder-profile-image.png)\\nWei Deng is the founder and CEO of Clipboard Health, a series C Sequoia-backed start-up valued at $1.3B. Before founding Clipboard Health, Wei attended Yale College, and graduated from Yale Law School. She started her career as a lawyer working at one of the nation\\'s most prestigious law firms, Davis Polk & Wardwell. She then worked as an Investment Banking Associate at Moelis & Company before she became the second non-engineering hire (Product Manager and Business Operations) at Sendwave, a remittance startup for the African diaspora, and was responsible for opening the UK and European corridor which was later on acquired for $500M.Listen to Wei as she talks about why she started Clipboard Health with podcaster George Quraishi from Artifact.\\nListen now⟨17⟩\\n### What makes ourculture unique\\nWe define culture as nothing less and nothing more than the set of behaviors perceived to be rewarded or punished within an organization.\\nJoin us now⟨13⟩\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/660d94cc5271e86e247cdec9_group-of-people.png)\\n### Behaviors = Values\\nAt Clipboard Health, our values are the guiding principles that shape our culture and define who we are as a company. They inspire us, guide our decisions, and drive our actions every day. Here\\'s a glimpse into what we stand for:\\n### 01\\n### Noticing & Curiosity\\nWe are annoyingly curious. We notice clues to issues or opportunities when others may not. We ask “why” and “how” many times in a row with the intention to get to the root of a problem or situation, because we really want to understand it deeply from first principles. We continually challenge our own understanding of our customers, our market, and our business. We avoid unexamined assumptions and think through our actions from first principles starting with the end goal in mind. We actively look for clues to disconfirm our deepest held beliefs and are continuously updating our mental model of the world. What was the reason, and what may have been right yesterday, is no longer so today. \\u200d\\n### 02\\n### Ownership\\nWe take full responsibility and accountability for our domain areas and our results, and we own the outcome. We believe that we have agency over what we do, and that no one else is to blame. We own up to where things fall short, and we figure out how we can improve our world through our actions alone. We seek and fix problems beyond our immediate designated areas, so nothing falls “between the cracks.” We fix problems we see quickly, and put processes in place to make sure they stay fixed and don’t happen again. We are proactive - we 1) notice subtle clues that may portend more systematic issues, 2) dig to find out the root issue, and 3) fix the root issue that improves our business for the long run.\\u200d\\n### 03\\n### Initiative & Persistence\\nWe have a bias for action. We know many decisions are reversible, and take calculated risks daily to deliver results today rather than tomorrow (much less next week) because our customers are suffering today. We are scrappy & self reliant, stretching ourselves to “get the MVP out the door today” rather than wade through meetings and coordination just to get a first version out. When we are a stakeholder, we don\\'t just say no; say yes to something else; we try to push forward towards a solution rather than just push back against a proposal with “but what about…” sentences. We will never have all the information we want to make a decision, and analysis paralysis can kill us as a startup. We are proactive & deep: when something goes wrong we ask, root cause it deeply and extract all the learnings we can personally and for our team. We learn by doing, not by discussion in a committee. Speed matters. We don’t worry about “stepping on toes” - we don’t have toes here, nobody has a monopoly on work they’re not doing.\\n### 04\\n### Judgment & Decisiveness\\nWe have strong judgment and good instincts. We are detail oriented, at the correct level of detail for the situation. We know when to be scrappy experimenters & when to build hardened scalable solutions; very few items are in between. We are quick & decisive. We step up and make the call, knowing we’ll make mistakes but hey that’s better than putting off the decision or asking yet another person for their opinion. In summary: we make the right decision, quickly.\\u200d\\n### 05\\n### Think from First Principles\\nAnti-incremental thinking. We don’t believe in asking “how can we be 10% better” because the status quo is the wrong starting point. Instead, we imagine the ideal impossible customer experience from scratch and back our way into reality. We seek the fundamental truths, and reason up from there. This applies to how we work as well: we re-imagine how product, operations, engineering and every part of the org should be; not what they’re like in other companies and how we can improve on that.\\u200d\\n### 06\\n### Humble\\nWe’re low ego. We care about getting to the best results, not about who is right. We care about how much we learned, not how much we know. We care about doing what’s best for the team & mission, not what’s best for ourselves today. We are gracious to each other. We look for ways to encourage and help when possible, even if it doesn’t fall in our “designated” domain. We readily admit it when we don’t know something, and act swiftly to rectify. We want to become better versions of ourselves, so we actively search for our own faults. We cherish feedback, seeing it as the gift it is to help us improve, and acting on it as appropriate with haste & vigor.\\u200d\\n### 07\\n### Customer Centricity\\nWe feel each customer’s pain viscerally, even though we must fix things systematically. Talking to customers and fixing a particular customer’s job is everyone’s job. We obsess over how to improve customers\\' lives immediately and in the long term.\\u200d\\n### 08\\n### Uncomfortably High Standards\\nWe have uncomfortably high standards for ourselves, our teams, and our peers. We believe in quality and speed. We surprise and delight our customers and each other with outcomes that are far better than expected. We imagine what a magical outcome would be, and aim for that, executing with exceptional effort and creativity. We set the standard for our industry in Operational Excellence. We push ourselves & each other towards something that seemed impossible just weeks ago. We are proud of what we create and our reputation with our customers, our industry, and our community. When customers work with us, or when a new employee joins us, we want them to say: “wow, every part of their organization is excellent.\"\\n### 09\\n### Unreasonably Fast \\nWe set our operational cadence to “run”, not walk. When someone asks us if they can get back to us about something next week, we reply ‘how about tomorrow morning’ even if it’s unreasonable, because you’ll never know until you try. We’re known as the place that reaches out to candidates within hours of them posting their profile, and always first. When we promise something to a customer, instead of saying “next week” we say “in two hours” because it is easy to differentiate ourselves by being faster, yet so few bother to do it because slow is comfortable. We constantly ask ourselves: “can I get this done faster?”\\n### 10\\n### Relish Discomfort\\nWe have the courage to do what’s needed even if it’s uncomfortable; especially if it’s uncomfortable. Need to jump into analytics but know you’re weak at math? We put in the extra time to learn it and jump in with both feet. Need to tell someone their work wasn’t up to your high standards? We don’t look away or delay despite discomfort and instead act quickly & decisively without sugar coating it.\\u200d\\n### 11\\n### See for Yourself\\n### See for Yourself\\nWe Dive Deep. Touch reality yourself. We stay connected to the details, audit frequently, and are skeptical when metrics and anecdotes differ. We start at the lowest level of detail. We touch reality by seeing for ourselves: \\u200d- We talk to customers, not just read other people’s customer conversation notes. - We listen to support calls, not just read reports or look at metrics. - We pull random (or particularly bad) ops & support tickets and read what happened, who said what, look at timestamps. We read pull requests, not just ask managers how the project went or what happened. - We secret shop the experience our team is giving customers, i.e. by calling our own support number and asking for help on our own Clipboard account. Our managers know their metrics deeply & are excellent at the craft they lead. They obsess over metrics and customer conversations to better understand their business “to the metal” and make well considered data driven decisions when possible. No task is beneath them, or “above their pay grade”. We realize the one customer complaint they happened to hear about probably isn’t unique, and take it as a clue to seek out the truth at scale.\\n### 12\\n### Hire, Develop and “Rehire” the Best\\nWe raise the performance bar with every hire and promotion. They recognize exceptional talent, and willingly move them throughout the organization including to other teams to learn & deliver. Leaders realize when they’ve hired someone unexceptional and unapologetically hands that person an exit package to make space for someone exceptional in that role. We focus our precious coaching and development time on growing and rounding out exceptional talent so they can become the next generation of leaders, instead of shoring up underperformers hoping they’ll magically improve. Leaders know that with every new month, every new quarter, they are “rehiring” the person already in a seat for that seat for the next month or quarter, and their high standards are no different for rehiring that person than for hiring him or her in the first place.\\u200d\\n### 13\\n### Accurately Self Aware\\nThe more senior your role, the more you have to rely on your own self awareness (in addition to humility, and asking for feedback). Though not necessary, most people will stop giving you the critical feedback needed to improve if you’ve been here longer, are their manager, or simply are perceived to be “respected” by others. Do you have a list of your own mistakes? Do you acknowledge them publicly so others can see & learn from your humility? Are you accurate in your self assessment? (Because generic humility or needless self deprecation is also unhelpful). If I asked you what person A, person B, or person C who works with or for you thought were your strengths and weaknesses, would you get it right? Have you asked them? (You don’t have to agree with them; self awareness is understanding how you’re perceived separate of whether you agree).\\u200d\\n### Life at Clipboard Health\\n**Work 100% Remote**\\nUnlimited Paid Time Off\\nCompetitive Family Leave Options\\nCompetitiveFamily Leave Options\\nJoin our team⟨13⟩\\n### Want to take a closer look at our work life?\\nLearn more⟨18⟩\\n### What employees are saying\\n“Working at Clipboard Health has been more than just a job; it\\'s been a journey of personal and professional growth. I am grateful to be surrounded by supportive teams and inspiring leaders who encourage me to think creatively and pursue my passions. I enjoy our vibrant culture and am proud to be part of a company that genuinely values its employees and fosters an environment where we can thrive.”\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/660ea50e43b46f2c84c5c09f_drea-bent.png)\\nDrae Bent\\nAccounts Payable Manager\\n“Joining Clipboard Health was an easy choice for me. Their customer-centric approach, vibrant startup culture, and flexible work-from-anywhere policy were exactly what I was looking for. I\\'m excited to contribute to its continued success.\" \\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/660db61c7dc159a0372e8a12_Alex.png)\\nAlex Van de Kleut\\nSenior Software Engineer\\n“What made me join Clipboard Health? Well, I was most excited about the writing culture here. I love to write, do it for fun, and am unapologetic about how great writing and great thinking are inseparable. From the start of the interview process, I knew Clipboard Health lived and breathed writing, which was a major plus for me.”\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/660ea5ebbf0deba7c93f0236_riley-wilson.png)\\nRiley Wilson\\nStrategy & Operations\\n“I joined Clipboard Health because I don\\'t want to be just ‘good’: I want to be the best. Clipboard Health is a big company, solving big problems, and comes with the relatively de-risked outcomes that go with being a big, profitable unicorn startup. Despite its bigness, Clipboard still has all the DNA of a small startup: people here are relentless, they move outrageously fast, they take ownership and don\\'t tolerate complacency. Working here is not for everyone: it\\'s only for the best. And that\\'s exactly why I joined.”\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/660ea55c4bba79e52bb554e2_alex-friedman.png)\\nAlex Friedman\\nProduct Manager\\n“I joined Clipboard Health because of the chance to work autonomously, with other skilled and motivated engineers, at a company allergic to red tape and pointless meetings. While discussion is important, there is an emphasis on doing.”\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/660db61c9fe9d55d816e0b1c_Jack.png)\\nJack Sullivan\\nSenior Software Engineer, Security\\n“I have found my experience with Clipboard Health to be exceptionally rewarding. This company provides ample opportunities for personal growth, including leadership training that I have been able to apply effectively in my role. Moreover, the opportunity to take on diverse responsibilities has been invaluable in broadening my skill set and fostering continuous learning. I particularly appreciate the accessibility of our managers and senior leadership, who readily offer valuable insights and guidance, creating an environment where I feel both respected and encouraged to excel.”\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/660db61b9dc0c6af45d358b5_Christine.png)\\nChristine Presto\\nTechnical Support Manager\\n“I\\'ve been part of the Clipboard Health team for nearly three years, and it\\'s been nothing but the best. Aside from the convenience of remote work, I\\'ve been consistently impressed by the company\\'s attention to detail in delivering high-quality services and also the professionalism of the folks working in the company. Each colleague I\\'ve had the privilege of collaborating with demonstrates a remarkable level of competence and expertise. Moreover, your dedication is duly recognized and rewarded here!”\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/660db61b052d95057ad6d900_Darwin.png)\\nDarwin Alfonso\\nHospital Supply Recruiter\\n“Working at Clipboard Health changed my life. Having the freedom to work from anywhere, with people from all over the globe, and in a super pleasant environment. As a Legal Assistant, I learn every day from the best lawyers that make up Clipboard\\'s legal team. Something remarkable: Wei and Bo, Clipboard\\'s CEOs, are very present in daily work, and are super accessible if you need them. This makes me feel confident and supported. Without a doubt, Clipboard opened the door for me to a world of opportunities that I could never have imagined!”\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/660db61be35a79641a8ab6d2_Kelly.png)\\nKelly Taurizano\\nLegal Assistant \\n“Working at Clipboard Health has been more than just a job; it\\'s been a journey of personal and professional growth. I am grateful to be surrounded by supportive teams and inspiring leaders who encourage me to think creatively and pursue my passions. I enjoy our vibrant culture and am proud to be part of a company that genuinely values its employees and fosters an environment where we can thrive.”\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/660ea50e43b46f2c84c5c09f_drea-bent.png)\\nDrae Bent\\nAccounts Payable Manager\\n“Joining Clipboard Health was an easy choice for me. Their customer-centric approach, vibrant startup culture, and flexible work-from-anywhere policy were exactly what I was looking for. I\\'m excited to contribute to its continued success.\" \\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/660db61c7dc159a0372e8a12_Alex.png)\\nAlex Van de Kleut\\nSenior Software Engineer\\n“What made me join Clipboard Health? Well, I was most excited about the writing culture here. I love to write, do it for fun, and am unapologetic about how great writing and great thinking are inseparable. From the start of the interview process, I knew Clipboard Health lived and breathed writing, which was a major plus for me.”\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/660ea5ebbf0deba7c93f0236_riley-wilson.png)\\nRiley Wilson\\nStrategy & Operations\\n“I joined Clipboard Health because I don\\'t want to be just ‘good’: I want to be the best. Clipboard Health is a big company, solving big problems, and comes with the relatively de-risked outcomes that go with being a big, profitable unicorn startup. Despite its bigness, Clipboard still has all the DNA of a small startup: people here are relentless, they move outrageously fast, they take ownership and don\\'t tolerate complacency. Working here is not for everyone: it\\'s only for the best. And that\\'s exactly why I joined.”\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/660ea55c4bba79e52bb554e2_alex-friedman.png)\\nAlex Friedman\\nProduct Manager\\n“I joined Clipboard Health because of the chance to work autonomously, with other skilled and motivated engineers, at a company allergic to red tape and pointless meetings. While discussion is important, there is an emphasis on doing.”\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/660db61c9fe9d55d816e0b1c_Jack.png)\\nJack Sullivan\\nSenior Software Engineer, Security\\n“I have found my experience with Clipboard Health to be exceptionally rewarding. This company provides ample opportunities for personal growth, including leadership training that I have been able to apply effectively in my role. Moreover, the opportunity to take on diverse responsibilities has been invaluable in broadening my skill set and fostering continuous learning. I particularly appreciate the accessibility of our managers and senior leadership, who readily offer valuable insights and guidance, creating an environment where I feel both respected and encouraged to excel.”\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/660db61b9dc0c6af45d358b5_Christine.png)\\nChristine Presto\\nTechnical Support Manager\\n“I\\'ve been part of the Clipboard Health team for nearly three years, and it\\'s been nothing but the best. Aside from the convenience of remote work, I\\'ve been consistently impressed by the company\\'s attention to detail in delivering high-quality services and also the professionalism of the folks working in the company. Each colleague I\\'ve had the privilege of collaborating with demonstrates a remarkable level of competence and expertise. Moreover, your dedication is duly recognized and rewarded here!”\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/660db61b052d95057ad6d900_Darwin.png)\\nDarwin Alfonso\\nHospital Supply Recruiter\\n“Working at Clipboard Health changed my life. Having the freedom to work from anywhere, with people from all over the globe, and in a super pleasant environment. As a Legal Assistant, I learn every day from the best lawyers that make up Clipboard\\'s legal team. Something remarkable: Wei and Bo, Clipboard\\'s CEOs, are very present in daily work, and are super accessible if you need them. This makes me feel confident and supported. Without a doubt, Clipboard opened the door for me to a world of opportunities that I could never have imagined!”\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/660db61be35a79641a8ab6d2_Kelly.png)\\nKelly Taurizano\\nLegal Assistant \\n“Working at Clipboard Health has been more than just a job; it\\'s been a journey of personal and professional growth. I am grateful to be surrounded by supportive teams and inspiring leaders who encourage me to think creatively and pursue my passions. I enjoy our vibrant culture and am proud to be part of a company that genuinely values its employees and fosters an environment where we can thrive.”\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/660ea50e43b46f2c84c5c09f_drea-bent.png)\\nDrae Bent\\nAccounts Payable Manager\\n“Joining Clipboard Health was an easy choice for me. Their customer-centric approach, vibrant startup culture, and flexible work-from-anywhere policy were exactly what I was looking for. I\\'m excited to contribute to its continued success.\" \\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/660db61c7dc159a0372e8a12_Alex.png)\\nAlex Van de Kleut\\nSenior Software Engineer\\n“What made me join Clipboard Health? Well, I was most excited about the writing culture here. I love to write, do it for fun, and am unapologetic about how great writing and great thinking are inseparable. From the start of the interview process, I knew Clipboard Health lived and breathed writing, which was a major plus for me.”\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/660ea5ebbf0deba7c93f0236_riley-wilson.png)\\nRiley Wilson\\nStrategy & Operations\\n“I joined Clipboard Health because I don\\'t want to be just ‘good’: I want to be the best. Clipboard Health is a big company, solving big problems, and comes with the relatively de-risked outcomes that go with being a big, profitable unicorn startup. Despite its bigness, Clipboard still has all the DNA of a small startup: people here are relentless, they move outrageously fast, they take ownership and don\\'t tolerate complacency. Working here is not for everyone: it\\'s only for the best. And that\\'s exactly why I joined.”\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/660ea55c4bba79e52bb554e2_alex-friedman.png)\\nAlex Friedman\\nProduct Manager\\n“I joined Clipboard Health because of the chance to work autonomously, with other skilled and motivated engineers, at a company allergic to red tape and pointless meetings. While discussion is important, there is an emphasis on doing.”\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/660db61c9fe9d55d816e0b1c_Jack.png)\\nJack Sullivan\\nSenior Software Engineer, Security\\n“I have found my experience with Clipboard Health to be exceptionally rewarding. This company provides ample opportunities for personal growth, including leadership training that I have been able to apply effectively in my role. Moreover, the opportunity to take on diverse responsibilities has been invaluable in broadening my skill set and fostering continuous learning. I particularly appreciate the accessibility of our managers and senior leadership, who readily offer valuable insights and guidance, creating an environment where I feel both respected and encouraged to excel.”\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/660db61b9dc0c6af45d358b5_Christine.png)\\nChristine Presto\\nTechnical Support Manager\\n“I\\'ve been part of the Clipboard Health team for nearly three years, and it\\'s been nothing but the best. Aside from the convenience of remote work, I\\'ve been consistently impressed by the company\\'s attention to detail in delivering high-quality services and also the professionalism of the folks working in the company. Each colleague I\\'ve had the privilege of collaborating with demonstrates a remarkable level of competence and expertise. Moreover, your dedication is duly recognized and rewarded here!”\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/660db61b052d95057ad6d900_Darwin.png)\\nDarwin Alfonso\\nHospital Supply Recruiter\\n“Working at Clipboard Health changed my life. Having the freedom to work from anywhere, with people from all over the globe, and in a super pleasant environment. As a Legal Assistant, I learn every day from the best lawyers that make up Clipboard\\'s legal team. Something remarkable: Wei and Bo, Clipboard\\'s CEOs, are very present in daily work, and are super accessible if you need them. This makes me feel confident and supported. Without a doubt, Clipboard opened the door for me to a world of opportunities that I could never have imagined!”\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/660db61be35a79641a8ab6d2_Kelly.png)\\nKelly Taurizano\\nLegal Assistant \\n“Working at Clipboard Health has been more than just a job; it\\'s been a journey of personal and professional growth. I am grateful to be surrounded by supportive teams and inspiring leaders who encourage me to think creatively and pursue my passions. I enjoy our vibrant culture and am proud to be part of a company that genuinely values its employees and fosters an environment where we can thrive.”\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/660ea50e43b46f2c84c5c09f_drea-bent.png)\\nDrae Bent\\nAccounts Payable Manager\\n“Joining Clipboard Health was an easy choice for me. Their customer-centric approach, vibrant startup culture, and flexible work-from-anywhere policy were exactly what I was looking for. I\\'m excited to contribute to its continued success.\" \\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/660db61c7dc159a0372e8a12_Alex.png)\\nAlex Van de Kleut\\nSenior Software Engineer\\n“What made me join Clipboard Health? Well, I was most excited about the writing culture here. I love to write, do it for fun, and am unapologetic about how great writing and great thinking are inseparable. From the start of the interview process, I knew Clipboard Health lived and breathed writing, which was a major plus for me.”\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/660ea5ebbf0deba7c93f0236_riley-wilson.png)\\nRiley Wilson\\nStrategy & Operations\\n“I joined Clipboard Health because I don\\'t want to be just ‘good’: I want to be the best. Clipboard Health is a big company, solving big problems, and comes with the relatively de-risked outcomes that go with being a big, profitable unicorn startup. Despite its bigness, Clipboard still has all the DNA of a small startup: people here are relentless, they move outrageously fast, they take ownership and don\\'t tolerate complacency. Working here is not for everyone: it\\'s only for the best. And that\\'s exactly why I joined.”\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/660ea55c4bba79e52bb554e2_alex-friedman.png)\\nAlex Friedman\\nProduct Manager\\n“I joined Clipboard Health because of the chance to work autonomously, with other skilled and motivated engineers, at a company allergic to red tape and pointless meetings. While discussion is important, there is an emphasis on doing.”\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/660db61c9fe9d55d816e0b1c_Jack.png)\\nJack Sullivan\\nSenior Software Engineer, Security\\n“I have found my experience with Clipboard Health to be exceptionally rewarding. This company provides ample opportunities for personal growth, including leadership training that I have been able to apply effectively in my role. Moreover, the opportunity to take on diverse responsibilities has been invaluable in broadening my skill set and fostering continuous learning. I particularly appreciate the accessibility of our managers and senior leadership, who readily offer valuable insights and guidance, creating an environment where I feel both respected and encouraged to excel.”\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/660db61b9dc0c6af45d358b5_Christine.png)\\nChristine Presto\\nTechnical Support Manager\\n“I\\'ve been part of the Clipboard Health team for nearly three years, and it\\'s been nothing but the best. Aside from the convenience of remote work, I\\'ve been consistently impressed by the company\\'s attention to detail in delivering high-quality services and also the professionalism of the folks working in the company. Each colleague I\\'ve had the privilege of collaborating with demonstrates a remarkable level of competence and expertise. Moreover, your dedication is duly recognized and rewarded here!”\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/660db61b052d95057ad6d900_Darwin.png)\\nDarwin Alfonso\\nHospital Supply Recruiter\\n“Working at Clipboard Health changed my life. Having the freedom to work from anywhere, with people from all over the globe, and in a super pleasant environment. As a Legal Assistant, I learn every day from the best lawyers that make up Clipboard\\'s legal team. Something remarkable: Wei and Bo, Clipboard\\'s CEOs, are very present in daily work, and are super accessible if you need them. This makes me feel confident and supported. Without a doubt, Clipboard opened the door for me to a world of opportunities that I could never have imagined!”\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/660db61be35a79641a8ab6d2_Kelly.png)\\nKelly Taurizano\\nLegal Assistant \\n“Working at Clipboard Health has been more than just a job; it\\'s been a journey of personal and professional growth. I am grateful to be surrounded by supportive teams and inspiring leaders who encourage me to think creatively and pursue my passions. I enjoy our vibrant culture and am proud to be part of a company that genuinely values its employees and fosters an environment where we can thrive.”\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/660ea50e43b46f2c84c5c09f_drea-bent.png)\\nDrae Bent\\nAccounts Payable Manager\\n“Joining Clipboard Health was an easy choice for me. Their customer-centric approach, vibrant startup culture, and flexible work-from-anywhere policy were exactly what I was looking for. I\\'m excited to contribute to its continued success.\" \\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/660db61c7dc159a0372e8a12_Alex.png)\\nAlex Van de Kleut\\nSenior Software Engineer\\n“What made me join Clipboard Health? Well, I was most excited about the writing culture here. I love to write, do it for fun, and am unapologetic about how great writing and great thinking are inseparable. From the start of the interview process, I knew Clipboard Health lived and breathed writing, which was a major plus for me.”\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/660ea5ebbf0deba7c93f0236_riley-wilson.png)\\nRiley Wilson\\nStrategy & Operations\\n“I joined Clipboard Health because I don\\'t want to be just ‘good’: I want to be the best. Clipboard Health is a big company, solving big problems, and comes with the relatively de-risked outcomes that go with being a big, profitable unicorn startup. Despite its bigness, Clipboard still has all the DNA of a small startup: people here are relentless, they move outrageously fast, they take ownership and don\\'t tolerate complacency. Working here is not for everyone: it\\'s only for the best. And that\\'s exactly why I joined.”\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/660ea55c4bba79e52bb554e2_alex-friedman.png)\\nAlex Friedman\\nProduct Manager\\n“I joined Clipboard Health because of the chance to work autonomously, with other skilled and motivated engineers, at a company allergic to red tape and pointless meetings. While discussion is important, there is an emphasis on doing.”\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/660db61c9fe9d55d816e0b1c_Jack.png)\\nJack Sullivan\\nSenior Software Engineer, Security\\n“I have found my experience with Clipboard Health to be exceptionally rewarding. This company provides ample opportunities for personal growth, including leadership training that I have been able to apply effectively in my role. Moreover, the opportunity to take on diverse responsibilities has been invaluable in broadening my skill set and fostering continuous learning. I particularly appreciate the accessibility of our managers and senior leadership, who readily offer valuable insights and guidance, creating an environment where I feel both respected and encouraged to excel.”\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/660db61b9dc0c6af45d358b5_Christine.png)\\nChristine Presto\\nTechnical Support Manager\\n“I\\'ve been part of the Clipboard Health team for nearly three years, and it\\'s been nothing but the best. Aside from the convenience of remote work, I\\'ve been consistently impressed by the company\\'s attention to detail in delivering high-quality services and also the professionalism of the folks working in the company. Each colleague I\\'ve had the privilege of collaborating with demonstrates a remarkable level of competence and expertise. Moreover, your dedication is duly recognized and rewarded here!”\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/660db61b052d95057ad6d900_Darwin.png)\\nDarwin Alfonso\\nHospital Supply Recruiter\\n“Working at Clipboard Health changed my life. Having the freedom to work from anywhere, with people from all over the globe, and in a super pleasant environment. As a Legal Assistant, I learn every day from the best lawyers that make up Clipboard\\'s legal team. Something remarkable: Wei and Bo, Clipboard\\'s CEOs, are very present in daily work, and are super accessible if you need them. This makes me feel confident and supported. Without a doubt, Clipboard opened the door for me to a world of opportunities that I could never have imagined!”\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/660db61be35a79641a8ab6d2_Kelly.png)\\nKelly Taurizano\\nLegal Assistant \\n### Where we are today\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/650c3fc20c5b35956bcc456a_Frame%201321314658.svg)\\nPost Series C, $1.3B in valuation\\nAccusantium saepe minus quos similique qui voluptatum.\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/65141b1d393f30f4cbce889d_Vector%20\\\\(20\\\\).svg)\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/650c3fc20c5b35956bcc456a_Frame%201321314658.svg)\\nProfitable since 2022\\nAccusantium saepe minus quos similique qui voluptatum.\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/65141bc135afa2d134ad9ff2_Frame%201321314612.svg)\\nRaised $80M, backed by sequoia and IVP\\nAccusantium saepe minus quos similique qui voluptatum.\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/65141bd0265d9bb8310ee332_ycombinator-logo-ee6c80faf1d1ce2491d8%201.svg)\\nA Y Combinator Company, rank #71\\nAccusantium saepe minus quos similique qui voluptatum.\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/65141bf0a63b5ea8ab589cce_Frame%201321314658%20\\\\(1\\\\).svg)\\n6.2M+ unique Shift posted till date on our platform\\nAccusantium saepe minus quos similique qui voluptatum.\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/65141c095c7d32b3e44a2269_Frame%201321314612%20\\\\(1\\\\).svg)\\n650,000 downloads across Playstore and Appstore\\nAccusantium saepe minus quos similique qui voluptatum.\\n### Let the stats speak louder than words!\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/650c4de7b34e9c42eea9117d_Frame.png)\\n### Unveiling Our Growth Journey: Healthcare facilities using our platform\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/650c5090978b05dc7f18faab_Button%20\\\\(1\\\\).svg)\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/650c509bf848e526a4eb46f3_Button.svg)\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/650c4de7b34e9c42eea9117d_Frame.png)\\n### Unveiling Our Growth Journey: Healthcare facilities using our platform\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/650c5090978b05dc7f18faab_Button%20\\\\(1\\\\).svg)\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/650c509bf848e526a4eb46f3_Button.svg)\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/650c4de7b34e9c42eea9117d_Frame.png)\\n### Unveiling Our Growth Journey: Shifts posted on our platform\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/650c5090978b05dc7f18faab_Button%20\\\\(1\\\\).svg)\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/650c509bf848e526a4eb46f3_Button.svg)\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/65141c936f2839cea5cfff91_Frame%20\\\\(1\\\\).png)\\n### Unveiling Our Growth Journey: App Downloads\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/650c5090978b05dc7f18faab_Button%20\\\\(1\\\\).svg)\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/650c509bf848e526a4eb46f3_Button.svg)\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/65141cb2a71a74c8a4d5a105_Frame%20\\\\(2\\\\).png)\\n### Unveiling Our Growth Journey: Net Revenue\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/650c5090978b05dc7f18faab_Button%20\\\\(1\\\\).svg)\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/650c509bf848e526a4eb46f3_Button.svg)\\n### How we came to be\\nOur founder Wei Deng explores Clipboard Health\\'s Journey.\\n## From Then to Now: Our Journey and Our Vision\\nVoluptatum dolor harum quia debitis facere qui necessitatibus totam et nemo aperiam aut aut.\\nEvolution of our Marketplace⟨19⟩The future of work⟨20⟩Making a difference⟨21⟩\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/6511553a9919b1e21843a9e7_arrow-right%202.svg)\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/6511553a9919b1e21843a9e7_arrow-right%202.svg)\\n### Shift Reliability\\nOne of the biggest challenges for any marketplace lies in consistently delivering on promises, particularly in terms of reliability. When we make commitments to our customers, such as providing a certain shift on a specific day, failing to fulfill these promises can erode our credibility. So, how do we guarantee that the shifts booked on our platform are reliably filled? Employing a combination of strategies designed to enhance the actual volume of shifts filled while concurrently reducing instances of No call No shows. Through an iterative and data-driven approach, we have achieved significant progress in maintaining our commitment to reliability, ultimately safeguarding our customers\\' trust in our platform.\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/65115268344b427fd4751318_Group%201761871.png)\\n### Instantpay\\nOne unique feature that our customers truly love and that sets us apart from the competition is our InstantPay service, launched in January 2022. InstantPay allows you to get paid for your scheduled shift immediately after uploading your timesheet. As of now, all shifts posted on our platform are covered under InstantPay.Nurses use our platform for a lot of reasons, from schedule control to workplace choice. Sometimes those reasons are related to an immediate need for extra funds, and we are incredibly proud of 100% InstantPay’s success in making sure they can get those funds as soon as possible.\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/651152943b1baa67e77c00ce_Group%201761865.png)\\n### License Manager\\nEvery healthcare professional in the US has at least one license that allows them to work, but many have multiple licenses for multiple qualifications, each allowing them to do different kinds of work, work in different places, or work for different facilities.To accommodate this, we built a streamlined license upload process, verification standard, and organization structure we call License Manager. With License Manager, a professional can upload as many licenses as they need and quickly see any and all shifts available to them through any of their various qualifications.**Since releasing License Manager:**\\n  * ![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/651152e3ff2d3e4c6bc67f05_Vector%20\\\\(66\\\\).svg)\\nOver 22,000 new licenses were uploaded in the 2 weeks following License Manager shipping\\n  * ![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/651152e3ff2d3e4c6bc67f05_Vector%20\\\\(66\\\\).svg)\\nThe proportion of shifts worked with a user’s non-primary license has increased 400%\\n  * ![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/651152e3ff2d3e4c6bc67f05_Vector%20\\\\(66\\\\).svg)\\nSome users have seen their weekly income nearly double due to the increased availability of shifts\\n\\n\\nLicense Manager represents an improvement to a previous process, one that worked but did not work perfectly. We are proud to say we never stop working on a problem until it’s really solved; License Manager represents an example of a time that paid off in a big way for our customers. You can learn more about the license manager feature here.⟨22⟩\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/651153904162cd123e740e4c_Add%20files-rafiki%201.png)\\n### Urgent shift\\nUrgent Shifts is a feature within the Clipboard Health platform that addresses the challenges of last-minute staffing gaps in healthcare facilities. When an urgent staffing need is detected, the associated shift is marked as urgent (hence, becoming an Urgent Shift) and we notify and incentivize eligible professionals in the marketplace to fill the need.Urgent Shifts also create additional earning potential for healthcare professionals who are available to step in at short notice. These shifts are compensated at a higher rate than regular shifts, providing an incentive for healthcare professionals to respond promptly and fill the urgent staffing needs. You can learn more about urgent shift feature here.⟨23⟩\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/651153f7d9d3260d5d256bfe_Group%201761864%20\\\\(1\\\\).png)\\n### Priority Access\\nPriority Access is a feature that healthcare facilities can offer to highly-rated professionals who are on their Favorites list. With Priority Access, professionals can access shifts at the facility up to 6 hours before others. Temporary Priority Access is also available for those with a high attendance rate and no “no-shows”. Users can check their Priority Access days on their calendar, enabled through push notifications. As of September 2023, we have 42,000 registered nurses enjoying priority access, having collectively claimed over 710,000 shifts. You can learn more about this feature here⟨24⟩.\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/65115438c9875b400127a71b_Group%201761863%20\\\\(1\\\\).png)\\n### Timesheets 2.0: Digital TS and Auto-Verification\\nWe implemented an on-site clock-in system for healthcare professionals (HCPs) in order to streamline the timekeeping process and reduce errors.The goal was to improve the accuracy of timekeeping, reduce the paperwork burden for HCPs and healthcare facilities (HCFs), and ultimately provide a more reliable and fraud-resistant system. You can learn more about this feature here⟨25⟩.\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/65115480877f98f4d7da31b6_Group%201761858.png)\\n### Work with Friends\\nThe \"Work with Friends\" feature on Clipboard Health allows healthcare professionals to collaborate with colleagues/friends they prefer or have had positive working experiences with. They can enlist either a member who is already a user or invite their new friends to the platform. Users can view the number of professionals needed for a shift, book shifts with friends, and invite friends to work together. This collaboration often results in higher ratings from healthcare facilities, granting users earlier access to well-paying shifts through Priority Access..You can learn more about Work with Friends feature here.⟨26⟩\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/651154ae8a8e1ab8aedbdacd_Group%201761862.png)\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/6511553a9919b1e21843a9e7_arrow-right%202.svg)\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/6511553a9919b1e21843a9e7_arrow-right%202.svg)\\n### Our New verticals\\nStarting from 2021, Clipboard Health achieved remarkable success in addressing the demand-supply challenge for Long Term Care facilities (LTCs), emerging as the most dependable and preferred platform for LTCs seeking to fill per diem and urgent shifts. In early 2022, we recognized the potential to replicate this successful model across various labor segments driven by demand (Healthcare and outside of healthcare). Our vision is to excel in creating and managing labor marketplaces on a global scale, and throughout 2023 and 2024, our primary focus will be on expanding our marketplace well beyond LTCs to encompass a wide array of new verticals. While this list is not exhaustive, here are some of the new verticals currently in our pipeline with growth metrics:\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/651420e14af6e0d14635044c_Group%201761867.png)\\n### New Vertical: Hospitals\\nGMV growth from Hospital Vertical\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/65115d726cc8f89e5ec1cb2a_Frame%20\\\\(2\\\\).png)\\n### New Vertical: Dentistry\\n# of Weekly Distinct Dental shifts booked on our Platform\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/65142183732321989d2fc8b9_Frame%20\\\\(3\\\\).png)\\n### New Vertical: Pharmacy\\n# of Distinct Pharmacy Shift Posted (MoM)\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/651421aa2016730fdd75fd44_Frame%20\\\\(4\\\\).png)\\n### Maple: Scheduling and Timekeeping\\nMaple is an all-in-one platform for saving on costs, managing your schedule, and timekeeping & attendance. Best of all, it works across your in-house staff and agency partners — all in one place. Check out the product here.\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/651421c73d7771a5a1617322_Frame%20\\\\(5\\\\).png)\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/6511553a9919b1e21843a9e7_arrow-right%202.svg)\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/6511553a9919b1e21843a9e7_arrow-right%202.svg)\\n### We take pride in empowering our nurses to boost their income potential\\nAccording to the Bureau of Labor and Statistics, the median hourly wage for registered nurses is approximately $37. However, in 2022, we found that nurses using Clipboard Health were earning an average hourly rate of over $54. This substantial increase in income is not just a statistic; it\\'s a tangible difference that we believe matters.\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/65116b021a226284afb3f760_Group%201761868.png)\\n### Freedom to work on your own Terms!\\nOur platform empowers nurses with the freedom to shape their work according to their unique needs and aspirations. Whether it\\'s crafting a schedule that harmonizes with family life or dedicating time to advance their careers and education, our platform caters to individual preferences.Our nurses have the autonomy to select shifts that align with their life circumstances. This flexibility allows them to explore diverse healthcare facilities or cultivate deep relationships with a select few, all based on their specific requirements.We\\'re dedicated to aiding nurses in building the experience that perfectly aligns with their career trajectories and objectives\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/65116b6ed02c4ee5de2515ec_Group%201761869.png)\\n### We\\'re Here to Ensure Facilities Never Miss a Shift\\nAccording to this UCSF article⟨27⟩, the US is experiencing a massive shortage of healthcare providers.According to this UCSF article, the US is experiencing a massive shortage of healthcare providers.As of September 2023, Clipboard Health has successfully filled over 4 million shifts across the facilities we serve. Each of these shifts translates to improved care for multiple patients precisely when they needed it most.\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/65116bd27f6074539f8b3daa_Group%201761871%20\\\\(1\\\\).png)\\n## Come, be a part of our success story!\\nJoin a truly global team: Teammates from 40+ countries would like to say hello!\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/65113ea550d46c486f10918f_Map.png)\\n### Join a growing team\\nStarting with just 6 members in 2018, we\\'re on track to become 750 strong by the end of this year.\\nJoin us now⟨5⟩\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/65113fe60a1a2d29d77d80e4_Frame%201321314664.jpg)\\n![⟨28⟩United States](https://www.clipboardhealth.com/<#w-tabs-1-data-w-pane-0>)![⟨29⟩Rest of the world](https://www.clipboardhealth.com/<#w-tabs-1-data-w-pane-1>)\\n### Your benefits\\nQui officia accusamus laboriosam repellat et provident dolorum et minima eaque voluptatum.\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/65114284c370dd7b591325a3_briefcase-24%202.svg)\\nRemote\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/65141f5bdaff1d5c70290af3_pig%201.svg)\\n401K\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/65141f715c7d32b3e44e2c8a_loan%201.svg)\\nEquity\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/65141f8208606a91578ef187_coins%201.svg)\\nBonus\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/65141f9303693ef8f10e2483_security%201.svg)\\nInsurance\\n### Your benefits\\nQui officia accusamus laboriosam repellat et provident dolorum et minima eaque voluptatum.\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/65114284c370dd7b591325a3_briefcase-24%202.svg)\\nRemote\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/65141fe4296860c93beee3c3_Vector%20\\\\(21\\\\).svg)\\nFlexible hours\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/65141f8208606a91578ef187_coins%201.svg)\\nPerformance bonus\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/6514201fbe0323ee902d437a_round-dollar%201.svg)\\nUS Dollars\\n## What makes our culture unique\\n1\\nOur Mission\\nSince day one, our goal has been to empower healthcare workers to achieve higher income, ascend the socio-economic ladder, and maintain full control over their working hours and preferences. Does that resonate with you?\\n1\\nHumility\\nOur every team-member are remarkably humble, devoid of ego-driven traits. We foster a culture of unwavering support and collaboration without silos, allowing you to dive into projects freely.\\n1\\nAutonomy\\nSince day one, our goal has been to empower healthcare workers to achieve higher income, ascend the socio-economic ladder, and maintain full control over their working hours and preferences. Does that resonate with you?\\nInterested in learning more about our work culture?\\nCheck out what Life/culture at Clipboard Health looks like\\nJoin us now⟨5⟩\\n## Join our team\\nOur philosophy is simple — hire a team of diverse, passionate people and foster a culture that empowers you to do you best work.\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/6511493ee85856d5f3ffc3f6_Group%201761861.png)\\n### Meet our Product and Strategy Team\\nOu Product and Strategy Team is a dynamic group that combines innovative thinking with practical expertise to shape our nursing solutions. They drive advancements in patient care by leveraging cutting-edge technology and strategic insights to deliver impactful products and services.\\nRead more⟨5⟩\\n### Explore our engineering team\\nOur approach emphasizes ownership, where engineers guide projects from idea to release, facilitated by automated testing and continuous deployment.\\nRead more⟨5⟩\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/65114a2c3b1baa67e77374df_Cross-platform%20software-amico%20\\\\(1\\\\)%201.png)\\n![](https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/65114a3e1208b2bc9c5e4ea0_Group%201761860.png)\\n### Explore our customer operations team\\nOur Product and Strategy Team is a dynamic group that combines innovative thinking with practical expertise to shape our nursing solutions. They drive advancements in patient care by leveraging cutting-edge technology and strategic insights to deliver impactful products and services.\\nRead more⟨5⟩\\n# Splide arrow style\\n## We have just begun to scratch the surface of what’s possible\\nJoin us in our journey as we revolutionize the labor marketplace.\\nApply now⟨13⟩\\n![clipboard health logo⟨30⟩](https://www.clipboardhealth.com/</>)\\n![badge⟨31⟩]\\nClipboard is Joint Commission Certified\\nMore info\\nAbout⟨7⟩Contact Us⟨9⟩Facilities⟨3⟩Blog⟨32⟩\\nCareers\\nCorporate Careers⟨33⟩Engineering⟨8⟩\\nConnect\\nFacebook⟨34⟩LinkedIn⟨35⟩Twitter⟨36⟩YouTube⟨37⟩Pinterest⟨38⟩\\nLEGAL\\nTerms of Service⟨39⟩Privacy Policy⟨40⟩CA Privacy Note⟨41⟩Do Not Sell My Personal Information⟨42⟩Support⟨6⟩\\nGET THE PROFESSIONALS APP\\n![⟨43⟩](https://www.clipboardhealth.com/<https:/clipboardhealth.sng.link/Dgvtq/7gqs/59sd>)![⟨44⟩](https://www.clipboardhealth.com/<https:/play.google.com/store/apps/details?id=health.clipboard.worker&pcampaignid=web_share>)\\nGET THE FACILITY APP\\n![⟨43⟩](https://www.clipboardhealth.com/<https:/clipboardhealth.sng.link/Dtggv/piew/hqom>)![⟨44⟩](https://www.clipboardhealth.com/<https:/play.google.com/store/apps/details?id=com.clipboardstaffing.facility&pcampaignid=web_share>)\\nClipboard Health is a service of Twomagnets LLC\\n![](https://t.co/1/i/adsct?bci=4&dv=Asia%2FCalcutta%26en-US%26Google%20Inc.%26Win32%26255%261080%26600%2612%2624%261080%26600%260%26na&eci=3&event=%7B%7D&event_id=4626ccf1-152d-4b71-8a43-a942451af8dd&integration=gtm&p_id=Twitter&p_user_id=0&pl_id=64d8b5fd-919e-49d5-8b35-b83f21c22897&tw_document_href=https%3A%2F%2Fwww.clipboardhealth.com%2Fcareers&tw_iframe_status=0&txn_id=o96p7&type=javascript&version=2.3.31)![](https://analytics.twitter.com/1/i/adsct?bci=4&dv=Asia%2FCalcutta%26en-US%26Google%20Inc.%26Win32%26255%261080%26600%2612%2624%261080%26600%260%26na&eci=3&event=%7B%7D&event_id=4626ccf1-152d-4b71-8a43-a942451af8dd&integration=gtm&p_id=Twitter&p_user_id=0&pl_id=64d8b5fd-919e-49d5-8b35-b83f21c22897&tw_document_href=https%3A%2F%2Fwww.clipboardhealth.com%2Fcareers&tw_iframe_status=0&txn_id=o96p7&type=javascript&version=2.3.31)\\n' references_markdown='\\n\\n## References\\n\\n⟨1⟩ https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/63d7e4dcc375a62efe51e399_bunnylogo.png: ![\\n⟨2⟩ https://www.clipboardhealth.com/</acute-care>: Acute Care\\n⟨3⟩ https://www.clipboardhealth.com/</facilities>: Skilled Nursing\\n⟨4⟩ https://www.clipboardhealth.com/<https:/clipboard.health/workplace/get-access>: Facilities\\n⟨5⟩ https://www.clipboardhealth.com/</professionals>: Professionals\\n⟨6⟩ https://www.clipboardhealth.com/<https:/support.clipboardhealth.com/hc/en-us>: Resources\\n⟨7⟩ https://www.clipboardhealth.com/</about>: About\\n⟨8⟩ https://www.clipboardhealth.com/</engineering>: Engineering\\n⟨9⟩ https://www.clipboardhealth.com/</contact>: Contact\\n⟨10⟩ https://www.clipboardhealth.com/</search-results>: Search\\n⟨11⟩ https://www.clipboardhealth.com/<#>: Sign Up\\n⟨12⟩ https://www.clipboardhealth.com/<https:/clipboard.health/enter>: Facility Log In\\n⟨13⟩ https://www.clipboardhealth.com/<https:/boards.greenhouse.io/clipboardhealth?gh_src=b2e829504us>: Apply now\\n⟨14⟩ https://www.clipboardhealth.com/<https:/www.fiercehealthcare.com/health-tech/clipboard-health-online-hiring-platform-notches-80m>: $1.3Bin valuation\\n⟨15⟩ https://www.clipboardhealth.com/<https:/techcrunch.com/2022/04/18/clipboard-health-which-matches-health-workers-with-facilities-raises-80m/>: $80Min funding, backed by Sequoia & IVP\\n⟨16⟩ https://www.clipboardhealth.com/<https:/www.ycombinator.com/topcompanies/valuation>: #69in Y Combinator’s top 100 companies\\n⟨17⟩ https://www.clipboardhealth.com/<https:/www.heyartifact.com/creations/how-wei-deng-built-clipboard-health/>: Listen now\\n⟨18⟩ https://www.clipboardhealth.com/</how-we-work>: Learn more\\n⟨19⟩ https://www.clipboardhealth.com/<#w-tabs-0-data-w-pane-0>: Evolution of our Marketplace\\n⟨20⟩ https://www.clipboardhealth.com/<#w-tabs-0-data-w-pane-1>: The future of work\\n⟨21⟩ https://www.clipboardhealth.com/<#w-tabs-0-data-w-pane-2>: Making a difference\\n⟨22⟩ https://www.clipboardhealth.com/<https:/support.clipboardhealth.com/hc/en-us/articles/9334754026519-Worker-Licenses>: here.\\n⟨23⟩ https://www.clipboardhealth.com/<https:/support.clipboardhealth.com/hc/en-us/articles/10240850117399-Urgent-Shift-FAQs#:~:text=What%20is%20an%20Urgent%20Shift,any%20additional%20cost%20to%20you!>:  here.\\n⟨24⟩ https://www.clipboardhealth.com/<https:/support.clipboardhealth.com/hc/en-us/articles/10294524931607>: here\\n⟨25⟩ https://www.clipboardhealth.com/<https:/support.clipboardhealth.com/hc/en-us/articles/12903032586903-Digital-Timesheets>: here\\n⟨26⟩ https://www.clipboardhealth.com/<https:/support.clipboardhealth.com/hc/en-us/articles/10411040507031-Work-with-Friends-FAQ#:~:text=You%20can%20add%20friends%20by,can%20send%20to%20your%20friends.>: here.\\n⟨27⟩ https://www.clipboardhealth.com/<https:/nursing.ucsf.edu/news/nursing-shortage-national-problem-how-we-can-solve-it>: UCSF article\\n⟨28⟩ https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/65114147cef785bd1419485b_united%20states.svg: ![\\n⟨29⟩ https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/6511411633a997b6eba8e80b_globe%201.svg: ![\\n⟨30⟩ https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/6331fdeac211b108ced7743f_CLIPBOARD%20HEALTH%20footer.svg: ![clipboard health logo\\n⟨31⟩ https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/6331fdeac211b15088d77437_GoldSeal_RBG%201.webp: badge\\n⟨32⟩ https://www.clipboardhealth.com/</blog>: Blog\\n⟨33⟩ https://www.clipboardhealth.com/</careers>: Corporate Careers\\n⟨34⟩ https://www.clipboardhealth.com/<https:/www.facebook.com/ClipboardHealth/>: Facebook\\n⟨35⟩ https://www.clipboardhealth.com/<https:/www.linkedin.com/company/clipboard-health/>: LinkedIn\\n⟨36⟩ https://www.clipboardhealth.com/<https:/twitter.com/clipboardhealth>: Twitter\\n⟨37⟩ https://www.clipboardhealth.com/<https:/www.youtube.com/channel/UCm2AbFANEIWCyakf6dPBvbQ>: YouTube\\n⟨38⟩ https://www.clipboardhealth.com/<https:/www.pinterest.com/ClipboardHealth/_created/>: Pinterest\\n⟨39⟩ https://www.clipboardhealth.com/</terms-of-service>: Terms of Service\\n⟨40⟩ https://www.clipboardhealth.com/</privacy-policy>: Privacy Policy\\n⟨41⟩ https://www.clipboardhealth.com/</ca-privacy-notice>: CA Privacy Note\\n⟨42⟩ https://www.clipboardhealth.com/</do-not-sell-my-personal-information>: Do Not Sell My Personal Information\\n⟨43⟩ https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/639b04ff5c967f21bb99d8f1_Mobile%20app%20store%20badge.svg: ![\\n⟨44⟩ https://cdn.prod.website-files.com/6331fdb067d0d2e7fcce41d8/639b05000c5a45a1e7b83dc2_Mobile%20app%20google%20badge.svg: ![\\n' fit_markdown='' fit_html=''",
  "generated_description": "**Clipboard Health: A Direct Connection Between Nurses and Healthcare Facilities**\n\n**Mission and Vision**\nClipboard Health is a dynamic company with a clear mission: to connect healthcare facilities with nearby nurses. The core philosophy behind this is simple yet profound: lift people up the socioeconomic ladder by providing healthcare professionals with the tools they need to turn their extra time and ambition into tangible career growth and financial opportunities.\n\nFounded in 2017 and proudly part of Y Combinator's W17 batch, Clipboard Health has made significant strides in the healthcare labor marketplace. Its app-driven marketplace allows healthcare professionals to book on-demand shifts while healthcare facilities gain access to a pool of talent that meets their immediate needs.\n\n**Business Model and Growth**\nThis model operates on classic two-sided network effects, where both nurses and facilities benefit from increased participation. The company has achieved impressive metrics—growing its revenue by 25 times in just 18 months and boasting over 4 million shifts filled since inception. Clipboard Health’s simplicity and utility have solidified its product-market fit, already generating substantial revenue and serving to tackle critical staffing shortages across the healthcare industry.\n\nAs a Series C startup valued at $1.3 billion, Clipboard Health is backed by highly regarded investors, including Sequoia Capital and IVP. This financial foundation provides the necessary resources to scale and innovate.\n\n**Culture and Work Environment**\nThe culture at Clipboard Health is defined by values like ownership, curiosity, and an uncomfortably high standard of performance. The company prides itself on not just solving problems but doing so with speed and effectiveness. Employees enjoy the flexibility of a remote-first work environment with competitive benefits including unlimited paid time off, competitive family leave options, and a commitment to personal and professional growth.\n\nThe company, which has expanded to a diverse team of over 600 employees across more than 40 countries, emphasizes collaboration and mutual support within its ranks. Employee testimonials highlight a nurturing atmosphere where creativity is encouraged, and professional aspirations are supported.\n\n**Innovative Features**\nClipboard Health's success is also linked to its innovative features, such as:\n\n- **InstantPay**: A service allowing healthcare professionals to receive immediate payment after completing their shifts, addressing cash flow needs in real-time.\n- **License Manager**: A streamlined process for nurses to upload and verify multiple professional licenses, making it easier for them to pick up shifts that match their qualifications.\n- **Urgent Shifts**: A response mechanism for last-minute staffing needs that incentivizes healthcare professionals to fill shifts that require immediate attention.\n\n**Looking Forward**\nClipboard Health is not just a marketplace; it's a movement toward reshaping the future of work in the healthcare sector. They aim to expand into new verticals beyond long-term care—venturing into hospitals, dental practices, and pharmacies—adapting to the evolving needs of the healthcare landscape. \n\nBy continuously innovating and listening to its users, Clipboard Health is positioned to not only facilitate shift filling but to transform the entire staffing workforce dynamic in healthcare.\n\nIn summary, Clipboard Health embodies the intersection of technology and human need, seeking to enhance lives through opportunity, connection, and empowerment. **[Join their team](https://www.clipboardhealth.com/careers) and be part of the change!**"
}