{
  "links": "https://www.ycombinator.com/companies/creatoros",
  "name": "CreatorOS",
  "headline": "Building tools for verifying information consumed by AI agents",
  "batch": "W21",
  "description": "We build tools that allows enterprises verify information about a user *before* processing it - whether it is processed by a human or an AI agent.\r\n\nTraditionally, these verifications including but not limited to background checks cost ~$10. Using our advancements in AI and Cryptography, we're able to send that cost to a few cents. \r\n\nThis enables enterprises to do verification at scale, earlier in their work-flows, and enables new kinds of businesses - which were not performing these verifications because of prohibitively high costs.\r\n\nFor example, it makes no sense that a recruiter does a candidate's document verification and background checks AFTER the candidate has cleared all the interviews. That's because that verification is cumbersome and expensive. They can't afford to verify all the candidates at the top of the funnel. Many such workflows are ripe for disruption. \r\n\nAnother example of a product that was not possible before. A dating app uses our tools to verify the users' information - including their employment, education and financial background. This was something that would have been too expensive to verify at a $10 pricepoint where the ARPU is only $8. \r\n\nNot only that, we're designing the tools ground up - so that AI agents can utilize these verifications before ingesting information, so that they take action basis truthful information.\r\n\nWe have 3 tools\r\n1. BlueCheck : our flagship product for background verification. The cheapest option to verify users' employment, education and financial background. A few cents instead of a few tens of dollars. Several Billion Dollar+ revenue companies are customers. A solution designed for enterprises that works out of the box!\r\n2. Reclaim Protocol : our underlying infrastructure that makes BlueCheck possible. With advancements in cryptography, specifically zero knowledge proofs - our research over the last 3 years have resulted in inventing a new cryptographic primitive called zkTLS, which allows us to verify information from any website using the cryptography of the existing internet pipes (TLS). This is our secret sauce!\r\n3. Questbook : our dog-fooding tool. Questbook is a tool to give out research and open source software development grants. These grants are reviewed by AI agents that we built inhouse. The biggest scam people try is to fake who they are when they are applying for grants. We dog-food our own tools to make sure we verify all the claims the users are making when they apply for grants. Our tools secure more than $10M of grants being given out on the platform. So it's high stakes, and it works!",
  "activity_status": "Active",
  "website": "https://creatoros.co",
  "founded_date": 2021.0,
  "team_size": 26.0,
  "location": "Hyderabad, India",
  "group_partner": null,
  "group_partner_yc": null,
  "company_linkedin": null,
  "company_twitter": null,
  "tags": "industry:aiops; industry:crypto-web3; industry:identity; industry:api; industry:ai",
  "founders": [
    {
      "name": "Madhavan Malolan, Founder",
      "description": "Madhavan, Co-Founder of CreatorOS\nBuilding tools for verifying information consumed by AI agents.\n\nWe help humans and AI agents figure : \n1. What to verify\n2. How to verify\n3. Actually execute verification\n\nYC Badge: 0xa2dDFc8a6C1F8868B80F2747D04532a6cDE9804d",
      "linkedin": "https://www.linkedin.com/in/madhavan-malolan-8b129b42/"
    },
    {
      "name": "Sriharsha Karamchati, Founder",
      "description": "Enabling the world to create more.",
      "linkedin": "https://www.linkedin.com/in/sriharsha-karamchati-0730947b/"
    },
    {
      "name": "Subhash Karri, Founder",
      "description": "Subhash is a senior start-up leader, entrepreneur, and ex-consultant. At CreatorOS, he leads business development, partnerships, and business operations. Previously, he established and grew a business vertical to a $400M AUM business and a 120 member team at Mytrah.",
      "linkedin": "https://www.linkedin.com/in/subhash-karri/"
    }
  ],
  "status": true,
  "markdown": "raw_markdown='# CreatorOS Inc\\nCreating tools for _real use_ , using blockchain technologies and cryptography \\n## Contact Us\\nAddress: 1043 South Bernado Avenue, Sunnyvale, CA 94087\\nEmail: admin@creatoros.co\\n## Founders\\nCurrent \\n  * Madhavan Malolan\\n  * Harsha Karamchati\\n  * Subhash Karri\\n\\nPast \\n  * Abhilash Inumella\\n\\n\\n## Products\\n### BlueCheck\\nBlueCheck uses the latest advancements in AI and Cryptography to provide the lowest cost of user credential verifications. Under a dollar.\\n[Website](https://creatoros.co/<https:/thebluecheck.com>) | [ LinkedIn ](https://creatoros.co/<https:/www.linkedin.com/company/thebluecheck/>)\\n### Reclaim Protocol\\nReclaim Protocol helps generate cryptographic proofs of credentials of a user on any website. Once this proof is created, it can be shared with and verified by any other website.\\n[Website](https://creatoros.co/<https:/reclaimprotocol.org>) | [Github](https://creatoros.co/<https:/github.com/reclaimprotocol>) | [Docs](https://creatoros.co/<https:/docs.reclaimprotocol.org>) | [LinkedIn](https://creatoros.co/<https:/www.linkedin.com/company/reclaimprotocol>) | [ X.com ](https://creatoros.co/<https:/x.com/reclaimprotocol>) | [Brand Assets](https://creatoros.co/<https:/s3.ap-south-1.amazonaws.com/creatoros.co/reclaim-brand.zip>)\\n### Questbook Grants\\nQuestbook is a Grant Management System that helps organizations accept grant applications, track applications, and make payments.\\n[Website](https://creatoros.co/<https:/questbook.xyz>) | [Github](https://creatoros.co/<https:/github.com/questbook>) | [LinkedIn](https://creatoros.co/<https:/www.linkedin.com/company/questbookapp>) | [ X.com](https://creatoros.co/<https:/x.com/questbookapp>) | [Brand Assets](https://creatoros.co/<https:/s3.ap-south-1.amazonaws.com/creatoros.co/questbook-brand.zip>)\\n## Jobs\\nApply [here](https://creatoros.co/<https:/www.ycombinator.com/companies/reclaim-protocol-questbook/jobs>)\\n' markdown_with_citations='# CreatorOS Inc\\nCreating tools for _real use_ , using blockchain technologies and cryptography \\n## Contact Us\\nAddress: 1043 South Bernado Avenue, Sunnyvale, CA 94087\\nEmail: admin@creatoros.co\\n## Founders\\nCurrent \\n  * Madhavan Malolan\\n  * Harsha Karamchati\\n  * Subhash Karri\\n\\nPast \\n  * Abhilash Inumella\\n\\n\\n## Products\\n### BlueCheck\\nBlueCheck uses the latest advancements in AI and Cryptography to provide the lowest cost of user credential verifications. Under a dollar.\\nWebsite⟨1⟩ |  LinkedIn ⟨2⟩\\n### Reclaim Protocol\\nReclaim Protocol helps generate cryptographic proofs of credentials of a user on any website. Once this proof is created, it can be shared with and verified by any other website.\\nWebsite⟨3⟩ | Github⟨4⟩ | Docs⟨5⟩ | LinkedIn⟨6⟩ |  X.com ⟨7⟩ | Brand Assets⟨8⟩\\n### Questbook Grants\\nQuestbook is a Grant Management System that helps organizations accept grant applications, track applications, and make payments.\\nWebsite⟨9⟩ | Github⟨10⟩ | LinkedIn⟨11⟩ |  X.com⟨12⟩ | Brand Assets⟨13⟩\\n## Jobs\\nApply here⟨14⟩\\n' references_markdown='\\n\\n## References\\n\\n⟨1⟩ https://creatoros.co/<https:/thebluecheck.com>: Website\\n⟨2⟩ https://creatoros.co/<https:/www.linkedin.com/company/thebluecheck/>:  LinkedIn \\n⟨3⟩ https://creatoros.co/<https:/reclaimprotocol.org>: Website\\n⟨4⟩ https://creatoros.co/<https:/github.com/reclaimprotocol>: Github\\n⟨5⟩ https://creatoros.co/<https:/docs.reclaimprotocol.org>: Docs\\n⟨6⟩ https://creatoros.co/<https:/www.linkedin.com/company/reclaimprotocol>: LinkedIn\\n⟨7⟩ https://creatoros.co/<https:/x.com/reclaimprotocol>:  X.com \\n⟨8⟩ https://creatoros.co/<https:/s3.ap-south-1.amazonaws.com/creatoros.co/reclaim-brand.zip>: Brand Assets\\n⟨9⟩ https://creatoros.co/<https:/questbook.xyz>: Website\\n⟨10⟩ https://creatoros.co/<https:/github.com/questbook>: Github\\n⟨11⟩ https://creatoros.co/<https:/www.linkedin.com/company/questbookapp>: LinkedIn\\n⟨12⟩ https://creatoros.co/<https:/x.com/questbookapp>:  X.com\\n⟨13⟩ https://creatoros.co/<https:/s3.ap-south-1.amazonaws.com/creatoros.co/questbook-brand.zip>: Brand Assets\\n⟨14⟩ https://creatoros.co/<https:/www.ycombinator.com/companies/reclaim-protocol-questbook/jobs>: here\\n' fit_markdown='' fit_html=''",
  "generated_description": "**CreatorOS: Revolutionizing Information Verification for the AI Age**\n\nFounded in 2021 and part of the Y Combinator W21 batch, CreatorOS is based in Hyderabad, India, and is on the cutting edge of a critical problem—verifying information for AI agents. Right out of the gate, the mission was clear: to build tools that allow organizations to confirm user information before it’s processed—whether by humans or AI.\n\nTraditionally, verifying user backgrounds involves hefty costs—around $10 or more for the typical check. CreatorOS has flipped that model on its head, leveraging advancements in AI and cryptography to reduce those costs to mere cents. This dramatic drop enables enterprises to conduct verifications at scale much earlier in their processes, unlocking new business opportunities that were previously thwarted by exorbitant verification costs.\n\nTake recruitment, for example. It doesn’t make practical sense for companies to conduct deep background checks only after candidates have cleared multiple interviews. CreatorOS allows recruiters to check vital information upfront, streamlining the hiring process. \n\nAnother application comes from the dating industry; CreatorOS's tools can verify users' employment, education, and financial backgrounds—an enormous value add that’s previously been unfeasible due to cost constraints.\n\n### Key Products\n\n1. **BlueCheck**: This is the flagship product, offering comprehensive background verification at a fraction of traditional costs. It’s designed for enterprise use, working straight out of the box. Major companies are already utilizing BlueCheck to verify users' crucial information easily and affordably.\n\n2. **Reclaim Protocol**: Serving as the backbone of BlueCheck, this innovative infrastructure employs zero-knowledge proofs to authenticate information sourced from any website. Think of it as the “secret sauce” that’s been developed over three years of dedicated research, enabling secure and efficient verification processes.\n\n3. **Questbook**: This tool acts as the company’s own verification playground. It manages research and open-source software development grants, ensuring that claims made in applications are verified through in-house AI agents. It’s high stakes—over $10 million in grants are processed, demonstrating the reliability of their verification tools in action.\n\n### The Bottom Line\n\nWith a lean team of 26 employees and major backing from Y Combinator, CreatorOS is poised to disrupt the verification space. They’re opening up a plethora of business opportunities across various industries—from hiring to dating and beyond—by enabling truthful information exchanges on a large scale.\n\nIf you're intrigued by the potential of AI, crypto, and identity solutions, CreatorOS is undoubtedly a company to watch. Check them out on their [website](https://creatoros.co) and see how they’re changing the game."
}