{
  "links": "https://www.ycombinator.com/companies/dreamcraft-entertainment-inc",
  "name": "DreamCraft Entertainment, Inc.",
  "headline": "Platform that allows anyone to create and monetize video games.",
  "batch": "S18",
  "description": "DreamCraft enables anyone to create, publish, and monetize video games. The company’s core product is a code-free game creation platform, bundled with high quality art assets. DreamCraft is backed by March Capital, Makers Fund, Tencent Corporation, Y Combinator, and other top investors in the gaming space. The company was founded in 2018 and now has a global team of 20+ people with half remote and half based in Silicon Valley.",
  "activity_status": "Active",
  "website": "https://www.dreamcraft.com/",
  "founded_date": 2018.0,
  "team_size": 23.0,
  "location": "Redwood City, CA",
  "group_partner": null,
  "group_partner_yc": null,
  "company_linkedin": null,
  "company_twitter": null,
  "tags": "industry:developer-tools; industry:entertainment; industry:gaming; location:san-francisco-bay-area",
  "founders": [],
  "status": true,
  "markdown": "raw_markdown='☰\\n[![© DreamCraft Entertainment](https://i.imgur.com/1x1mvGB.png)](https://www.dreamcraft.com/</>)\\n[Home](https://www.dreamcraft.com/</>)[Careers](https://www.dreamcraft.com/</careers/>)\\n![© DreamCraft Entertainment](https://i.imgur.com/y4eepnj.png)\\n### Democratize Game Development\\nA platform that greatly simplifies game development, especially for people who have a passion for building games but lack programming or art skills.\\n[Join Us](https://www.dreamcraft.com/</careers>)\\n# DreamCraft Closes $10 Million Series A Funding Led by March Gaming\\nNovember 17, 2021\\nDreamCraft is excited to announce that we have raised $10 million in Series A funding led by March Gaming (Gregory Milken and Louis Gresham) to accelerate our growth as we enable anyone to create, publish and monetize video games. The new funding brings our total money raised to over $15 million and will allow us to bring the game development opportunity to a broader base of creative individuals, build new IP with talented artists, and scale a top-notch engineering, art, and game design team.\\nInvestors in the round also include Makers Fund (Jay Chi and Ryann Lai), Dune Ventures (David Brillembourg Jr.) and Hiro Capital (Luke Alvarez and Cherry Freeman), and of course we wouldn’t have made it this far without our incredible seed investors, including Tencent, Y Combinator, Makers Fund, Ludlow Ventures, Kevin Lin (Co-Founder of Twitch) and Hubert Thieblot (previously of Curse and Twitch). We’re grateful to have such great friends support us on our journey to disrupt game-making technology.\\n#### What Is DreamCraft\\nDreamCraft, founded in 2018, is building a platform bundled with a game editor to make the game development process significantly easier for any platform, especially for people who have a passion for building games but lack programming or art skills.\\nFounded by a team of passionate gamers and modders, we wanted to find a solution for individual developers with no professional game development or programming experience to be able to create a game in just a few months and potentially generate millions of organic downloads and millions of dollars in revenue. To say this is a disruptive proposition in the gaming industry is an understatement, as commercially successful games typically take a team of professional developers years to build.\\n#### How DreamCraft Works\\nDreamCraft’s game editor offers a high-level, event-driven framework that includes features such as multiplayer, cross-platform, performance, memory-usage, and publishing that anyone can build games on top of. In other words, creators can focus solely on building unique gameplay mechanics for any genre and let DreamCraft do all the other heavy lifting. We believe this is the key to enable success for individual game creators.\\nDreamCraft also offers a wide range of art assets with a vision to build a cohesive world and IP, including casual and cartoon-like art styles that appeal to a broad base of young audiences. In addition, our technology empowers both 3D and 2D pre-rendered visuals, so creators have great design freedom for different genres of games.\\n![© DreamCraft Entertainment](https://i.imgur.com/bb2nnCk.png)\\nTo date, we’ve seen games that were created by a solo developer and powered by the DreamCraft game editor generate millions of organic downloads and millions of dollars in revenue. Other games are in various stages, from development through initial testing, soft launching and early monetization testing. These games are all created by one-man shops.\\n#### Our Diverse Team\\nWe are lifelong, passionate gamers who founded DreamCraft in 2018 with a vision to serve those who want to create video games as a life-long career. Since then, we have grown into a global team of 20+ people, who are deeply rooted in various modding communities and have worked at companies like Google, Blizzard, Microsoft and EA.\\nOur diverse team spans North America, South America, Asia and Europe, and we are always searching for talented people to join DreamCraft on our exciting journey. If you’re interested, check out our [career page](https://www.dreamcraft.com/</careers>) for more details.\\n#### Investor Quotes\\n> DreamCraft is exactly what it sounds like: empowering bright creators to realize their game making visions and providing an easy way for them to build and publish their games and make money. We’ve seen firsthand the magic that happens when hobbyists get their hands on what the DreamCraft team has built and realize they can fully develop and monetize a dynamic, high-quality game in mere months with exponentially less friction than any UGC platform or engine out there. We are thrilled to support Tianyin, Veronica and the DreamCraft team with their mission to help every modder and map editor out there dream even bigger.\\nLouis Gresham, March Gaming\\n> DreamCraft’s founders bring the passion and mindset of modders to a powerful platform that does all the heavy lifting so design and creativity can be free of complex tools and giant development teams. We are excited to support DreamCraft in enabling dreamers to become game makers, and to help open the doors to a creator-led game economy.\\nRyann Lai, Makers Fund\\n> We are ecstatic to be backing Tianyin and Veronica – they have relentlessly worked to get DreamCraft in the hands of creators and we’re already seeing some amazing games come to life. Few teams and platforms in UGC have had this much impact this early on, partly due to the fact that the team is composed of passionate gamers and modders, so we’re looking forward to seeing this team and platform scale.\\nDavid Brillembourg Jr., Dune Ventures\\n#### Contacts\\nTianyin Zhang Veronica Yao founders@dreamcraft.com\\n© 2021 by DreamCraft\\n' markdown_with_citations='☰\\n![© DreamCraft Entertainment⟨1⟩](https://www.dreamcraft.com/</>)\\nHome⟨2⟩Careers⟨3⟩\\n![© DreamCraft Entertainment⟨4⟩]\\n### Democratize Game Development\\nA platform that greatly simplifies game development, especially for people who have a passion for building games but lack programming or art skills.\\nJoin Us⟨5⟩\\n# DreamCraft Closes $10 Million Series A Funding Led by March Gaming\\nNovember 17, 2021\\nDreamCraft is excited to announce that we have raised $10 million in Series A funding led by March Gaming (Gregory Milken and Louis Gresham) to accelerate our growth as we enable anyone to create, publish and monetize video games. The new funding brings our total money raised to over $15 million and will allow us to bring the game development opportunity to a broader base of creative individuals, build new IP with talented artists, and scale a top-notch engineering, art, and game design team.\\nInvestors in the round also include Makers Fund (Jay Chi and Ryann Lai), Dune Ventures (David Brillembourg Jr.) and Hiro Capital (Luke Alvarez and Cherry Freeman), and of course we wouldn’t have made it this far without our incredible seed investors, including Tencent, Y Combinator, Makers Fund, Ludlow Ventures, Kevin Lin (Co-Founder of Twitch) and Hubert Thieblot (previously of Curse and Twitch). We’re grateful to have such great friends support us on our journey to disrupt game-making technology.\\n#### What Is DreamCraft\\nDreamCraft, founded in 2018, is building a platform bundled with a game editor to make the game development process significantly easier for any platform, especially for people who have a passion for building games but lack programming or art skills.\\nFounded by a team of passionate gamers and modders, we wanted to find a solution for individual developers with no professional game development or programming experience to be able to create a game in just a few months and potentially generate millions of organic downloads and millions of dollars in revenue. To say this is a disruptive proposition in the gaming industry is an understatement, as commercially successful games typically take a team of professional developers years to build.\\n#### How DreamCraft Works\\nDreamCraft’s game editor offers a high-level, event-driven framework that includes features such as multiplayer, cross-platform, performance, memory-usage, and publishing that anyone can build games on top of. In other words, creators can focus solely on building unique gameplay mechanics for any genre and let DreamCraft do all the other heavy lifting. We believe this is the key to enable success for individual game creators.\\nDreamCraft also offers a wide range of art assets with a vision to build a cohesive world and IP, including casual and cartoon-like art styles that appeal to a broad base of young audiences. In addition, our technology empowers both 3D and 2D pre-rendered visuals, so creators have great design freedom for different genres of games.\\n![© DreamCraft Entertainment⟨6⟩]\\nTo date, we’ve seen games that were created by a solo developer and powered by the DreamCraft game editor generate millions of organic downloads and millions of dollars in revenue. Other games are in various stages, from development through initial testing, soft launching and early monetization testing. These games are all created by one-man shops.\\n#### Our Diverse Team\\nWe are lifelong, passionate gamers who founded DreamCraft in 2018 with a vision to serve those who want to create video games as a life-long career. Since then, we have grown into a global team of 20+ people, who are deeply rooted in various modding communities and have worked at companies like Google, Blizzard, Microsoft and EA.\\nOur diverse team spans North America, South America, Asia and Europe, and we are always searching for talented people to join DreamCraft on our exciting journey. If you’re interested, check out our career page⟨5⟩ for more details.\\n#### Investor Quotes\\n> DreamCraft is exactly what it sounds like: empowering bright creators to realize their game making visions and providing an easy way for them to build and publish their games and make money. We’ve seen firsthand the magic that happens when hobbyists get their hands on what the DreamCraft team has built and realize they can fully develop and monetize a dynamic, high-quality game in mere months with exponentially less friction than any UGC platform or engine out there. We are thrilled to support Tianyin, Veronica and the DreamCraft team with their mission to help every modder and map editor out there dream even bigger.\\nLouis Gresham, March Gaming\\n> DreamCraft’s founders bring the passion and mindset of modders to a powerful platform that does all the heavy lifting so design and creativity can be free of complex tools and giant development teams. We are excited to support DreamCraft in enabling dreamers to become game makers, and to help open the doors to a creator-led game economy.\\nRyann Lai, Makers Fund\\n> We are ecstatic to be backing Tianyin and Veronica – they have relentlessly worked to get DreamCraft in the hands of creators and we’re already seeing some amazing games come to life. Few teams and platforms in UGC have had this much impact this early on, partly due to the fact that the team is composed of passionate gamers and modders, so we’re looking forward to seeing this team and platform scale.\\nDavid Brillembourg Jr., Dune Ventures\\n#### Contacts\\nTianyin Zhang Veronica Yao founders@dreamcraft.com\\n© 2021 by DreamCraft\\n' references_markdown='\\n\\n## References\\n\\n⟨1⟩ https://i.imgur.com/1x1mvGB.png: ![© DreamCraft Entertainment\\n⟨2⟩ https://www.dreamcraft.com/</>: Home\\n⟨3⟩ https://www.dreamcraft.com/</careers/>: Careers\\n⟨4⟩ https://i.imgur.com/y4eepnj.png: © DreamCraft Entertainment\\n⟨5⟩ https://www.dreamcraft.com/</careers>: Join Us\\n⟨6⟩ https://i.imgur.com/bb2nnCk.png: © DreamCraft Entertainment\\n' fit_markdown='' fit_html=''",
  "generated_description": "DreamCraft Entertainment, Inc. is shaking up the gaming industry with its innovative platform designed for aspiring game creators. Founded in 2018 and located in Redwood City, CA, DreamCraft is on a mission to democratize game development. The company's core offering is a code-free game creation platform that empowers anyone—regardless of their programming or artistic skills—to create, publish, and monetize video games easily.\n\nBacked by notable investors like March Capital, Tencent, Y Combinator, and others, DreamCraft successfully raised $10 million in a Series A funding round in 2021, bringing its total funds raised to over $15 million. This capital allows DreamCraft to expand its technology and support a growing community of creators looking to bring their gaming ideas to life.\n\nWhat makes DreamCraft particularly interesting is its user-focused approach. The platform comes equipped with an intuitive game editor and a library of high-quality art assets, making game development accessible. This significantly reduces the time and complexity typically involved in the game creation process, which can take professional teams years. With DreamCraft, even solo developers can create commercially successful games in a matter of months, achieving millions of downloads and revenues.\n\nThe team consists of around 20 passionate gamers and modders from diverse backgrounds, some with prior experience at tech giants like Google and Microsoft. This blend of gaming expertise and a shared vision for empowering individual creators gives DreamCraft its unique edge.\n\nAs DreamCraft continues to grow, it aims to foster a creator-led game economy where innovation and creativity can flourish in an environment previously dominated by professional developers and large studios. For more information, you can visit their website at [dreamcraft.com](https://www.dreamcraft.com/). If you have a dream to create games, DreamCraft might just be the platform you need to turn that dream into reality."
}