{
  "links": "https://www.ycombinator.com/companies/dreamrp",
  "name": "DreamRP",
  "headline": "Bring your characters to life",
  "batch": "S24",
  "description": "DreamRP lets users chat with character chatbots made by the content owners themselves. For example, users could chat with Jon Snow bot made by George R. R. Martin. \r\n\nCharacter chat is the most engaging social category ever - more than YouTube, Instagram, or TikTok. But all the current chatbots are fan-made knock-offs and do not have deals with the actual content owners, whose IP they are stealing.  We’re building the first fully legal character chat platform that shares revenue with the content owners.",
  "activity_status": "Active",
  "website": "https://www.dreamrp.com/",
  "founded_date": 2024.0,
  "team_size": 2.0,
  "location": "San Francisco",
  "group_partner": "Jared Friedman",
  "group_partner_yc": "https://www.ycombinator.com/people/jared-friedman",
  "company_linkedin": null,
  "company_twitter": null,
  "tags": "industry:artificial-intelligence; industry:generative-ai; industry:consumer; industry:entertainment; industry:ai; location:san-francisco-bay-area",
  "founders": [
    {
      "name": "Phillip Huang, Founder",
      "description": "Phillip is the co-founder and CEO of DreamRP.\n\nHe studied Computer Science at Harvard and worked as a Software Engineer and Data Scientist at Meta, where he increased revenue by 6% (~$1B per annum) with US Patent #10,713,094.\n\nPhillip built video games with 3k+ reviews and fan community forums when he worked for What Pumpkin, the company behind Homestuck, a widely popular webcomic with over 1 million unique daily readers.",
      "linkedin": "https://linkedin.com/in/philliphuang"
    },
    {
      "name": "Nina Hu, Founder",
      "description": "Nina is the co-founder and CTO of DreamRP. \n\nPreviously, Nina spent 5 years building AI systems at Databricks and Lyft. In addition to her technical expertise, she is active in the creative community and runs an online art business. Nina holds degrees in Computer Science and Economics from UC Berkeley.",
      "linkedin": "https://www.linkedin.com/in/nina-hu-91a53577/"
    }
  ],
  "status": true,
  "markdown": "raw_markdown='\\n' markdown_with_citations='\\n' references_markdown='\\n\\n## References\\n\\n' fit_markdown='' fit_html=''",
  "generated_description": "**DreamRP: Bringing Characters to Life**\n\nFounded in 2024 and part of Y Combinator's Batch S24, DreamRP is on a mission to “Bring your characters to life.” Located in San Francisco, this startup aims to revolutionize how fans interact with their favorite fictional characters through chatbots. \n\nInitially, DreamRP allowed users to engage with character chatbots created by the content owners, meaning fans could chat with a Jon Snow bot designed by George R. R. Martin himself. This model taps into a significant trend: character chat is rapidly becoming one of the most engaging social experiences available—surpassing platforms like YouTube, Instagram, and TikTok.\n\nHowever, the market is currently flooded with fan-made knock-offs that operate without deals from the original content owners. That’s where DreamRP steps in, crafting a fully legal character chat platform that not only respects intellectual property but also shares revenue with the content owners. This unique approach is likely to attract both creators and fans alike, offering a win-win situation.\n\nDreamRP is currently a lean operation with just two employees, and they are nurtured by Jared Friedman as their Group Partner. The company's focus on artificial intelligence, generative AI, and entertainment aligns tightly with emerging trends in the consumer space, setting the stage for potential growth and innovation.\n\nAs DreamRP continues to develop its platform, it bridges the gap between character-driven storytelling and interactive technology, heralding a new era for fans and creators. If you want to check it out, head over to [dreamrp.com](https://www.dreamrp.com/)."
}