{
  "links": "https://www.ycombinator.com/companies/educents",
  "name": "Educents",
  "headline": null,
  "batch": "IK12",
  "description": "Educents is the trusted resource for every child’s education. It is the best place to discover new ways to make learning fun. Find innovative products and ideas created by a community of experts in education. Educents makes it easy to browse, shop, and discover innovative products that get their kids excited about learning. We also provide an incredibly tailored experience for sellers on our platform - helping small businesses gain exposure to new customers & markets, and big businesses scale their distribution even further. At the end of the day, our goal is to make education as affordable and accessible as possible.\n\nSince the launch of Educents in April, 2013, Educents has saved educators over $20 million dollars and has helped more than 500,000 teachers, homeschoolers and parents gain access to educational materials all in one place.",
  "activity_status": "Active",
  "website": "https://www.educents.com/",
  "founded_date": null,
  "team_size": 11.0,
  "location": "San Francisco",
  "group_partner": null,
  "group_partner_yc": null,
  "company_linkedin": null,
  "company_twitter": null,
  "tags": "location:san-francisco-bay-area",
  "founders": [],
  "status": true,
  "markdown": "raw_markdown='[Skip to content](https://www.educents.com/<#wp--skip-link--target>)\\n[Educents](https://www.educents.com/<https:/educents.com>)\\n  * [Blog](https://www.educents.com/<#>)\\n  * [About](https://www.educents.com/<https:/educents.com/about/>)\\n  * [FAQs](https://www.educents.com/<#>)\\n  * [Authors](https://www.educents.com/<#>)\\n\\n\\n# EDUCENTS\\n# I publish here my free guitar courses in Educents. Video and text that you can follow along.\\n## [Educents](https://www.educents.com/<https:/educents.com>)\\n  * [Blog](https://www.educents.com/<#>)\\n  * [About](https://www.educents.com/<https:/educents.com/about/>)\\n  * [FAQs](https://www.educents.com/<#>)\\n  * [Authors](https://www.educents.com/<#>)\\n\\n\\n  * [Events](https://www.educents.com/<#>)\\n  * [Shop](https://www.educents.com/<#>)\\n  * [Patterns](https://www.educents.com/<#>)\\n  * [Themes](https://www.educents.com/<#>)\\n\\n\\nTwenty Twenty-Five\\nDesigned with [WordPress](https://www.educents.com/<https:/wordpress.org>)\\n' markdown_with_citations='Skip to content⟨1⟩\\nEducents⟨2⟩\\n  * Blog⟨3⟩\\n  * About⟨4⟩\\n  * FAQs⟨3⟩\\n  * Authors⟨3⟩\\n\\n\\n# EDUCENTS\\n# I publish here my free guitar courses in Educents. Video and text that you can follow along.\\n## Educents⟨2⟩\\n  * Blog⟨3⟩\\n  * About⟨4⟩\\n  * FAQs⟨3⟩\\n  * Authors⟨3⟩\\n\\n\\n  * Events⟨3⟩\\n  * Shop⟨3⟩\\n  * Patterns⟨3⟩\\n  * Themes⟨3⟩\\n\\n\\nTwenty Twenty-Five\\nDesigned with WordPress⟨5⟩\\n' references_markdown='\\n\\n## References\\n\\n⟨1⟩ https://www.educents.com/<#wp--skip-link--target>: Skip to content\\n⟨2⟩ https://www.educents.com/<https:/educents.com>: Educents\\n⟨3⟩ https://www.educents.com/<#>: Blog\\n⟨4⟩ https://www.educents.com/<https:/educents.com/about/>: About\\n⟨5⟩ https://www.educents.com/<https:/wordpress.org>: WordPress\\n' fit_markdown='' fit_html=''",
  "generated_description": "**Educents: Making Learning Accessible and Fun**\n\nFounded in April 2013, Educents is a dynamic company based in San Francisco, offering a marketplace that transforms educational resources into exciting, affordable options for children. The mission—and indeed the passion—of Educents is to ensure that every child has access to quality educational materials that stimulate their learning.\n\nImagine a platform where educators, parents, and homeschooling families can explore innovative products created by a vibrant community of education experts. That’s what Educents strives to provide. They’ve saved the educational community over $20 million and reached more than 500,000 individuals in a relatively short span. It’s not just about selling products; it’s about creating opportunities—helping small businesses connect with new customers while enabling larger companies to extend their reach even further.\n\nWith a team of 11, Educents is part of the prestigious Y Combinator Batch IK12, which speaks volumes about their potential and ambition. The platform is robust, featuring easy navigation not just for shoppers, but also for sellers who seek a tailored experience for promoting their educational tools.\n\nIn the fast-evolving landscape of education, where accessibility remains a core challenge, Educents is attempting to bridge gaps and enhance learning experiences. Whether you’re looking for unique products or community-driven insights, Educents is committed to ensuring that learning doesn’t have to be a burden financially or creatively.\n\nFor more insights or to explore their offerings, visit their website at [Educents](https://www.educents.com/)."
}