{
  "links": "https://www.ycombinator.com/companies/equator-therapeutics",
  "name": "Equator Therapeutics",
  "headline": "We are developing a drug to burn calories and increase metabolismâ¦",
  "batch": "W20",
  "description": "We are developing a drug to increase metabolism and burn calories without exercise.\r\n\nObesity and type 2 diabetes have reached epidemic proportions. There are 2.2B overweight people and 500M people with type 2 diabetes worldwide, and these numbers increase drastically every year. Existing drugs are not effective enough to reverse the trend. Our drug can solve this problem, because it addresses the root cause of metabolic disorders â the imbalance between caloric intake and expenditure.\r\n\nOur drug will target mitochondria â the powerhouse of the cell â to generate heat. This approach has been proven to fully reverse obesity and type 2 diabetes in animals. However, therapeutic application for humans was impossible, because mitochondrial heat production could only be induced by highly artificial methods with side effects. This changed after our recent breakthrough discovery of the protein that mitochondria naturally use to generate heat. We have developed a unique high-throughput drug discovery platform to identify compounds that selectively activate this target protein, without side effects.\r\n\nFor decades people have wanted a drug that burns calories like exercise does. We are realizing this dream at Equator Therapeutics.",
  "activity_status": "Active",
  "website": "https://equatortherapeutics.com/",
  "founded_date": null,
  "team_size": 2.0,
  "location": "San Francisco",
  "group_partner": null,
  "group_partner_yc": null,
  "company_linkedin": null,
  "company_twitter": null,
  "tags": "industry:biotech; industry:therapeutics; location:san-francisco-bay-area",
  "founders": [],
  "status": true,
  "markdown": "raw_markdown='I agree\\n[ ](https://equatortherapeutics.com/<https:/equatortherapeutics.com/> \"Equator Therapeutics\") Menu\\n  * [Why](https://equatortherapeutics.com/<#why>)\\n  * [How](https://equatortherapeutics.com/<#how>)\\n  * [Who](https://equatortherapeutics.com/<#who>)\\n  * [Contact](https://equatortherapeutics.com/<#contact>)\\n\\n\\nClose\\n# Restoring natural heat production to treat metabolic disorders\\n![](https://equatortherapeutics.com/app/uploads/2021/08/video-stillframe.png) Watch Video\\nMitochondrial heat production for weight loss\\nScroll\\n## Nearly 50% of Americans live with obesity, and the numbers keep rising\\nTo date, treatment of obesity and metabolic disorders has focused on dieting and exercise. Yet most people who diet and exercise do not achieve sustained weight loss.\\nThere is a third major mechanism essential for weight regulation: natural heat production, or “thermogenesis.” Thermogenesis burns calories as effectively as exercise does as we go about our usual routines. Our ancestors used thermogenesis to keep warm. But today, thermogenesis is inhibited by comfortable living temperatures.\\nRecent scientific breakthroughs at Equator Therapeutics have enabled pharmacological stimulation of thermogenesis to achieve sustained weight loss. We are now developing a first-in-class drug to reverse metabolic disorders.\\n## We are targeting mitochondria – the powerhouse of the cell\\nMitochondria are the organelles in our cells that burn calories to power our bodies and keep us warm. In an experimental _tour de force_ , we measured the tiny electrical currents that mitochondria use to generate heat. This allowed us to identify and characterize the proteins responsible for these currents.\\nOur unique high throughput assays have allowed us to identify an unprecedented number of thermogenic compounds. We are now utilizing our singular capacity to directly record the electrical currents that these compounds induce in mitochondria to identify the most selective and safe activators of thermogenesis.\\nOur methods & expertise also uniquely position us to modulate mitochondrial energy production more generally. Our long-term plans include programs to develop first-in-class drugs targeting several other important therapeutic mechanisms in mitochondria.\\nPublications\\n### The foundations of our work\\n[Mitochondrial uncouplers induce proton leak by activating AAC and UCP1 (_Nature_ , 2022)](https://equatortherapeutics.com/<https:/www.nature.com/articles/s41586-022-04747-5>).\\n[H+ Transport is an Integral Function of the Mitochondrial ADP/ATP Carrier (_Nature_ , 2019)](https://equatortherapeutics.com/<https:/www.nature.com/articles/s41586-019-1400-3>)\\n[Brown Fat Mechanism of Fatty-Acid-Dependent UCP1 Uncoupling in Brown Fat Mitochondria (_Cell_ , 2012)](https://equatortherapeutics.com/<https:/linkinghub.elsevier.com/retrieve/pii/S0092-8674\\\\(12\\\\)01113-0>)\\nWho we are\\n### Meet our team\\nThe team at Equator leverages our singular expertise in bioelectricity, computational chemistry, and high-throughput interrogation of mitochondrial physiology to develop a drug that activates our targets. \\n#### [Jonah Sinick, Ph.D.  Co-Founder, CEO More ](https://equatortherapeutics.com/<https:/equatortherapeutics.com/team/jonah-sinick-ph-d/>)\\n#### [Yuriy Kirichok, Ph.D. Co-founder, Chief Scientific Officer More ](https://equatortherapeutics.com/<https:/equatortherapeutics.com/team/yuriy-kirichok-ph-d/>)\\n#### [Katherine Widdowson, Ph.D.  Head of Medicinal Chemistry More ](https://equatortherapeutics.com/<https:/equatortherapeutics.com/team/katherine-widdowson-ph-d/>)\\n#### [Junji Suzuki, Ph.D. Director More ](https://equatortherapeutics.com/<https:/equatortherapeutics.com/team/junji-suzuki-ph-d/>)\\n#### [Simon Vu, Ph.D. Principal Scientist More ](https://equatortherapeutics.com/<https:/equatortherapeutics.com/team/simon-vu-ph-d/>)\\nScientific Advisory Board\\n### Our advisors are world leading experts in thermophysiology, metabolic disorders, and computational chemistry.\\nMore\\n#### Gerald Shulman, M.D., Ph.D.\\nCo-Director, Yale Diabetes Research Center\\nDr. Shulman is the George R. Cowgill Professor of Medicine and Cellular & Molecular Physiology at Yale. He is also Co-Director of the Yale Diabetes Research Center. Dr. Shulman has pioneered the use of magnetic resonance spectroscopy combined with mass spectrometry to non-invasively examine intracellular glucose and fat metabolism in humans and transgenic rodent models that have led to several paradigm shifts in our understanding of type 2 diabetes (T2D), including the molecular mechanisms by which ectopic lipid promotes liver and muscle insulin resistance, as well as developing new drugs for the treatment of T2D, nonalcoholic fatty liver disease (NAFLD) and nonalcoholic steatohepatitis (NASH). Dr. Shulman is the recipient of the Stanley J. Korsymeyer Award from the American Society for Clinical Investigation, the Outstanding Clinical Investigator Award from the Endocrine Society, the Solomon Berson Award from the American Physiological Society and the Banting Medal for Lifetime Scientific Achievement from the American Diabetes Association. Dr. Shulman is a Fellow of the American Association for the Advancement of Science, Inaugural Fellow of the American Physiological Society and he has been elected to the American Society for Clinical Investigation, the Association of American Physicians, the National Academy of Medicine, the American Academy of Arts and Sciences and the National Academy of Sciences \\nMore\\n#### Michael Grabe, Ph.D.\\nProfessor, Cardiovascular Research Institute, UCSF\\nMichael has spent over 20 years using computational methods to study the structure, function, and dynamics of membrane proteins with a recent emphasis on mitochondrial transport proteins. He is a Professor in the Department of Pharmaceutical Chemistry at UCSF and an Investigator in the Cardiovascular Research Institute. \\nMore\\n#### Andrea Dunaif, Ph.D. \\nChief of the Division of Endocrinology, Mount Sinai Hospital\\nAndrea Dunaif, M.D., is Chief of the Division of Endocrinology, Diabetes and Bone Disease for the Mount Sinai Health System and the Lillian and Henry M. Stratton Professor of Molecular Medicine at the Icahn School of Medicine at Mount Sinai, New York, NY. She is an internationally recognized expert in endocrinology and women’s health. Her research on polycystic ovary syndrome (PCOS), the most common hormonal disorder of reproductive-age women, has shown that it is a major metabolic disorder and a leading risk factor for type 2 diabetes mellitus. \\nMore\\n#### John Amatruda, M.D.\\nFormer Senior Vice President and Franchise Head for Diabetes and Obesity at Merck Research Laboratories\\nDr. Amatruda has over 25 years of experience as a senior pharmaceutical research executive and scientific consultant, together with over 40 years of experience in basic and clinical research and the practice and teaching of medicine. He has been on the board of directors and scientific advisory boards of several biotechnology companies. He has also been a consultant and scientific advisor to more than 20 additional biotechnology and leading pharmaceutical companies since 2009. As Senior Vice President and Franchise Head for Diabetes and Obesity at Merck Research Laboratories, Dr. Amatruda had end-to-end responsibility for drug compounds from target discovery to patent expiration, including basic research, experimental medicine, clinical development, external alliances and licensing. Prior to being named Franchise Head, Dr. Amatruda led the drug development groups at Merck for diabetes, obesity, atherosclerosis, and cardiovascular disease. Under his leadership, the development program and regulatory approvals of Januvia™ and Janumet™ - the first compounds in the important class of DPP-IV inhibitors for Type 2 diabetes, and two of Merck\\'s leading revenue-generating drugs - were successfully initiated and completed, and worldwide submissions for Vytorin™, Januvia™ and Janumet™ were filed. Prior to joining Merck, Dr. Amatruda was Vice President and Therapeutic Area Head for Metabolic Disorders Research at Bayer Corporation for ten years, where he assisted in the approval of Acarbose and Miglitol and led the discovery and advancement of several compounds into clinical development. Dr. Amatruda has also had a successful career in academic medicine, formerly as a Professor of Medicine at the University of Rochester School of Medicine, where he was head of the Clinical Research Center and a Principal Investigator on several NIH funded research projects; and currently as an Adjunct Professor of Medicine at Yale University School of Medicine. In addition, Dr. Amatruda has co-authored over 160 publications in the areas of both clinical and basic research, many of which have been published in leading peer-reviewed journals, and the majority of which are in the areas of diabetes, obesity, and lipids. Dr. Amatruda’s clinical practice at the University of Rochester and at Yale was in general endocrinology but with an emphasis on Diabetes and obesity. Dr. Amatruda was educated at Yale University and The Medical College of Wisconsin and completed his internship and residency in internal medicine and fellowship in endocrinology and metabolism at The Johns Hopkins Hospital. \\nOur Extended Team\\nMore\\n#### Sebastian Aguiar Brunemeier, M.Sc.\\nCEO, ImmuneAge\\nSebastian A. Brunemeier is a biotech founder and VC investor focused on the biology of aging. He is CEO of ImmuneAGE Pharma, focused on immune system rejuvenation. Sebastian was Principal at Apollo Health Ventures, the first and largest aging-focused venture capital fund in the world with $150M AUM, as well as Co-Founder and Chief Investment Officer at Cambrian Biopharma, a biotech venture holding company focused on the biology of aging. Sebastian was CEO of Cyclone Therapeutics, a Scripps Research Institute spinout focused on proteostasis, and the founding EIR and COO of Samsara Therapeutics, focused on autophagy-enhancing small molecule drug discovery in Oxford, UK, which was recognized as ‘best startup’ at the Financial Times Pharma Conference. Prior to Apollo, he was a Fulbright Fellow in the biology of aging at the Gulbenkian Institute, awarded the Skaggs-Oxford fellowship at the Scripps Research Institute, and a SENS Foundation Scholar at the Buck Institute for Research on Aging. His education includes partial DPhil (PhD) training on the biochemistry of aging at the University of Oxford as a Clarendon Scholar, an MSc in Life Science Business Management and an MSc in Molecular Neuroscience from the University of Amsterdam as an Amsterdam Excellence Scholar. He serves on the board of the clinical stage CNS pharmaceutical company Revivo Therapeutics, served as a trustee of the British Society for Research on Aging, a mentor at the New York Academy of Sciences, and as an advisor to Healthspan Capital, Molecule GmbH/VitaDAO, and McKinsey & Company. \\nGet in touch\\n### Want to learn more, collaborate with us, or join our team?\\nName This field can’t be empty\\nE-mail This field can’t be empty\\nMessage This field can’t be empty\\nThe email has been sent successfully.\\nSend\\nRestoring thermogenesis to prehistoric levels™\\n[4340 Duncan Ave, Suite 201 St. Louis, MO 63110](https://equatortherapeutics.com/<https:/www.google.com/maps/place/BioSTL/@38.6355292,-90.2539968,15z/data=!4m2!3m1!1s0x0:0xceadb3edcd4d6e96?sa=X&ved=1t:2428&ictx=111>) [LinkedIn](https://equatortherapeutics.com/<https:/www.linkedin.com/company/equator-therapeutics/>) [Financial Conflict Of Interest Policy](https://equatortherapeutics.com/<https:/equatortherapeutics.com/app/uploads/2024/07/equator-therapeutics-fcoi-policy-1.pdf>)\\n[Privacy Policy](https://equatortherapeutics.com/<https:/equatortherapeutics.com/privacy-policy/>) © Copyright 2025 Equator\\n' markdown_with_citations=\"I agree\\n ⟨1⟩ Menu\\n  * Why⟨2⟩\\n  * How⟨3⟩\\n  * Who⟨4⟩\\n  * Contact⟨5⟩\\n\\n\\nClose\\n# Restoring natural heat production to treat metabolic disorders\\n![](https://equatortherapeutics.com/app/uploads/2021/08/video-stillframe.png) Watch Video\\nMitochondrial heat production for weight loss\\nScroll\\n## Nearly 50% of Americans live with obesity, and the numbers keep rising\\nTo date, treatment of obesity and metabolic disorders has focused on dieting and exercise. Yet most people who diet and exercise do not achieve sustained weight loss.\\nThere is a third major mechanism essential for weight regulation: natural heat production, or “thermogenesis.” Thermogenesis burns calories as effectively as exercise does as we go about our usual routines. Our ancestors used thermogenesis to keep warm. But today, thermogenesis is inhibited by comfortable living temperatures.\\nRecent scientific breakthroughs at Equator Therapeutics have enabled pharmacological stimulation of thermogenesis to achieve sustained weight loss. We are now developing a first-in-class drug to reverse metabolic disorders.\\n## We are targeting mitochondria – the powerhouse of the cell\\nMitochondria are the organelles in our cells that burn calories to power our bodies and keep us warm. In an experimental _tour de force_ , we measured the tiny electrical currents that mitochondria use to generate heat. This allowed us to identify and characterize the proteins responsible for these currents.\\nOur unique high throughput assays have allowed us to identify an unprecedented number of thermogenic compounds. We are now utilizing our singular capacity to directly record the electrical currents that these compounds induce in mitochondria to identify the most selective and safe activators of thermogenesis.\\nOur methods & expertise also uniquely position us to modulate mitochondrial energy production more generally. Our long-term plans include programs to develop first-in-class drugs targeting several other important therapeutic mechanisms in mitochondria.\\nPublications\\n### The foundations of our work\\nMitochondrial uncouplers induce proton leak by activating AAC and UCP1 (_Nature_ , 2022)⟨6⟩.\\nH+ Transport is an Integral Function of the Mitochondrial ADP/ATP Carrier (_Nature_ , 2019)⟨7⟩\\nBrown Fat Mechanism of Fatty-Acid-Dependent UCP1 Uncoupling in Brown Fat Mitochondria (_Cell_ , 2012)⟨8⟩01113-0>)\\nWho we are\\n### Meet our team\\nThe team at Equator leverages our singular expertise in bioelectricity, computational chemistry, and high-throughput interrogation of mitochondrial physiology to develop a drug that activates our targets. \\n#### Jonah Sinick, Ph.D.  Co-Founder, CEO More ⟨9⟩\\n#### Yuriy Kirichok, Ph.D. Co-founder, Chief Scientific Officer More ⟨10⟩\\n#### Katherine Widdowson, Ph.D.  Head of Medicinal Chemistry More ⟨11⟩\\n#### Junji Suzuki, Ph.D. Director More ⟨12⟩\\n#### Simon Vu, Ph.D. Principal Scientist More ⟨13⟩\\nScientific Advisory Board\\n### Our advisors are world leading experts in thermophysiology, metabolic disorders, and computational chemistry.\\nMore\\n#### Gerald Shulman, M.D., Ph.D.\\nCo-Director, Yale Diabetes Research Center\\nDr. Shulman is the George R. Cowgill Professor of Medicine and Cellular & Molecular Physiology at Yale. He is also Co-Director of the Yale Diabetes Research Center. Dr. Shulman has pioneered the use of magnetic resonance spectroscopy combined with mass spectrometry to non-invasively examine intracellular glucose and fat metabolism in humans and transgenic rodent models that have led to several paradigm shifts in our understanding of type 2 diabetes (T2D), including the molecular mechanisms by which ectopic lipid promotes liver and muscle insulin resistance, as well as developing new drugs for the treatment of T2D, nonalcoholic fatty liver disease (NAFLD) and nonalcoholic steatohepatitis (NASH). Dr. Shulman is the recipient of the Stanley J. Korsymeyer Award from the American Society for Clinical Investigation, the Outstanding Clinical Investigator Award from the Endocrine Society, the Solomon Berson Award from the American Physiological Society and the Banting Medal for Lifetime Scientific Achievement from the American Diabetes Association. Dr. Shulman is a Fellow of the American Association for the Advancement of Science, Inaugural Fellow of the American Physiological Society and he has been elected to the American Society for Clinical Investigation, the Association of American Physicians, the National Academy of Medicine, the American Academy of Arts and Sciences and the National Academy of Sciences \\nMore\\n#### Michael Grabe, Ph.D.\\nProfessor, Cardiovascular Research Institute, UCSF\\nMichael has spent over 20 years using computational methods to study the structure, function, and dynamics of membrane proteins with a recent emphasis on mitochondrial transport proteins. He is a Professor in the Department of Pharmaceutical Chemistry at UCSF and an Investigator in the Cardiovascular Research Institute. \\nMore\\n#### Andrea Dunaif, Ph.D. \\nChief of the Division of Endocrinology, Mount Sinai Hospital\\nAndrea Dunaif, M.D., is Chief of the Division of Endocrinology, Diabetes and Bone Disease for the Mount Sinai Health System and the Lillian and Henry M. Stratton Professor of Molecular Medicine at the Icahn School of Medicine at Mount Sinai, New York, NY. She is an internationally recognized expert in endocrinology and women’s health. Her research on polycystic ovary syndrome (PCOS), the most common hormonal disorder of reproductive-age women, has shown that it is a major metabolic disorder and a leading risk factor for type 2 diabetes mellitus. \\nMore\\n#### John Amatruda, M.D.\\nFormer Senior Vice President and Franchise Head for Diabetes and Obesity at Merck Research Laboratories\\nDr. Amatruda has over 25 years of experience as a senior pharmaceutical research executive and scientific consultant, together with over 40 years of experience in basic and clinical research and the practice and teaching of medicine. He has been on the board of directors and scientific advisory boards of several biotechnology companies. He has also been a consultant and scientific advisor to more than 20 additional biotechnology and leading pharmaceutical companies since 2009. As Senior Vice President and Franchise Head for Diabetes and Obesity at Merck Research Laboratories, Dr. Amatruda had end-to-end responsibility for drug compounds from target discovery to patent expiration, including basic research, experimental medicine, clinical development, external alliances and licensing. Prior to being named Franchise Head, Dr. Amatruda led the drug development groups at Merck for diabetes, obesity, atherosclerosis, and cardiovascular disease. Under his leadership, the development program and regulatory approvals of Januvia™ and Janumet™ - the first compounds in the important class of DPP-IV inhibitors for Type 2 diabetes, and two of Merck's leading revenue-generating drugs - were successfully initiated and completed, and worldwide submissions for Vytorin™, Januvia™ and Janumet™ were filed. Prior to joining Merck, Dr. Amatruda was Vice President and Therapeutic Area Head for Metabolic Disorders Research at Bayer Corporation for ten years, where he assisted in the approval of Acarbose and Miglitol and led the discovery and advancement of several compounds into clinical development. Dr. Amatruda has also had a successful career in academic medicine, formerly as a Professor of Medicine at the University of Rochester School of Medicine, where he was head of the Clinical Research Center and a Principal Investigator on several NIH funded research projects; and currently as an Adjunct Professor of Medicine at Yale University School of Medicine. In addition, Dr. Amatruda has co-authored over 160 publications in the areas of both clinical and basic research, many of which have been published in leading peer-reviewed journals, and the majority of which are in the areas of diabetes, obesity, and lipids. Dr. Amatruda’s clinical practice at the University of Rochester and at Yale was in general endocrinology but with an emphasis on Diabetes and obesity. Dr. Amatruda was educated at Yale University and The Medical College of Wisconsin and completed his internship and residency in internal medicine and fellowship in endocrinology and metabolism at The Johns Hopkins Hospital. \\nOur Extended Team\\nMore\\n#### Sebastian Aguiar Brunemeier, M.Sc.\\nCEO, ImmuneAge\\nSebastian A. Brunemeier is a biotech founder and VC investor focused on the biology of aging. He is CEO of ImmuneAGE Pharma, focused on immune system rejuvenation. Sebastian was Principal at Apollo Health Ventures, the first and largest aging-focused venture capital fund in the world with $150M AUM, as well as Co-Founder and Chief Investment Officer at Cambrian Biopharma, a biotech venture holding company focused on the biology of aging. Sebastian was CEO of Cyclone Therapeutics, a Scripps Research Institute spinout focused on proteostasis, and the founding EIR and COO of Samsara Therapeutics, focused on autophagy-enhancing small molecule drug discovery in Oxford, UK, which was recognized as ‘best startup’ at the Financial Times Pharma Conference. Prior to Apollo, he was a Fulbright Fellow in the biology of aging at the Gulbenkian Institute, awarded the Skaggs-Oxford fellowship at the Scripps Research Institute, and a SENS Foundation Scholar at the Buck Institute for Research on Aging. His education includes partial DPhil (PhD) training on the biochemistry of aging at the University of Oxford as a Clarendon Scholar, an MSc in Life Science Business Management and an MSc in Molecular Neuroscience from the University of Amsterdam as an Amsterdam Excellence Scholar. He serves on the board of the clinical stage CNS pharmaceutical company Revivo Therapeutics, served as a trustee of the British Society for Research on Aging, a mentor at the New York Academy of Sciences, and as an advisor to Healthspan Capital, Molecule GmbH/VitaDAO, and McKinsey & Company. \\nGet in touch\\n### Want to learn more, collaborate with us, or join our team?\\nName This field can’t be empty\\nE-mail This field can’t be empty\\nMessage This field can’t be empty\\nThe email has been sent successfully.\\nSend\\nRestoring thermogenesis to prehistoric levels™\\n4340 Duncan Ave, Suite 201 St. Louis, MO 63110⟨14⟩ LinkedIn⟨15⟩ Financial Conflict Of Interest Policy⟨16⟩\\nPrivacy Policy⟨17⟩ © Copyright 2025 Equator\\n\" references_markdown='\\n\\n## References\\n\\n⟨1⟩ https://equatortherapeutics.com/<https:/equatortherapeutics.com/>: Equator Therapeutics -  \\n⟨2⟩ https://equatortherapeutics.com/<#why>: Why\\n⟨3⟩ https://equatortherapeutics.com/<#how>: How\\n⟨4⟩ https://equatortherapeutics.com/<#who>: Who\\n⟨5⟩ https://equatortherapeutics.com/<#contact>: Contact\\n⟨6⟩ https://equatortherapeutics.com/<https:/www.nature.com/articles/s41586-022-04747-5>: Mitochondrial uncouplers induce proton leak by activating AAC and UCP1 (_Nature_ , 2022)\\n⟨7⟩ https://equatortherapeutics.com/<https:/www.nature.com/articles/s41586-019-1400-3>: H+ Transport is an Integral Function of the Mitochondrial ADP/ATP Carrier (_Nature_ , 2019)\\n⟨8⟩ https://equatortherapeutics.com/<https:/linkinghub.elsevier.com/retrieve/pii/S0092-8674\\\\(12\\\\: Brown Fat Mechanism of Fatty-Acid-Dependent UCP1 Uncoupling in Brown Fat Mitochondria (_Cell_ , 2012)\\n⟨9⟩ https://equatortherapeutics.com/<https:/equatortherapeutics.com/team/jonah-sinick-ph-d/>: Jonah Sinick, Ph.D.  Co-Founder, CEO More \\n⟨10⟩ https://equatortherapeutics.com/<https:/equatortherapeutics.com/team/yuriy-kirichok-ph-d/>: Yuriy Kirichok, Ph.D. Co-founder, Chief Scientific Officer More \\n⟨11⟩ https://equatortherapeutics.com/<https:/equatortherapeutics.com/team/katherine-widdowson-ph-d/>: Katherine Widdowson, Ph.D.  Head of Medicinal Chemistry More \\n⟨12⟩ https://equatortherapeutics.com/<https:/equatortherapeutics.com/team/junji-suzuki-ph-d/>: Junji Suzuki, Ph.D. Director More \\n⟨13⟩ https://equatortherapeutics.com/<https:/equatortherapeutics.com/team/simon-vu-ph-d/>: Simon Vu, Ph.D. Principal Scientist More \\n⟨14⟩ https://equatortherapeutics.com/<https:/www.google.com/maps/place/BioSTL/@38.6355292,-90.2539968,15z/data=!4m2!3m1!1s0x0:0xceadb3edcd4d6e96?sa=X&ved=1t:2428&ictx=111>: 4340 Duncan Ave, Suite 201 St. Louis, MO 63110\\n⟨15⟩ https://equatortherapeutics.com/<https:/www.linkedin.com/company/equator-therapeutics/>: LinkedIn\\n⟨16⟩ https://equatortherapeutics.com/<https:/equatortherapeutics.com/app/uploads/2024/07/equator-therapeutics-fcoi-policy-1.pdf>: Financial Conflict Of Interest Policy\\n⟨17⟩ https://equatortherapeutics.com/<https:/equatortherapeutics.com/privacy-policy/>: Privacy Policy\\n' fit_markdown='' fit_html=''",
  "generated_description": "**Equator Therapeutics: A Revolutionary Approach to Metabolic Disorders**\n\nEquator Therapeutics is tackling one of the most pressing health issues of our time: obesity and type 2 diabetes, which now affect over 2.2 billion and 500 million people globally, respectively. Founded in San Francisco and part of Y Combinator's W20 batch, their mission is clear: to create a drug that increases metabolism and burns calories without the need for exercise. This is more than just lofty rhetoric; it’s a response to a growing epidemic, where traditional weight loss methods often fall short.\n\n### The Problem with Current Solutions\n\nMost existing treatments for obesity and metabolic disorders revolve around dieting and exercise. However, many people struggle to maintain weight loss through these methods alone. Equator Therapeutics recognizes that there's a third critical mechanism at play: thermogenesis, the process through which our bodies burn calories.\n\nHistorically, inducing thermogenesis in humans has been challenging. Previous methods required synthetic interventions that came with unpleasant side effects. But Equator has made a breakthrough by identifying the protein that natural mitochondria—a cell's powerhouse—use to generate heat. By harnessing this mechanism, Equator aims to help restore thermogenesis to levels found in our ancestors, enhancing calorie burning effortlessly throughout daily activities.\n\n### Innovative Drug Discovery Platform\n\nAt the heart of Equator's approach is a high-throughput drug discovery platform. This technology allows them to identify compounds that selectively activate mitochondrial proteins, promoting safe thermogenesis without negative side effects. Initial animal studies demonstrate full reversals of obesity and type 2 diabetes, raising hopes that these results can translate to human applications.\n\nWhat makes Equator particularly exciting is its commitment to exploring multiple avenues in mitochondrial medicine, expanding beyond thermogenesis into other therapeutic mechanisms.\n\n### A Team of Experts\n\nEquator Therapeutics is led by a passionate team of scientists and innovators:\n\n- **Jonah Sinick, Ph.D.** - Co-founder and CEO\n- **Yuriy Kirichok, Ph.D.** - Co-founder and Chief Scientific Officer\n- **Katherine Widdowson, Ph.D.** - Head of Medicinal Chemistry\n\nThe company's scientific advisory board includes notable figures from institutions like Yale and UCSF, further solidifying their credibility and expertise in the field.\n\n### Looking Forward\n\nWith a team of just two employees, Equator is leveraging cutting-edge scientific research to challenge the status quo in metabolic disorder treatment. The implications of their work could lead to a paradigm shift in how we address obesity and related diseases—treatments that could one day feel as natural as breathing, all while restoring our innate ability to burn calories.\n\nEquator Therapeutics is not just about creating a drug; they’re on a mission to change lives by making calorie burning as effortless as it should be. The promise of making thermogenesis pharmacological might be the step humanity has long awaited in the battle against obesity.\n\nTo find out more, visit their website at [Equator Therapeutics](https://equatortherapeutics.com/) and follow their journey as they strive to realize this ambitious goal."
}