{
  "links": "https://www.ycombinator.com/companies/eris-biotech",
  "name": "Eris Biotech",
  "headline": "Our drugs engage the immune system to fight tumors",
  "batch": "W24",
  "description": "We are developing cancer therapeutics using small molecules that inhibit immune suppression. Our drugs engage the immune system to aggressively fight tumors. Our therapeutic portfolio addresses a range of solid tumors, starting with mesothelioma.",
  "activity_status": "Active",
  "website": "http://www.erisbio.com",
  "founded_date": 2023.0,
  "team_size": 2.0,
  "location": "Lehi, UT",
  "group_partner": null,
  "group_partner_yc": null,
  "company_linkedin": null,
  "company_twitter": null,
  "tags": "industry:biotech; industry:therapeutics; industry:drug-discovery; industry:oncology",
  "founders": [
    {
      "name": "Rachel Garlick, Founder",
      "description": "I received a PhD in Immunology from Dartmouth College and have spent my career engineering cancer immunotherapies. At Eris Biotech, we're developing hypoxia-activated prodrugs that disrupt immune communication to reduce cancer growth.",
      "linkedin": "https://linkedin.com/in/rachel-brog-garlick"
    },
    {
      "name": "Evita Weagel, Founder",
      "description": "First-generation immigrant from Peru. Mom of two boys. PhD in microbiology and molecular biology with an emphasis in cancer immunology, working on hypoxia-activated prodrugs for the treatment of solid tumors.",
      "linkedin": "https://linkedin.com/in/evita-weagel"
    }
  ],
  "status": true,
  "markdown": "raw_markdown=\"[ Eris Biotech ![Eris Biotech](http://www.erisbio.com/img/eris-logo.png) ](http://www.erisbio.com/<#>)\\n#  Striking Cancer Where it Lives \\nAt Eris Biotech, we're pioneering a revolution in cancer care. Our innovative treatments specifically target the tumor microenvironment, ensuring maximum effectiveness with minimal side effects. We're not just developing medicine, we're crafting hope. Join us in shaping a healthier future. \\n[ ![Backed by Y Combinator](http://www.erisbio.com/img/yc.png) ](http://www.erisbio.com/<https:/www.ycombinator.com/companies/eris-biotech>) [ ![Follow us on LinkedIn](http://www.erisbio.com/img/linkedin.jpeg) ](http://www.erisbio.com/<https:/www.linkedin.com/company/eris-biotech/>)\\n\" markdown_with_citations=\" Eris Biotech ![Eris Biotech⟨1⟩ ](http://www.erisbio.com/<#>)\\n#  Striking Cancer Where it Lives \\nAt Eris Biotech, we're pioneering a revolution in cancer care. Our innovative treatments specifically target the tumor microenvironment, ensuring maximum effectiveness with minimal side effects. We're not just developing medicine, we're crafting hope. Join us in shaping a healthier future. \\n ![Backed by Y Combinator⟨2⟩ ](http://www.erisbio.com/<https:/www.ycombinator.com/companies/eris-biotech>)  ![Follow us on LinkedIn⟨3⟩ ](http://www.erisbio.com/<https:/www.linkedin.com/company/eris-biotech/>)\\n\" references_markdown='\\n\\n## References\\n\\n⟨1⟩ http://www.erisbio.com/img/eris-logo.png:  Eris Biotech ![Eris Biotech\\n⟨2⟩ http://www.erisbio.com/img/yc.png:  ![Backed by Y Combinator\\n⟨3⟩ http://www.erisbio.com/img/linkedin.jpeg:  ![Follow us on LinkedIn\\n' fit_markdown='' fit_html=''",
  "generated_description": "### Eris Biotech: Revolutionizing Cancer Care\n\n**Overview**  \nFounded in 2023 and part of Y Combinator's Batch W24, Eris Biotech is a fresh player in the biotech landscape, located in Lehi, UT. With a compact team of just two employees, they're making bold strides in the world of cancer therapeutics.\n\n**Mission**  \nEris Biotech's mission is clear: to engage the immune system to effectively battle tumors. Their approach centers on developing treatments that inhibit immune suppression, enabling the body to aggressively fight back against cancer. They’re not merely creating drugs; they’re crafting hope for patients—especially those dealing with solid tumors like mesothelioma.\n\n**Innovative Approach**  \nWhat sets Eris Biotech apart is their focus on the tumor microenvironment. They aim for maximum effectiveness of their treatments while keeping side effects to a minimum. This targeted strategy signals a thoughtful shift in how we approach cancer therapy, focusing on both efficacy and patient well-being.\n\n**Key Areas of Focus**  \n- **Therapeutic Portfolio:** Currently, their portfolio addresses a range of solid tumors, starting with mesothelioma.\n- **Tags:** Eris Biotech is tagged with several relevant categories, including biotech, therapeutics, drug discovery, and oncology—signifying their comprehensive approach to tackling cancer.\n\n**Team and Partnership**  \nThe company's small team is supported by the experienced group partner, Nan, showcasing a blend of ambition and mentorship that can foster rapid growth and innovation.\n\n**Get Involved**  \nEris Biotech invites everyone to join them on their journey to reshape cancer treatment. If you're interested in their work, you can follow their progress on their [LinkedIn page](http://www.erisbio.com/<https:/www.linkedin.com/company/eris-biotech/>) or learn more through their [official website](http://www.erisbio.com).\n\nIn summary, Eris Biotech aims to redefine how we understand and treat cancer, merging groundbreaking science with a compassionate mission. It's exciting to see such determination in a burgeoning company, and there’s no telling what they will accomplish next."
}