{
  "links": "https://www.ycombinator.com/companies/estimote-inc",
  "name": "Estimote, Inc.",
  "headline": "Location intelligence platform",
  "batch": "S13",
  "description": "Estimote, Inc. is the creator of SpaceTimeOS, a revolutionary operating system installed directly on physical spaces to make them programmable and interactive. \r\n\nSmall sensors are attached to walls and items. They talk to each other and communicate with  with servers. A digital copy of the physical space is created in the cloud, allowing for inch-precise and real-time tracking of assets, people, and vehicles. When they move or interact with each other pre-programmed actions are triggered as defined in the apps \"installed\" in different rooms or places. Apps can be downloaded from the marketplace of create by developers using JavaScript and a robust API.\r\n\nThe system utilizes wireless technologies such as Bluetooth and Ultra Wideband to automate processes and track the movement of objects. SpaceTimeOS allows for the creation of smart workplace applications and the digital twinning of entire businesses and supply chains, as well as the blending of physical and digital data.",
  "activity_status": "Active",
  "website": "http://estimote.com",
  "founded_date": 2012.0,
  "team_size": 40.0,
  "location": "Kraków, Poland",
  "group_partner": null,
  "group_partner_yc": null,
  "company_linkedin": null,
  "company_twitter": null,
  "tags": "industry:developer-tools; industry:indoor-mapping; industry:iot",
  "founders": [
    {
      "name": "Lukasz Kostka, Founder/CTO",
      "description": "Co-Founder & CTO @ Estimote",
      "linkedin": "https://www.linkedin.com/in/lukaszkostka/"
    },
    {
      "name": "Jakub Krzych, Founder/CEO",
      "description": "Co-Founder and CEO of Estimote, Inc (YC S13), a location intelligence platform and pioneer of beacons.\nJakub has graduated Physics and Computer Science on Jagiellonian University in Kraków, Poland.",
      "linkedin": "https://www.linkedin.com/in/krzych"
    }
  ],
  "status": true,
  "markdown": "raw_markdown='### estimote\\n# UWB Tags\\n## programmable in JavaScript\\n  * track valuable assets\\n  * automate team work\\n  * prototype innovations\\n\\n[Buy dev kit with 3 tags for $199](http://estimote.com/<https:/order.estimote.com/buy/uwb-tags-devkit>)\\nContact us\\n![](http://estimote.com/uwb-wearable.png)\\n#### How does it work?\\nUWB Tags are handy little gadgets that can detect other nearby tags with inch-level precision. They can trigger actions based on how close they are to each other. With built-in IMU and pressure sensors, they can also track movement and elevation. They can send real-time location and other data over LTE directly to your endpoints, making them a perfect platform for asset tracking, productivity and safety applications. \\n![](http://estimote.com/single-uwb-wearable.png) 40 ![](http://estimote.com/single-uwb-wearable.png)\\n#### What are they used for?\\nThey are used to easily and precisely locate things both indoors and outdoors. Since they are programmable and have connectivity, they are often used for automation. For example, team members can wear them and things can happen automatically just by entering different rooms or approaching equipment. \\n![](http://estimote.com/workplace.png) ![](http://estimote.com/health-care.png) ![](http://estimote.com/panic-button.png) ![](http://estimote.com/workplace.png) ![](http://estimote.com/health-care.png) ![](http://estimote.com/panic-button.png)\\n[Download PDF with 200+ use-cases](http://estimote.com/<estimote-use-cases-2024.pdf>)\\n#### How do they work technically?\\nEach UWB Tag has a very precise clock and an ultra wideband transmitter. When they communicate, they measure the time these radio signals travel from one to another. By multiplying this time by the speed of light, they estimate distances to each other with inch-level accuracy. This precision allows them to deliver magical experiences or automations. \\n![](http://estimote.com/uwb-teardown.png)\\n  * Silicone enclosure\\n  * QR with unique serial\\n  * Prominent last 3 digits\\n\\n\\n  * Attachment point\\n  * Tactile button\\n  * 4 RGB LEDs\\n\\n\\n  * Bluetooth chip\\n  * UWB radio\\n  * IMU with ML\\n\\n\\n  * LTE-M & NB-IoT\\n  * Pressure sensor\\n  * Vibration motor\\n\\n\\n  * 400 mAh battery\\n  * USB-C slot \\n  * 40 min full charging\\n\\n\\n#### How is UWB different from Bluetooth?\\nUWB is a popular emerging technology for positioning. Every Apple iPhone since 2019 has a UWB chip that is used for precision finding, and there are 300+ million of them. Cars like Tesla and BMW use them for keyless car entry and hands-free experiences. If you are already familiar with Bluetooth Low Energy and its applications for IoT, beacons and proximity use-cases, you should think about UWB as the next-gen positioning technology. It is far more accurate, equally low power, relatively inexpensive and also easy to deploy quickly at massive scale. \\n#### How to get started?\\nTo learn and evaluate UWB technology, simply buy our UWB Tags dev kit. It includes everything you need to quickly build location-based applications. \\n![](http://estimote.com/uwb-devkit.png)\\n  * 3 UWB Tags\\n  * Access to web programming IDE\\n  * Access to API documentation\\n  * Active data plan for 90 days\\n  * USB-C charging wire\\n  * Javascript API for BLE/UWB/LTE/IMU\\n  * RESTful API for Cloud events\\n  * Free support via Developer Forum\\n\\n\\n[Buy dev kit for $199](http://estimote.com/<https:/order.estimote.com/buy/uwb-tags-devkit>)\\n#### How can they be programmed?\\nUWB Tags can be programmed directly from your computer using Bluetooth. By using the Chrome browser and our Web IDE, you simply connect with a nearby UWB Tag via Web Bluetooth. You can write JavaScript code and upload it directly to your tag. It will act as you programmed it to. \\nHere is an example JavaScript micro-app for Estimote UWB Tag that turns on LEDs and prints to console when the main button on the tag is pressed:\\n`  // sample JavaScript demo app    io.press(()=>  {  \\xa0io.led(true);    timers.single(\"3s\",()=>{  io.led(false);  });    \\xa0print(\"Button was pressed\");  });\\t ` ![](http://estimote.com/uwb-programming.png)\\nYou can also upload JavaScript code to your tags remotely via LTE. Below is an example asset tracker app which reports every 1 hour their outdoor position using ID of the nearby cell tower:\\n`  // sample JavaScript outdoor tracking app   \\tfunction scanForCellTowers() { \\t \\xa0modem.getStatus().then((status) => { \\t  \\xa0\\xa0print(\"Obtaining modem scan data\"); \\t  \\xa0\\xa0var data = {\"carrier\":status.name, \\t\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\"cellTowerID\":status.cell, \\t\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\"LAC\":status.lac, \\t\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\"MNC\":status.mnc, \\t\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\"MCC\":status.mcc, \\t\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\"signal\":status.rssi}; \\t  \\xa0\\xa0cloud.enqueue(\\'scanResult\\', data); \\t  \\xa0\\xa0sync.now(); // sending data to Cloud via LTE \\t\\xa0 }); \\t} \\ttimers.repeat(\\'1h\\', scanForCellTowers); ` ![](http://estimote.com/uwb-map.png)\\n#### Can they push data directly to my cloud?\\nYes, UWB Tags have a built-in modem, just like your smartphone. They connect to the nearest cell tower using LTE-M or NB-IoT and can send data directly to your own cloud. In our Web IDE, there is a section called \"Cloud code\" which is executed as a serverless Lambda. You can program it to structure and send data to your own end-points. \\nHere is an example app that forward data to your AWS end point:\\n`  // sample JavaScript cloud code    const superagent = require(\\'superagent\\')  const ENDPOINT = \\'https://your_endpoint_here\\'  const TOKEN = \\'YOUR-AUTH-TOKEN  module.exports = function (event) { \\t \\xa0const payload = { \\t  \\xa0\\xa0asset: event.identifier, \\t  \\xa0\\xa0cell: event.payload.cell \\t \\xa0}   \\t \\xa0return superagent \\t  \\xa0.post(ENDPOINT) \\t  \\xa0.set(\\'Authorization\\', `Bearer ${TOKEN}`) \\t  \\xa0.send(payload) \\t} ` ![](http://estimote.com/uwb-cloud-lambda.png)\\n#### Why JavaScript?\\nBecause it is the most popular language among developers. There are milions of web developers who are fluent in JS, working on client or server-side. This is far more than embedded engineers who are typically required to program IoT devices. JavaScript has native support for events, and in the modern IoT it\\'s all about events and reactions to things that happen in the physical world. JavaScript can also be generated with modern AI tools, allowing you to come up with any real-world application you want. \\n#### Why I should buy this dev kit?\\nIt is simply the best way to learn and evaluate UWB technology. You don\\'t need embedded engineering skills since you can program UWB tags in JavaScript direcly from your laptop. You can use them to prototype various use cases, from asset tracking to smart badges. Since they have LTE, you can also use them to pilot your solution and collect data or update remotely. It is the best IoT prototyping platform on the market. \\n[Buy dev kit for $199](http://estimote.com/<https:/order.estimote.com/buy/uwb-tags-devkit>)\\n#### What is the battery life of a UWB tag?\\nEach tag has a 400 mAh rechargeable battery. Battery life depends on the configuration. For simple UWB or BLE beaconing, they can last years on a single charge. When programmed to act as wearables detecting proximity and sending data, they can last a few weeks. For continuous scanning and real-time asset tracking, they require permanent power via USB-C. \\n#### How accurate are the tags?\\nIt depends on tag orientation, but on average, without any filtering, you should expect approx. 20cm. With sensor fusion including the IMU, accuracy could improve to sub-10cm. Their responsiveness can be as low as 10ms, and the range is up to 30-40m, extendable to 100-200m with an LNA amplifier. \\n#### Do they work in any environment?\\nUWB signals are 3-9 GHz frequency and can easily go through concrete, wood or glass. As every radio wave it might be blocked by metal structures so in a complex industrial environments it is important to install more of them to ensure line of sight. They be deployed indoor or outdoor and they survive from -40°C up to +40°C.\\n#### What industries are they suited for?\\nOur tags are used in warehousing, logistics, healthcare, retail, and hospitality. They enhance safety, improve asset tracking, and provide precise location data where GPS is insufficient. During the pandemic, they were used for contact tracing and social distancing. In hospitality, they can serve as panic buttons for cleaning personnel. \\n![](http://estimote.com/workplace.png) ![](http://estimote.com/health-care.png) ![](http://estimote.com/panic-button.png) ![](http://estimote.com/workplace.png) ![](http://estimote.com/health-care.png) ![](http://estimote.com/panic-button.png)\\n[Download PDF with 200+ use-cases](http://estimote.com/<estimote-use-cases-2024.pdf>)\\n#### Can smartphones detect UWB tags?\\nYes, UWB Tags can be configured in JavaScript to act as BLE beacons, broadcasting for example, iBeacon packets. Smartphones can detect these packets and react to the presence of tags. They can also range with UWB-enabled iPhones or Androids with high precision, but that requires using non-JavaScript firmware since the interoperability standard defined by FiRa requires strict configuration. \\n#### Is location tracking better with smartphones or UWB tags?\\nWell, it really depends on your objectives. If you are working on a consumer solution and need to provide indoor location or proximity experiences to hundreds of thousands of users, it would be easier to build a smartphone app. Although it might take time and might be a significant investment, it might also require the users to download an app compatible with their device, grant all the permissions, etc. On the other hand, if you are building a solution for a workplace of hundreds or even thousands of employees, it might be easier to give UWB Tags to your team members. You just ship the tags to them, push software remotely and the device work out of the box. \\n#### How many UWB tags can range with each other?\\nWhen it comes to BLE, there is actually no limit and a tag can detect hundreds of other tags nearby. With UWB, it is also possible to range with 100 tags or so. Since ranging requires exchanging some packets, it might be less responsive for 100 tags compared to 10 tags. \\n#### Can UWB tags be used for RTLS?\\nYes, UWB Tags can be programmed for Real-Time Location Systems (RTLS). Some will act as tags, broadcasting their presence and others will be anchors scanning for tags and computing their precise (X,Y) location using a technique called time difference of arrival (TDoA). \\n#### What are the security features?\\nOur tags are protected by industry standard encryption to ensure only authorized users who own them can program and communicate with them. We also offer private cloud deployments in your AWS, GCP or Azure to ensure data are end-to-end encrypted and securely stored for your most sensitive applications. \\n#### Do you offer support?\\nYes, we offer comprehensive online API documentation, templates, demos and best practices. Additionally, we provide paid technical support to assist customers with integrating our tags into existing systems. We have deployed millions of tags globally for various applications and are always more than happy to share our experience. \\n#### How about custom form-factors?\\nWe offer different sizes and shapes and also help our customers design custom form-factors for their domain-specific applications. Customisations can also include additional sensors, firmware, mobile SDK or Cloud app modifications.\\n![](http://estimote.com/estimote-products.png)\\n#### How can I contact you?\\nSimply shoot us a note to contact@estimote.com and our team will get back to arrange a discovery call. Once we know more about your vision and your use-case, we will recommend the best hardware and software and provide bulk pricing. \\nContact us\\n#### Why should we work with you?\\nEstimote, Inc. has been a market leader in location and proximity technologies for over a decade, developing cutting-edge solutions for a wide range of applications. Founded in 2012, Estimote has revolutionized the way businesses interact with physical spaces through the use of small, wireless sensors that leverage modern IoT radio technologies like Bluetooth, Ultra Wideband (UWB), and LTE/NB-IoT\\u200b. The company has successfully deployed millions of sensors worldwide for the most progressive clients, including Apple, Amazon, Nike, or NASA. These implementations have demonstrated the scalability and versatility of Estimote\\'s technology in various industries, enhancing operational efficiency and customer engagement\\u200b. \\n![](http://estimote.com/estimote-logo.png)\\n##### Estimote, Inc\\n228 Park Ave S New York, 10003 United States\\n##### Estimote Polska Sp. z o.o.\\nKrakusa 11 30-535 Kraków Poland / European Union\\n  * [API Documentation](http://estimote.com/<https:/developer.estimote.com/lte-beacon/micro-app-api-reference/>)\\n  * [Developer Forum](http://estimote.com/<https:/forums.estimote.com/>)\\n  * [GitHub](http://estimote.com/<https:/github.com/Estimote/>)\\n  * Contact us\\n\\n\\nCopyright © 2012-2024 by Estimote, Inc. All Rights Reserved. Tesla, Apple, iPhone, Chrome, Bluetooth and other trademarks are the property of their respective trademark holders.\\n' markdown_with_citations='### estimote\\n# UWB Tags\\n## programmable in JavaScript\\n  * track valuable assets\\n  * automate team work\\n  * prototype innovations\\n\\nBuy dev kit with 3 tags for $199⟨1⟩\\nContact us\\n![](http://estimote.com/uwb-wearable.png)\\n#### How does it work?\\nUWB Tags are handy little gadgets that can detect other nearby tags with inch-level precision. They can trigger actions based on how close they are to each other. With built-in IMU and pressure sensors, they can also track movement and elevation. They can send real-time location and other data over LTE directly to your endpoints, making them a perfect platform for asset tracking, productivity and safety applications. \\n![](http://estimote.com/single-uwb-wearable.png) 40 ![](http://estimote.com/single-uwb-wearable.png)\\n#### What are they used for?\\nThey are used to easily and precisely locate things both indoors and outdoors. Since they are programmable and have connectivity, they are often used for automation. For example, team members can wear them and things can happen automatically just by entering different rooms or approaching equipment. \\n![](http://estimote.com/workplace.png) ![](http://estimote.com/health-care.png) ![](http://estimote.com/panic-button.png) ![](http://estimote.com/workplace.png) ![](http://estimote.com/health-care.png) ![](http://estimote.com/panic-button.png)\\nDownload PDF with 200+ use-cases⟨2⟩\\n#### How do they work technically?\\nEach UWB Tag has a very precise clock and an ultra wideband transmitter. When they communicate, they measure the time these radio signals travel from one to another. By multiplying this time by the speed of light, they estimate distances to each other with inch-level accuracy. This precision allows them to deliver magical experiences or automations. \\n![](http://estimote.com/uwb-teardown.png)\\n  * Silicone enclosure\\n  * QR with unique serial\\n  * Prominent last 3 digits\\n\\n\\n  * Attachment point\\n  * Tactile button\\n  * 4 RGB LEDs\\n\\n\\n  * Bluetooth chip\\n  * UWB radio\\n  * IMU with ML\\n\\n\\n  * LTE-M & NB-IoT\\n  * Pressure sensor\\n  * Vibration motor\\n\\n\\n  * 400 mAh battery\\n  * USB-C slot \\n  * 40 min full charging\\n\\n\\n#### How is UWB different from Bluetooth?\\nUWB is a popular emerging technology for positioning. Every Apple iPhone since 2019 has a UWB chip that is used for precision finding, and there are 300+ million of them. Cars like Tesla and BMW use them for keyless car entry and hands-free experiences. If you are already familiar with Bluetooth Low Energy and its applications for IoT, beacons and proximity use-cases, you should think about UWB as the next-gen positioning technology. It is far more accurate, equally low power, relatively inexpensive and also easy to deploy quickly at massive scale. \\n#### How to get started?\\nTo learn and evaluate UWB technology, simply buy our UWB Tags dev kit. It includes everything you need to quickly build location-based applications. \\n![](http://estimote.com/uwb-devkit.png)\\n  * 3 UWB Tags\\n  * Access to web programming IDE\\n  * Access to API documentation\\n  * Active data plan for 90 days\\n  * USB-C charging wire\\n  * Javascript API for BLE/UWB/LTE/IMU\\n  * RESTful API for Cloud events\\n  * Free support via Developer Forum\\n\\n\\nBuy dev kit for $199⟨1⟩\\n#### How can they be programmed?\\nUWB Tags can be programmed directly from your computer using Bluetooth. By using the Chrome browser and our Web IDE, you simply connect with a nearby UWB Tag via Web Bluetooth. You can write JavaScript code and upload it directly to your tag. It will act as you programmed it to. \\nHere is an example JavaScript micro-app for Estimote UWB Tag that turns on LEDs and prints to console when the main button on the tag is pressed:\\n`  // sample JavaScript demo app    io.press(()=>  {  \\xa0io.led(true);    timers.single(\"3s\",()=>{  io.led(false);  });    \\xa0print(\"Button was pressed\");  });\\t ` ![](http://estimote.com/uwb-programming.png)\\nYou can also upload JavaScript code to your tags remotely via LTE. Below is an example asset tracker app which reports every 1 hour their outdoor position using ID of the nearby cell tower:\\n`  // sample JavaScript outdoor tracking app   \\tfunction scanForCellTowers() { \\t \\xa0modem.getStatus().then((status) => { \\t  \\xa0\\xa0print(\"Obtaining modem scan data\"); \\t  \\xa0\\xa0var data = {\"carrier\":status.name, \\t\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\"cellTowerID\":status.cell, \\t\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\"LAC\":status.lac, \\t\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\"MNC\":status.mnc, \\t\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\"MCC\":status.mcc, \\t\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\"signal\":status.rssi}; \\t  \\xa0\\xa0cloud.enqueue(\\'scanResult\\', data); \\t  \\xa0\\xa0sync.now(); // sending data to Cloud via LTE \\t\\xa0 }); \\t} \\ttimers.repeat(\\'1h\\', scanForCellTowers); ` ![](http://estimote.com/uwb-map.png)\\n#### Can they push data directly to my cloud?\\nYes, UWB Tags have a built-in modem, just like your smartphone. They connect to the nearest cell tower using LTE-M or NB-IoT and can send data directly to your own cloud. In our Web IDE, there is a section called \"Cloud code\" which is executed as a serverless Lambda. You can program it to structure and send data to your own end-points. \\nHere is an example app that forward data to your AWS end point:\\n`  // sample JavaScript cloud code    const superagent = require(\\'superagent\\')  const ENDPOINT = \\'https://your_endpoint_here\\'  const TOKEN = \\'YOUR-AUTH-TOKEN  module.exports = function (event) { \\t \\xa0const payload = { \\t  \\xa0\\xa0asset: event.identifier, \\t  \\xa0\\xa0cell: event.payload.cell \\t \\xa0}   \\t \\xa0return superagent \\t  \\xa0.post(ENDPOINT) \\t  \\xa0.set(\\'Authorization\\', `Bearer ${TOKEN}`) \\t  \\xa0.send(payload) \\t} ` ![](http://estimote.com/uwb-cloud-lambda.png)\\n#### Why JavaScript?\\nBecause it is the most popular language among developers. There are milions of web developers who are fluent in JS, working on client or server-side. This is far more than embedded engineers who are typically required to program IoT devices. JavaScript has native support for events, and in the modern IoT it\\'s all about events and reactions to things that happen in the physical world. JavaScript can also be generated with modern AI tools, allowing you to come up with any real-world application you want. \\n#### Why I should buy this dev kit?\\nIt is simply the best way to learn and evaluate UWB technology. You don\\'t need embedded engineering skills since you can program UWB tags in JavaScript direcly from your laptop. You can use them to prototype various use cases, from asset tracking to smart badges. Since they have LTE, you can also use them to pilot your solution and collect data or update remotely. It is the best IoT prototyping platform on the market. \\nBuy dev kit for $199⟨1⟩\\n#### What is the battery life of a UWB tag?\\nEach tag has a 400 mAh rechargeable battery. Battery life depends on the configuration. For simple UWB or BLE beaconing, they can last years on a single charge. When programmed to act as wearables detecting proximity and sending data, they can last a few weeks. For continuous scanning and real-time asset tracking, they require permanent power via USB-C. \\n#### How accurate are the tags?\\nIt depends on tag orientation, but on average, without any filtering, you should expect approx. 20cm. With sensor fusion including the IMU, accuracy could improve to sub-10cm. Their responsiveness can be as low as 10ms, and the range is up to 30-40m, extendable to 100-200m with an LNA amplifier. \\n#### Do they work in any environment?\\nUWB signals are 3-9 GHz frequency and can easily go through concrete, wood or glass. As every radio wave it might be blocked by metal structures so in a complex industrial environments it is important to install more of them to ensure line of sight. They be deployed indoor or outdoor and they survive from -40°C up to +40°C.\\n#### What industries are they suited for?\\nOur tags are used in warehousing, logistics, healthcare, retail, and hospitality. They enhance safety, improve asset tracking, and provide precise location data where GPS is insufficient. During the pandemic, they were used for contact tracing and social distancing. In hospitality, they can serve as panic buttons for cleaning personnel. \\n![](http://estimote.com/workplace.png) ![](http://estimote.com/health-care.png) ![](http://estimote.com/panic-button.png) ![](http://estimote.com/workplace.png) ![](http://estimote.com/health-care.png) ![](http://estimote.com/panic-button.png)\\nDownload PDF with 200+ use-cases⟨2⟩\\n#### Can smartphones detect UWB tags?\\nYes, UWB Tags can be configured in JavaScript to act as BLE beacons, broadcasting for example, iBeacon packets. Smartphones can detect these packets and react to the presence of tags. They can also range with UWB-enabled iPhones or Androids with high precision, but that requires using non-JavaScript firmware since the interoperability standard defined by FiRa requires strict configuration. \\n#### Is location tracking better with smartphones or UWB tags?\\nWell, it really depends on your objectives. If you are working on a consumer solution and need to provide indoor location or proximity experiences to hundreds of thousands of users, it would be easier to build a smartphone app. Although it might take time and might be a significant investment, it might also require the users to download an app compatible with their device, grant all the permissions, etc. On the other hand, if you are building a solution for a workplace of hundreds or even thousands of employees, it might be easier to give UWB Tags to your team members. You just ship the tags to them, push software remotely and the device work out of the box. \\n#### How many UWB tags can range with each other?\\nWhen it comes to BLE, there is actually no limit and a tag can detect hundreds of other tags nearby. With UWB, it is also possible to range with 100 tags or so. Since ranging requires exchanging some packets, it might be less responsive for 100 tags compared to 10 tags. \\n#### Can UWB tags be used for RTLS?\\nYes, UWB Tags can be programmed for Real-Time Location Systems (RTLS). Some will act as tags, broadcasting their presence and others will be anchors scanning for tags and computing their precise (X,Y) location using a technique called time difference of arrival (TDoA). \\n#### What are the security features?\\nOur tags are protected by industry standard encryption to ensure only authorized users who own them can program and communicate with them. We also offer private cloud deployments in your AWS, GCP or Azure to ensure data are end-to-end encrypted and securely stored for your most sensitive applications. \\n#### Do you offer support?\\nYes, we offer comprehensive online API documentation, templates, demos and best practices. Additionally, we provide paid technical support to assist customers with integrating our tags into existing systems. We have deployed millions of tags globally for various applications and are always more than happy to share our experience. \\n#### How about custom form-factors?\\nWe offer different sizes and shapes and also help our customers design custom form-factors for their domain-specific applications. Customisations can also include additional sensors, firmware, mobile SDK or Cloud app modifications.\\n![](http://estimote.com/estimote-products.png)\\n#### How can I contact you?\\nSimply shoot us a note to contact@estimote.com and our team will get back to arrange a discovery call. Once we know more about your vision and your use-case, we will recommend the best hardware and software and provide bulk pricing. \\nContact us\\n#### Why should we work with you?\\nEstimote, Inc. has been a market leader in location and proximity technologies for over a decade, developing cutting-edge solutions for a wide range of applications. Founded in 2012, Estimote has revolutionized the way businesses interact with physical spaces through the use of small, wireless sensors that leverage modern IoT radio technologies like Bluetooth, Ultra Wideband (UWB), and LTE/NB-IoT\\u200b. The company has successfully deployed millions of sensors worldwide for the most progressive clients, including Apple, Amazon, Nike, or NASA. These implementations have demonstrated the scalability and versatility of Estimote\\'s technology in various industries, enhancing operational efficiency and customer engagement\\u200b. \\n![](http://estimote.com/estimote-logo.png)\\n##### Estimote, Inc\\n228 Park Ave S New York, 10003 United States\\n##### Estimote Polska Sp. z o.o.\\nKrakusa 11 30-535 Kraków Poland / European Union\\n  * API Documentation⟨3⟩\\n  * Developer Forum⟨4⟩\\n  * GitHub⟨5⟩\\n  * Contact us\\n\\n\\nCopyright © 2012-2024 by Estimote, Inc. All Rights Reserved. Tesla, Apple, iPhone, Chrome, Bluetooth and other trademarks are the property of their respective trademark holders.\\n' references_markdown='\\n\\n## References\\n\\n⟨1⟩ http://estimote.com/<https:/order.estimote.com/buy/uwb-tags-devkit>: Buy dev kit with 3 tags for $199\\n⟨2⟩ http://estimote.com/<estimote-use-cases-2024.pdf>: Download PDF with 200+ use-cases\\n⟨3⟩ http://estimote.com/<https:/developer.estimote.com/lte-beacon/micro-app-api-reference/>: API Documentation\\n⟨4⟩ http://estimote.com/<https:/forums.estimote.com/>: Developer Forum\\n⟨5⟩ http://estimote.com/<https:/github.com/Estimote/>: GitHub\\n' fit_markdown='' fit_html=''",
  "generated_description": "**Estimote, Inc.** is a company that emerged from the innovative Y Combinator Batch S13 in 2012, located in Kraków, Poland. Its mission centers around revolutionizing location intelligence through a platform known as **SpaceTimeOS**. This operating system brings physical spaces to life, making them programmable and interactive, essentially creating a digital twin of the real world.\n\nAt the heart of Estimote's technology are small sensors that can be attached to walls and objects. These sensors communicate with each other and the cloud to enable inch-precise, real-time tracking of assets, people, and vehicles. Imagine walking into a room, and the space instantly recognizes your presence, triggering predefined actions—all thanks to these tiny devices and the powerful programming capabilities offered through JavaScript and a robust API.\n\nEstimote's system harnesses cutting-edge wireless technologies, particularly **Ultra Wideband (UWB)** and Bluetooth, to automate tasks and track movements with remarkable accuracy. This technology is not just about finding lost items; it serves a multitude of applications, from smart workplace solutions to enhancing supply chain logistics. \n\nWhy is this important? With the rise of remote work and the need for smarter ways to manage physical spaces, the relevance of Estimote's offerings has never been clearer. They support various industries—healthcare, logistics, retail, and hospitality, among others—proving particularly valuable during the pandemic for applications like contact tracing and enforcing social distancing.\n\nThe company boasts a team of about 40 skilled professionals and has partnered with major players like **Apple, Amazon, and Nike**, showcasing the versatility and scalability of its technology in real-world scenarios. \n\nIf you're intrigued and want to dive deeper into the world of UWB tracking, Estimote offers a development kit at an accessible price point—perfect for developers looking to innovate without needing prior embedded systems expertise. The kit includes three UWB Tags, an API access, and support documentation, making it a comprehensive starting point for exploring location-based applications.\n\nIn a nutshell, Estimote, Inc. is at the forefront of blending the digital and physical worlds through innovative location technology—tailoring solutions to fit the evolving needs of businesses and industries in an increasingly interconnected world. For more information, you can check out their website at [estimote.com](http://estimote.com)."
}