{
  "links": "https://www.ycombinator.com/companies/finosu",
  "name": "Finosu",
  "headline": "Workflow automation for the credit industry",
  "batch": "S24",
  "description": "Hi - Mark and Gab here!\r\n\nWe met while working at Alt, a marketplace for collectibles, where we built a $200 million specialty finance business line. At Alt, we faced the complex challenges that come with servicing consumer loans. We spent countless hours and resources developing internal tools to manage loan payments, communicate with borrowers, and keep track of loan performance—all while ensuring a positive experience for our customers.\r\n\nHowever, after dealing with the headaches of manual data entry, fragmented systems, delayed payments, lack of personalized borrower engagement, and the stress of maintaining accurate records, we knew there had to be a better way to service consumer loans.\r\n\nSo, we started Finosu to build the servicer we wish we had—an AI-powered consumer loan servicer designed to streamline and enhance every aspect of the loan servicing process. Our mission is to transform loan servicing into a seamless, efficient, and customer-centric experience.\r\nSo, we started Finosu to build the tools that we wish we had.\r\n\nFinsou is building software to reduce the barriers to entry in lending, beginning with:  outsourced state licensing, default compliant loan management systems, and automated servicing infrastructure.\r\n\nThe operational cost of originating and servicing loans reaches into the tens of billions a year and that is money out of the pocket of lenders, borrowers, investors, and ultimately the consumers as a cost of doing business – we are changing that.",
  "activity_status": "Active",
  "website": "https://www.finosu.com",
  "founded_date": 2024.0,
  "team_size": 2.0,
  "location": null,
  "group_partner": null,
  "group_partner_yc": null,
  "company_linkedin": null,
  "company_twitter": null,
  "tags": "industry:fintech; industry:b2b; industry:lending; industry:consumer-finance",
  "founders": [
    {
      "name": "Mark Ricciardi, Founder",
      "description": "Started in finance as a special situations private credit investor and then moved to tech to build productized credit instruments.",
      "linkedin": "https://www.linkedin.com/in/mark-ricciardi"
    },
    {
      "name": "Gabriel Vincent Kho, Founder",
      "description": "Stanford grad. Ex-Flexport. AI consultant (not currently because I'm working on my own start-up). I'm currently working on fixing the problems I faced in the credit space while working at Alt.",
      "linkedin": "https://www.linkedin.com/in/%F0%9F%94%B0-gabriel-kho-924a6166/"
    }
  ],
  "status": true,
  "markdown": "raw_markdown=\"![Finosu Logo](https://www.finosu.com/_next/image?url=%2Flogos%2Ffinosu.png&w=96&q=75)\\nFinosu\\n  * [Home](https://www.finosu.com/</>)\\n  * [About Us](https://www.finosu.com/</about>)\\n\\n\\n# Loan servicer built for consumer finance\\nEmail\\nLEARN MORE[SCHEDULE DEMO](https://www.finosu.com/<https:/app.apollo.io/#/meet/mark_ricciardi_78f/30-min?source=gmail>)\\nRecover more while improving your obligors' experiences at a fraction of the cost.\\nAutomated communications across voice, texting, email, and direct mail.\\n100% compliance coverage with live transcription, summarization, and quality assurance that catches customer escalations and compliance violations at the source.\\nUse our payment rails and communication modalities if you don't want to bring your own.\\nEasy integration with your existing LOS/LMS/CRM.\\n[![Launch YC: Finosu: Automated compliance for consumer lending](https://www.ycombinator.com/launches/LcO-finosu-automated-compliance-for-consumer-lending/upvote_embed.svg)](https://www.finosu.com/<https:/www.ycombinator.com/launches/LcO-finosu-automated-compliance-for-consumer-lending>)[![Text to Speech](https://storage.googleapis.com/eleven-public-cdn/images/elevenlabs-grants-logo.png)](https://www.finosu.com/<https:/elevenlabs.io/text-to-speech>)\\n© 2024 Finosu, Inc.\\nContact Us\\n\" markdown_with_citations=\"![Finosu Logo⟨1⟩]\\nFinosu\\n  * Home⟨2⟩\\n  * About Us⟨3⟩\\n\\n\\n# Loan servicer built for consumer finance\\nEmail\\nLEARN MORESCHEDULE DEMO⟨4⟩\\nRecover more while improving your obligors' experiences at a fraction of the cost.\\nAutomated communications across voice, texting, email, and direct mail.\\n100% compliance coverage with live transcription, summarization, and quality assurance that catches customer escalations and compliance violations at the source.\\nUse our payment rails and communication modalities if you don't want to bring your own.\\nEasy integration with your existing LOS/LMS/CRM.\\n![Launch YC: Finosu: Automated compliance for consumer lending⟨5⟩](https://www.finosu.com/<https:/www.ycombinator.com/launches/LcO-finosu-automated-compliance-for-consumer-lending>)![Text to Speech⟨6⟩](https://www.finosu.com/<https:/elevenlabs.io/text-to-speech>)\\n© 2024 Finosu, Inc.\\nContact Us\\n\" references_markdown='\\n\\n## References\\n\\n⟨1⟩ https://www.finosu.com/_next/image?url=%2Flogos%2Ffinosu.png&w=96&q=75: Finosu Logo\\n⟨2⟩ https://www.finosu.com/</>: Home\\n⟨3⟩ https://www.finosu.com/</about>: About Us\\n⟨4⟩ https://www.finosu.com/<https:/app.apollo.io/#/meet/mark_ricciardi_78f/30-min?source=gmail>: SCHEDULE DEMO\\n⟨5⟩ https://www.ycombinator.com/launches/LcO-finosu-automated-compliance-for-consumer-lending/upvote_embed.svg: ![Launch YC: Finosu: Automated compliance for consumer lending\\n⟨6⟩ https://storage.googleapis.com/eleven-public-cdn/images/elevenlabs-grants-logo.png: ![Text to Speech\\n' fit_markdown='' fit_html=''",
  "generated_description": "### Finosu Overview\n\n**Name:** Finosu  \n**Founded:** 2024  \n**Location:** N/A  \n**Team Size:** 2 employees  \n**Y Combinator Batch:** S24  \n**Website:** [finosu.com](https://www.finosu.com)  \n**Tags:** Fintech, B2B, Lending, Consumer Finance  \n\n---\n\n#### Mission\n\nFinosu is on a mission to streamline workflow automation in the credit industry. Their primary goal is to create a consumer loan servicing experience that is efficient, compliant, and customer-centric, transforming an often cumbersome process into something seamless.\n\n#### Founders’ Journey\n\nFinosu was founded by Mark and Gab, who first crossed paths while working at Alt, a marketplace for collectibles. There, they built a $200 million specialty finance business, grappling with the challenges of managing consumer loans. They quickly realized the inadequacies of existing systems—manual data entry, fragmentation, and poor engagement were just a few pain points they faced.\n\nThis led them to envision Finosu as the solution they wished they had during their tenure at Alt. They aimed to create an AI-powered servicer that would not only alleviate these frustrations but also enhance the overall loan servicing experience for both lenders and borrowers.\n\n#### Key Offerings\n\nFinosu provides a comprehensive suite of software designed to reduce barriers in lending. Some of their core offerings include:\n\n- **Outsourced State Licensing**: Simplifying the regulatory landscape for lenders.\n- **Default Compliant Loan Management Systems**: Ensuring robust management and compliance across loan servicing operations.\n- **Automated Servicing Infrastructure**: Utilizing AI to facilitate seamless, automated communication channels including voice, text, email, and direct mail.\n\nThis approach not only aims to improve the borrower experience but also significantly cut down on operational costs, addressing a fundamental issue where servicing can cost lenders billions annually.\n\n---\n\n#### What Sets Finosu Apart?\n\nFinosu differentiates itself with a focus on:\n\n- **Comprehensive Compliance**: 100% compliance coverage, with real-time monitoring for customer escalations and potential violations, ensuring peace of mind for lenders.\n- **Easy Integration**: The platform easily integrates with existing Loan Origination Systems (LOS), Loan Management Systems (LMS), and Customer Relationship Management (CRM) tools, making it adaptable for various operational needs.\n- **Customer-Centric Approach**: With a commitment to enhancing borrower experiences, Finosu seeks to provide more personal engagement, improving recovery rates while maintaining satisfaction.\n\n---\n\nIn essence, Finosu isn't just another fintech startup; it's built from the ground up by those who have firsthand experience with the inefficiencies of loan servicing. With a laser focus on automation and compliance, they're poised to change the narrative around consumer finance and lending. If you’re curious about transforming your loan servicing processes, you might want to check them out."
}