{
  "links": "https://www.ycombinator.com/companies/flow-club",
  "name": "Flow Club",
  "headline": "Virtual Co-working Community",
  "batch": "S21",
  "description": "https://www.flow.club/ is a virtual co-working space where people work in high-intensity sprints designed to double their productivity. \r\n\nWe envision a world where...\r\n- anyone can access deep, focused flow anytime, anywhere\r\n- working independently or remotely doesn’t have to feel like you're on your own\r\n\nOur mission is to build the software that powers the most inspiring and productive work environment for knowledge workers.\r\n\nOur members love Flow Club (https://www.flow.club/wall-of-love). We’re growing quickly, just presented at Y Combinator's Summer 2021 Demo Day, raised $5M, and hiring our founding team.\r\n\nWe are backed by Worklife Ventures, a firm investing in companies re-designing the way work gets done in the future, and 100 more of the world's best investors and operators. Among our investors are Paul Graham and the founders of iconic companies like Dropbox, Mercury, Quora, Outschool, and Sendbird. \r\n\nFinally, we are inspired by our members and hosts who we see everyday working out of Flow Club building the most incredible things. They remind us great things are built incrementally, one step at a time.",
  "activity_status": "Active",
  "website": "https://www.flow.club/",
  "founded_date": 2020.0,
  "team_size": 6.0,
  "location": "San Francisco",
  "group_partner": "Harj Taggar",
  "group_partner_yc": "https://www.ycombinator.com/people/harj-taggar",
  "company_linkedin": null,
  "company_twitter": null,
  "tags": "industry:consumer; industry:community; industry:productivity; industry:health-&-wellness; industry:remote-work; location:san-francisco-bay-area",
  "founders": [
    {
      "name": "Ricky Yean, Founder",
      "description": "Working on Flow.Club",
      "linkedin": "https://www.linkedin.com/in/rickyyean/"
    },
    {
      "name": "David Tran, Founder",
      "description": "Co-founder, Flow Club— come co-work with me: https://in.flow.club/h/david-t?inviteCode=David958\n\nPreviously: wrote the first lines of code for Alchemy, and co-founded Crowdbooster/Upbeat (YC S2010)",
      "linkedin": "https://linkedin.com/in/davetran"
    }
  ],
  "status": true,
  "markdown": "raw_markdown='[![](https://cdn.prod.website-files.com/602c0d03c082d985980c0fdd/63c0cabbf341f3128e97c672_Flow%20Club.svg)](https://www.flow.club/</>)\\n[How it Works](https://www.flow.club/</how-it-works>)[Member Login](https://www.flow.club/<https:/in.flow.club/login>)[try flow club free](https://www.flow.club/<https:/in.flow.club/>)\\n# Fight procrastination. Get your work done. Go have fun.\\nJoin committed folks in virtual coworking sessions designed to drop you into productive flow.\\n[Get Focused - Free](https://www.flow.club/<https:/in.flow.club/>)\\n![Flow Club schedule](https://cdn.prod.website-files.com/602c0d03c082d985980c0fdd/6601da34602c434d47d4d3fc_flowclubschedule.webp)![An image of a web browser with videos of people and a to-do list](https://cdn.prod.website-files.com/602c0d03c082d985980c0fdd/6601d3a607414fbd690626cd_flow-club-schedule.webp)\\n## \"Combining the freedom of remote work with the extra focus that comes with someone else working nearby\" - **New York Times**\\n## Our Members\\n### 400+\\nHosts\\n### 🧠\\nSupporting Neurodivergence\\n### 94%\\nReport feeling supported in their productivity journey\\n![](https://cdn.prod.website-files.com/602c0d03c082d985980c0fdd/62cc467232fa34266132512e_Julie.webp)\\n#### Julie A.\\nUniversity Professor\\n**Friendly accountability and body doubling** turned out to be the two key things I needed to effectively manage my ADHD. Flow Club provides both of those.\\n![](https://cdn.prod.website-files.com/602c0d03c082d985980c0fdd/63cb1e66feacbc739ff38a31_ximena--ofxriTWLl2OqqCBYco6tPisARyE3.webp)\\n#### Ximena V.\\nGraduate student\\nJust having someone \"next\" to me doing their own thing is enough for me to focus. How body-doubling works is a mystery to me, but **I\\'ve achieved more in the few months I\\'ve been with Flow Club than I have in years.**\\n![](https://cdn.prod.website-files.com/602c0d03c082d985980c0fdd/63cb1a9327e7bcfb1be93484_biancawu--34oW6r5jH5dP5MWXgnlsZ8e9mO53.webp)\\n#### Bianca W.\\nFinancial Analyst\\nAs a chronic procrastinator who gets overwhelmed easily, I LOVE Flow Club. It’s the only thing that will have me not only start on tasks, but **finish them**.\\n![](https://cdn.prod.website-files.com/602c0d03c082d985980c0fdd/63cb1b7cd805d54d55d77fb8_alexs--lgL4kFqcBcNckkLdL7rgCJoD6x23.webp)\\n#### Alex S.\\nPoet and Writer\\nFlow Club somehow **brings the same support into my apartment as would a trusted friend** — while simultaneously giving me the freedom to interact as much or as little as I am up to on a given day. Magic!\\n![](https://cdn.prod.website-files.com/602c0d03c082d985980c0fdd/63cb1ef6fc84bb5c73d21d44_rana--U97pckoqKQdfqkN1SOGi9mjyczz1.webp)\\n#### Rana K.\\nDesigner\\nBefore joining, I felt lost and alone in my struggles. But through Flow Club, I have been able to connect with a community of people who understand my experiences and provide valuable support and resources.\\n![](https://cdn.prod.website-files.com/602c0d03c082d985980c0fdd/63cb1d8a5bb3eeb6a741458f_lesly--5j5jE6Yv8tRBUXiuhXVIgyUErL42.webp)\\n#### Lesly Q.\\nWriter, Learner, and Side Hustler\\nAs someone with ADHD, I work best when I’m around noise and people. Flow Club provides me with the feeling of social stimulation while I work.\\n![](https://cdn.prod.website-files.com/602c0d03c082d985980c0fdd/63cb20e5835384079a4d72d9_erin.webp)\\n#### Erin R.\\nFreelance Writer\\nSessions help me stay focused and productive by providing accountability, shared energy, and support.\\n![](https://cdn.prod.website-files.com/602c0d03c082d985980c0fdd/63d15ac8f9aa1648a501bbe8_anonymous.webp)\\n#### Anonymous Member\\nFlow Club gave me a self esteem boost that showed I wasn\\'t a time-wasting space cadet with my head in the clouds.\\n![](https://cdn.prod.website-files.com/602c0d03c082d985980c0fdd/63cb1cc5d7632ef4122c1431_janel-k.webp)\\n#### Janel K.\\nBusiness Development\\nI like that the interpersonal interactions are low-stakes and minimal - you don\\'t have to talk or be on camera if you don\\'t want to be.\\n![](https://cdn.prod.website-files.com/602c0d03c082d985980c0fdd/63cb1bebb62733e01c07f2cf_bethani--SyMwxQoHXyZOhGmrkLVYroeVfgD3.webp)\\n#### **Bethani L.**\\nCustomer Educator, Tech\\n**\\u200d** My fellow Flow Clubbers keep me accountable to my goals, and they also encourage me to take breaks and practice self-care. There are so many other ADHDers in Flow Club, and I feel like I\\'ve really found my people. I\\'ve haven\\'t met anyone from Flow Club IRL, but we still laugh, cry, work, and celebrate together. It\\'s just a magical, supportive place.\\n![](https://cdn.prod.website-files.com/602c0d03c082d985980c0fdd/63cb22a8993f00c84e308a55_sam-gardner.webp)\\n#### Samantha G.\\nFounder\\nFlow Club has been amazing for my ADHD. The body doubling concept really does work.\\nShow More\\n[Get Focused - free](https://www.flow.club/<https:/in.flow.club/>)\\n## How Flow Club Works\\n![](https://cdn.prod.website-files.com/602c0d03c082d985980c0fdd/62ffe9d8aad4ee64bff119c8_how-it-works-image-debrief%26celebrate.webp)\\n### Debrief & Celebrate\\nYour session host will check in with you and bring the positive vibes. Not everyone hits their goals, but everyone made progress. We celebrate that.\\n![](https://cdn.prod.website-files.com/602c0d03c082d985980c0fdd/6601d44827706941307b4b5c_howitworks-start.webp)\\n### Start _doing_\\nWhen the timer begins, the host will play focus-inducing music while everyone begins the muted, deep work segment. The music is optional, but doing your best to knock out the task at hand is not.\\n![](https://cdn.prod.website-files.com/602c0d03c082d985980c0fdd/62ffe9d72ea4f7d56b0b60f6_how-it-works-image-shareyourgoals.webp)\\n### Share your goals\\nThe simple act of sharing what you\\'re going to do with someone else sets up external accountability and increases the likelihood that you\\'ll get it done. \\n![](https://cdn.prod.website-files.com/602c0d03c082d985980c0fdd/62ffe9d8bbfeffc3f56e4dd6_how-it-works-image-showup.webp)\\n### Show up\\nWillpower is overrated. Instead, draft off the energy of other people who also care deeply about their work.\\n![](https://cdn.prod.website-files.com/602c0d03c082d985980c0fdd/6601d44807414fbd6906b68d_howitworks-book.webp)\\n### Book a session\\nResearch shows that you are more likely to achieve your goals when you pre-commit to it. \\n[try flow club free](https://www.flow.club/<https:/in.flow.club/>)\\n## The Power of Intentional Action\\nWe know it\\'s weird, but Flow Club virtual coworking helps align intention with action, and it really works\\n98%\\n97%\\nmembers report **professional** or **academic** improvement\\nmembers report increased ability to meet **personal obligations**\\n91%\\nmembers find it easier to **start** difficult tasks or projects\\n## \"I came for the productivity. What I found was a community.\"\\n### Our members\\nOn Flow Club, we are professional, supportive, and without judgement.\\n![](https://cdn.prod.website-files.com/602c0d03c082d985980c0fdd/6601d51729d05491badf975b_flowclubhosts.webp)![](https://cdn.prod.website-files.com/602c0d03c082d985980c0fdd/6601d3a78e1c50b122e79657_flow-club-hosts.webp)\\n![](https://cdn.prod.website-files.com/602c0d03c082d985980c0fdd/6601d51778969abd2021ec69_flowclubsession.webp)\\n### Our structure\\nSession agendas keep the session organized. See everyone else\\'s tasks. With visibility of the timer and one another, people find that they can magically get much of their work done.\\n[try flow club free](https://www.flow.club/<https:/in.flow.club/>)\\n## \"The latest work-from-home hack\" featured in\\n![](https://cdn.prod.website-files.com/602c0d03c082d985980c0fdd/62f44326b9b8313da230307e_logo-nyt.webp)![](https://cdn.prod.website-files.com/602c0d03c082d985980c0fdd/63f564c094999c3acf37c210_logo-cnn.svg)![](https://cdn.prod.website-files.com/602c0d03c082d985980c0fdd/675e5352947a86e702296842_wsjlogo.avif)![](https://cdn.prod.website-files.com/602c0d03c082d985980c0fdd/667c9fb25a03d3f52bc95c06_smithsonian-logo.svg)\\n![](https://cdn.prod.website-files.com/602c0d03c082d985980c0fdd/62f44326e54e01a93f6bfaf4_logo-computerworld.webp)![](https://cdn.prod.website-files.com/602c0d03c082d985980c0fdd/62f44327d0d9e12e1b9e9eaf_logo-slate.webp)![](https://cdn.prod.website-files.com/602c0d03c082d985980c0fdd/62f443250ae83fe95f6fdfc0_logo-fastcompany.webp)![](https://cdn.prod.website-files.com/602c0d03c082d985980c0fdd/667c9fb2f7428434784e1368_menshealthlogo.svg)\\n## Try A New Way To Finish Your Work\\nFlow Club combines popular methods that are shown to help with deep work focus and boost productivity, so you can spend less time working, and more time doing what you love.\\nThe primary concept is called body doubling. [What is body doubling?](https://www.flow.club/<https:/www.flow.club/blog/body-doubling-adhd>)\\n[Get Focused - Free](https://www.flow.club/<https:/in.flow.club/>)\\n![](https://cdn.prod.website-files.com/602c0d03c082d985980c0fdd/62cc151ed809bc5e69f11e40_baby%20doubling.svg)\\n#### Body Doubling\\nCo-action & positive social pressure increase task adherence & motivation\\n![](https://cdn.prod.website-files.com/602c0d03c082d985980c0fdd/667babcf80dcc8da3c453411_distractionfree.svg)\\n#### Distractability Delay\\nDistraction-free zones to delay impulsive attention shifts, sustaining your focus\\n![](https://cdn.prod.website-files.com/602c0d03c082d985980c0fdd/667c7fa20d58d26c1679efc6_Music.svg)\\n#### Music Stimulation\\nBinaural, lofi, or more—the right arousal levels for peak functioning\\n![](https://cdn.prod.website-files.com/602c0d03c082d985980c0fdd/62cc151f829834b2f4671117_clock.svg)\\n#### Activity Scheduling\\nStructured time blocking improves task initiation & override decision fatigue\\n![](https://cdn.prod.website-files.com/602c0d03c082d985980c0fdd/667babcf46480655b71f6079_dopaminerich.svg)\\n#### Dopaminergic Design\\nMotivating environment triggers dopamine release, boosting task engagement\\n![](https://cdn.prod.website-files.com/602c0d03c082d985980c0fdd/667c806be498f7180513299f_pomodoro.svg)\\n#### Pomodoro Technique\\nInterval work combats time blindness & prevent misdirected hyperfocus\\n![](https://cdn.prod.website-files.com/602c0d03c082d985980c0fdd/667babcf52383ed657e02404_judgmentfree.svg)\\n#### Supportive Community\\nSocial belonging activates intrinsic motivation, reinforcing goal commitment\\n## We\\'re Sure You Have Questions\\n#### What is Flow State?\\nFlow, as defined by Mihaly Csikszentmihalyi, a Professor of Psychology at Claremont Graduate University, is “a state in which people are so involved in an activity that nothing else seems to matter.” This heightened state of focus and productivity often distorts our perception of time, diminishes anxiety and ego, and fosters a sense of effortless action. It\\'s similar to what we frequently describe as being \"in the zone,\" characterized by a deep sense of immersion and peak performance.This concept of \"flow\" was first introduced to the broader scientific community by Csikszentmihalyi in 1990 through his seminal work, \"Flow: The Psychology of Optimal Experience\". In this publication, he articulated the essence of being in flow and its significant benefits. Not only does it boost productivity, but it also increases life satisfaction and promotes better mental wellbeing. The study of flow began with Csikszentmihalyi\\'s quest to identify the elements that lead to a life worth living, which you can hear about in his [TED Talk: Mihaly Csikszentmihalyi: Flow, the Secret to Happiness](https://www.flow.club/<https:/www.youtube.com/watch?v=fXIeFJCqsPs>).\\nAs modern knowledge workers, we rarely get to experience flow state. Even more elusive is the sense of progression and mastery of your work. When was the last time you felt accomplished? Do you feel like you are better than you were a month ago? The pursuit of flow state reminds us to asks these questions about the work we do everyday, and Flow Club is where we gather to do it.\\n#### How do I get in the flow?\\nWhile flow is a highly personal and subjective experience, researchers have identified conditions that can facilitate this positive state of being:• **Challenge-Skill Balance:** Choose activities that are just challenging enough for your skill level. Progress to bigger challenges as your skills expand. Mihaly Csikszentmihalyi provides two insightful graphs to help visualize where you should aim to be.\\n![Flow Channel](https://cdn.prod.website-files.com/602c0d03c082d985980c0fdd/60c3eb66f951c18b8b4b4969_ux-expert-flow-channel-01.webp)![](https://cdn.prod.website-files.com/602c0d03c082d985980c0fdd/64d16808db5b99e390235f54_flowstate.jpg)\\n• **Clear, Attainable Goals:** Have a clear understanding of what you need to accomplish. If your tasks seem too vague, refine them until they become more specific. If your tasks seem overwhelming, break them down into manageable pieces.• **Unambiguous Feedback:** You should know how well you’re doing as you’re doing it. Even with extensive and protracted tasks, set smaller milestones to help you gauge progress along the way.• **Time-based Goals:** When breaking down tasks or clarifying them proves difficult, use time-based goals rather than outcome-based goals. For example, if you\\'re facing a major task, such as writing a lengthy report without a clear plan, set a goal like \"write for 30 minutes.\" Make focusing for a specific period of time the goal itself.• **Follow Your Energy Level:** Pay attention to how your energy fluctuates throughout the day. Take advantage of the peak energy times to enhance your chances of achieving flow.• **Designate Time:** Schedule time to be in flow to block it out for yourself. Commit and let your brain prepare to fully immerse itself when the time arrives.• **Eliminate Distraction:** Before you start, eliminate any potential distractions. Place your phone out of reach and out of sight, close your room door, set your chat program to \"Do Not Disturb,” etc.• **Bring Intention:** Bring a heightened level of intention and determination. This could be as simple as taking a deep breath, focusing your gaze, or performing a brief ritual that helps you transition into a more concentrated state.• **Bring Personal Triggers:** Recognize and leverage personal triggers that help you enter the zone. These could be a cup of coffee, a specific playlist, or a notebook open to a particular page.• **Be In a Flow-Inducing Environment (eg Flow Club)** : Flow Club is a virtual environment designed to facilitate flow state that you can access any time, from anywhere. Some key features of an optimal flow-inducing environment include:- Encouraging risk-taking through peer accountability- Activating reward pathways to stimulate dopamine release- Offering soundtracks conducive to work- Inspiring awe and motivation- Providing a comfortable and supportive atmosphere\\n#### What are the benefits of Flow Club?\\nFlow Club creates the conditions to help facilitate flow state. It\\'s ultimately about improving mental fitness, feeling fulfilled at work and finding more time for life. The specific benefits you will experience include but are not limited to:• Sharpened focus• Minimized distractions• Manage symptoms of ADHD• Heightened intentionality and awareness of your work• Motivation on demand• More time for deep work, side pursuits, and life• Increased confidence through a sense of agency• Clearer delineation between work and rest• More restorative rest• Inspired company of peers and hosts• Lower stress and anxiety• More creativityWe hate BS too, and some of these things inevitably sound like BS. Best we can do now is to show you some testimonials, but you should stay skeptical and try it out for yourself. \\u200d[**See our Wall of Love**](https://www.flow.club/<https:/wall.shoutout.so/flowdotclub>)**.**\\n#### How do you know that your method works?\\nFlow Club’s method is based on the popular Pomodoro Technique, which millions of workers around the world practice on a daily basis. The Pomodoro Technique helps people overcome discomfort by working in small time increments of 25-minutes, followed by a 5-minute of break. In Flow Club, the most popular length of session is 50 minutes.\\u200dResearch shows that we put off work not because we are lazy or lack discipline. We do it to avoid negative feelings like overwhelm and uncertainty. We reach for distractions to soothe our negative feelings or busy work to help us feel productive. Instead, the Pomodoro Technique helps you focus by shrinking your goal down to the next few things you can do in the time allotted, making it easier for anyone to make real progress.Beyond the Pomodoro Technique, Flow Club is intentionally designed to facilitate flow state and overcome symptoms of ADHD. To learn more, read our post on [ADHD and Body Doubling.](https://www.flow.club/</adhd-body-doubling>)\\n#### Who are the hosts?\\nOur hosts are volunteers from the community. You can think of them as your primary accountability partner. Hosts help lead and give each session structure. They check in with you on your progress and bring their music and positivity to help propel you forward. You can become a host too after 10 sessions. You\\'ll love hosting because it makes you even more accountable and you feel great having held space to support others in the process.\\n#### Do I have to keep video on?\\nAs much as you can. Of course, if you need to turn off the camera, that’s okay. As a community, we keep our videos on to create an energetic virtual environment for each other while we work, like working at a cafe! This concept is actually called [body doubling](https://www.flow.club/<https:/www.flow.club/what-is-body-doubling?>) and is a useful technique for everyone to remain focused, present and reduce distractions.The video boxes are small, and no one is looking at you because everyone is focusing. In case things go wrong, we enforce our [community guidelines](https://www.flow.club/</community-guidelines>) to keep out bad behavior. \\n#### How much talking is required?\\nNot much at all because we gather to focus on getting stuff done. We share our goals and progress with each other to keep each other accountable, that’s all. If you prefer to not talk at all, there are non-verbal, chat-only options you can join.\\n#### How strict are your sessions’ rules?\\nTo get the most out of a session, we recommend joining for the check-in at the beginning because declaring your intention to the group makes you more likely to accomplish your goal. Most people tend to stay for the entire duration and keep their video on, because it is helpful to them to do so. Staying until the end and celebrating with everyone is an extra boost of dopamine that can give you some extra pep in your step for the rest of your day.Of course, if you need to join late, hop out early, or turn off video, that is completely fine with us. This is a tool that’s here to serve you, not the other way around.Our sessions provide the flexibility for you to:• Join at any time as long as you have booked the session in advance.• Turn your video on and off anytime.• Leave a chat message to your fellow attendees if you are joining late or jumping out early.• We also offer chat-only sessions, where there is no spoken/verbal interaction at all.\\u200d\\n#### I\\'m already productive working solo. How will Flow Club challenge me?\\nIn Flow Club you are still working solo. What Flow Club adds is a layer of structure and external accountability to help you push yourself a little harder. It’s the difference between working out at home by yourself and going to a workout class. You’ll find lots of high performers like yourself in Flow Club, and you’ll be surprised by how much more you get done.\\n#### How is it possible that strangers keep me accountable?\\nTo be clear, it’s still you who is keeping yourself accountable! There’s just no way around that. 🙂But, it’s also clear that we are social animals. Many people work better when they are in the presence of others. The host in the room asks each participant to share their goals out loud. The act of sharing and being visible to others creates enough energy for our members to get started and to follow through.For scientific research underpinning Flow Club\\'s experience design, see the [Science of Body Doubling](https://www.flow.club/</adhd-body-doubling>)\\n#### How should I prepare for Flow Club sessions?\\nTake a moment to think about what you need to do (anything goes — from drafting an important memo to cleaning your room), and then figure out the smallest first step you can take. Book a Flow Club to set aside time to work on it, and join the session from your computer with the intention of getting it done.\\n#### How is this different from video chat with friends?\\nFlow Club is a live, structured experience with specific choreography that is easy to participate and host in. As a member, you’ll find that it’s much, much easier than organizing your own group, whose members may or may not have the same commitment as you do.We\\'ve thought through details to help people focus and remove overwhelm:**Flow Club\\'s Schedule** Flow Club’s predictable schedule helps you create consistent daily routines. You can book ahead to help you block out time. **Norms around Accountability** Through the norm of sharing your to-do with your group and displaying your progress publicly, you use the group to hold yourself accountable.**Calendar Reminders** We send you a calendar invite so that you can make an appointment with yourself and others to remind you to show up. Your teammates will also respect your time because it appears as a meeting.\\u200d**To-do List** The To-do list doesn’t carry over, which helps you start fresh each time.**\\u200dSmall Videos** Videos help people feel present. We display them in limited width and height so that they aren\\'t overly distracting. Controls such as on/off toggles and background blur support your changing needs.**Optional Focus Music** Flow Club hosts play focus-friendly music in sessions to help cue your brain that this time and space is for work.\\n#### How much is Flow Club?\\nFlow Club is $40/mo or $400/year. We have 50% discounts for [students and non-profits](https://www.flow.club/<https:/help.flow.club/en/articles/879745>), and 50% discount for [hosting a qualified number of sessions](https://www.flow.club/<https:/help.flow.club/en/articles/783361>).\\n#### Can I get my company to pay for Flow Club?\\nYes, Flow Club usually fits under a co-working or wellness stipend. Here’s a [resource page](https://www.flow.club/<https:/www.notion.so/flowclub/How-to-get-Flow-Club-expensed-by-your-employer-674a236c21c446eda00e813736f4d685>) on how to ask.\\n#### Do you offer discounts to students and non-profits?\\nYes, we support full-time students and non-profit workers with a 50% discount. [Learn more](https://www.flow.club/<https:/help.flow.club/en/articles/879745>).\\n## Join the Club\\nTry Flow Club now for free.\\n[Get Focused - Free](https://www.flow.club/<https:/in.flow.club/>)\\n[![](https://cdn.prod.website-files.com/602c0d03c082d985980c0fdd/63ec168a82d4f3b07168478f_Flow%20Club-white.svg)](https://www.flow.club/<#>)\\nMade in Flow Club© Happy Rhinos Corporation 2025\\u200d\\n[ ](https://www.flow.club/<https:/www.linkedin.com/company/flow-club/>)\\n[ ](https://www.flow.club/<https:/www.x.com/flowdotclub>)\\n[ ](https://www.flow.club/<https:/www.youtube.com/@flowclub>)\\n[ ](https://www.flow.club/<https:/instagram.com/flowdotclub>)\\n  * COMMUNITY\\n  * [Meet Our Hosts](https://www.flow.club/<https:/in.flow.club/hosts/>)\\n  * [Host FAQs](https://www.flow.club/<https:/help.flow.club/en/categories/189185-becoming-a-flow-club-host>)\\n  * [Community Guidelines](https://www.flow.club/</community-guidelines>)[Hosting Guidelines](https://www.flow.club/</hosting-guidelines>)\\n  * [Blog](https://www.flow.club/</blog>)\\n  * [Wall of Love](https://www.flow.club/</wall-of-love>)\\n\\n\\n  * RESOURCES\\n  * [Pricing](https://www.flow.club/<https:/in.flow.club/plans/>)\\n  * [Help Center](https://www.flow.club/<https:/help.flow.club/>)\\n  * [Co-working for ADHD](https://www.flow.club/</coworking-for-adhd>)\\n  * [Body Doubling](https://www.flow.club/<https:/flow.club/blog/body-doubling-adhd>)\\n  * [ADHD Decluttering](https://www.flow.club/<https:/flow.club/decluttering-with-adhd>)\\n  * [Morning Routines](https://www.flow.club/</master-your-morning-routine>)\\n  * [Best Work Music](https://www.flow.club/</best-work-music>)\\n  * [Phone Free Hour](https://www.flow.club/<https:/www.phonefreehour.com>)\\n\\n\\n  * COMPANY\\n  * help@flow.club\\n  * [Privacy Policy](https://www.flow.club/</privacy-policy>)\\n  * [Cookie Policy](https://www.flow.club/</cookie-policy>)\\n  * [Terms and Conditions](https://www.flow.club/</terms-and-conditions>)\\n\\n\\n' markdown_with_citations='![⟨1⟩](https://www.flow.club/</>)\\nHow it Works⟨2⟩Member Login⟨3⟩try flow club free⟨4⟩\\n# Fight procrastination. Get your work done. Go have fun.\\nJoin committed folks in virtual coworking sessions designed to drop you into productive flow.\\nGet Focused - Free⟨4⟩\\n![Flow Club schedule⟨5⟩]![An image of a web browser with videos of people and a to-do list⟨6⟩]\\n## \"Combining the freedom of remote work with the extra focus that comes with someone else working nearby\" - **New York Times**\\n## Our Members\\n### 400+\\nHosts\\n### 🧠\\nSupporting Neurodivergence\\n### 94%\\nReport feeling supported in their productivity journey\\n![](https://cdn.prod.website-files.com/602c0d03c082d985980c0fdd/62cc467232fa34266132512e_Julie.webp)\\n#### Julie A.\\nUniversity Professor\\n**Friendly accountability and body doubling** turned out to be the two key things I needed to effectively manage my ADHD. Flow Club provides both of those.\\n![](https://cdn.prod.website-files.com/602c0d03c082d985980c0fdd/63cb1e66feacbc739ff38a31_ximena--ofxriTWLl2OqqCBYco6tPisARyE3.webp)\\n#### Ximena V.\\nGraduate student\\nJust having someone \"next\" to me doing their own thing is enough for me to focus. How body-doubling works is a mystery to me, but **I\\'ve achieved more in the few months I\\'ve been with Flow Club than I have in years.**\\n![](https://cdn.prod.website-files.com/602c0d03c082d985980c0fdd/63cb1a9327e7bcfb1be93484_biancawu--34oW6r5jH5dP5MWXgnlsZ8e9mO53.webp)\\n#### Bianca W.\\nFinancial Analyst\\nAs a chronic procrastinator who gets overwhelmed easily, I LOVE Flow Club. It’s the only thing that will have me not only start on tasks, but **finish them**.\\n![](https://cdn.prod.website-files.com/602c0d03c082d985980c0fdd/63cb1b7cd805d54d55d77fb8_alexs--lgL4kFqcBcNckkLdL7rgCJoD6x23.webp)\\n#### Alex S.\\nPoet and Writer\\nFlow Club somehow **brings the same support into my apartment as would a trusted friend** — while simultaneously giving me the freedom to interact as much or as little as I am up to on a given day. Magic!\\n![](https://cdn.prod.website-files.com/602c0d03c082d985980c0fdd/63cb1ef6fc84bb5c73d21d44_rana--U97pckoqKQdfqkN1SOGi9mjyczz1.webp)\\n#### Rana K.\\nDesigner\\nBefore joining, I felt lost and alone in my struggles. But through Flow Club, I have been able to connect with a community of people who understand my experiences and provide valuable support and resources.\\n![](https://cdn.prod.website-files.com/602c0d03c082d985980c0fdd/63cb1d8a5bb3eeb6a741458f_lesly--5j5jE6Yv8tRBUXiuhXVIgyUErL42.webp)\\n#### Lesly Q.\\nWriter, Learner, and Side Hustler\\nAs someone with ADHD, I work best when I’m around noise and people. Flow Club provides me with the feeling of social stimulation while I work.\\n![](https://cdn.prod.website-files.com/602c0d03c082d985980c0fdd/63cb20e5835384079a4d72d9_erin.webp)\\n#### Erin R.\\nFreelance Writer\\nSessions help me stay focused and productive by providing accountability, shared energy, and support.\\n![](https://cdn.prod.website-files.com/602c0d03c082d985980c0fdd/63d15ac8f9aa1648a501bbe8_anonymous.webp)\\n#### Anonymous Member\\nFlow Club gave me a self esteem boost that showed I wasn\\'t a time-wasting space cadet with my head in the clouds.\\n![](https://cdn.prod.website-files.com/602c0d03c082d985980c0fdd/63cb1cc5d7632ef4122c1431_janel-k.webp)\\n#### Janel K.\\nBusiness Development\\nI like that the interpersonal interactions are low-stakes and minimal - you don\\'t have to talk or be on camera if you don\\'t want to be.\\n![](https://cdn.prod.website-files.com/602c0d03c082d985980c0fdd/63cb1bebb62733e01c07f2cf_bethani--SyMwxQoHXyZOhGmrkLVYroeVfgD3.webp)\\n#### **Bethani L.**\\nCustomer Educator, Tech\\n**\\u200d** My fellow Flow Clubbers keep me accountable to my goals, and they also encourage me to take breaks and practice self-care. There are so many other ADHDers in Flow Club, and I feel like I\\'ve really found my people. I\\'ve haven\\'t met anyone from Flow Club IRL, but we still laugh, cry, work, and celebrate together. It\\'s just a magical, supportive place.\\n![](https://cdn.prod.website-files.com/602c0d03c082d985980c0fdd/63cb22a8993f00c84e308a55_sam-gardner.webp)\\n#### Samantha G.\\nFounder\\nFlow Club has been amazing for my ADHD. The body doubling concept really does work.\\nShow More\\nGet Focused - free⟨4⟩\\n## How Flow Club Works\\n![](https://cdn.prod.website-files.com/602c0d03c082d985980c0fdd/62ffe9d8aad4ee64bff119c8_how-it-works-image-debrief%26celebrate.webp)\\n### Debrief & Celebrate\\nYour session host will check in with you and bring the positive vibes. Not everyone hits their goals, but everyone made progress. We celebrate that.\\n![](https://cdn.prod.website-files.com/602c0d03c082d985980c0fdd/6601d44827706941307b4b5c_howitworks-start.webp)\\n### Start _doing_\\nWhen the timer begins, the host will play focus-inducing music while everyone begins the muted, deep work segment. The music is optional, but doing your best to knock out the task at hand is not.\\n![](https://cdn.prod.website-files.com/602c0d03c082d985980c0fdd/62ffe9d72ea4f7d56b0b60f6_how-it-works-image-shareyourgoals.webp)\\n### Share your goals\\nThe simple act of sharing what you\\'re going to do with someone else sets up external accountability and increases the likelihood that you\\'ll get it done. \\n![](https://cdn.prod.website-files.com/602c0d03c082d985980c0fdd/62ffe9d8bbfeffc3f56e4dd6_how-it-works-image-showup.webp)\\n### Show up\\nWillpower is overrated. Instead, draft off the energy of other people who also care deeply about their work.\\n![](https://cdn.prod.website-files.com/602c0d03c082d985980c0fdd/6601d44807414fbd6906b68d_howitworks-book.webp)\\n### Book a session\\nResearch shows that you are more likely to achieve your goals when you pre-commit to it. \\ntry flow club free⟨4⟩\\n## The Power of Intentional Action\\nWe know it\\'s weird, but Flow Club virtual coworking helps align intention with action, and it really works\\n98%\\n97%\\nmembers report **professional** or **academic** improvement\\nmembers report increased ability to meet **personal obligations**\\n91%\\nmembers find it easier to **start** difficult tasks or projects\\n## \"I came for the productivity. What I found was a community.\"\\n### Our members\\nOn Flow Club, we are professional, supportive, and without judgement.\\n![](https://cdn.prod.website-files.com/602c0d03c082d985980c0fdd/6601d51729d05491badf975b_flowclubhosts.webp)![](https://cdn.prod.website-files.com/602c0d03c082d985980c0fdd/6601d3a78e1c50b122e79657_flow-club-hosts.webp)\\n![](https://cdn.prod.website-files.com/602c0d03c082d985980c0fdd/6601d51778969abd2021ec69_flowclubsession.webp)\\n### Our structure\\nSession agendas keep the session organized. See everyone else\\'s tasks. With visibility of the timer and one another, people find that they can magically get much of their work done.\\ntry flow club free⟨4⟩\\n## \"The latest work-from-home hack\" featured in\\n![](https://cdn.prod.website-files.com/602c0d03c082d985980c0fdd/62f44326b9b8313da230307e_logo-nyt.webp)![](https://cdn.prod.website-files.com/602c0d03c082d985980c0fdd/63f564c094999c3acf37c210_logo-cnn.svg)![](https://cdn.prod.website-files.com/602c0d03c082d985980c0fdd/675e5352947a86e702296842_wsjlogo.avif)![](https://cdn.prod.website-files.com/602c0d03c082d985980c0fdd/667c9fb25a03d3f52bc95c06_smithsonian-logo.svg)\\n![](https://cdn.prod.website-files.com/602c0d03c082d985980c0fdd/62f44326e54e01a93f6bfaf4_logo-computerworld.webp)![](https://cdn.prod.website-files.com/602c0d03c082d985980c0fdd/62f44327d0d9e12e1b9e9eaf_logo-slate.webp)![](https://cdn.prod.website-files.com/602c0d03c082d985980c0fdd/62f443250ae83fe95f6fdfc0_logo-fastcompany.webp)![](https://cdn.prod.website-files.com/602c0d03c082d985980c0fdd/667c9fb2f7428434784e1368_menshealthlogo.svg)\\n## Try A New Way To Finish Your Work\\nFlow Club combines popular methods that are shown to help with deep work focus and boost productivity, so you can spend less time working, and more time doing what you love.\\nThe primary concept is called body doubling. What is body doubling?⟨7⟩\\nGet Focused - Free⟨4⟩\\n![](https://cdn.prod.website-files.com/602c0d03c082d985980c0fdd/62cc151ed809bc5e69f11e40_baby%20doubling.svg)\\n#### Body Doubling\\nCo-action & positive social pressure increase task adherence & motivation\\n![](https://cdn.prod.website-files.com/602c0d03c082d985980c0fdd/667babcf80dcc8da3c453411_distractionfree.svg)\\n#### Distractability Delay\\nDistraction-free zones to delay impulsive attention shifts, sustaining your focus\\n![](https://cdn.prod.website-files.com/602c0d03c082d985980c0fdd/667c7fa20d58d26c1679efc6_Music.svg)\\n#### Music Stimulation\\nBinaural, lofi, or more—the right arousal levels for peak functioning\\n![](https://cdn.prod.website-files.com/602c0d03c082d985980c0fdd/62cc151f829834b2f4671117_clock.svg)\\n#### Activity Scheduling\\nStructured time blocking improves task initiation & override decision fatigue\\n![](https://cdn.prod.website-files.com/602c0d03c082d985980c0fdd/667babcf46480655b71f6079_dopaminerich.svg)\\n#### Dopaminergic Design\\nMotivating environment triggers dopamine release, boosting task engagement\\n![](https://cdn.prod.website-files.com/602c0d03c082d985980c0fdd/667c806be498f7180513299f_pomodoro.svg)\\n#### Pomodoro Technique\\nInterval work combats time blindness & prevent misdirected hyperfocus\\n![](https://cdn.prod.website-files.com/602c0d03c082d985980c0fdd/667babcf52383ed657e02404_judgmentfree.svg)\\n#### Supportive Community\\nSocial belonging activates intrinsic motivation, reinforcing goal commitment\\n## We\\'re Sure You Have Questions\\n#### What is Flow State?\\nFlow, as defined by Mihaly Csikszentmihalyi, a Professor of Psychology at Claremont Graduate University, is “a state in which people are so involved in an activity that nothing else seems to matter.” This heightened state of focus and productivity often distorts our perception of time, diminishes anxiety and ego, and fosters a sense of effortless action. It\\'s similar to what we frequently describe as being \"in the zone,\" characterized by a deep sense of immersion and peak performance.This concept of \"flow\" was first introduced to the broader scientific community by Csikszentmihalyi in 1990 through his seminal work, \"Flow: The Psychology of Optimal Experience\". In this publication, he articulated the essence of being in flow and its significant benefits. Not only does it boost productivity, but it also increases life satisfaction and promotes better mental wellbeing. The study of flow began with Csikszentmihalyi\\'s quest to identify the elements that lead to a life worth living, which you can hear about in his TED Talk: Mihaly Csikszentmihalyi: Flow, the Secret to Happiness⟨8⟩.\\nAs modern knowledge workers, we rarely get to experience flow state. Even more elusive is the sense of progression and mastery of your work. When was the last time you felt accomplished? Do you feel like you are better than you were a month ago? The pursuit of flow state reminds us to asks these questions about the work we do everyday, and Flow Club is where we gather to do it.\\n#### How do I get in the flow?\\nWhile flow is a highly personal and subjective experience, researchers have identified conditions that can facilitate this positive state of being:• **Challenge-Skill Balance:** Choose activities that are just challenging enough for your skill level. Progress to bigger challenges as your skills expand. Mihaly Csikszentmihalyi provides two insightful graphs to help visualize where you should aim to be.\\n![Flow Channel⟨9⟩]![](https://cdn.prod.website-files.com/602c0d03c082d985980c0fdd/64d16808db5b99e390235f54_flowstate.jpg)\\n• **Clear, Attainable Goals:** Have a clear understanding of what you need to accomplish. If your tasks seem too vague, refine them until they become more specific. If your tasks seem overwhelming, break them down into manageable pieces.• **Unambiguous Feedback:** You should know how well you’re doing as you’re doing it. Even with extensive and protracted tasks, set smaller milestones to help you gauge progress along the way.• **Time-based Goals:** When breaking down tasks or clarifying them proves difficult, use time-based goals rather than outcome-based goals. For example, if you\\'re facing a major task, such as writing a lengthy report without a clear plan, set a goal like \"write for 30 minutes.\" Make focusing for a specific period of time the goal itself.• **Follow Your Energy Level:** Pay attention to how your energy fluctuates throughout the day. Take advantage of the peak energy times to enhance your chances of achieving flow.• **Designate Time:** Schedule time to be in flow to block it out for yourself. Commit and let your brain prepare to fully immerse itself when the time arrives.• **Eliminate Distraction:** Before you start, eliminate any potential distractions. Place your phone out of reach and out of sight, close your room door, set your chat program to \"Do Not Disturb,” etc.• **Bring Intention:** Bring a heightened level of intention and determination. This could be as simple as taking a deep breath, focusing your gaze, or performing a brief ritual that helps you transition into a more concentrated state.• **Bring Personal Triggers:** Recognize and leverage personal triggers that help you enter the zone. These could be a cup of coffee, a specific playlist, or a notebook open to a particular page.• **Be In a Flow-Inducing Environment (eg Flow Club)** : Flow Club is a virtual environment designed to facilitate flow state that you can access any time, from anywhere. Some key features of an optimal flow-inducing environment include:- Encouraging risk-taking through peer accountability- Activating reward pathways to stimulate dopamine release- Offering soundtracks conducive to work- Inspiring awe and motivation- Providing a comfortable and supportive atmosphere\\n#### What are the benefits of Flow Club?\\nFlow Club creates the conditions to help facilitate flow state. It\\'s ultimately about improving mental fitness, feeling fulfilled at work and finding more time for life. The specific benefits you will experience include but are not limited to:• Sharpened focus• Minimized distractions• Manage symptoms of ADHD• Heightened intentionality and awareness of your work• Motivation on demand• More time for deep work, side pursuits, and life• Increased confidence through a sense of agency• Clearer delineation between work and rest• More restorative rest• Inspired company of peers and hosts• Lower stress and anxiety• More creativityWe hate BS too, and some of these things inevitably sound like BS. Best we can do now is to show you some testimonials, but you should stay skeptical and try it out for yourself. \\u200d**See our Wall of Love**⟨10⟩**.**\\n#### How do you know that your method works?\\nFlow Club’s method is based on the popular Pomodoro Technique, which millions of workers around the world practice on a daily basis. The Pomodoro Technique helps people overcome discomfort by working in small time increments of 25-minutes, followed by a 5-minute of break. In Flow Club, the most popular length of session is 50 minutes.\\u200dResearch shows that we put off work not because we are lazy or lack discipline. We do it to avoid negative feelings like overwhelm and uncertainty. We reach for distractions to soothe our negative feelings or busy work to help us feel productive. Instead, the Pomodoro Technique helps you focus by shrinking your goal down to the next few things you can do in the time allotted, making it easier for anyone to make real progress.Beyond the Pomodoro Technique, Flow Club is intentionally designed to facilitate flow state and overcome symptoms of ADHD. To learn more, read our post on ADHD and Body Doubling.⟨11⟩\\n#### Who are the hosts?\\nOur hosts are volunteers from the community. You can think of them as your primary accountability partner. Hosts help lead and give each session structure. They check in with you on your progress and bring their music and positivity to help propel you forward. You can become a host too after 10 sessions. You\\'ll love hosting because it makes you even more accountable and you feel great having held space to support others in the process.\\n#### Do I have to keep video on?\\nAs much as you can. Of course, if you need to turn off the camera, that’s okay. As a community, we keep our videos on to create an energetic virtual environment for each other while we work, like working at a cafe! This concept is actually called body doubling⟨12⟩ and is a useful technique for everyone to remain focused, present and reduce distractions.The video boxes are small, and no one is looking at you because everyone is focusing. In case things go wrong, we enforce our community guidelines⟨13⟩ to keep out bad behavior. \\n#### How much talking is required?\\nNot much at all because we gather to focus on getting stuff done. We share our goals and progress with each other to keep each other accountable, that’s all. If you prefer to not talk at all, there are non-verbal, chat-only options you can join.\\n#### How strict are your sessions’ rules?\\nTo get the most out of a session, we recommend joining for the check-in at the beginning because declaring your intention to the group makes you more likely to accomplish your goal. Most people tend to stay for the entire duration and keep their video on, because it is helpful to them to do so. Staying until the end and celebrating with everyone is an extra boost of dopamine that can give you some extra pep in your step for the rest of your day.Of course, if you need to join late, hop out early, or turn off video, that is completely fine with us. This is a tool that’s here to serve you, not the other way around.Our sessions provide the flexibility for you to:• Join at any time as long as you have booked the session in advance.• Turn your video on and off anytime.• Leave a chat message to your fellow attendees if you are joining late or jumping out early.• We also offer chat-only sessions, where there is no spoken/verbal interaction at all.\\u200d\\n#### I\\'m already productive working solo. How will Flow Club challenge me?\\nIn Flow Club you are still working solo. What Flow Club adds is a layer of structure and external accountability to help you push yourself a little harder. It’s the difference between working out at home by yourself and going to a workout class. You’ll find lots of high performers like yourself in Flow Club, and you’ll be surprised by how much more you get done.\\n#### How is it possible that strangers keep me accountable?\\nTo be clear, it’s still you who is keeping yourself accountable! There’s just no way around that. 🙂But, it’s also clear that we are social animals. Many people work better when they are in the presence of others. The host in the room asks each participant to share their goals out loud. The act of sharing and being visible to others creates enough energy for our members to get started and to follow through.For scientific research underpinning Flow Club\\'s experience design, see the Science of Body Doubling⟨11⟩\\n#### How should I prepare for Flow Club sessions?\\nTake a moment to think about what you need to do (anything goes — from drafting an important memo to cleaning your room), and then figure out the smallest first step you can take. Book a Flow Club to set aside time to work on it, and join the session from your computer with the intention of getting it done.\\n#### How is this different from video chat with friends?\\nFlow Club is a live, structured experience with specific choreography that is easy to participate and host in. As a member, you’ll find that it’s much, much easier than organizing your own group, whose members may or may not have the same commitment as you do.We\\'ve thought through details to help people focus and remove overwhelm:**Flow Club\\'s Schedule** Flow Club’s predictable schedule helps you create consistent daily routines. You can book ahead to help you block out time. **Norms around Accountability** Through the norm of sharing your to-do with your group and displaying your progress publicly, you use the group to hold yourself accountable.**Calendar Reminders** We send you a calendar invite so that you can make an appointment with yourself and others to remind you to show up. Your teammates will also respect your time because it appears as a meeting.\\u200d**To-do List** The To-do list doesn’t carry over, which helps you start fresh each time.**\\u200dSmall Videos** Videos help people feel present. We display them in limited width and height so that they aren\\'t overly distracting. Controls such as on/off toggles and background blur support your changing needs.**Optional Focus Music** Flow Club hosts play focus-friendly music in sessions to help cue your brain that this time and space is for work.\\n#### How much is Flow Club?\\nFlow Club is $40/mo or $400/year. We have 50% discounts for students and non-profits⟨14⟩, and 50% discount for hosting a qualified number of sessions⟨15⟩.\\n#### Can I get my company to pay for Flow Club?\\nYes, Flow Club usually fits under a co-working or wellness stipend. Here’s a resource page⟨16⟩ on how to ask.\\n#### Do you offer discounts to students and non-profits?\\nYes, we support full-time students and non-profit workers with a 50% discount. Learn more⟨14⟩.\\n## Join the Club\\nTry Flow Club now for free.\\nGet Focused - Free⟨4⟩\\n![⟨17⟩](https://www.flow.club/<#>)\\nMade in Flow Club© Happy Rhinos Corporation 2025\\u200d\\n ⟨18⟩\\n ⟨19⟩\\n ⟨20⟩\\n ⟨21⟩\\n  * COMMUNITY\\n  * Meet Our Hosts⟨22⟩\\n  * Host FAQs⟨23⟩\\n  * Community Guidelines⟨13⟩Hosting Guidelines⟨24⟩\\n  * Blog⟨25⟩\\n  * Wall of Love⟨26⟩\\n\\n\\n  * RESOURCES\\n  * Pricing⟨27⟩\\n  * Help Center⟨28⟩\\n  * Co-working for ADHD⟨29⟩\\n  * Body Doubling⟨30⟩\\n  * ADHD Decluttering⟨31⟩\\n  * Morning Routines⟨32⟩\\n  * Best Work Music⟨33⟩\\n  * Phone Free Hour⟨34⟩\\n\\n\\n  * COMPANY\\n  * help@flow.club\\n  * Privacy Policy⟨35⟩\\n  * Cookie Policy⟨36⟩\\n  * Terms and Conditions⟨37⟩\\n\\n\\n' references_markdown='\\n\\n## References\\n\\n⟨1⟩ https://cdn.prod.website-files.com/602c0d03c082d985980c0fdd/63c0cabbf341f3128e97c672_Flow%20Club.svg: ![\\n⟨2⟩ https://www.flow.club/</how-it-works>: How it Works\\n⟨3⟩ https://www.flow.club/<https:/in.flow.club/login>: Member Login\\n⟨4⟩ https://www.flow.club/<https:/in.flow.club/>: try flow club free\\n⟨5⟩ https://cdn.prod.website-files.com/602c0d03c082d985980c0fdd/6601da34602c434d47d4d3fc_flowclubschedule.webp: Flow Club schedule\\n⟨6⟩ https://cdn.prod.website-files.com/602c0d03c082d985980c0fdd/6601d3a607414fbd690626cd_flow-club-schedule.webp: An image of a web browser with videos of people and a to-do list\\n⟨7⟩ https://www.flow.club/<https:/www.flow.club/blog/body-doubling-adhd>: What is body doubling?\\n⟨8⟩ https://www.flow.club/<https:/www.youtube.com/watch?v=fXIeFJCqsPs>: TED Talk: Mihaly Csikszentmihalyi: Flow, the Secret to Happiness\\n⟨9⟩ https://cdn.prod.website-files.com/602c0d03c082d985980c0fdd/60c3eb66f951c18b8b4b4969_ux-expert-flow-channel-01.webp: Flow Channel\\n⟨10⟩ https://www.flow.club/<https:/wall.shoutout.so/flowdotclub>: **See our Wall of Love**\\n⟨11⟩ https://www.flow.club/</adhd-body-doubling>: ADHD and Body Doubling.\\n⟨12⟩ https://www.flow.club/<https:/www.flow.club/what-is-body-doubling?>: body doubling\\n⟨13⟩ https://www.flow.club/</community-guidelines>: community guidelines\\n⟨14⟩ https://www.flow.club/<https:/help.flow.club/en/articles/879745>: students and non-profits\\n⟨15⟩ https://www.flow.club/<https:/help.flow.club/en/articles/783361>: hosting a qualified number of sessions\\n⟨16⟩ https://www.flow.club/<https:/www.notion.so/flowclub/How-to-get-Flow-Club-expensed-by-your-employer-674a236c21c446eda00e813736f4d685>: resource page\\n⟨17⟩ https://cdn.prod.website-files.com/602c0d03c082d985980c0fdd/63ec168a82d4f3b07168478f_Flow%20Club-white.svg: ![\\n⟨18⟩ https://www.flow.club/<https:/www.linkedin.com/company/flow-club/>:  \\n⟨19⟩ https://www.flow.club/<https:/www.x.com/flowdotclub>:  \\n⟨20⟩ https://www.flow.club/<https:/www.youtube.com/@flowclub>:  \\n⟨21⟩ https://www.flow.club/<https:/instagram.com/flowdotclub>:  \\n⟨22⟩ https://www.flow.club/<https:/in.flow.club/hosts/>: Meet Our Hosts\\n⟨23⟩ https://www.flow.club/<https:/help.flow.club/en/categories/189185-becoming-a-flow-club-host>: Host FAQs\\n⟨24⟩ https://www.flow.club/</hosting-guidelines>: Hosting Guidelines\\n⟨25⟩ https://www.flow.club/</blog>: Blog\\n⟨26⟩ https://www.flow.club/</wall-of-love>: Wall of Love\\n⟨27⟩ https://www.flow.club/<https:/in.flow.club/plans/>: Pricing\\n⟨28⟩ https://www.flow.club/<https:/help.flow.club/>: Help Center\\n⟨29⟩ https://www.flow.club/</coworking-for-adhd>: Co-working for ADHD\\n⟨30⟩ https://www.flow.club/<https:/flow.club/blog/body-doubling-adhd>: Body Doubling\\n⟨31⟩ https://www.flow.club/<https:/flow.club/decluttering-with-adhd>: ADHD Decluttering\\n⟨32⟩ https://www.flow.club/</master-your-morning-routine>: Morning Routines\\n⟨33⟩ https://www.flow.club/</best-work-music>: Best Work Music\\n⟨34⟩ https://www.flow.club/<https:/www.phonefreehour.com>: Phone Free Hour\\n⟨35⟩ https://www.flow.club/</privacy-policy>: Privacy Policy\\n⟨36⟩ https://www.flow.club/</cookie-policy>: Cookie Policy\\n⟨37⟩ https://www.flow.club/</terms-and-conditions>: Terms and Conditions\\n' fit_markdown='' fit_html=''",
  "generated_description": "Flow Club is carving out a unique space in the world of remote work by offering a virtual co-working community designed to maximize productivity through high-intensity work sprints. Founded in 2020 and part of Y Combinator’s Summer Batch 2021, Flow Club aims to tackle one of the biggest challenges of the modern work landscape: the isolation of remote work.\n\n### Mission & Vision\nAt its core, Flow Club is driven by a mission to create an inspiring and productive environment for knowledge workers, allowing individuals to tap into deep, focused flow. They envision a world where anyone, anywhere can access a supportive work environment, breaking the solitude that often comes with independent and remote work.\n\n### How It Works\nFlow Club sessions are intentionally structured to kickstart productivity. During these sessions, members work in a shared virtual environment, often employing techniques like **body doubling**, where the mere presence of others increases focus and accountability. Each session includes goal sharing, muted work periods with focus-inducing music, and celebration of progress, even if goals aren’t fully achieved. The backbone of their methodology is grounded in proven productivity techniques like the Pomodoro Technique, which encourages focused work intervals followed by breaks.\n\n### Community Impact\nFlow Club is more than just a productivity tool; it fosters a vibrant community where 94% of members report feeling supported in their productivity journeys. Testimonials from users, which they have lovingly dubbed their \"Wall of Love,\" highlight increased accountability, connection, and an enriched sense of accomplishment. \n\n### Growth & Support\nIn its short lifespan, Flow Club has already garnered significant attention, raising $5 million in funding from notable investors, including Dropbox’s founders and Paul Graham of Y Combinator. The company employs a small but dedicated team of six from its base in San Francisco. \n\n### For Everyone\nFlow Club's offerings extend to a broad audience, especially neurodivergent individuals seeking a structured yet flexible work environment. They even offer discounts for students and non-profits, ensuring that access to productivity-enhancing tools is available to all.\n\n### Conclusion\nIn essence, Flow Club is positioning itself as a cornerstone for individuals seeking a more intentional and community-oriented approach to work. Their emphasis on fun, focus, and meaningful connections may well make them a go-to solution for anyone grappling with the challenges of remote productivity. If you want to see their approach in action, check out their offerings [here](https://www.flow.club)."
}