{
  "links": "https://www.ycombinator.com/companies/flower-co",
  "name": "FLOWER CO.",
  "headline": "FLOWER CO. sells weed on the internet.",
  "batch": "W19",
  "description": "We sell weed on the internet. We're a vertically integrated legal cannabis company delivering next-day in Los Angeles, Long Beach, San Francisco, East Bay, Marin, Humboldt, Sacramento, and Vallejo. We're venture-backed and growing exponentially.",
  "activity_status": "Active",
  "website": "https://flowercompany.com",
  "founded_date": 2019.0,
  "team_size": 30.0,
  "location": "Los Angeles, CA",
  "group_partner": null,
  "group_partner_yc": null,
  "company_linkedin": null,
  "company_twitter": null,
  "tags": "industry:e-commerce; industry:cannabis; location:los-angeles",
  "founders": [],
  "status": true,
  "markdown": "raw_markdown=\"# 403 ERROR\\n## The request could not be satisfied.\\nThe Amazon CloudFront distribution is configured to block access from your country. We can't connect to the server for this app or website at this time. There might be too much traffic or a configuration error. Try again later, or contact the app or website owner. If you provide content to customers through CloudFront, you can find steps to troubleshoot and help prevent this error by reviewing the CloudFront documentation. ```\\nGenerated by cloudfront (CloudFront)\\nRequest ID: VGwNPhAqvfjb-lT322neYcpHZzn-LMH_QSKz-LzHbMByW7klLKaKSA==\\n\\n```\\n\\n\" markdown_with_citations=\"# 403 ERROR\\n## The request could not be satisfied.\\nThe Amazon CloudFront distribution is configured to block access from your country. We can't connect to the server for this app or website at this time. There might be too much traffic or a configuration error. Try again later, or contact the app or website owner. If you provide content to customers through CloudFront, you can find steps to troubleshoot and help prevent this error by reviewing the CloudFront documentation. ```\\nGenerated by cloudfront (CloudFront)\\nRequest ID: VGwNPhAqvfjb-lT322neYcpHZzn-LMH_QSKz-LzHbMByW7klLKaKSA==\\n\\n```\\n\\n\" references_markdown='\\n\\n## References\\n\\n' fit_markdown='' fit_html=''",
  "generated_description": "**Company Overview: Flower Co.**\n\n**Mission:**  \nFlower Co. is on a straightforward mission: to sell weed on the internet. They aim to streamline the cannabis purchasing experience with a focus on user-friendliness and reliability.\n\n**Founding and Background:**  \nFounded in 2019 as part of Y Combinator’s W19 batch, Flower Co. emerged as a vertically integrated legal cannabis company. Situated in Los Angeles, California, they capitalize on California’s legal framework to deliver cannabis products efficiently. Their services currently cover a broad swath of the state, including bustling areas like San Francisco and Long Beach, offering next-day delivery to many regions.\n\n**Growth and Scale:**  \nThe company has seen exponential growth, driven by their focus on e-commerce and a growing consumer base eager for legal cannabis options. With a team of around 30 employees, they’re agile enough to adapt to the fast-paced cannabis market while maintaining robust operational capabilities.\n\n**Investment:**  \nWith backing from venture capital, Flower Co. is poised to expand further, capitalizing on the increasing acceptance of cannabis across the nation. \n\n**Tags:**  \nThey’re categorized under 'e-commerce' and 'cannabis,' spotlighting their dual focus on innovative sales strategies and the expanding cannabis market.\n\n**Website:**  \nFor more information, you can visit their website at [flowercompany.com](https://flowercompany.com).\n\nIn essence, Flower Co. represents the new wave of cannabis commerce, integrating technology and product accessibility in a manner that resonates with today’s consumers."
}