{
  "links": "https://www.ycombinator.com/companies/focal-2",
  "name": "Focal",
  "headline": "AI-powered compliance operations for banks and fintechs",
  "batch": "S24",
  "description": "Focal enables f to effectively leverage AI to automate traditionally manual workflows. Our initial focus is geared towards helping financial institutions automate compliance, risk, and dispute operations.",
  "activity_status": "Active",
  "website": "https://usefocal.ai",
  "founded_date": 2024.0,
  "team_size": 2.0,
  "location": "San Francisco",
  "group_partner": "Michael Seibel",
  "group_partner_yc": "https://www.ycombinator.com/people/michael-seibel",
  "company_linkedin": null,
  "company_twitter": null,
  "tags": "industry:artificial-intelligence; industry:fintech; industry:saas; industry:b2b; industry:operations; location:san-francisco-bay-area",
  "founders": [
    {
      "name": "Ray Morgan, CEO / Co-Founder",
      "description": "Ray is the CEO of Focal, building AI automation for enterprise companies.\n\nBefore Focal, Ray spent 10 years at Stripe leading and scaling the core payments engineering teams (<$10B payments volume to well over $100B a year), launching new products (Stripe Issuing, new payment methods), and worked on Stripe’s enterprise readiness efforts to enable enterprise accounts like Amazon. Prior to Stripe, Ray started a company that got acquired by Ebay and led the frontend engineering team at Zappos.",
      "linkedin": "https://www.linkedin.com/in/raycmorgan/"
    },
    {
      "name": "Katia Bazzi, Co-Founder",
      "description": "Katia is the CTO of Focal, building AI automation for enterprises. \n\nPreviously, Katia was an engineering leader at Stripe -- there, she launched new financial products such as credit cards and banking as a service, processing >$6B per year. Before that, she led engineering teams at a distributed tracing startup (Lightstep) and Eventbrite after graduating from CMU.",
      "linkedin": "https://www.linkedin.com/in/katiabazzi/"
    }
  ],
  "status": true,
  "markdown": "raw_markdown='![](https://framerusercontent.com/images/sUWdgTO6nSnwOIZMLHQHWIp1pic.svg)\\n##### Focal\\nContact us\\n# AI for financial institutions\\n## AI for financial institutions\\nBacked by \\n![](https://framerusercontent.com/images/7PRU1RZvlQFzjgmqXEbyK0fkDMU.png)\\n![](https://framerusercontent.com/images/EK3Yy4ASRhyDQWvOxMQnxZVBN3I.png?scale-down-to=2048)\\nFocal automates repetitive operations for enterprises – initially targeting banks and fintechs.\\nTo handle the increasing burdens of risk and compliance, financial institutions are using more humans than ever to manually review activities. These operational efforts aren’t keeping up with the demands of the business, fraud schemes, and regulatory environment.\\nWe saw these challenges first hand at Stripe where good accounts are erroneously frozen, while bad accounts generate losses and brand risk. Thousands of humans are the last line of defense and have to navigate hundreds of complex review types, oftentimes leading to low quality decisions, long handle times, or both.\\nThe challenge has always been that these tasks, while usually well defined for humans, don’t map well to traditional software. AI changes that, unlocking the ability to shift a large portion of these processes into software. \\nFocal integrates with your existing work queues. Focal learns your custom playbooks, and through browser automation, integrating with your data sources, working with customers, and making common sense judgements, it collects all the needed information for human agents to make key decisions while also eliminating mistakes.\\nFocal adapts with your business - your operations teams can iterate their processes, and Focal will follow their lead, enabling them to truly scale themselves.\\nFocal is founded by [Ray Morgan](https://usefocal.ai/<https:/www.linkedin.com/in/raycmorgan/>), who led payments engineering at Stripe as it grew from $5B in volume to over $500B, and [Katia Bazzi](https://usefocal.ai/<https:/www.linkedin.com/in/katiabazzi/>) who led multiple new Stripe products such as Issuing and Banking. Focal is backed by General Catalyst and Y Combinator (S24).\\n© Focal Inc. 2024\\n[Terms of Service](https://usefocal.ai/<./terms-of-service>)\\n[Privacy Policy](https://usefocal.ai/<./privacy-policy>)\\n[Trust Center](https://usefocal.ai/<https:/app.vanta.com/usefocal.ai/trust/pvpcgy5rtljds8srfb4avj>)\\n' markdown_with_citations='![](https://framerusercontent.com/images/sUWdgTO6nSnwOIZMLHQHWIp1pic.svg)\\n##### Focal\\nContact us\\n# AI for financial institutions\\n## AI for financial institutions\\nBacked by \\n![](https://framerusercontent.com/images/7PRU1RZvlQFzjgmqXEbyK0fkDMU.png)\\n![](https://framerusercontent.com/images/EK3Yy4ASRhyDQWvOxMQnxZVBN3I.png?scale-down-to=2048)\\nFocal automates repetitive operations for enterprises – initially targeting banks and fintechs.\\nTo handle the increasing burdens of risk and compliance, financial institutions are using more humans than ever to manually review activities. These operational efforts aren’t keeping up with the demands of the business, fraud schemes, and regulatory environment.\\nWe saw these challenges first hand at Stripe where good accounts are erroneously frozen, while bad accounts generate losses and brand risk. Thousands of humans are the last line of defense and have to navigate hundreds of complex review types, oftentimes leading to low quality decisions, long handle times, or both.\\nThe challenge has always been that these tasks, while usually well defined for humans, don’t map well to traditional software. AI changes that, unlocking the ability to shift a large portion of these processes into software. \\nFocal integrates with your existing work queues. Focal learns your custom playbooks, and through browser automation, integrating with your data sources, working with customers, and making common sense judgements, it collects all the needed information for human agents to make key decisions while also eliminating mistakes.\\nFocal adapts with your business - your operations teams can iterate their processes, and Focal will follow their lead, enabling them to truly scale themselves.\\nFocal is founded by Ray Morgan⟨1⟩, who led payments engineering at Stripe as it grew from $5B in volume to over $500B, and Katia Bazzi⟨2⟩ who led multiple new Stripe products such as Issuing and Banking. Focal is backed by General Catalyst and Y Combinator (S24).\\n© Focal Inc. 2024\\nTerms of Service⟨3⟩\\nPrivacy Policy⟨4⟩\\nTrust Center⟨5⟩\\n' references_markdown='\\n\\n## References\\n\\n⟨1⟩ https://usefocal.ai/<https:/www.linkedin.com/in/raycmorgan/>: Ray Morgan\\n⟨2⟩ https://usefocal.ai/<https:/www.linkedin.com/in/katiabazzi/>: Katia Bazzi\\n⟨3⟩ https://usefocal.ai/<./terms-of-service>: Terms of Service\\n⟨4⟩ https://usefocal.ai/<./privacy-policy>: Privacy Policy\\n⟨5⟩ https://usefocal.ai/<https:/app.vanta.com/usefocal.ai/trust/pvpcgy5rtljds8srfb4avj>: Trust Center\\n' fit_markdown='' fit_html=''",
  "generated_description": "Focal is a fresh player in the fintech landscape, jumping onto the scene in 2024. Located in San Francisco and part of the Y Combinator Batch S24, the company is poised to reshape how banks and fintechs handle compliance operations using AI.\n\n**Mission and Vision**  \nFocal’s mission is straightforward yet ambitious: to automate compliance, risk, and dispute operations for financial institutions. The founders, Ray Morgan and Katia Bazzi, both former Stripe executives, witnessed firsthand the inefficiencies in manual reviews cutting across the banking sector. They’re tackling a pressing challenge that many in finance face—balancing human resources against increasing demands from fraud, regulatory scrutiny, and operational inefficiencies.\n\n**The Problem**  \nAs the regulatory landscape grows more complex, financial institutions are relying heavily on human reviewers to comb through activities. This not only leads to slow turnaround times but also increases the likelihood of errors. Often, good accounts get falsely flagged, while harmful ones slip through the cracks. Focal aims to change this by integrating AI into these workflows, reducing reliance on humans for tasks that, while clearly defined, don’t necessarily translate well to traditional software solutions.\n\n**How It Works**  \nFocal automates repetitive tasks while seamlessly integrating with existing operational frameworks. It learns from a business's unique playbooks and employs browser automation to collect critical information from various sources. This not only aids human agents in making informed decisions but helps eliminate common errors—effectively streamlining operations and boosting efficiency.\n\n**Founders and Support**  \nRay Morgan, who led payments engineering at Stripe as it ballooned from $5 billion to over $500 billion in volume, and Katia Bazzi, who was instrumental in launching several new Stripe products, lead Focal. They’re supported by notable backers like General Catalyst and Y Combinator, which signals strong confidence in their vision.\n\nIn essence, Focal is not just another tech startup; it’s addressing real pain points in financial operations with cutting-edge solutions aimed at transforming compliance processes from cumbersome to streamlined. With a small team of just two but a big idea, they’re set to make waves in the financial industry. For more details, you can visit their [website](https://usefocal.ai)."
}