{
  "links": "https://www.ycombinator.com/companies/forfeit",
  "name": "Forfeit",
  "headline": "An app that takes your money if you don't complete your habits.",
  "batch": "W23",
  "description": "Say what you're going to do, when you're going to do it, and how much money you'll forfeit if you don't do it. Send photo or timelapse evidence of you completing the habit by the time you set, or we take your money.\r\n\nEg, I could set it to go to the gym (or meditate for 30 mins, or take a photo of a sent email, or of a max amount of calories on MyFitnessPal) tomorrow at 6am, or lose $30. If I don't send photo evidence in the gym (that we manually approve), I lose $30.",
  "activity_status": "Active",
  "website": "https://www.forfeit.app/",
  "founded_date": 2022.0,
  "team_size": 2.0,
  "location": "New York",
  "group_partner": "Dalton Caldwell",
  "group_partner_yc": "https://www.ycombinator.com/people/dalton-caldwell",
  "company_linkedin": null,
  "company_twitter": null,
  "tags": "industry:mental-health-tech; industry:consumer; industry:fitness; industry:productivity; industry:digital-health; location:new-york",
  "founders": [
    {
      "name": "Josh Mitchell, Founder",
      "description": "Grew up in a village near Manchester, England. Was really into building 3D printers/CNC machines as a kid, went to Stanford for 2 years, and dropped out to do YC.",
      "linkedin": "https://www.linkedin.com/in/josh-mitchell-252b2a182/"
    },
    {
      "name": "Eddie Raven, Founder",
      "description": "Went straight into industry as a software engineer after graduating high school. Now working on Forfeit.",
      "linkedin": "https://www.linkedin.com/in/eddie-raven-1a7b6a24b/"
    }
  ],
  "status": true,
  "markdown": "raw_markdown='[![](https://cdn.prod.website-files.com/602cf455f72a961cfec0c783/610c98b94f41dc7298415cb9_IconAndLogo.png)](https://www.forfeit.app/<#>)\\n[How does it work?](https://www.forfeit.app/<#Content>)\\n[FAQ](https://www.forfeit.app/<#FAQ>)\\n[Log In](https://www.forfeit.app/<http:/account.forfeit.app/login>)\\n# Forfeit.\\nSay what you\\'re going to do, when you\\'re going to do it, and how much money you lose if you don\\'t do it. Send evidence of you completing your task before the deadline, or we take your money.Backed by\\nComplete your habits,or lose money.\\nSet what you\\'re going to do, when you\\'re doing to do it, and how much money you\\'ll lose if you don\\'t do it. If you don\\'t submit evidence by the deadline, you fail.\\n![](https://cdn.prod.website-files.com/602cf455f72a961cfec0c783/6462c65e453d12c36872c49b_BackedByYC.png)\\n[](https://www.forfeit.app/<https:/apps.apple.com/us/app/forfeit-do-it-or-donate/id1633125787>)\\n[](https://www.forfeit.app/<https:/play.google.com/store/apps/details?id=app.forfeit.forfeit>)\\n![](https://cdn.prod.website-files.com/602cf455f72a961cfec0c783/634094c898f0f615c6402033_ezgif.com-gif-maker%20\\\\(13\\\\).gif)\\n[](https://www.forfeit.app/<https:/apps.apple.com/us/app/forfeit-do-it-or-donate/id1633125787>)\\n[](https://www.forfeit.app/<https:/play.google.com/store/apps/details?id=app.forfeit.forfeit>)\\n# A note on card details.\\nDue to Apple\\'s restrictions, you must add card details through our website. You can\\'t add them through the app.\\n371k\\nForfeits set\\n$4.7M\\nUSD staked\\n94.2%\\nSuccess rate\\n— Testimonials\\n## Don\\'t take our word for it\\n#### “If it had existed 25 years ago my life would\\'ve had a completely different trajectory”\\nThis app has literally changed my life. I 100 percent believe that if it had existed 25 years ago my life would have had a completely different trajectory. I\\'m so grateful to the makers of this app who have allowed me to reach levels of productivity and growth in ways that I previously only dreamed of. Now I don\\'t need to worry about the ebbing and flowing of willpower. I\\'m stronger, fitter, making better food choices and generally getting more done in life. The app keeps me on track and from falling off the bandwagon. It allows you to have flexibility to tailor your goals and makes them achievable with the different percentages of compliance you can set and the number of days you want to hold yourself accountable. In the few short months I have been using it, have seen it evolve rapidly with new integrations being released all the time that make the app even less of an effort to use and update. I can\\'t stop raving about it to my friends and family and am sure I will continue to use it forever.\\nThis app has literally changed my life. I 100 percent believe that if it had existed 25 years ago my life would have had a completely different trajectory. I\\'m so grateful to the makers of this app who have allowed me to reach levels of productivity and growth in ways that I previously only dreamed of. I can\\'t stop raving about it to my friends and family and am sure I will continue to use it forever.\\n##### Zane, USA 🇺🇸\\n#### “Never been in such good shape in all the domains of my life”\\nBefore Forfeit, I was a serial habit breaker. I was unable to maintain routines for more than three weeks even though I tried EVERYTHING. But this app revolutionized my approach. Be it: Daily cold baths and meditation, working out five times a week, becoming top 4% in codewars, consistently studying, cleaning my house regularly. Forfeit turned my aspirations into tangible habits. The secret? Accountability to strangers and financial stakes. I transformed into a disciplined individual. And now, I\\'m not just in the best shape of my life and mentally healthy. No, I\\'m also progressing every day and confident in my ability to achieve anything. To those considering Forfeit, it\\'s a life-changer. It turns \\'someday\\' into \\'today\\', pushing you to do right by yourself, motivation aside.\\nBefore Forfeit, I was a serial habit breaker. I was unable to maintain routines for more than three weeks even though I tried EVERYTHING. But this app revolutionized my approach. Be it: Daily cold baths and meditation, working out five times a week, becoming top 4% in codewars, consistently studying, cleaning my house regularly. Forfeit turned my aspirations into tangible habits. The secret? Accountability to strangers and financial stakes. I transformed into a disciplined individual. And now, I\\'m not just in the best shape of my life and mentally healthy. No, I\\'m also progressing every day and confident in my ability to achieve anything. To those considering Forfeit, it\\'s a life-changer. It turns \\'someday\\' into \\'today\\', pushing you to do right by yourself, motivation aside.\\n##### Brice, Austria 🇦🇹\\n#### “Foundation that enables all changes”\\nForfeit was a step change in my career. Working remotely, I had vague boundaries between personal life and work, and frequent cycles of \"boom and bust\" procrastination followed by last-minute crunching. Neither were terribly enjoyable, and I implicitly limited the kinds of opportunities I\\'d even shoot for to things where I had such a good margin that I knew I wouldn\\'t drop the ball. Since I started using Forfeit a few months ago, I\\'ve been having crisp, full-time work hours, productive when I\\'m on and guiltlessly relaxed when I\\'m off. I\\'ve said yes to and pulled off opportunities I wouldn\\'t have dared to earlier. I can commit to things and _know_ I\\'ll deliver, not just to others but to _myself_ , and earning back that self-trust is the best, and priceless, part. Forfeit is one of many internal and external changes that I\\'ve been compounding into this (personally _and_ financially) much healthier routine, but it\\'s the foundation that enables them all.\\n##### Helder, Brazil 🇧🇷\\n#### “It sounds a little hyperbolic to say an app is life changing, but Forfeit truly is”\\nIt sounds a little hyperbolic to say an app is life changing, but Forfeit truly is. It\\'s remarkable what you can accomplish when willpower is no longer a barrier. Never before have I been so consistent with all those hard things that I want to do. I\\'m well on my way to being the fittest I\\'ve ever been, and feeling in charge of my life like never before. It\\'s a secret weapon - if only I had this app 5 years ago!\\n##### Oliver, UK 🇬🇧\\n#### “Forfeit is a monster of an app”\\nOutsource your executive function: Forfeit is a monster of an app. Force yourself to do things that are important but not urgent by making submitting proof urgent. Submitting timelapses for proof is KICKASS. I’m so much more focused with the timelapse is recording vs when I just have a task scheduled in my calendar. I love that I can play audiobooks and podcasts seamlessly or swap to my meditation app while recording timelapses of completing routines. Super flexible with options for how often you have to submit proof (like 85% of the time or 6 days a week). The app is clean looking and intuitive. You even get confetti for submitting proof. New features in the works like \\'failed forfeit $ goes to your friend\\' \\'failed forfeit $ goes to your selected charity\\' are going to be game changers. I work from home on my small business and I’m always looking for ways to make myself more consistent and this one rules. Best I have ever done with going to bed on time and updating bullet journal metrics every day.\\n##### Devi, USA 🇺🇸\\n#### “Been hunting for an app like this for years now”\\nSIMPLE yet POWERFUL: Been hunting for an app like this for years now. As a busy entrepreneur w ADHD & many life improvement goals (both big & small), I’ve been often plagued by tasks I promised myself to do falling by the wayside. Often, this is because they lack any \\'skin in the game\\', so to speak. This app helps you implement a straightforward accountability & penalty system. I absolutely love that you won’t lose countless hours trying to figure out some complicated system. The fact that an actual HUMAN BEING rather than some machine is on the other side validating or contesting your submitted proof adds a clear & motivating dimension for sticking to your word. I also love that the brains and support team behind this app are so easily accessible and responsive. They’ve helped me figure out so much as well as met me halfway in fine-tuning my more complex goals. You can easily see the ongoing improvements and upgrades and I’ve been impressed by their commitment to & unwavering belief in the app’s concept/mission. I highly recommend Forfeit.\\n##### Raj, USA 🇺🇸\\n#### “Forfeit is a lifesaver”\\nForfeit is a lifesaver. Finally, a commitment device that works! You have real skin in the game—you forfeit real money if you fail to complete your task, and you must upload proof that you have accomplished the task you set for yourself. No more sudden spurts of motivation leading to false promises and abandoned attempts at self-improvement. Now, every time l decide on a goal, my first step will be to set a Forfeit. This way, I know I will actually put the time in—or suffer the consequences.\\n##### Igor, USA 🇺🇸\\n#### “Forfeit is the holy grail”\\nForfeit has helped me stay more focused and productive. I have looked long and hard for things to help my procrastinating problem and held me accountable, and Forfeit is the holy grail. It\\'s reliable and trustworthy, I don\\'t think twice before setting a forfeit. Very thankful.\\n##### Camila, USA 🇺🇸\\n#### “REAL game changer”\\nForfeit has been a REAL game changer for me in achieving a number of goals! Here is just one example: before, I was sending pictures at 6AM at the gym to my best friend, as a way of getting me up early & work out. He was doing the same thing. But over time, we started\"cutting ourselves some slack\" (ie. chicken out and making excuses, and accepting the other ones\\' excuses in return). Forfeit isn\\'t having any of this BS. When I say that I\\'m gonna send a picture everyday at 6AM for one month, I have no choice but to do so (if I set Forfeit on \"hard\" mode). This feature alone has made a big impact on my life, and I haven\\'t even tested all the integrations with Apple Health, MyFitnessPal yet.\\n##### Robin, France 🇫🇷\\n#### \"60th percentile -> 90th percentile... primarily because of Forfeit\"\\nMade a comeback from a rank of 29000 (60th percentile) to a rank of 5000 (90th percentile) in IndianMedical Residency entrance exams in 2.5 months; after my biggest support-my grandma passed away. It was possible primarily because of Forfeit. Love how the verification system literally pays very close attention & prevents cheating. Surprises me everyday as I keep discovering more consistency & potential in myself via Forfeit. A must use especially for the procrastinators!\\n##### Shruti, India 🇮🇳\\n#### \"The progress I\\'ve made with this app is unbelieveable\"\\nI struggle with BPD and Bipolar Disorder which can sometimes lead to me not wanting to take my medicine, but not anymore!! This app has helped me make consistent progress in not only taking my medicine every day but helping me to meditate, go to sleep on time, and do homework! The progress I’ve made with this app is unbelievable and I can’t thank the creators enough.\"\\n##### Jax, USA 🇺🇸\\n#### “96% success rate on 118 forfeits”\\nForfeit is the accountability check that I have wanted in my life for a long time now: to check that I am getting to the gym, clearing my inbox, and cleaning my room. It doesn\\'t take much - all of my forfeits have only risked losing a dollar - but I have found it to be a tangible way of being held up to the standards that I want to hold for myself. All told, I have had 118 forfeits in the past month (my first month of heavy use) and I have had a 96% success rate. I currently have $74 on the line and am continuing to find better ways to use this simple yet powerful tool.\\n##### Gabriel, USA 🇺🇸\\n#### \"Most important app of my life\"\\nThis is the most important app of my life at the moment. I struggle a lot with not being focused in the moment. I have a lot of well intentioned and well laid out plans, but will power in the moment of execution, or distractions during execution have been my biggest blockers. If you are like me, then this is the app for you. The basic construct is very simple, you pay if you can\\'t meet your own goal. But you can plan your entire life around this construct — from dieting to getting the productivity you want daily, to committing to a daily process, to getting enough workout daily, to whatever you want to get done. \\n##### Ankur, USA 🇺🇸\\n#### \"Forfeit really helped me achieve this qualification\"\\nIn years of trying to overcome procrastination, ADHD symptoms, and lack of motivation, l\\'ve learnt that telling myself I\\'ll do something just doesn\\'t work, or doesn\\'t work reliably enough to stop me worrying about whether or not I might forget to do it or get round to doing it. Forfeit removes that. I just have to do it and prove that I\\'ve done it. It works. I used the Timelapse function on Forfeit to complete academic reading 5 days a week for a postgraduate course, and set Forfeits for word count milestones for my assignments. I had a lot going on in life while studying, but Forfeit really helped me achieve this qualification and score a distinction. I also use Forfeit to help me get enough sleep, get exercise, and minimise my social media consumption. Thanks Forfeit team!\\n##### Ro, UK 🇬🇧\\n#### “Usually never write reviews... life changing!”\\nBye Procrastination!: I usually never write reviews but I just downloaded this app this week and it’s been life-changing! I’m a huge procrastinator and I’ve been looking for so many apps to stop me from doing so and this is the one! So to all my procrastinators this is the app that will do the job, unless if you’re up for losing money.\\n##### Sėtāyęśh, Unknown 🌎\\n#### \"Given me a sense of self control I thought I had lost\"\\nThis app has given me a sense of self control I thought I had lost. It\\'s both the least restrictive and most effective tool I have used curb the effects of phone addiction.\\n##### Anonymous, Unknown 🌎\\n#### “I can say with confidence that it works”\\nWhere has this been all my life? As someone with severe ADHD, basic habits have always been a big struggle. I\\'ve tried so many things. Checklists, reminders, alarms, novelty, etc. Nothing would keep me on track. I\\'ve been using forfeit for a few weeks now and I can say with confidence that it works. Never before have I washed my face so consistently, all because the looming threat of losing money is the motivation and accountability I needed but never had. Thank you so much.\\n##### Connor, USA 🇺🇸\\n#### \"I\\'ve been trying to be a disciplined person all my life... Forfeit solved this for me\"\\nI\\'ve been using this app almost since it first came out, but especially for the last 4 months l\\'ve been using the time lapse feature. I\\'ve been trying to be a disciplined person all my life, but there was always a problem somewhere. Forfeit solved this problem for me. As a graduate student and even as someone who is trying to make other habits permanent, it has been game changer to me.\\n##### Alp, Turkey 🇹🇷\\n#### \"Basically makes it impossible not to do the habit\"\\nForfeit helped me to finally stick to habits like waking up early and working out everyday. It basically makes it impossible not to do the habit if you put enough money on the line. Its truly a life changing app.\\n##### Marcelo, Brazil 🇧🇷\\n— Testimonials\\n## Don\\'t take our word for it\\n#### “Never been in such good shape in all the domains of my life”\\nBefore Forfeit, I was a serial habit breaker. I was unable to maintain routines for more than three weeks even though I tried EVERYTHING. But this app revolutionized my approach. Be it: Daily cold baths and meditation, working out five times a week, becoming top 4% in codewars, consistently studying, cleaning my house regularly. Forfeit turned my aspirations into tangible habits. The secret? Accountability to strangers and financial stakes. I transformed into a disciplined individual. And now, I\\'m not just in the best shape of my life and mentally healthy. No, I\\'m also progressing every day and confident in my ability to achieve anything. To those considering Forfeit, it\\'s a life-changer. It turns \\'someday\\' into \\'today\\', pushing you to do right by yourself, motivation aside.\\nBefore Forfeit, I was a serial habit breaker. I was unable to maintain routines for more than three weeks even though I tried EVERYTHING. But this app revolutionized my approach. Be it: Daily cold baths and meditation, working out five times a week, becoming top 4% in codewars, consistently studying, cleaning my house regularly. Forfeit turned my aspirations into tangible habits. The secret? Accountability to strangers and financial stakes. I transformed into a disciplined individual. And now, I\\'m not just in the best shape of my life and mentally healthy. No, I\\'m also progressing every day and confident in my ability to achieve anything. To those considering Forfeit, it\\'s a life-changer. It turns \\'someday\\' into \\'today\\', pushing you to do right by yourself, motivation aside.\\n##### Brice, Austria 🇦🇹\\n#### “Foundation that enables all changes”\\nForfeit was a step change in my career. Working remotely, I had vague boundaries between personal life and work, and frequent cycles of \"boom and bust\" procrastination followed by last-minute crunching. Neither were terribly enjoyable, and I implicitly limited the kinds of opportunities I\\'d even shoot for to things where I had such a good margin that I knew I wouldn\\'t drop the ball. Since I started using Forfeit a few months ago, I\\'ve been having crisp, full-time work hours, productive when I\\'m on and guiltlessly relaxed when I\\'m off. I\\'ve said yes to and pulled off opportunities I wouldn\\'t have dared to earlier. I can commit to things and _know_ I\\'ll deliver, not just to others but to _myself_ , and earning back that self-trust is the best, and priceless, part. Forfeit is one of many internal and external changes that I\\'ve been compounding into this (personally _and_ financially) much healthier routine, but it\\'s the foundation that enables them all.\\n##### Helder, Brazil 🇧🇷\\n#### “If it had existed 25 years ago my life would\\'ve had a completely different trajectory”\\nThis app has literally changed my life. I 100 percent believe that if it had existed 25 years ago my life would have had a completely different trajectory. I\\'m so grateful to the makers of this app who have allowed me to reach levels of productivity and growth in ways that I previously only dreamed of. Now I don\\'t need to worry about the ebbing and flowing of willpower. I\\'m stronger, fitter, making better food choices and generally getting more done in life. The app keeps me on track and from falling off the bandwagon. It allows you to have flexibility to tailor your goals and makes them achievable with the different percentages of compliance you can set and the number of days you want to hold yourself accountable. In the few short months I have been using it, have seen it evolve rapidly with new integrations being released all the time that make the app even less of an effort to use and update. I can\\'t stop raving about it to my friends and family and am sure I will continue to use it forever.\\nThis app has literally changed my life. I 100 percent believe that if it had existed 25 years ago my life would have had a completely different trajectory. Now I don\\'t need to worry about the ebbing and flowing of willpower. I\\'m stronger, fitter, making better food choices and generally getting more done in life. The app keeps me on track and from falling off the bandwagon. In the few short months I have been using it, have seen it evolve rapidly with new integrations being released all the time that make the app even less of an effort to use and update. I can\\'t stop raving about it to my friends and family and am sure I will continue to use it forever.\\n##### Zane, USA 🇺🇸\\n#### “It sounds a little hyperbolic to say an app is life changing, but Forfeit truly is”\\nIt sounds a little hyperbolic to say an app is life changing, but Forfeit truly is. It\\'s remarkable what you can accomplish when willpower is no longer a barrier. Never before have I been so consistent with all those hard things that I want to do. I\\'m well on my way to being the fittest I\\'ve ever been, and feeling in charge of my life like never before. It\\'s a secret weapon - if only I had this app 5 years ago!\\n##### Oliver, UK 🇬🇧\\n#### “Forfeit is a monster of an app”\\nOutsource your executive function: Forfeit is a monster of an app. Force yourself to do things that are important but not urgent by making submitting proof urgent. Submitting timelapses for proof is KICKASS. I’m so much more focused with the timelapse is recording vs when I just have a task scheduled in my calendar. Super flexible with options for how often you have to submit proof (like 85% of the time or 6 days a week). The app is clean looking and intuitive. I work from home on my small business and I’m always looking for ways to make myself more consistent and this one rules. Best I have ever done with going to bed on time and updating bullet journal metrics every day.\\n##### Devi, USA 🇺🇸\\n#### “Been hunting for an app like this for years now”\\nSIMPLE yet POWERFUL: Been hunting for an app like this for years now. As a busy entrepreneur w ADHD & many life improvement goals (both big & small), I’ve been often plagued by tasks I promised myself to do falling by the wayside. Often, this is because they lack any \\'skin in the game\\', so to speak. This app helps you implement a straightforward accountability & penalty system. I absolutely love that you won’t lose countless hours trying to figure out some complicated system. The fact that an actual HUMAN BEING rather than some machine is on the other side validating or contesting your submitted proof adds a clear & motivating dimension for sticking to your word. I also love that the brains and support team behind this app are so easily accessible and responsive. They’ve helped me figure out so much as well as met me halfway in fine-tuning my more complex goals.\\n##### Raj, USA 🇺🇸\\n#### “Forfeit is a lifesaver”\\nForfeit is a lifesaver. Finally, a commitment device that works! You have real skin in the game—you forfeit real money if you fail to complete your task, and you must upload proof that you have accomplished the task you set for yourself. No more sudden spurts of motivation leading to false promises and abandoned attempts at self-improvement. Now, every time l decide on a goal, my first step will be to set a Forfeit. This way, I know I will actually put the time in—or suffer the consequences.\\n##### Igor, USA 🇺🇸\\n#### “Forfeit is the holy grail”\\nForfeit has helped me stay more focused and productive. I have looked long and hard for things to help my procrastinating problem and held me accountable, and Forfeit is the holy grail. It\\'s reliable and trustworthy, I don\\'t think twice before setting a forfeit. Very thankful.\\n##### Camila, USA 🇺🇸\\n#### “REAL game changer”\\nForfeit has been a REAL game changer for me in achieving a number of goals! Here is just one example: before, I was sending pictures at 6AM at the gym to my best friend, as a way of getting me up early & work out. He was doing the same thing. But over time, we started\"cutting ourselves some slack\" (ie. chicken out and making excuses, and accepting the other ones\\' excuses in return). Forfeit isn\\'t having any of this BS. When I say that I\\'m gonna send a picture everyday at 6AM for one month, I have no choice but to do so (if I set Forfeit on \"hard\" mode). This feature alone has made a big impact on my life, and I haven\\'t even tested all the integrations with Apple Health, MyFitnessPal yet.\\n##### Robin, France 🇫🇷\\n#### \"60th percentile -> 90th percentile... primarily because of Forfeit\"\\nMade a comeback from a rank of 29000 (60th percentile) to a rank of 5000 (90th percentile) in IndianMedical Residency entrance exams in 2.5 months; after my biggest support-my grandma passed away. It was possible primarily because of Forfeit. Love how the verification system literally pays very close attention & prevents cheating. Surprises me everyday as I keep discovering more consistency & potential in myself via Forfeit. A must use especially for the procrastinators!\\n##### Shruti, India 🇮🇳\\n#### \"The progress I\\'ve made with this app is unbelieveable\"\\nI struggle with BPD and Bipolar Disorder which can sometimes lead to me not wanting to take my medicine, but not anymore!! This app has helped me make consistent progress in not only taking my medicine every day but helping me to meditate, go to sleep on time, and do homework! The progress I’ve made with this app is unbelievable and I can’t thank the creators enough.\"\\n##### Jax, USA 🇺🇸\\n#### “96% success rate on 118 forfeits”\\nForfeit is the accountability check that I have wanted in my life for a long time now: to check that I am getting to the gym, clearing my inbox, and cleaning my room. It doesn\\'t take much - all of my forfeits have only risked losing a dollar - but I have found it to be a tangible way of being held up to the standards that I want to hold for myself. All told, I have had 118 forfeits in the past month (my first month of heavy use) and I have had a 96% success rate. I currently have $74 on the line and am continuing to find better ways to use this simple yet powerful tool.\\n##### Gabriel, USA 🇺🇸\\n#### \"Most important app of my life\"\\nThis is the most important app of my life at the moment. I struggle a lot with not being focused in the moment. I have a lot of well intentioned and well laid out plans, but will power in the moment of execution, or distractions during execution have been my biggest blockers. If you are like me, then this is the app for you. The basic construct is very simple, you pay if you can\\'t meet your own goal. But you can plan your entire life around this construct — from dieting to getting the productivity you want daily, to committing to a daily process, to getting enough workout daily, to whatever you want to get done. \\n##### Ankur, USA 🇺🇸\\n#### \"Forfeit really helped me achieve this qualification\"\\nIn years of trying to overcome procrastination, ADHD symptoms, and lack of motivation, l\\'ve learnt that telling myself I\\'ll do something just doesn\\'t work, or doesn\\'t work reliably enough to stop me worrying about whether or not I might forget to do it or get round to doing it. Forfeit removes that. I just have to do it and prove that I\\'ve done it. It works. I used the Timelapse function on Forfeit to complete academic reading 5 days a week for a postgraduate course, and set Forfeits for word count milestones for my assignments. I had a lot going on in life while studying, but Forfeit really helped me achieve this qualification and score a distinction. I also use Forfeit to help me get enough sleep, get exercise, and minimise my social media consumption. Thanks Forfeit team!\\n##### Ro, UK 🇬🇧\\n#### “Usually never write reviews... life changing!”\\nBye Procrastination!: I usually never write reviews but I just downloaded this app this week and it’s been life-changing! I’m a huge procrastinator and I’ve been looking for so many apps to stop me from doing so and this is the one! So to all my procrastinators this is the app that will do the job, unless if you’re up for losing money.\\n##### Sėtāyęśh, Unknown 🌎\\n#### \"Given me a sense of self control I thought I had lost\"\\nThis app has given me a sense of self control I thought I had lost. It\\'s both the least restrictive and most effective tool I have used curb the effects of phone addiction.\\n##### Anonymous, Unknown 🌎\\n#### “I can say with confidence that it works”\\nWhere has this been all my life? As someone with severe ADHD, basic habits have always been a big struggle. I\\'ve tried so many things. Checklists, reminders, alarms, novelty, etc. Nothing would keep me on track. I\\'ve been using forfeit for a few weeks now and I can say with confidence that it works. Never before have I washed my face so consistently, all because the looming threat of losing money is the motivation and accountability I needed but never had. Thank you so much.\\n##### Connor, USA 🇺🇸\\n#### \"I\\'ve been trying to be a disciplined person all my life... Forfeit solved this for me\"\\nI\\'ve been using this app almost since it first came out, but especially for the last 4 months l\\'ve been using the time lapse feature. I\\'ve been trying to be a disciplined person all my life, but there was always a problem somewhere. Forfeit solved this problem for me. As a graduate student and even as someone who is trying to make other habits permanent, it has been game changer to me.\\n##### Alp, Turkey 🇹🇷\\n#### \"Basically makes it impossible not to do the habit\"\\nForfeit helped me to finally stick to habits like waking up early and working out everyday. It basically makes it impossible not to do the habit if you put enough money on the line. Its truly a life changing app.\\n##### Marcelo, Brazil 🇧🇷\\n# How does it work?\\n[Photo](https://www.forfeit.app/<#w-tabs-0-data-w-pane-0>)[Timelapse](https://www.forfeit.app/<#w-tabs-0-data-w-pane-1>)[Apple Health](https://www.forfeit.app/<#w-tabs-0-data-w-pane-2>)[Web Tracking](https://www.forfeit.app/<#w-tabs-0-data-w-pane-3>)[Self-Verify](https://www.forfeit.app/<#w-tabs-0-data-w-pane-4>)[GPS](https://www.forfeit.app/<#w-tabs-0-data-w-pane-5>)\\n### Set a Photo Forfeit.\\nSet the description of the photo that you need to send in by a certain time, how much money you\\'ll lose if you don\\'t send it, and what time it needs to be submitted by.\\n### Submit photo evidence.\\nSend the photo of what you said you were going to do, before the deadline.\\n### GPT/a human will verify it.\\nOnce submitted, GPT4 Vision will verify it. If it isn\\'t certain, or if it thinks it\\'s wrong, it will be sent to a human verifier. If the evidence doesn\\'t match the description, you lose your money.\\n### Set a timelapse Forfeit.\\nSet the description of the photo that you need to send in by a certain time, how much money you\\'ll lose if you don\\'t send it, and what time it needs to be submitted by. Eg, \"30 mins meditation\".\\n### Submit evidence.\\nSend a timelapse of what you said you were going to do, before the deadline.\\n### GPT will verify it.\\nGPT4 Vision will analyse your timelapse, and it it can\\'t immediately approve it, it\\'ll get sent to a human verifier.\\n### Set your Apple Health threshold.\\nSet what Apple Health Marker you\\'d like to track, and select whether you\\'d like to be above of below it, and the deadline for when it should be checked.\\n### Sync to Apple Health\\nThousands of apps sync to Apple Health - select whichever one you use, and turn on Apple Health sync for it in settings.\\n### Forfeit will auto-verify.\\nTrack your workout/meditation like you would in your usual app, and it\\'ll automatically approve it. No need to check back into the app!\\n### Install Rescuetime on PC/Mac/Android.\\nInstall Rescuetime, a web/Android tracking tool. Create a free account, and sync it in app.\\n### Set your limits on your websites/apps.\\nSet the websites, desktop apps, or Android apps that you want to either set a limit on (eg, \"max 30 mins on youtube.com\") or minimal time (eg, \"at least 2hrs on XCode\"), and how much you\\'ll lose if you don\\'t complete this.\\n### Stay beneath the limits.\\nStay beneath the limit (or, surpass it if it\\'s a minimal time), and this will automatically sync to Forfeit. No check-in needed.\\n### Set a self-verify Forfeit.\\nSet the description of the task that you want to complete.\\n### If you did it, approve it.\\nSimply check whethere you did it or you didn\\'t. No evidence needed!\\n### If you didn\\'t, deny it.\\nThis is on your word.\\n### Set the GPS location.\\nSet the location on a map, what time you want to be there by, and how much you\\'ll forfeit if you fail.\\n### Before the deadline, check in.\\nSimply enter the 100m radius of the location that you previously set, and click \"Check In\". If you don\\'t do this in time, you fail.\\n### Appeal if something comes up.\\nCar won\\'t start? Still sore from last workout? Forgot to submit?Set how lenient you want Forfeit to be, and ensure you never fail if it\\'s not your fault.\\n### Fits to your schedule.\\nChoose to submit the forfeit: • X days/week (ie, 3 times each week) • Above a certain percentage of the time (eg, 33% of the time) • Only on specific days (eg, Monday, Wednesday, Friday)\\n### Adjustable leniency.\\nKnow you\\'ll try and weasel out? Set your leniency mode. • Lenient mode: We accept any appeals. • Normal mode: We require evidence. • Hard mode: No appeals, ever.\\n### Something comes up? Appeal it.\\nYou\\'ll never fail if it\\'s not your fault. Humans review each appeal.\\n### Fits to your schedule.\\nSubmit forfeits 3 days a week, or 90% of the time, or only on weekdays.\\n### We can be as tough or as lenient as you want.\\nKnow you\\'ll try and weasel out? No appeals will be accepted. Trust yourself? We\\'ll accept anything given a reason.\\n# Sync to anything\\nWe\\'ll draw data from your favourite apps, and ensure you complete your goals.\\n![](https://cdn.prod.website-files.com/602cf455f72a961cfec0c783/6567e89ffcc1e5e6b1df0ec7_Group%201000000816fitness.svg)\\n![](https://cdn.prod.website-files.com/602cf455f72a961cfec0c783/6567e8d113f0c00c4cca3662_Group%201000000817mindfulness.svg)\\n![](https://cdn.prod.website-files.com/602cf455f72a961cfec0c783/6567e8e1d250dd7ed9ab6b7b_Group%201000000818sleepandweight.svg)\\n## FAQ\\nHow does Forfeit work?\\nThe app works by having you set \"Forfeits\", or tasks you want to complete by a certain time. If you don\\'t submit proof that you\\'ve completed the task on time, we take your money.\\nHow are Forfeits verified?\\nEach Forfeit is verified by either GPT4o, a human, or by drawing data from Apple Health, iOS Screen Time, checking in with GPS, or RescueTime.\\u200dIf your Forfeit remotely matches your description, we\\'ll approve it. Ie, if your description is \"myself at the gym\", and you send a photo of a set of weights, we\\'ll approve it. If you find yourself cheating yourself, and sending a photo of your weight set at home, specify the name of the gym (ie, \"Gold\\'s Gym\"), or a specific object that is only found at the gym. It\\'s easy to get the hang of!\\nWhat goals or tasks can Forfeit help me stick to?\\nForfeit works for pretty much anything you\\'d want to do, but just can\\'t stick to.\\u200dHere is a short list of some possible ones:- **Waking up on time** (eg, a photo of your toothbrush).- **Working out** (eg, a photo inside a gym).- **Reading** (eg, a timelapse of yourself reading for 30 minutes).- **Meditating** (eg, a timelapse of you meditating, any meditation app that syncs with Apple Health).- **Running** (eg, a photo of you in your running shoes outside).- **Finishing an essay on time** (eg, a photo of your essay submitted on your student portal).- **Walking the dog in the morning** (eg, a photo of your dog on a park trail).- **Doing laundry** (eg, a photo of your laundry in the washer).- **Getting to work on time** (eg, check in with GPS at your work location).\\nHow does the Screen Time integration work?\\nYou set the apps that you want to block, and how much money you stake. To go past the limits that you set, you have to \"pay\" the stake. If you turn off the Forfeit connection in the Screen Time settings, you also fail.\\nWhat happens if I send incorrect evidence?\\nIf your photo/timelapse doesn\\'t match the description of your forfeit, **we\\'ll always reach out to you for clarification on what the image was before charging**. Less than 5% of failed forfeits are due to incorrect evidence.\\nHow are my card details stored?\\nWe use Stripe to securely process all payments. We never store/see your card details or passwords in our system.\\nWhere does the money go?\\nCurrently, we take 100% of the money lost. We plan to implement an optional subscription, that will allow users to direct where the money goes (a charity, a friend, a savings account).\\nWhat\\'s the failure rate? Won\\'t I just lose money?\\nYou\\'d think that, but the success rate is well above 90% for most users. Just the threat of losing money is enough to motivate you to complete your tasks.\\nWhat countries is Forfeit available in?\\nAlmost all of them! We accept any currency.\\nCan I delete forfeits?\\nYou can delete any forfeits within 10 minutes, and can use the appeals system to delete a forfeit if it\\'s not working for you (depending on your preset leniency mode).\\nWhen do we delete the photos/timelapses?\\nWe delete the photos/timelapses immediately after verification - only members of the Forfeit team will see these.\\nWhat\\'s the customer support like?\\nReach us through the in-app chat - we typically respond within a few hours!\\nWhat if I\\'m a huge data nerd and want to quantify/graph my habits?\\nSounds like you\\'re looking for our friends over at [Beeminder](https://www.forfeit.app/<https:/www.beeminder.com/>)! Simply put, and in their words, Beeminder is \"Forfeit for nerds\".\\n[Privacy Policy](https://www.forfeit.app/</privacy-policy>)\\n[© 2024 Forfeit, Inc. All rights reserved](https://www.forfeit.app/<#>)\\n' markdown_with_citations='![⟨1⟩](https://www.forfeit.app/<#>)\\nHow does it work?⟨2⟩\\nFAQ⟨3⟩\\nLog In⟨4⟩\\n# Forfeit.\\nSay what you\\'re going to do, when you\\'re going to do it, and how much money you lose if you don\\'t do it. Send evidence of you completing your task before the deadline, or we take your money.Backed by\\nComplete your habits,or lose money.\\nSet what you\\'re going to do, when you\\'re doing to do it, and how much money you\\'ll lose if you don\\'t do it. If you don\\'t submit evidence by the deadline, you fail.\\n![](https://cdn.prod.website-files.com/602cf455f72a961cfec0c783/6462c65e453d12c36872c49b_BackedByYC.png)\\n[](https://www.forfeit.app/<https:/apps.apple.com/us/app/forfeit-do-it-or-donate/id1633125787>)\\n[](https://www.forfeit.app/<https:/play.google.com/store/apps/details?id=app.forfeit.forfeit>)\\n![](https://cdn.prod.website-files.com/602cf455f72a961cfec0c783/634094c898f0f615c6402033_ezgif.com-gif-maker%20\\\\(13\\\\).gif)\\n[](https://www.forfeit.app/<https:/apps.apple.com/us/app/forfeit-do-it-or-donate/id1633125787>)\\n[](https://www.forfeit.app/<https:/play.google.com/store/apps/details?id=app.forfeit.forfeit>)\\n# A note on card details.\\nDue to Apple\\'s restrictions, you must add card details through our website. You can\\'t add them through the app.\\n371k\\nForfeits set\\n$4.7M\\nUSD staked\\n94.2%\\nSuccess rate\\n— Testimonials\\n## Don\\'t take our word for it\\n#### “If it had existed 25 years ago my life would\\'ve had a completely different trajectory”\\nThis app has literally changed my life. I 100 percent believe that if it had existed 25 years ago my life would have had a completely different trajectory. I\\'m so grateful to the makers of this app who have allowed me to reach levels of productivity and growth in ways that I previously only dreamed of. Now I don\\'t need to worry about the ebbing and flowing of willpower. I\\'m stronger, fitter, making better food choices and generally getting more done in life. The app keeps me on track and from falling off the bandwagon. It allows you to have flexibility to tailor your goals and makes them achievable with the different percentages of compliance you can set and the number of days you want to hold yourself accountable. In the few short months I have been using it, have seen it evolve rapidly with new integrations being released all the time that make the app even less of an effort to use and update. I can\\'t stop raving about it to my friends and family and am sure I will continue to use it forever.\\nThis app has literally changed my life. I 100 percent believe that if it had existed 25 years ago my life would have had a completely different trajectory. I\\'m so grateful to the makers of this app who have allowed me to reach levels of productivity and growth in ways that I previously only dreamed of. I can\\'t stop raving about it to my friends and family and am sure I will continue to use it forever.\\n##### Zane, USA 🇺🇸\\n#### “Never been in such good shape in all the domains of my life”\\nBefore Forfeit, I was a serial habit breaker. I was unable to maintain routines for more than three weeks even though I tried EVERYTHING. But this app revolutionized my approach. Be it: Daily cold baths and meditation, working out five times a week, becoming top 4% in codewars, consistently studying, cleaning my house regularly. Forfeit turned my aspirations into tangible habits. The secret? Accountability to strangers and financial stakes. I transformed into a disciplined individual. And now, I\\'m not just in the best shape of my life and mentally healthy. No, I\\'m also progressing every day and confident in my ability to achieve anything. To those considering Forfeit, it\\'s a life-changer. It turns \\'someday\\' into \\'today\\', pushing you to do right by yourself, motivation aside.\\nBefore Forfeit, I was a serial habit breaker. I was unable to maintain routines for more than three weeks even though I tried EVERYTHING. But this app revolutionized my approach. Be it: Daily cold baths and meditation, working out five times a week, becoming top 4% in codewars, consistently studying, cleaning my house regularly. Forfeit turned my aspirations into tangible habits. The secret? Accountability to strangers and financial stakes. I transformed into a disciplined individual. And now, I\\'m not just in the best shape of my life and mentally healthy. No, I\\'m also progressing every day and confident in my ability to achieve anything. To those considering Forfeit, it\\'s a life-changer. It turns \\'someday\\' into \\'today\\', pushing you to do right by yourself, motivation aside.\\n##### Brice, Austria 🇦🇹\\n#### “Foundation that enables all changes”\\nForfeit was a step change in my career. Working remotely, I had vague boundaries between personal life and work, and frequent cycles of \"boom and bust\" procrastination followed by last-minute crunching. Neither were terribly enjoyable, and I implicitly limited the kinds of opportunities I\\'d even shoot for to things where I had such a good margin that I knew I wouldn\\'t drop the ball. Since I started using Forfeit a few months ago, I\\'ve been having crisp, full-time work hours, productive when I\\'m on and guiltlessly relaxed when I\\'m off. I\\'ve said yes to and pulled off opportunities I wouldn\\'t have dared to earlier. I can commit to things and _know_ I\\'ll deliver, not just to others but to _myself_ , and earning back that self-trust is the best, and priceless, part. Forfeit is one of many internal and external changes that I\\'ve been compounding into this (personally _and_ financially) much healthier routine, but it\\'s the foundation that enables them all.\\n##### Helder, Brazil 🇧🇷\\n#### “It sounds a little hyperbolic to say an app is life changing, but Forfeit truly is”\\nIt sounds a little hyperbolic to say an app is life changing, but Forfeit truly is. It\\'s remarkable what you can accomplish when willpower is no longer a barrier. Never before have I been so consistent with all those hard things that I want to do. I\\'m well on my way to being the fittest I\\'ve ever been, and feeling in charge of my life like never before. It\\'s a secret weapon - if only I had this app 5 years ago!\\n##### Oliver, UK 🇬🇧\\n#### “Forfeit is a monster of an app”\\nOutsource your executive function: Forfeit is a monster of an app. Force yourself to do things that are important but not urgent by making submitting proof urgent. Submitting timelapses for proof is KICKASS. I’m so much more focused with the timelapse is recording vs when I just have a task scheduled in my calendar. I love that I can play audiobooks and podcasts seamlessly or swap to my meditation app while recording timelapses of completing routines. Super flexible with options for how often you have to submit proof (like 85% of the time or 6 days a week). The app is clean looking and intuitive. You even get confetti for submitting proof. New features in the works like \\'failed forfeit $ goes to your friend\\' \\'failed forfeit $ goes to your selected charity\\' are going to be game changers. I work from home on my small business and I’m always looking for ways to make myself more consistent and this one rules. Best I have ever done with going to bed on time and updating bullet journal metrics every day.\\n##### Devi, USA 🇺🇸\\n#### “Been hunting for an app like this for years now”\\nSIMPLE yet POWERFUL: Been hunting for an app like this for years now. As a busy entrepreneur w ADHD & many life improvement goals (both big & small), I’ve been often plagued by tasks I promised myself to do falling by the wayside. Often, this is because they lack any \\'skin in the game\\', so to speak. This app helps you implement a straightforward accountability & penalty system. I absolutely love that you won’t lose countless hours trying to figure out some complicated system. The fact that an actual HUMAN BEING rather than some machine is on the other side validating or contesting your submitted proof adds a clear & motivating dimension for sticking to your word. I also love that the brains and support team behind this app are so easily accessible and responsive. They’ve helped me figure out so much as well as met me halfway in fine-tuning my more complex goals. You can easily see the ongoing improvements and upgrades and I’ve been impressed by their commitment to & unwavering belief in the app’s concept/mission. I highly recommend Forfeit.\\n##### Raj, USA 🇺🇸\\n#### “Forfeit is a lifesaver”\\nForfeit is a lifesaver. Finally, a commitment device that works! You have real skin in the game—you forfeit real money if you fail to complete your task, and you must upload proof that you have accomplished the task you set for yourself. No more sudden spurts of motivation leading to false promises and abandoned attempts at self-improvement. Now, every time l decide on a goal, my first step will be to set a Forfeit. This way, I know I will actually put the time in—or suffer the consequences.\\n##### Igor, USA 🇺🇸\\n#### “Forfeit is the holy grail”\\nForfeit has helped me stay more focused and productive. I have looked long and hard for things to help my procrastinating problem and held me accountable, and Forfeit is the holy grail. It\\'s reliable and trustworthy, I don\\'t think twice before setting a forfeit. Very thankful.\\n##### Camila, USA 🇺🇸\\n#### “REAL game changer”\\nForfeit has been a REAL game changer for me in achieving a number of goals! Here is just one example: before, I was sending pictures at 6AM at the gym to my best friend, as a way of getting me up early & work out. He was doing the same thing. But over time, we started\"cutting ourselves some slack\" (ie. chicken out and making excuses, and accepting the other ones\\' excuses in return). Forfeit isn\\'t having any of this BS. When I say that I\\'m gonna send a picture everyday at 6AM for one month, I have no choice but to do so (if I set Forfeit on \"hard\" mode). This feature alone has made a big impact on my life, and I haven\\'t even tested all the integrations with Apple Health, MyFitnessPal yet.\\n##### Robin, France 🇫🇷\\n#### \"60th percentile -> 90th percentile... primarily because of Forfeit\"\\nMade a comeback from a rank of 29000 (60th percentile) to a rank of 5000 (90th percentile) in IndianMedical Residency entrance exams in 2.5 months; after my biggest support-my grandma passed away. It was possible primarily because of Forfeit. Love how the verification system literally pays very close attention & prevents cheating. Surprises me everyday as I keep discovering more consistency & potential in myself via Forfeit. A must use especially for the procrastinators!\\n##### Shruti, India 🇮🇳\\n#### \"The progress I\\'ve made with this app is unbelieveable\"\\nI struggle with BPD and Bipolar Disorder which can sometimes lead to me not wanting to take my medicine, but not anymore!! This app has helped me make consistent progress in not only taking my medicine every day but helping me to meditate, go to sleep on time, and do homework! The progress I’ve made with this app is unbelievable and I can’t thank the creators enough.\"\\n##### Jax, USA 🇺🇸\\n#### “96% success rate on 118 forfeits”\\nForfeit is the accountability check that I have wanted in my life for a long time now: to check that I am getting to the gym, clearing my inbox, and cleaning my room. It doesn\\'t take much - all of my forfeits have only risked losing a dollar - but I have found it to be a tangible way of being held up to the standards that I want to hold for myself. All told, I have had 118 forfeits in the past month (my first month of heavy use) and I have had a 96% success rate. I currently have $74 on the line and am continuing to find better ways to use this simple yet powerful tool.\\n##### Gabriel, USA 🇺🇸\\n#### \"Most important app of my life\"\\nThis is the most important app of my life at the moment. I struggle a lot with not being focused in the moment. I have a lot of well intentioned and well laid out plans, but will power in the moment of execution, or distractions during execution have been my biggest blockers. If you are like me, then this is the app for you. The basic construct is very simple, you pay if you can\\'t meet your own goal. But you can plan your entire life around this construct — from dieting to getting the productivity you want daily, to committing to a daily process, to getting enough workout daily, to whatever you want to get done. \\n##### Ankur, USA 🇺🇸\\n#### \"Forfeit really helped me achieve this qualification\"\\nIn years of trying to overcome procrastination, ADHD symptoms, and lack of motivation, l\\'ve learnt that telling myself I\\'ll do something just doesn\\'t work, or doesn\\'t work reliably enough to stop me worrying about whether or not I might forget to do it or get round to doing it. Forfeit removes that. I just have to do it and prove that I\\'ve done it. It works. I used the Timelapse function on Forfeit to complete academic reading 5 days a week for a postgraduate course, and set Forfeits for word count milestones for my assignments. I had a lot going on in life while studying, but Forfeit really helped me achieve this qualification and score a distinction. I also use Forfeit to help me get enough sleep, get exercise, and minimise my social media consumption. Thanks Forfeit team!\\n##### Ro, UK 🇬🇧\\n#### “Usually never write reviews... life changing!”\\nBye Procrastination!: I usually never write reviews but I just downloaded this app this week and it’s been life-changing! I’m a huge procrastinator and I’ve been looking for so many apps to stop me from doing so and this is the one! So to all my procrastinators this is the app that will do the job, unless if you’re up for losing money.\\n##### Sėtāyęśh, Unknown 🌎\\n#### \"Given me a sense of self control I thought I had lost\"\\nThis app has given me a sense of self control I thought I had lost. It\\'s both the least restrictive and most effective tool I have used curb the effects of phone addiction.\\n##### Anonymous, Unknown 🌎\\n#### “I can say with confidence that it works”\\nWhere has this been all my life? As someone with severe ADHD, basic habits have always been a big struggle. I\\'ve tried so many things. Checklists, reminders, alarms, novelty, etc. Nothing would keep me on track. I\\'ve been using forfeit for a few weeks now and I can say with confidence that it works. Never before have I washed my face so consistently, all because the looming threat of losing money is the motivation and accountability I needed but never had. Thank you so much.\\n##### Connor, USA 🇺🇸\\n#### \"I\\'ve been trying to be a disciplined person all my life... Forfeit solved this for me\"\\nI\\'ve been using this app almost since it first came out, but especially for the last 4 months l\\'ve been using the time lapse feature. I\\'ve been trying to be a disciplined person all my life, but there was always a problem somewhere. Forfeit solved this problem for me. As a graduate student and even as someone who is trying to make other habits permanent, it has been game changer to me.\\n##### Alp, Turkey 🇹🇷\\n#### \"Basically makes it impossible not to do the habit\"\\nForfeit helped me to finally stick to habits like waking up early and working out everyday. It basically makes it impossible not to do the habit if you put enough money on the line. Its truly a life changing app.\\n##### Marcelo, Brazil 🇧🇷\\n— Testimonials\\n## Don\\'t take our word for it\\n#### “Never been in such good shape in all the domains of my life”\\nBefore Forfeit, I was a serial habit breaker. I was unable to maintain routines for more than three weeks even though I tried EVERYTHING. But this app revolutionized my approach. Be it: Daily cold baths and meditation, working out five times a week, becoming top 4% in codewars, consistently studying, cleaning my house regularly. Forfeit turned my aspirations into tangible habits. The secret? Accountability to strangers and financial stakes. I transformed into a disciplined individual. And now, I\\'m not just in the best shape of my life and mentally healthy. No, I\\'m also progressing every day and confident in my ability to achieve anything. To those considering Forfeit, it\\'s a life-changer. It turns \\'someday\\' into \\'today\\', pushing you to do right by yourself, motivation aside.\\nBefore Forfeit, I was a serial habit breaker. I was unable to maintain routines for more than three weeks even though I tried EVERYTHING. But this app revolutionized my approach. Be it: Daily cold baths and meditation, working out five times a week, becoming top 4% in codewars, consistently studying, cleaning my house regularly. Forfeit turned my aspirations into tangible habits. The secret? Accountability to strangers and financial stakes. I transformed into a disciplined individual. And now, I\\'m not just in the best shape of my life and mentally healthy. No, I\\'m also progressing every day and confident in my ability to achieve anything. To those considering Forfeit, it\\'s a life-changer. It turns \\'someday\\' into \\'today\\', pushing you to do right by yourself, motivation aside.\\n##### Brice, Austria 🇦🇹\\n#### “Foundation that enables all changes”\\nForfeit was a step change in my career. Working remotely, I had vague boundaries between personal life and work, and frequent cycles of \"boom and bust\" procrastination followed by last-minute crunching. Neither were terribly enjoyable, and I implicitly limited the kinds of opportunities I\\'d even shoot for to things where I had such a good margin that I knew I wouldn\\'t drop the ball. Since I started using Forfeit a few months ago, I\\'ve been having crisp, full-time work hours, productive when I\\'m on and guiltlessly relaxed when I\\'m off. I\\'ve said yes to and pulled off opportunities I wouldn\\'t have dared to earlier. I can commit to things and _know_ I\\'ll deliver, not just to others but to _myself_ , and earning back that self-trust is the best, and priceless, part. Forfeit is one of many internal and external changes that I\\'ve been compounding into this (personally _and_ financially) much healthier routine, but it\\'s the foundation that enables them all.\\n##### Helder, Brazil 🇧🇷\\n#### “If it had existed 25 years ago my life would\\'ve had a completely different trajectory”\\nThis app has literally changed my life. I 100 percent believe that if it had existed 25 years ago my life would have had a completely different trajectory. I\\'m so grateful to the makers of this app who have allowed me to reach levels of productivity and growth in ways that I previously only dreamed of. Now I don\\'t need to worry about the ebbing and flowing of willpower. I\\'m stronger, fitter, making better food choices and generally getting more done in life. The app keeps me on track and from falling off the bandwagon. It allows you to have flexibility to tailor your goals and makes them achievable with the different percentages of compliance you can set and the number of days you want to hold yourself accountable. In the few short months I have been using it, have seen it evolve rapidly with new integrations being released all the time that make the app even less of an effort to use and update. I can\\'t stop raving about it to my friends and family and am sure I will continue to use it forever.\\nThis app has literally changed my life. I 100 percent believe that if it had existed 25 years ago my life would have had a completely different trajectory. Now I don\\'t need to worry about the ebbing and flowing of willpower. I\\'m stronger, fitter, making better food choices and generally getting more done in life. The app keeps me on track and from falling off the bandwagon. In the few short months I have been using it, have seen it evolve rapidly with new integrations being released all the time that make the app even less of an effort to use and update. I can\\'t stop raving about it to my friends and family and am sure I will continue to use it forever.\\n##### Zane, USA 🇺🇸\\n#### “It sounds a little hyperbolic to say an app is life changing, but Forfeit truly is”\\nIt sounds a little hyperbolic to say an app is life changing, but Forfeit truly is. It\\'s remarkable what you can accomplish when willpower is no longer a barrier. Never before have I been so consistent with all those hard things that I want to do. I\\'m well on my way to being the fittest I\\'ve ever been, and feeling in charge of my life like never before. It\\'s a secret weapon - if only I had this app 5 years ago!\\n##### Oliver, UK 🇬🇧\\n#### “Forfeit is a monster of an app”\\nOutsource your executive function: Forfeit is a monster of an app. Force yourself to do things that are important but not urgent by making submitting proof urgent. Submitting timelapses for proof is KICKASS. I’m so much more focused with the timelapse is recording vs when I just have a task scheduled in my calendar. Super flexible with options for how often you have to submit proof (like 85% of the time or 6 days a week). The app is clean looking and intuitive. I work from home on my small business and I’m always looking for ways to make myself more consistent and this one rules. Best I have ever done with going to bed on time and updating bullet journal metrics every day.\\n##### Devi, USA 🇺🇸\\n#### “Been hunting for an app like this for years now”\\nSIMPLE yet POWERFUL: Been hunting for an app like this for years now. As a busy entrepreneur w ADHD & many life improvement goals (both big & small), I’ve been often plagued by tasks I promised myself to do falling by the wayside. Often, this is because they lack any \\'skin in the game\\', so to speak. This app helps you implement a straightforward accountability & penalty system. I absolutely love that you won’t lose countless hours trying to figure out some complicated system. The fact that an actual HUMAN BEING rather than some machine is on the other side validating or contesting your submitted proof adds a clear & motivating dimension for sticking to your word. I also love that the brains and support team behind this app are so easily accessible and responsive. They’ve helped me figure out so much as well as met me halfway in fine-tuning my more complex goals.\\n##### Raj, USA 🇺🇸\\n#### “Forfeit is a lifesaver”\\nForfeit is a lifesaver. Finally, a commitment device that works! You have real skin in the game—you forfeit real money if you fail to complete your task, and you must upload proof that you have accomplished the task you set for yourself. No more sudden spurts of motivation leading to false promises and abandoned attempts at self-improvement. Now, every time l decide on a goal, my first step will be to set a Forfeit. This way, I know I will actually put the time in—or suffer the consequences.\\n##### Igor, USA 🇺🇸\\n#### “Forfeit is the holy grail”\\nForfeit has helped me stay more focused and productive. I have looked long and hard for things to help my procrastinating problem and held me accountable, and Forfeit is the holy grail. It\\'s reliable and trustworthy, I don\\'t think twice before setting a forfeit. Very thankful.\\n##### Camila, USA 🇺🇸\\n#### “REAL game changer”\\nForfeit has been a REAL game changer for me in achieving a number of goals! Here is just one example: before, I was sending pictures at 6AM at the gym to my best friend, as a way of getting me up early & work out. He was doing the same thing. But over time, we started\"cutting ourselves some slack\" (ie. chicken out and making excuses, and accepting the other ones\\' excuses in return). Forfeit isn\\'t having any of this BS. When I say that I\\'m gonna send a picture everyday at 6AM for one month, I have no choice but to do so (if I set Forfeit on \"hard\" mode). This feature alone has made a big impact on my life, and I haven\\'t even tested all the integrations with Apple Health, MyFitnessPal yet.\\n##### Robin, France 🇫🇷\\n#### \"60th percentile -> 90th percentile... primarily because of Forfeit\"\\nMade a comeback from a rank of 29000 (60th percentile) to a rank of 5000 (90th percentile) in IndianMedical Residency entrance exams in 2.5 months; after my biggest support-my grandma passed away. It was possible primarily because of Forfeit. Love how the verification system literally pays very close attention & prevents cheating. Surprises me everyday as I keep discovering more consistency & potential in myself via Forfeit. A must use especially for the procrastinators!\\n##### Shruti, India 🇮🇳\\n#### \"The progress I\\'ve made with this app is unbelieveable\"\\nI struggle with BPD and Bipolar Disorder which can sometimes lead to me not wanting to take my medicine, but not anymore!! This app has helped me make consistent progress in not only taking my medicine every day but helping me to meditate, go to sleep on time, and do homework! The progress I’ve made with this app is unbelievable and I can’t thank the creators enough.\"\\n##### Jax, USA 🇺🇸\\n#### “96% success rate on 118 forfeits”\\nForfeit is the accountability check that I have wanted in my life for a long time now: to check that I am getting to the gym, clearing my inbox, and cleaning my room. It doesn\\'t take much - all of my forfeits have only risked losing a dollar - but I have found it to be a tangible way of being held up to the standards that I want to hold for myself. All told, I have had 118 forfeits in the past month (my first month of heavy use) and I have had a 96% success rate. I currently have $74 on the line and am continuing to find better ways to use this simple yet powerful tool.\\n##### Gabriel, USA 🇺🇸\\n#### \"Most important app of my life\"\\nThis is the most important app of my life at the moment. I struggle a lot with not being focused in the moment. I have a lot of well intentioned and well laid out plans, but will power in the moment of execution, or distractions during execution have been my biggest blockers. If you are like me, then this is the app for you. The basic construct is very simple, you pay if you can\\'t meet your own goal. But you can plan your entire life around this construct — from dieting to getting the productivity you want daily, to committing to a daily process, to getting enough workout daily, to whatever you want to get done. \\n##### Ankur, USA 🇺🇸\\n#### \"Forfeit really helped me achieve this qualification\"\\nIn years of trying to overcome procrastination, ADHD symptoms, and lack of motivation, l\\'ve learnt that telling myself I\\'ll do something just doesn\\'t work, or doesn\\'t work reliably enough to stop me worrying about whether or not I might forget to do it or get round to doing it. Forfeit removes that. I just have to do it and prove that I\\'ve done it. It works. I used the Timelapse function on Forfeit to complete academic reading 5 days a week for a postgraduate course, and set Forfeits for word count milestones for my assignments. I had a lot going on in life while studying, but Forfeit really helped me achieve this qualification and score a distinction. I also use Forfeit to help me get enough sleep, get exercise, and minimise my social media consumption. Thanks Forfeit team!\\n##### Ro, UK 🇬🇧\\n#### “Usually never write reviews... life changing!”\\nBye Procrastination!: I usually never write reviews but I just downloaded this app this week and it’s been life-changing! I’m a huge procrastinator and I’ve been looking for so many apps to stop me from doing so and this is the one! So to all my procrastinators this is the app that will do the job, unless if you’re up for losing money.\\n##### Sėtāyęśh, Unknown 🌎\\n#### \"Given me a sense of self control I thought I had lost\"\\nThis app has given me a sense of self control I thought I had lost. It\\'s both the least restrictive and most effective tool I have used curb the effects of phone addiction.\\n##### Anonymous, Unknown 🌎\\n#### “I can say with confidence that it works”\\nWhere has this been all my life? As someone with severe ADHD, basic habits have always been a big struggle. I\\'ve tried so many things. Checklists, reminders, alarms, novelty, etc. Nothing would keep me on track. I\\'ve been using forfeit for a few weeks now and I can say with confidence that it works. Never before have I washed my face so consistently, all because the looming threat of losing money is the motivation and accountability I needed but never had. Thank you so much.\\n##### Connor, USA 🇺🇸\\n#### \"I\\'ve been trying to be a disciplined person all my life... Forfeit solved this for me\"\\nI\\'ve been using this app almost since it first came out, but especially for the last 4 months l\\'ve been using the time lapse feature. I\\'ve been trying to be a disciplined person all my life, but there was always a problem somewhere. Forfeit solved this problem for me. As a graduate student and even as someone who is trying to make other habits permanent, it has been game changer to me.\\n##### Alp, Turkey 🇹🇷\\n#### \"Basically makes it impossible not to do the habit\"\\nForfeit helped me to finally stick to habits like waking up early and working out everyday. It basically makes it impossible not to do the habit if you put enough money on the line. Its truly a life changing app.\\n##### Marcelo, Brazil 🇧🇷\\n# How does it work?\\nPhoto⟨5⟩Timelapse⟨6⟩Apple Health⟨7⟩Web Tracking⟨8⟩Self-Verify⟨9⟩GPS⟨10⟩\\n### Set a Photo Forfeit.\\nSet the description of the photo that you need to send in by a certain time, how much money you\\'ll lose if you don\\'t send it, and what time it needs to be submitted by.\\n### Submit photo evidence.\\nSend the photo of what you said you were going to do, before the deadline.\\n### GPT/a human will verify it.\\nOnce submitted, GPT4 Vision will verify it. If it isn\\'t certain, or if it thinks it\\'s wrong, it will be sent to a human verifier. If the evidence doesn\\'t match the description, you lose your money.\\n### Set a timelapse Forfeit.\\nSet the description of the photo that you need to send in by a certain time, how much money you\\'ll lose if you don\\'t send it, and what time it needs to be submitted by. Eg, \"30 mins meditation\".\\n### Submit evidence.\\nSend a timelapse of what you said you were going to do, before the deadline.\\n### GPT will verify it.\\nGPT4 Vision will analyse your timelapse, and it it can\\'t immediately approve it, it\\'ll get sent to a human verifier.\\n### Set your Apple Health threshold.\\nSet what Apple Health Marker you\\'d like to track, and select whether you\\'d like to be above of below it, and the deadline for when it should be checked.\\n### Sync to Apple Health\\nThousands of apps sync to Apple Health - select whichever one you use, and turn on Apple Health sync for it in settings.\\n### Forfeit will auto-verify.\\nTrack your workout/meditation like you would in your usual app, and it\\'ll automatically approve it. No need to check back into the app!\\n### Install Rescuetime on PC/Mac/Android.\\nInstall Rescuetime, a web/Android tracking tool. Create a free account, and sync it in app.\\n### Set your limits on your websites/apps.\\nSet the websites, desktop apps, or Android apps that you want to either set a limit on (eg, \"max 30 mins on youtube.com\") or minimal time (eg, \"at least 2hrs on XCode\"), and how much you\\'ll lose if you don\\'t complete this.\\n### Stay beneath the limits.\\nStay beneath the limit (or, surpass it if it\\'s a minimal time), and this will automatically sync to Forfeit. No check-in needed.\\n### Set a self-verify Forfeit.\\nSet the description of the task that you want to complete.\\n### If you did it, approve it.\\nSimply check whethere you did it or you didn\\'t. No evidence needed!\\n### If you didn\\'t, deny it.\\nThis is on your word.\\n### Set the GPS location.\\nSet the location on a map, what time you want to be there by, and how much you\\'ll forfeit if you fail.\\n### Before the deadline, check in.\\nSimply enter the 100m radius of the location that you previously set, and click \"Check In\". If you don\\'t do this in time, you fail.\\n### Appeal if something comes up.\\nCar won\\'t start? Still sore from last workout? Forgot to submit?Set how lenient you want Forfeit to be, and ensure you never fail if it\\'s not your fault.\\n### Fits to your schedule.\\nChoose to submit the forfeit: • X days/week (ie, 3 times each week) • Above a certain percentage of the time (eg, 33% of the time) • Only on specific days (eg, Monday, Wednesday, Friday)\\n### Adjustable leniency.\\nKnow you\\'ll try and weasel out? Set your leniency mode. • Lenient mode: We accept any appeals. • Normal mode: We require evidence. • Hard mode: No appeals, ever.\\n### Something comes up? Appeal it.\\nYou\\'ll never fail if it\\'s not your fault. Humans review each appeal.\\n### Fits to your schedule.\\nSubmit forfeits 3 days a week, or 90% of the time, or only on weekdays.\\n### We can be as tough or as lenient as you want.\\nKnow you\\'ll try and weasel out? No appeals will be accepted. Trust yourself? We\\'ll accept anything given a reason.\\n# Sync to anything\\nWe\\'ll draw data from your favourite apps, and ensure you complete your goals.\\n![](https://cdn.prod.website-files.com/602cf455f72a961cfec0c783/6567e89ffcc1e5e6b1df0ec7_Group%201000000816fitness.svg)\\n![](https://cdn.prod.website-files.com/602cf455f72a961cfec0c783/6567e8d113f0c00c4cca3662_Group%201000000817mindfulness.svg)\\n![](https://cdn.prod.website-files.com/602cf455f72a961cfec0c783/6567e8e1d250dd7ed9ab6b7b_Group%201000000818sleepandweight.svg)\\n## FAQ\\nHow does Forfeit work?\\nThe app works by having you set \"Forfeits\", or tasks you want to complete by a certain time. If you don\\'t submit proof that you\\'ve completed the task on time, we take your money.\\nHow are Forfeits verified?\\nEach Forfeit is verified by either GPT4o, a human, or by drawing data from Apple Health, iOS Screen Time, checking in with GPS, or RescueTime.\\u200dIf your Forfeit remotely matches your description, we\\'ll approve it. Ie, if your description is \"myself at the gym\", and you send a photo of a set of weights, we\\'ll approve it. If you find yourself cheating yourself, and sending a photo of your weight set at home, specify the name of the gym (ie, \"Gold\\'s Gym\"), or a specific object that is only found at the gym. It\\'s easy to get the hang of!\\nWhat goals or tasks can Forfeit help me stick to?\\nForfeit works for pretty much anything you\\'d want to do, but just can\\'t stick to.\\u200dHere is a short list of some possible ones:- **Waking up on time** (eg, a photo of your toothbrush).- **Working out** (eg, a photo inside a gym).- **Reading** (eg, a timelapse of yourself reading for 30 minutes).- **Meditating** (eg, a timelapse of you meditating, any meditation app that syncs with Apple Health).- **Running** (eg, a photo of you in your running shoes outside).- **Finishing an essay on time** (eg, a photo of your essay submitted on your student portal).- **Walking the dog in the morning** (eg, a photo of your dog on a park trail).- **Doing laundry** (eg, a photo of your laundry in the washer).- **Getting to work on time** (eg, check in with GPS at your work location).\\nHow does the Screen Time integration work?\\nYou set the apps that you want to block, and how much money you stake. To go past the limits that you set, you have to \"pay\" the stake. If you turn off the Forfeit connection in the Screen Time settings, you also fail.\\nWhat happens if I send incorrect evidence?\\nIf your photo/timelapse doesn\\'t match the description of your forfeit, **we\\'ll always reach out to you for clarification on what the image was before charging**. Less than 5% of failed forfeits are due to incorrect evidence.\\nHow are my card details stored?\\nWe use Stripe to securely process all payments. We never store/see your card details or passwords in our system.\\nWhere does the money go?\\nCurrently, we take 100% of the money lost. We plan to implement an optional subscription, that will allow users to direct where the money goes (a charity, a friend, a savings account).\\nWhat\\'s the failure rate? Won\\'t I just lose money?\\nYou\\'d think that, but the success rate is well above 90% for most users. Just the threat of losing money is enough to motivate you to complete your tasks.\\nWhat countries is Forfeit available in?\\nAlmost all of them! We accept any currency.\\nCan I delete forfeits?\\nYou can delete any forfeits within 10 minutes, and can use the appeals system to delete a forfeit if it\\'s not working for you (depending on your preset leniency mode).\\nWhen do we delete the photos/timelapses?\\nWe delete the photos/timelapses immediately after verification - only members of the Forfeit team will see these.\\nWhat\\'s the customer support like?\\nReach us through the in-app chat - we typically respond within a few hours!\\nWhat if I\\'m a huge data nerd and want to quantify/graph my habits?\\nSounds like you\\'re looking for our friends over at Beeminder⟨11⟩! Simply put, and in their words, Beeminder is \"Forfeit for nerds\".\\nPrivacy Policy⟨12⟩\\n© 2024 Forfeit, Inc. All rights reserved⟨13⟩\\n' references_markdown='\\n\\n## References\\n\\n⟨1⟩ https://cdn.prod.website-files.com/602cf455f72a961cfec0c783/610c98b94f41dc7298415cb9_IconAndLogo.png: ![\\n⟨2⟩ https://www.forfeit.app/<#Content>: How does it work?\\n⟨3⟩ https://www.forfeit.app/<#FAQ>: FAQ\\n⟨4⟩ https://www.forfeit.app/<http:/account.forfeit.app/login>: Log In\\n⟨5⟩ https://www.forfeit.app/<#w-tabs-0-data-w-pane-0>: Photo\\n⟨6⟩ https://www.forfeit.app/<#w-tabs-0-data-w-pane-1>: Timelapse\\n⟨7⟩ https://www.forfeit.app/<#w-tabs-0-data-w-pane-2>: Apple Health\\n⟨8⟩ https://www.forfeit.app/<#w-tabs-0-data-w-pane-3>: Web Tracking\\n⟨9⟩ https://www.forfeit.app/<#w-tabs-0-data-w-pane-4>: Self-Verify\\n⟨10⟩ https://www.forfeit.app/<#w-tabs-0-data-w-pane-5>: GPS\\n⟨11⟩ https://www.forfeit.app/<https:/www.beeminder.com/>: Beeminder\\n⟨12⟩ https://www.forfeit.app/</privacy-policy>: Privacy Policy\\n⟨13⟩ https://www.forfeit.app/<#>: © 2024 Forfeit, Inc. All rights reserved\\n' fit_markdown='' fit_html=''",
  "generated_description": "### Forfeit: Locking Down Habits with a Penalty\n\n#### Overview\nFounded in 2022 and hailing from the Y Combinator Batch W23, Forfeit is a unique productivity app situated in New York that's on a mission to help users cement their habits—under the threat of losing their own money. The central idea is straightforward, yet powerful: declare what you plan to do, set a deadline, and attach a financial penalty if you don’t deliver. If you fail to submit proof of your completion—be it a photo or a timelapse—your stake is gone.\n\n### How It Works\n1. **Set Your Intentions**: You articulate a specific habit or task, along with a time frame for completion and the amount of money you'll lose if you don't follow through.\n2. **Provide Evidence**: By your deadline, send proof via a photo or capture a timelapse of you completing the task.\n3. **Verification**: Your submission is either verified by AI or a human, ensuring accountability.\n4. **Consequences**: Miss the deadline or provide invalid proof? Sorry, you lose the stake.\n\n#### Why It Matters\nIn a world rife with distractions, Forfeit taps into the psychology of accountability. It’s the digital version of putting your money where your mouth is. With features that allow syncing with platforms like Apple Health or using timelapses, it's designed for everyone—from fitness buffs wanting to hit the gym regularly to students trying to meet their study goals.\n\n### Statistics That Speak\n- **Forfeits Set**: 371k\n- **Total USD Staked**: $4.7M\n- **Success Rate**: An impressive 94.2%\n\n#### Target Audience\nForfeit appeals to those serious about enhancing their productivity—particularly individuals battling procrastination, and even those with mental health challenges (like ADHD) that make sticking to habits troublesome. It’s like having a financial coach at your fingertips.\n\n### User Experiences\nTestimonials paint a rosy picture. Users report life-altering outcomes—better mental health, improved fitness, and a newfound sense of discipline. Whether it’s Zane from the USA, who feels his life’s trajectory would’ve changed if this app had been around longer, or Brice in Austria, who credits Forfeit for his turn from a habit-breaking lifestyle to achieving tangible goals, the stories resonate.\n\n### The Team\nWith a minimalist setup of just two employees, Forfeit remains agile. They're backed by Dalton Caldwell as a group partner, showcasing the commitment to maintaining high operational standards.\n\n### The Future\nImagine a feature where failed forfeits could automatically contribute to a charity or a friend. That’s the think tank behind Forfeit—constantly evolving to provide more value to users.\n\n### In Summary\nForfeit isn’t just an app; it's a commitment device that flips the script on willpower. If achieving your goals often feels like a tug-of-war with your own motivation, Forfeit could be the ally you need—just beware, those stakes can truly hurt. If you're ready to test your resolve, why not give it a shot?"
}