{
  "links": "https://www.ycombinator.com/companies/fractional",
  "name": "Fractional",
  "headline": "Social platform for fractional ownership of investment properties.",
  "batch": "W21",
  "description": null,
  "activity_status": "Active",
  "website": "https://fractional.app",
  "founded_date": 2021.0,
  "team_size": 10.0,
  "location": "San Francisco",
  "group_partner": "Dalton Caldwell",
  "group_partner_yc": "https://www.ycombinator.com/people/dalton-caldwell",
  "company_linkedin": null,
  "company_twitter": null,
  "tags": "industry:fintech; industry:community; industry:crowdfunding; location:san-francisco-bay-area",
  "founders": [],
  "status": true,
  "markdown": "raw_markdown='Please enable cookies.\\n# Sorry, you have been blocked\\n## You are unable to access fractional.app\\n## Why have I been blocked?\\nThis website is using a security service to protect itself from online attacks. The action you just performed triggered the security solution. There are several actions that could trigger this block including submitting a certain word or phrase, a SQL command or malformed data.\\n## What can I do to resolve this?\\nYou can email the site owner to let them know you were blocked. Please include what you were doing when this page came up and the Cloudflare Ray ID found at the bottom of this page.\\nCloudflare Ray ID: **9147603dcee94932** • Your IP: Click to reveal 103.97.165.190 • Performance & security by [Cloudflare](https://fractional.app/<https:/www.cloudflare.com/5xx-error-landing>)\\n' markdown_with_citations='Please enable cookies.\\n# Sorry, you have been blocked\\n## You are unable to access fractional.app\\n## Why have I been blocked?\\nThis website is using a security service to protect itself from online attacks. The action you just performed triggered the security solution. There are several actions that could trigger this block including submitting a certain word or phrase, a SQL command or malformed data.\\n## What can I do to resolve this?\\nYou can email the site owner to let them know you were blocked. Please include what you were doing when this page came up and the Cloudflare Ray ID found at the bottom of this page.\\nCloudflare Ray ID: **9147603dcee94932** • Your IP: Click to reveal 103.97.165.190 • Performance & security by Cloudflare⟨1⟩\\n' references_markdown='\\n\\n## References\\n\\n⟨1⟩ https://fractional.app/<https:/www.cloudflare.com/5xx-error-landing>: Cloudflare\\n' fit_markdown='' fit_html=''",
  "generated_description": "**Fractional Company Overview**\n\nFounded in 2021 and based in San Francisco, Fractional is a budding player in the fintech space. It's not just another startup; it's part of the Y Combinator Batch W21, which gives it credibility and an interesting growth trajectory right from the start.\n\n**Mission and Concept**\n\nFractional aims to democratize real estate investing by creating a social platform for fractional ownership of investment properties. In simple terms, it allows more people to own a piece of real estate without needing to buy an entire property outright. This model taps into the growing trend of shared ownership, making it possible for individuals to diversify their portfolios and invest in real estate with smaller amounts of capital.\n\n**Team and Leadership**\n\nDespite being a small team of just 10 employees, Fractional has a concentrated effort to carve out its niche in the market. Dalton Caldwell, a noted figure in the startup ecosystem, serves as a Group Partner, adding valuable insights and connections to guide the company.\n\n**Why It Matters**\n\nIn a financial landscape where the barriers to real estate investing have historically been high, Fractional is addressing a genuine need for accessible investment opportunities. The tags associated with the company—fintech, community, crowdfunding—highlight its commitment to fostering a collective approach to investment, aligning with the modern investor's appetite for community-driven platforms.\n\n**Current Status**\n\nThere's some disruption in accessing their website as it appears to be blocked due to security measures. Nevertheless, this has not hampered their overarching mission. By establishing a secure platform for investment, they ensure that the interest of their users is protected, even if it means occasional access hiccups.\n\nTo sum it up, Fractional is riding the wave of fintech innovation, leveraging community-driven principles to reshape how we think about real estate investing. If you're looking to dip your toes into this market, keep an eye on what Fractional has to offer; they might just redefine your investment approach."
}