{
  "links": "https://www.ycombinator.com/companies/goldbelly",
  "name": "Goldbelly",
  "headline": "Empowering restaurants and small food makers to ship nationwide.",
  "batch": "W13",
  "description": "Goldbelly is an online platform for specialty food makers and artisans. We discover America's most unique handmade foods and ship them to your door, anywhere nationwide.",
  "activity_status": "Active",
  "website": "https://www.goldbelly.com/",
  "founded_date": 2013.0,
  "team_size": 125.0,
  "location": "New York",
  "group_partner": null,
  "group_partner_yc": null,
  "company_linkedin": null,
  "company_twitter": null,
  "tags": "industry:marketplace; industry:e-commerce; location:new-york",
  "founders": [],
  "status": true,
  "markdown": "raw_markdown='# www.goldbelly.com\\nVerifying you are human. This may take a few seconds.\\nwww.goldbelly.com needs to review the security of your connection before proceeding.\\nPlease unblock challenges.cloudflare.com to proceed.\\nVerification successful\\nWaiting for www.goldbelly.com to respond...\\nRay ID: `914791038dbf3a1d`\\nPerformance & security by [Cloudflare](https://www.goldbelly.com/<https:/www.cloudflare.com?utm_source=challenge&utm_campaign=m>)\\n' markdown_with_citations='# www.goldbelly.com\\nVerifying you are human. This may take a few seconds.\\nwww.goldbelly.com needs to review the security of your connection before proceeding.\\nPlease unblock challenges.cloudflare.com to proceed.\\nVerification successful\\nWaiting for www.goldbelly.com to respond...\\nRay ID: `914791038dbf3a1d`\\nPerformance & security by Cloudflare⟨1⟩\\n' references_markdown='\\n\\n## References\\n\\n⟨1⟩ https://www.goldbelly.com/<https:/www.cloudflare.com?utm_source=challenge&utm_campaign=m>: Cloudflare\\n' fit_markdown='' fit_html=''",
  "generated_description": "**Company Overview: Goldbelly**\n\nFounded in 2013 and hailing from New York, Goldbelly is on a mission to empower restaurants and small food makers to ship their delicious creations nationwide. Picture this: a marketplace dedicated to discovering America’s most unique handmade foods and delivering them straight to your doorstep. That's Goldbelly in a nutshell.\n\nInitially launched as a platform for specialty food artisans, Goldbelly has become a go-to source for food lovers looking for that touch of authenticity and local flavor, regardless of their location. Whether it's iconic regional dishes or artisanal treats, they've got you covered. With a robust team of 125 employees, Goldbelly has developed a significant presence in the realm of e-commerce, seamlessly blending the worlds of food and technology.\n\nGoldbelly was part of Y Combinator's W13 batch—a testament to its potential right from the get-go. Now, with backing from notable partners, including their Group Partner, Nan, they’re making waves in the marketplace scene, solidifying their position as a leader in specialty food delivery.\n\nIf you’re curious about exploring gourmet offerings from across the country, be sure to check out their website: [www.goldbelly.com](https://www.goldbelly.com/). \n\nIn short, Goldbelly isn’t just about food; it’s about bringing unique culinary experiences to everyone, letting you taste the craftsmanship of small food makers with just a click. Now, isn't that something to savor?"
}