{
  "links": "https://www.ycombinator.com/companies/healthlane",
  "name": "Healthlane",
  "headline": "Africa's Preventative Health System",
  "batch": "W20",
  "description": "Rebuilding Africa's health system, with focus on prevention this time",
  "activity_status": "Active",
  "website": "http://healthlane.co",
  "founded_date": 2019.0,
  "team_size": 15.0,
  "location": "Lagos, Nigeria",
  "group_partner": null,
  "group_partner_yc": null,
  "company_linkedin": null,
  "company_twitter": null,
  "tags": "industry:consumer-health-services",
  "founders": [
    {
      "name": "Agbor Ashumanyi Ako, Founder",
      "description": "Medical Doctor with passion for public health and proposing new solutions to improve access to care. Previously consultant for Gates Foundation via Gavi, UNFPA, the World Bank and Plan International.",
      "linkedin": "https://www.linkedin.com/in/agbor-ashu"
    },
    {
      "name": "Alain Nteff, Founder",
      "description": null,
      "linkedin": "https://www.linkedin.com/in/alain-nteff-1b983b45/"
    }
  ],
  "status": true,
  "markdown": "raw_markdown='\\n' markdown_with_citations='\\n' references_markdown='\\n\\n## References\\n\\n' fit_markdown='' fit_html=''",
  "generated_description": "**Company Overview: Healthlane**\n\nFounded in 2019, Healthlane is on a mission to revolutionize preventative healthcare across Africa. Based in Lagos, Nigeria, the company emerged from the influential Y Combinator Batch W20, and operates with a dedicated team of 15 employees.\n\n**Mission Statement**\n\nHealthlane is driven by the vision of establishing Africa’s leading preventative health system. Initially rooted in the broader objective of rebuilding Africa's healthcare framework, the company is pivoting towards a strong focus on prevention.\n\n**What They Do**\n\nHealthlane positions itself within the consumer health services sector, leveraging innovative solutions to enhance the health and well-being of individuals. Their approach emphasizes proactive health management, aiming to address health issues before they escalate.\n\nTheir partner, 'nan', plays a pivotal role in their operations, helping to navigate the complexities of the healthcare landscape in Nigeria and beyond.\n\n**Why It Matters**\n\nPreventative health care is often overlooked in many regions, especially in emerging markets like Africa. Healthlane is not just tackling health care delivery; they are fundamentally shifting how health is perceived and managed by putting prevention at the forefront. By doing so, they aim to improve health outcomes, reduce long-term costs, and ultimately create a healthier population.\n\nIf you want to dive deeper into their initiatives or explore how they’re changing the health landscape, you can visit their website at [Healthlane](http://healthlane.co).\n\n**In Summary**\n\nHealthlane is a promising startup taking bold strides in improving preventative healthcare in Africa. With a clear mission, strong backing from Y Combinator, and a focused team, they have the potential to make significant impacts on health systems in the region."
}