{
  "links": "https://www.ycombinator.com/companies/humanly",
  "name": "Humanly",
  "headline": "We empower the worldâs hiring teams to grow engaged, high-performingâ¦",
  "batch": "W20",
  "description": "Our mission is to empower the worldâs hiring teams to grow engaged, high-performing organizations - by delivering human connection at scale through innovative technology, commitment, and fairness.\r\n\nHigh-volume hiring is extremely broken - it is inefficient, ineffective, and biased. Our mission is to fix what is broken. We believe great hiring processes are centered around quality conversations between candidates and employers and a future where every candidateâs journey starts with a conversation - a future where candidates are considered without bias or archaic artifacts like resumes and cover letters.",
  "activity_status": "Active",
  "website": "https://humanly.io",
  "founded_date": 2019.0,
  "team_size": 30.0,
  "location": "Bellevue, WA",
  "group_partner": null,
  "group_partner_yc": null,
  "company_linkedin": null,
  "company_twitter": null,
  "tags": "industry:recruiting; industry:hr-tech",
  "founders": [],
  "status": true,
  "markdown": "raw_markdown='\\n' markdown_with_citations='\\n' references_markdown='\\n\\n## References\\n\\n' fit_markdown='' fit_html=''",
  "generated_description": "**Humanly: Transforming High-Volume Hiring**\n\nFounded in 2019 and hailing from the Y Combinator W20 batch, Humanly is on a mission to overhaul the broken systems of high-volume hiring. Located in Bellevue, WA, the company is small but laser-focused, with a dedicated team of 30 employees.\n\n**The Problem They’re Tackling**  \nHumanly recognizes that high-volume hiring is riddled with inefficiencies, biases, and dated practices that hold back both candidates and organizations. They believe that the heart of effective hiring lies in genuine conversations—where candidates are valued beyond mere resumes and cover letters. Their vision is for every candidate to embark on their journey with a meaningful dialogue, ensuring that hiring processes are fair and engaging.\n\n**Their Approach**  \nTo achieve this, Humanly leverages innovative technology to facilitate these quality conversations. Their approach hinges on commitment and fairness, empowering hiring teams to build engaged, high-performing organizations. They don’t just want to make hiring efficient; they want to make it humane.\n\n**Industry Focus**  \nWith a strong presence in the *HR-tech* and *recruiting* sectors, Humanly is positioned to make significant impacts in how organizations perceive and engage with talent. Their goal is not just to fill roles but to foster a future where every candidate feels valued and considered.\n\nIf you're curious about their services or want to learn more, you can check out their website at [humanly.io](https://humanly.io).\n\nIn a world where hiring can feel impersonal and futile, Humanly is stepping in to advocate for a more thoughtful and effective process—one conversation at a time."
}