{
  "links": "https://www.ycombinator.com/companies/kemnet",
  "name": "KemNet",
  "headline": "KemNet supplies reformulated drugs for specific groups of patients.",
  "batch": "S22",
  "description": "KemNet supplies pharmacies with premium reformulations of popular drugs that are more useful for specific groups of patients. For example, more than 30 pharmacies rely on KemNet to supply reformulated products for erectile dysfunction that work up to 8 times faster than alternatives. In addition to sexual function, products reformulated for novel drug delivery and supplied on KemNet include medications for hair growth, pain, weight loss and women's health.",
  "activity_status": "Active",
  "website": "https://kemnet.ca/",
  "founded_date": 2022.0,
  "team_size": 2.0,
  "location": "Edmonton, Canada",
  "group_partner": "Michael Seibel",
  "group_partner_yc": "https://www.ycombinator.com/people/michael-seibel",
  "company_linkedin": null,
  "company_twitter": null,
  "tags": "industry:marketplace; industry:b2b; industry:digital-health; industry:e-commerce; industry:therapeutics",
  "founders": [
    {
      "name": "Morẹ́nikẹ́ Ọláòṣebìkan, Founder",
      "description": "Morẹ́nikẹ́ Ẹniọlá Ọláòṣebìkan is a Licensed Clinical Pharmacist and Pharmacy Proprietor. She serves as a Clinical Academic Colleague at the Faculty of Pharmacy & Pharmaceutical Sciences, University of Alberta. She is building a platform to supply pharmacies with premium reformulated medications for specific groups of patients.",
      "linkedin": "https://www.linkedin.com/in/morenike"
    }
  ],
  "status": true,
  "markdown": "raw_markdown='# Updates Coming Soon!\\n' markdown_with_citations='# Updates Coming Soon!\\n' references_markdown='\\n\\n## References\\n\\n' fit_markdown='' fit_html=''",
  "generated_description": "KemNet is a Canadian company based in Edmonton, focused on enhancing patient care through innovative drug reformulations. Founded in 2022 and part of Y Combinator's Batch S22, KemNet's mission is straightforward: to provide pharmacies with premium reformulated drugs tailored for specific patient needs. \n\nWhile they started with a focus on popular drugs for erectile dysfunction—where their products can reportedly work up to eight times faster than the alternatives—they're not stopping there. KemNet is also venturing into areas like hair growth, pain management, weight loss, and women’s health, using novel drug delivery methods. \n\nWith just a team of two, KemNet keeps its operations lean, supported by Group Partner Michael Seibel from Y Combinator. Their approach positions them at the intersection of healthcare and technology, making them a noteworthy player in the digital health landscape. The company has gained traction in the B2B marketplace and e-commerce sectors while staying true to its therapeutic roots.\n\nIf you're interested in learning more about their offerings or the philosophy behind their reformulations, you can visit their website at [kemnet.ca](https://kemnet.ca/). Keep an eye on this startup—there’s undoubtedly more innovation on the horizon!"
}