{
  "links": "https://www.ycombinator.com/companies/lemonbox",
  "name": "LemonBox",
  "headline": "Customized daily vitamin packs for consumers in China.",
  "batch": "S18",
  "description": "LemonBox provides personalized daily vitamin packs for Chinese consumers, along with dietary advice from U.S. registered dietitians. All the products are made in the U.S. and shipped to customers within 7-10 days, based on a monthly subscription model.",
  "activity_status": "Active",
  "website": "http://www.getlemonbox.com/",
  "founded_date": null,
  "team_size": 50.0,
  "location": "Beijing, China",
  "group_partner": null,
  "group_partner_yc": null,
  "company_linkedin": null,
  "company_twitter": null,
  "tags": "industry:health-tech; industry:china",
  "founders": [
    {
      "name": "Derek Weng, Founder",
      "description": "founder of lemonbox",
      "linkedin": "https://www.linkedin.com/in/derek-weng-9a27571a/"
    }
  ],
  "status": true,
  "markdown": "raw_markdown='# getlemonbox.com\\nCopyright 2025 • [Privacy Policy](http://www.getlemonbox.com/</privacy>) • [Legal](http://www.getlemonbox.com/</legal>)\\n' markdown_with_citations='# getlemonbox.com\\nCopyright 2025 • Privacy Policy⟨1⟩ • Legal⟨2⟩\\n' references_markdown='\\n\\n## References\\n\\n⟨1⟩ http://www.getlemonbox.com/</privacy>: Privacy Policy\\n⟨2⟩ http://www.getlemonbox.com/</legal>: Legal\\n' fit_markdown='' fit_html=''",
  "generated_description": "**LemonBox: Your Personalized Vitamin Solution**\n\nLemonBox is carving out a niche in the health-tech space by offering customized daily vitamin packs targeted at consumers in China. Founded during Y Combinator's Summer 2018 batch, LemonBox operates out of Beijing and is on a mission to simplify health and nutrition for its customers.\n\nWhat sets LemonBox apart? It combines the ease of a monthly subscription model with personalized dietary advice from U.S. registered dietitians. This means that customers not only receive tailored vitamin packs, but they also get professional guidance on how to optimize their diets. All products are manufactured in the U.S. and delivered within 7-10 days, ensuring freshness and quality.\n\nWith a team of around 50 employees, LemonBox is not just selling vitamins; they are trying to transform the way Chinese consumers think about health and nutrition. Their approach represents a modern take on wellness, making it accessible and straightforward.\n\nLemonBox is positioned at the intersection of health and technology in a burgeoning market. As health awareness continues to grow in China, services like LemonBox are likely to become even more integral to daily wellness routines.\n\nFor more information, visit [getlemonbox.com](http://www.getlemonbox.com/)."
}