{
  "links": "https://www.ycombinator.com/companies/leon-and-george",
  "name": "Leon & George",
  "headline": "Buying and owning indoor potted plants made easy.",
  "batch": "S17",
  "description": "Léon & George is a California based ecommerce retailer, specializing in premium indoor and outdoor plants, luxury ceramics and lifestyle goods. Recognized for their streamlined local delivery service across California, custom-engineered packaging for nationwide shipping and commitment to exemplary quality, they have cultivated a vast following since the brand’s inception in 2016.",
  "activity_status": "Active",
  "website": "https://www.leonandgeorge.com",
  "founded_date": 2016.0,
  "team_size": 10.0,
  "location": "Los Angeles, CA",
  "group_partner": null,
  "group_partner_yc": null,
  "company_linkedin": null,
  "company_twitter": null,
  "tags": "industry:e-commerce; location:los-angeles",
  "founders": [],
  "status": true,
  "markdown": "raw_markdown='# www.leonandgeorge.com\\nVerifying you are human. This may take a few seconds.\\nwww.leonandgeorge.com needs to review the security of your connection before proceeding.\\nPlease unblock challenges.cloudflare.com to proceed.\\nVerification successful\\nWaiting for www.leonandgeorge.com to respond...\\nRay ID: `914787479b4b8492`\\nPerformance & security by [Cloudflare](https://www.leonandgeorge.com/<https:/www.cloudflare.com?utm_source=challenge&utm_campaign=m>)\\n' markdown_with_citations='# www.leonandgeorge.com\\nVerifying you are human. This may take a few seconds.\\nwww.leonandgeorge.com needs to review the security of your connection before proceeding.\\nPlease unblock challenges.cloudflare.com to proceed.\\nVerification successful\\nWaiting for www.leonandgeorge.com to respond...\\nRay ID: `914787479b4b8492`\\nPerformance & security by Cloudflare⟨1⟩\\n' references_markdown='\\n\\n## References\\n\\n⟨1⟩ https://www.leonandgeorge.com/<https:/www.cloudflare.com?utm_source=challenge&utm_campaign=m>: Cloudflare\\n' fit_markdown='' fit_html=''",
  "generated_description": "**Leon & George: Making Indoor Plants Accessible**\n\nFounded in 2016 and hailing from sunny California, Leon & George has carved out a niche in the e-commerce space focused on premium indoor and outdoor plants. Initially branded as Léon & George, this retailer specializes not just in plants but also in luxury ceramics and a variety of lifestyle goods that complement plant ownership.\n\nLeon & George’s mission is simple yet profound: they aim to make buying and owning indoor potted plants an easy and enriching experience. The startup gained recognition for its efficient local delivery service across California, which ensures that plants reach customers in optimal condition. For those outside the state, the company has developed custom-engineered packaging that protects its products during nationwide shipping.\n\nWith a compact team of 10 employees located in Los Angeles, Leon & George boasts a strong community of plant enthusiasts since its inception. The company is backed by Y Combinator as part of the Batch S17, underscoring its innovative approach in the e-commerce landscape.\n\nFor those looking to enrich their living spaces with some greenery, Leon & George provides a convenient online portal at [leonandgeorge.com](https://www.leonandgeorge.com). Whether you’re a seasoned plant parent or a newbie, they make it easier to bring a touch of nature into your home. If you're in California, their local delivery could save you the hassle of transport, while customers across the country can enjoy quality plants delivered right to their door.\n\nIn a world where the demand for home aesthetics continues to rise, Leon & George stands out not just for the products they offer, but for their commitment to quality and customer experience, proving that they are more than just a plant retailer—they are a lifestyle brand."
}