{
  "links": "https://www.ycombinator.com/companies/lucid",
  "name": "Lucid",
  "headline": "Fast world models for generative simulations",
  "batch": "W25",
  "description": "We are building generative simulations of the world powered by fast world models.\r\n\nInstead of using a physics or game engine with hard-coded rules to render each frame and decide how the environment reacts, this is done end-to-end through a neural network.\r\n\nUnlike text-to-video models, our world models generate frames conditioned on actions, enabling real-time interaction with any environment. Users can explore, manipulate objects, and shape their experience through natural gameplay.\r\n\nWe trained a model to emulate Minecraft that runs smoothly on consumer hardware (1B param model runs at 25fps on an nvidia 4090 gaming gpu while other Minecraft world models run at <3fps). Our advantage in speed comes from aggressive latent compression (128x) that allows us to encode every frame into only 15 tokens while others traditionally use 256.\r\n\nWe are now training on real-world footage and are building a general-purpose universe simulator.",
  "activity_status": "Active",
  "website": "https://lucidsim.co/",
  "founded_date": 2024.0,
  "team_size": 4.0,
  "location": "Berkeley, CA",
  "group_partner": "Aaron Epstein",
  "group_partner_yc": "https://www.ycombinator.com/people/aaron-epstein",
  "company_linkedin": null,
  "company_twitter": null,
  "tags": "industry:deep-learning; industry:generative-ai; industry:machine-learning; location:san-francisco-bay-area",
  "founders": [
    {
      "name": "Alberto Hojel, Founder",
      "description": "Studied computer science at UC Berkeley and did research at BAIR under Trevor Darrell. Worked on weather forecasting with ML at Rainmaker. Originally from Mexico City.\n\nWas on track to pursue a PhD but realized I wanted to build something greater while presenting my paper at ECCV.\n\nPassionate about lucid dreaming and immersive content.",
      "linkedin": "https://linkedin.com/in/albertohojel"
    },
    {
      "name": "Rami Seid, Co-Founder",
      "description": "A high school dropout who got his first internship as an MLE at a robotics lab, I went on to become the CTO of a govtech contracting company. After that, I cofounded my own telecommunications company while doing ML work on the side. Now I'm building a universe simulator at Lucid.",
      "linkedin": "https://www.linkedin.com/in/rami-mohammed-seid/"
    }
  ],
  "status": true,
  "markdown": "raw_markdown='![Lucid Simulations Logo](https://lucidsim.co/Asset 1@2x.png)\\nContact Us \\n# Lucid Simulations, Corp.\\nYour browser does not support the video tag. \\nWe are building generative simulations of the world powered by fast world models. \\nWe previously trained a minecraft model that runs smoothly on consumer hardware. (see more [here](https://lucidsim.co/<https:/x.com/rami_mmo/status/1856028792407388360>)) \\nYour browser does not support the video tag. \\nWe are actively working on making models that better adhere to the physics and dynamics of the world, we hope to share more with you soon. \\n## Our Team\\nFounders: [Alberto Hojel](https://lucidsim.co/<https:/twitter.com/albyhojel>), [Rami Seid](https://lucidsim.co/<https:/twitter.com/rami_mmo>)\\nBacked by Y Combinator\\nalberto@lucidsim.co \\nJoin Waitlist\\n' markdown_with_citations='![Lucid Simulations Logo⟨1⟩]\\nContact Us \\n# Lucid Simulations, Corp.\\nYour browser does not support the video tag. \\nWe are building generative simulations of the world powered by fast world models. \\nWe previously trained a minecraft model that runs smoothly on consumer hardware. (see more here⟨2⟩) \\nYour browser does not support the video tag. \\nWe are actively working on making models that better adhere to the physics and dynamics of the world, we hope to share more with you soon. \\n## Our Team\\nFounders: Alberto Hojel⟨3⟩, Rami Seid⟨4⟩\\nBacked by Y Combinator\\nalberto@lucidsim.co \\nJoin Waitlist\\n' references_markdown='\\n\\n## References\\n\\n⟨1⟩ https://lucidsim.co/Asset 1@2x.png: Lucid Simulations Logo\\n⟨2⟩ https://lucidsim.co/<https:/x.com/rami_mmo/status/1856028792407388360>: here\\n⟨3⟩ https://lucidsim.co/<https:/twitter.com/albyhojel>: Alberto Hojel\\n⟨4⟩ https://lucidsim.co/<https:/twitter.com/rami_mmo>: Rami Seid\\n' fit_markdown='' fit_html=''",
  "generated_description": "**Lucid Simulations: Crafting a New Reality**\n\nLucid Simulations is on a mission that resonates with futurists: creating fast and dynamic generative simulations of our world using cutting-edge technology. Founded in 2024, and a proud member of Y Combinator Batch W25, Lucid is setting its sights on building an interactive environment where users can explore and shape their experiences live.\n\nAt the core of Lucid's innovation is a departure from the traditional methods of simulation. Instead of relying on physics or game engines with cumbersome hard-coded rules, Lucid employs a neural network that seamlessly renders the world in real-time. This approach enables users to interact naturally with their surroundings and manipulate their environments as if they were playing a game.\n\nOne of Lucid’s standout achievements is their Minecraft emulation model. Unlike typical models that struggle with performance (often rendering at less than 3 frames per second), Lucid’s version runs at an impressive 25 frames per second on standard gaming hardware, such as an NVIDIA 4090 GPU. This is made possible through aggressive latent compression techniques, allowing them to encode each frame into just 15 tokens, compared to the usual 256 used by other models.\n\nAs they move forward, Lucid is not stopping at gaming worlds. The team is now diving into real-world footage training, aiming to build a general-purpose universe simulator that faithfully adheres to the physics and dynamics of reality. \n\nBased in Berkeley, CA, Lucid operates with a tight-knit team of four, including founders Alberto Hojel and Rami Seid. They’re backed by the robust support of Y Combinator, which gives them a solid foundation to grow from. \n\nIf you want to keep a pulse on their developments or wish to join their journey, you can check out their website at [Lucid Simulations](https://lucidsim.co/) or shoot them an email at alberto@lucidsim.co.\n\nIn a world growing increasingly complex, Lucid is making strides to simplify the way we interact with simulations, blending imagination with the realities of fast computing. Keep an eye on them; they’re just getting started."
}