{
  "links": "https://www.ycombinator.com/companies/lygg",
  "name": "Lygg",
  "headline": "Building New Sunscreen Ingredients",
  "batch": "W21",
  "description": "Up to 90% of skin aging is caused by ultraviolet (UV) light from the sun. We can protect against this by wearing sunscreen every day, but most people don’t. There are two reasons for this. First, most people don’t know that most skin aging is caused by cumulative sun exposure, even on cloudy days. And second, sunscreens are greasy. At Lygg, we’ve developed new ingredients that can triple the anti-aging protection of sunscreens and eliminate their greasiness. Our goal is to make wearing sunscreen a part of everyone’s daily routine.",
  "activity_status": "Active",
  "website": "http://www.lyggcorp.com",
  "founded_date": 2020.0,
  "team_size": 1.0,
  "location": "Palo Alto",
  "group_partner": null,
  "group_partner_yc": null,
  "company_linkedin": null,
  "company_twitter": null,
  "tags": "industry:anti-aging; industry:beauty; location:san-francisco-bay-area",
  "founders": [
    {
      "name": "Graham Dick, Founder",
      "description": "Graham Dick is the CEO and founder of Lygg. Originally from Vancouver, Canada, Graham obtained his PhD in Chemistry from Stanford University and was a postdoc at EPFL in Lausanne, Switzerland. Recognizing the need for new sunscreen ingredients due to bans of existing ingredients in Hawaii, Graham returned to the US and founded Lygg in 2020.",
      "linkedin": "https://www.linkedin.com/in/grahamrdick/"
    }
  ],
  "status": true,
  "markdown": "raw_markdown='[ LYGG ](http://www.lyggcorp.com/</>)\\n  * [ Home ](http://www.lyggcorp.com/</>)\\n  * [ Team ](http://www.lyggcorp.com/</team.html>)\\n  * [ Contact ](http://www.lyggcorp.com/</contact.html>)\\n\\n\\n[](http://www.lyggcorp.com/<#>)\\n## Lygg\\nBuilding New Sunscreen Ingredients\\nLygg Corporation, 2627 Hanover Street, Palo Alto, CA, 94304\\n[](http://www.lyggcorp.com/<#>)\\n  * [ Home ](http://www.lyggcorp.com/</>)\\n  * [ Team ](http://www.lyggcorp.com/</team.html>)\\n  * [ Contact ](http://www.lyggcorp.com/</contact.html>)\\n\\n\\n' markdown_with_citations=' LYGG ⟨1⟩\\n  *  Home ⟨1⟩\\n  *  Team ⟨2⟩\\n  *  Contact ⟨3⟩\\n\\n\\n[](http://www.lyggcorp.com/<#>)\\n## Lygg\\nBuilding New Sunscreen Ingredients\\nLygg Corporation, 2627 Hanover Street, Palo Alto, CA, 94304\\n[](http://www.lyggcorp.com/<#>)\\n  *  Home ⟨1⟩\\n  *  Team ⟨2⟩\\n  *  Contact ⟨3⟩\\n\\n\\n' references_markdown='\\n\\n## References\\n\\n⟨1⟩ http://www.lyggcorp.com/</>:  LYGG \\n⟨2⟩ http://www.lyggcorp.com/</team.html>:  Team \\n⟨3⟩ http://www.lyggcorp.com/</contact.html>:  Contact \\n' fit_markdown='' fit_html=''",
  "generated_description": "### Lygg: Building New Sunscreen Ingredients\n\n**Mission:** At its core, Lygg is about revolutionizing how we think about sunscreen. With up to 90% of skin aging being attributed to UV exposure, their goal is to make wearing sunscreen a daily ritual. The problem? Most people are either unaware of the cumulative effects of sun exposure or deterred by the greasy texture of traditional sunscreens. Lygg is tackling these issues head-on by developing new ingredients that can triple the anti-aging protection while eliminating greasiness.\n\n**Founded:** Lygg was established in 2020 and is part of the Y Combinator Batch W21, placing it within a robust startup ecosystem ripe for innovation.\n\n**Location:** Based in Palo Alto, California, Lygg is positioned in the heart of Silicon Valley—a hotbed for tech and biotech advancements.\n\n**Team:** The company is currently a one-person operation, highlighting the intense focus and ambition of its founder. They collaborate with a group partner named Nan, contributing valuable insights and support.\n\n**Tags:** Their work falls within categories like anti-aging, beauty, and the San Francisco Bay Area, indicating a strong alignment with health-conscious and beauty-focused consumers.\n\nLygg is on a path to change not just sunscreen but perhaps our relationship with the sun. By making sunscreen effective and user-friendly, they aim to ensure that wearing it becomes as habitual as brushing your teeth. If you're interested in learning more, check them out at [Lygg's website](http://www.lyggcorp.com).\n\n### Reference Links\n- [Lygg Corporate Overview](http://www.lyggcorp.com/)\n- [Meet the Team](http://www.lyggcorp.com/team.html)\n- [Contact Us](http://www.lyggcorp.com/contact.html)"
}