{
  "links": "https://www.ycombinator.com/companies/magicbus",
  "name": "MagicBus",
  "headline": "We make vanpool simple.",
  "batch": "W16",
  "description": "Our mission is to take cars off the road by making it safe and easy to vanpool in the post Covid world.\r\n\nA vanpool is a group of people who commute together, usually in a shared van. It’s an excellent, cost effective way to commute, used by hundreds of thousands of Americans, but the industry is largely offline. It’s difficult to find, join, and start vanpools. \r\n\nWe build software that fixes this, making vanpooling simple and flexible. We believe that in a post Covid world, it will be more important than ever to rethink shared transportation and make it more adaptive.\r\n\nOur customers are organizations like transit agencies and employers who have existing vanpool fleets. We provide these customers with our SaaS platform that manages their vanpool programs. We capture real time information about open seats, then make those seats available to book through our app. We also make it easy for people to crowdsource and start new vanpools.",
  "activity_status": "Active",
  "website": "http://www.magicbus.io",
  "founded_date": null,
  "team_size": 18.0,
  "location": "Los Angeles, CA",
  "group_partner": null,
  "group_partner_yc": null,
  "company_linkedin": null,
  "company_twitter": null,
  "tags": "industry:transportation; location:los-angeles",
  "founders": [],
  "status": true,
  "markdown": "raw_markdown='Please enable cookies.\\n# Sorry, you have been blocked\\n## You are unable to access magicbus.io\\n## Why have I been blocked?\\nThis website is using a security service to protect itself from online attacks. The action you just performed triggered the security solution. There are several actions that could trigger this block including submitting a certain word or phrase, a SQL command or malformed data.\\n## What can I do to resolve this?\\nYou can email the site owner to let them know you were blocked. Please include what you were doing when this page came up and the Cloudflare Ray ID found at the bottom of this page.\\nCloudflare Ray ID: **91478cf75b8e3a45** • Your IP: Click to reveal 103.97.165.190 • Performance & security by [Cloudflare](http://www.magicbus.io/<https:/www.cloudflare.com/5xx-error-landing>)\\n' markdown_with_citations='Please enable cookies.\\n# Sorry, you have been blocked\\n## You are unable to access magicbus.io\\n## Why have I been blocked?\\nThis website is using a security service to protect itself from online attacks. The action you just performed triggered the security solution. There are several actions that could trigger this block including submitting a certain word or phrase, a SQL command or malformed data.\\n## What can I do to resolve this?\\nYou can email the site owner to let them know you were blocked. Please include what you were doing when this page came up and the Cloudflare Ray ID found at the bottom of this page.\\nCloudflare Ray ID: **91478cf75b8e3a45** • Your IP: Click to reveal 103.97.165.190 • Performance & security by Cloudflare⟨1⟩\\n' references_markdown='\\n\\n## References\\n\\n⟨1⟩ http://www.magicbus.io/<https:/www.cloudflare.com/5xx-error-landing>: Cloudflare\\n' fit_markdown='' fit_html=''",
  "generated_description": "**MagicBus: Revolutionizing Vanpooling**\n\nMagicBus makes vanpooling simple. In a world moving towards smarter transportation solutions post-COVID, their mission is pretty straightforward: take cars off the road by offering a safe and easy way to vanpool. \n\nSo, what is vanpooling? It's essentially a group of people commuting together in a shared van—a cost-effective alternative that’s been underutilized because the industry largely operates offline. Finding or starting a vanpool has always been a hassle. Here’s where MagicBus comes in. They’ve built software specifically designed to streamline the vanpooling process. This SaaS platform allows organizations—like transit agencies and employers with existing vanpool fleets—to manage their programs effectively. It collects real-time data on open seats and enables users to easily book those seats through their app. Plus, it offers the flexibility for users to crowdfund new vanpools as demand arises.\n\nFounded in Los Angeles and a graduate of Y Combinator's W16 batch, MagicBus has a small but dedicated team of 18 people. They're passionate about adapting shared transportation to meet modern needs, believing that the post-pandemic landscape makes their mission even more critical.\n\nFor organizations looking to innovate their transportation methods, MagicBus offers a compelling solution. To explore more, check out their website at [magicbus.io](http://www.magicbus.io). \n\nWith transportation tagged as a key part of their identity, MagicBus is embracing the future of commuting—one vanpool at a time."
}