{
  "links": "https://www.ycombinator.com/companies/miggos",
  "name": "Miggos",
  "headline": "Wholesale marketplace for mom & pop clothing shops in LATAM",
  "batch": "W22",
  "description": "Miggos is a wholesale marketplace for the 5 million+ mom & pop clothing shops in Latin America.\r\n\nWe're on a mission to make the lives of these mom & pop store owners in Latin America easier, connecting brands and manufacturers to small retailers and facilitating the entire process of purchasing, selecting, and discovering new products, credit, logistics, and service.",
  "activity_status": "Active",
  "website": "https://miggos.com/",
  "founded_date": 2021.0,
  "team_size": 20.0,
  "location": "São Paulo, Brazil",
  "group_partner": null,
  "group_partner_yc": null,
  "company_linkedin": null,
  "company_twitter": null,
  "tags": "industry:fintech; industry:marketplace; industry:b2b",
  "founders": [
    {
      "name": "Eduardo Olimpio, Founder",
      "description": "I’m a scientist that has worked in several fields: military technology, financial risk, biotech. Since 2016 I work in tech companies building products for humans. I love connecting the knowledge from this diverse background to tech to explore new paths out of my comfort zone.",
      "linkedin": "https://www.linkedin.com/in/eduardo-olimpio-b7868931/"
    }
  ],
  "status": true,
  "markdown": "raw_markdown='\\n' markdown_with_citations='\\n' references_markdown='\\n\\n## References\\n\\n' fit_markdown='' fit_html=''",
  "generated_description": "**Company Overview: Miggos**\n\n**Mission**: Miggos is on a mission to empower the over 5 million mom-and-pop clothing shops scattered across Latin America. By acting as a wholesale marketplace, Miggos connects small retailers with brands and manufacturers, streamlining the entire process of purchasing, product selection, and discovery. Their platform also facilitates essential services like credit and logistics, ensuring that these small business owners have the resources they need to thrive.\n\n**Foundation**: Founded in 2021, Miggos is part of the prestigious Y Combinator Batch W22, indicating a strong backing and mentorship in the startup ecosystem.\n\n**Location and Team**: Based in São Paulo, Brazil, Miggos operates with a dedicated team of 20 employees, showcasing a blend of local talent and a focus on the unique challenges faced by small retailers in the region.\n\n**Tags**: Positioned at the intersection of fintech, marketplace, and B2B, Miggos leverages technology to serve a vital segment of the retail market.\n\n**Notable Partnerships**: The company's group partner is Nan, which likely brings added expertise and resources to further enhance Miggos' offerings.\n\n**Current Focus**: While specific details on ongoing projects are sparse, Miggos is actively engaged in providing essential services to make retail sourcing easier for small clothing shops.\n\nFor more details, you can visit their website at [Miggos](https://miggos.com/).\n\nIn short, Miggos isn't just a marketplace; it's a vital bridge for small retailers to access the products and services they need, all while simplifying their purchasing process. In a region where these small businesses play a crucial role in the economy, Miggos is poised to make a significant impact."
}