{
  "links": "https://www.ycombinator.com/companies/nephrogen",
  "name": "Nephrogen",
  "headline": "Curative gene therapies for kidney diseases",
  "batch": "S20",
  "description": "We're building curative gene therapies for kidney diseases. Our initial focus is on polycystic kidney disease (PKD), which affects 600,000 Americans and has no effective treatment or cure.",
  "activity_status": "Active",
  "website": "http://www.nephrogenbiotech.com",
  "founded_date": 2020.0,
  "team_size": 1.0,
  "location": "New York",
  "group_partner": "Jared Friedman",
  "group_partner_yc": "https://www.ycombinator.com/people/jared-friedman",
  "company_linkedin": null,
  "company_twitter": null,
  "tags": "industry:gene-therapy; industry:crispr; industry:biotech; location:new-york",
  "founders": [
    {
      "name": "Demetri Maxim, Founder",
      "description": "Stanford B.S. '20 (Biology), Founder of Nephrogen",
      "linkedin": "https://www.linkedin.com/in/demetri-maxim"
    }
  ],
  "status": true,
  "markdown": "raw_markdown='[![](https://cdn.prod.website-files.com/5ecebc340464b231587afbd4/5ecefa146c2c8a1abe4babe9_nephrogenlogo.png)](http://www.nephrogenbiotech.com/<#>)\\n[ABOUT](http://www.nephrogenbiotech.com/<#Mission>)[Technology](http://www.nephrogenbiotech.com/<#Therapeutics>)[Team](http://www.nephrogenbiotech.com/<#Team>)[News](http://www.nephrogenbiotech.com/<#News>)[Contact](http://www.nephrogenbiotech.com/<#Contact>)\\n[![](https://cdn.prod.website-files.com/5ecebc340464b231587afbd4/5ecebc34cece3b996a4bdf91_arrow.svg)](http://www.nephrogenbiotech.com/<#Mission>)\\n# We\\'re building curative gene therapies for life threatening kidney diseases. \\n### Launch your product — and savor the momentum. \\n[Get the App](http://www.nephrogenbiotech.com/<#>)\\nresearch and advisors from \\n![](https://cdn.prod.website-files.com/5ecebc340464b231587afbd4/65429d5e93b4b737d7c0b237_uni-logos-S.png)\\n[OUR MISSION](http://www.nephrogenbiotech.com/<#>)\\n## Nephrogen is a preclinical biotech company developing curative gene therapies for kidney diseases.\\n![](https://cdn.prod.website-files.com/5ecebc340464b231587afbd4/5ef10aed8097a1aaf696b39f_plus.png)\\nOur initial indication is autosomal dominant polycystic kidney disease (ADPKD), which affects 600,000 Americans and has no cure or effective treatment. Our solution aims to halt ADPKD from the onset and provide an outright cure for the disease.We\\'re boldly committed to reimagining therapeutics for life threatening kidney disease. Our broad patent portfolio will allow us to rapidly translate our technologies into foundational partnerships and transformative treatments. \\n[Our technology](http://www.nephrogenbiotech.com/<#>)\\n## Curative gene therapies for kidney diseases.\\nOur groundbreaking platform combines the power of CRISPR-Cas genome editing with the latest advances in nucleic acid delivery, such as adeno-associated viruses (AAVs) and lipid nanoparticles (LNPs) to create a solution that targets kidney disease at the source. Our novel technology has three primary components: \\n![](https://cdn.prod.website-files.com/5ecebc340464b231587afbd4/5f0c89014dd1282bec80ac10_Gene%20Therapy%20II.png)\\n#### Maximum therapeutic effect\\nWe have developed a non-invasive method for delivering gene therapy locally to the kidney using breakthrough filed IP.\\n#### Precision therapy delivery\\nWe have engineered novel AAV viruses via directed evolution that target the kidney with 100x better efficiency than existing AAVs\\n#### Personalized approach\\nWe are pursuing several unique gene targets in PKD1, the gene that causes, autosomal dominant polycystic kidney disease (ADPKD). \\n## Rapid drug discovery\\nNephrogen\\'s drug discovery platform leverages innovations in computer vision and high-throughput screening (HTS) to find new small molecule drugs for other cystic kidney diseases, including and nephronophthisis. \\n![](https://cdn.prod.website-files.com/5ecebc340464b231587afbd4/5f0f286a3b4b256451e37f3d_ATS%20II.png)\\n[Our team](http://www.nephrogenbiotech.com/<#>)\\n# Leadership\\n[![](https://cdn.prod.website-files.com/5ee3a102202f052ed7e8949d/5ef0ed1262129d4687de72ec_Demetri-Maxim.png)Demetri MaximChief Executive Officer](http://www.nephrogenbiotech.com/<#>)\\n![](https://cdn.prod.website-files.com/5ee3a102202f052ed7e8949d/5ef0ed1262129d4687de72ec_Demetri-Maxim.png)\\nDemetri Maxim\\nChief Executive Officer\\nDemetri is the Founder and CEO of Nephrogen and has been actively immersed in kidney disease research since he was 14 years old. He completed his undergraduate and graduate research training at Stanford University in the Division of Nephrology under the mentorship of Vivek Bhalla, Avnesh Thakor, and world renowned virologist, Mark Kay. Demetri also formerly worked in Dr. George Church’s lab at Harvard Medical School and with Dr. Terry Watnick at the National NIH center for Polycystic Kidney Disease (PKD) Research. Demetri’s family has PKD, and he founded Nephrogen based on his graduate research to realize his vision of curing all genetic kidney diseases by 2030.\\n[![](https://cdn.prod.website-files.com/5ee3a102202f052ed7e8949d/641dfee9bec8dac62d771a6e_vivek_bhalla_profile.webp)Vivek Bhalla, MDChief Medical Advisor](http://www.nephrogenbiotech.com/<#>)\\n![](https://cdn.prod.website-files.com/5ee3a102202f052ed7e8949d/641dfee9bec8dac62d771a6e_vivek_bhalla_profile.webp)\\nVivek Bhalla, MD\\nChief Medical Advisor\\nDr. Vivek Bhalla is the Chief Medical Officer of Nephrogen and an Associate Professor of Medicine (Nephrology) at Stanford University. Using in vivo and in vitro approaches, Dr. Bhalla’s laboratory focuses on molecular mechanisms of diseases that involve the kidney, including diabetes and hypertension . As a physician-scientist and a practicing nephrologist, Dr. Bhalla has complementary clinical and translational research interests related to mechanisms of kidney disease and hypertension. He also has leadership roles both at Stanford and nationally. Dr. Bhalla founded and directs the nationally-accredited Stanford Hypertension Center and is Past Chair of the Council on Kidney and Cardiovascular Disease for the American Heart Association.\\n[![](https://cdn.prod.website-files.com/5ee3a102202f052ed7e8949d/67ad0cf9d8da69b4b200ae48_Chang%20Hong.jpg)Chang Hong, JDChief Business Officer](http://www.nephrogenbiotech.com/<#>)\\n![](https://cdn.prod.website-files.com/5ee3a102202f052ed7e8949d/67ad0cf9d8da69b4b200ae48_Chang%20Hong.jpg)\\nChang Hong, JD\\nChief Business Officer\\nChang B. Hong, J.D., LL.M. leads Nephrogen\\'s corporate strategy, business development, legal and intellectual property functions. Chang brings two decades of experience as in-house counsel having advised private and public biotechnology, pharmaceutical, renewable fuels, and food tech companies. As a serial entrepreneur of biotech and sustainability companies, he has hands-on experience and a deep understanding of legal, R&D, operations and commercialization activities. Chang’s company affiliations during his career include Synlogic (NASDAQ: SYBX), GlycoFi (acquired- Merck), Pliv, Emergent Biosolutions, Joule, Lallemand, Glycobia, and Moonshot Bio. Chang is the founding member of Modality Law PLLC, a law firm focused on advising life sciences and emerging technology companies. His in-house and law firm experience spans corporate transactions, financing and governance; IP strategy and development; as well as regulatory, clinical and compliance matters. Chang is a registered U.S. patent attorney and holds a J.D. and an LL.M. from UNH Franklin Pierce School of Law and a B.S. in Biochemistry & Molecular Biology and Music from Dickinson College.\\n[![](https://cdn.prod.website-files.com/5ee3a102202f052ed7e8949d/65dfd079263944170d96d55e_1.png)Fernando Gomez Garcia, PhDSenior Research Associate](http://www.nephrogenbiotech.com/<#>)\\n![](https://cdn.prod.website-files.com/5ee3a102202f052ed7e8949d/65dfd079263944170d96d55e_1.png)\\nFernando Gomez Garcia, PhD\\nSenior Research Associate\\nFernando graduated from the University of Almería (UAL) in 2020 with a Bachelor\\'s degree in Biotechnology. The following year, he obtained a Master\\'s degree in Biochemistry, Molecular Biology and Biomedicine at the Complutense University of Madrid (UCM). Fernando feels great interest in everything related to genomic editing, which is why he did his Master\\'s Thesis on genetic editing (CRISPR / Cas9) at the Gene Therapy Laboratory of the Carlos III Health Institute (ISCIII). Currently, he is doing a Doctorate in Molecular Medicine at the Laboratory of Genetics and Developmental Biology of Kidney Diseases (NefroCHUS) from the Health Research Institute of Santiago de Compostela (IDIS) and at the Genomics and Bioinformatics laboratory of the Center for Research in Molecular Medicine and Chronic Disease (CiMUS), where he has been awarded a predoctoral contract. The main theme of his thesis is the application of new genetic editing technologies (base editing and prime editing) in cell models and animals carrying genetic mutations that cause polycystic kidney disease (PKD). Among his objectives is to lay the foundations for, in the long term, develop a gene therapy that allows improving the quality of life of patients with this disease. Fernando is a Senior Research Associate at Nephrogen. \\n[![](https://cdn.prod.website-files.com/5ee3a102202f052ed7e8949d/674148375bf5cc587629d81d_Erin%20Marble%20Photo.png)Erin MarbleResearch Associate](http://www.nephrogenbiotech.com/<#>)\\n![](https://cdn.prod.website-files.com/5ee3a102202f052ed7e8949d/674148375bf5cc587629d81d_Erin%20Marble%20Photo.png)\\nErin Marble\\nResearch Associate\\nErin is graduating with a Bachelor of Arts in Biology from the University of Pennsylvania, with a concentration in Mechanisms of Disease. She has done extensive research in developmental genomics, focusing on cell fate specification in the early C. elegans embryo in the Murray Lab. Erin also worked in the Betley lab investigating the neural basis of the prioritization of survival behaviors like hunger and fear. She is enthusiastic about genetic research and is dedicated to developing solutions and cures for genetic diseases that impact so many, especially at Nephrogen.\\n[![](https://cdn.prod.website-files.com/5ee3a102202f052ed7e8949d/669a813aeb5edb7c7ebd489f_Miriam%20Headshot.jpeg)Miriam Rivera MorenoResearch Associate](http://www.nephrogenbiotech.com/<#>)\\n![](https://cdn.prod.website-files.com/5ee3a102202f052ed7e8949d/669a813aeb5edb7c7ebd489f_Miriam%20Headshot.jpeg)\\nMiriam Rivera Moreno\\nResearch Associate\\nMiriam comes to Nephrogen from her previous role as a Lab Operations intern at Biolabs@NYULangone, where she has developed a keen interest in innovation and the startup ecosystem. Miriam is a biotechnologist who recently graduated from the European University of Madrid. Simultaneously, sh earned her Postgraduate Diploma in Bioengineering from the University of California, Riverside. She feels passionate about scientific research and its potential to deliver impactful solutions to society. During her undergraduate training, she participated in several research projects, the most notable being CoralCure, where her team worked toward solving coral bleaching by genetically engineering the microbiota of the coral. This project significantly deepened her interest in synthetic biology and gene therapy. Miriam is an enthusiastic advocate of therapeutic solutions leveraging the latest advancements in biotechnology and she is now excited to contribute her expertise and passion as a biomedical research intern at Nephrogen.\\n# Advisors\\n![](https://cdn.prod.website-files.com/5ee3a102202f052ed7e8949d/5eebb03f1a6db1ed2bfaa01a_George-Church.png)\\nGeorge Church, PhD\\nProfessor of Genetics\\nGeorge Church is a Professor of Genetics at Harvard Medical School and the Director of PersonalGenomes.org, which provides the world\\'s only open-access information on human Genomic, Environmental & Trait data (GET). His 1984 Harvard PhD included the first methods for direct genome sequencing, molecular multiplexing & barcoding. These led to the first genome sequence (pathogen, Helicobacter pylori) in 1994 . His innovations have contributed to nearly all \"next generation\" DNA sequencing methods and companies (CGI-BGI, Life, Illumina, Nanopore). This plus his lab\\'s work on chip-DNA-synthesis, gene editing and stem cell engineering resulted in founding additional application-based companies spanning fields of medical diagnostics (Knome, Alacris, AbVitro, Pathogenica, Veritas Genetics) & synthetic biology / therapeutics (Joule, Gen9, Editas, Egenesis, enEvolv, WarpDrive). He has also pioneered new privacy, biosafety, ELSI, environmental & biosecurity policies. He is director of an IARPA BRAIN Project and NIH Center for Excellence in Genomic Science. His honors include election to NAS & NAE & Franklin Bower Laureate for Achievement in Science. He has coauthored 430 papers, 90 patent publications & one book (Regenesis).\\n[![](https://cdn.prod.website-files.com/5ee3a102202f052ed7e8949d/5eebb03f1a6db1ed2bfaa01a_George-Church.png)George Church, PhDProfessor of GeneticsScientific Advisor](http://www.nephrogenbiotech.com/<#>)\\n![](https://cdn.prod.website-files.com/5ee3a102202f052ed7e8949d/641e0028657e66cfeb6ec853_photocache.70687.jpeg)\\nAvnesh Thakor, MD, PhD\\nAssociate Professor of Radiology, Stanford University\\nDr. Thakor is an Attending Interventional Radiologist who runs his own translational laboratory at Stanford University investigating the use of mesenchymal stem cell (MSC) based therapies and novel in vivo injection methods for delivering to traditionally difficult to reach organs such as the kidney and pancreas. Dr. Thakor leads the multidisciplinary Interventional Radiology Innovation at Stanford (IRIS) program and is a leader in the new emerging field of Interventional Regenerative Medicine. \\n[![](https://cdn.prod.website-files.com/5ee3a102202f052ed7e8949d/641e0028657e66cfeb6ec853_photocache.70687.jpeg)Avnesh Thakor, MD, PhDAssociate Professor of Radiology, Stanford UniversityScientific Advisor](http://www.nephrogenbiotech.com/<#>)\\n![](https://cdn.prod.website-files.com/5ee3a102202f052ed7e8949d/641e365f8bbc471c6bb452f9_mark-kay_profilephoto.jpeg)\\nMark Kay, MD, PhD\\nProfessor of Genetics, Stanford University\\nDr. Kay is a leading researcher in the fields of gene therapy and adeno-associated virus (AAV) biology, including the identification of new AAV capsids. Dr. Kay is the head of the Division of Human Gene Therapy and professor in the Department of Pediatrics and Genetics at Stanford University School of Medicine. He is one of the founders of the American Society of Gene and Cell Therapy, served as its president from 2005-2006, and was the recipient of the society’s Outstanding Investigator Award in 2013. Dr. Kay received the E. Mead Johnson Award for Research in Pediatrics in 2000. He was elected to the American Society for Clinical Investigation in 1997 and the Association for American Physicians in 2010. He has organized many national and international conferences, including the first Gordon Conference related to gene therapy. Dr. Kay is respected worldwide for his work in vector development, gene therapy and non-coding RNA biology. He has published over 250 papers. He is currently the deputy editor of Human Gene Therapy and serves on the editorial boards of other peer-reviewed publications.\\n[![](https://cdn.prod.website-files.com/5ee3a102202f052ed7e8949d/641e365f8bbc471c6bb452f9_mark-kay_profilephoto.jpeg)Mark Kay, MD, PhDProfessor of Genetics, Stanford UniversityScientific Advisor](http://www.nephrogenbiotech.com/<#>)\\n![](https://cdn.prod.website-files.com/5ee3a102202f052ed7e8949d/641e375b712abe41bbedcdbf_Watnick_Terry.png)\\nTerry Watnick, MD\\nDirector, Polycystic Kidney Disease Research Resource Consortium\\nDr. Watnick is a graduate of the Yale School of medicine and trained in Internal Medicine at Yale-New Haven Hospital. She completed both clinical and research fellowships in nephrology at the Johns Hopkins School of Medicine. During her research training, she became interested in inherited kidney diseases and specifically in autosomal dominant polycystic kidney disease (ADPKD). She has been involved in both basic and clinical research related to polycystic kidney disease. Her laboratory has been studying the vascular phenotype that is associated with PKD1/2 mutations in humans and in mice. She directs an inherited renal disease clinic and has served as the site prinicipal investigator for several clinical trials testing therapies in patients with ADPKD. She is also the Principal Investigator for a PKD Center of excellence that is one of 4 P30 Core centers funded by the NIH/NIDDK.\\n[![](https://cdn.prod.website-files.com/5ee3a102202f052ed7e8949d/641e375b712abe41bbedcdbf_Watnick_Terry.png)Terry Watnick, MDDirector, Polycystic Kidney Disease Research Resource ConsortiumScientific Advisor](http://www.nephrogenbiotech.com/<#>)\\n![](https://cdn.prod.website-files.com/5ee3a102202f052ed7e8949d/65b93f01904fa4cffecec816_IMG-0107.jpg)\\nVishal Patel, MD\\nProfessor of Medicine/Nephrology\\nDr. Patel is a Professor (with Tenure) in the Dept. of Internal Medicine at UT Southwestern Medical Center, where he holds the Yin Quan-Yuen Distinguished Professorship in Nephrology. He obtained his M.D. from India (2000) and completed his Internal Medicine residency at Northwestern University (2004) and clinical Nephrology fellowship at UT Southwestern (2005). Following his clinical training, he was an NIH-funded Physician-Scientist trainee at UT Southwestern (2005 to 2009), studying kidney genetics and primary cilia biology. In 2010, as an independent investigator, Dr. Patel charted a new course in the then little- studied non-coding RNA field. They investigate basic aspects of RNA biology (mRNA translation regulation, RNA chemical modifications, non-coding RNAs, etc.) in the context of polycystic kidney disease (PKD) and kidney development. Their seminal scientific contribution is devising a framework for an endogenous, mutation-agnostic, PKD1/2 mRNA therapy for autosomal dominant PKD, which has already progressed to human clinical trials. Dr. Patel’s lab has been continuously funded by the NIH since 2009 and has received additional funding from the Department of Defense. They have published their work in highly-regarded journals such as PNAS, Nature Communications, and Cell Metabolism. In 2017, Dr. Patel initiated the Comprehensive PKD and Kidney Genetics clinic at UT Southwestern, which is now among the largest nationally and was designated as a Center of Excellence by the PKD Foundation in 2023. Dr. Patel is a successful and sought-after mentor. He has mentored ten postdocs; six now have academic faculty appointments, including a K08-funded physician-scientist, a K01-funded basic scientist, and a 2023 K01 applicant. He has also mentored eight undergraduate students, including two who are now MD-PhDs, six women scientists, four URM trainees, and two first- generation college graduates. Dr. Patel is the founding Director of the Training Core of a proposed new multi-institutional (UTSW, UT Dallas, UT Arlington) predoc and postdoc NIH U2C/TL1 training program. Dr. Patel is active in several important national leadership positions. He serves NIH and DOD grant study sections, including as a study section chair. He is an Editor for Scientific Reports and Frontiers of Physiology. He is also the Chair of the scientific advisory committee for the PKD Foundation. He serves as a consultant for many pharmaceutical companies, and is an elected member of the ASCI.\\n[![](https://cdn.prod.website-files.com/5ee3a102202f052ed7e8949d/65b93f01904fa4cffecec816_IMG-0107.jpg)Vishal Patel, MDProfessor of Medicine/NephrologyScientific Advisor](http://www.nephrogenbiotech.com/<#>)\\n![](https://cdn.prod.website-files.com/5ee3a102202f052ed7e8949d/5eebb04d6458cd08d3b4d636_Jan-Liphardt.png)\\nJan Liphardt, PhD\\nAssociate Professor of Bioengineering, Stanford University\\nDr. Liphardt is an Associate Professor of Bioengineering at Stanford University and a Professor in Residence at StartX. For his Ph.D. work at Cambridge University, he used computers, information theory, and statistics, such as stochastic context free grammars, to find patterns in genomes. He was a physics professor at UC Berkeley until 2013, when he moved to Stanford. Jan is a Sloan Research Fellow, a Searle Scholar, and has served on the board of numerous biotechnology companies.\\n[![](https://cdn.prod.website-files.com/5ee3a102202f052ed7e8949d/5eebb04d6458cd08d3b4d636_Jan-Liphardt.png)Jan Liphardt, PhDAssociate Professor of Bioengineering, Stanford UniversityScientific Advisor](http://www.nephrogenbiotech.com/<#>)\\n# Investors\\n[](http://www.nephrogenbiotech.com/<https:/lsvp.com/>)[](http://www.nephrogenbiotech.com/<https:/startx.com/>)[](http://www.nephrogenbiotech.com/<https:/www.phoenixclub.vc/>)[](http://www.nephrogenbiotech.com/<https:/www.ycombinator.com/>)[](http://www.nephrogenbiotech.com/<https:/darwin-biotech.com/>)[](http://www.nephrogenbiotech.com/<https:/contrary.com/>)[](http://www.nephrogenbiotech.com/<https:/www.pillar.vc/>)[](http://www.nephrogenbiotech.com/<https:/www.2048.vc/>)\\n# Strategic Partners\\n[](http://www.nephrogenbiotech.com/<https:/www.otsuka-us.com/>)[](http://www.nephrogenbiotech.com/<https:/www.chiesiusa.com/>)[](http://www.nephrogenbiotech.com/<https:/www.bms.com/>)[](http://www.nephrogenbiotech.com/<https:/www.alnylam.com/>)\\n[news & publication](http://www.nephrogenbiotech.com/<#>)\\n## Browse our latest media\\n[Renal plasticity revealed through reversal of polycystic kidney disease in miceNature GeneticsOctober 11, 2021](http://www.nephrogenbiotech.com/<https:/www.nature.com/articles/s41588-021-00946-4>)\\n[Ultrasound enhances therapeutic effect of MSC-derived extracellular vesicles in kidney injuryStem Cell Research & TherapySeptember 14, 2020](http://www.nephrogenbiotech.com/<https:/stemcellres.biomedcentral.com/articles/10.1186/s13287-020-01922-1>)\\n[Using a barcoded AAV capsid library to select for clinically relevant gene therapy vectorsJCI InsightNovember 14, 2019](http://www.nephrogenbiotech.com/<https:/insight.jci.org/articles/view/131610>)\\n[GDNF drives rapid tubule morphogenesis in a novel 3D in vitro model for ADPKDJournal of Cell ScienceJuly 16, 2020](http://www.nephrogenbiotech.com/<https:/journals.biologists.com/jcs/article/133/14/jcs249557/224910/GDNF-drives-rapid-tubule-morphogenesis-in-a-novel>)\\n![](https://cdn.prod.website-files.com/5ecebc340464b231587afbd4/5ecebcabb7c26608f84fa4fa_nephrogen-t-shirt-updated.png)\\n[Email](http://www.nephrogenbiotech.com/<#>)[Instagram](http://www.nephrogenbiotech.com/<#>)[Facebook](http://www.nephrogenbiotech.com/<#>)[Twitter](http://www.nephrogenbiotech.com/<#>)[Image License Info](http://www.nephrogenbiotech.com/</image-license-info>)[Powered by Webflow](http://www.nephrogenbiotech.com/<http:/webflow.com>)\\ninfo@nephrogenbiotech.comBiolabs @ NYU Langone\\u200d180 Varick StFloor 6New York, NY, 10014\\n' markdown_with_citations='![⟨1⟩](http://www.nephrogenbiotech.com/<#>)\\nABOUT⟨2⟩Technology⟨3⟩Team⟨4⟩News⟨5⟩Contact⟨6⟩\\n![⟨7⟩](http://www.nephrogenbiotech.com/<#Mission>)\\n# We\\'re building curative gene therapies for life threatening kidney diseases. \\n### Launch your product — and savor the momentum. \\nGet the App⟨8⟩\\nresearch and advisors from \\n![](https://cdn.prod.website-files.com/5ecebc340464b231587afbd4/65429d5e93b4b737d7c0b237_uni-logos-S.png)\\nOUR MISSION⟨8⟩\\n## Nephrogen is a preclinical biotech company developing curative gene therapies for kidney diseases.\\n![](https://cdn.prod.website-files.com/5ecebc340464b231587afbd4/5ef10aed8097a1aaf696b39f_plus.png)\\nOur initial indication is autosomal dominant polycystic kidney disease (ADPKD), which affects 600,000 Americans and has no cure or effective treatment. Our solution aims to halt ADPKD from the onset and provide an outright cure for the disease.We\\'re boldly committed to reimagining therapeutics for life threatening kidney disease. Our broad patent portfolio will allow us to rapidly translate our technologies into foundational partnerships and transformative treatments. \\nOur technology⟨8⟩\\n## Curative gene therapies for kidney diseases.\\nOur groundbreaking platform combines the power of CRISPR-Cas genome editing with the latest advances in nucleic acid delivery, such as adeno-associated viruses (AAVs) and lipid nanoparticles (LNPs) to create a solution that targets kidney disease at the source. Our novel technology has three primary components: \\n![](https://cdn.prod.website-files.com/5ecebc340464b231587afbd4/5f0c89014dd1282bec80ac10_Gene%20Therapy%20II.png)\\n#### Maximum therapeutic effect\\nWe have developed a non-invasive method for delivering gene therapy locally to the kidney using breakthrough filed IP.\\n#### Precision therapy delivery\\nWe have engineered novel AAV viruses via directed evolution that target the kidney with 100x better efficiency than existing AAVs\\n#### Personalized approach\\nWe are pursuing several unique gene targets in PKD1, the gene that causes, autosomal dominant polycystic kidney disease (ADPKD). \\n## Rapid drug discovery\\nNephrogen\\'s drug discovery platform leverages innovations in computer vision and high-throughput screening (HTS) to find new small molecule drugs for other cystic kidney diseases, including and nephronophthisis. \\n![](https://cdn.prod.website-files.com/5ecebc340464b231587afbd4/5f0f286a3b4b256451e37f3d_ATS%20II.png)\\nOur team⟨8⟩\\n# Leadership\\n![⟨9⟩Demetri MaximChief Executive Officer](http://www.nephrogenbiotech.com/<#>)\\n![](https://cdn.prod.website-files.com/5ee3a102202f052ed7e8949d/5ef0ed1262129d4687de72ec_Demetri-Maxim.png)\\nDemetri Maxim\\nChief Executive Officer\\nDemetri is the Founder and CEO of Nephrogen and has been actively immersed in kidney disease research since he was 14 years old. He completed his undergraduate and graduate research training at Stanford University in the Division of Nephrology under the mentorship of Vivek Bhalla, Avnesh Thakor, and world renowned virologist, Mark Kay. Demetri also formerly worked in Dr. George Church’s lab at Harvard Medical School and with Dr. Terry Watnick at the National NIH center for Polycystic Kidney Disease (PKD) Research. Demetri’s family has PKD, and he founded Nephrogen based on his graduate research to realize his vision of curing all genetic kidney diseases by 2030.\\n![⟨10⟩Vivek Bhalla, MDChief Medical Advisor](http://www.nephrogenbiotech.com/<#>)\\n![](https://cdn.prod.website-files.com/5ee3a102202f052ed7e8949d/641dfee9bec8dac62d771a6e_vivek_bhalla_profile.webp)\\nVivek Bhalla, MD\\nChief Medical Advisor\\nDr. Vivek Bhalla is the Chief Medical Officer of Nephrogen and an Associate Professor of Medicine (Nephrology) at Stanford University. Using in vivo and in vitro approaches, Dr. Bhalla’s laboratory focuses on molecular mechanisms of diseases that involve the kidney, including diabetes and hypertension . As a physician-scientist and a practicing nephrologist, Dr. Bhalla has complementary clinical and translational research interests related to mechanisms of kidney disease and hypertension. He also has leadership roles both at Stanford and nationally. Dr. Bhalla founded and directs the nationally-accredited Stanford Hypertension Center and is Past Chair of the Council on Kidney and Cardiovascular Disease for the American Heart Association.\\n![⟨11⟩Chang Hong, JDChief Business Officer](http://www.nephrogenbiotech.com/<#>)\\n![](https://cdn.prod.website-files.com/5ee3a102202f052ed7e8949d/67ad0cf9d8da69b4b200ae48_Chang%20Hong.jpg)\\nChang Hong, JD\\nChief Business Officer\\nChang B. Hong, J.D., LL.M. leads Nephrogen\\'s corporate strategy, business development, legal and intellectual property functions. Chang brings two decades of experience as in-house counsel having advised private and public biotechnology, pharmaceutical, renewable fuels, and food tech companies. As a serial entrepreneur of biotech and sustainability companies, he has hands-on experience and a deep understanding of legal, R&D, operations and commercialization activities. Chang’s company affiliations during his career include Synlogic (NASDAQ: SYBX), GlycoFi (acquired- Merck), Pliv, Emergent Biosolutions, Joule, Lallemand, Glycobia, and Moonshot Bio. Chang is the founding member of Modality Law PLLC, a law firm focused on advising life sciences and emerging technology companies. His in-house and law firm experience spans corporate transactions, financing and governance; IP strategy and development; as well as regulatory, clinical and compliance matters. Chang is a registered U.S. patent attorney and holds a J.D. and an LL.M. from UNH Franklin Pierce School of Law and a B.S. in Biochemistry & Molecular Biology and Music from Dickinson College.\\n![⟨12⟩Fernando Gomez Garcia, PhDSenior Research Associate](http://www.nephrogenbiotech.com/<#>)\\n![](https://cdn.prod.website-files.com/5ee3a102202f052ed7e8949d/65dfd079263944170d96d55e_1.png)\\nFernando Gomez Garcia, PhD\\nSenior Research Associate\\nFernando graduated from the University of Almería (UAL) in 2020 with a Bachelor\\'s degree in Biotechnology. The following year, he obtained a Master\\'s degree in Biochemistry, Molecular Biology and Biomedicine at the Complutense University of Madrid (UCM). Fernando feels great interest in everything related to genomic editing, which is why he did his Master\\'s Thesis on genetic editing (CRISPR / Cas9) at the Gene Therapy Laboratory of the Carlos III Health Institute (ISCIII). Currently, he is doing a Doctorate in Molecular Medicine at the Laboratory of Genetics and Developmental Biology of Kidney Diseases (NefroCHUS) from the Health Research Institute of Santiago de Compostela (IDIS) and at the Genomics and Bioinformatics laboratory of the Center for Research in Molecular Medicine and Chronic Disease (CiMUS), where he has been awarded a predoctoral contract. The main theme of his thesis is the application of new genetic editing technologies (base editing and prime editing) in cell models and animals carrying genetic mutations that cause polycystic kidney disease (PKD). Among his objectives is to lay the foundations for, in the long term, develop a gene therapy that allows improving the quality of life of patients with this disease. Fernando is a Senior Research Associate at Nephrogen. \\n![⟨13⟩Erin MarbleResearch Associate](http://www.nephrogenbiotech.com/<#>)\\n![](https://cdn.prod.website-files.com/5ee3a102202f052ed7e8949d/674148375bf5cc587629d81d_Erin%20Marble%20Photo.png)\\nErin Marble\\nResearch Associate\\nErin is graduating with a Bachelor of Arts in Biology from the University of Pennsylvania, with a concentration in Mechanisms of Disease. She has done extensive research in developmental genomics, focusing on cell fate specification in the early C. elegans embryo in the Murray Lab. Erin also worked in the Betley lab investigating the neural basis of the prioritization of survival behaviors like hunger and fear. She is enthusiastic about genetic research and is dedicated to developing solutions and cures for genetic diseases that impact so many, especially at Nephrogen.\\n![⟨14⟩Miriam Rivera MorenoResearch Associate](http://www.nephrogenbiotech.com/<#>)\\n![](https://cdn.prod.website-files.com/5ee3a102202f052ed7e8949d/669a813aeb5edb7c7ebd489f_Miriam%20Headshot.jpeg)\\nMiriam Rivera Moreno\\nResearch Associate\\nMiriam comes to Nephrogen from her previous role as a Lab Operations intern at Biolabs@NYULangone, where she has developed a keen interest in innovation and the startup ecosystem. Miriam is a biotechnologist who recently graduated from the European University of Madrid. Simultaneously, sh earned her Postgraduate Diploma in Bioengineering from the University of California, Riverside. She feels passionate about scientific research and its potential to deliver impactful solutions to society. During her undergraduate training, she participated in several research projects, the most notable being CoralCure, where her team worked toward solving coral bleaching by genetically engineering the microbiota of the coral. This project significantly deepened her interest in synthetic biology and gene therapy. Miriam is an enthusiastic advocate of therapeutic solutions leveraging the latest advancements in biotechnology and she is now excited to contribute her expertise and passion as a biomedical research intern at Nephrogen.\\n# Advisors\\n![](https://cdn.prod.website-files.com/5ee3a102202f052ed7e8949d/5eebb03f1a6db1ed2bfaa01a_George-Church.png)\\nGeorge Church, PhD\\nProfessor of Genetics\\nGeorge Church is a Professor of Genetics at Harvard Medical School and the Director of PersonalGenomes.org, which provides the world\\'s only open-access information on human Genomic, Environmental & Trait data (GET). His 1984 Harvard PhD included the first methods for direct genome sequencing, molecular multiplexing & barcoding. These led to the first genome sequence (pathogen, Helicobacter pylori) in 1994 . His innovations have contributed to nearly all \"next generation\" DNA sequencing methods and companies (CGI-BGI, Life, Illumina, Nanopore). This plus his lab\\'s work on chip-DNA-synthesis, gene editing and stem cell engineering resulted in founding additional application-based companies spanning fields of medical diagnostics (Knome, Alacris, AbVitro, Pathogenica, Veritas Genetics) & synthetic biology / therapeutics (Joule, Gen9, Editas, Egenesis, enEvolv, WarpDrive). He has also pioneered new privacy, biosafety, ELSI, environmental & biosecurity policies. He is director of an IARPA BRAIN Project and NIH Center for Excellence in Genomic Science. His honors include election to NAS & NAE & Franklin Bower Laureate for Achievement in Science. He has coauthored 430 papers, 90 patent publications & one book (Regenesis).\\n![⟨15⟩George Church, PhDProfessor of GeneticsScientific Advisor](http://www.nephrogenbiotech.com/<#>)\\n![](https://cdn.prod.website-files.com/5ee3a102202f052ed7e8949d/641e0028657e66cfeb6ec853_photocache.70687.jpeg)\\nAvnesh Thakor, MD, PhD\\nAssociate Professor of Radiology, Stanford University\\nDr. Thakor is an Attending Interventional Radiologist who runs his own translational laboratory at Stanford University investigating the use of mesenchymal stem cell (MSC) based therapies and novel in vivo injection methods for delivering to traditionally difficult to reach organs such as the kidney and pancreas. Dr. Thakor leads the multidisciplinary Interventional Radiology Innovation at Stanford (IRIS) program and is a leader in the new emerging field of Interventional Regenerative Medicine. \\n![⟨16⟩Avnesh Thakor, MD, PhDAssociate Professor of Radiology, Stanford UniversityScientific Advisor](http://www.nephrogenbiotech.com/<#>)\\n![](https://cdn.prod.website-files.com/5ee3a102202f052ed7e8949d/641e365f8bbc471c6bb452f9_mark-kay_profilephoto.jpeg)\\nMark Kay, MD, PhD\\nProfessor of Genetics, Stanford University\\nDr. Kay is a leading researcher in the fields of gene therapy and adeno-associated virus (AAV) biology, including the identification of new AAV capsids. Dr. Kay is the head of the Division of Human Gene Therapy and professor in the Department of Pediatrics and Genetics at Stanford University School of Medicine. He is one of the founders of the American Society of Gene and Cell Therapy, served as its president from 2005-2006, and was the recipient of the society’s Outstanding Investigator Award in 2013. Dr. Kay received the E. Mead Johnson Award for Research in Pediatrics in 2000. He was elected to the American Society for Clinical Investigation in 1997 and the Association for American Physicians in 2010. He has organized many national and international conferences, including the first Gordon Conference related to gene therapy. Dr. Kay is respected worldwide for his work in vector development, gene therapy and non-coding RNA biology. He has published over 250 papers. He is currently the deputy editor of Human Gene Therapy and serves on the editorial boards of other peer-reviewed publications.\\n![⟨17⟩Mark Kay, MD, PhDProfessor of Genetics, Stanford UniversityScientific Advisor](http://www.nephrogenbiotech.com/<#>)\\n![](https://cdn.prod.website-files.com/5ee3a102202f052ed7e8949d/641e375b712abe41bbedcdbf_Watnick_Terry.png)\\nTerry Watnick, MD\\nDirector, Polycystic Kidney Disease Research Resource Consortium\\nDr. Watnick is a graduate of the Yale School of medicine and trained in Internal Medicine at Yale-New Haven Hospital. She completed both clinical and research fellowships in nephrology at the Johns Hopkins School of Medicine. During her research training, she became interested in inherited kidney diseases and specifically in autosomal dominant polycystic kidney disease (ADPKD). She has been involved in both basic and clinical research related to polycystic kidney disease. Her laboratory has been studying the vascular phenotype that is associated with PKD1/2 mutations in humans and in mice. She directs an inherited renal disease clinic and has served as the site prinicipal investigator for several clinical trials testing therapies in patients with ADPKD. She is also the Principal Investigator for a PKD Center of excellence that is one of 4 P30 Core centers funded by the NIH/NIDDK.\\n![⟨18⟩Terry Watnick, MDDirector, Polycystic Kidney Disease Research Resource ConsortiumScientific Advisor](http://www.nephrogenbiotech.com/<#>)\\n![](https://cdn.prod.website-files.com/5ee3a102202f052ed7e8949d/65b93f01904fa4cffecec816_IMG-0107.jpg)\\nVishal Patel, MD\\nProfessor of Medicine/Nephrology\\nDr. Patel is a Professor (with Tenure) in the Dept. of Internal Medicine at UT Southwestern Medical Center, where he holds the Yin Quan-Yuen Distinguished Professorship in Nephrology. He obtained his M.D. from India (2000) and completed his Internal Medicine residency at Northwestern University (2004) and clinical Nephrology fellowship at UT Southwestern (2005). Following his clinical training, he was an NIH-funded Physician-Scientist trainee at UT Southwestern (2005 to 2009), studying kidney genetics and primary cilia biology. In 2010, as an independent investigator, Dr. Patel charted a new course in the then little- studied non-coding RNA field. They investigate basic aspects of RNA biology (mRNA translation regulation, RNA chemical modifications, non-coding RNAs, etc.) in the context of polycystic kidney disease (PKD) and kidney development. Their seminal scientific contribution is devising a framework for an endogenous, mutation-agnostic, PKD1/2 mRNA therapy for autosomal dominant PKD, which has already progressed to human clinical trials. Dr. Patel’s lab has been continuously funded by the NIH since 2009 and has received additional funding from the Department of Defense. They have published their work in highly-regarded journals such as PNAS, Nature Communications, and Cell Metabolism. In 2017, Dr. Patel initiated the Comprehensive PKD and Kidney Genetics clinic at UT Southwestern, which is now among the largest nationally and was designated as a Center of Excellence by the PKD Foundation in 2023. Dr. Patel is a successful and sought-after mentor. He has mentored ten postdocs; six now have academic faculty appointments, including a K08-funded physician-scientist, a K01-funded basic scientist, and a 2023 K01 applicant. He has also mentored eight undergraduate students, including two who are now MD-PhDs, six women scientists, four URM trainees, and two first- generation college graduates. Dr. Patel is the founding Director of the Training Core of a proposed new multi-institutional (UTSW, UT Dallas, UT Arlington) predoc and postdoc NIH U2C/TL1 training program. Dr. Patel is active in several important national leadership positions. He serves NIH and DOD grant study sections, including as a study section chair. He is an Editor for Scientific Reports and Frontiers of Physiology. He is also the Chair of the scientific advisory committee for the PKD Foundation. He serves as a consultant for many pharmaceutical companies, and is an elected member of the ASCI.\\n![⟨19⟩Vishal Patel, MDProfessor of Medicine/NephrologyScientific Advisor](http://www.nephrogenbiotech.com/<#>)\\n![](https://cdn.prod.website-files.com/5ee3a102202f052ed7e8949d/5eebb04d6458cd08d3b4d636_Jan-Liphardt.png)\\nJan Liphardt, PhD\\nAssociate Professor of Bioengineering, Stanford University\\nDr. Liphardt is an Associate Professor of Bioengineering at Stanford University and a Professor in Residence at StartX. For his Ph.D. work at Cambridge University, he used computers, information theory, and statistics, such as stochastic context free grammars, to find patterns in genomes. He was a physics professor at UC Berkeley until 2013, when he moved to Stanford. Jan is a Sloan Research Fellow, a Searle Scholar, and has served on the board of numerous biotechnology companies.\\n![⟨20⟩Jan Liphardt, PhDAssociate Professor of Bioengineering, Stanford UniversityScientific Advisor](http://www.nephrogenbiotech.com/<#>)\\n# Investors\\n[](http://www.nephrogenbiotech.com/<https:/lsvp.com/>)[](http://www.nephrogenbiotech.com/<https:/startx.com/>)[](http://www.nephrogenbiotech.com/<https:/www.phoenixclub.vc/>)[](http://www.nephrogenbiotech.com/<https:/www.ycombinator.com/>)[](http://www.nephrogenbiotech.com/<https:/darwin-biotech.com/>)[](http://www.nephrogenbiotech.com/<https:/contrary.com/>)[](http://www.nephrogenbiotech.com/<https:/www.pillar.vc/>)[](http://www.nephrogenbiotech.com/<https:/www.2048.vc/>)\\n# Strategic Partners\\n[](http://www.nephrogenbiotech.com/<https:/www.otsuka-us.com/>)[](http://www.nephrogenbiotech.com/<https:/www.chiesiusa.com/>)[](http://www.nephrogenbiotech.com/<https:/www.bms.com/>)[](http://www.nephrogenbiotech.com/<https:/www.alnylam.com/>)\\nnews & publication⟨8⟩\\n## Browse our latest media\\nRenal plasticity revealed through reversal of polycystic kidney disease in miceNature GeneticsOctober 11, 2021⟨21⟩\\nUltrasound enhances therapeutic effect of MSC-derived extracellular vesicles in kidney injuryStem Cell Research & TherapySeptember 14, 2020⟨22⟩\\nUsing a barcoded AAV capsid library to select for clinically relevant gene therapy vectorsJCI InsightNovember 14, 2019⟨23⟩\\nGDNF drives rapid tubule morphogenesis in a novel 3D in vitro model for ADPKDJournal of Cell ScienceJuly 16, 2020⟨24⟩\\n![](https://cdn.prod.website-files.com/5ecebc340464b231587afbd4/5ecebcabb7c26608f84fa4fa_nephrogen-t-shirt-updated.png)\\nEmail⟨8⟩Instagram⟨8⟩Facebook⟨8⟩Twitter⟨8⟩Image License Info⟨25⟩Powered by Webflow⟨26⟩\\ninfo@nephrogenbiotech.comBiolabs @ NYU Langone\\u200d180 Varick StFloor 6New York, NY, 10014\\n' references_markdown='\\n\\n## References\\n\\n⟨1⟩ https://cdn.prod.website-files.com/5ecebc340464b231587afbd4/5ecefa146c2c8a1abe4babe9_nephrogenlogo.png: ![\\n⟨2⟩ http://www.nephrogenbiotech.com/<#Mission>: ABOUT\\n⟨3⟩ http://www.nephrogenbiotech.com/<#Therapeutics>: Technology\\n⟨4⟩ http://www.nephrogenbiotech.com/<#Team>: Team\\n⟨5⟩ http://www.nephrogenbiotech.com/<#News>: News\\n⟨6⟩ http://www.nephrogenbiotech.com/<#Contact>: Contact\\n⟨7⟩ https://cdn.prod.website-files.com/5ecebc340464b231587afbd4/5ecebc34cece3b996a4bdf91_arrow.svg: ![\\n⟨8⟩ http://www.nephrogenbiotech.com/<#>: Get the App\\n⟨9⟩ https://cdn.prod.website-files.com/5ee3a102202f052ed7e8949d/5ef0ed1262129d4687de72ec_Demetri-Maxim.png: ![\\n⟨10⟩ https://cdn.prod.website-files.com/5ee3a102202f052ed7e8949d/641dfee9bec8dac62d771a6e_vivek_bhalla_profile.webp: ![\\n⟨11⟩ https://cdn.prod.website-files.com/5ee3a102202f052ed7e8949d/67ad0cf9d8da69b4b200ae48_Chang%20Hong.jpg: ![\\n⟨12⟩ https://cdn.prod.website-files.com/5ee3a102202f052ed7e8949d/65dfd079263944170d96d55e_1.png: ![\\n⟨13⟩ https://cdn.prod.website-files.com/5ee3a102202f052ed7e8949d/674148375bf5cc587629d81d_Erin%20Marble%20Photo.png: ![\\n⟨14⟩ https://cdn.prod.website-files.com/5ee3a102202f052ed7e8949d/669a813aeb5edb7c7ebd489f_Miriam%20Headshot.jpeg: ![\\n⟨15⟩ https://cdn.prod.website-files.com/5ee3a102202f052ed7e8949d/5eebb03f1a6db1ed2bfaa01a_George-Church.png: ![\\n⟨16⟩ https://cdn.prod.website-files.com/5ee3a102202f052ed7e8949d/641e0028657e66cfeb6ec853_photocache.70687.jpeg: ![\\n⟨17⟩ https://cdn.prod.website-files.com/5ee3a102202f052ed7e8949d/641e365f8bbc471c6bb452f9_mark-kay_profilephoto.jpeg: ![\\n⟨18⟩ https://cdn.prod.website-files.com/5ee3a102202f052ed7e8949d/641e375b712abe41bbedcdbf_Watnick_Terry.png: ![\\n⟨19⟩ https://cdn.prod.website-files.com/5ee3a102202f052ed7e8949d/65b93f01904fa4cffecec816_IMG-0107.jpg: ![\\n⟨20⟩ https://cdn.prod.website-files.com/5ee3a102202f052ed7e8949d/5eebb04d6458cd08d3b4d636_Jan-Liphardt.png: ![\\n⟨21⟩ http://www.nephrogenbiotech.com/<https:/www.nature.com/articles/s41588-021-00946-4>: Renal plasticity revealed through reversal of polycystic kidney disease in miceNature GeneticsOctober 11, 2021\\n⟨22⟩ http://www.nephrogenbiotech.com/<https:/stemcellres.biomedcentral.com/articles/10.1186/s13287-020-01922-1>: Ultrasound enhances therapeutic effect of MSC-derived extracellular vesicles in kidney injuryStem Cell Research & TherapySeptember 14, 2020\\n⟨23⟩ http://www.nephrogenbiotech.com/<https:/insight.jci.org/articles/view/131610>: Using a barcoded AAV capsid library to select for clinically relevant gene therapy vectorsJCI InsightNovember 14, 2019\\n⟨24⟩ http://www.nephrogenbiotech.com/<https:/journals.biologists.com/jcs/article/133/14/jcs249557/224910/GDNF-drives-rapid-tubule-morphogenesis-in-a-novel>: GDNF drives rapid tubule morphogenesis in a novel 3D in vitro model for ADPKDJournal of Cell ScienceJuly 16, 2020\\n⟨25⟩ http://www.nephrogenbiotech.com/</image-license-info>: Image License Info\\n⟨26⟩ http://www.nephrogenbiotech.com/<http:/webflow.com>: Powered by Webflow\\n' fit_markdown='' fit_html=''",
  "generated_description": "### Nephrogen: Pioneering Gene Therapies for Kidney Diseases\n\n**Overview**\nNephrogen is an innovative biotech company founded in 2020 and based in New York, specializing in curative gene therapies for kidney diseases. Initially launched as part of Y Combinator's Summer 2020 batch, the company aims to tackle autosomal dominant polycystic kidney disease (ADPKD), a genetic condition affecting around 600,000 Americans currently without an effective treatment or cure.\n\n**Mission**\nAt Nephrogen, the mission is clear: to revolutionize treatment for life-threatening kidney diseases through advanced gene therapy technologies. Their commitment is to provide tangible solutions for patients impacted by kidney ailments, marking a significant shift in therapeutic approaches. \n\n**Technology**\nNephrogen’s therapeutic platform aggressively combines CRISPR-Cas genome editing with cutting-edge delivery methods like adeno-associated viruses (AAVs) and lipid nanoparticles (LNPs). This innovative design allows them to target kidney diseases with high precision and efficacy:\n- **Maximum Therapeutic Effect:** A novel, non-invasive method for localized delivery of gene therapy.\n- **Precision Delivery:** Enhanced AAVs optimized through directed evolution to significantly improve targeting efficiency.\n- **Personalized Approach:** Focus on distinct gene targets responsible for ADPKD.\n\nThey also integrate modern technologies like computer vision and high-throughput screening to accelerate drug discovery for other cystic kidney diseases.\n\n**The Team**\nNephrogen operates with a small, yet highly capable team led by CEO Demetri Maxim, whose personal connection to kidney health drives his dedication. The team includes experts well-versed in both clinical and research environments, such as Dr. Vivek Bhalla, their Chief Medical Advisor, who is also an Associate Professor at Stanford University. The company also boasts a robust advisory team filled with prominent figures in genetics and nephrology.\n\n**Advisors and Collaborations**\nThe advisory board includes esteemed scientists, such as Dr. George Church from Harvard Medical School and Dr. Mark Kay, who has made significant advancements in gene therapy research. Their expertise strengthens Nephrogen's research and development pipeline and opens doors to potential collaborations.\n\n**In Summary**\nNephrogen is not just developing treatments; they're reimagining how kidney diseases are approached on a genetic level. With a potent blend of innovative technology, a passionate team, and a compelling mission, Nephrogen stands at the forefront of a potentially transformative shift in kidney care. It’s a bold leap towards curing what was once deemed incurable, making this company one to watch as it forges a new path in biotech. \n\nFor more information, check out their website at [Nephrogen Biotech](http://www.nephrogenbiotech.com)."
}