{
  "links": "https://www.ycombinator.com/companies/jumpstart",
  "name": "Novel",
  "headline": "Novel is your international business bank account",
  "batch": "S20",
  "description": "With Novel, international founders can get a U.S. business bank account, multi-currency wallets, global transfers in 140+ currencies, and more all in a single place.",
  "activity_status": "Active",
  "website": "https://www.trynovel.com/",
  "founded_date": 2021.0,
  "team_size": 15.0,
  "location": "Minneapolis, MN",
  "group_partner": "Gustaf Alstromer",
  "group_partner_yc": "https://www.ycombinator.com/people/gustaf-alstromer",
  "company_linkedin": null,
  "company_twitter": null,
  "tags": "industry:fintech; industry:saas",
  "founders": [
    {
      "name": "Aldrin Clement",
      "description": "Founder at Jumpstart (YC S20) | ex-Deloitte Consulting | named after buzz aldrin",
      "linkedin": "https://www.linkedin.com/in/aldrin-clement/"
    },
    {
      "name": "Paul Clement",
      "description": null,
      "linkedin": null
    }
  ],
  "status": true,
  "markdown": "raw_markdown=\"404\\n# Page not found\\nThe page you are looking for doesn't exist or has been moved.\\n\" markdown_with_citations=\"404\\n# Page not found\\nThe page you are looking for doesn't exist or has been moved.\\n\" references_markdown='\\n\\n## References\\n\\n' fit_markdown='' fit_html=''",
  "generated_description": "**Company Overview: Novel**\n\nFounded in 2021 and hailing from Minneapolis, MN, Novel is a fintech startup aiming to simplify international banking for businesses. As part of the Y Combinator Batch S20, it has quickly carved out a niche by providing essential banking services tailored for international founders. With a small but dedicated team of 15 employees, Novel combines innovative technology with user-centric design to create a streamlined banking experience.\n\n**Mission Statement:**\nNovel's mission is straightforward: they position themselves as your international business bank account. They empower overseas entrepreneurs by offering a comprehensive suite of financial tools all under one roof.\n\n**Core Offerings:**\nAt its core, Novel provides:\n- **U.S. Business Bank Accounts**: Giving international founders access to essential banking services in the U.S.\n- **Multi-Currency Wallets**: Enabling users to hold and manage funds in multiple currencies, reducing the hassles of currency conversion.\n- **Global Transfers**: Facilitating seamless transactions across 140+ currencies, making it easier for businesses to operate on a global scale.\n\nThese features cater to the rising demand for accessible, user-friendly banking solutions in an increasingly interconnected world. \n\n**Leadership and Community:**\nUnder the guidance of Group Partner Gustaf Alstromer, Novel has positioned itself firmly within the burgeoning fintech space, joining the ranks of SaaS companies revolutionizing financial services.\n\n**Website and Contact:**\nTo learn more about Novel and their innovative offerings, visit their website at [trynovel.com](https://www.trynovel.com/).\n\nIn summary, Novel is proving that while banking may often seem cumbersome, it doesn’t have to be. With a clear focus on international business needs and the agility of a startup, they represent a new wave of financial solutions tailored for the modern entrepreneur."
}