{
  "links": "https://www.ycombinator.com/companies/offbeast",
  "name": "OffBeast",
  "headline": "We make plant-based steaks with an authentic texture",
  "batch": "W22",
  "description": "OffBeast is on a mission to bring bold, crave-worthy plant-based steaks to the plate. Our products are made with our proprietary manufacturing platform that creates plant-based meats with an unprecedented authentic texture at scale. More than 85% of our customers agree that OffBeast products have the best texture they've ever had in a plant-based meat product.",
  "activity_status": "Active",
  "website": "https://www.offbeast.com",
  "founded_date": 2022.0,
  "team_size": 7.0,
  "location": "Baltimore, MD",
  "group_partner": null,
  "group_partner_yc": null,
  "company_linkedin": null,
  "company_twitter": null,
  "tags": "industry:clean-meat; industry:cultured-meat; industry:climate; industry:food-tech",
  "founders": [
    {
      "name": "Insa Mohr, Founder",
      "description": "Insa is the co-founder of OffBeast creating plant-based whole cuts. She has a background in information technologies and finance. But most importantly, she is an animal-lover that is excited about finding solutions to make the world more ethical and sustainable.  \n\nIn her spare time, Insa loves tinkering, climbing, and arts. She also loves meeting fellow founders or other people from the industry - reach out if you want to grab a virtual coffee with her!",
      "linkedin": "https://www.linkedin.com/in/insa-m-mohr-54078473/"
    }
  ],
  "status": true,
  "markdown": "raw_markdown='For restaurants \\nFor restaurants \\nWAITLIST \\nOffBeast Premium Vegan ribeyes \\nNow shipping to the US \\nWAITLIST \\nFor restaurants \\nShop now \\nA\\n' markdown_with_citations='For restaurants \\nFor restaurants \\nWAITLIST \\nOffBeast Premium Vegan ribeyes \\nNow shipping to the US \\nWAITLIST \\nFor restaurants \\nShop now \\nA\\n' references_markdown='\\n\\n## References\\n\\n' fit_markdown='' fit_html=''",
  "generated_description": "**OffBeast: The Future of Plant-Based Steaks**\n\nFounded in 2022 and currently part of Y Combinator's Batch W22, OffBeast is on a mission to revolutionize the plant-based meat industry with a focus on delivering bold, crave-worthy steaks. Hailing from Baltimore, MD, this startup is steadily building a team of 7 passionate individuals dedicated to creating a new category of meat alternatives.\n\nThe core innovation at OffBeast lies in its proprietary manufacturing platform, which enables the production of plant-based steaks with an authentic texture that has garnered rave reviews. In fact, over 85% of their customers agree that OffBeast's offerings deliver the best texture they've experienced in plant-based meats. This is a critical factor for a segment of the market that often grapples with the texture of alternatives to meat.\n\nTheir product line currently features OffBeast Premium Vegan Ribeyes, which are now shipping across the United States. They’re targeting both retail customers and restaurants, encouraging those in the food service industry to join the waitlist for their products.\n\nThe company is positioned at the intersection of several important trends: clean meat, cultured meat, climate awareness, and food tech. These tags are more than just keywords; they represent OffBeast's commitment to sustainable and innovative food solutions in a rapidly evolving marketplace.\n\nWith an ambitious trajectory fueled by cutting-edge technology and a clear understanding of consumer desire for authentic plant-based options, OffBeast stands ready to make its mark in the food industry.\n\nYou can learn more about their mission and check out their products at [OffBeast.com](https://www.offbeast.com)."
}