{
  "links": "https://www.ycombinator.com/companies/ohmic-biosciences",
  "name": "Ohmic Biosciences",
  "headline": "Genetically engineering plants for disease resistance.",
  "batch": "S23",
  "description": "Pests and pathogens cost the world hundreds of billions of dollars every year. Existing technologies like agrochemicals are no longer working. Ohmic Biosciences uses protein engineering to design resistance genes for crops that are robust to pathogen evolution.",
  "activity_status": "Active",
  "website": "https://ohmicbiosciences.com/",
  "founded_date": 2021.0,
  "team_size": 2.0,
  "location": "Alameda, CA",
  "group_partner": null,
  "group_partner_yc": null,
  "company_linkedin": null,
  "company_twitter": null,
  "tags": "industry:synthetic-biology; industry:biotech; industry:climate; industry:agriculture; industry:genetic-engineering; location:san-francisco-bay-area",
  "founders": [
    {
      "name": "PJ Steiner, Founder",
      "description": "I'm a protein engineer, synthetic biologist, and computer scientist. I studied computer science at MIT (SB/MEng) and then synthetic biology at Cambridge (PhD) and UCSD (postdoc). After two years as a scientist at Bolt Threads engineering yeast for protein production, I moved to the University of Colorado Boulder to work on a DARPA project using protein engineering to turn plants into chemical biosensors. My co-founder Matt and I founded Ohmic to make plants resistant to disease.",
      "linkedin": "https://linkedin.com/in/pjsteiner"
    },
    {
      "name": "Matthew Bedewitz, Founder",
      "description": "I'm a plant biochemist with experience in protein engineering, genetics and analytical chemistry. I studied Horticulture Science (BS), and then Plant Breeding, Genetics, and Biotechnology (PhD) at Michigan State where I characterized enzymes in tropane alkaloid production for nerve agent antidotes and stimulants (including cocaine). That work led me to a DARPA protein engineering project where I met my cofounder, PJ, and we decided to use our skills to tackle crop disease resistance.",
      "linkedin": "https://linkedin.com/in/matthew-bedewitz-915848239"
    }
  ],
  "status": true,
  "markdown": "raw_markdown='![](https://ohmicbiosciences.com/OhmicBiosciences.svg)\\nCombining protein engineering and synthetic biology to create durable solutions to any disease in any crop. \\n[ ![](https://ohmicbiosciences.com/Twitter.png) ](https://ohmicbiosciences.com/<https:/twitter.com/ohmicbio>)\\n[ ![](https://ohmicbiosciences.com/LinkedIn.png) ](https://ohmicbiosciences.com/<https:/www.linkedin.com/company/ohmic-biosciences>)\\n' markdown_with_citations='![](https://ohmicbiosciences.com/OhmicBiosciences.svg)\\nCombining protein engineering and synthetic biology to create durable solutions to any disease in any crop. \\n ![⟨1⟩ ](https://ohmicbiosciences.com/<https:/twitter.com/ohmicbio>)\\n ![⟨2⟩ ](https://ohmicbiosciences.com/<https:/www.linkedin.com/company/ohmic-biosciences>)\\n' references_markdown='\\n\\n## References\\n\\n⟨1⟩ https://ohmicbiosciences.com/Twitter.png:  ![\\n⟨2⟩ https://ohmicbiosciences.com/LinkedIn.png:  ![\\n' fit_markdown='' fit_html=''",
  "generated_description": "Ohmic Biosciences is a forward-thinking biotech startup founded in 2021 and currently part of Y Combinator's Summer 2023 batch. Based in Alameda, California, this nimble team of two is on a mission to tackle one of agriculture's biggest challenges: disease in crops. As pests and pathogens cost the global economy hundreds of billions annually and traditional solutions like agrochemicals fall short, Ohmic is stepping up with a fresh approach.\n\nThe company's strategy focuses on genetic engineering, specifically protein engineering, to design durable resistance genes that can adapt as pathogens evolve. This creates a robust defense for various crops, ultimately aiming to enhance food security and agricultural sustainability.\n\nOhmic Biosciences is deeply entrenched in the realms of synthetic biology and climate science, which aligns with the broader biotech and agricultural revolutions underway. They're tagged with keywords like 'genetic-engineering,' 'biotech,' and 'climate,' reflecting the importance of their work in forging resilient agricultural solutions.\n\nIf you want to learn more about their innovative efforts, check out their website at [Ohmic Biosciences](https://ohmicbiosciences.com/).\n\nIn a nutshell, Ohmic Biosciences is paving the way for healthier crops and a more sustainable future in agriculture—just what we need in a world facing increasing environmental pressures and food supply challenges."
}