{
  "links": "https://www.ycombinator.com/companies/okteto",
  "name": "Okteto",
  "headline": "Cloud Development Environments with one click",
  "batch": "W19",
  "description": "At Okteto, we are working hard at creating the next-generation development experience for teams of all sizes. Have you ever seen how long it takes a developer to set up everything they need before working on a feature? We are fixing that.  We want developers to focus on building value for their teams instead of wasting time setting up local environments or trying to debug \"production only\" issues.",
  "activity_status": "Active",
  "website": "https://okteto.com",
  "founded_date": 2018.0,
  "team_size": 30.0,
  "location": "San Francisco",
  "group_partner": null,
  "group_partner_yc": null,
  "company_linkedin": null,
  "company_twitter": null,
  "tags": "industry:developer-tools; industry:saas; industry:b2b; industry:open-source; industry:kubernetes; location:san-francisco-bay-area",
  "founders": [
    {
      "name": "Ramiro Berrelleza, Founder",
      "description": "Ramiro Berrelleza is one of the founders of Okteto. He has spent most of his career (and his free time) building cloud services and developer tools. Before starting Okteto, Ramiro was an Architect at Atlassian, a Software Engineer in ElasticBox and a Software Engineer in Microsoft Azure. Originally from Mexico, he currently lives in San Francisco.",
      "linkedin": "https://www.linkedin.com/in/ramiroberrelleza/"
    },
    {
      "name": "Pablo Chico de Guzman, Founder/CTO",
      "description": "Founder @Okteto (www.okteto.com) helping companies to adopt Kubernetes and accelerate their development workflows.\nPreviously, I worked @Docker in the Docker Cloud project (formerly Tutum), a container platform to take full advantage of the amazing technology that Docker containers are.\nAs a Docker Community Leader, I organize the Docker Madrid and Cloud-Native Madrid Meetups, a group of 4000 enthusiastic DevOps, that find Docker and Kubernetes useful on their day-to-day work.",
      "linkedin": "https://www.linkedin.com/in/pchico/"
    },
    {
      "name": "Ramon Lamana, Founder",
      "description": "User-focused to the core, Ramon worked at Google in consumer products like Inbox by Gmail and YouTube. For many years he dedicated his efforts to improving the developer experience for tools at Elasticbox or EyeOS, a pioneer in the virtualization of workspaces in the browser.",
      "linkedin": "https://www.linkedin.com/in/rlamana/"
    }
  ],
  "status": true,
  "markdown": "raw_markdown=\"This website stores cookies on your computer. These cookies are used to collect information about how you interact with our website and allow us to remember you. We use this information in order to improve and customize your browsing experience and for analytics and metrics about our visitors both on this website and other media. To find out more about the cookies we use, see our Privacy Policy.\\nWe won't track your information when you visit our site. But in order to comply with your preferences, we'll have to use just one tiny cookie so that you're not asked to make this choice again.\\nAcceptDecline\\n5 steps to bring DevX automation to your company\\n[Get the guide →](https://okteto.com/<https:/www.okteto.com/ebooks/5-steps-to-scoping-your-cloud-native-devx-automation-project/>)\\n✕\\n[](https://okteto.com/</>)\\n  * Product\\n  * [Pricing](https://okteto.com/</pricing/>)\\n  * [Customers](https://okteto.com/</customers/>)\\n  * [Docs](https://okteto.com/</docs/welcome/overview/>)\\n  * [Blog](https://okteto.com/</blog/>)\\n  * Resources\\n\\n\\n  * [Take a tour](https://okteto.com/</tour/>)\\n  * [Get a demo](https://okteto.com/</get-demo/>)\\n\\n\\n  * Product\\n  * [Pricing](https://okteto.com/</pricing/>)\\n  * [Customers](https://okteto.com/</customers/>)\\n  * [Docs](https://okteto.com/</docs/welcome/overview/>)\\n  * [Blog](https://okteto.com/</blog/>)\\n  * Resources\\n  * [Take a tour](https://okteto.com/</tour/>)\\n  * [Get a demo](https://okteto.com/</get-demo/>)\\n\\n\\n# Stop losing hours struggling with local environments\\nDiscover self-service ephemeral environments that give teams time back for innovation\\n[Get a demo](https://okteto.com/</get-demo/>)[Take a tour](https://okteto.com/</tour/>);\\nDriving innovation together with our customer community\\n[![Talon](https://cdn.sanity.io/images/6icyfeiq/production/0448ea9ab55988c6989f4310127d9db40d4a3f5d-498x95.svg)](https://okteto.com/<https:/talon-sec.com/>)[![monday.com](https://cdn.sanity.io/images/6icyfeiq/production/ea462ad717901e6307784c09b999fc5922e67241-326x60.svg)](https://okteto.com/<https:/www.monday.com/>)[![LaunchDarkly](https://cdn.sanity.io/images/6icyfeiq/production/2d6933fc1badc391c818660954385ff408aefe84-5682x877.svg)](https://okteto.com/<https:/launchdarkly.com/>)[![Mercadona](https://cdn.sanity.io/images/6icyfeiq/production/ed5d1ceb27c09473ef9a7a7e0d766cb3a0e819ce-637x108.svg)](https://okteto.com/<https:/www.mercadona.es/>)[![Yotpo](https://cdn.sanity.io/images/6icyfeiq/production/fc9a1efb3a171d9169b048a15e4a5636c64fe759-113x32.svg)](https://okteto.com/<https:/www.yotpo.com/>)[![Replicated](https://cdn.sanity.io/images/6icyfeiq/production/83dde6dcd93ecf8264fc6897484b4ed8d8cfdc23-915x222.svg)](https://okteto.com/<https:/www.replicated.com/>)[![Hello Heart](https://cdn.sanity.io/images/6icyfeiq/production/a4e6e2c5489423be83f1c729ba0f02040a2c37ef-1911x277.svg)](https://okteto.com/<https:/www.helloheart.com/>)\\n[![Talon](https://cdn.sanity.io/images/6icyfeiq/production/0448ea9ab55988c6989f4310127d9db40d4a3f5d-498x95.svg)](https://okteto.com/<https:/talon-sec.com/>)[![monday.com](https://cdn.sanity.io/images/6icyfeiq/production/ea462ad717901e6307784c09b999fc5922e67241-326x60.svg)](https://okteto.com/<https:/www.monday.com/>)[![LaunchDarkly](https://cdn.sanity.io/images/6icyfeiq/production/2d6933fc1badc391c818660954385ff408aefe84-5682x877.svg)](https://okteto.com/<https:/launchdarkly.com/>)[![Mercadona](https://cdn.sanity.io/images/6icyfeiq/production/ed5d1ceb27c09473ef9a7a7e0d766cb3a0e819ce-637x108.svg)](https://okteto.com/<https:/www.mercadona.es/>)[![Yotpo](https://cdn.sanity.io/images/6icyfeiq/production/fc9a1efb3a171d9169b048a15e4a5636c64fe759-113x32.svg)](https://okteto.com/<https:/www.yotpo.com/>)[![Replicated](https://cdn.sanity.io/images/6icyfeiq/production/83dde6dcd93ecf8264fc6897484b4ed8d8cfdc23-915x222.svg)](https://okteto.com/<https:/www.replicated.com/>)[![Hello Heart](https://cdn.sanity.io/images/6icyfeiq/production/a4e6e2c5489423be83f1c729ba0f02040a2c37ef-1911x277.svg)](https://okteto.com/<https:/www.helloheart.com/>)\\n## [](https://okteto.com/<#transform-development-for-your-company>)Transform development for your company\\nOkteto transforms the way developers build, test, and deploy by eliminating the hassle of manual setup and configuration. With Okteto, your team can skip hours of preparation and jump straight into coding within minutes. Our platform automates environment provisioning, reduces build times, and accelerates testing, enabling rapid iteration and faster deployment cycles. By delivering pre-configured ephemeral environments on demand, Okteto streamlines onboarding for new developers, empowering them to be productive from day one. Whether you’re looking to cut setup time, speed up feedback loops, or reduce the ramp-up period for new team members, Okteto boosts productivity across every stage of your development process.\\n[Calculate your ROI](https://okteto.com/</roi>)\\n### Monday.com Success\\nWith less time and resources spent on managing the complexities of environment setups, developers are more productive and new team members onboard quickly.\\n+50%\\nProductivity\\n-50%\\nScrap work\\n+150%\\nAdoption growth\\n### Playable Worlds Success\\nA DevX-first approach automates the development inner loop, shifting left the verification process for each developer. Outcomes include increased productivity, reduced cognitive load, and enhanced velocity.\\n$1M\\nEngineering savings\\n90%\\nReduced waste\\n75%\\nIncreased velocity\\n### Replicated Success\\nOkteto removes the need for engineers to be highly skilled in Kubernetes, making it easier and faster to onboard new team members and get them straight to delivering business value.\\n+200%\\nProductivity\\n$10,000 \\nMonthly savings\\n## [](https://okteto.com/<#solutions-that-help-your-teams-ship-faster>)Solutions that help your teams ship faster\\n## [](https://okteto.com/<#shorten-the-inner-development-loop>)Shorten the inner development loop\\nNo more waiting around for builds. Code synchronization lets developers instantly see changes in their ephemeral environments, reducing the typical 5-10 minute build cycle to just 1-3 seconds. Cloud-based builds further accelerate workflows by running on powerful cloud hardware with optimized caching, enabling rapid iteration in complex environments.\\n**Reduce build waits by 97% with Okteto, from 40 minutes to a single minute, empowering quick feedback loops.**\\nThese tools streamline onboarding with ready-to-go environments and keep developers focused on innovation, reducing delays from code to deployment.\\n[Take a tour](https://okteto.com/<https:/www.okteto.com/tour/hot-reloading/>)\\n![Loop of Okteto process - Test, Code and Build](https://cdn.sanity.io/images/6icyfeiq/production/8439cbaf77402a376ada9bb6390acbbffede656e-469x317.svg)\\n![Marc Campbell](https://okteto.com)![Marc Campbell](https://cdn.sanity.io/images/6icyfeiq/production/6b8bd258cf660df1894613f920bdf3aaef512e5b-306x306.jpg?w=72&h=72&q=75&fit=max&auto=format)\\nMarc Campbell\\nCTO & Co-Founder, Replicated\\nOkteto just works; with it we can set the bar higher with what we expect from the dev environment and our team.\\n![Typical Okteto process - Modern development, test and product team](https://cdn.sanity.io/images/6icyfeiq/production/6b1862b8934bff680063f1bc3452c1d1c0c8b651-430x297.svg)\\n## [](https://okteto.com/<#focus-on-code-not-configurationaccelerate-developer-roi>)Focus on Code, Not Configuration—Accelerate Developer ROI\\nDevelopers don’t have to spend their valuable time managing local environments, and Okteto is here to help. Our one-click environments free up time for coding and innovation making productivity gains easy. Reclaim up to 250+ hours per developer annually with Okteto, cutting environment setup to zero hassle.\\n## [](https://okteto.com/<#standardize-and-streamline-workflows>)Standardize and streamline workflows\\nDefine, provision, and customize development environments and all dependencies with ease, ensuring consistency across your entire organization. Say goodbye to manual configurations and hello to streamlined development workflows, accelerating innovation and collaboration.\\n[Take a tour](https://okteto.com/<https:/www.okteto.com/tour/manage-devx/>)\\n![Okteto workflows from dev to prod](https://cdn.sanity.io/images/6icyfeiq/production/c67d981066f50a20cf769be37b19d3e647cbaed5-447x206.svg)\\n![Lior Rabin](https://okteto.com)![Lior Rabin](https://cdn.sanity.io/images/6icyfeiq/production/1df358da1425d20d47aeb2d97c63f73327eaff76-460x460.png?w=72&h=72&q=75&fit=max&auto=format)\\nLior Rabin\\nInfrastructure Tech Lead, monday.com\\nThe productivity increase is huge. Developers don't need any extra time handling environment setup and can work on what matters, which is the product itself.\\n[View product tour](https://okteto.com/</tour/manage-devx/>)\\n![Okteto dashboard ui](https://okteto.com)![Okteto dashboard ui](https://cdn.sanity.io/images/6icyfeiq/production/c39d3538dfc8c5b8b187f78040e541d3584b8605-786x584.png?w=786&h=584&q=75&fit=max&auto=format)\\n## [](https://okteto.com/<#take-okteto-for-a-test-drive>)Take Okteto for a test drive\\nWhether you're new to the platform or looking to dive deeper into features, our guided tour shows how Okteto works and how it can benefit your team.\\n  * **Streamlined development workflow:** Spin up ephemeral development environments inside Kubernetes\\n  * **Preview environments:** Okteto automatically spins up preview environments on every Git pull request\\n  * **Hot reloading:** App developers can code locally and instantly see changes inside the production-like dev environment, all before merge\\n  * **Platform management** : As a platform engineer, see how to define, deploy and manage environments in Okteto\\n\\n\\n![Different teams using Okteto](https://cdn.sanity.io/images/6icyfeiq/production/9b7205d05e77ff1f4d53c59a1fc83b579e1a7210-479x292.svg)\\n## **Empower your teams with self-service development**\\nTailor development environments to match specific project requirements, ensuring that each team has the tools and resources they need to succeed. Developers can easily spin up their own development environments on demand, eliminating the need to wait for infrastructure provisioning. \\n[Take a tour](https://okteto.com/<https:/www.okteto.com/tour/catalog/>)\\n## [](https://okteto.com/<#accelerate-testing-and-collaboration-with-preview-environments>)Accelerate Testing and Collaboration with Preview Environments\\nOkteto streamlines CI/CD processes by automatically creating instant preview environments for every pull request. Okteto gives teams immediate access to a production-like environment, enabling fast, effective testing and reducing time spent waiting for feedback. With instant preview environments, feedback loops are shortened, allowing teams to iterate quickly, respond to feedback, and bring new features to market faster and with higher quality.\\nSpend an hour less each day on testing—Okteto speeds up feedback cycles, boosting development velocity and quality.\\n[Take a tour](https://okteto.com/<https:/www.okteto.com/tour/preview-environments/>)\\n![Different team using Okteto Preview Environments](https://cdn.sanity.io/images/6icyfeiq/production/1596e16fcc2bb59ce069d8238f4f2183965fc505-473x253.svg)\\n## [](https://okteto.com/<#what-our-customers-say>)What our customers say\\n[Read our reviews on G2](https://okteto.com/<https:/www.g2.com/products/okteto/reviews>)\\n  * ### Great for shift-left testing and quickie demo envionrments\\nHeath H. | Lead Automation Engineer\\nOkteto provides a very comprehensive solution for managing our Docker containers used in pre-merge testing, with extensive environment visibility and management as well as user access controls. It provides a modern, smooth, easy-to-use interface. Beyond the tool is the fantastic, personalized support and engagement from the Okteto team.\\n  * ### Preview Environments are a breeze with Okteto\\nJohn C. | Cofounder & CTO\\nWe had an internal development team maintaining our preview environments that we spin up for automated tests in CI. The previews never worked exactly the way we wanted and the took our engineers away from what they needed to be focused on: our product! We switched over Okteto Enterprise and couldn't be happier. We use Okteto to automaticall spin up the environments using their GitHub Action whenever pull requests are created. The automated tests run against the environments in the cloud and are torn down the the testing process completes. If we need to make an environment stay active longer, we add a custom label to the PR and the environment will stay active until the PR is closed. The whole process is great and we never have to worry about it. It just works.\\n  * ### Okteto is awesome!\\nLeonid M. | CTO\\nWe use Okteto daily and it drastically shortened our cycles, everyone from QA engineers to business steakholders are now in the loop on all the changes and can approve them or provide feedback before it hits our staging environment.\\n  * ### Growth enabler \\nAnts K. | VP of Product Engineering\\nKatana has evolved beyond the limitations of traditional local development environments, where the entire ecosystem was once hosted on a single PC or localhost setup. Today, engineers can spin up specific environments tailored to the areas of the product they need to work on, significantly improving development efficiency and reducing resource overhead.\\nOur partnership with Okteto has been key in this transformation. The collaboration with Okteto has been seamless, with their team consistently going above and beyond to provide guidance and support. Their proactive approach and dedication to customer success has been noticeable.\\n  * ### Streamlines development process\\nSophia S. | Consultant\\nThe best thing about Okteto is how it streamlines our development process for cloud-native applications by providing a fully automated development environment in Kubernetes. Okteto allows our developers to spin up replicas of their production environments quickly, so they can test and iterate code directly in a Kubernetes environment without managing infrastructure.\\nThis means our devs move fast and save multiple hours per days with removed manual tasks associated with managing environments.\\n  * ### Excellent tool simplify development for complex Kubernetes apps\\nMichial D. | Front End Developer\\nIt just improves the developer experience tremendously. It requires a bit of effort to setup depending on your specific usecase but after that it saves the developers a lot of frustration and time. It means that when you onboard a developer, he basically only needs to install a cli tool and run 2 commands and he/she will have full access to a fully configured dev environment that also closely mirrors production. The developer will not have to spend any time on configuring architecture or secrets, benefitting security as well.\\n\\n\\n## [](https://okteto.com/<#a-complete-platform-for-teams-who-care-about-devx>)A complete platform for teams who care about DevX\\n![](https://cdn.sanity.io/images/6icyfeiq/production/861d84ef244d60fc2f85ba9480071c4ac589d9ff-35x35.svg)\\n### Production-like Environments\\nThe easiest and most reliable way to ensure what works in development will work in production\\n![](https://cdn.sanity.io/images/6icyfeiq/production/c107f439810dacee08865ae0e5322b890fabbb34-35x35.svg)\\n### Self-service Automation\\nProvision any cloud resources (storage buckets, databases, etc.) your application needs in a single click\\n![](https://cdn.sanity.io/images/6icyfeiq/production/1a5e0d8349e2ddb222a15e22163981f9deb3b249-35x35.svg)\\n### Manifest Driven Experience\\nDefine all of your environments in a single manifest to ensure repeatability, trust and standardization\\n![](https://cdn.sanity.io/images/6icyfeiq/production/a5122484b916346ada9cfbce8b2fc18b6a9c4a33-35x35.svg)\\n### Developer Approved\\nDevelopers code in their favorite IDE, save changes, and see the results immediately on a Kubernetes development environment\\n![](https://cdn.sanity.io/images/6icyfeiq/production/8ec60175479ecd7793d2ddae142f15f5073ea1f8-35x35.svg)\\n### Cost Control\\nHave a controlled and automated solution for expensive, long-running environments\\n![](https://cdn.sanity.io/images/6icyfeiq/production/ec6c454572d67bff80c5c03c77debce3019c98f4-35x35.svg)\\n### Easy Onboarding\\nEliminate the onboarding friction by delivering ready-to-use development environments for new team members. Onboard new developers 50% faster—Okteto reduces ramp-up from 90 days to 45 days, accelerating team growth.\\n[Platform features](https://okteto.com/<https:/www.okteto.com/platform-features/>)\\n![](https://okteto.com)![](https://cdn.sanity.io/images/6icyfeiq/production/f9e69c9ace20360e370e1b46e818d0dc1a7f79d4-1400x788.jpg?w=1400&h=788&q=75&fit=max&auto=format)\\nHear from companies building modern DevX\\n## [](https://okteto.com/<#see-how-our-customers-are-unlocking-200percent-increases-in-development-roi>)See how our customers are unlocking 200% increases in development ROI\\n[![monday.com](https://cdn.sanity.io/images/6icyfeiq/production/ea462ad717901e6307784c09b999fc5922e67241-326x60.svg)](https://okteto.com/<https:/www.okteto.com/customers/monday-com/>)[![LaunchDarkly](https://cdn.sanity.io/images/6icyfeiq/production/2d6933fc1badc391c818660954385ff408aefe84-5682x877.svg)](https://okteto.com/<https:/www.okteto.com/customers/launchdarkly/>)[![Replicated](https://cdn.sanity.io/images/6icyfeiq/production/83dde6dcd93ecf8264fc6897484b4ed8d8cfdc23-915x222.svg)](https://okteto.com/<https:/www.okteto.com/customers/replicated/>)[![Privacy Dynamics](https://cdn.sanity.io/images/6icyfeiq/production/610d66c02ef6610b3d526eca2a6be8010b392cbe-1920x281.png)](https://okteto.com/<https:/www.okteto.com/customers/privacy-dynamics/>)\\n## [](https://okteto.com/<#keep-exploring>)Keep exploring...\\nAutomating development environments and delivering the ultimate DevX is one step away.\\n### Book a demo\\nTell us about your use case and we’ll show you how to automate it\\n[Schedule](https://okteto.com/</get-demo/>)\\n### Success stories\\nDon't just take it from us - learn from customers who are innovating and experiencing big wins\\n[Case studies](https://okteto.com/</customers>)\\n### Blogs\\nResources for platform engineering teams designing modern DevX\\n[Read more](https://okteto.com/</blog>)\\n[](https://okteto.com/</>)\\n#### Subscribe to our newsletter\\nEmail*\\n#### Company\\n  * [About us](https://okteto.com/</about-us/>)\\n  * [Customers](https://okteto.com/</customers/>)\\n  * [Pricing](https://okteto.com/</pricing/>)\\n  * [Legal](https://okteto.com/</legal/>)\\n  * [Privacy](https://okteto.com/</privacy-policy/>)\\n\\n\\n#### Docs\\n  * [Get started with Okteto CLI](https://okteto.com/</docs/get-started/install-okteto-cli/>)\\n  * [Install Okteto](https://okteto.com/</docs/get-started/overview/>)\\n  * [Okteto Manifest](https://okteto.com/</docs/manifest/overview-manifest/>)\\n  * [Samples](https://okteto.com/</docs/guides/samples/golang/>)\\n  * [Release Notes](https://okteto.com/</docs/release-notes/>)\\n\\n\\n#### Resources\\n  * [Blog](https://okteto.com/</blog/>)\\n  * [Demo Center](https://okteto.com/</product-tour-center/>)\\n  * [Videos](https://okteto.com/</videos/>)\\n  * [Community Forum](https://okteto.com/<https:/community.okteto.com>)\\n  * [DevX All Day](https://okteto.com/</devx-all-day/>)\\n\\n\\n#### Contact Us\\n  * [Talk to an expert](https://okteto.com/</contact/>)\\n  * [Support](https://okteto.com/<https:/support.okteto.com/hc/en-us>)\\n  * [Twitter](https://okteto.com/<https:/twitter.com/oktetohq>)\\n\\n\\n![Soc 2](https://okteto.com/static/logo-soc2-7fe342f611fa62a76bb2dfeb6687d7b6.webp)SOC2 Type 2 Compliant\\nPart of the[YCombinatorCreated with Sketch.](https://okteto.com/<https:/www.ycombinator.com/>)family.\\n© Copyright Okteto Inc 2025. All rights reserved.\\n\" markdown_with_citations=\"This website stores cookies on your computer. These cookies are used to collect information about how you interact with our website and allow us to remember you. We use this information in order to improve and customize your browsing experience and for analytics and metrics about our visitors both on this website and other media. To find out more about the cookies we use, see our Privacy Policy.\\nWe won't track your information when you visit our site. But in order to comply with your preferences, we'll have to use just one tiny cookie so that you're not asked to make this choice again.\\nAcceptDecline\\n5 steps to bring DevX automation to your company\\nGet the guide →⟨1⟩\\n✕\\n[](https://okteto.com/</>)\\n  * Product\\n  * Pricing⟨2⟩\\n  * Customers⟨3⟩\\n  * Docs⟨4⟩\\n  * Blog⟨5⟩\\n  * Resources\\n\\n\\n  * Take a tour⟨6⟩\\n  * Get a demo⟨7⟩\\n\\n\\n  * Product\\n  * Pricing⟨2⟩\\n  * Customers⟨3⟩\\n  * Docs⟨4⟩\\n  * Blog⟨5⟩\\n  * Resources\\n  * Take a tour⟨6⟩\\n  * Get a demo⟨7⟩\\n\\n\\n# Stop losing hours struggling with local environments\\nDiscover self-service ephemeral environments that give teams time back for innovation\\nGet a demo⟨7⟩Take a tour⟨6⟩;\\nDriving innovation together with our customer community\\n![Talon⟨8⟩](https://okteto.com/<https:/talon-sec.com/>)![monday.com⟨9⟩](https://okteto.com/<https:/www.monday.com/>)![LaunchDarkly⟨10⟩](https://okteto.com/<https:/launchdarkly.com/>)![Mercadona⟨11⟩](https://okteto.com/<https:/www.mercadona.es/>)![Yotpo⟨12⟩](https://okteto.com/<https:/www.yotpo.com/>)![Replicated⟨13⟩](https://okteto.com/<https:/www.replicated.com/>)![Hello Heart⟨14⟩](https://okteto.com/<https:/www.helloheart.com/>)\\n![Talon⟨8⟩](https://okteto.com/<https:/talon-sec.com/>)![monday.com⟨9⟩](https://okteto.com/<https:/www.monday.com/>)![LaunchDarkly⟨10⟩](https://okteto.com/<https:/launchdarkly.com/>)![Mercadona⟨11⟩](https://okteto.com/<https:/www.mercadona.es/>)![Yotpo⟨12⟩](https://okteto.com/<https:/www.yotpo.com/>)![Replicated⟨13⟩](https://okteto.com/<https:/www.replicated.com/>)![Hello Heart⟨14⟩](https://okteto.com/<https:/www.helloheart.com/>)\\n## [](https://okteto.com/<#transform-development-for-your-company>)Transform development for your company\\nOkteto transforms the way developers build, test, and deploy by eliminating the hassle of manual setup and configuration. With Okteto, your team can skip hours of preparation and jump straight into coding within minutes. Our platform automates environment provisioning, reduces build times, and accelerates testing, enabling rapid iteration and faster deployment cycles. By delivering pre-configured ephemeral environments on demand, Okteto streamlines onboarding for new developers, empowering them to be productive from day one. Whether you’re looking to cut setup time, speed up feedback loops, or reduce the ramp-up period for new team members, Okteto boosts productivity across every stage of your development process.\\nCalculate your ROI⟨15⟩\\n### Monday.com Success\\nWith less time and resources spent on managing the complexities of environment setups, developers are more productive and new team members onboard quickly.\\n+50%\\nProductivity\\n-50%\\nScrap work\\n+150%\\nAdoption growth\\n### Playable Worlds Success\\nA DevX-first approach automates the development inner loop, shifting left the verification process for each developer. Outcomes include increased productivity, reduced cognitive load, and enhanced velocity.\\n$1M\\nEngineering savings\\n90%\\nReduced waste\\n75%\\nIncreased velocity\\n### Replicated Success\\nOkteto removes the need for engineers to be highly skilled in Kubernetes, making it easier and faster to onboard new team members and get them straight to delivering business value.\\n+200%\\nProductivity\\n$10,000 \\nMonthly savings\\n## [](https://okteto.com/<#solutions-that-help-your-teams-ship-faster>)Solutions that help your teams ship faster\\n## [](https://okteto.com/<#shorten-the-inner-development-loop>)Shorten the inner development loop\\nNo more waiting around for builds. Code synchronization lets developers instantly see changes in their ephemeral environments, reducing the typical 5-10 minute build cycle to just 1-3 seconds. Cloud-based builds further accelerate workflows by running on powerful cloud hardware with optimized caching, enabling rapid iteration in complex environments.\\n**Reduce build waits by 97% with Okteto, from 40 minutes to a single minute, empowering quick feedback loops.**\\nThese tools streamline onboarding with ready-to-go environments and keep developers focused on innovation, reducing delays from code to deployment.\\nTake a tour⟨16⟩\\n![Loop of Okteto process - Test, Code and Build⟨17⟩]\\n![Marc Campbell⟨18⟩]![Marc Campbell⟨19⟩]\\nMarc Campbell\\nCTO & Co-Founder, Replicated\\nOkteto just works; with it we can set the bar higher with what we expect from the dev environment and our team.\\n![Typical Okteto process - Modern development, test and product team⟨20⟩]\\n## [](https://okteto.com/<#focus-on-code-not-configurationaccelerate-developer-roi>)Focus on Code, Not Configuration—Accelerate Developer ROI\\nDevelopers don’t have to spend their valuable time managing local environments, and Okteto is here to help. Our one-click environments free up time for coding and innovation making productivity gains easy. Reclaim up to 250+ hours per developer annually with Okteto, cutting environment setup to zero hassle.\\n## [](https://okteto.com/<#standardize-and-streamline-workflows>)Standardize and streamline workflows\\nDefine, provision, and customize development environments and all dependencies with ease, ensuring consistency across your entire organization. Say goodbye to manual configurations and hello to streamlined development workflows, accelerating innovation and collaboration.\\nTake a tour⟨21⟩\\n![Okteto workflows from dev to prod⟨22⟩]\\n![Lior Rabin⟨18⟩]![Lior Rabin⟨23⟩]\\nLior Rabin\\nInfrastructure Tech Lead, monday.com\\nThe productivity increase is huge. Developers don't need any extra time handling environment setup and can work on what matters, which is the product itself.\\nView product tour⟨24⟩\\n![Okteto dashboard ui⟨18⟩]![Okteto dashboard ui⟨25⟩]\\n## [](https://okteto.com/<#take-okteto-for-a-test-drive>)Take Okteto for a test drive\\nWhether you're new to the platform or looking to dive deeper into features, our guided tour shows how Okteto works and how it can benefit your team.\\n  * **Streamlined development workflow:** Spin up ephemeral development environments inside Kubernetes\\n  * **Preview environments:** Okteto automatically spins up preview environments on every Git pull request\\n  * **Hot reloading:** App developers can code locally and instantly see changes inside the production-like dev environment, all before merge\\n  * **Platform management** : As a platform engineer, see how to define, deploy and manage environments in Okteto\\n\\n\\n![Different teams using Okteto⟨26⟩]\\n## **Empower your teams with self-service development**\\nTailor development environments to match specific project requirements, ensuring that each team has the tools and resources they need to succeed. Developers can easily spin up their own development environments on demand, eliminating the need to wait for infrastructure provisioning. \\nTake a tour⟨27⟩\\n## [](https://okteto.com/<#accelerate-testing-and-collaboration-with-preview-environments>)Accelerate Testing and Collaboration with Preview Environments\\nOkteto streamlines CI/CD processes by automatically creating instant preview environments for every pull request. Okteto gives teams immediate access to a production-like environment, enabling fast, effective testing and reducing time spent waiting for feedback. With instant preview environments, feedback loops are shortened, allowing teams to iterate quickly, respond to feedback, and bring new features to market faster and with higher quality.\\nSpend an hour less each day on testing—Okteto speeds up feedback cycles, boosting development velocity and quality.\\nTake a tour⟨28⟩\\n![Different team using Okteto Preview Environments⟨29⟩]\\n## [](https://okteto.com/<#what-our-customers-say>)What our customers say\\nRead our reviews on G2⟨30⟩\\n  * ### Great for shift-left testing and quickie demo envionrments\\nHeath H. | Lead Automation Engineer\\nOkteto provides a very comprehensive solution for managing our Docker containers used in pre-merge testing, with extensive environment visibility and management as well as user access controls. It provides a modern, smooth, easy-to-use interface. Beyond the tool is the fantastic, personalized support and engagement from the Okteto team.\\n  * ### Preview Environments are a breeze with Okteto\\nJohn C. | Cofounder & CTO\\nWe had an internal development team maintaining our preview environments that we spin up for automated tests in CI. The previews never worked exactly the way we wanted and the took our engineers away from what they needed to be focused on: our product! We switched over Okteto Enterprise and couldn't be happier. We use Okteto to automaticall spin up the environments using their GitHub Action whenever pull requests are created. The automated tests run against the environments in the cloud and are torn down the the testing process completes. If we need to make an environment stay active longer, we add a custom label to the PR and the environment will stay active until the PR is closed. The whole process is great and we never have to worry about it. It just works.\\n  * ### Okteto is awesome!\\nLeonid M. | CTO\\nWe use Okteto daily and it drastically shortened our cycles, everyone from QA engineers to business steakholders are now in the loop on all the changes and can approve them or provide feedback before it hits our staging environment.\\n  * ### Growth enabler \\nAnts K. | VP of Product Engineering\\nKatana has evolved beyond the limitations of traditional local development environments, where the entire ecosystem was once hosted on a single PC or localhost setup. Today, engineers can spin up specific environments tailored to the areas of the product they need to work on, significantly improving development efficiency and reducing resource overhead.\\nOur partnership with Okteto has been key in this transformation. The collaboration with Okteto has been seamless, with their team consistently going above and beyond to provide guidance and support. Their proactive approach and dedication to customer success has been noticeable.\\n  * ### Streamlines development process\\nSophia S. | Consultant\\nThe best thing about Okteto is how it streamlines our development process for cloud-native applications by providing a fully automated development environment in Kubernetes. Okteto allows our developers to spin up replicas of their production environments quickly, so they can test and iterate code directly in a Kubernetes environment without managing infrastructure.\\nThis means our devs move fast and save multiple hours per days with removed manual tasks associated with managing environments.\\n  * ### Excellent tool simplify development for complex Kubernetes apps\\nMichial D. | Front End Developer\\nIt just improves the developer experience tremendously. It requires a bit of effort to setup depending on your specific usecase but after that it saves the developers a lot of frustration and time. It means that when you onboard a developer, he basically only needs to install a cli tool and run 2 commands and he/she will have full access to a fully configured dev environment that also closely mirrors production. The developer will not have to spend any time on configuring architecture or secrets, benefitting security as well.\\n\\n\\n## [](https://okteto.com/<#a-complete-platform-for-teams-who-care-about-devx>)A complete platform for teams who care about DevX\\n![](https://cdn.sanity.io/images/6icyfeiq/production/861d84ef244d60fc2f85ba9480071c4ac589d9ff-35x35.svg)\\n### Production-like Environments\\nThe easiest and most reliable way to ensure what works in development will work in production\\n![](https://cdn.sanity.io/images/6icyfeiq/production/c107f439810dacee08865ae0e5322b890fabbb34-35x35.svg)\\n### Self-service Automation\\nProvision any cloud resources (storage buckets, databases, etc.) your application needs in a single click\\n![](https://cdn.sanity.io/images/6icyfeiq/production/1a5e0d8349e2ddb222a15e22163981f9deb3b249-35x35.svg)\\n### Manifest Driven Experience\\nDefine all of your environments in a single manifest to ensure repeatability, trust and standardization\\n![](https://cdn.sanity.io/images/6icyfeiq/production/a5122484b916346ada9cfbce8b2fc18b6a9c4a33-35x35.svg)\\n### Developer Approved\\nDevelopers code in their favorite IDE, save changes, and see the results immediately on a Kubernetes development environment\\n![](https://cdn.sanity.io/images/6icyfeiq/production/8ec60175479ecd7793d2ddae142f15f5073ea1f8-35x35.svg)\\n### Cost Control\\nHave a controlled and automated solution for expensive, long-running environments\\n![](https://cdn.sanity.io/images/6icyfeiq/production/ec6c454572d67bff80c5c03c77debce3019c98f4-35x35.svg)\\n### Easy Onboarding\\nEliminate the onboarding friction by delivering ready-to-use development environments for new team members. Onboard new developers 50% faster—Okteto reduces ramp-up from 90 days to 45 days, accelerating team growth.\\nPlatform features⟨31⟩\\n![](https://okteto.com)![](https://cdn.sanity.io/images/6icyfeiq/production/f9e69c9ace20360e370e1b46e818d0dc1a7f79d4-1400x788.jpg?w=1400&h=788&q=75&fit=max&auto=format)\\nHear from companies building modern DevX\\n## [](https://okteto.com/<#see-how-our-customers-are-unlocking-200percent-increases-in-development-roi>)See how our customers are unlocking 200% increases in development ROI\\n![monday.com⟨9⟩](https://okteto.com/<https:/www.okteto.com/customers/monday-com/>)![LaunchDarkly⟨10⟩](https://okteto.com/<https:/www.okteto.com/customers/launchdarkly/>)![Replicated⟨13⟩](https://okteto.com/<https:/www.okteto.com/customers/replicated/>)![Privacy Dynamics⟨32⟩](https://okteto.com/<https:/www.okteto.com/customers/privacy-dynamics/>)\\n## [](https://okteto.com/<#keep-exploring>)Keep exploring...\\nAutomating development environments and delivering the ultimate DevX is one step away.\\n### Book a demo\\nTell us about your use case and we’ll show you how to automate it\\nSchedule⟨7⟩\\n### Success stories\\nDon't just take it from us - learn from customers who are innovating and experiencing big wins\\nCase studies⟨33⟩\\n### Blogs\\nResources for platform engineering teams designing modern DevX\\nRead more⟨34⟩\\n[](https://okteto.com/</>)\\n#### Subscribe to our newsletter\\nEmail*\\n#### Company\\n  * About us⟨35⟩\\n  * Customers⟨3⟩\\n  * Pricing⟨2⟩\\n  * Legal⟨36⟩\\n  * Privacy⟨37⟩\\n\\n\\n#### Docs\\n  * Get started with Okteto CLI⟨38⟩\\n  * Install Okteto⟨39⟩\\n  * Okteto Manifest⟨40⟩\\n  * Samples⟨41⟩\\n  * Release Notes⟨42⟩\\n\\n\\n#### Resources\\n  * Blog⟨5⟩\\n  * Demo Center⟨43⟩\\n  * Videos⟨44⟩\\n  * Community Forum⟨45⟩\\n  * DevX All Day⟨46⟩\\n\\n\\n#### Contact Us\\n  * Talk to an expert⟨47⟩\\n  * Support⟨48⟩\\n  * Twitter⟨49⟩\\n\\n\\n![Soc 2⟨50⟩]SOC2 Type 2 Compliant\\nPart of theYCombinatorCreated with Sketch.⟨51⟩family.\\n© Copyright Okteto Inc 2025. All rights reserved.\\n\" references_markdown='\\n\\n## References\\n\\n⟨1⟩ https://okteto.com/<https:/www.okteto.com/ebooks/5-steps-to-scoping-your-cloud-native-devx-automation-project/>: Get the guide →\\n⟨2⟩ https://okteto.com/</pricing/>: Pricing\\n⟨3⟩ https://okteto.com/</customers/>: Customers\\n⟨4⟩ https://okteto.com/</docs/welcome/overview/>: Docs\\n⟨5⟩ https://okteto.com/</blog/>: Blog\\n⟨6⟩ https://okteto.com/</tour/>: Take a tour\\n⟨7⟩ https://okteto.com/</get-demo/>: Get a demo\\n⟨8⟩ https://cdn.sanity.io/images/6icyfeiq/production/0448ea9ab55988c6989f4310127d9db40d4a3f5d-498x95.svg: ![Talon\\n⟨9⟩ https://cdn.sanity.io/images/6icyfeiq/production/ea462ad717901e6307784c09b999fc5922e67241-326x60.svg: ![monday.com\\n⟨10⟩ https://cdn.sanity.io/images/6icyfeiq/production/2d6933fc1badc391c818660954385ff408aefe84-5682x877.svg: ![LaunchDarkly\\n⟨11⟩ https://cdn.sanity.io/images/6icyfeiq/production/ed5d1ceb27c09473ef9a7a7e0d766cb3a0e819ce-637x108.svg: ![Mercadona\\n⟨12⟩ https://cdn.sanity.io/images/6icyfeiq/production/fc9a1efb3a171d9169b048a15e4a5636c64fe759-113x32.svg: ![Yotpo\\n⟨13⟩ https://cdn.sanity.io/images/6icyfeiq/production/83dde6dcd93ecf8264fc6897484b4ed8d8cfdc23-915x222.svg: ![Replicated\\n⟨14⟩ https://cdn.sanity.io/images/6icyfeiq/production/a4e6e2c5489423be83f1c729ba0f02040a2c37ef-1911x277.svg: ![Hello Heart\\n⟨15⟩ https://okteto.com/</roi>: Calculate your ROI\\n⟨16⟩ https://okteto.com/<https:/www.okteto.com/tour/hot-reloading/>: Take a tour\\n⟨17⟩ https://cdn.sanity.io/images/6icyfeiq/production/8439cbaf77402a376ada9bb6390acbbffede656e-469x317.svg: Loop of Okteto process - Test, Code and Build\\n⟨18⟩ https://okteto.com: Marc Campbell\\n⟨19⟩ https://cdn.sanity.io/images/6icyfeiq/production/6b8bd258cf660df1894613f920bdf3aaef512e5b-306x306.jpg?w=72&h=72&q=75&fit=max&auto=format: Marc Campbell\\n⟨20⟩ https://cdn.sanity.io/images/6icyfeiq/production/6b1862b8934bff680063f1bc3452c1d1c0c8b651-430x297.svg: Typical Okteto process - Modern development, test and product team\\n⟨21⟩ https://okteto.com/<https:/www.okteto.com/tour/manage-devx/>: Take a tour\\n⟨22⟩ https://cdn.sanity.io/images/6icyfeiq/production/c67d981066f50a20cf769be37b19d3e647cbaed5-447x206.svg: Okteto workflows from dev to prod\\n⟨23⟩ https://cdn.sanity.io/images/6icyfeiq/production/1df358da1425d20d47aeb2d97c63f73327eaff76-460x460.png?w=72&h=72&q=75&fit=max&auto=format: Lior Rabin\\n⟨24⟩ https://okteto.com/</tour/manage-devx/>: View product tour\\n⟨25⟩ https://cdn.sanity.io/images/6icyfeiq/production/c39d3538dfc8c5b8b187f78040e541d3584b8605-786x584.png?w=786&h=584&q=75&fit=max&auto=format: Okteto dashboard ui\\n⟨26⟩ https://cdn.sanity.io/images/6icyfeiq/production/9b7205d05e77ff1f4d53c59a1fc83b579e1a7210-479x292.svg: Different teams using Okteto\\n⟨27⟩ https://okteto.com/<https:/www.okteto.com/tour/catalog/>: Take a tour\\n⟨28⟩ https://okteto.com/<https:/www.okteto.com/tour/preview-environments/>: Take a tour\\n⟨29⟩ https://cdn.sanity.io/images/6icyfeiq/production/1596e16fcc2bb59ce069d8238f4f2183965fc505-473x253.svg: Different team using Okteto Preview Environments\\n⟨30⟩ https://okteto.com/<https:/www.g2.com/products/okteto/reviews>: Read our reviews on G2\\n⟨31⟩ https://okteto.com/<https:/www.okteto.com/platform-features/>: Platform features\\n⟨32⟩ https://cdn.sanity.io/images/6icyfeiq/production/610d66c02ef6610b3d526eca2a6be8010b392cbe-1920x281.png: ![Privacy Dynamics\\n⟨33⟩ https://okteto.com/</customers>: Case studies\\n⟨34⟩ https://okteto.com/</blog>: Read more\\n⟨35⟩ https://okteto.com/</about-us/>: About us\\n⟨36⟩ https://okteto.com/</legal/>: Legal\\n⟨37⟩ https://okteto.com/</privacy-policy/>: Privacy\\n⟨38⟩ https://okteto.com/</docs/get-started/install-okteto-cli/>: Get started with Okteto CLI\\n⟨39⟩ https://okteto.com/</docs/get-started/overview/>: Install Okteto\\n⟨40⟩ https://okteto.com/</docs/manifest/overview-manifest/>: Okteto Manifest\\n⟨41⟩ https://okteto.com/</docs/guides/samples/golang/>: Samples\\n⟨42⟩ https://okteto.com/</docs/release-notes/>: Release Notes\\n⟨43⟩ https://okteto.com/</product-tour-center/>: Demo Center\\n⟨44⟩ https://okteto.com/</videos/>: Videos\\n⟨45⟩ https://okteto.com/<https:/community.okteto.com>: Community Forum\\n⟨46⟩ https://okteto.com/</devx-all-day/>: DevX All Day\\n⟨47⟩ https://okteto.com/</contact/>: Talk to an expert\\n⟨48⟩ https://okteto.com/<https:/support.okteto.com/hc/en-us>: Support\\n⟨49⟩ https://okteto.com/<https:/twitter.com/oktetohq>: Twitter\\n⟨50⟩ https://okteto.com/static/logo-soc2-7fe342f611fa62a76bb2dfeb6687d7b6.webp: Soc 2\\n⟨51⟩ https://okteto.com/<https:/www.ycombinator.com/>: YCombinatorCreated with Sketch.\\n' fit_markdown='' fit_html=''",
  "generated_description": "**Okteto: Simplifying Development with One-Click Cloud Environments**\n\nFounded in 2018 and hailing from Y Combinator's Batch W19, Okteto has a straightforward mission: to streamline the development process for teams of all sizes by providing self-service cloud development environments with just one click. Based in San Francisco, the company has grown to a team of 30 dedicated employees, all focused on revolutionizing the developer experience.\n\nThe problem they tackle is familiar to anyone in tech: setting up local development environments can be a time-consuming headache. Okteto eliminates this hassle, allowing developers to dedicate their energy to building and delivering value instead of drowning in configuration issues or debugging production problems. Imagine being able to skip the long setup periods and jump straight into coding!\n\nOkteto offers a suite of tools designed to automate environment provisioning, reduce build times, and expedite testing. With its innovative platform, developers can expect to reclaim a significant chunk of their time—up to 250+ hours annually—simply by reducing setup friction.\n\nSome features that stand out include:\n\n- **Self-Service Ephemeral Environments**: Developers can create and manage their own project-specific environments on demand.\n- **Rapid Iteration with Hot Reloading**: Code changes can be seen instantly in production-like environments, cutting build wait times dramatically—by up to 97%.\n- **Streamlined Onboarding**: New developers can get productive much faster, with a ramp-up time reduced from 90 days to just 45.\n\nCompanies that utilize Okteto report compelling results. For instance, Monday.com has seen a 50% increase in productivity, while Playable Worlds noted a $1 million savings in engineering costs by shifting left the verification process. The overarching theme is clear: when development processes are optimized, you not only save time but also enhance productivity across the board.\n\nWith a strong presence in the developer tools, SaaS, B2B, and Kubernetes spaces, Okteto aims to partner closely with its customers to reshape the way development teams operate. They are positioned as a go-to resource for modern development practices that embrace cloud-native technologies.\n\nIf you're looking to transform your development cycle and enable your team to innovate faster, Okteto is certainly worth a look. Their commitment to simplifying the developer experience makes them a frontrunner in the space. You can learn more on their [website](https://okteto.com)."
}