{
  "links": "https://www.ycombinator.com/companies/onechronos",
  "name": "OneChronos",
  "headline": "The Smart Market for Institutional Investors",
  "batch": "S16",
  "description": "OneChronos is a U.S. equities ATS designed bottom-up to fundamentally address the growing gap between how trading venues match orders and how traders need to execute.",
  "activity_status": "Active",
  "website": "https://www.onechronos.com/",
  "founded_date": null,
  "team_size": 35.0,
  "location": "New York",
  "group_partner": "Jared Friedman",
  "group_partner_yc": "https://www.ycombinator.com/people/jared-friedman",
  "company_linkedin": null,
  "company_twitter": null,
  "tags": "industry:fintech; industry:marketplace; industry:ai; location:new-york",
  "founders": [],
  "status": true,
  "markdown": "raw_markdown='![OneChronos logo](https://www.onechronos.com/)\\n###### OneChronos\\n[Home](https://www.onechronos.com/</>)[E-Bidding](https://www.onechronos.com/</docs/expressive/>)[Docs](https://www.onechronos.com/</docs/>)[About](https://www.onechronos.com/</about/>)[Insights](https://www.onechronos.com/<https:/think.onechronos.com/podcast/>)[Careers](https://www.onechronos.com/</careers/>)[Contact](https://www.onechronos.com/</contact/>)\\n# The Smart Market for Institutional Investors\\nOneChronos is a U.S. equities ATS designed bottom-up to fundamentally address the growing gap between how trading venues match orders and how traders need to execute.\\nWatch Intro\\n![](https://fast.wistia.com/embed/medias/4xe57bov54/swatch)\\n![](data:image/svg+xml;charset=utf-8,%3Csvg%20height=\\'990\\'%20width=\\'1802\\'%20xmlns=\\'http://www.w3.org/2000/svg\\'%20version=\\'1.1\\'%3E%3C/svg%3E)\\n![Combinatorial optimization](https://www.onechronos.com/static/f807a49087190afc2b40f8dbb68d9802/7b96a/optimization_grid.svg)\\n## A fair, intelligent, and customizable ATS.\\nOneChronos is a Smart Market – the technical term for markets that match counterparties using mathematical optimization. Smart Markets have a proven ability to outperform traditional markets on metrics such as price improvement, liquidity, trade size, and fairness.\\nSmart Markets enable Expressive Bidding – a tool that gives market participants the fidelity of voice trading and the advantages of an electronic venue. All market participants can benefit from the unique liquidity that Expressive Bidding generates.\\n## Proven results.\\nSmart Markets have been increasingly adopted in sectors such as manufacturing, logistics, telecom, and advertising given their demonstrated ability to:\\n  * Identify mutually beneficial outcomes for buyers and sellers\\n  * Address agency issues and reduce incentives for gaming\\n  * Directly handle substitutes and complements, unlocking transactions that wouldn’t be possible otherwise\\n  * Mitigate information leakage and asymmetry\\n\\n\\nOneChronos is pioneering the use of Nobel prize-winning (Economic Sciences, 2020) combinatorial auction techniques and artificial intelligence in financial markets, operating a Smart Market at a speed, scale and computational complexity that was not possible until now.\\n![](data:image/svg+xml;charset=utf-8,%3Csvg%20height=\\'1080\\'%20width=\\'1920\\'%20xmlns=\\'http://www.w3.org/2000/svg\\'%20version=\\'1.1\\'%3E%3C/svg%3E)\\n![Logistics and transportation](https://www.onechronos.com/static/2fcbe7044e26d6e6fbd5e8c0617e439f/c4b47/logistics.svg)\\n![](data:image/svg+xml;charset=utf-8,%3Csvg%20height=\\'1787\\'%20width=\\'2740\\'%20xmlns=\\'http://www.w3.org/2000/svg\\'%20version=\\'1.1\\'%3E%3C/svg%3E)\\n![Combinatorial optimization](https://www.onechronos.com/static/a4edfba775446dc12bafab814d3bbb3d/21f2d/auction_blocks.svg)\\n## Many Needs, One Solution.\\nOneChronos offers brokers and their clients a simple mechanism to enhance their existing algorithms — VWAP, IS, liquidity seeking, and multi-objective execution — and accomplish diverse trading goals:\\n  * Market impact modulation\\n  * Single-security indifference curves\\n  * Synthetic creation and redemption of ETFs\\n  * Pairs and spread trading\\n  * Multi-security portfolio execution and hedging\\n\\n\\nExamples, details, and production availability status can be found in our [Expressive Bidding Guide](https://www.onechronos.com/</docs/expressive/>).\\n## Standard workflow, game changing paradigm\\n  * Point-in-time auctions every ~100ms throughout the trading day\\n  * Match priority based on aggregate notional price improvement contributed\\n  * All matches are within or at the NBBO at a single clearing price per symbol\\n  * Customizable constraints to isolate specific execution objectives\\n\\n\\n  * Fully non-displayed. No data feeds. Firm orders only. Multilateral fills\\n  * Seamless fit in today’s algorithm & routing workflows. Standard order types supported, in addition to those unique to OneChronos. All orders via FIX 4.2\\n  * Single auction process spanning all orders & eligible NMS securities\\n  * Differentiated liquidity, customized fills, unique trading opportunities\\n\\n\\n## FAQ\\n###### Auction Mechanics, Match Procedure & Order Types\\n### \\nHow are OneChronos periodic auctions initiated? And at what frequency?\\nOneChronos matches orders using periodic auctions. All auctions are initiated by the venue at deliberately randomized start times; auctions are not user-initiated. OneChronos aims to conduct an average of 10 auctions per second throughout the trading day. Each auction considers all symbols and eligible orders.\\n### \\nHow are orders matched on OneChronos ATS? What is the “match priority” model?\\nOneChronos auctions use mathematical optimization to seek optimal matches across all orders, instead of matching orders one-by-one. The optimization’s objective is to maximize Aggregate Price Improvement (see dedicated question for definition) across all orders and symbols. Each auction looks for the configuration of “winning” orders and per-security clearing prices that will result in the most price improvement dollars cleared, taking into account all orders’ constraints.\\n### \\nWhat order types are available at OneChronos?\\nThe ATS accepts Limit Orders, Peg Orders (Midpoint, Primary, and Market), and Expressive Orders: an order type specific to OneChronos that allows participants to introduce their business-specific execution instructions to our optimizer, spanning one or more orders in one or more securities. _Note that Expressive Bidding is currently enabled for \"Pairs\" only (i.e. Expressive Orders consisting of two symbols). For more information, please see our Form ATS-N._\\n### \\nHow is Aggregate Price Improvement defined?\\nFor an individual order, Price Improvement Dollars refers to the difference between the limit price on the order and the auction clearing price (i.e. the price at which the order is filled) for the given security, times the quantity filled. For an Expressive Order to buy and/or sell multiple securities simultaneously, price improvement refers to differences in limit prices and clearing prices for each respective security, summed across all securities times the quantities filled. _Note that Expressive Bidding is currently enabled for \"Pairs\" only (i.e. Expressive Orders consisting of two symbols). For more information, please see our Form ATS-N._ Aggregate Price Improvement represents the sum of Price Improvement Dollars across all eligible orders (across all securities) under consideration for a given auction.\\n### \\nWhat is a Smart Market?\\nA Smart Market is a periodic auction solved using a powerful operations research technique called mathematical optimization. As used in many areas of electronic trading and portfolio management, optimization allows for maximization (or minimization) of a specifically defined objective, while respecting a set of constraints. In the case of the OneChronos ATS, we’re extending this robust application to the venue level where buyer’s & seller’s orders meet. The OneChronos optimization’s primary objective is to identify, match and clear the configuration of buy and sell orders which would maximize Aggregate Price Improvement achievable by those orders in a given auction.Smart Markets have been deployed commercially dating back to the 1990s by various large cap industries and government procurement auctions of physical commodities to achieve the benefits we describe above, and continue to grow in adoption given their proven success towards those goals.\\n### \\nWhere within or outside the spread can orders match?\\nOrders can match at any price within the spread, at or between the NBB and NBO. All orders in each security match at a single price in each auction. Orders can be filled at prices better than their limit price, because of how prices are determined via optimization.\\n### \\nDoes the ATS support Immediate-or-Cancel (IOC) Orders?\\nYes. OneChronos supports time-in-force (TIF) instructions such as: Day, Immediate or Cancel (IOC), Fill or Kill, Good ‘Til Date (with an expire time not to exceed the end of the current trading session). IOC orders effectively participate in a single auction occurrence. For a complete list of TIF instructions, see our [FIX documentation](https://www.onechronos.com/</docs/fix/fix-42/>).\\n### \\nWhere can I see some examples of how the auction determines match priority?\\nPlease see Part 3 Item 11 our ATS-N filing under the heading [“PRIORITY AND PRICE FORMATION EXAMPLE”](https://www.onechronos.com/<https:/www.sec.gov/Archives/edgar/data/1692652/000169265225000003/xslATS-N_X01/primary_doc.xml#partIIIitem11>).\\n### \\nHow might my order be price improved?\\nThe primary goal of the OneChronos matching process is to find the configuration of orders that yield the most Aggregate Price Improvement as compared to their respective limit prices. As each auction results in a single clearing price for each security, eligible orders may receive fills at a price better than their limit price.\\n### \\nHow are Artificial Intelligence/ Machine Learning techniques used by OneChronos?\\nOneChronos is a Smart Market leveraging the power of optimization search techniques to match and clear buyer’s and seller’s orders efficiently and in a way that maximizes Aggregate Price Improvement achievable by those orders.The optimization problem these auctions pose is “computationally intractable”, because the flexible “Expressive Bidding” that the ATS allows for creates an astronomical number of possible matches to search through. Traditionally, these optimizations are solved using a technique called integer programming and would run for hours or days at a time.To operate at the speed of equities markets and to scale effectively, OneChronos uses AI in an effort to guide our optimizer toward areas of that search space containing higher quality matches, and ultimately better satisfy the objective of maximizing Aggregate Price Improvement.\\n### \\nHow is the 2020 Nobel Prize in Economics work related to the auction type used by OneChronos?\\nIn October 2020, the Nobel Prize in Economic Science was awarded to two Stanford academics, Paul Milgrom and Robert Wilson, for their improvements to auction theory and inventions of new auction formats. Their research in game theory and auction theory and their advancements in practical auction formats underpin the Smart Market.We at OneChronos are elated at both their deserving receipt of the prize and the validation of their inventions’ contributions to marketplaces of all kinds.You can learn more about the 2020 Nobel Prize in Economics [here](https://www.onechronos.com/<https:/www.nobelprize.org/prizes/economic-sciences/2020/press-release/>), and greater detail on Wilson and Milgrom’s research and auction formats [here](https://www.onechronos.com/<https:/www.nobelprize.org/uploads/2020/09/popular-economicsciencesprize2020.pdf>).\\nMore\\n###### Trading at OneChronos\\n### \\nCan orders persist for multiple OneChronos auctions? For example, those not matched or not fully executed in a OneChronos auction.\\nYes, orders with residual (“leaves”) quantity can persist for the duration of the trading day for successive auctions. Time in force instructions and default values are described, per our FIX specification, found [here](https://www.onechronos.com/</docs/fix/fix-42/>).\\n### \\nWhat types of participants are anticipated to use OneChronos?\\nWhile only broker-dealers may be direct subscribers, the OneChronos participant base is anticipated to consist primarily of institutional customers of broker-dealers, and broker-dealers themselves including franchise risk management teams, equity and options market makers and specialists. As it pertains to their agency offering, broker-dealers may offer OneChronos as a complement to their single stock or multi-asset algorithm and smart-routing products, and as a DMA destination. Please speak with your broker for further info on how OneChronos is incorporated in their execution services offerings.\\n### \\nHow does the ATS determine which orders are eligible in an auction? What happens to orders received after the auction cutoff?\\nThe ATS system chooses auction cutoff times at random within a pre-set range. Any orders that have a timestamp prior to the auction cutoff are eligible. Orders timestamped after the auction cutoff time are eligible to participate in the subsequent auction.\\n### \\nHow does cancel-replace work during the auction life-cycle? Is there a lock-up period?\\nEach auction consists of buffer time for inbound market data and order data, followed by the optimization sequence, then outbound execution and order data. Continuous order management is available throughout this full life-cycle. However, any order not canceled or cancel / replaced prior to the initiation of the optimization sequence will take effect in the subsequent auction.\\n### \\nWho can access OneChronos directly?\\nAll OneChronos subscribers must be SEC registered Broker Dealers and members of at least one SRO. All orders received by the ATS are received from Subscribers (including those originated from their customers).Institutions that are not SEC broker dealers can access OneChronos through their broker. Institutions can, however, directly convey “expressive” constraints to complement orders they may send to their broker for execution at OneChronos in effort to achieve a customized fill experience. See our FAQ section on Expressive Bidding for further information.\\n### \\nCan I send DMA orders through my broker for potential execution at OneChronos ATS?\\nYes. Please speak with your broker regarding their DMA offering and OneChronos as a destination. Directing DMA orders for execution at OneChronos allows for Institutions or Brokers to tailor execution constraints specific to their risk management and execution objectives. See [FAQ section on Expressive Bidding](https://www.onechronos.com/</docs/expressive/faq/#expressive-bidding-with-onechronos>) for further detail.\\n### \\nDoes the OneChronos ATS use tiering or segmentation?\\nOneChronos does not use tiering or segmentation.\\n### \\nDoes OneChronos ATS offer Conditional Indications?\\nYes, for more information, please see our Form ATS-N, Part III, Item 9.\\n### \\nDoes OneChronos ATS send out Indications of Interest?\\nOneChronos does not send out indications of interest. OneChronos does however, support Conditional Indications, and will issue invites when there exists eligible contraside liquidity for the Conditional Order. For more information, please see our Form ATS-N, Part III, Item 9.\\n### \\nHow is liquidity taking and liquidity providing defined and considered in the matching process?\\nOneChronos auctions do not have a notion of adding or removing liquidity, and do not categorize participants as liquidity providers or liquidity takers. See our FAQ section on Auction Mechanics, Match Procedure & Order Types to better understand the OneChronos auction process.\\n### \\nDoes OneChronos support Odd lots or Mixed Lots?\\nOneChronos does accept odd-lot and mixed-lot orders. The minimum trade size is 1 share. Both odd-lot and mixed-lot orders are treated and handled in the same manner as round lot orders.\\n### \\nDoes OneChronos support Min Quantity?\\nYes, available on all orders.\\n### \\nWhat happens when Residual quantity of an order falls below Min Quantity?\\nThe order will be cancelled in the manner configured by the user through FIX port settings.\\n### \\nDoes OneChronos have a self-cross prevention feature?\\nYes. See the [FIX documentation](https://www.onechronos.com/</docs/fix/fix-42/>) for order handling details.\\n### \\nWhat securities does OneChronos ATS accommodate?\\nOneChronos supports NMS securities, including single stocks, ETFs and ADRs.\\n### \\nCan OneChronos accept or rank orders priced in increments smaller than $0.01 (sub-penny)?\\nRule 612 (§ 242.612 Minimum pricing increment) of SEC Regulation NMS expressly prohibits brokers, exchanges, and alternative trading systems from accepting, displaying, or ranking quotes or orders for any NMS stock priced in an increment smaller than $0.01 for stocks priced greater than or equal to $1.00 or $0.0001 for stocks priced less than $1.00. Limit prices greater than or equal to $1.00 must be expressed in increments of at least $0.01 (i.e. sub-penny prices are not permitted). Limit prices less than $1.00 must be expressed in increments of at least $0.0001. This applies to limit prices on all order types.\\n### \\nCan OneChronos match orders at prices that are not in increments of $0.01 or allow Expressive Bidding constraints that can result in sub-penny executions?\\nYes. The OneChronos match mechanism, as detailed in our Form ATS-N, is not restricted to establishing clearing prices in increments of $0.01. The possibility of sub-penny clearing prices is consistent with Rule 612 of NMS, which governs the minimum pricing of quotes and orders. However, it does not impose any restrictions on execution prices. All OneChronos executions are average priced, computed to six decimal places using the formula: average price = total notional paid or received/total shares transacted. Note that any order can fill at its limit price or better, which could be a sub-penny price, as a function of the OneChronos match process (see dedicated FAQ question). Also, through Expressive Bidding, a OneChronos user can impose constraints on an execution that can result in fills at sub-penny average prices. As such, Expressive Bidding can guarantee that an order executes at a sub-penny price or better but cannot be used to ensure execution at a specific price, sub-penny or otherwise.\\n### \\nDo you have examples demonstrating situations in which sub-penny executions can occur?\\nYes. First, note that before formulating the optimization problem used to determine the matches and clearing prices for a given auction, OneChronos will round coefficients in the objective function (down for an order to buy and up for an order to sell) to increments of $0.01. The following examples are non-exhaustive and meant to illustrate specific situations in which executions can and cannot occur at sub-penny prices.**Example 1:** User A submits a buy order of 300 at 10.01. User B submits a sell order of 100 at 10.00. User C submits a sell order of 100 at 10.00. The auction clears 200 shares at 10.006.**Example 2:** User submits a Target Order to buy 100 shares at $10.01 with the Expressive Bidding constraint that 10.005*fill_quantity ≤ $1,000.505. The User’s notional value contribution to the objective function is $10.01*fill_quantity.**Example 3:** User submits a Target Order to buy 100 shares at $10.01 all-or-none at a total notional value ≤ $1,000.50. The User’s notional value contribution to the objective function is $1,000.50 if the order fills and $0.00 otherwise. Such an order can only fill at an average price of $10.005 or better.**Example 4:** User submits a Target Order to buy 100 shares at $10.01 all-or-none at a total notional value ≤ $1,000.500001. Before computing match priority, OneChronos will round the max notional value contributed down to $1,000.50; if the Target Order was a sell and the constraint was total notional value ≥ $1,000.500001, OneChronos would round up to $1,000.51.\\n### \\nDoes OneChronos pass back LastLiquidityIndicator on executions?\\nOneChronos does not pass back LastLiquidityIndicator (tag_851) on executions, as it does not have a concept of adding or removing liquidity in its auctions. However, OneChronos does pass back TradeLiquidityIndicator (tag_9730) values on executions to communicate fee codes to our subscribers.\\n### \\nGiven the duration of the OneChronos auction lifecycle how can I increase my likelihood of fills on OneChronos?\\nOrders with a duration of less than 100ms may experience a lower likelihood of being filled at OneChronos.Note, however, that continuous order management is available throughout the full auction life-cycle, and without any “queue” penalty, as orders at OneChronos are not matched on the basis of time priority.Orders timestamped after the auction cutoff time are eligible to participate in the subsequent auction(s). Similarly, any order not cancelled or cancel/ replaced prior to the auction cutoff time will take effect in the subsequent auction.Orders may be tagged to participate in only one auction (“IOC”), or persist for subsequent auctions for any specified period up to the end of the day’s trading session.\\nMore\\n###### Trade Reporting, Visibility & Transparency\\n### \\nWhere does OneChronos ATS print its trades?\\nATS executions are printed to the FINRA NYSE TRF.\\n### \\nWhat data is disseminated through public trading reporting?\\nOneChronos publicly (through TRF) disseminates the execution price and total volume matched for each security in each auction. Individual participants also receive execution reports with their individual fill quantity within that total.\\n### \\nWhere can I view Form ATS-N for OneChronos ATS?\\nThe OneChronos Form ATS-N filed with the SEC can be found at [this link](https://www.onechronos.com/<https:/www.sec.gov/Archives/edgar/data/1692652/000169265225000003/xslATS-N_X01/primary_doc.xml>).\\n### \\nWhat is the OneChronos ATS MPID?\\nThe MPID for OneChronos is: CGXS\\n### \\nWhat is the OneChronos ATS MIC Code?\\nThe MIC Code for OneChronos is: CGXS\\nMore\\n###### Data Center, Market Data & Routing\\n### \\nWhere is the OneChronos matching engine located?\\nThe OneChronos matching engine is located at Equinix NY5.\\n### \\nDoes OneChronos ATS route any orders externally? For example, those not matched in a OneChronos auction.\\nOneChronos does not route orders externally.\\n### \\nHow is NBBO calculated?\\nThe NBBO prices used in OneChronos auctions are the SIP derived prices most recent to but not after the Auction Initialization Time. As an illustrative example of this procedure: \\n* Auction Initialization results in an auction cutoff time;\\n* Auction Network Buffering allows data to propagate from exchanges, to the SIP, and ultimately to the OneChronos ATS;\\n* After buffering the ATS computes NBBO for each tradable symbol by processing all messages from the SIP with Exchange Timestamps less than or equal to the cutoff time for the auction.\\n### \\nDoes OneChronos offer co-location?\\nOneChronos allows Subscribers to connect directly to the ATS via cross-connect or extranet.Note: we are starting with a single PoP, however the system is developed to support expansion to multiple PoPs across the country.\\n### \\nWhere does OneChronos get its Market Data? Does OneChronos ATS maintain direct market data feeds?\\nOneChronos constructs a view of NBBO from data provided by the SIP (NYSE CTA feeds & Nasdaq UTP). Each SIP message contains a timestamp provided by the reporting exchange representing when that exchange processed the given message. OneChronos market data and matching systems use these Exchange Timestamps in conjunction with the buffering period prior to each auction in an effort to construct a consistent time-aligned view of the market. The ATS does not subscribe to direct feeds from the national exchanges.\\n### \\nDoes OneChronos provide any data feeds?\\nOneChronos does not provide any data feeds (for example, to its Subscribers).\\nMore\\n###### Connectivity\\n### \\nHow can OneChronos be accessed?\\nSubscribers access OneChronos via a standard FIX (4.2) connection. Customers of Subscribers access OneChronos indirectly via their Broker’s execution products and services, which may include: single stock or multi-asset algorithms, where portions of that order may be routed to OneChronos for execution from the Broker’s router; a Broker’s Direct-to-SOR offering which may route orders to OneChronos for execution; or a Broker’s Direct Market Access (“DMA”) offering, where a Broker’s clients may direct orders to OneChronos or other destinations using their own algorithms and or routing.\\n### \\nAre there any special requirements for order submission via FIX?\\nNo. Orders sent to OneChronos ATS for execution are transmitted using standard FIX protocol. See our FIX specification [here](https://www.onechronos.com/</docs/fix/fix-42/>) for further information.\\n### \\nWhat are the hours of operation for OneChronos ATS?\\nStandard Market Hours (US Eastern time): \\n* 8:00am: begin accepting FIX connections / sessions;\\n* 9:15am: begin accepting orders;\\n* 9:30am: begin executing orders (i.e. first call auction will take place at or after 9:30am);\\n* 4:00pm: stop executing orders (i.e. final call auction will take place at or before 4:00pm);\\n* 5:00pm: all FIX sessions disconnected.\\n###### Expressive Bidding\\n### \\nWhat is Expressive Bidding? How should I consider if Expressive Bidding is relevant for how I trade?\\nExpressive bidding allows users to input specific execution instructions at the matching engine level that are precisely tailored to their execution or investment strategy objectives.For example, a pairs trader could effect instructions to buy asset ABC (subject to the price & quantity in her ABC limit order) only if she can also sell asset DEF (subject to the price & quantity in her DEF limit order) at a defined ratio, in the same auction.Expressive Bidding is communicated to the OneChronos matching engine using a general purpose programming language (Reason ML or OCaml) or use-case-specific languages developed by OneChronos. Users (clients of Brokers or Brokers themselves) can construct and tailor execution instructions relevant to them or their clients.**_Note that Expressive Bidding is currently enabled for \"Pairs\" only (i.e. Expressive Orders consisting of two symbols). For more information, please see our Form ATS-N._**\\n### \\nIs Expressive Bidding required to trade at OneChronos?\\nExpressive bidding is not required to trade at OneChronos. It is an optional and powerful feature available to Subscribers and their customers. It allows users to integrate their specific execution or investment constraints directly into our matching engine.\\n### \\nCan / Does my broker use Expressive Bidding to complement its trading algorithm or smart routing strategies?\\nThere are myriad creative implementations Brokers may use to complement and strengthen their execution offerings and their related customizations. Please speak with your Broker to learn how OneChronos is incorporated in their execution services offerings.\\n### \\nIs Expressive Bidding something I would use directly, or through my broker?\\nPlease speak with your broker on how they might incorporate Expressive Bidding for general use or on a customized basis to complement their trading algorithms or smart routing for single stock or multi-asset strategies.If your firm is accustomed to computer-driven trading or execution, Expressive Bids should integrate well.You can construct tailored bidder logic or leverage your broker to complement orders you send to them for potential execution at OneChronos.\\n### \\nCan my Limit price or Quantity ever be violated?\\nNo. The economics of your Limit Order or Limit Orders serve as an upper or lower bound (as relevant) for any order, including those using Expressive Bidding to create conditionality across multiple limit orders. _Note that Expressive Bidding is currently enabled for \"Pairs\" only (i.e. Expressive Orders consisting of two symbols). For more information, please see our Form ATS-N._\\n### \\nIs Expressive Bidding required to achieve the benefits OneChronos discusses; price improvement, mitigated impact, unique crossing opportunities?\\nExpressive bidding is not required to achieve the benefits or differentiation that OneChronos represents. The OneChronos matching engine and mechanism is designed to find price improvement opportunities, mitigate information leakage, and create unique interaction opportunities for any order type.Expressive Bidding allows further execution customization with powerful application to users who are trading substitutable or complementary assets or orders or portions of larger orders.\\n### \\nIs there benefit to interacting with other orders which are using Expressive Bidding?\\nYes, there is potential benefit for a variety of reasons such as but not limited to potential further price improvement achievable, larger fill size, a customized fill experience, reduced impact, unique liquidity interaction points, and unlocking mutually beneficial trades that would likely otherwise not occur, as in this example, which uses hypothetical Expressive Bidding functionality _Note that Expressive Bidding is currently enabled for \"Pairs\" only (i.e. Expressive Orders consisting of two symbols). For more information, please see our Form ATS-N._ :Trader A wants to de-risk her healthcare sector exposure. Traditionally, she enters individual parent SELL orders in one or more healthcare stocks through a trading algorithm or to market center. Alternatively, Trader A sends limit orders to OneChronos across multiple healthcare names, with Expressive Bidding instructions to trade any combination of those names up to $20mm (subject to the limit prices and quantities in her limit orders). Trader B sends a standard BUY limit order to OneChronos for a specific healthcare stock. Both Trader A and Trader B have a higher likelihood of a fill given Trader A’s expressed substitutability across related assets. _Note that Expressive Bidding is currently enabled for \"Pairs\" only (i.e. Expressive Orders consisting of two symbols). For more information, please see our Form ATS-N._\\n### \\nCan OneChronos help me construct Expressive Bid constraints? Are there existing templates? Tutorials?\\nYes, OneChronos provides recorded and live support for bid construction. We also provide templates for common trading and execution strategies that can be modified for use in production.A great place to begin is with the introductory content and customizable templates available in the [introduction to](https://www.onechronos.com/</docs/expressive/start-here/>) our Expressive Bidding site.Please feel free to reach out to us at info@onechronos.com to discuss how we can help you with Expressive Bidding.\\nMore\\nAbout\\nOneChronos ® Markets LLC is a wholly-owned broker-dealer subsidiary of OCX Group Inc. We’re an independent, venture backed company using cutting edge technological paradigms to enable the next generation of electronic trading. Contact us at info@onechronos.com.\\nMember FINRA/SIPC: [www.finra.org](https://www.onechronos.com/<https:/www.finra.org/>). Check the background of OneChronos Markets LLC on [FINRA’s BrokerCheck.](https://www.onechronos.com/<https:/brokercheck.finra.org/>)\\nA copy of OneChronos Markets LLC’s ATS-N is available [here.](https://www.onechronos.com/<https:/www.sec.gov/Archives/edgar/data/1692652/000169265225000003/xslATS-N_X01/primary_doc.xml>)\\nProduct\\n  * [Home](https://www.onechronos.com/</>)\\n\\n\\nDocs\\n  * [Expressive Bidding](https://www.onechronos.com/</docs/expressive/>)\\n  * [Market Structure](https://www.onechronos.com/</docs/market-structure/clearing-examples/>)\\n  * [FIX](https://www.onechronos.com/</docs/fix/fix-42/>)\\n  * [User Manual](https://www.onechronos.com/</docs/user-manual/>)\\n  * [Explore All](https://www.onechronos.com/</docs/>)\\n\\n\\nLegal\\n  * [Privacy Policy](https://www.onechronos.com/<https:/app.termly.io/policy-viewer/policy.html?policyUUID=cb5783c6-cbf9-462b-9f63-2ac6466baf7f>)\\n  * [Cookie Policy](https://www.onechronos.com/<https:/app.termly.io/policy-viewer/policy.html?policyUUID=443ba7d6-0ff3-4674-a10d-7216457c6185>)\\n  * [Terms of Use](https://www.onechronos.com/<https:/app.termly.io/policy-viewer/policy.html?policyUUID=4554f8dd-2983-4b99-87b5-7bd17e04f9d3>)\\n  * [Acceptable Use Policy](https://www.onechronos.com/<https:/app.termly.io/policy-viewer/policy.html?policyUUID=16933435-f899-4a1f-92c9-e05838108096>)\\n  * [Business Continuity Plan](https://www.onechronos.com/</legal/bcp/>)\\n  * [Regulatory](https://www.onechronos.com/</legal/regulatory/>)\\n  * [Cookie Settings](https://www.onechronos.com/<#>)\\n\\n\\n' markdown_with_citations='![OneChronos logo⟨1⟩]\\n###### OneChronos\\nHome⟨2⟩E-Bidding⟨3⟩Docs⟨4⟩About⟨5⟩Insights⟨6⟩Careers⟨7⟩Contact⟨8⟩\\n# The Smart Market for Institutional Investors\\nOneChronos is a U.S. equities ATS designed bottom-up to fundamentally address the growing gap between how trading venues match orders and how traders need to execute.\\nWatch Intro\\n![](https://fast.wistia.com/embed/medias/4xe57bov54/swatch)\\n![](data:image/svg+xml;charset=utf-8,%3Csvg%20height=\\'990\\'%20width=\\'1802\\'%20xmlns=\\'http://www.w3.org/2000/svg\\'%20version=\\'1.1\\'%3E%3C/svg%3E)\\n![Combinatorial optimization⟨9⟩]\\n## A fair, intelligent, and customizable ATS.\\nOneChronos is a Smart Market – the technical term for markets that match counterparties using mathematical optimization. Smart Markets have a proven ability to outperform traditional markets on metrics such as price improvement, liquidity, trade size, and fairness.\\nSmart Markets enable Expressive Bidding – a tool that gives market participants the fidelity of voice trading and the advantages of an electronic venue. All market participants can benefit from the unique liquidity that Expressive Bidding generates.\\n## Proven results.\\nSmart Markets have been increasingly adopted in sectors such as manufacturing, logistics, telecom, and advertising given their demonstrated ability to:\\n  * Identify mutually beneficial outcomes for buyers and sellers\\n  * Address agency issues and reduce incentives for gaming\\n  * Directly handle substitutes and complements, unlocking transactions that wouldn’t be possible otherwise\\n  * Mitigate information leakage and asymmetry\\n\\n\\nOneChronos is pioneering the use of Nobel prize-winning (Economic Sciences, 2020) combinatorial auction techniques and artificial intelligence in financial markets, operating a Smart Market at a speed, scale and computational complexity that was not possible until now.\\n![](data:image/svg+xml;charset=utf-8,%3Csvg%20height=\\'1080\\'%20width=\\'1920\\'%20xmlns=\\'http://www.w3.org/2000/svg\\'%20version=\\'1.1\\'%3E%3C/svg%3E)\\n![Logistics and transportation⟨10⟩]\\n![](data:image/svg+xml;charset=utf-8,%3Csvg%20height=\\'1787\\'%20width=\\'2740\\'%20xmlns=\\'http://www.w3.org/2000/svg\\'%20version=\\'1.1\\'%3E%3C/svg%3E)\\n![Combinatorial optimization⟨11⟩]\\n## Many Needs, One Solution.\\nOneChronos offers brokers and their clients a simple mechanism to enhance their existing algorithms — VWAP, IS, liquidity seeking, and multi-objective execution — and accomplish diverse trading goals:\\n  * Market impact modulation\\n  * Single-security indifference curves\\n  * Synthetic creation and redemption of ETFs\\n  * Pairs and spread trading\\n  * Multi-security portfolio execution and hedging\\n\\n\\nExamples, details, and production availability status can be found in our Expressive Bidding Guide⟨3⟩.\\n## Standard workflow, game changing paradigm\\n  * Point-in-time auctions every ~100ms throughout the trading day\\n  * Match priority based on aggregate notional price improvement contributed\\n  * All matches are within or at the NBBO at a single clearing price per symbol\\n  * Customizable constraints to isolate specific execution objectives\\n\\n\\n  * Fully non-displayed. No data feeds. Firm orders only. Multilateral fills\\n  * Seamless fit in today’s algorithm & routing workflows. Standard order types supported, in addition to those unique to OneChronos. All orders via FIX 4.2\\n  * Single auction process spanning all orders & eligible NMS securities\\n  * Differentiated liquidity, customized fills, unique trading opportunities\\n\\n\\n## FAQ\\n###### Auction Mechanics, Match Procedure & Order Types\\n### \\nHow are OneChronos periodic auctions initiated? And at what frequency?\\nOneChronos matches orders using periodic auctions. All auctions are initiated by the venue at deliberately randomized start times; auctions are not user-initiated. OneChronos aims to conduct an average of 10 auctions per second throughout the trading day. Each auction considers all symbols and eligible orders.\\n### \\nHow are orders matched on OneChronos ATS? What is the “match priority” model?\\nOneChronos auctions use mathematical optimization to seek optimal matches across all orders, instead of matching orders one-by-one. The optimization’s objective is to maximize Aggregate Price Improvement (see dedicated question for definition) across all orders and symbols. Each auction looks for the configuration of “winning” orders and per-security clearing prices that will result in the most price improvement dollars cleared, taking into account all orders’ constraints.\\n### \\nWhat order types are available at OneChronos?\\nThe ATS accepts Limit Orders, Peg Orders (Midpoint, Primary, and Market), and Expressive Orders: an order type specific to OneChronos that allows participants to introduce their business-specific execution instructions to our optimizer, spanning one or more orders in one or more securities. _Note that Expressive Bidding is currently enabled for \"Pairs\" only (i.e. Expressive Orders consisting of two symbols). For more information, please see our Form ATS-N._\\n### \\nHow is Aggregate Price Improvement defined?\\nFor an individual order, Price Improvement Dollars refers to the difference between the limit price on the order and the auction clearing price (i.e. the price at which the order is filled) for the given security, times the quantity filled. For an Expressive Order to buy and/or sell multiple securities simultaneously, price improvement refers to differences in limit prices and clearing prices for each respective security, summed across all securities times the quantities filled. _Note that Expressive Bidding is currently enabled for \"Pairs\" only (i.e. Expressive Orders consisting of two symbols). For more information, please see our Form ATS-N._ Aggregate Price Improvement represents the sum of Price Improvement Dollars across all eligible orders (across all securities) under consideration for a given auction.\\n### \\nWhat is a Smart Market?\\nA Smart Market is a periodic auction solved using a powerful operations research technique called mathematical optimization. As used in many areas of electronic trading and portfolio management, optimization allows for maximization (or minimization) of a specifically defined objective, while respecting a set of constraints. In the case of the OneChronos ATS, we’re extending this robust application to the venue level where buyer’s & seller’s orders meet. The OneChronos optimization’s primary objective is to identify, match and clear the configuration of buy and sell orders which would maximize Aggregate Price Improvement achievable by those orders in a given auction.Smart Markets have been deployed commercially dating back to the 1990s by various large cap industries and government procurement auctions of physical commodities to achieve the benefits we describe above, and continue to grow in adoption given their proven success towards those goals.\\n### \\nWhere within or outside the spread can orders match?\\nOrders can match at any price within the spread, at or between the NBB and NBO. All orders in each security match at a single price in each auction. Orders can be filled at prices better than their limit price, because of how prices are determined via optimization.\\n### \\nDoes the ATS support Immediate-or-Cancel (IOC) Orders?\\nYes. OneChronos supports time-in-force (TIF) instructions such as: Day, Immediate or Cancel (IOC), Fill or Kill, Good ‘Til Date (with an expire time not to exceed the end of the current trading session). IOC orders effectively participate in a single auction occurrence. For a complete list of TIF instructions, see our FIX documentation⟨12⟩.\\n### \\nWhere can I see some examples of how the auction determines match priority?\\nPlease see Part 3 Item 11 our ATS-N filing under the heading “PRIORITY AND PRICE FORMATION EXAMPLE”⟨13⟩.\\n### \\nHow might my order be price improved?\\nThe primary goal of the OneChronos matching process is to find the configuration of orders that yield the most Aggregate Price Improvement as compared to their respective limit prices. As each auction results in a single clearing price for each security, eligible orders may receive fills at a price better than their limit price.\\n### \\nHow are Artificial Intelligence/ Machine Learning techniques used by OneChronos?\\nOneChronos is a Smart Market leveraging the power of optimization search techniques to match and clear buyer’s and seller’s orders efficiently and in a way that maximizes Aggregate Price Improvement achievable by those orders.The optimization problem these auctions pose is “computationally intractable”, because the flexible “Expressive Bidding” that the ATS allows for creates an astronomical number of possible matches to search through. Traditionally, these optimizations are solved using a technique called integer programming and would run for hours or days at a time.To operate at the speed of equities markets and to scale effectively, OneChronos uses AI in an effort to guide our optimizer toward areas of that search space containing higher quality matches, and ultimately better satisfy the objective of maximizing Aggregate Price Improvement.\\n### \\nHow is the 2020 Nobel Prize in Economics work related to the auction type used by OneChronos?\\nIn October 2020, the Nobel Prize in Economic Science was awarded to two Stanford academics, Paul Milgrom and Robert Wilson, for their improvements to auction theory and inventions of new auction formats. Their research in game theory and auction theory and their advancements in practical auction formats underpin the Smart Market.We at OneChronos are elated at both their deserving receipt of the prize and the validation of their inventions’ contributions to marketplaces of all kinds.You can learn more about the 2020 Nobel Prize in Economics here⟨14⟩, and greater detail on Wilson and Milgrom’s research and auction formats here⟨15⟩.\\nMore\\n###### Trading at OneChronos\\n### \\nCan orders persist for multiple OneChronos auctions? For example, those not matched or not fully executed in a OneChronos auction.\\nYes, orders with residual (“leaves”) quantity can persist for the duration of the trading day for successive auctions. Time in force instructions and default values are described, per our FIX specification, found here⟨12⟩.\\n### \\nWhat types of participants are anticipated to use OneChronos?\\nWhile only broker-dealers may be direct subscribers, the OneChronos participant base is anticipated to consist primarily of institutional customers of broker-dealers, and broker-dealers themselves including franchise risk management teams, equity and options market makers and specialists. As it pertains to their agency offering, broker-dealers may offer OneChronos as a complement to their single stock or multi-asset algorithm and smart-routing products, and as a DMA destination. Please speak with your broker for further info on how OneChronos is incorporated in their execution services offerings.\\n### \\nHow does the ATS determine which orders are eligible in an auction? What happens to orders received after the auction cutoff?\\nThe ATS system chooses auction cutoff times at random within a pre-set range. Any orders that have a timestamp prior to the auction cutoff are eligible. Orders timestamped after the auction cutoff time are eligible to participate in the subsequent auction.\\n### \\nHow does cancel-replace work during the auction life-cycle? Is there a lock-up period?\\nEach auction consists of buffer time for inbound market data and order data, followed by the optimization sequence, then outbound execution and order data. Continuous order management is available throughout this full life-cycle. However, any order not canceled or cancel / replaced prior to the initiation of the optimization sequence will take effect in the subsequent auction.\\n### \\nWho can access OneChronos directly?\\nAll OneChronos subscribers must be SEC registered Broker Dealers and members of at least one SRO. All orders received by the ATS are received from Subscribers (including those originated from their customers).Institutions that are not SEC broker dealers can access OneChronos through their broker. Institutions can, however, directly convey “expressive” constraints to complement orders they may send to their broker for execution at OneChronos in effort to achieve a customized fill experience. See our FAQ section on Expressive Bidding for further information.\\n### \\nCan I send DMA orders through my broker for potential execution at OneChronos ATS?\\nYes. Please speak with your broker regarding their DMA offering and OneChronos as a destination. Directing DMA orders for execution at OneChronos allows for Institutions or Brokers to tailor execution constraints specific to their risk management and execution objectives. See FAQ section on Expressive Bidding⟨16⟩ for further detail.\\n### \\nDoes the OneChronos ATS use tiering or segmentation?\\nOneChronos does not use tiering or segmentation.\\n### \\nDoes OneChronos ATS offer Conditional Indications?\\nYes, for more information, please see our Form ATS-N, Part III, Item 9.\\n### \\nDoes OneChronos ATS send out Indications of Interest?\\nOneChronos does not send out indications of interest. OneChronos does however, support Conditional Indications, and will issue invites when there exists eligible contraside liquidity for the Conditional Order. For more information, please see our Form ATS-N, Part III, Item 9.\\n### \\nHow is liquidity taking and liquidity providing defined and considered in the matching process?\\nOneChronos auctions do not have a notion of adding or removing liquidity, and do not categorize participants as liquidity providers or liquidity takers. See our FAQ section on Auction Mechanics, Match Procedure & Order Types to better understand the OneChronos auction process.\\n### \\nDoes OneChronos support Odd lots or Mixed Lots?\\nOneChronos does accept odd-lot and mixed-lot orders. The minimum trade size is 1 share. Both odd-lot and mixed-lot orders are treated and handled in the same manner as round lot orders.\\n### \\nDoes OneChronos support Min Quantity?\\nYes, available on all orders.\\n### \\nWhat happens when Residual quantity of an order falls below Min Quantity?\\nThe order will be cancelled in the manner configured by the user through FIX port settings.\\n### \\nDoes OneChronos have a self-cross prevention feature?\\nYes. See the FIX documentation⟨12⟩ for order handling details.\\n### \\nWhat securities does OneChronos ATS accommodate?\\nOneChronos supports NMS securities, including single stocks, ETFs and ADRs.\\n### \\nCan OneChronos accept or rank orders priced in increments smaller than $0.01 (sub-penny)?\\nRule 612 (§ 242.612 Minimum pricing increment) of SEC Regulation NMS expressly prohibits brokers, exchanges, and alternative trading systems from accepting, displaying, or ranking quotes or orders for any NMS stock priced in an increment smaller than $0.01 for stocks priced greater than or equal to $1.00 or $0.0001 for stocks priced less than $1.00. Limit prices greater than or equal to $1.00 must be expressed in increments of at least $0.01 (i.e. sub-penny prices are not permitted). Limit prices less than $1.00 must be expressed in increments of at least $0.0001. This applies to limit prices on all order types.\\n### \\nCan OneChronos match orders at prices that are not in increments of $0.01 or allow Expressive Bidding constraints that can result in sub-penny executions?\\nYes. The OneChronos match mechanism, as detailed in our Form ATS-N, is not restricted to establishing clearing prices in increments of $0.01. The possibility of sub-penny clearing prices is consistent with Rule 612 of NMS, which governs the minimum pricing of quotes and orders. However, it does not impose any restrictions on execution prices. All OneChronos executions are average priced, computed to six decimal places using the formula: average price = total notional paid or received/total shares transacted. Note that any order can fill at its limit price or better, which could be a sub-penny price, as a function of the OneChronos match process (see dedicated FAQ question). Also, through Expressive Bidding, a OneChronos user can impose constraints on an execution that can result in fills at sub-penny average prices. As such, Expressive Bidding can guarantee that an order executes at a sub-penny price or better but cannot be used to ensure execution at a specific price, sub-penny or otherwise.\\n### \\nDo you have examples demonstrating situations in which sub-penny executions can occur?\\nYes. First, note that before formulating the optimization problem used to determine the matches and clearing prices for a given auction, OneChronos will round coefficients in the objective function (down for an order to buy and up for an order to sell) to increments of $0.01. The following examples are non-exhaustive and meant to illustrate specific situations in which executions can and cannot occur at sub-penny prices.**Example 1:** User A submits a buy order of 300 at 10.01. User B submits a sell order of 100 at 10.00. User C submits a sell order of 100 at 10.00. The auction clears 200 shares at 10.006.**Example 2:** User submits a Target Order to buy 100 shares at $10.01 with the Expressive Bidding constraint that 10.005*fill_quantity ≤ $1,000.505. The User’s notional value contribution to the objective function is $10.01*fill_quantity.**Example 3:** User submits a Target Order to buy 100 shares at $10.01 all-or-none at a total notional value ≤ $1,000.50. The User’s notional value contribution to the objective function is $1,000.50 if the order fills and $0.00 otherwise. Such an order can only fill at an average price of $10.005 or better.**Example 4:** User submits a Target Order to buy 100 shares at $10.01 all-or-none at a total notional value ≤ $1,000.500001. Before computing match priority, OneChronos will round the max notional value contributed down to $1,000.50; if the Target Order was a sell and the constraint was total notional value ≥ $1,000.500001, OneChronos would round up to $1,000.51.\\n### \\nDoes OneChronos pass back LastLiquidityIndicator on executions?\\nOneChronos does not pass back LastLiquidityIndicator (tag_851) on executions, as it does not have a concept of adding or removing liquidity in its auctions. However, OneChronos does pass back TradeLiquidityIndicator (tag_9730) values on executions to communicate fee codes to our subscribers.\\n### \\nGiven the duration of the OneChronos auction lifecycle how can I increase my likelihood of fills on OneChronos?\\nOrders with a duration of less than 100ms may experience a lower likelihood of being filled at OneChronos.Note, however, that continuous order management is available throughout the full auction life-cycle, and without any “queue” penalty, as orders at OneChronos are not matched on the basis of time priority.Orders timestamped after the auction cutoff time are eligible to participate in the subsequent auction(s). Similarly, any order not cancelled or cancel/ replaced prior to the auction cutoff time will take effect in the subsequent auction.Orders may be tagged to participate in only one auction (“IOC”), or persist for subsequent auctions for any specified period up to the end of the day’s trading session.\\nMore\\n###### Trade Reporting, Visibility & Transparency\\n### \\nWhere does OneChronos ATS print its trades?\\nATS executions are printed to the FINRA NYSE TRF.\\n### \\nWhat data is disseminated through public trading reporting?\\nOneChronos publicly (through TRF) disseminates the execution price and total volume matched for each security in each auction. Individual participants also receive execution reports with their individual fill quantity within that total.\\n### \\nWhere can I view Form ATS-N for OneChronos ATS?\\nThe OneChronos Form ATS-N filed with the SEC can be found at this link⟨17⟩.\\n### \\nWhat is the OneChronos ATS MPID?\\nThe MPID for OneChronos is: CGXS\\n### \\nWhat is the OneChronos ATS MIC Code?\\nThe MIC Code for OneChronos is: CGXS\\nMore\\n###### Data Center, Market Data & Routing\\n### \\nWhere is the OneChronos matching engine located?\\nThe OneChronos matching engine is located at Equinix NY5.\\n### \\nDoes OneChronos ATS route any orders externally? For example, those not matched in a OneChronos auction.\\nOneChronos does not route orders externally.\\n### \\nHow is NBBO calculated?\\nThe NBBO prices used in OneChronos auctions are the SIP derived prices most recent to but not after the Auction Initialization Time. As an illustrative example of this procedure: \\n* Auction Initialization results in an auction cutoff time;\\n* Auction Network Buffering allows data to propagate from exchanges, to the SIP, and ultimately to the OneChronos ATS;\\n* After buffering the ATS computes NBBO for each tradable symbol by processing all messages from the SIP with Exchange Timestamps less than or equal to the cutoff time for the auction.\\n### \\nDoes OneChronos offer co-location?\\nOneChronos allows Subscribers to connect directly to the ATS via cross-connect or extranet.Note: we are starting with a single PoP, however the system is developed to support expansion to multiple PoPs across the country.\\n### \\nWhere does OneChronos get its Market Data? Does OneChronos ATS maintain direct market data feeds?\\nOneChronos constructs a view of NBBO from data provided by the SIP (NYSE CTA feeds & Nasdaq UTP). Each SIP message contains a timestamp provided by the reporting exchange representing when that exchange processed the given message. OneChronos market data and matching systems use these Exchange Timestamps in conjunction with the buffering period prior to each auction in an effort to construct a consistent time-aligned view of the market. The ATS does not subscribe to direct feeds from the national exchanges.\\n### \\nDoes OneChronos provide any data feeds?\\nOneChronos does not provide any data feeds (for example, to its Subscribers).\\nMore\\n###### Connectivity\\n### \\nHow can OneChronos be accessed?\\nSubscribers access OneChronos via a standard FIX (4.2) connection. Customers of Subscribers access OneChronos indirectly via their Broker’s execution products and services, which may include: single stock or multi-asset algorithms, where portions of that order may be routed to OneChronos for execution from the Broker’s router; a Broker’s Direct-to-SOR offering which may route orders to OneChronos for execution; or a Broker’s Direct Market Access (“DMA”) offering, where a Broker’s clients may direct orders to OneChronos or other destinations using their own algorithms and or routing.\\n### \\nAre there any special requirements for order submission via FIX?\\nNo. Orders sent to OneChronos ATS for execution are transmitted using standard FIX protocol. See our FIX specification here⟨12⟩ for further information.\\n### \\nWhat are the hours of operation for OneChronos ATS?\\nStandard Market Hours (US Eastern time): \\n* 8:00am: begin accepting FIX connections / sessions;\\n* 9:15am: begin accepting orders;\\n* 9:30am: begin executing orders (i.e. first call auction will take place at or after 9:30am);\\n* 4:00pm: stop executing orders (i.e. final call auction will take place at or before 4:00pm);\\n* 5:00pm: all FIX sessions disconnected.\\n###### Expressive Bidding\\n### \\nWhat is Expressive Bidding? How should I consider if Expressive Bidding is relevant for how I trade?\\nExpressive bidding allows users to input specific execution instructions at the matching engine level that are precisely tailored to their execution or investment strategy objectives.For example, a pairs trader could effect instructions to buy asset ABC (subject to the price & quantity in her ABC limit order) only if she can also sell asset DEF (subject to the price & quantity in her DEF limit order) at a defined ratio, in the same auction.Expressive Bidding is communicated to the OneChronos matching engine using a general purpose programming language (Reason ML or OCaml) or use-case-specific languages developed by OneChronos. Users (clients of Brokers or Brokers themselves) can construct and tailor execution instructions relevant to them or their clients.**_Note that Expressive Bidding is currently enabled for \"Pairs\" only (i.e. Expressive Orders consisting of two symbols). For more information, please see our Form ATS-N._**\\n### \\nIs Expressive Bidding required to trade at OneChronos?\\nExpressive bidding is not required to trade at OneChronos. It is an optional and powerful feature available to Subscribers and their customers. It allows users to integrate their specific execution or investment constraints directly into our matching engine.\\n### \\nCan / Does my broker use Expressive Bidding to complement its trading algorithm or smart routing strategies?\\nThere are myriad creative implementations Brokers may use to complement and strengthen their execution offerings and their related customizations. Please speak with your Broker to learn how OneChronos is incorporated in their execution services offerings.\\n### \\nIs Expressive Bidding something I would use directly, or through my broker?\\nPlease speak with your broker on how they might incorporate Expressive Bidding for general use or on a customized basis to complement their trading algorithms or smart routing for single stock or multi-asset strategies.If your firm is accustomed to computer-driven trading or execution, Expressive Bids should integrate well.You can construct tailored bidder logic or leverage your broker to complement orders you send to them for potential execution at OneChronos.\\n### \\nCan my Limit price or Quantity ever be violated?\\nNo. The economics of your Limit Order or Limit Orders serve as an upper or lower bound (as relevant) for any order, including those using Expressive Bidding to create conditionality across multiple limit orders. _Note that Expressive Bidding is currently enabled for \"Pairs\" only (i.e. Expressive Orders consisting of two symbols). For more information, please see our Form ATS-N._\\n### \\nIs Expressive Bidding required to achieve the benefits OneChronos discusses; price improvement, mitigated impact, unique crossing opportunities?\\nExpressive bidding is not required to achieve the benefits or differentiation that OneChronos represents. The OneChronos matching engine and mechanism is designed to find price improvement opportunities, mitigate information leakage, and create unique interaction opportunities for any order type.Expressive Bidding allows further execution customization with powerful application to users who are trading substitutable or complementary assets or orders or portions of larger orders.\\n### \\nIs there benefit to interacting with other orders which are using Expressive Bidding?\\nYes, there is potential benefit for a variety of reasons such as but not limited to potential further price improvement achievable, larger fill size, a customized fill experience, reduced impact, unique liquidity interaction points, and unlocking mutually beneficial trades that would likely otherwise not occur, as in this example, which uses hypothetical Expressive Bidding functionality _Note that Expressive Bidding is currently enabled for \"Pairs\" only (i.e. Expressive Orders consisting of two symbols). For more information, please see our Form ATS-N._ :Trader A wants to de-risk her healthcare sector exposure. Traditionally, she enters individual parent SELL orders in one or more healthcare stocks through a trading algorithm or to market center. Alternatively, Trader A sends limit orders to OneChronos across multiple healthcare names, with Expressive Bidding instructions to trade any combination of those names up to $20mm (subject to the limit prices and quantities in her limit orders). Trader B sends a standard BUY limit order to OneChronos for a specific healthcare stock. Both Trader A and Trader B have a higher likelihood of a fill given Trader A’s expressed substitutability across related assets. _Note that Expressive Bidding is currently enabled for \"Pairs\" only (i.e. Expressive Orders consisting of two symbols). For more information, please see our Form ATS-N._\\n### \\nCan OneChronos help me construct Expressive Bid constraints? Are there existing templates? Tutorials?\\nYes, OneChronos provides recorded and live support for bid construction. We also provide templates for common trading and execution strategies that can be modified for use in production.A great place to begin is with the introductory content and customizable templates available in the introduction to⟨18⟩ our Expressive Bidding site.Please feel free to reach out to us at info@onechronos.com to discuss how we can help you with Expressive Bidding.\\nMore\\nAbout\\nOneChronos ® Markets LLC is a wholly-owned broker-dealer subsidiary of OCX Group Inc. We’re an independent, venture backed company using cutting edge technological paradigms to enable the next generation of electronic trading. Contact us at info@onechronos.com.\\nMember FINRA/SIPC: www.finra.org⟨19⟩. Check the background of OneChronos Markets LLC on FINRA’s BrokerCheck.⟨20⟩\\nA copy of OneChronos Markets LLC’s ATS-N is available here.⟨17⟩\\nProduct\\n  * Home⟨2⟩\\n\\n\\nDocs\\n  * Expressive Bidding⟨3⟩\\n  * Market Structure⟨21⟩\\n  * FIX⟨12⟩\\n  * User Manual⟨22⟩\\n  * Explore All⟨4⟩\\n\\n\\nLegal\\n  * Privacy Policy⟨23⟩\\n  * Cookie Policy⟨24⟩\\n  * Terms of Use⟨25⟩\\n  * Acceptable Use Policy⟨26⟩\\n  * Business Continuity Plan⟨27⟩\\n  * Regulatory⟨28⟩\\n  * Cookie Settings⟨29⟩\\n\\n\\n' references_markdown='\\n\\n## References\\n\\n⟨1⟩ https://www.onechronos.com/: OneChronos logo\\n⟨2⟩ https://www.onechronos.com/</>: Home\\n⟨3⟩ https://www.onechronos.com/</docs/expressive/>: E-Bidding\\n⟨4⟩ https://www.onechronos.com/</docs/>: Docs\\n⟨5⟩ https://www.onechronos.com/</about/>: About\\n⟨6⟩ https://www.onechronos.com/<https:/think.onechronos.com/podcast/>: Insights\\n⟨7⟩ https://www.onechronos.com/</careers/>: Careers\\n⟨8⟩ https://www.onechronos.com/</contact/>: Contact\\n⟨9⟩ https://www.onechronos.com/static/f807a49087190afc2b40f8dbb68d9802/7b96a/optimization_grid.svg: Combinatorial optimization\\n⟨10⟩ https://www.onechronos.com/static/2fcbe7044e26d6e6fbd5e8c0617e439f/c4b47/logistics.svg: Logistics and transportation\\n⟨11⟩ https://www.onechronos.com/static/a4edfba775446dc12bafab814d3bbb3d/21f2d/auction_blocks.svg: Combinatorial optimization\\n⟨12⟩ https://www.onechronos.com/</docs/fix/fix-42/>: FIX documentation\\n⟨13⟩ https://www.onechronos.com/<https:/www.sec.gov/Archives/edgar/data/1692652/000169265225000003/xslATS-N_X01/primary_doc.xml#partIIIitem11>: “PRIORITY AND PRICE FORMATION EXAMPLE”\\n⟨14⟩ https://www.onechronos.com/<https:/www.nobelprize.org/prizes/economic-sciences/2020/press-release/>: here\\n⟨15⟩ https://www.onechronos.com/<https:/www.nobelprize.org/uploads/2020/09/popular-economicsciencesprize2020.pdf>: here\\n⟨16⟩ https://www.onechronos.com/</docs/expressive/faq/#expressive-bidding-with-onechronos>: FAQ section on Expressive Bidding\\n⟨17⟩ https://www.onechronos.com/<https:/www.sec.gov/Archives/edgar/data/1692652/000169265225000003/xslATS-N_X01/primary_doc.xml>: this link\\n⟨18⟩ https://www.onechronos.com/</docs/expressive/start-here/>: introduction to\\n⟨19⟩ https://www.onechronos.com/<https:/www.finra.org/>: www.finra.org\\n⟨20⟩ https://www.onechronos.com/<https:/brokercheck.finra.org/>: FINRA’s BrokerCheck.\\n⟨21⟩ https://www.onechronos.com/</docs/market-structure/clearing-examples/>: Market Structure\\n⟨22⟩ https://www.onechronos.com/</docs/user-manual/>: User Manual\\n⟨23⟩ https://www.onechronos.com/<https:/app.termly.io/policy-viewer/policy.html?policyUUID=cb5783c6-cbf9-462b-9f63-2ac6466baf7f>: Privacy Policy\\n⟨24⟩ https://www.onechronos.com/<https:/app.termly.io/policy-viewer/policy.html?policyUUID=443ba7d6-0ff3-4674-a10d-7216457c6185>: Cookie Policy\\n⟨25⟩ https://www.onechronos.com/<https:/app.termly.io/policy-viewer/policy.html?policyUUID=4554f8dd-2983-4b99-87b5-7bd17e04f9d3>: Terms of Use\\n⟨26⟩ https://www.onechronos.com/<https:/app.termly.io/policy-viewer/policy.html?policyUUID=16933435-f899-4a1f-92c9-e05838108096>: Acceptable Use Policy\\n⟨27⟩ https://www.onechronos.com/</legal/bcp/>: Business Continuity Plan\\n⟨28⟩ https://www.onechronos.com/</legal/regulatory/>: Regulatory\\n⟨29⟩ https://www.onechronos.com/<#>: Cookie Settings\\n' fit_markdown='' fit_html=''",
  "generated_description": "**OneChronos: Revolutionizing Trading for Institutional Investors**\n\nOneChronos is like a breath of fresh air in the crowded fintech landscape, presenting itself as \"The Smart Market for Institutional Investors.\" Founded in New York and part of Y Combinator's S16 batch, this innovative U.S. equities alternative trading system (ATS) is tackling the persistent challenges faced by traders in executing their orders. The company, which boasts a lean team of 35 employees under the guidance of Group Partner Jared Friedman, is on a mission to bridge the gap between traditional trading venues and the execution needs of traders.\n\n### What They Do\n\nAt its core, OneChronos employs advanced mathematical optimization to facilitate a new kind of smart market where transactions can happen at a scale and speed previously thought impossible. This isn't your typical ATS. OneChronos conducts point-in-time auctions every 100 milliseconds, enabling innovative features like Expressive Bidding. This allows traders not only to participate but to express their specific execution goals—think of it as bringing the personal touch of voice trading into the fast-paced electronic world.\n\n### Key Features\n\n- **Smart Markets:** By leveraging Nobel Prize-winning auction techniques, OneChronos optimizes order matches to deliver better price improvement, increased liquidity, and fairer trading conditions across all participants.\n  \n- **Expressive Bidding:** This feature grants users the ability to set custom constraints for their trades. Picture a portfolio manager who can buy and sell interconnected assets in a single auction—this reflects the sophistication and security today's data-driven investors demand.\n\n- **Proven Effectiveness:** The use of sophisticated techniques in various industries demonstrates that aiming for mutually beneficial outcomes while reducing agency problems can unlock new trading opportunities. With AI enhancing order matching, OneChronos stands at the forefront of efficiency in financial markets.\n\n### Market Impact\n\nRather than competing on merely price or speed, OneChronos focuses on the underlying principles of fairness and efficiency—providing institutional customers with a trading venue that tailors to their nuanced needs. Their service can adapt to various trading goals, whether it's managing market impact, executing complex multi-security strategies, or finding unique liquidity opportunities that traditional setups might miss.\n\n### Conclusion\n\nIn a world where trading is often perceived as a race to the bottom, OneChronos invites institutional investors to rethink their approach. By embracing cutting-edge technology, they have crafted a platform that promises not only improved execution outcomes but also a more intelligent and customizable trading experience. \n\nIf you're interested in exploring this revolutionary platform further, check out [OneChronos’ website](https://www.onechronos.com)."
}