{
  "links": "https://www.ycombinator.com/companies/opencurriculum",
  "name": "OpenCurriculum",
  "headline": "Helping K-12 teachers and school administrators build awesomeâ¦",
  "batch": "W14",
  "description": "A library of community curated teaching and learning materials, free to the entire world. Come collaborate; we can teach better together.\r\n\nOpenCurriculum, Inc. is a California based technology nonprofit organization with a mission to bring openness and innovation to K12 education around the world",
  "activity_status": "Active",
  "website": "https://opencurriculum.org",
  "founded_date": 2011.0,
  "team_size": null,
  "location": "Mountain View",
  "group_partner": null,
  "group_partner_yc": null,
  "company_linkedin": null,
  "company_twitter": null,
  "tags": "industry:artificial-intelligence; industry:education; location:san-francisco-bay-area",
  "founders": [],
  "status": true,
  "markdown": "raw_markdown=\"[![](https://s3.amazonaws.com/assets.opencurriculum.org/images/public/2017-logo-m.png)](https://opencurriculum.org/</>)\\nMenu \\n  * [Home](https://opencurriculum.org/</>)\\n  * [Features](https://opencurriculum.org/<>)\\n    * [Features For teachers](https://opencurriculum.org/</teachers>)\\n    * [Features For administrators](https://opencurriculum.org/</administrators>)\\n  * [Video demos](https://opencurriculum.org/</demos>)\\n  * [Pricing](https://opencurriculum.org/</pricing>)\\n  * [Login](https://opencurriculum.org/<>)\\n  * [Sign up for free](https://opencurriculum.org/<>)\\n\\n\\n# Plan engaging lessons and units, using the world’s best ideas at your fingertips.\\nOpenCurriculum is a delightful curriculum planning tool that helps you quickly create effective lessons and units, using our library of high-quality ready-to-go ideas and an easy-to-use editor. \\n[ Get started for free ](https://opencurriculum.org/<>)\\n[Administrators: Click here to learn how it can help your school](https://opencurriculum.org/</administrators>)\\n![](https://s3.amazonaws.com/assets.opencurriculum.org/images/home2/hero.png)\\nUsed by teachers in these schools and districts, and more \\n![](https://s3.amazonaws.com/assets.opencurriculum.org/images/home2/KPPCS.jpg) ![](https://s3.amazonaws.com/assets.opencurriculum.org/images/home2/Highline.jpg) ![](https://s3.amazonaws.com/assets.opencurriculum.org/images/home2/DIS.jpg) ![](https://s3.amazonaws.com/assets.opencurriculum.org/images/home2/IPSD.jpg) ![](https://s3.amazonaws.com/assets.opencurriculum.org/images/home2/SFUSD.jpg) ![](https://s3.amazonaws.com/assets.opencurriculum.org/images/home2/AGK.jpg) ![](https://s3.amazonaws.com/assets.opencurriculum.org/images/home2/CPS.jpg)\\n## Discover new ideas that help your students learn faster.\\nYou’ll find hundreds of rigorous and engaging lessons, strategies, activities, enduring understandings, formative assessments, discussion questions, and worksheets written by expert teachers, researchers, and publishers in the tool. Just-in-time reminders offer these ideas when you need them, saving you from hours of research. You can pick and drop whatever you think will work for your students, into your own plans. \\n![](https://s3.amazonaws.com/assets.opencurriculum.org/images/home2/inspirational-units.png) ![](https://s3.amazonaws.com/assets.opencurriculum.org/images/home2/maya-nudge.png) ![](https://s3.amazonaws.com/assets.opencurriculum.org/images/home2/handout.png)\\n![](https://s3.amazonaws.com/assets.opencurriculum.org/images/home2/video-in-lesson.png) ![](https://s3.amazonaws.com/assets.opencurriculum.org/images/home2/assessments-embedded.png) ![](https://s3.amazonaws.com/assets.opencurriculum.org/images/home2/spanish-embedded-book.png)\\n## Add assessments, links, books, videos, and oh so much more!\\nIt’s just like Google Docs, but with more support and structure for expressing what and how you want to teach. It gives you creative ways to express your curriculum and instructional design ideas, without forcing you into fill-in-the-box templates. Drop the assessments, links, books, videos, images, etc. from the tool onto your learning management system for students to get in on the fun. \\n## Share, find, and co-plan with your colleagues.\\nOpenCurriculum has so many ways for you to share plans with your colleagues and supervisors. Use Google Docs-style permissions to pick exactly who can see and edit your plans, while allowing permissions to trickle down in sub-plans. Share with entire departments or PLCs in one shot, using the “Groups” feature. With the “Libraries” feature, you can catalog, track, and archive materials inside folders and easily filter based on tags. Just like Gmail search, OpenCurriculum’s instant search lets you find things across your school and beyond quickly. \\n![](https://s3.amazonaws.com/assets.opencurriculum.org/images/home2/sharing.png) ![](https://s3.amazonaws.com/assets.opencurriculum.org/images/home2/instant-search.png) ![](https://s3.amazonaws.com/assets.opencurriculum.org/images/home2/library.png)\\n# Track your long-term and short-term plans visually.\\nSee your courses, units, and lessons laid out visually to see where you are now and where you are going. Switch between planner and calendar views to visualize your week, overlaid by your Google calendar schedule. Hide courses and units and preview full plans to instantly see the big picture and teeny tiny details all together. \\n  * ##### Planner view\\nSee the contents of your lessons and units on top of one another on a weekly planning page.\\n  * ##### Calendar view\\nSee the contents of your lessons and units on at the times of day on a weekly planning page.\\n  * ##### Semester or academic term view\\nSee your and your colleagues’ lesson and units laid out over your academic session.\\n\\n\\n![](https://s3.amazonaws.com/assets.opencurriculum.org/images/home2/planner-week.png) ![](https://s3.amazonaws.com/assets.opencurriculum.org/images/home2/planner-calendar.png) ![](https://s3.amazonaws.com/assets.opencurriculum.org/images/home2/planner-semester.png)\\n## Lesson and unit planning is for everyone!\\nWhether you are planning for in-person learning, hybrid classrooms, or remote learning, planning can give you the clarity you need to help your students succeed, without becoming mundane. No matter how many years you have taught for, lesson and unit planning pushes your practice forward. \\n[Learn more about how OpenCurriculum can help you plan better](https://opencurriculum.org/</teachers>)\\n# Make rigorous learning experiences that are highly enjoyable!\\nOpenCurriculum helps you shape transformative classroom moments. It nudges you towards student-first planning by helping you to adapt curriculum to what students are excited about right now. The outcome is lessons and units that lead to discovery, depth of understanding, and the good kind of rigor. These help you replace uninteresting textbook exercises and boost your students’ learning everyday. \\n## Align your plans with standards and goals, starting with the end first.\\nOpenCurriculum takes the stress out of aligning your plans to standards or other learning goals. You can use an easy-to-use standards picker to choose from national or state standards, or learning targets made at your school. Or even pick unit standards from course plans, or lesson standards from unit plans. This keeps all your plans coherent, and never lets your curriculum go out of whack. You can even customize templates to design with the end in mind, in a breeze. \\n![](https://s3.amazonaws.com/assets.opencurriculum.org/images/home2/add-competencies.png)\\n![](https://s3.amazonaws.com/assets.opencurriculum.org/images/home2/differentiation.png)\\n## Differentiate for specific student needs, without much effort.\\nIt’s just like Google Docs, but with more support and structure for expressing what and how you want to teach. It gives you creative ways to express your curriculum and instructional design ideas, without forcing you into fill-in-the-box templates. Drop the assessments, links, books, videos, images, etc. from the tool onto your learning management system for students to get in on the fun. \\n# Instantly see an overview of your syllabus.\\nSeeing the overall picture of a course’s units and a unit’s lessons in one glance is invaluable. OpenCurriculum automagically creates scopes & sequences to show you the most important highlights of units, and pacing guides for already scheduled courses and units, which show you similar information, but on a calendar timeline. You can then pick & choose which sections from each plan show up on the highlights pages. \\n![](https://s3.amazonaws.com/assets.opencurriculum.org/images/home2/syllabus.png)\\n## Always feel supported and guided.\\nOpenCurriculum takes the loneliness out of the planning process. It offers suggestions, explanations, reminders, and starting points like activity names and handout templates to make every step feel collaborative and supportive. \\n![](https://s3.amazonaws.com/assets.opencurriculum.org/images/home2/add-activity.png) ![](https://s3.amazonaws.com/assets.opencurriculum.org/images/home2/maya-pck.png) ![](https://s3.amazonaws.com/assets.opencurriculum.org/images/home2/unit-template.png)\\n## The #1 platform for curriculum and instruction leadership.\\nOpenCurriculum gives curriculum and instruction leaders the tools to implement change that leads to long-lasting improvement in school-wide curriculum mapping and instructional practices. \\n## Turn your school philosophy and model into instructional practice.\\nStart with a mission and school philosophy and allow the tool to help you embed it across all steps of the curriculum design process. Use custom templates with tips to guide teachers to respond to specific prompts. Use course plans to articulate a course philosophy and focus, which guides all units and lessons. Write school-wide learning outcome statements for teachers to pick from. You can also make activity templates that outline your school’s learning model, for teachers to pick from during the lesson plan designing process. \\n![](https://s3.amazonaws.com/assets.opencurriculum.org/images/home2/lesson-template.png)\\n# Track gaps and opportunities in curriculum alignment and instructional choices.\\nStart tracking standards, planning processes, vocabulary, learning objectives, assessments, and more across course, unit, and lesson plans, and more as soon as teachers start using the tool. OpenCurriculum’s meticulously designed reporting features are accessible through a single click, and take no time to learn or tweak. Put up your analytics dashboard on a big screen in your office and watch the progress on your school’s planning numbers update everyday. \\n![](https://s3.amazonaws.com/assets.opencurriculum.org/images/home2/insights-dashboard.png) ![](https://s3.amazonaws.com/assets.opencurriculum.org/images/home2/insights-coverage-of-standards.png) ![](https://s3.amazonaws.com/assets.opencurriculum.org/images/home2/insights-performance-assessment.png)\\n![](https://s3.amazonaws.com/assets.opencurriculum.org/images/home2/student-performance.jpg)\\n## Dramatically improve student outcomes.\\nOpenCurriculum emphasizes tying every curricular choice and instructional move to intentional pre-established learning goals. The tool has an overall focus on helping teachers and curriculum coordinators think through different student needs, and tie all taught curriculum to planned assessment. This creates better assessment performance and career and college-readiness outcomes for students, school-wide. \\n## Enhance feedback and continuous improvement.\\nOpenCurriculum allows teachers to do normally difficult communication about curricular design with the swiftness of a modern social media app, using likes, instant replies, threads, notifications, and more. This significantly improves communication across your school and brings teachers of different grades and subjects onto the same page. \\n![](https://s3.amazonaws.com/assets.opencurriculum.org/images/home2/feedback.png)\\n![](https://s3.amazonaws.com/assets.opencurriculum.org/images/home2/vetted-curriculum.png)\\n## Tap into high-quality vetted and standards-aligned curriculum.\\nYou can find some of the highest-rated curriculum aligned to popular learning standards inside the tool. Gone are the days when you had to shop around for vendors selling opaque and costly packaged curriculum that did not align with learning standards. Continued use of OpenCurriculum over a year gives you the confidence to begin replacing textbooks. It is packed with instructional ideas for higher-order learning. \\n## A brand new approach to professional development.\\nOpenCurriculum gives continuous professional development a brand new spin. Watching our free curriculum and instructional design videos, along with daily 10-minutes use of OpenCurriculum's planning features, gives teachers more relevant pedagogy improvement ideas than a summer of training. This allows you to have year-long professional development like that of well-funded school systems, at a fraction of the budget. \\n# Always free for teachers and small schools.\\nMost of OpenCurriculum’s curriculum planning features are free for individual teachers and small schools or departments (through the “Team” plan). Beyond that, the pricing for the paid plan is simple, affordable, and transparent. You do not need to speak to a pushy sales stranger on the phone to get started. \\n### Teacher\\n# Team\\n### School\\n### Network\\nPlans\\nTeacher\\nFor individual teachers or curriculum designers.\\nTeam\\nIdeal for small schools, committees, and single departments.\\nSchool\\nIdeal for all schools, colleges, nonprofits, and publishers.\\nNetwork\\nIdeal for all school districts and other clusters of schools, and universities.\\nCost\\nTeacher\\nFREE\\nTeam\\nFREE\\nSchool\\n$5 / user, per month\\nNetwork\\nCustom pricing, based on your needs\\nSign up\\nTeacher\\n[Sign up now](https://opencurriculum.org/<>)\\nTeam\\n[Sign up now](https://opencurriculum.org/<>)\\nSchool\\n[Sign up now](https://opencurriculum.org/<>)\\nNetwork\\nContact us for pricing\\nNumber of users*\\nTeacher\\n1\\nTeam\\nUp to 10 users\\nSchool\\nUp to 200 usersMinimum 10 users\\nNetwork\\nMore than 200 users\\nLesson, unit, and course plan editors\\nTeacher\\n10 course limit\\nTeam\\n50 course limit\\nSchool\\nUnlimited courses\\nNetwork\\nUnlimited courses\\nPlanner\\nTeacher\\nTeam\\nSchool\\nNetwork\\nPopular state and national standards\\nTeacher\\nTeam\\nSchool\\nNetwork\\nLibrary builder\\nTeacher\\nTeam\\nSchool\\nNetwork\\nFiles storage\\nTeacher\\n200 MB\\nTeam\\n1.5 GB total\\nSchool\\n1 GB per user\\nNetwork\\n1 GB per user\\nAccess to open curated resource libraries\\nTeacher\\nTeam\\nSchool\\nNetwork\\nGoogle Drive & Calendar integration\\nTeacher\\nTeam\\nSchool\\nNetwork\\nCustom planning templates\\nTeacher\\nTeam\\nSchool\\nNetwork\\nMaya (virtual mentor)\\nTeacher\\nTeam\\nSchool\\nNetwork\\nTutorial video library\\nTeacher\\nTeam\\nSchool\\nNetwork\\nSchool/network wide course catalog\\nTeacher\\nTeam\\nSchool\\nNetwork\\nRich collaboration features\\nTeacher\\nTeam\\nSchool\\nNetwork\\nCustom standards or outcomes (”Competencies”)\\nTeacher\\nTeam\\nSchool\\nNetwork\\nReporting and analytics (”Insights”)\\nTeacher\\nTeam\\nSchool\\nNetwork\\nSSO Integration\\nTeacher\\nTeam\\nSchool\\nNetwork\\nExisting curriculum importing\\nTeacher\\nTeam\\nSchool\\nNetwork\\nExisting standards importing\\nTeacher\\nTeam\\nSchool\\n$300 / set\\nNetwork\\nDiscounted bulk pricing\\nSupport\\nTeacher\\nGeneral inquiries support\\nTeam\\nGeneral inquiries support\\nSchool\\n3-day business email support\\nNetwork\\nPriority support\\n* A user is anyone who has login access and editing capabilities. This includes curriculum administrators, teachers, department heads, and general school administrators. \\n![](https://s3.amazonaws.com/assets.opencurriculum.org/images/home2/unserved.jpg)\\n## OpenCurriculum is completely free for schools serving the unserved.\\nIs your school in a conflict, disaster, or extreme-poverty affected area? And do you serve students who would otherwise go unserved? If so, all paid features of OpenCurriculum are free forever to your school. We’d be humbled to help if using good curriculum is a priority for you under such circumstances. \\n[Fill out this application if you think you qualify for this program.](https://opencurriculum.org/</teachers>)\\nSelect your role to see the relevant video demos of OpenCurriculum: \\nI am a teacher I am an administrator\\n# We aspire to share the best educational ideas with every teacher in the world.\\nOpenCurriculum is a nonprofit that makes tools that help you create transformative learning experiences for your students, using the best educational ideas. \\n## \\n1\\nWe find the best ideas for you. \\nSo far, you have been burdened with constantly needing to find better ways to make your students succeed. You scour the internet late into the night, seek and attend a lot of professional development, and frequently change how or what you teach. Often, a lot of what you come across is either expensive or is less relevant and hard to grasp and implement. \\nWe find, simplify, and curate contextually-relevant ideas for your day-to-day teaching. These ideas include findings from research and practice on pedagogical strategies, curriculum design, content knowledge, equity, student needs, excellent lesson planning, and meeting standards you intend to align with. \\nWe believe the difference between insufficient education and great educational experiences is a lot of these small ideas in practice. \\n![](https://s3.amazonaws.com/assets.opencurriculum.org/images/home2/about-graphics-1.png)\\nSo you can take a breather.\\n## \\n2\\nWe help you and your colleagues use these ideas with your students. \\nNormally, new educational ideas are shared with complex one-size-fits-all action plans that require you and your colleagues to change your practices entirely. They don’t build around the lives of the students, the philosophy, the culture, and the learning models at your school. \\nWe do things differently. Our simple planning tool puts the power in your hands. It lets you pick bite-sized ideas to place in your curricular plans and assessments. It then helps you link all the plans and ideas together, so you and your school can bring them to life in your instructional practice. \\n![](https://s3.amazonaws.com/assets.opencurriculum.org/images/home2/about-graphics-2.png)\\nSo you can revive your energy.\\n## \\n3\\nWe do high-tech wizardry in the background to make this happen. \\na\\nWe capture, catalog, and vet the most important ideas found in research papers, evidence from classroom practice, publisher and teacher-authored curriculum, and classroom stories. [Learn how](https://opencurriculum.org/<>). \\nb\\nWe use a first-of-its-kind underlying universal language for curriculum, instruction, and assessment, to express these ideas and make them transcend borders. [Learn how](https://opencurriculum.org/<>). \\nc\\nWe surface and sprinkle these ideas on a magic canvas—our free planning tool—that gives you and your team planning superpowers. These superpowers help you recognize gaps, draw connections, and offer the very best learning experiences to all your students. And we build a better understanding of what improving curriculum involves, so we can add features to the tool that help teachers do these steps sooner. [Learn how](https://opencurriculum.org/<>). \\n![](https://s3.amazonaws.com/assets.opencurriculum.org/images/home2/about-graphics-3.png)\\nSo you stay close to everything you love.\\n## Supporters\\nWe are a 501(c)3 nonprofit organization grateful to our families, teachers, and the following funders: \\n![](https://s3.amazonaws.com/assets.opencurriculum.org/images/about/itu.png) ![](https://s3.amazonaws.com/assets.opencurriculum.org/images/about/heinz-college.png) ![](https://s3.amazonaws.com/assets.opencurriculum.org/images/about/acumen.png) ![](https://s3.amazonaws.com/assets.opencurriculum.org/images/about/thrill-mill.png) ![](https://s3.amazonaws.com/assets.opencurriculum.org/images/about/yc.png)\\nIf you are an education funder, please consider reaching out to us so we can add you to this list. \\n## Reach us\\nWe'd love to hear from you about how we can do a better job in supporting you, your school, or your organization, with great curriculum. At this moment, we aren't interested in inserting backlinks to external content, product development outsourcing, and unsolicited sign-ups to your mailing lists. \\nEmail us athello@opencurriculum.org\\nJoin our conversations on social media [](https://opencurriculum.org/<http:/www.facebook.com/OpenCurriculum>) [](https://opencurriculum.org/<http:/www.twitter.com/OpenCurriculum>)\\nOr send us mail at 3740 Cedargate Way Sacramento, CA - 95834 USA\\n[About](https://opencurriculum.org/</about>) · [Privacy policy](https://opencurriculum.org/</privacy>) · [Terms](https://opencurriculum.org/</terms>)\\nStatements that express specific insights or conclusions that you want students to take away at the end of learning something.\\nInteractions that help gauge a student's state of learning, while deepening or extending understanding, during the learning process.\\nA digital tool that helps record, collect, and disseminate learning materials, and show individual students their performance data, e.g. Canvas, Moodle, Blackboard, Google Classroom.\\nPLC = Professional Learning Community. A group of teaching colleagues, sometimes across school lines, that come together to work on specific shared purposes that improve learning.\\nClassrooms where teacher-led instruction is mixed with an adequate amount of digital tool-supported self-driven learning.\\nChanging something about the learning process or materials or what the student needs to be produce, with a goal to make the student succeed.\\nA digital tool that helps record, collect, and disseminate learning materials, and show individual students their performance data, e.g. Canvas, Moodle, Blackboard, Google Classroom.\\nDocuments showing the highlights of coverage of topics or learning targets over a certain period(s) of learning.\\nDocuments showing a sequence of learning events or topics, along with dates they have been scheduled for.\\nThe process of finding the best ways to meet learning goals through curriculum, and often instruction and assessment, with the least amount of gaps.\\nThe conscious or unconscious actions a teacher takes to create learning opportunities for students.\\nOngoing teacher training with a goal of upskilling the teacher consistently over a longer period of time.\\n\" markdown_with_citations=\"![⟨1⟩](https://opencurriculum.org/</>)\\nMenu \\n  * Home⟨2⟩\\n  * Features⟨3⟩\\n    * Features For teachers⟨4⟩\\n    * Features For administrators⟨5⟩\\n  * Video demos⟨6⟩\\n  * Pricing⟨7⟩\\n  * Login⟨3⟩\\n  * Sign up for free⟨3⟩\\n\\n\\n# Plan engaging lessons and units, using the world’s best ideas at your fingertips.\\nOpenCurriculum is a delightful curriculum planning tool that helps you quickly create effective lessons and units, using our library of high-quality ready-to-go ideas and an easy-to-use editor. \\n Get started for free ⟨3⟩\\nAdministrators: Click here to learn how it can help your school⟨5⟩\\n![](https://s3.amazonaws.com/assets.opencurriculum.org/images/home2/hero.png)\\nUsed by teachers in these schools and districts, and more \\n![](https://s3.amazonaws.com/assets.opencurriculum.org/images/home2/KPPCS.jpg) ![](https://s3.amazonaws.com/assets.opencurriculum.org/images/home2/Highline.jpg) ![](https://s3.amazonaws.com/assets.opencurriculum.org/images/home2/DIS.jpg) ![](https://s3.amazonaws.com/assets.opencurriculum.org/images/home2/IPSD.jpg) ![](https://s3.amazonaws.com/assets.opencurriculum.org/images/home2/SFUSD.jpg) ![](https://s3.amazonaws.com/assets.opencurriculum.org/images/home2/AGK.jpg) ![](https://s3.amazonaws.com/assets.opencurriculum.org/images/home2/CPS.jpg)\\n## Discover new ideas that help your students learn faster.\\nYou’ll find hundreds of rigorous and engaging lessons, strategies, activities, enduring understandings, formative assessments, discussion questions, and worksheets written by expert teachers, researchers, and publishers in the tool. Just-in-time reminders offer these ideas when you need them, saving you from hours of research. You can pick and drop whatever you think will work for your students, into your own plans. \\n![](https://s3.amazonaws.com/assets.opencurriculum.org/images/home2/inspirational-units.png) ![](https://s3.amazonaws.com/assets.opencurriculum.org/images/home2/maya-nudge.png) ![](https://s3.amazonaws.com/assets.opencurriculum.org/images/home2/handout.png)\\n![](https://s3.amazonaws.com/assets.opencurriculum.org/images/home2/video-in-lesson.png) ![](https://s3.amazonaws.com/assets.opencurriculum.org/images/home2/assessments-embedded.png) ![](https://s3.amazonaws.com/assets.opencurriculum.org/images/home2/spanish-embedded-book.png)\\n## Add assessments, links, books, videos, and oh so much more!\\nIt’s just like Google Docs, but with more support and structure for expressing what and how you want to teach. It gives you creative ways to express your curriculum and instructional design ideas, without forcing you into fill-in-the-box templates. Drop the assessments, links, books, videos, images, etc. from the tool onto your learning management system for students to get in on the fun. \\n## Share, find, and co-plan with your colleagues.\\nOpenCurriculum has so many ways for you to share plans with your colleagues and supervisors. Use Google Docs-style permissions to pick exactly who can see and edit your plans, while allowing permissions to trickle down in sub-plans. Share with entire departments or PLCs in one shot, using the “Groups” feature. With the “Libraries” feature, you can catalog, track, and archive materials inside folders and easily filter based on tags. Just like Gmail search, OpenCurriculum’s instant search lets you find things across your school and beyond quickly. \\n![](https://s3.amazonaws.com/assets.opencurriculum.org/images/home2/sharing.png) ![](https://s3.amazonaws.com/assets.opencurriculum.org/images/home2/instant-search.png) ![](https://s3.amazonaws.com/assets.opencurriculum.org/images/home2/library.png)\\n# Track your long-term and short-term plans visually.\\nSee your courses, units, and lessons laid out visually to see where you are now and where you are going. Switch between planner and calendar views to visualize your week, overlaid by your Google calendar schedule. Hide courses and units and preview full plans to instantly see the big picture and teeny tiny details all together. \\n  * ##### Planner view\\nSee the contents of your lessons and units on top of one another on a weekly planning page.\\n  * ##### Calendar view\\nSee the contents of your lessons and units on at the times of day on a weekly planning page.\\n  * ##### Semester or academic term view\\nSee your and your colleagues’ lesson and units laid out over your academic session.\\n\\n\\n![](https://s3.amazonaws.com/assets.opencurriculum.org/images/home2/planner-week.png) ![](https://s3.amazonaws.com/assets.opencurriculum.org/images/home2/planner-calendar.png) ![](https://s3.amazonaws.com/assets.opencurriculum.org/images/home2/planner-semester.png)\\n## Lesson and unit planning is for everyone!\\nWhether you are planning for in-person learning, hybrid classrooms, or remote learning, planning can give you the clarity you need to help your students succeed, without becoming mundane. No matter how many years you have taught for, lesson and unit planning pushes your practice forward. \\nLearn more about how OpenCurriculum can help you plan better⟨4⟩\\n# Make rigorous learning experiences that are highly enjoyable!\\nOpenCurriculum helps you shape transformative classroom moments. It nudges you towards student-first planning by helping you to adapt curriculum to what students are excited about right now. The outcome is lessons and units that lead to discovery, depth of understanding, and the good kind of rigor. These help you replace uninteresting textbook exercises and boost your students’ learning everyday. \\n## Align your plans with standards and goals, starting with the end first.\\nOpenCurriculum takes the stress out of aligning your plans to standards or other learning goals. You can use an easy-to-use standards picker to choose from national or state standards, or learning targets made at your school. Or even pick unit standards from course plans, or lesson standards from unit plans. This keeps all your plans coherent, and never lets your curriculum go out of whack. You can even customize templates to design with the end in mind, in a breeze. \\n![](https://s3.amazonaws.com/assets.opencurriculum.org/images/home2/add-competencies.png)\\n![](https://s3.amazonaws.com/assets.opencurriculum.org/images/home2/differentiation.png)\\n## Differentiate for specific student needs, without much effort.\\nIt’s just like Google Docs, but with more support and structure for expressing what and how you want to teach. It gives you creative ways to express your curriculum and instructional design ideas, without forcing you into fill-in-the-box templates. Drop the assessments, links, books, videos, images, etc. from the tool onto your learning management system for students to get in on the fun. \\n# Instantly see an overview of your syllabus.\\nSeeing the overall picture of a course’s units and a unit’s lessons in one glance is invaluable. OpenCurriculum automagically creates scopes & sequences to show you the most important highlights of units, and pacing guides for already scheduled courses and units, which show you similar information, but on a calendar timeline. You can then pick & choose which sections from each plan show up on the highlights pages. \\n![](https://s3.amazonaws.com/assets.opencurriculum.org/images/home2/syllabus.png)\\n## Always feel supported and guided.\\nOpenCurriculum takes the loneliness out of the planning process. It offers suggestions, explanations, reminders, and starting points like activity names and handout templates to make every step feel collaborative and supportive. \\n![](https://s3.amazonaws.com/assets.opencurriculum.org/images/home2/add-activity.png) ![](https://s3.amazonaws.com/assets.opencurriculum.org/images/home2/maya-pck.png) ![](https://s3.amazonaws.com/assets.opencurriculum.org/images/home2/unit-template.png)\\n## The #1 platform for curriculum and instruction leadership.\\nOpenCurriculum gives curriculum and instruction leaders the tools to implement change that leads to long-lasting improvement in school-wide curriculum mapping and instructional practices. \\n## Turn your school philosophy and model into instructional practice.\\nStart with a mission and school philosophy and allow the tool to help you embed it across all steps of the curriculum design process. Use custom templates with tips to guide teachers to respond to specific prompts. Use course plans to articulate a course philosophy and focus, which guides all units and lessons. Write school-wide learning outcome statements for teachers to pick from. You can also make activity templates that outline your school’s learning model, for teachers to pick from during the lesson plan designing process. \\n![](https://s3.amazonaws.com/assets.opencurriculum.org/images/home2/lesson-template.png)\\n# Track gaps and opportunities in curriculum alignment and instructional choices.\\nStart tracking standards, planning processes, vocabulary, learning objectives, assessments, and more across course, unit, and lesson plans, and more as soon as teachers start using the tool. OpenCurriculum’s meticulously designed reporting features are accessible through a single click, and take no time to learn or tweak. Put up your analytics dashboard on a big screen in your office and watch the progress on your school’s planning numbers update everyday. \\n![](https://s3.amazonaws.com/assets.opencurriculum.org/images/home2/insights-dashboard.png) ![](https://s3.amazonaws.com/assets.opencurriculum.org/images/home2/insights-coverage-of-standards.png) ![](https://s3.amazonaws.com/assets.opencurriculum.org/images/home2/insights-performance-assessment.png)\\n![](https://s3.amazonaws.com/assets.opencurriculum.org/images/home2/student-performance.jpg)\\n## Dramatically improve student outcomes.\\nOpenCurriculum emphasizes tying every curricular choice and instructional move to intentional pre-established learning goals. The tool has an overall focus on helping teachers and curriculum coordinators think through different student needs, and tie all taught curriculum to planned assessment. This creates better assessment performance and career and college-readiness outcomes for students, school-wide. \\n## Enhance feedback and continuous improvement.\\nOpenCurriculum allows teachers to do normally difficult communication about curricular design with the swiftness of a modern social media app, using likes, instant replies, threads, notifications, and more. This significantly improves communication across your school and brings teachers of different grades and subjects onto the same page. \\n![](https://s3.amazonaws.com/assets.opencurriculum.org/images/home2/feedback.png)\\n![](https://s3.amazonaws.com/assets.opencurriculum.org/images/home2/vetted-curriculum.png)\\n## Tap into high-quality vetted and standards-aligned curriculum.\\nYou can find some of the highest-rated curriculum aligned to popular learning standards inside the tool. Gone are the days when you had to shop around for vendors selling opaque and costly packaged curriculum that did not align with learning standards. Continued use of OpenCurriculum over a year gives you the confidence to begin replacing textbooks. It is packed with instructional ideas for higher-order learning. \\n## A brand new approach to professional development.\\nOpenCurriculum gives continuous professional development a brand new spin. Watching our free curriculum and instructional design videos, along with daily 10-minutes use of OpenCurriculum's planning features, gives teachers more relevant pedagogy improvement ideas than a summer of training. This allows you to have year-long professional development like that of well-funded school systems, at a fraction of the budget. \\n# Always free for teachers and small schools.\\nMost of OpenCurriculum’s curriculum planning features are free for individual teachers and small schools or departments (through the “Team” plan). Beyond that, the pricing for the paid plan is simple, affordable, and transparent. You do not need to speak to a pushy sales stranger on the phone to get started. \\n### Teacher\\n# Team\\n### School\\n### Network\\nPlans\\nTeacher\\nFor individual teachers or curriculum designers.\\nTeam\\nIdeal for small schools, committees, and single departments.\\nSchool\\nIdeal for all schools, colleges, nonprofits, and publishers.\\nNetwork\\nIdeal for all school districts and other clusters of schools, and universities.\\nCost\\nTeacher\\nFREE\\nTeam\\nFREE\\nSchool\\n$5 / user, per month\\nNetwork\\nCustom pricing, based on your needs\\nSign up\\nTeacher\\nSign up now⟨3⟩\\nTeam\\nSign up now⟨3⟩\\nSchool\\nSign up now⟨3⟩\\nNetwork\\nContact us for pricing\\nNumber of users*\\nTeacher\\n1\\nTeam\\nUp to 10 users\\nSchool\\nUp to 200 usersMinimum 10 users\\nNetwork\\nMore than 200 users\\nLesson, unit, and course plan editors\\nTeacher\\n10 course limit\\nTeam\\n50 course limit\\nSchool\\nUnlimited courses\\nNetwork\\nUnlimited courses\\nPlanner\\nTeacher\\nTeam\\nSchool\\nNetwork\\nPopular state and national standards\\nTeacher\\nTeam\\nSchool\\nNetwork\\nLibrary builder\\nTeacher\\nTeam\\nSchool\\nNetwork\\nFiles storage\\nTeacher\\n200 MB\\nTeam\\n1.5 GB total\\nSchool\\n1 GB per user\\nNetwork\\n1 GB per user\\nAccess to open curated resource libraries\\nTeacher\\nTeam\\nSchool\\nNetwork\\nGoogle Drive & Calendar integration\\nTeacher\\nTeam\\nSchool\\nNetwork\\nCustom planning templates\\nTeacher\\nTeam\\nSchool\\nNetwork\\nMaya (virtual mentor)\\nTeacher\\nTeam\\nSchool\\nNetwork\\nTutorial video library\\nTeacher\\nTeam\\nSchool\\nNetwork\\nSchool/network wide course catalog\\nTeacher\\nTeam\\nSchool\\nNetwork\\nRich collaboration features\\nTeacher\\nTeam\\nSchool\\nNetwork\\nCustom standards or outcomes (”Competencies”)\\nTeacher\\nTeam\\nSchool\\nNetwork\\nReporting and analytics (”Insights”)\\nTeacher\\nTeam\\nSchool\\nNetwork\\nSSO Integration\\nTeacher\\nTeam\\nSchool\\nNetwork\\nExisting curriculum importing\\nTeacher\\nTeam\\nSchool\\nNetwork\\nExisting standards importing\\nTeacher\\nTeam\\nSchool\\n$300 / set\\nNetwork\\nDiscounted bulk pricing\\nSupport\\nTeacher\\nGeneral inquiries support\\nTeam\\nGeneral inquiries support\\nSchool\\n3-day business email support\\nNetwork\\nPriority support\\n* A user is anyone who has login access and editing capabilities. This includes curriculum administrators, teachers, department heads, and general school administrators. \\n![](https://s3.amazonaws.com/assets.opencurriculum.org/images/home2/unserved.jpg)\\n## OpenCurriculum is completely free for schools serving the unserved.\\nIs your school in a conflict, disaster, or extreme-poverty affected area? And do you serve students who would otherwise go unserved? If so, all paid features of OpenCurriculum are free forever to your school. We’d be humbled to help if using good curriculum is a priority for you under such circumstances. \\nFill out this application if you think you qualify for this program.⟨4⟩\\nSelect your role to see the relevant video demos of OpenCurriculum: \\nI am a teacher I am an administrator\\n# We aspire to share the best educational ideas with every teacher in the world.\\nOpenCurriculum is a nonprofit that makes tools that help you create transformative learning experiences for your students, using the best educational ideas. \\n## \\n1\\nWe find the best ideas for you. \\nSo far, you have been burdened with constantly needing to find better ways to make your students succeed. You scour the internet late into the night, seek and attend a lot of professional development, and frequently change how or what you teach. Often, a lot of what you come across is either expensive or is less relevant and hard to grasp and implement. \\nWe find, simplify, and curate contextually-relevant ideas for your day-to-day teaching. These ideas include findings from research and practice on pedagogical strategies, curriculum design, content knowledge, equity, student needs, excellent lesson planning, and meeting standards you intend to align with. \\nWe believe the difference between insufficient education and great educational experiences is a lot of these small ideas in practice. \\n![](https://s3.amazonaws.com/assets.opencurriculum.org/images/home2/about-graphics-1.png)\\nSo you can take a breather.\\n## \\n2\\nWe help you and your colleagues use these ideas with your students. \\nNormally, new educational ideas are shared with complex one-size-fits-all action plans that require you and your colleagues to change your practices entirely. They don’t build around the lives of the students, the philosophy, the culture, and the learning models at your school. \\nWe do things differently. Our simple planning tool puts the power in your hands. It lets you pick bite-sized ideas to place in your curricular plans and assessments. It then helps you link all the plans and ideas together, so you and your school can bring them to life in your instructional practice. \\n![](https://s3.amazonaws.com/assets.opencurriculum.org/images/home2/about-graphics-2.png)\\nSo you can revive your energy.\\n## \\n3\\nWe do high-tech wizardry in the background to make this happen. \\na\\nWe capture, catalog, and vet the most important ideas found in research papers, evidence from classroom practice, publisher and teacher-authored curriculum, and classroom stories. Learn how⟨3⟩. \\nb\\nWe use a first-of-its-kind underlying universal language for curriculum, instruction, and assessment, to express these ideas and make them transcend borders. Learn how⟨3⟩. \\nc\\nWe surface and sprinkle these ideas on a magic canvas—our free planning tool—that gives you and your team planning superpowers. These superpowers help you recognize gaps, draw connections, and offer the very best learning experiences to all your students. And we build a better understanding of what improving curriculum involves, so we can add features to the tool that help teachers do these steps sooner. Learn how⟨3⟩. \\n![](https://s3.amazonaws.com/assets.opencurriculum.org/images/home2/about-graphics-3.png)\\nSo you stay close to everything you love.\\n## Supporters\\nWe are a 501(c)3 nonprofit organization grateful to our families, teachers, and the following funders: \\n![](https://s3.amazonaws.com/assets.opencurriculum.org/images/about/itu.png) ![](https://s3.amazonaws.com/assets.opencurriculum.org/images/about/heinz-college.png) ![](https://s3.amazonaws.com/assets.opencurriculum.org/images/about/acumen.png) ![](https://s3.amazonaws.com/assets.opencurriculum.org/images/about/thrill-mill.png) ![](https://s3.amazonaws.com/assets.opencurriculum.org/images/about/yc.png)\\nIf you are an education funder, please consider reaching out to us so we can add you to this list. \\n## Reach us\\nWe'd love to hear from you about how we can do a better job in supporting you, your school, or your organization, with great curriculum. At this moment, we aren't interested in inserting backlinks to external content, product development outsourcing, and unsolicited sign-ups to your mailing lists. \\nEmail us athello@opencurriculum.org\\nJoin our conversations on social media [](https://opencurriculum.org/<http:/www.facebook.com/OpenCurriculum>) [](https://opencurriculum.org/<http:/www.twitter.com/OpenCurriculum>)\\nOr send us mail at 3740 Cedargate Way Sacramento, CA - 95834 USA\\nAbout⟨8⟩ · Privacy policy⟨9⟩ · Terms⟨10⟩\\nStatements that express specific insights or conclusions that you want students to take away at the end of learning something.\\nInteractions that help gauge a student's state of learning, while deepening or extending understanding, during the learning process.\\nA digital tool that helps record, collect, and disseminate learning materials, and show individual students their performance data, e.g. Canvas, Moodle, Blackboard, Google Classroom.\\nPLC = Professional Learning Community. A group of teaching colleagues, sometimes across school lines, that come together to work on specific shared purposes that improve learning.\\nClassrooms where teacher-led instruction is mixed with an adequate amount of digital tool-supported self-driven learning.\\nChanging something about the learning process or materials or what the student needs to be produce, with a goal to make the student succeed.\\nA digital tool that helps record, collect, and disseminate learning materials, and show individual students their performance data, e.g. Canvas, Moodle, Blackboard, Google Classroom.\\nDocuments showing the highlights of coverage of topics or learning targets over a certain period(s) of learning.\\nDocuments showing a sequence of learning events or topics, along with dates they have been scheduled for.\\nThe process of finding the best ways to meet learning goals through curriculum, and often instruction and assessment, with the least amount of gaps.\\nThe conscious or unconscious actions a teacher takes to create learning opportunities for students.\\nOngoing teacher training with a goal of upskilling the teacher consistently over a longer period of time.\\n\" references_markdown='\\n\\n## References\\n\\n⟨1⟩ https://s3.amazonaws.com/assets.opencurriculum.org/images/public/2017-logo-m.png: ![\\n⟨2⟩ https://opencurriculum.org/</>: Home\\n⟨3⟩ https://opencurriculum.org/<>: Features\\n⟨4⟩ https://opencurriculum.org/</teachers>: Features For teachers\\n⟨5⟩ https://opencurriculum.org/</administrators>: Features For administrators\\n⟨6⟩ https://opencurriculum.org/</demos>: Video demos\\n⟨7⟩ https://opencurriculum.org/</pricing>: Pricing\\n⟨8⟩ https://opencurriculum.org/</about>: About\\n⟨9⟩ https://opencurriculum.org/</privacy>: Privacy policy\\n⟨10⟩ https://opencurriculum.org/</terms>: Terms\\n' fit_markdown='' fit_html=''",
  "generated_description": "**OpenCurriculum: Revolutionizing K-12 Education**\n\nOpenCurriculum is a California-based nonprofit that aims to innovate and democratize K-12 education. Founded in 2011 and a proud member of Y Combinator's Batch W14, it has its roots in community-curated teaching resources meant to be freely accessible worldwide. The mission? Helping teachers and school administrators create engaging, effective education experiences. Their slogan encapsulates this ethos—“Come collaborate; we can teach better together.” \n\n### What They Offer\n\nOpenCurriculum serves as a comprehensive curriculum planning tool that provides a vast library of high-quality, ready-to-use ideas for lesson and unit planning. It’s like having a collaborative workspace tailored for educators, where they can pull together diverse resources effortlessly. Imagine a space that doesn’t just template-ize your creativity but enhances it! \n\nWith an intuitive editor, educators can quickly gather assessments, links, multimedia, and more, into coherent lesson plans. They also facilitate collaboration among colleagues, allowing teachers to share, edit, and track plans with Google Docs-style permissions, ensuring that everyone stays aligned and engaged.\n\n### Key Features\n\n1. **Engaging Content**: Discover a wealth of lessons, assessments, and instructional strategies crafted by experts. The platform curates the best ideas to save teachers hours of research.\n\n2. **Visual Planning Tools**: Plan your curriculum with easy-to-navigate views—whether you prefer a weekly planner or a calendar format. Track your progress and visual layout at a glance.\n\n3. **Standard Alignment**: Align your curriculum with national or state standards seamlessly using an easy-to-navigate standards picker. The platform is designed to keep your educational goals coherent and connected.\n\n4. **Professional Development**: OpenCurriculum isn’t just a tool; it's a resource for continuous professional growth. With free training materials and instructional videos, it equips educators with practical, relevant pedagogical strategies.\n\n5. **Unmatched Accessibility**: The core features of OpenCurriculum are free for individual teachers and small school departments. They also have provisions to serve schools in crisis—making all paid features available to those who need it most, at no cost.\n\n### Why It Matters\n\nEducation needs transformation, and OpenCurriculum is committed to addressing the gaps in traditional educational tools. By making high-quality educational resources accessible and easy to use, they empower educators to elevate student outcomes. And in a world where educational equity is often a dream rather than a reality, OpenCurriculum stands as a beacon of hope, bringing together innovation, collaboration, and passion for teaching to the fore.\n\nIf you’re part of the educational landscape in K-12, whether as a teacher or administrator, exploring OpenCurriculum is well worth your time. They aspire to share the best educational ideas with every teacher globally, and they’re well on their way to making that aspiration a reality.\n\nFor more information, visit their website at [OpenCurriculum.org](https://opencurriculum.org)."
}