{
  "links": "https://www.ycombinator.com/companies/our-world-in-data",
  "name": "Our World in Data",
  "headline": "Research and data to make progress against the worldâs largestâ¦",
  "batch": "W19",
  "description": "Poverty, disease, hunger, climate change, war, existential risks, and inequality: The world faces many great and terrifying problems. It is these large problems that our work at Our World in Data focuses on.\r\n\nOur World in Data publishes an open-access publication where users can understand the state of the world today, where we are making progress and where we are falling behind. Through interactive data visualizations we can see how the world has changed; by summarizing the scientific literature we can understand why. We cover everything from global poverty to natural disasters, education and health; we have 3405 charts across 297 topics.\r\n\nOur World in Data is free, open-source and provided as a public good. It has millions of users every month, and is cited in research and media across the world every day. This allows millions of people to understand the large problems the world is facing, and how we can solve them.",
  "activity_status": "Active",
  "website": "https://ourworldindata.org/",
  "founded_date": 2013.0,
  "team_size": 19.0,
  "location": "Oxford, United Kingdom",
  "group_partner": null,
  "group_partner_yc": null,
  "company_linkedin": null,
  "company_twitter": null,
  "tags": "industry:nonprofit",
  "founders": [],
  "status": true,
  "markdown": "raw_markdown='[Our World in Data](https://ourworldindata.org/</>)\\n[![Oxford Martin School logo](https://ourworldindata.org/oms-logo.svg)](https://ourworldindata.org/<https:/www.oxfordmartin.ox.ac.uk/global-development>)[![Oxford logo](https://ourworldindata.org/oxford-logo.svg)](https://ourworldindata.org/<https:/www.ox.ac.uk/>)[![Global Change Data Lab logo](https://ourworldindata.org/gcdl-logo.svg)](https://ourworldindata.org/<https:/global-change-data-lab.org/>)\\n  * Browse by topic\\n  * [Data](https://ourworldindata.org/</data>)\\n  * [Insights](https://ourworldindata.org/</data-insights>)\\n  * Resources\\n  * About\\n\\n\\nSubscribe\\n[Donate](https://ourworldindata.org/</donate>)\\n[Gdoc](https://ourworldindata.org/<#>)/[Admin](https://ourworldindata.org/<#>)\\nPopular pages\\n  * [CO₂ Emissions](https://ourworldindata.org/<https:/ourworldindata.org/co2-and-greenhouse-gas-emissions>)\\n  * [Economic Inequality](https://ourworldindata.org/<https:/ourworldindata.org/economic-inequality>)\\n  * [Human Rights](https://ourworldindata.org/<https:/ourworldindata.org/human-rights>)\\n  * [Poverty](https://ourworldindata.org/<https:/ourworldindata.org/poverty>)\\n  * [Energy](https://ourworldindata.org/<https:/ourworldindata.org/energy>)\\n  * [Life Expectancy](https://ourworldindata.org/<https:/ourworldindata.org/life-expectancy>)\\n  * [Causes of Death](https://ourworldindata.org/<https:/ourworldindata.org/causes-of-death>)\\n  * [Population Growth](https://ourworldindata.org/<https:/ourworldindata.org/population-growth>)\\n  * [COVID-19](https://ourworldindata.org/<https:/ourworldindata.org/coronavirus>)\\n\\n\\n## Research and data to make progress against the world’s largest problems.\\n[13,176 charts](https://ourworldindata.org/</data>) across [120 topics](https://ourworldindata.org/<#all-topics>)All free: open access and open source\\n## Our Mission\\nWhat do we need to know to make the world a better place?\\nTo make progress against the pressing problems the world faces, we need to be informed by the best research and data.\\nOur World in Data makes this knowledge accessible and understandable, to empower those working to build a better world.\\n[Read about our mission ](https://ourworldindata.org/</problems-and-progress>)[Subscribe to our newsletters ](https://ourworldindata.org/<#subscribe>)\\n**We are a non-profit — all our work is free to use and open source.** Consider supporting us if you find our work valuable.\\n[Donate to support us ](https://ourworldindata.org/</donate>)\\nAs seen on\\n![Logos of the publications that have used our content. From left to right: Science, Nature, PNAS, BBC, Financial Times, The New York Times, The Guardian, The Atlantic, and The Washington Post](https://ourworldindata.org/media-logos.svg)\\n## Featured work\\n[![Featured image](https://ourworldindata.org/cdn-cgi/imagedelivery/qLq-8BTgXU8yG0N6HnOy8g/2634177d-6b60-4df5-3152-c38263399f00/w=2400)NewArticle · 14 min readIn many countries, people breathe the cleanest air in centuries. What can the rest of the world learn from this?Air pollution tends to get worse before it gets better, but how can we accelerate this transition?Hannah Ritchie](https://ourworldindata.org/<https:/ourworldindata.org/cleanest-air-lessons>)\\n[![](https://ourworldindata.org/cdn-cgi/imagedelivery/qLq-8BTgXU8yG0N6HnOy8g/4856b7da-8b2a-4218-7a2f-e18304c85200/w=1200)From our classicsFood production is responsible for one-quarter of the world’s greenhouse gas emissionsOne-quarter of the world\\'s greenhouse gas emissions result from food and agriculture. What are the main contributors to food\\'s emissions?Hannah Ritchie](https://ourworldindata.org/<https:/ourworldindata.org/food-ghg-emissions>)[![Featured image](https://ourworldindata.org/cdn-cgi/imagedelivery/qLq-8BTgXU8yG0N6HnOy8g/1a2ccaa1-7f25-4250-6151-acd5affb0400/w=2400)Article · 4 min readIf we can make maternal deaths as rare as in the healthiest countries, we can save 275,000 mothers each yearMaternal mortality was much more common in the past. It is much lower today, but global inequalities are still large.Hannah Ritchie](https://ourworldindata.org/<https:/ourworldindata.org/maternal-deaths-save-mothers>)\\n[![A photo of Max Roser and others marching through town as part of the ceremony for receiving an honorary doctorate from KU Leuven and UCLouvain in Belgium. The photo is copyright KU Leuven - Rob Stevens.](https://ourworldindata.org/cdn-cgi/imagedelivery/qLq-8BTgXU8yG0N6HnOy8g/679eea1d-ea22-4824-cccd-6b2044447a00/w=4800)AnnouncementOur founder, Max Roser, has received two prestigious honorsAn honorary doctorate from KU Leuven & UCLouvain and a “Dove of Peace” in Germany.Angela Wenham and Charlie Giattino](https://ourworldindata.org/<https:/ourworldindata.org/max-roser-received-two-prestigious-honors>)[![A rectangular table with two rows and five columns. The first row contains colored blocks, starting from the left with a deep purple block, followed by a light purple, a pale lavender, and two shades of peach. The second row mirrors the first, repeating the same arrangement of colors.](https://ourworldindata.org/cdn-cgi/imagedelivery/qLq-8BTgXU8yG0N6HnOy8g/58092c37-e5b8-42af-8d79-60234c162400/w=2400)Article · 10 min readHow much in subsidies do fossil fuels receive?Estimates range from less than $1 trillion to $7 trillion. Where do these numbers come from?Hannah Ritchie](https://ourworldindata.org/<https:/ourworldindata.org/how-much-subsidies-fossil-fuels>)\\n[See all our latest work ](https://ourworldindata.org/</latest>)\\n[See all our latest work ](https://ourworldindata.org/</latest>)\\n## Daily Data Insights\\nBite-sized insights on how the world is changing, published every weekday.\\n[See all Daily Data Insights ](https://ourworldindata.org/</data-insights>)\\n[![A global map shows the share of mothers aged 20–44 who have lost a child under five years old. The data is categorized into four ranges: less than 1% \\\\(light yellow\\\\), 1% to 5% \\\\(yellow\\\\), 5% to 10% \\\\(orange\\\\), 10% to 30% \\\\(dark orange\\\\), and more than 30% \\\\(red\\\\). Higher rates are concentrated in Sub-Saharan Africa and parts of South Asia, while lower rates are seen in North America, Europe, and parts of East Asia. Data is sourced from Smith-Greenaway et al. \\\\(2021\\\\) and reflects single-year estimates between 2010 and 2018.](https://ourworldindata.org/cdn-cgi/imagedelivery/qLq-8BTgXU8yG0N6HnOy8g/35ea298e-048f-4c7e-3b97-717282c36f00/w=1620)TodayIn some countries, more than one in three mothers have lost a child younger than fiveThere are few experiences, if any, that are more painful for a parent than losing a child.In the past, child deaths were much more common than they are today. But even when these deaths were not unusual, historical diary entries show us that most parents still found them heartbreaking.Unfortunately, in many countries today, a large share of parents still experience the loss of a child. The map here shows the share of mothers who lost a child before they reached the age of five.In most of Europe and North America, this share is less than 1%. But in some of the world’s poorest countries — like Cameroon, Nigeria, and the Central African Republic — more than one in three mothers have experienced this tragedy.These figures come from a research article by Emily Smith-Greenaway and colleagues, based on reported or estimated data from 2010 to 2018 for mothers aged 20 to 44.Read my colleague Max Roser’s article for more historical context around this data →Continue reading ](https://ourworldindata.org/</data-insights#most-recent-data-insight>)[![The image presents a data visualization illustrating the number of animals killed for meat worldwide from 1961 to 2022. It is divided into four sections, each representing a different animal species:\\n1. **Chickens**: Shown in orange, the graph starts at zero in 1961 and rises sharply, reaching approximately 60 billion killed by 2022.\\n \\n2. **Pigs**: Displayed in green, this chart shows a more gradual increase, starting from zero in 1961 and peaking at around 1 billion killed by 2022.\\n3. **Sheep and Goats**: Presented in blue, this line shows a steady rise from zero in 1961 to nearly 400 million by 2022, with a peak near 1 billion.\\n4. **Cows**: Illustrated in dark green, this graph shows a slow but consistent increase from zero to about 300 million killed by 2022.\\nEach section has a label indicating the species and the number of animals on the vertical axis, while the horizontal axis marks the years from 1961 to 2022. The bottom of the image references the data source as the Food and Agriculture Organization of the UN from 2023, with a CC BY attribution.](https://ourworldindata.org/cdn-cgi/imagedelivery/qLq-8BTgXU8yG0N6HnOy8g/b1a51929-5a19-40d6-5795-6770a75ca400/w=1620)YesterdayMore land animals than ever before are slaughtered for meatGlobal livestock numbers — tracked by the UN Food and Agriculture Organization since 1961 — have surged, with particularly large increases in the number of chickens, pigs, sheep, goats, and cows.For many land animals, life is short and painful. Recent estimates indicate that globally, most animals are raised on factory farms. In the US, where better data and research are available, 99% of livestock is factory-farmed.Explore many more interactive charts and articles on animal welfare →Continue reading ](https://ourworldindata.org/</data-insights#second-most-recent-data-insight>)[![A bar chart titled \"Global sales of combustion engine cars have peaked,\" showing annual car sales from 2010 to 2023. The chart highlights that combustion engine car sales peaked in 2017/18 and have declined since, while electric car sales \\\\(in orange\\\\) have steadily risen. Total car sales hover around 70–80 million annually, with electric cars making a growing share of the market from 2018 onward. Data source: International Energy Agency, Global EV Outlook 2024. Note: Electric cars include fully battery-electric and plug-in hybrids.](https://ourworldindata.org/cdn-cgi/imagedelivery/qLq-8BTgXU8yG0N6HnOy8g/cec7f9e1-f521-427f-b314-07d03ed0c900/w=1620)February 17Global sales of combustion engine cars have peakedTo decarbonize road transport, the world must move away from petrol and diesel cars and towards electric vehicles and other forms of low-carbon transport.This transition has already started. In fact, global sales of combustion engine cars are well past the peak and are now falling.As you can see in the chart, global sales peaked in 2018. This is calculated based on data from the International Energy Agency. Bloomberg New Energy Finance estimates this peak occurred one year earlier, in 2017.Sales of electric cars, on the other hand, are growing quickly.Explore more data on electric car sales across the world →Continue reading ](https://ourworldindata.org/</data-insights#third-most-recent-data-insight>)[![A data visualization titled \"Nine Asian countries where child mortality has halved since 2000.\" The chart shows the estimated percentage of newborns dying before age five in nine countries: Afghanistan \\\\(13% in 2000 to 6% in 2022\\\\), Cambodia \\\\(11% to 2%\\\\), Laos \\\\(11% to 4%\\\\), Bangladesh \\\\(9% to 3%\\\\), Myanmar \\\\(9% to 4%\\\\), India \\\\(9% to 3%\\\\), Nepal \\\\(8% to 3%\\\\), Indonesia \\\\(5% to 2%\\\\), and China \\\\(4% to 1%\\\\). Each country is represented by a line graph showing a significant decline in child mortality over time. Data source: UN Inter-agency Group for Child Mortality Estimation \\\\(2024\\\\), CC BY.](https://ourworldindata.org/cdn-cgi/imagedelivery/qLq-8BTgXU8yG0N6HnOy8g/57dcc03f-4cff-498a-67d0-3d0d82101600/w=1620)February 14In these nine Asian countries, child mortality has more than halved since the year 2000Child mortality in Asia has fallen sharply. The chart shows nine countries that have reduced child mortality rates by more than half since 2000. This means millions more children surviving through the crucial early years of life.In India, for example, child mortality fell from 9% to 3%. China saw a similar decrease from 4% to just 1%. Key reasons for these gains include improved nutrition, clean water, sanitation, vaccinations, and poverty reduction.However, even with these improvements, rates of 1–6% still reflect hundreds of thousands of young lives lost each year in these countries.This is a story of remarkable progress — but one that’s not yet finished.Explore child mortality data for more countries →Continue reading ](https://ourworldindata.org/</data-insights#fourth-most-recent-data-insight>)[![An infographic titled \"Most livestock in the United States are factory-farmed.\" It lists the percentages and numbers of animals raised in factory farms, defined by the EPA as operations with intensive feeding for over 45 days. Chickens: 99.96%, 9.2 billion; Turkeys: 99.8%, 260 million; Farmed fish: 100%, 530 million; Cows: 75%, 66 million; Egg-laying hens: 98.3%, 380 million; Pigs: 98.6%, 73 million. Data source: Sentience Institute \\\\(2024\\\\), with data from 2022.](https://ourworldindata.org/cdn-cgi/imagedelivery/qLq-8BTgXU8yG0N6HnOy8g/210e8bd4-d29f-4512-59ba-851758cdb500/w=1620)February 13Almost all livestock in the United States is factory-farmedIt’s difficult to quantify animal suffering in a single number, but one metric often used to measure living conditions is the number of animals raised on “factory farms”.Factory farms are defined as “concentrated animal feeding operations” where many animals are held in an intensive feeding operation for more than 45 days.99% of livestock in the United States is factory-farmed. This latest estimate comes from the Sentience Institute and is based on definitions and data from the US Environment Protection Agency.The chart shows the share of different forms of livestock that are factory-farmed. More than 98% of chickens, turkeys, hens, pigs, and farmed fish are factory-farmed. Cows are a bit less likely to be factory-farmed, but three-quarters still spend much of their lives in these conditions.Read more about factory farming, including estimates of how much livestock globally is factory-farmed →Continue reading ](https://ourworldindata.org/</data-insights#fifth-most-recent-data-insight>)[![A line graph depicting the most common birth month in France from 1861 to 2022, with the horizontal axis representing months from January to December and the vertical axis indicating years. Each year shows a line indicating the month with the highest average birth rate per day, with varying colors representing different time periods. \\nIn the late 19th and early 20th centuries, lines often cluster around spring months, indicating this as the most common season for births. Disruptions during World Wars I and II are noted, as birth rates shifted temporarily. Since the late 20th century, the trend has changed, with late summer and autumn months becoming the most common for births.\\nThe data source is the Human Mortality Database \\\\(2024\\\\) and the chart is published on OurWorldinData.org, and is licensed under CC-BY by the authors, Saloni Dattani and Lucas Rodés-Guirao.](https://ourworldindata.org/cdn-cgi/imagedelivery/qLq-8BTgXU8yG0N6HnOy8g/ca552284-d32e-481b-d8b3-d5423210ae00/w=1620)February 12Spring no more: France’s shift in birth patternsWhat’s the most common season for babies to be born?In many European countries, it’s late summer or autumn. Births are 5% to 10% more common in these months than others.But this seasonal pattern used to be different. The chart shows the most common month for births each year. We’ve focused on France, which has data since the 1860s.As you can see, spring was the most common season for births then. The pattern was temporarily disrupted during the two World Wars but continued until the late 20th century. Then, births shifted to later in the year, with late summer and autumn becoming more popular.This shift also occurred in many other European countries and North America.Explore the most common birth month around the world →Continue reading ](https://ourworldindata.org/</data-insights#sixth-most-recent-data-insight>)[![A line graph titled \"Foreign aid given as a share of national income, DAC Countries\" illustrates the trend of official development assistance \\\\(ODA\\\\) as a percentage of gross national income from 1960 to 2023. The vertical axis represents the percentage of national income, ranging from 0% to 0.5%, while the horizontal axis indicates the years from 1960 to 2023. \\nThe graph shows a decline in foreign aid from approximately 0.49% in 1960, followed by fluctuations, hitting a low of about 0.21% around the year 2000. After this low point, there is a gradual increase, reaching 0.37% in 2023. Two data points are highlighted: 0.49% at the start, and 0.21% around 2000, marking significant moments in the timeline.\\nIn the graph, \"DAC countries\" is noted as major aid donors in the OECD, with a credit to the data source, which is the OECD for the year 2024. The visual is copyrighted under CC BY.](https://ourworldindata.org/cdn-cgi/imagedelivery/qLq-8BTgXU8yG0N6HnOy8g/ace263e5-3c73-4493-4358-05e3b503d000/w=1620)February 11OECD countries give a smaller share of their national income to foreign aid today than in 1960Over the last 60 years, the 32 high-income countries in the OECD’s Development Assistance Committee (DAC) steadily increased the foreign aid they sent abroad. In total, aid rose from $39 billion to $213 billion, adjusted for inflation.But while aid has grown in dollar terms, it has shrunk as a share of national income. Between 1960 and 2000, foreign aid as a percentage of national income fell sharply from 0.49% to 0.21%. Since then, it has recovered slightly to 0.37% but remains far below its 1960 level.As a result, only five countries currently meet the UN’s target of dedicating at least 0.7% of their national income to foreign aid.Explore foreign aid given as a share of national income by all countries →Continue reading ](https://ourworldindata.org/</data-insights#seventh-most-recent-data-insight>)\\n### Get Daily Data Insights delivered to your inbox\\nReceive an email from us when we publish a Daily Data Insight (every weekday).\\nSubscribe \\nBy subscribing you are agreeing to the terms of our [privacy policy](https://ourworldindata.org/</privacy-policy>).\\n## Explore our data\\nFeatured data from our collection of 13,176 interactive charts.\\n[See all our data ](https://ourworldindata.org/</data>)\\n### \\nUnder-five mortality rateLong-run estimates combining data from UN & Gapminder\\nUnder-five mortality rate Long-run estimates combining data from un & gapminder\\n#### What share of children die before their fifth birthday?\\nWhat could be more tragic than the death of a young child? Child mortality, the death of children under the age of five, is still [extremely common](https://ourworldindata.org/<https:/ourworldindata.org/much-better-awful-can-be-better>) in our world today.\\nThe historical data makes clear that it doesn’t have to be this way: it [is possible](https://ourworldindata.org/<https:/ourworldindata.org/child-mortality-big-problem-in-brief>) for societies to protect their children and reduce child mortality to very low rates. For child mortality to reach low levels, many things have to go right at the same time: [good healthcare](https://ourworldindata.org/<https:/ourworldindata.org/financing-healthcare>), [good nutrition](https://ourworldindata.org/<https:/ourworldindata.org/hunger-and-undernourishment>), [clean water and sanitation](https://ourworldindata.org/<https:/ourworldindata.org/clean-water-sanitation>), [maternal health](https://ourworldindata.org/<https:/ourworldindata.org/maternal-mortality>), and high [living standards](https://ourworldindata.org/<https:/ourworldindata.org/economic-growth>). We can, therefore, think of [child mortality](https://ourworldindata.org/<https:/ourworldindata.org/child-mortality>) as a proxy indicator of a country’s living conditions.\\nThe chart shows our long-run data on child mortality, which allows you to see how child mortality has changed in countries around the world.\\n[Explore and learn more about this data ](https://ourworldindata.org/<https:/ourworldindata.org/grapher/child-mortality?time=earliest..latest>)\\n[![](https://ourworldindata.org/grapher/child-mortality.png?time=earliest..latest)](https://ourworldindata.org/<https:/ourworldindata.org/grapher/child-mortality?time=earliest..latest>)\\n[Explore and learn more about this data ](https://ourworldindata.org/<https:/ourworldindata.org/grapher/child-mortality?time=earliest..latest>)\\n### \\nShare of population living in extreme povertyWorld Bank\\n[Share of population living in extreme povertyWorld Bank](https://ourworldindata.org/<https:/ourworldindata.org/grapher/share-of-population-in-extreme-poverty>)\\nShare of population living in extreme poverty World bank\\n#### What share of the population lives in extreme poverty?\\nThe UN sets the “International Poverty Line” as a worldwide comparable definition for extreme poverty. Extreme poverty is currently defined as living on less than $2.15 per day. This indicator, published by the World Bank, has successfully drawn attention to the terrible depths of poverty of the poorest people in the world.\\nTwo centuries ago, [the majority](https://ourworldindata.org/<https:/ourworldindata.org/extreme-poverty-in-brief>) of the world’s population was extremely poor. Back then, it was widely believed that widespread poverty was inevitable. This turned out to be wrong. Economic growth is possible and [makes it possible](https://ourworldindata.org/<https:/ourworldindata.org/what-is-economic-growth>) for entire societies to leave the deep poverty of the past behind. Whether or not countries are leaving the worst poverty behind can be monitored by relying on this indicator.\\n[Explore and learn more about this data ](https://ourworldindata.org/<https:/ourworldindata.org/grapher/share-of-population-in-extreme-poverty>)\\n[![](https://ourworldindata.org/grapher/share-of-population-in-extreme-poverty.png)](https://ourworldindata.org/<https:/ourworldindata.org/grapher/share-of-population-in-extreme-poverty>)\\n[Explore and learn more about this data ](https://ourworldindata.org/<https:/ourworldindata.org/grapher/share-of-population-in-extreme-poverty>)\\n### \\nLife expectancy at birthLong-run estimates collated from multiple sources by Our World in Data\\n[Life expectancy at birthLong-run estimates collated from multiple sources by Our World in Data](https://ourworldindata.org/<https:/ourworldindata.org/grapher/life-expectancy>)\\nLife expectancy at birth Long-run estimates collated from multiple sources by our world in data\\n#### How has people’s life expectancy changed over time?\\nAcross the world, people are living longer. In 1900, the global average life expectancy of a newborn was 32 years. By 2021, this had more than doubled to 71 years.\\nBig improvements were achieved by countries [around the world](https://ourworldindata.org/<https:/ourworldindata.org/life-expectancy-globally>). The chart shows that life expectancy has more than doubled in every region of the world. This improvement is not only due to declining child mortality; life expectancy increased [at all ages](https://ourworldindata.org/<https:/ourworldindata.org/its-not-just-about-child-mortality-life-expectancy-improved-at-all-ages>).\\nThis visualization shows long-run estimates of life expectancy brought together by our team from several different data sources. It also shows that the [COVID-19 pandemic](https://ourworldindata.org/<https:/ourworldindata.org/coronavirus>) led to reduced life expectancy worldwide.\\n[Explore and learn more about this data ](https://ourworldindata.org/<https:/ourworldindata.org/grapher/life-expectancy>)\\n[![](https://ourworldindata.org/grapher/life-expectancy.png)](https://ourworldindata.org/<https:/ourworldindata.org/grapher/life-expectancy>)\\n[Explore and learn more about this data ](https://ourworldindata.org/<https:/ourworldindata.org/grapher/life-expectancy>)\\n### \\nPer capita CO₂ emissionsLong-run estimates from the Global Carbon Budget\\n[Per capita CO₂ emissionsLong-run estimates from the Global Carbon Budget](https://ourworldindata.org/<https:/ourworldindata.org/grapher/co-emissions-per-capita?tab=chart&country=USA~GBR~CHN~ZAF~PAN>)\\nPer capita CO₂ emissions Long-run estimates from the global carbon budget\\n#### How have CO₂ emissions per capita changed?\\nThe main source of carbon dioxide (CO2) emissions is the burning of fossil fuels. It is the primary [greenhouse gas](https://ourworldindata.org/<https:/ourworldindata.org/co2-and-greenhouse-gas-emissions>) causing [climate change](https://ourworldindata.org/<https:/ourworldindata.org/explorers/climate-change>).\\nGlobally, CO2 emissions have remained at just below 5 tonnes per person for over a decade. Between countries, however, there are large differences, and while emissions are rapidly increasing in some countries, they are rapidly falling in others.\\nThe source for this CO2 data is the Global Carbon Budget, a dataset we update yearly as soon as it is published. In addition to these production-based emissions, they publish consumption-based emissions for the last three decades, which can be viewed in our [Greenhouse Gas Emissions Data Explorer](https://ourworldindata.org/<https:/ourworldindata.org/explorers/co2?facet=none&country=CHN~USA~IND~FRA&Gas+or+Warming=CO%E2%82%82&Accounting=Consumption-based&Fuel+or+Land+Use+Change=All+fossil+emissions&Count=Per+capita>).\\n[Explore and learn more about this data ](https://ourworldindata.org/<https:/ourworldindata.org/grapher/co-emissions-per-capita?tab=chart&country=USA~GBR~CHN~ZAF~PAN>)\\n[![](https://ourworldindata.org/grapher/co-emissions-per-capita.png?tab=chart&country=USA~GBR~CHN~ZAF~PAN)](https://ourworldindata.org/<https:/ourworldindata.org/grapher/co-emissions-per-capita?tab=chart&country=USA~GBR~CHN~ZAF~PAN>)\\n[Explore and learn more about this data ](https://ourworldindata.org/<https:/ourworldindata.org/grapher/co-emissions-per-capita?tab=chart&country=USA~GBR~CHN~ZAF~PAN>)\\n### \\nGDP per capitaLong-run estimates from the Maddison Project Database\\n[GDP per capitaLong-run estimates from the Maddison Project Database](https://ourworldindata.org/<https:/ourworldindata.org/grapher/gdp-per-capita-maddison-project-database>)\\nGDP per capita Long-run estimates from the maddison project database\\n#### How do average incomes compare between countries around the world?\\nGDP per capita is a very comprehensive measure of people’s [average income](https://ourworldindata.org/<https:/ourworldindata.org/what-is-economic-growth>). This indicator reveals how large the inequality between people in different countries is. In the poorest countries, people live on less than $1,000 per year, while in rich countries, the average income is more than 50 times higher.\\nThe data shown is sourced from the Maddison Project Database. Drawing together the careful work of hundreds of economic historians, the particular value of this data lies in the historical coverage it provides. This data makes clear that the vast majority of people in all countries [were poor](https://ourworldindata.org/<https:/ourworldindata.org/extreme-history-methods>) in the past. It allows us to understand when and how the [economic growth](https://ourworldindata.org/<https:/ourworldindata.org/economic-growth>) that made it possible [to leave](https://ourworldindata.org/<https:/ourworldindata.org/breaking-the-malthusian-trap>) the deep poverty of the past behind was achieved.\\n[Explore and learn more about this data ](https://ourworldindata.org/<https:/ourworldindata.org/grapher/gdp-per-capita-maddison-project-database>)\\n[![](https://ourworldindata.org/grapher/gdp-per-capita-maddison-project-database.png)](https://ourworldindata.org/<https:/ourworldindata.org/grapher/gdp-per-capita-maddison-project-database>)\\n[Explore and learn more about this data ](https://ourworldindata.org/<https:/ourworldindata.org/grapher/gdp-per-capita-maddison-project-database>)\\n### \\nShare of people that are undernourishedFAO\\n[Share of people that are undernourishedFAO](https://ourworldindata.org/<https:/ourworldindata.org/grapher/prevalence-of-undernourishment>)\\nShare of people that are undernourished Fao\\n#### What share of the population is suffering from hunger?\\n[Hunger](https://ourworldindata.org/<https:/ourworldindata.org/hunger-and-undernourishment>) has been a severe problem for most of humanity throughout history. Growing enough food to feed one’s family was a constant struggle in daily life. Food shortages, malnutrition, and [famines](https://ourworldindata.org/<https:/ourworldindata.org/famines>) were common around the world.\\nThe UN’s Food and Agriculture Organization publishes global data on undernourishment, defined as not consuming enough calories to maintain a normal, active, healthy life. These minimum requirements vary by a person’s sex, weight, height, and activity levels. This is considered in these national and global estimates.\\nThe world has made much progress in reducing global hunger in recent decades. But we are still far away from an end to hunger, as this indicator shows. Tragically, nearly one in ten people still do not get enough food to eat and in recent years — especially during the pandemic — hunger levels have increased.\\n[Explore and learn more about this data ](https://ourworldindata.org/<https:/ourworldindata.org/grapher/prevalence-of-undernourishment>)\\n[![](https://ourworldindata.org/grapher/prevalence-of-undernourishment.png)](https://ourworldindata.org/<https:/ourworldindata.org/grapher/prevalence-of-undernourishment>)\\n[Explore and learn more about this data ](https://ourworldindata.org/<https:/ourworldindata.org/grapher/prevalence-of-undernourishment>)\\n### \\nLiteracy rateLong-run estimates collated from multiple sources by Our World in Data\\n[Literacy rateLong-run estimates collated from multiple sources by Our World in Data](https://ourworldindata.org/<https:/ourworldindata.org/grapher/cross-country-literacy-rates?country=RUS~GBR~NLD~CRI~ISR~SGP~CHL~CHN~MAC~OWID_WRL~IND~TZA>)\\nLiteracy rate Long-run estimates collated from multiple sources by our world in data\\n#### When has literacy become a widespread skill?\\nLiteracy is a foundational skill. Children need to learn to read so that they can read to learn. When we fail to teach this foundational skill, people have fewer opportunities to lead the rich and interesting lives that a good education offers.\\nThe historical data shows that only a very small share of the population, a tiny elite, was able to read and write. Over the course of the last few generations, literacy levels increased, but [it remains](https://ourworldindata.org/<https:/ourworldindata.org/better-learning>) an important challenge for our time to provide this foundational skill to all.\\nAt Our World in Data, [we investigated](https://ourworldindata.org/<https:/ourworldindata.org/how-is-literacy-measured>) the strengths and shortcomings of the available data on literacy. Based on this work, our team brought together the long-run data shown in the chart by combining several different sources, including the World Bank, the CIA Factbook, and a range of research publications.\\n[Explore and learn more about this data ](https://ourworldindata.org/<https:/ourworldindata.org/grapher/cross-country-literacy-rates?country=RUS~GBR~NLD~CRI~ISR~SGP~CHL~CHN~MAC~OWID_WRL~IND~TZA>)\\n[![](https://ourworldindata.org/grapher/cross-country-literacy-rates.png?country=RUS~GBR~NLD~CRI~ISR~SGP~CHL~CHN~MAC~OWID_WRL~IND~TZA)](https://ourworldindata.org/<https:/ourworldindata.org/grapher/cross-country-literacy-rates?country=RUS~GBR~NLD~CRI~ISR~SGP~CHL~CHN~MAC~OWID_WRL~IND~TZA>)\\n[Explore and learn more about this data ](https://ourworldindata.org/<https:/ourworldindata.org/grapher/cross-country-literacy-rates?country=RUS~GBR~NLD~CRI~ISR~SGP~CHL~CHN~MAC~OWID_WRL~IND~TZA>)\\n### \\nShare of the population with access to electricityWorld Bank\\n[Share of the population with access to electricityWorld Bank](https://ourworldindata.org/<https:/ourworldindata.org/grapher/share-of-the-population-with-access-to-electricity?time=latest>)\\nShare of the population with access to electricity World bank\\n#### Where do people lack access to even the most basic electricity supply?\\n[Light at night](https://ourworldindata.org/<https:/ourworldindata.org/light-at-night>) makes it possible to get together after sunset; [mobile phones](https://ourworldindata.org/<https:/ourworldindata.org/grapher/mobile-cellular-subscriptions-per-100-people>) allow us to stay in touch with those far away; the refrigeration of food reduces food waste; and [household appliances](https://ourworldindata.org/<https:/ourworldindata.org/grapher/technology-adoption-by-households-in-the-united-states>) free up time from household chores. Access to electricity improves people’s living conditions in many ways.\\nThe World Bank data on the world map captures whether people have access to the _[most basic](https://ourworldindata.org/<https:/ourworldindata.org/definition-electricity-access>)_ electricity supply — just enough to provide basic lighting and charge a phone or power a radio for 4 hours per day.\\nIt shows that, especially in several African countries, a large share of the population lacks the benefits that basic electricity offers. No radio and no light at night.\\n[Explore and learn more about this data ](https://ourworldindata.org/<https:/ourworldindata.org/grapher/share-of-the-population-with-access-to-electricity?time=latest>)\\n[![](https://ourworldindata.org/grapher/share-of-the-population-with-access-to-electricity.png?time=latest)](https://ourworldindata.org/<https:/ourworldindata.org/grapher/share-of-the-population-with-access-to-electricity?time=latest>)\\n[Explore and learn more about this data ](https://ourworldindata.org/<https:/ourworldindata.org/grapher/share-of-the-population-with-access-to-electricity?time=latest>)\\n## Data explorers\\n[See all our Data Explorers ](https://ourworldindata.org/</explorers>)\\nInteractive visualization tools to explore a wide range of related indicators.\\n[![Icon for topic Poverty](https://ourworldindata.org/images/tag-icons/Poverty.svg)Poverty Data Explorer](https://ourworldindata.org/<https:/ourworldindata.org/explorers/poverty-explorer>)[![Icon for topic Population and Demographic Change](https://ourworldindata.org/images/tag-icons/Population%20and%20Demographic%20Change.svg)Population & Demography Data Explorer](https://ourworldindata.org/<https:/ourworldindata.org/explorers/population-and-demography>)[![Icon for topic Global Health](https://ourworldindata.org/images/tag-icons/Global%20Health.svg)Global Health Data Explorer](https://ourworldindata.org/<https:/ourworldindata.org/explorers/global-health>)[![Icon for topic Energy](https://ourworldindata.org/images/tag-icons/Energy.svg)Energy Data Explorer](https://ourworldindata.org/<https:/ourworldindata.org/explorers/energy>)\\n## Subscribe to our newsletters\\nReceive our latest work by email.\\nDaily Data Insights\\nReceive our bite-sized insights on how the world is changing, every weekday.\\nBiweekly Digest\\nReceive an overview of our recent work and highlights of our other work every two weeks.\\nSubscribe\\nBy subscribing you are agreeing to the terms of our [privacy policy](https://ourworldindata.org/</privacy-policy>).\\n## Follow us\\n  * [X](https://ourworldindata.org/<https:/x.com/ourworldindata> \"X\")\\n  * [Instagram](https://ourworldindata.org/<https:/www.instagram.com/ourworldindata/> \"Instagram\")\\n  * [Threads](https://ourworldindata.org/<https:/www.threads.net/@ourworldindata> \"Threads\")\\n  * [Facebook](https://ourworldindata.org/<https:/facebook.com/ourworldindata> \"Facebook\")\\n  * [LinkedIn](https://ourworldindata.org/<https:/www.linkedin.com/company/ourworldindata> \"LinkedIn\")\\n  * [Bluesky](https://ourworldindata.org/<https:/bsky.app/profile/ourworldindata.org> \"Bluesky\")\\n  * [GitHub](https://ourworldindata.org/<https:/github.com/owid> \"GitHub\")\\n  * [Research & Writing](https://ourworldindata.org/</atom.xml> \"Research & Writing\")\\n  * [Daily Data Insights](https://ourworldindata.org/</atom-data-insights.xml> \"Daily Data Insights\")\\n\\n\\n## All our topics\\nAll our data, research, and writing — topic by topic.\\n## Population and Demographic Change\\n  * Population Change:\\n  * [Population Growth](https://ourworldindata.org/</population-growth>)\\n  * [Age Structure](https://ourworldindata.org/</age-structure>)\\n  * [Gender Ratio](https://ourworldindata.org/</gender-ratio>)\\n  * Births and Deaths:\\n  * [Life Expectancy](https://ourworldindata.org/</life-expectancy>)\\n  * [Fertility Rate](https://ourworldindata.org/</fertility-rate>)\\n  * [Child and Infant Mortality](https://ourworldindata.org/</child-mortality>)\\n  * Geography of the World Population:\\n  * [Urbanization](https://ourworldindata.org/</urbanization>)\\n  * [Migration](https://ourworldindata.org/</migration>)\\n\\n\\n## Health\\n  * Life and Death:\\n  * [Global Health](https://ourworldindata.org/</health-meta>)\\n  * [Causes of Death](https://ourworldindata.org/</causes-of-death>)\\n  * [Child and Infant Mortality](https://ourworldindata.org/</child-mortality>)\\n  * [Burden of Disease](https://ourworldindata.org/</burden-of-disease>)\\n  * [Life Expectancy](https://ourworldindata.org/</life-expectancy>)\\n  * [Mental Health](https://ourworldindata.org/</mental-health>)\\n  * [Suicides](https://ourworldindata.org/</suicide>)\\n  * [Cardiovascular Diseases](https://ourworldindata.org/</cardiovascular-diseases>)\\n  * [Cancer](https://ourworldindata.org/</cancer>)\\n  * [Maternal Mortality](https://ourworldindata.org/</maternal-mortality>)\\n  * Health Risks:\\n  * [Air Pollution](https://ourworldindata.org/</air-pollution>)\\n  * [Outdoor Air Pollution](https://ourworldindata.org/</outdoor-air-pollution>)\\n  * [Indoor Air Pollution](https://ourworldindata.org/</indoor-air-pollution>)\\n  * [Lead Pollution](https://ourworldindata.org/</lead-pollution>)\\n  * [Alcohol Consumption](https://ourworldindata.org/</alcohol-consumption>)\\n  * [Opioids, Cocaine, Cannabis, and Other Illicit Drugs](https://ourworldindata.org/</illicit-drug-use>)\\n  * [Obesity](https://ourworldindata.org/</obesity>)\\n  * [Smoking](https://ourworldindata.org/</smoking>)\\n  * Infectious Diseases:\\n  * [Pandemics](https://ourworldindata.org/</pandemics>)\\n  * [Coronavirus Pandemic (COVID-19)](https://ourworldindata.org/</coronavirus>)\\n  * [Malaria](https://ourworldindata.org/</malaria>)\\n  * [HIV/AIDS](https://ourworldindata.org/</hiv-aids>)\\n  * [Diarrheal Diseases](https://ourworldindata.org/</diarrheal-diseases>)\\n  * [Tuberculosis](https://ourworldindata.org/</tuberculosis>)\\n  * [Polio](https://ourworldindata.org/</polio>)\\n  * [Neglected Tropical Diseases](https://ourworldindata.org/</neglected-tropical-diseases>)\\n  * [Influenza](https://ourworldindata.org/</influenza>)\\n  * [Pneumonia](https://ourworldindata.org/</pneumonia>)\\n  * [Tetanus](https://ourworldindata.org/</tetanus>)\\n  * [Mpox](https://ourworldindata.org/</monkeypox>)\\n  * [Smallpox](https://ourworldindata.org/</smallpox>)\\n  * Health Institutions and Interventions:\\n  * [Eradication of Diseases](https://ourworldindata.org/</eradication-of-diseases>)\\n  * [Vaccination](https://ourworldindata.org/</vaccination>)\\n  * [Antibiotics and Antibiotic Resistance](https://ourworldindata.org/</antibiotics>)\\n  * [Healthcare Spending](https://ourworldindata.org/</financing-healthcare>)\\n\\n\\n## Energy and Environment\\n  * Climate and Air:\\n  * [Climate Change](https://ourworldindata.org/</climate-change>)\\n  * [CO₂ and Greenhouse Gas Emissions](https://ourworldindata.org/</co2-and-greenhouse-gas-emissions>)\\n  * [Air Pollution](https://ourworldindata.org/</air-pollution>)\\n  * [Outdoor Air Pollution](https://ourworldindata.org/</outdoor-air-pollution>)\\n  * [Indoor Air Pollution](https://ourworldindata.org/</indoor-air-pollution>)\\n  * [Ozone Layer](https://ourworldindata.org/</ozone-layer>)\\n  * Energy Systems:\\n  * [Energy](https://ourworldindata.org/</energy>)\\n  * [Access to Energy](https://ourworldindata.org/</energy-access>)\\n  * [Fossil Fuels](https://ourworldindata.org/</fossil-fuels>)\\n  * [Renewable Energy](https://ourworldindata.org/</renewable-energy>)\\n  * [Nuclear Energy](https://ourworldindata.org/</nuclear-energy>)\\n  * [Metals and Minerals](https://ourworldindata.org/</metals-minerals>)\\n  * Environment and Ecosystems:\\n  * [Natural Disasters](https://ourworldindata.org/</natural-disasters>)\\n  * [Biodiversity](https://ourworldindata.org/</biodiversity>)\\n  * [Environmental Impacts of Food Production](https://ourworldindata.org/</environmental-impacts-of-food>)\\n  * [Fish and Overfishing](https://ourworldindata.org/</fish-and-overfishing>)\\n  * [Land Use](https://ourworldindata.org/</land-use>)\\n  * [Water Use and Stress](https://ourworldindata.org/</water-use-stress>)\\n  * [Forests and Deforestation](https://ourworldindata.org/</forests-and-deforestation>)\\n  * [Wildfires](https://ourworldindata.org/</wildfires>)\\n  * [Animal Welfare](https://ourworldindata.org/</animal-welfare>)\\n  * Waste and Pollution:\\n  * [Plastic Pollution](https://ourworldindata.org/</plastic-pollution>)\\n  * [Oil Spills](https://ourworldindata.org/</oil-spills>)\\n  * [Lead Pollution](https://ourworldindata.org/</lead-pollution>)\\n\\n\\n## Food and Agriculture\\n  * Food Production:\\n  * [Agricultural Production](https://ourworldindata.org/</agricultural-production>)\\n  * [Meat and Dairy Production](https://ourworldindata.org/</meat-production>)\\n  * [Fish and Overfishing](https://ourworldindata.org/</fish-and-overfishing>)\\n  * [Crop Yields](https://ourworldindata.org/</crop-yields>)\\n  * [Animal Welfare](https://ourworldindata.org/</animal-welfare>)\\n  * [Environmental Impacts of Food Production](https://ourworldindata.org/</environmental-impacts-of-food>)\\n  * [Farm Size and Productivity](https://ourworldindata.org/</farm-size>)\\n  * Agricultural Inputs:\\n  * [Land Use](https://ourworldindata.org/</land-use>)\\n  * [Fertilizers](https://ourworldindata.org/</fertilizers>)\\n  * [Pesticides](https://ourworldindata.org/</pesticides>)\\n  * [Employment in Agriculture](https://ourworldindata.org/</employment-in-agriculture>)\\n  * Nutrition:\\n  * [Hunger and Undernourishment](https://ourworldindata.org/</hunger-and-undernourishment>)\\n  * [Food Supply](https://ourworldindata.org/</food-supply>)\\n  * [Food Prices](https://ourworldindata.org/</food-prices>)\\n  * [Obesity](https://ourworldindata.org/</obesity>)\\n  * [Famines](https://ourworldindata.org/</famines>)\\n  * [Diet Compositions](https://ourworldindata.org/</diet-compositions>)\\n  * [Micronutrient Deficiency](https://ourworldindata.org/</micronutrient-deficiency>)\\n  * [Human Height](https://ourworldindata.org/</human-height>)\\n\\n\\n## Poverty and Economic Development\\n  * Poverty and Prosperity:\\n  * [Poverty](https://ourworldindata.org/</poverty>)\\n  * [Economic Growth](https://ourworldindata.org/</economic-growth>)\\n  * [Economic Inequality](https://ourworldindata.org/</economic-inequality>)\\n  * [Foreign Aid](https://ourworldindata.org/</foreign-aid>)\\n  * [Economic Inequality by Gender](https://ourworldindata.org/</economic-inequality-by-gender>)\\n  * Public Sector:\\n  * [Government Spending](https://ourworldindata.org/</government-spending>)\\n  * [State Capacity](https://ourworldindata.org/</state-capacity>)\\n  * [Taxation](https://ourworldindata.org/</taxation>)\\n  * [Corruption](https://ourworldindata.org/</corruption>)\\n  * [Healthcare Spending](https://ourworldindata.org/</financing-healthcare>)\\n  * [Education Spending](https://ourworldindata.org/</financing-education>)\\n  * [Military Personnel and Spending](https://ourworldindata.org/</military-personnel-spending>)\\n  * Labor:\\n  * [Women’s Employment](https://ourworldindata.org/</female-labor-supply>)\\n  * [Child Labor](https://ourworldindata.org/</child-labor>)\\n  * [Working Hours](https://ourworldindata.org/</working-hours>)\\n  * Global Connections:\\n  * [Trade and Globalization](https://ourworldindata.org/</trade-and-globalization>)\\n  * [Migration](https://ourworldindata.org/</migration>)\\n  * [Tourism](https://ourworldindata.org/</tourism>)\\n  * Water:\\n  * [Clean Water and Sanitation](https://ourworldindata.org/</clean-water-sanitation>)\\n  * [Clean Water](https://ourworldindata.org/</water-access>)\\n  * [Sanitation](https://ourworldindata.org/</sanitation>)\\n\\n\\n## Education and Knowledge\\n  * Education:\\n  * [Global Education](https://ourworldindata.org/</global-education>)\\n  * [Literacy](https://ourworldindata.org/</literacy>)\\n  * [Education Spending](https://ourworldindata.org/</financing-education>)\\n  * Knowledge:\\n  * [Research and Development](https://ourworldindata.org/</research-and-development>)\\n  * [Internet](https://ourworldindata.org/</internet>)\\n  * [Books](https://ourworldindata.org/</books>)\\n\\n\\n## Innovation and Technological Change\\n  * [Technological Change](https://ourworldindata.org/</technological-change>)\\n  * [Research and Development](https://ourworldindata.org/</research-and-development>)\\n  * [Artificial Intelligence](https://ourworldindata.org/</artificial-intelligence>)\\n  * [Internet](https://ourworldindata.org/</internet>)\\n  * [Space Exploration and Satellites](https://ourworldindata.org/</space-exploration-satellites>)\\n  * [Transport](https://ourworldindata.org/</transport>)\\n\\n\\n## Living Conditions, Community, and Wellbeing\\n  * Housing and Infrastructure:\\n  * [Homelessness](https://ourworldindata.org/</homelessness>)\\n  * [Access to Energy](https://ourworldindata.org/</energy-access>)\\n  * [Indoor Air Pollution](https://ourworldindata.org/</indoor-air-pollution>)\\n  * [Clean Water and Sanitation](https://ourworldindata.org/</clean-water-sanitation>)\\n  * [Clean Water](https://ourworldindata.org/</water-access>)\\n  * [Sanitation](https://ourworldindata.org/</sanitation>)\\n  * [Light at Night](https://ourworldindata.org/</light-at-night>)\\n  * Time Use:\\n  * [Time Use](https://ourworldindata.org/</time-use>)\\n  * [Working Hours](https://ourworldindata.org/</working-hours>)\\n  * Relationships:\\n  * [Marriages and Divorces](https://ourworldindata.org/</marriages-and-divorces>)\\n  * [Loneliness and Social Connections](https://ourworldindata.org/</social-connections-and-loneliness>)\\n  * [Trust](https://ourworldindata.org/</trust>)\\n  * Happiness and Wellbeing:\\n  * [Happiness and Life Satisfaction](https://ourworldindata.org/</happiness-and-life-satisfaction>)\\n  * [Human Development Index (HDI)](https://ourworldindata.org/</human-development-index>)\\n\\n\\n## Human Rights and Democracy\\n  * [Human Rights](https://ourworldindata.org/</human-rights>)\\n  * [Democracy](https://ourworldindata.org/</democracy>)\\n  * [State Capacity](https://ourworldindata.org/</state-capacity>)\\n  * [Women’s Rights](https://ourworldindata.org/</women-rights>)\\n  * [LGBT+ Rights](https://ourworldindata.org/</lgbt-rights>)\\n  * [Corruption](https://ourworldindata.org/</corruption>)\\n  * [Economic Inequality by Gender](https://ourworldindata.org/</economic-inequality-by-gender>)\\n  * [Child Labor](https://ourworldindata.org/</child-labor>)\\n  * [Violence Against Children and Children’s Rights](https://ourworldindata.org/</violence-against-rights-for-children>)\\n\\n\\n## Violence and War\\n  * [War and Peace](https://ourworldindata.org/</war-and-peace>)\\n  * [Nuclear Weapons](https://ourworldindata.org/</nuclear-weapons>)\\n  * [Homicides](https://ourworldindata.org/</homicides>)\\n  * [Terrorism](https://ourworldindata.org/</terrorism>)\\n  * [State Capacity](https://ourworldindata.org/</state-capacity>)\\n  * [Military Personnel and Spending](https://ourworldindata.org/</military-personnel-spending>)\\n  * [Violence Against Children and Children’s Rights](https://ourworldindata.org/</violence-against-rights-for-children>)\\n\\n\\n#### Our World in Data is free and accessible for everyone.\\nHelp us do this work by making a donation.\\n[Donate now ](https://ourworldindata.org/</donate>)\\nOur World in Data is a project of [Global Change Data Lab](https://ourworldindata.org/<https:/global-change-data-lab.org/>), a nonprofit based in the UK (Reg. Charity No. 1186433). Our charts, articles, and data are licensed under [CC BY](https://ourworldindata.org/<https:/creativecommons.org/licenses/by/4.0/>), unless stated otherwise. Tools and software we develop are open source under the [MIT license](https://ourworldindata.org/<https:/github.com/owid/owid-grapher/blob/master/LICENSE.md>). Third-party materials, including some charts and data, are subject to third-party licenses. See our [FAQs](https://ourworldindata.org/</faqs>) for more details.\\n[![Oxford Martin School logo](https://ourworldindata.org/oms-logo.svg)](https://ourworldindata.org/<https:/www.oxfordmartin.ox.ac.uk/global-development>)[![University of Oxford logo](https://ourworldindata.org/oxford-logo.svg)](https://ourworldindata.org/<https:/www.ox.ac.uk>)[![Global Change Data Lab logo](https://ourworldindata.org/gcdl-logo.svg)](https://ourworldindata.org/<https:/global-change-data-lab.org>)\\n[![Y Combinator logo](https://ourworldindata.org/yc-logo.svg)](https://ourworldindata.org/<https:/www.ycombinator.com>)\\n##### Explore\\n  * [Topics](https://ourworldindata.org/</#all-topics>)\\n  * [Data](https://ourworldindata.org/</data>)\\n  * [Insights](https://ourworldindata.org/</data-insights>)\\n\\n\\n##### Resources\\n  * [Latest Articles](https://ourworldindata.org/</latest>)\\n  * [SDG Trackers](https://ourworldindata.org/</sdgs>)\\n  * [Teaching Materials](https://ourworldindata.org/</teaching>)\\n\\n\\n##### About\\n  * [About Us](https://ourworldindata.org/</about>)\\n  * [Organization](https://ourworldindata.org/</organization>)\\n  * [Funding](https://ourworldindata.org/</funding>)\\n  * [Team](https://ourworldindata.org/</team>)\\n  * [Jobs](https://ourworldindata.org/</jobs>)\\n  * [FAQs](https://ourworldindata.org/</faqs>)\\n\\n\\n##### RSS Feeds\\n  * [Research & Writing](https://ourworldindata.org/</atom.xml>)\\n  * [Daily Data Insights](https://ourworldindata.org/</atom-data-insights.xml>)\\n\\n\\n##### Follow us\\n[](https://ourworldindata.org/<https:/x.com/ourworldindata>)[](https://ourworldindata.org/<https:/www.instagram.com/ourworldindata/>)[](https://ourworldindata.org/<https:/www.threads.net/@ourworldindata>)[](https://ourworldindata.org/<https:/facebook.com/ourworldindata>)[](https://ourworldindata.org/<https:/www.linkedin.com/company/ourworldindata>)[](https://ourworldindata.org/<https:/bsky.app/profile/ourworldindata.org>)[](https://ourworldindata.org/<https:/github.com/owid>)\\n  * [Privacy policy](https://ourworldindata.org/</privacy-policy>)\\n  * [Legal disclaimer](https://ourworldindata.org/</organization#legal-disclaimer>)\\n  * [Grapher license](https://ourworldindata.org/<https:/github.com/owid/owid-grapher/blob/master/LICENSE.md>)\\n\\n\\nSubscribe\\nLeave us feedback\\n**Have a question?** You may find an answer in:[**General FAQ**](https://ourworldindata.org/<https:/ourworldindata.org/faqs>) or [**Vaccinations FAQ**](https://ourworldindata.org/<https:/ourworldindata.org/covid-vaccinations#frequently-asked-questions>)\\nMessage\\nYour name\\nEmail addressYour name and email will only be used to reply to you and not for any other purpose. If you do not give a valid email, we will not be able to reply to you.\\nSend message\\nFeedback\\nWe use cookies to give you the best experience on our website.\\nBy agreeing, you consent to our use of cookies and other analytics tools according to [our privacy policy](https://ourworldindata.org/</privacy-policy>).\\nNo thanksI agree\\n' markdown_with_citations='Our World in Data⟨1⟩\\n![Oxford Martin School logo⟨2⟩](https://ourworldindata.org/<https:/www.oxfordmartin.ox.ac.uk/global-development>)![Oxford logo⟨3⟩](https://ourworldindata.org/<https:/www.ox.ac.uk/>)![Global Change Data Lab logo⟨4⟩](https://ourworldindata.org/<https:/global-change-data-lab.org/>)\\n  * Browse by topic\\n  * Data⟨5⟩\\n  * Insights⟨6⟩\\n  * Resources\\n  * About\\n\\n\\nSubscribe\\nDonate⟨7⟩\\nGdoc⟨8⟩/Admin⟨8⟩\\nPopular pages\\n  * CO₂ Emissions⟨9⟩\\n  * Economic Inequality⟨10⟩\\n  * Human Rights⟨11⟩\\n  * Poverty⟨12⟩\\n  * Energy⟨13⟩\\n  * Life Expectancy⟨14⟩\\n  * Causes of Death⟨15⟩\\n  * Population Growth⟨16⟩\\n  * COVID-19⟨17⟩\\n\\n\\n## Research and data to make progress against the world’s largest problems.\\n13,176 charts⟨5⟩ across 120 topics⟨18⟩All free: open access and open source\\n## Our Mission\\nWhat do we need to know to make the world a better place?\\nTo make progress against the pressing problems the world faces, we need to be informed by the best research and data.\\nOur World in Data makes this knowledge accessible and understandable, to empower those working to build a better world.\\nRead about our mission ⟨19⟩Subscribe to our newsletters ⟨20⟩\\n**We are a non-profit — all our work is free to use and open source.** Consider supporting us if you find our work valuable.\\nDonate to support us ⟨7⟩\\nAs seen on\\n![Logos of the publications that have used our content. From left to right: Science, Nature, PNAS, BBC, Financial Times, The New York Times, The Guardian, The Atlantic, and The Washington Post⟨21⟩]\\n## Featured work\\n![Featured image⟨22⟩NewArticle · 14 min readIn many countries, people breathe the cleanest air in centuries. What can the rest of the world learn from this?Air pollution tends to get worse before it gets better, but how can we accelerate this transition?Hannah Ritchie](https://ourworldindata.org/<https:/ourworldindata.org/cleanest-air-lessons>)\\n![⟨23⟩From our classicsFood production is responsible for one-quarter of the world’s greenhouse gas emissionsOne-quarter of the world\\'s greenhouse gas emissions result from food and agriculture. What are the main contributors to food\\'s emissions?Hannah Ritchie](https://ourworldindata.org/<https:/ourworldindata.org/food-ghg-emissions>)![Featured image⟨24⟩Article · 4 min readIf we can make maternal deaths as rare as in the healthiest countries, we can save 275,000 mothers each yearMaternal mortality was much more common in the past. It is much lower today, but global inequalities are still large.Hannah Ritchie](https://ourworldindata.org/<https:/ourworldindata.org/maternal-deaths-save-mothers>)\\n![A photo of Max Roser and others marching through town as part of the ceremony for receiving an honorary doctorate from KU Leuven and UCLouvain in Belgium. The photo is copyright KU Leuven - Rob Stevens.⟨25⟩AnnouncementOur founder, Max Roser, has received two prestigious honorsAn honorary doctorate from KU Leuven & UCLouvain and a “Dove of Peace” in Germany.Angela Wenham and Charlie Giattino](https://ourworldindata.org/<https:/ourworldindata.org/max-roser-received-two-prestigious-honors>)![A rectangular table with two rows and five columns. The first row contains colored blocks, starting from the left with a deep purple block, followed by a light purple, a pale lavender, and two shades of peach. The second row mirrors the first, repeating the same arrangement of colors.⟨26⟩Article · 10 min readHow much in subsidies do fossil fuels receive?Estimates range from less than $1 trillion to $7 trillion. Where do these numbers come from?Hannah Ritchie](https://ourworldindata.org/<https:/ourworldindata.org/how-much-subsidies-fossil-fuels>)\\nSee all our latest work ⟨27⟩\\nSee all our latest work ⟨27⟩\\n## Daily Data Insights\\nBite-sized insights on how the world is changing, published every weekday.\\nSee all Daily Data Insights ⟨6⟩\\n![A global map shows the share of mothers aged 20–44 who have lost a child under five years old. The data is categorized into four ranges: less than 1% \\\\(light yellow\\\\), 1% to 5% \\\\(yellow\\\\), 5% to 10% \\\\(orange\\\\), 10% to 30% \\\\(dark orange\\\\), and more than 30% \\\\(red\\\\). Higher rates are concentrated in Sub-Saharan Africa and parts of South Asia, while lower rates are seen in North America, Europe, and parts of East Asia. Data is sourced from Smith-Greenaway et al. \\\\(2021\\\\) and reflects single-year estimates between 2010 and 2018.⟨28⟩TodayIn some countries, more than one in three mothers have lost a child younger than fiveThere are few experiences, if any, that are more painful for a parent than losing a child.In the past, child deaths were much more common than they are today. But even when these deaths were not unusual, historical diary entries show us that most parents still found them heartbreaking.Unfortunately, in many countries today, a large share of parents still experience the loss of a child. The map here shows the share of mothers who lost a child before they reached the age of five.In most of Europe and North America, this share is less than 1%. But in some of the world’s poorest countries — like Cameroon, Nigeria, and the Central African Republic — more than one in three mothers have experienced this tragedy.These figures come from a research article by Emily Smith-Greenaway and colleagues, based on reported or estimated data from 2010 to 2018 for mothers aged 20 to 44.Read my colleague Max Roser’s article for more historical context around this data →Continue reading ](https://ourworldindata.org/</data-insights#most-recent-data-insight>)![The image presents a data visualization illustrating the number of animals killed for meat worldwide from 1961 to 2022. It is divided into four sections, each representing a different animal species:\\n1. **Chickens**: Shown in orange, the graph starts at zero in 1961 and rises sharply, reaching approximately 60 billion killed by 2022.\\n \\n2. **Pigs**: Displayed in green, this chart shows a more gradual increase, starting from zero in 1961 and peaking at around 1 billion killed by 2022.\\n3. **Sheep and Goats**: Presented in blue, this line shows a steady rise from zero in 1961 to nearly 400 million by 2022, with a peak near 1 billion.\\n4. **Cows**: Illustrated in dark green, this graph shows a slow but consistent increase from zero to about 300 million killed by 2022.\\nEach section has a label indicating the species and the number of animals on the vertical axis, while the horizontal axis marks the years from 1961 to 2022. The bottom of the image references the data source as the Food and Agriculture Organization of the UN from 2023, with a CC BY attribution.⟨29⟩YesterdayMore land animals than ever before are slaughtered for meatGlobal livestock numbers — tracked by the UN Food and Agriculture Organization since 1961 — have surged, with particularly large increases in the number of chickens, pigs, sheep, goats, and cows.For many land animals, life is short and painful. Recent estimates indicate that globally, most animals are raised on factory farms. In the US, where better data and research are available, 99% of livestock is factory-farmed.Explore many more interactive charts and articles on animal welfare →Continue reading ](https://ourworldindata.org/</data-insights#second-most-recent-data-insight>)![A bar chart titled \"Global sales of combustion engine cars have peaked,\" showing annual car sales from 2010 to 2023. The chart highlights that combustion engine car sales peaked in 2017/18 and have declined since, while electric car sales \\\\(in orange\\\\) have steadily risen. Total car sales hover around 70–80 million annually, with electric cars making a growing share of the market from 2018 onward. Data source: International Energy Agency, Global EV Outlook 2024. Note: Electric cars include fully battery-electric and plug-in hybrids.⟨30⟩February 17Global sales of combustion engine cars have peakedTo decarbonize road transport, the world must move away from petrol and diesel cars and towards electric vehicles and other forms of low-carbon transport.This transition has already started. In fact, global sales of combustion engine cars are well past the peak and are now falling.As you can see in the chart, global sales peaked in 2018. This is calculated based on data from the International Energy Agency. Bloomberg New Energy Finance estimates this peak occurred one year earlier, in 2017.Sales of electric cars, on the other hand, are growing quickly.Explore more data on electric car sales across the world →Continue reading ](https://ourworldindata.org/</data-insights#third-most-recent-data-insight>)![A data visualization titled \"Nine Asian countries where child mortality has halved since 2000.\" The chart shows the estimated percentage of newborns dying before age five in nine countries: Afghanistan \\\\(13% in 2000 to 6% in 2022\\\\), Cambodia \\\\(11% to 2%\\\\), Laos \\\\(11% to 4%\\\\), Bangladesh \\\\(9% to 3%\\\\), Myanmar \\\\(9% to 4%\\\\), India \\\\(9% to 3%\\\\), Nepal \\\\(8% to 3%\\\\), Indonesia \\\\(5% to 2%\\\\), and China \\\\(4% to 1%\\\\). Each country is represented by a line graph showing a significant decline in child mortality over time. Data source: UN Inter-agency Group for Child Mortality Estimation \\\\(2024\\\\), CC BY.⟨31⟩February 14In these nine Asian countries, child mortality has more than halved since the year 2000Child mortality in Asia has fallen sharply. The chart shows nine countries that have reduced child mortality rates by more than half since 2000. This means millions more children surviving through the crucial early years of life.In India, for example, child mortality fell from 9% to 3%. China saw a similar decrease from 4% to just 1%. Key reasons for these gains include improved nutrition, clean water, sanitation, vaccinations, and poverty reduction.However, even with these improvements, rates of 1–6% still reflect hundreds of thousands of young lives lost each year in these countries.This is a story of remarkable progress — but one that’s not yet finished.Explore child mortality data for more countries →Continue reading ](https://ourworldindata.org/</data-insights#fourth-most-recent-data-insight>)![An infographic titled \"Most livestock in the United States are factory-farmed.\" It lists the percentages and numbers of animals raised in factory farms, defined by the EPA as operations with intensive feeding for over 45 days. Chickens: 99.96%, 9.2 billion; Turkeys: 99.8%, 260 million; Farmed fish: 100%, 530 million; Cows: 75%, 66 million; Egg-laying hens: 98.3%, 380 million; Pigs: 98.6%, 73 million. Data source: Sentience Institute \\\\(2024\\\\), with data from 2022.⟨32⟩February 13Almost all livestock in the United States is factory-farmedIt’s difficult to quantify animal suffering in a single number, but one metric often used to measure living conditions is the number of animals raised on “factory farms”.Factory farms are defined as “concentrated animal feeding operations” where many animals are held in an intensive feeding operation for more than 45 days.99% of livestock in the United States is factory-farmed. This latest estimate comes from the Sentience Institute and is based on definitions and data from the US Environment Protection Agency.The chart shows the share of different forms of livestock that are factory-farmed. More than 98% of chickens, turkeys, hens, pigs, and farmed fish are factory-farmed. Cows are a bit less likely to be factory-farmed, but three-quarters still spend much of their lives in these conditions.Read more about factory farming, including estimates of how much livestock globally is factory-farmed →Continue reading ](https://ourworldindata.org/</data-insights#fifth-most-recent-data-insight>)![A line graph depicting the most common birth month in France from 1861 to 2022, with the horizontal axis representing months from January to December and the vertical axis indicating years. Each year shows a line indicating the month with the highest average birth rate per day, with varying colors representing different time periods. \\nIn the late 19th and early 20th centuries, lines often cluster around spring months, indicating this as the most common season for births. Disruptions during World Wars I and II are noted, as birth rates shifted temporarily. Since the late 20th century, the trend has changed, with late summer and autumn months becoming the most common for births.\\nThe data source is the Human Mortality Database \\\\(2024\\\\) and the chart is published on OurWorldinData.org, and is licensed under CC-BY by the authors, Saloni Dattani and Lucas Rodés-Guirao.⟨33⟩February 12Spring no more: France’s shift in birth patternsWhat’s the most common season for babies to be born?In many European countries, it’s late summer or autumn. Births are 5% to 10% more common in these months than others.But this seasonal pattern used to be different. The chart shows the most common month for births each year. We’ve focused on France, which has data since the 1860s.As you can see, spring was the most common season for births then. The pattern was temporarily disrupted during the two World Wars but continued until the late 20th century. Then, births shifted to later in the year, with late summer and autumn becoming more popular.This shift also occurred in many other European countries and North America.Explore the most common birth month around the world →Continue reading ](https://ourworldindata.org/</data-insights#sixth-most-recent-data-insight>)![A line graph titled \"Foreign aid given as a share of national income, DAC Countries\" illustrates the trend of official development assistance \\\\(ODA\\\\) as a percentage of gross national income from 1960 to 2023. The vertical axis represents the percentage of national income, ranging from 0% to 0.5%, while the horizontal axis indicates the years from 1960 to 2023. \\nThe graph shows a decline in foreign aid from approximately 0.49% in 1960, followed by fluctuations, hitting a low of about 0.21% around the year 2000. After this low point, there is a gradual increase, reaching 0.37% in 2023. Two data points are highlighted: 0.49% at the start, and 0.21% around 2000, marking significant moments in the timeline.\\nIn the graph, \"DAC countries\" is noted as major aid donors in the OECD, with a credit to the data source, which is the OECD for the year 2024. The visual is copyrighted under CC BY.⟨34⟩February 11OECD countries give a smaller share of their national income to foreign aid today than in 1960Over the last 60 years, the 32 high-income countries in the OECD’s Development Assistance Committee (DAC) steadily increased the foreign aid they sent abroad. In total, aid rose from $39 billion to $213 billion, adjusted for inflation.But while aid has grown in dollar terms, it has shrunk as a share of national income. Between 1960 and 2000, foreign aid as a percentage of national income fell sharply from 0.49% to 0.21%. Since then, it has recovered slightly to 0.37% but remains far below its 1960 level.As a result, only five countries currently meet the UN’s target of dedicating at least 0.7% of their national income to foreign aid.Explore foreign aid given as a share of national income by all countries →Continue reading ](https://ourworldindata.org/</data-insights#seventh-most-recent-data-insight>)\\n### Get Daily Data Insights delivered to your inbox\\nReceive an email from us when we publish a Daily Data Insight (every weekday).\\nSubscribe \\nBy subscribing you are agreeing to the terms of our privacy policy⟨35⟩.\\n## Explore our data\\nFeatured data from our collection of 13,176 interactive charts.\\nSee all our data ⟨5⟩\\n### \\nUnder-five mortality rateLong-run estimates combining data from UN & Gapminder\\nUnder-five mortality rate Long-run estimates combining data from un & gapminder\\n#### What share of children die before their fifth birthday?\\nWhat could be more tragic than the death of a young child? Child mortality, the death of children under the age of five, is still extremely common⟨36⟩ in our world today.\\nThe historical data makes clear that it doesn’t have to be this way: it is possible⟨37⟩ for societies to protect their children and reduce child mortality to very low rates. For child mortality to reach low levels, many things have to go right at the same time: good healthcare⟨38⟩, good nutrition⟨39⟩, clean water and sanitation⟨40⟩, maternal health⟨41⟩, and high living standards⟨42⟩. We can, therefore, think of child mortality⟨43⟩ as a proxy indicator of a country’s living conditions.\\nThe chart shows our long-run data on child mortality, which allows you to see how child mortality has changed in countries around the world.\\nExplore and learn more about this data ⟨44⟩\\n![⟨45⟩](https://ourworldindata.org/<https:/ourworldindata.org/grapher/child-mortality?time=earliest..latest>)\\nExplore and learn more about this data ⟨44⟩\\n### \\nShare of population living in extreme povertyWorld Bank\\nShare of population living in extreme povertyWorld Bank⟨46⟩\\nShare of population living in extreme poverty World bank\\n#### What share of the population lives in extreme poverty?\\nThe UN sets the “International Poverty Line” as a worldwide comparable definition for extreme poverty. Extreme poverty is currently defined as living on less than $2.15 per day. This indicator, published by the World Bank, has successfully drawn attention to the terrible depths of poverty of the poorest people in the world.\\nTwo centuries ago, the majority⟨47⟩ of the world’s population was extremely poor. Back then, it was widely believed that widespread poverty was inevitable. This turned out to be wrong. Economic growth is possible and makes it possible⟨48⟩ for entire societies to leave the deep poverty of the past behind. Whether or not countries are leaving the worst poverty behind can be monitored by relying on this indicator.\\nExplore and learn more about this data ⟨46⟩\\n![⟨49⟩](https://ourworldindata.org/<https:/ourworldindata.org/grapher/share-of-population-in-extreme-poverty>)\\nExplore and learn more about this data ⟨46⟩\\n### \\nLife expectancy at birthLong-run estimates collated from multiple sources by Our World in Data\\nLife expectancy at birthLong-run estimates collated from multiple sources by Our World in Data⟨50⟩\\nLife expectancy at birth Long-run estimates collated from multiple sources by our world in data\\n#### How has people’s life expectancy changed over time?\\nAcross the world, people are living longer. In 1900, the global average life expectancy of a newborn was 32 years. By 2021, this had more than doubled to 71 years.\\nBig improvements were achieved by countries around the world⟨51⟩. The chart shows that life expectancy has more than doubled in every region of the world. This improvement is not only due to declining child mortality; life expectancy increased at all ages⟨52⟩.\\nThis visualization shows long-run estimates of life expectancy brought together by our team from several different data sources. It also shows that the COVID-19 pandemic⟨17⟩ led to reduced life expectancy worldwide.\\nExplore and learn more about this data ⟨50⟩\\n![⟨53⟩](https://ourworldindata.org/<https:/ourworldindata.org/grapher/life-expectancy>)\\nExplore and learn more about this data ⟨50⟩\\n### \\nPer capita CO₂ emissionsLong-run estimates from the Global Carbon Budget\\nPer capita CO₂ emissionsLong-run estimates from the Global Carbon Budget⟨54⟩\\nPer capita CO₂ emissions Long-run estimates from the global carbon budget\\n#### How have CO₂ emissions per capita changed?\\nThe main source of carbon dioxide (CO2) emissions is the burning of fossil fuels. It is the primary greenhouse gas⟨9⟩ causing climate change⟨55⟩.\\nGlobally, CO2 emissions have remained at just below 5 tonnes per person for over a decade. Between countries, however, there are large differences, and while emissions are rapidly increasing in some countries, they are rapidly falling in others.\\nThe source for this CO2 data is the Global Carbon Budget, a dataset we update yearly as soon as it is published. In addition to these production-based emissions, they publish consumption-based emissions for the last three decades, which can be viewed in our Greenhouse Gas Emissions Data Explorer⟨56⟩.\\nExplore and learn more about this data ⟨54⟩\\n![⟨57⟩](https://ourworldindata.org/<https:/ourworldindata.org/grapher/co-emissions-per-capita?tab=chart&country=USA~GBR~CHN~ZAF~PAN>)\\nExplore and learn more about this data ⟨54⟩\\n### \\nGDP per capitaLong-run estimates from the Maddison Project Database\\nGDP per capitaLong-run estimates from the Maddison Project Database⟨58⟩\\nGDP per capita Long-run estimates from the maddison project database\\n#### How do average incomes compare between countries around the world?\\nGDP per capita is a very comprehensive measure of people’s average income⟨48⟩. This indicator reveals how large the inequality between people in different countries is. In the poorest countries, people live on less than $1,000 per year, while in rich countries, the average income is more than 50 times higher.\\nThe data shown is sourced from the Maddison Project Database. Drawing together the careful work of hundreds of economic historians, the particular value of this data lies in the historical coverage it provides. This data makes clear that the vast majority of people in all countries were poor⟨59⟩ in the past. It allows us to understand when and how the economic growth⟨42⟩ that made it possible to leave⟨60⟩ the deep poverty of the past behind was achieved.\\nExplore and learn more about this data ⟨58⟩\\n![⟨61⟩](https://ourworldindata.org/<https:/ourworldindata.org/grapher/gdp-per-capita-maddison-project-database>)\\nExplore and learn more about this data ⟨58⟩\\n### \\nShare of people that are undernourishedFAO\\nShare of people that are undernourishedFAO⟨62⟩\\nShare of people that are undernourished Fao\\n#### What share of the population is suffering from hunger?\\nHunger⟨39⟩ has been a severe problem for most of humanity throughout history. Growing enough food to feed one’s family was a constant struggle in daily life. Food shortages, malnutrition, and famines⟨63⟩ were common around the world.\\nThe UN’s Food and Agriculture Organization publishes global data on undernourishment, defined as not consuming enough calories to maintain a normal, active, healthy life. These minimum requirements vary by a person’s sex, weight, height, and activity levels. This is considered in these national and global estimates.\\nThe world has made much progress in reducing global hunger in recent decades. But we are still far away from an end to hunger, as this indicator shows. Tragically, nearly one in ten people still do not get enough food to eat and in recent years — especially during the pandemic — hunger levels have increased.\\nExplore and learn more about this data ⟨62⟩\\n![⟨64⟩](https://ourworldindata.org/<https:/ourworldindata.org/grapher/prevalence-of-undernourishment>)\\nExplore and learn more about this data ⟨62⟩\\n### \\nLiteracy rateLong-run estimates collated from multiple sources by Our World in Data\\nLiteracy rateLong-run estimates collated from multiple sources by Our World in Data⟨65⟩\\nLiteracy rate Long-run estimates collated from multiple sources by our world in data\\n#### When has literacy become a widespread skill?\\nLiteracy is a foundational skill. Children need to learn to read so that they can read to learn. When we fail to teach this foundational skill, people have fewer opportunities to lead the rich and interesting lives that a good education offers.\\nThe historical data shows that only a very small share of the population, a tiny elite, was able to read and write. Over the course of the last few generations, literacy levels increased, but it remains⟨66⟩ an important challenge for our time to provide this foundational skill to all.\\nAt Our World in Data, we investigated⟨67⟩ the strengths and shortcomings of the available data on literacy. Based on this work, our team brought together the long-run data shown in the chart by combining several different sources, including the World Bank, the CIA Factbook, and a range of research publications.\\nExplore and learn more about this data ⟨65⟩\\n![⟨68⟩](https://ourworldindata.org/<https:/ourworldindata.org/grapher/cross-country-literacy-rates?country=RUS~GBR~NLD~CRI~ISR~SGP~CHL~CHN~MAC~OWID_WRL~IND~TZA>)\\nExplore and learn more about this data ⟨65⟩\\n### \\nShare of the population with access to electricityWorld Bank\\nShare of the population with access to electricityWorld Bank⟨69⟩\\nShare of the population with access to electricity World bank\\n#### Where do people lack access to even the most basic electricity supply?\\nLight at night⟨70⟩ makes it possible to get together after sunset; mobile phones⟨71⟩ allow us to stay in touch with those far away; the refrigeration of food reduces food waste; and household appliances⟨72⟩ free up time from household chores. Access to electricity improves people’s living conditions in many ways.\\nThe World Bank data on the world map captures whether people have access to the _most basic⟨73⟩_ electricity supply — just enough to provide basic lighting and charge a phone or power a radio for 4 hours per day.\\nIt shows that, especially in several African countries, a large share of the population lacks the benefits that basic electricity offers. No radio and no light at night.\\nExplore and learn more about this data ⟨69⟩\\n![⟨74⟩](https://ourworldindata.org/<https:/ourworldindata.org/grapher/share-of-the-population-with-access-to-electricity?time=latest>)\\nExplore and learn more about this data ⟨69⟩\\n## Data explorers\\nSee all our Data Explorers ⟨75⟩\\nInteractive visualization tools to explore a wide range of related indicators.\\n![Icon for topic Poverty⟨76⟩Poverty Data Explorer](https://ourworldindata.org/<https:/ourworldindata.org/explorers/poverty-explorer>)![Icon for topic Population and Demographic Change⟨77⟩Population & Demography Data Explorer](https://ourworldindata.org/<https:/ourworldindata.org/explorers/population-and-demography>)![Icon for topic Global Health⟨78⟩Global Health Data Explorer](https://ourworldindata.org/<https:/ourworldindata.org/explorers/global-health>)![Icon for topic Energy⟨79⟩Energy Data Explorer](https://ourworldindata.org/<https:/ourworldindata.org/explorers/energy>)\\n## Subscribe to our newsletters\\nReceive our latest work by email.\\nDaily Data Insights\\nReceive our bite-sized insights on how the world is changing, every weekday.\\nBiweekly Digest\\nReceive an overview of our recent work and highlights of our other work every two weeks.\\nSubscribe\\nBy subscribing you are agreeing to the terms of our privacy policy⟨35⟩.\\n## Follow us\\n  * X⟨80⟩\\n  * Instagram⟨81⟩\\n  * Threads⟨82⟩\\n  * Facebook⟨83⟩\\n  * LinkedIn⟨84⟩\\n  * Bluesky⟨85⟩\\n  * GitHub⟨86⟩\\n  * Research & Writing⟨87⟩\\n  * Daily Data Insights⟨88⟩\\n\\n\\n## All our topics\\nAll our data, research, and writing — topic by topic.\\n## Population and Demographic Change\\n  * Population Change:\\n  * Population Growth⟨89⟩\\n  * Age Structure⟨90⟩\\n  * Gender Ratio⟨91⟩\\n  * Births and Deaths:\\n  * Life Expectancy⟨92⟩\\n  * Fertility Rate⟨93⟩\\n  * Child and Infant Mortality⟨94⟩\\n  * Geography of the World Population:\\n  * Urbanization⟨95⟩\\n  * Migration⟨96⟩\\n\\n\\n## Health\\n  * Life and Death:\\n  * Global Health⟨97⟩\\n  * Causes of Death⟨98⟩\\n  * Child and Infant Mortality⟨94⟩\\n  * Burden of Disease⟨99⟩\\n  * Life Expectancy⟨92⟩\\n  * Mental Health⟨100⟩\\n  * Suicides⟨101⟩\\n  * Cardiovascular Diseases⟨102⟩\\n  * Cancer⟨103⟩\\n  * Maternal Mortality⟨104⟩\\n  * Health Risks:\\n  * Air Pollution⟨105⟩\\n  * Outdoor Air Pollution⟨106⟩\\n  * Indoor Air Pollution⟨107⟩\\n  * Lead Pollution⟨108⟩\\n  * Alcohol Consumption⟨109⟩\\n  * Opioids, Cocaine, Cannabis, and Other Illicit Drugs⟨110⟩\\n  * Obesity⟨111⟩\\n  * Smoking⟨112⟩\\n  * Infectious Diseases:\\n  * Pandemics⟨113⟩\\n  * Coronavirus Pandemic (COVID-19)⟨114⟩\\n  * Malaria⟨115⟩\\n  * HIV/AIDS⟨116⟩\\n  * Diarrheal Diseases⟨117⟩\\n  * Tuberculosis⟨118⟩\\n  * Polio⟨119⟩\\n  * Neglected Tropical Diseases⟨120⟩\\n  * Influenza⟨121⟩\\n  * Pneumonia⟨122⟩\\n  * Tetanus⟨123⟩\\n  * Mpox⟨124⟩\\n  * Smallpox⟨125⟩\\n  * Health Institutions and Interventions:\\n  * Eradication of Diseases⟨126⟩\\n  * Vaccination⟨127⟩\\n  * Antibiotics and Antibiotic Resistance⟨128⟩\\n  * Healthcare Spending⟨129⟩\\n\\n\\n## Energy and Environment\\n  * Climate and Air:\\n  * Climate Change⟨130⟩\\n  * CO₂ and Greenhouse Gas Emissions⟨131⟩\\n  * Air Pollution⟨105⟩\\n  * Outdoor Air Pollution⟨106⟩\\n  * Indoor Air Pollution⟨107⟩\\n  * Ozone Layer⟨132⟩\\n  * Energy Systems:\\n  * Energy⟨133⟩\\n  * Access to Energy⟨134⟩\\n  * Fossil Fuels⟨135⟩\\n  * Renewable Energy⟨136⟩\\n  * Nuclear Energy⟨137⟩\\n  * Metals and Minerals⟨138⟩\\n  * Environment and Ecosystems:\\n  * Natural Disasters⟨139⟩\\n  * Biodiversity⟨140⟩\\n  * Environmental Impacts of Food Production⟨141⟩\\n  * Fish and Overfishing⟨142⟩\\n  * Land Use⟨143⟩\\n  * Water Use and Stress⟨144⟩\\n  * Forests and Deforestation⟨145⟩\\n  * Wildfires⟨146⟩\\n  * Animal Welfare⟨147⟩\\n  * Waste and Pollution:\\n  * Plastic Pollution⟨148⟩\\n  * Oil Spills⟨149⟩\\n  * Lead Pollution⟨108⟩\\n\\n\\n## Food and Agriculture\\n  * Food Production:\\n  * Agricultural Production⟨150⟩\\n  * Meat and Dairy Production⟨151⟩\\n  * Fish and Overfishing⟨142⟩\\n  * Crop Yields⟨152⟩\\n  * Animal Welfare⟨147⟩\\n  * Environmental Impacts of Food Production⟨141⟩\\n  * Farm Size and Productivity⟨153⟩\\n  * Agricultural Inputs:\\n  * Land Use⟨143⟩\\n  * Fertilizers⟨154⟩\\n  * Pesticides⟨155⟩\\n  * Employment in Agriculture⟨156⟩\\n  * Nutrition:\\n  * Hunger and Undernourishment⟨157⟩\\n  * Food Supply⟨158⟩\\n  * Food Prices⟨159⟩\\n  * Obesity⟨111⟩\\n  * Famines⟨160⟩\\n  * Diet Compositions⟨161⟩\\n  * Micronutrient Deficiency⟨162⟩\\n  * Human Height⟨163⟩\\n\\n\\n## Poverty and Economic Development\\n  * Poverty and Prosperity:\\n  * Poverty⟨164⟩\\n  * Economic Growth⟨165⟩\\n  * Economic Inequality⟨166⟩\\n  * Foreign Aid⟨167⟩\\n  * Economic Inequality by Gender⟨168⟩\\n  * Public Sector:\\n  * Government Spending⟨169⟩\\n  * State Capacity⟨170⟩\\n  * Taxation⟨171⟩\\n  * Corruption⟨172⟩\\n  * Healthcare Spending⟨129⟩\\n  * Education Spending⟨173⟩\\n  * Military Personnel and Spending⟨174⟩\\n  * Labor:\\n  * Women’s Employment⟨175⟩\\n  * Child Labor⟨176⟩\\n  * Working Hours⟨177⟩\\n  * Global Connections:\\n  * Trade and Globalization⟨178⟩\\n  * Migration⟨96⟩\\n  * Tourism⟨179⟩\\n  * Water:\\n  * Clean Water and Sanitation⟨180⟩\\n  * Clean Water⟨181⟩\\n  * Sanitation⟨182⟩\\n\\n\\n## Education and Knowledge\\n  * Education:\\n  * Global Education⟨183⟩\\n  * Literacy⟨184⟩\\n  * Education Spending⟨173⟩\\n  * Knowledge:\\n  * Research and Development⟨185⟩\\n  * Internet⟨186⟩\\n  * Books⟨187⟩\\n\\n\\n## Innovation and Technological Change\\n  * Technological Change⟨188⟩\\n  * Research and Development⟨185⟩\\n  * Artificial Intelligence⟨189⟩\\n  * Internet⟨186⟩\\n  * Space Exploration and Satellites⟨190⟩\\n  * Transport⟨191⟩\\n\\n\\n## Living Conditions, Community, and Wellbeing\\n  * Housing and Infrastructure:\\n  * Homelessness⟨192⟩\\n  * Access to Energy⟨134⟩\\n  * Indoor Air Pollution⟨107⟩\\n  * Clean Water and Sanitation⟨180⟩\\n  * Clean Water⟨181⟩\\n  * Sanitation⟨182⟩\\n  * Light at Night⟨193⟩\\n  * Time Use:\\n  * Time Use⟨194⟩\\n  * Working Hours⟨177⟩\\n  * Relationships:\\n  * Marriages and Divorces⟨195⟩\\n  * Loneliness and Social Connections⟨196⟩\\n  * Trust⟨197⟩\\n  * Happiness and Wellbeing:\\n  * Happiness and Life Satisfaction⟨198⟩\\n  * Human Development Index (HDI)⟨199⟩\\n\\n\\n## Human Rights and Democracy\\n  * Human Rights⟨200⟩\\n  * Democracy⟨201⟩\\n  * State Capacity⟨170⟩\\n  * Women’s Rights⟨202⟩\\n  * LGBT+ Rights⟨203⟩\\n  * Corruption⟨172⟩\\n  * Economic Inequality by Gender⟨168⟩\\n  * Child Labor⟨176⟩\\n  * Violence Against Children and Children’s Rights⟨204⟩\\n\\n\\n## Violence and War\\n  * War and Peace⟨205⟩\\n  * Nuclear Weapons⟨206⟩\\n  * Homicides⟨207⟩\\n  * Terrorism⟨208⟩\\n  * State Capacity⟨170⟩\\n  * Military Personnel and Spending⟨174⟩\\n  * Violence Against Children and Children’s Rights⟨204⟩\\n\\n\\n#### Our World in Data is free and accessible for everyone.\\nHelp us do this work by making a donation.\\nDonate now ⟨7⟩\\nOur World in Data is a project of Global Change Data Lab⟨209⟩, a nonprofit based in the UK (Reg. Charity No. 1186433). Our charts, articles, and data are licensed under CC BY⟨210⟩, unless stated otherwise. Tools and software we develop are open source under the MIT license⟨211⟩. Third-party materials, including some charts and data, are subject to third-party licenses. See our FAQs⟨212⟩ for more details.\\n![Oxford Martin School logo⟨2⟩](https://ourworldindata.org/<https:/www.oxfordmartin.ox.ac.uk/global-development>)![University of Oxford logo⟨3⟩](https://ourworldindata.org/<https:/www.ox.ac.uk>)![Global Change Data Lab logo⟨4⟩](https://ourworldindata.org/<https:/global-change-data-lab.org>)\\n![Y Combinator logo⟨213⟩](https://ourworldindata.org/<https:/www.ycombinator.com>)\\n##### Explore\\n  * Topics⟨214⟩\\n  * Data⟨5⟩\\n  * Insights⟨6⟩\\n\\n\\n##### Resources\\n  * Latest Articles⟨27⟩\\n  * SDG Trackers⟨215⟩\\n  * Teaching Materials⟨216⟩\\n\\n\\n##### About\\n  * About Us⟨217⟩\\n  * Organization⟨218⟩\\n  * Funding⟨219⟩\\n  * Team⟨220⟩\\n  * Jobs⟨221⟩\\n  * FAQs⟨212⟩\\n\\n\\n##### RSS Feeds\\n  * Research & Writing⟨87⟩\\n  * Daily Data Insights⟨88⟩\\n\\n\\n##### Follow us\\n[](https://ourworldindata.org/<https:/x.com/ourworldindata>)[](https://ourworldindata.org/<https:/www.instagram.com/ourworldindata/>)[](https://ourworldindata.org/<https:/www.threads.net/@ourworldindata>)[](https://ourworldindata.org/<https:/facebook.com/ourworldindata>)[](https://ourworldindata.org/<https:/www.linkedin.com/company/ourworldindata>)[](https://ourworldindata.org/<https:/bsky.app/profile/ourworldindata.org>)[](https://ourworldindata.org/<https:/github.com/owid>)\\n  * Privacy policy⟨35⟩\\n  * Legal disclaimer⟨222⟩\\n  * Grapher license⟨211⟩\\n\\n\\nSubscribe\\nLeave us feedback\\n**Have a question?** You may find an answer in:**General FAQ**⟨223⟩ or **Vaccinations FAQ**⟨224⟩\\nMessage\\nYour name\\nEmail addressYour name and email will only be used to reply to you and not for any other purpose. If you do not give a valid email, we will not be able to reply to you.\\nSend message\\nFeedback\\nWe use cookies to give you the best experience on our website.\\nBy agreeing, you consent to our use of cookies and other analytics tools according to our privacy policy⟨35⟩.\\nNo thanksI agree\\n' references_markdown='\\n\\n## References\\n\\n⟨1⟩ https://ourworldindata.org/</>: Our World in Data\\n⟨2⟩ https://ourworldindata.org/oms-logo.svg: ![Oxford Martin School logo\\n⟨3⟩ https://ourworldindata.org/oxford-logo.svg: ![Oxford logo\\n⟨4⟩ https://ourworldindata.org/gcdl-logo.svg: ![Global Change Data Lab logo\\n⟨5⟩ https://ourworldindata.org/</data>: Data\\n⟨6⟩ https://ourworldindata.org/</data-insights>: Insights\\n⟨7⟩ https://ourworldindata.org/</donate>: Donate\\n⟨8⟩ https://ourworldindata.org/<#>: Gdoc\\n⟨9⟩ https://ourworldindata.org/<https:/ourworldindata.org/co2-and-greenhouse-gas-emissions>: CO₂ Emissions\\n⟨10⟩ https://ourworldindata.org/<https:/ourworldindata.org/economic-inequality>: Economic Inequality\\n⟨11⟩ https://ourworldindata.org/<https:/ourworldindata.org/human-rights>: Human Rights\\n⟨12⟩ https://ourworldindata.org/<https:/ourworldindata.org/poverty>: Poverty\\n⟨13⟩ https://ourworldindata.org/<https:/ourworldindata.org/energy>: Energy\\n⟨14⟩ https://ourworldindata.org/<https:/ourworldindata.org/life-expectancy>: Life Expectancy\\n⟨15⟩ https://ourworldindata.org/<https:/ourworldindata.org/causes-of-death>: Causes of Death\\n⟨16⟩ https://ourworldindata.org/<https:/ourworldindata.org/population-growth>: Population Growth\\n⟨17⟩ https://ourworldindata.org/<https:/ourworldindata.org/coronavirus>: COVID-19\\n⟨18⟩ https://ourworldindata.org/<#all-topics>: 120 topics\\n⟨19⟩ https://ourworldindata.org/</problems-and-progress>: Read about our mission \\n⟨20⟩ https://ourworldindata.org/<#subscribe>: Subscribe to our newsletters \\n⟨21⟩ https://ourworldindata.org/media-logos.svg: Logos of the publications that have used our content. From left to right: Science, Nature, PNAS, BBC, Financial Times, The New York Times, The Guardian, The Atlantic, and The Washington Post\\n⟨22⟩ https://ourworldindata.org/cdn-cgi/imagedelivery/qLq-8BTgXU8yG0N6HnOy8g/2634177d-6b60-4df5-3152-c38263399f00/w=2400: ![Featured image\\n⟨23⟩ https://ourworldindata.org/cdn-cgi/imagedelivery/qLq-8BTgXU8yG0N6HnOy8g/4856b7da-8b2a-4218-7a2f-e18304c85200/w=1200: ![\\n⟨24⟩ https://ourworldindata.org/cdn-cgi/imagedelivery/qLq-8BTgXU8yG0N6HnOy8g/1a2ccaa1-7f25-4250-6151-acd5affb0400/w=2400: ![Featured image\\n⟨25⟩ https://ourworldindata.org/cdn-cgi/imagedelivery/qLq-8BTgXU8yG0N6HnOy8g/679eea1d-ea22-4824-cccd-6b2044447a00/w=4800: ![A photo of Max Roser and others marching through town as part of the ceremony for receiving an honorary doctorate from KU Leuven and UCLouvain in Belgium. The photo is copyright KU Leuven - Rob Stevens.\\n⟨26⟩ https://ourworldindata.org/cdn-cgi/imagedelivery/qLq-8BTgXU8yG0N6HnOy8g/58092c37-e5b8-42af-8d79-60234c162400/w=2400: ![A rectangular table with two rows and five columns. The first row contains colored blocks, starting from the left with a deep purple block, followed by a light purple, a pale lavender, and two shades of peach. The second row mirrors the first, repeating the same arrangement of colors.\\n⟨27⟩ https://ourworldindata.org/</latest>: See all our latest work \\n⟨28⟩ https://ourworldindata.org/cdn-cgi/imagedelivery/qLq-8BTgXU8yG0N6HnOy8g/35ea298e-048f-4c7e-3b97-717282c36f00/w=1620: ![A global map shows the share of mothers aged 20–44 who have lost a child under five years old. The data is categorized into four ranges: less than 1% \\\\(light yellow\\\\), 1% to 5% \\\\(yellow\\\\), 5% to 10% \\\\(orange\\\\), 10% to 30% \\\\(dark orange\\\\), and more than 30% \\\\(red\\\\). Higher rates are concentrated in Sub-Saharan Africa and parts of South Asia, while lower rates are seen in North America, Europe, and parts of East Asia. Data is sourced from Smith-Greenaway et al. \\\\(2021\\\\) and reflects single-year estimates between 2010 and 2018.\\n⟨29⟩ https://ourworldindata.org/cdn-cgi/imagedelivery/qLq-8BTgXU8yG0N6HnOy8g/b1a51929-5a19-40d6-5795-6770a75ca400/w=1620: ![The image presents a data visualization illustrating the number of animals killed for meat worldwide from 1961 to 2022. It is divided into four sections, each representing a different animal species:\\n1. **Chickens**: Shown in orange, the graph starts at zero in 1961 and rises sharply, reaching approximately 60 billion killed by 2022.\\n \\n2. **Pigs**: Displayed in green, this chart shows a more gradual increase, starting from zero in 1961 and peaking at around 1 billion killed by 2022.\\n3. **Sheep and Goats**: Presented in blue, this line shows a steady rise from zero in 1961 to nearly 400 million by 2022, with a peak near 1 billion.\\n4. **Cows**: Illustrated in dark green, this graph shows a slow but consistent increase from zero to about 300 million killed by 2022.\\nEach section has a label indicating the species and the number of animals on the vertical axis, while the horizontal axis marks the years from 1961 to 2022. The bottom of the image references the data source as the Food and Agriculture Organization of the UN from 2023, with a CC BY attribution.\\n⟨30⟩ https://ourworldindata.org/cdn-cgi/imagedelivery/qLq-8BTgXU8yG0N6HnOy8g/cec7f9e1-f521-427f-b314-07d03ed0c900/w=1620: ![A bar chart titled \"Global sales of combustion engine cars have peaked,\" showing annual car sales from 2010 to 2023. The chart highlights that combustion engine car sales peaked in 2017/18 and have declined since, while electric car sales \\\\(in orange\\\\) have steadily risen. Total car sales hover around 70–80 million annually, with electric cars making a growing share of the market from 2018 onward. Data source: International Energy Agency, Global EV Outlook 2024. Note: Electric cars include fully battery-electric and plug-in hybrids.\\n⟨31⟩ https://ourworldindata.org/cdn-cgi/imagedelivery/qLq-8BTgXU8yG0N6HnOy8g/57dcc03f-4cff-498a-67d0-3d0d82101600/w=1620: ![A data visualization titled \"Nine Asian countries where child mortality has halved since 2000.\" The chart shows the estimated percentage of newborns dying before age five in nine countries: Afghanistan \\\\(13% in 2000 to 6% in 2022\\\\), Cambodia \\\\(11% to 2%\\\\), Laos \\\\(11% to 4%\\\\), Bangladesh \\\\(9% to 3%\\\\), Myanmar \\\\(9% to 4%\\\\), India \\\\(9% to 3%\\\\), Nepal \\\\(8% to 3%\\\\), Indonesia \\\\(5% to 2%\\\\), and China \\\\(4% to 1%\\\\). Each country is represented by a line graph showing a significant decline in child mortality over time. Data source: UN Inter-agency Group for Child Mortality Estimation \\\\(2024\\\\), CC BY.\\n⟨32⟩ https://ourworldindata.org/cdn-cgi/imagedelivery/qLq-8BTgXU8yG0N6HnOy8g/210e8bd4-d29f-4512-59ba-851758cdb500/w=1620: ![An infographic titled \"Most livestock in the United States are factory-farmed.\" It lists the percentages and numbers of animals raised in factory farms, defined by the EPA as operations with intensive feeding for over 45 days. Chickens: 99.96%, 9.2 billion; Turkeys: 99.8%, 260 million; Farmed fish: 100%, 530 million; Cows: 75%, 66 million; Egg-laying hens: 98.3%, 380 million; Pigs: 98.6%, 73 million. Data source: Sentience Institute \\\\(2024\\\\), with data from 2022.\\n⟨33⟩ https://ourworldindata.org/cdn-cgi/imagedelivery/qLq-8BTgXU8yG0N6HnOy8g/ca552284-d32e-481b-d8b3-d5423210ae00/w=1620: ![A line graph depicting the most common birth month in France from 1861 to 2022, with the horizontal axis representing months from January to December and the vertical axis indicating years. Each year shows a line indicating the month with the highest average birth rate per day, with varying colors representing different time periods. \\nIn the late 19th and early 20th centuries, lines often cluster around spring months, indicating this as the most common season for births. Disruptions during World Wars I and II are noted, as birth rates shifted temporarily. Since the late 20th century, the trend has changed, with late summer and autumn months becoming the most common for births.\\nThe data source is the Human Mortality Database \\\\(2024\\\\) and the chart is published on OurWorldinData.org, and is licensed under CC-BY by the authors, Saloni Dattani and Lucas Rodés-Guirao.\\n⟨34⟩ https://ourworldindata.org/cdn-cgi/imagedelivery/qLq-8BTgXU8yG0N6HnOy8g/ace263e5-3c73-4493-4358-05e3b503d000/w=1620: ![A line graph titled \"Foreign aid given as a share of national income, DAC Countries\" illustrates the trend of official development assistance \\\\(ODA\\\\) as a percentage of gross national income from 1960 to 2023. The vertical axis represents the percentage of national income, ranging from 0% to 0.5%, while the horizontal axis indicates the years from 1960 to 2023. \\nThe graph shows a decline in foreign aid from approximately 0.49% in 1960, followed by fluctuations, hitting a low of about 0.21% around the year 2000. After this low point, there is a gradual increase, reaching 0.37% in 2023. Two data points are highlighted: 0.49% at the start, and 0.21% around 2000, marking significant moments in the timeline.\\nIn the graph, \"DAC countries\" is noted as major aid donors in the OECD, with a credit to the data source, which is the OECD for the year 2024. The visual is copyrighted under CC BY.\\n⟨35⟩ https://ourworldindata.org/</privacy-policy>: privacy policy\\n⟨36⟩ https://ourworldindata.org/<https:/ourworldindata.org/much-better-awful-can-be-better>: extremely common\\n⟨37⟩ https://ourworldindata.org/<https:/ourworldindata.org/child-mortality-big-problem-in-brief>: is possible\\n⟨38⟩ https://ourworldindata.org/<https:/ourworldindata.org/financing-healthcare>: good healthcare\\n⟨39⟩ https://ourworldindata.org/<https:/ourworldindata.org/hunger-and-undernourishment>: good nutrition\\n⟨40⟩ https://ourworldindata.org/<https:/ourworldindata.org/clean-water-sanitation>: clean water and sanitation\\n⟨41⟩ https://ourworldindata.org/<https:/ourworldindata.org/maternal-mortality>: maternal health\\n⟨42⟩ https://ourworldindata.org/<https:/ourworldindata.org/economic-growth>: living standards\\n⟨43⟩ https://ourworldindata.org/<https:/ourworldindata.org/child-mortality>: child mortality\\n⟨44⟩ https://ourworldindata.org/<https:/ourworldindata.org/grapher/child-mortality?time=earliest..latest>: Explore and learn more about this data \\n⟨45⟩ https://ourworldindata.org/grapher/child-mortality.png?time=earliest..latest: ![\\n⟨46⟩ https://ourworldindata.org/<https:/ourworldindata.org/grapher/share-of-population-in-extreme-poverty>: Share of population living in extreme povertyWorld Bank\\n⟨47⟩ https://ourworldindata.org/<https:/ourworldindata.org/extreme-poverty-in-brief>: the majority\\n⟨48⟩ https://ourworldindata.org/<https:/ourworldindata.org/what-is-economic-growth>: makes it possible\\n⟨49⟩ https://ourworldindata.org/grapher/share-of-population-in-extreme-poverty.png: ![\\n⟨50⟩ https://ourworldindata.org/<https:/ourworldindata.org/grapher/life-expectancy>: Life expectancy at birthLong-run estimates collated from multiple sources by Our World in Data\\n⟨51⟩ https://ourworldindata.org/<https:/ourworldindata.org/life-expectancy-globally>: around the world\\n⟨52⟩ https://ourworldindata.org/<https:/ourworldindata.org/its-not-just-about-child-mortality-life-expectancy-improved-at-all-ages>: at all ages\\n⟨53⟩ https://ourworldindata.org/grapher/life-expectancy.png: ![\\n⟨54⟩ https://ourworldindata.org/<https:/ourworldindata.org/grapher/co-emissions-per-capita?tab=chart&country=USA~GBR~CHN~ZAF~PAN>: Per capita CO₂ emissionsLong-run estimates from the Global Carbon Budget\\n⟨55⟩ https://ourworldindata.org/<https:/ourworldindata.org/explorers/climate-change>: climate change\\n⟨56⟩ https://ourworldindata.org/<https:/ourworldindata.org/explorers/co2?facet=none&country=CHN~USA~IND~FRA&Gas+or+Warming=CO%E2%82%82&Accounting=Consumption-based&Fuel+or+Land+Use+Change=All+fossil+emissions&Count=Per+capita>: Greenhouse Gas Emissions Data Explorer\\n⟨57⟩ https://ourworldindata.org/grapher/co-emissions-per-capita.png?tab=chart&country=USA~GBR~CHN~ZAF~PAN: ![\\n⟨58⟩ https://ourworldindata.org/<https:/ourworldindata.org/grapher/gdp-per-capita-maddison-project-database>: GDP per capitaLong-run estimates from the Maddison Project Database\\n⟨59⟩ https://ourworldindata.org/<https:/ourworldindata.org/extreme-history-methods>: were poor\\n⟨60⟩ https://ourworldindata.org/<https:/ourworldindata.org/breaking-the-malthusian-trap>: to leave\\n⟨61⟩ https://ourworldindata.org/grapher/gdp-per-capita-maddison-project-database.png: ![\\n⟨62⟩ https://ourworldindata.org/<https:/ourworldindata.org/grapher/prevalence-of-undernourishment>: Share of people that are undernourishedFAO\\n⟨63⟩ https://ourworldindata.org/<https:/ourworldindata.org/famines>: famines\\n⟨64⟩ https://ourworldindata.org/grapher/prevalence-of-undernourishment.png: ![\\n⟨65⟩ https://ourworldindata.org/<https:/ourworldindata.org/grapher/cross-country-literacy-rates?country=RUS~GBR~NLD~CRI~ISR~SGP~CHL~CHN~MAC~OWID_WRL~IND~TZA>: Literacy rateLong-run estimates collated from multiple sources by Our World in Data\\n⟨66⟩ https://ourworldindata.org/<https:/ourworldindata.org/better-learning>: it remains\\n⟨67⟩ https://ourworldindata.org/<https:/ourworldindata.org/how-is-literacy-measured>: we investigated\\n⟨68⟩ https://ourworldindata.org/grapher/cross-country-literacy-rates.png?country=RUS~GBR~NLD~CRI~ISR~SGP~CHL~CHN~MAC~OWID_WRL~IND~TZA: ![\\n⟨69⟩ https://ourworldindata.org/<https:/ourworldindata.org/grapher/share-of-the-population-with-access-to-electricity?time=latest>: Share of the population with access to electricityWorld Bank\\n⟨70⟩ https://ourworldindata.org/<https:/ourworldindata.org/light-at-night>: Light at night\\n⟨71⟩ https://ourworldindata.org/<https:/ourworldindata.org/grapher/mobile-cellular-subscriptions-per-100-people>: mobile phones\\n⟨72⟩ https://ourworldindata.org/<https:/ourworldindata.org/grapher/technology-adoption-by-households-in-the-united-states>: household appliances\\n⟨73⟩ https://ourworldindata.org/<https:/ourworldindata.org/definition-electricity-access>: most basic\\n⟨74⟩ https://ourworldindata.org/grapher/share-of-the-population-with-access-to-electricity.png?time=latest: ![\\n⟨75⟩ https://ourworldindata.org/</explorers>: See all our Data Explorers \\n⟨76⟩ https://ourworldindata.org/images/tag-icons/Poverty.svg: ![Icon for topic Poverty\\n⟨77⟩ https://ourworldindata.org/images/tag-icons/Population%20and%20Demographic%20Change.svg: ![Icon for topic Population and Demographic Change\\n⟨78⟩ https://ourworldindata.org/images/tag-icons/Global%20Health.svg: ![Icon for topic Global Health\\n⟨79⟩ https://ourworldindata.org/images/tag-icons/Energy.svg: ![Icon for topic Energy\\n⟨80⟩ https://ourworldindata.org/<https:/x.com/ourworldindata>: X\\n⟨81⟩ https://ourworldindata.org/<https:/www.instagram.com/ourworldindata/>: Instagram\\n⟨82⟩ https://ourworldindata.org/<https:/www.threads.net/@ourworldindata>: Threads\\n⟨83⟩ https://ourworldindata.org/<https:/facebook.com/ourworldindata>: Facebook\\n⟨84⟩ https://ourworldindata.org/<https:/www.linkedin.com/company/ourworldindata>: LinkedIn\\n⟨85⟩ https://ourworldindata.org/<https:/bsky.app/profile/ourworldindata.org>: Bluesky\\n⟨86⟩ https://ourworldindata.org/<https:/github.com/owid>: GitHub\\n⟨87⟩ https://ourworldindata.org/</atom.xml>: Research & Writing\\n⟨88⟩ https://ourworldindata.org/</atom-data-insights.xml>: Daily Data Insights\\n⟨89⟩ https://ourworldindata.org/</population-growth>: Population Growth\\n⟨90⟩ https://ourworldindata.org/</age-structure>: Age Structure\\n⟨91⟩ https://ourworldindata.org/</gender-ratio>: Gender Ratio\\n⟨92⟩ https://ourworldindata.org/</life-expectancy>: Life Expectancy\\n⟨93⟩ https://ourworldindata.org/</fertility-rate>: Fertility Rate\\n⟨94⟩ https://ourworldindata.org/</child-mortality>: Child and Infant Mortality\\n⟨95⟩ https://ourworldindata.org/</urbanization>: Urbanization\\n⟨96⟩ https://ourworldindata.org/</migration>: Migration\\n⟨97⟩ https://ourworldindata.org/</health-meta>: Global Health\\n⟨98⟩ https://ourworldindata.org/</causes-of-death>: Causes of Death\\n⟨99⟩ https://ourworldindata.org/</burden-of-disease>: Burden of Disease\\n⟨100⟩ https://ourworldindata.org/</mental-health>: Mental Health\\n⟨101⟩ https://ourworldindata.org/</suicide>: Suicides\\n⟨102⟩ https://ourworldindata.org/</cardiovascular-diseases>: Cardiovascular Diseases\\n⟨103⟩ https://ourworldindata.org/</cancer>: Cancer\\n⟨104⟩ https://ourworldindata.org/</maternal-mortality>: Maternal Mortality\\n⟨105⟩ https://ourworldindata.org/</air-pollution>: Air Pollution\\n⟨106⟩ https://ourworldindata.org/</outdoor-air-pollution>: Outdoor Air Pollution\\n⟨107⟩ https://ourworldindata.org/</indoor-air-pollution>: Indoor Air Pollution\\n⟨108⟩ https://ourworldindata.org/</lead-pollution>: Lead Pollution\\n⟨109⟩ https://ourworldindata.org/</alcohol-consumption>: Alcohol Consumption\\n⟨110⟩ https://ourworldindata.org/</illicit-drug-use>: Opioids, Cocaine, Cannabis, and Other Illicit Drugs\\n⟨111⟩ https://ourworldindata.org/</obesity>: Obesity\\n⟨112⟩ https://ourworldindata.org/</smoking>: Smoking\\n⟨113⟩ https://ourworldindata.org/</pandemics>: Pandemics\\n⟨114⟩ https://ourworldindata.org/</coronavirus>: Coronavirus Pandemic (COVID-19)\\n⟨115⟩ https://ourworldindata.org/</malaria>: Malaria\\n⟨116⟩ https://ourworldindata.org/</hiv-aids>: HIV/AIDS\\n⟨117⟩ https://ourworldindata.org/</diarrheal-diseases>: Diarrheal Diseases\\n⟨118⟩ https://ourworldindata.org/</tuberculosis>: Tuberculosis\\n⟨119⟩ https://ourworldindata.org/</polio>: Polio\\n⟨120⟩ https://ourworldindata.org/</neglected-tropical-diseases>: Neglected Tropical Diseases\\n⟨121⟩ https://ourworldindata.org/</influenza>: Influenza\\n⟨122⟩ https://ourworldindata.org/</pneumonia>: Pneumonia\\n⟨123⟩ https://ourworldindata.org/</tetanus>: Tetanus\\n⟨124⟩ https://ourworldindata.org/</monkeypox>: Mpox\\n⟨125⟩ https://ourworldindata.org/</smallpox>: Smallpox\\n⟨126⟩ https://ourworldindata.org/</eradication-of-diseases>: Eradication of Diseases\\n⟨127⟩ https://ourworldindata.org/</vaccination>: Vaccination\\n⟨128⟩ https://ourworldindata.org/</antibiotics>: Antibiotics and Antibiotic Resistance\\n⟨129⟩ https://ourworldindata.org/</financing-healthcare>: Healthcare Spending\\n⟨130⟩ https://ourworldindata.org/</climate-change>: Climate Change\\n⟨131⟩ https://ourworldindata.org/</co2-and-greenhouse-gas-emissions>: CO₂ and Greenhouse Gas Emissions\\n⟨132⟩ https://ourworldindata.org/</ozone-layer>: Ozone Layer\\n⟨133⟩ https://ourworldindata.org/</energy>: Energy\\n⟨134⟩ https://ourworldindata.org/</energy-access>: Access to Energy\\n⟨135⟩ https://ourworldindata.org/</fossil-fuels>: Fossil Fuels\\n⟨136⟩ https://ourworldindata.org/</renewable-energy>: Renewable Energy\\n⟨137⟩ https://ourworldindata.org/</nuclear-energy>: Nuclear Energy\\n⟨138⟩ https://ourworldindata.org/</metals-minerals>: Metals and Minerals\\n⟨139⟩ https://ourworldindata.org/</natural-disasters>: Natural Disasters\\n⟨140⟩ https://ourworldindata.org/</biodiversity>: Biodiversity\\n⟨141⟩ https://ourworldindata.org/</environmental-impacts-of-food>: Environmental Impacts of Food Production\\n⟨142⟩ https://ourworldindata.org/</fish-and-overfishing>: Fish and Overfishing\\n⟨143⟩ https://ourworldindata.org/</land-use>: Land Use\\n⟨144⟩ https://ourworldindata.org/</water-use-stress>: Water Use and Stress\\n⟨145⟩ https://ourworldindata.org/</forests-and-deforestation>: Forests and Deforestation\\n⟨146⟩ https://ourworldindata.org/</wildfires>: Wildfires\\n⟨147⟩ https://ourworldindata.org/</animal-welfare>: Animal Welfare\\n⟨148⟩ https://ourworldindata.org/</plastic-pollution>: Plastic Pollution\\n⟨149⟩ https://ourworldindata.org/</oil-spills>: Oil Spills\\n⟨150⟩ https://ourworldindata.org/</agricultural-production>: Agricultural Production\\n⟨151⟩ https://ourworldindata.org/</meat-production>: Meat and Dairy Production\\n⟨152⟩ https://ourworldindata.org/</crop-yields>: Crop Yields\\n⟨153⟩ https://ourworldindata.org/</farm-size>: Farm Size and Productivity\\n⟨154⟩ https://ourworldindata.org/</fertilizers>: Fertilizers\\n⟨155⟩ https://ourworldindata.org/</pesticides>: Pesticides\\n⟨156⟩ https://ourworldindata.org/</employment-in-agriculture>: Employment in Agriculture\\n⟨157⟩ https://ourworldindata.org/</hunger-and-undernourishment>: Hunger and Undernourishment\\n⟨158⟩ https://ourworldindata.org/</food-supply>: Food Supply\\n⟨159⟩ https://ourworldindata.org/</food-prices>: Food Prices\\n⟨160⟩ https://ourworldindata.org/</famines>: Famines\\n⟨161⟩ https://ourworldindata.org/</diet-compositions>: Diet Compositions\\n⟨162⟩ https://ourworldindata.org/</micronutrient-deficiency>: Micronutrient Deficiency\\n⟨163⟩ https://ourworldindata.org/</human-height>: Human Height\\n⟨164⟩ https://ourworldindata.org/</poverty>: Poverty\\n⟨165⟩ https://ourworldindata.org/</economic-growth>: Economic Growth\\n⟨166⟩ https://ourworldindata.org/</economic-inequality>: Economic Inequality\\n⟨167⟩ https://ourworldindata.org/</foreign-aid>: Foreign Aid\\n⟨168⟩ https://ourworldindata.org/</economic-inequality-by-gender>: Economic Inequality by Gender\\n⟨169⟩ https://ourworldindata.org/</government-spending>: Government Spending\\n⟨170⟩ https://ourworldindata.org/</state-capacity>: State Capacity\\n⟨171⟩ https://ourworldindata.org/</taxation>: Taxation\\n⟨172⟩ https://ourworldindata.org/</corruption>: Corruption\\n⟨173⟩ https://ourworldindata.org/</financing-education>: Education Spending\\n⟨174⟩ https://ourworldindata.org/</military-personnel-spending>: Military Personnel and Spending\\n⟨175⟩ https://ourworldindata.org/</female-labor-supply>: Women’s Employment\\n⟨176⟩ https://ourworldindata.org/</child-labor>: Child Labor\\n⟨177⟩ https://ourworldindata.org/</working-hours>: Working Hours\\n⟨178⟩ https://ourworldindata.org/</trade-and-globalization>: Trade and Globalization\\n⟨179⟩ https://ourworldindata.org/</tourism>: Tourism\\n⟨180⟩ https://ourworldindata.org/</clean-water-sanitation>: Clean Water and Sanitation\\n⟨181⟩ https://ourworldindata.org/</water-access>: Clean Water\\n⟨182⟩ https://ourworldindata.org/</sanitation>: Sanitation\\n⟨183⟩ https://ourworldindata.org/</global-education>: Global Education\\n⟨184⟩ https://ourworldindata.org/</literacy>: Literacy\\n⟨185⟩ https://ourworldindata.org/</research-and-development>: Research and Development\\n⟨186⟩ https://ourworldindata.org/</internet>: Internet\\n⟨187⟩ https://ourworldindata.org/</books>: Books\\n⟨188⟩ https://ourworldindata.org/</technological-change>: Technological Change\\n⟨189⟩ https://ourworldindata.org/</artificial-intelligence>: Artificial Intelligence\\n⟨190⟩ https://ourworldindata.org/</space-exploration-satellites>: Space Exploration and Satellites\\n⟨191⟩ https://ourworldindata.org/</transport>: Transport\\n⟨192⟩ https://ourworldindata.org/</homelessness>: Homelessness\\n⟨193⟩ https://ourworldindata.org/</light-at-night>: Light at Night\\n⟨194⟩ https://ourworldindata.org/</time-use>: Time Use\\n⟨195⟩ https://ourworldindata.org/</marriages-and-divorces>: Marriages and Divorces\\n⟨196⟩ https://ourworldindata.org/</social-connections-and-loneliness>: Loneliness and Social Connections\\n⟨197⟩ https://ourworldindata.org/</trust>: Trust\\n⟨198⟩ https://ourworldindata.org/</happiness-and-life-satisfaction>: Happiness and Life Satisfaction\\n⟨199⟩ https://ourworldindata.org/</human-development-index>: Human Development Index (HDI)\\n⟨200⟩ https://ourworldindata.org/</human-rights>: Human Rights\\n⟨201⟩ https://ourworldindata.org/</democracy>: Democracy\\n⟨202⟩ https://ourworldindata.org/</women-rights>: Women’s Rights\\n⟨203⟩ https://ourworldindata.org/</lgbt-rights>: LGBT+ Rights\\n⟨204⟩ https://ourworldindata.org/</violence-against-rights-for-children>: Violence Against Children and Children’s Rights\\n⟨205⟩ https://ourworldindata.org/</war-and-peace>: War and Peace\\n⟨206⟩ https://ourworldindata.org/</nuclear-weapons>: Nuclear Weapons\\n⟨207⟩ https://ourworldindata.org/</homicides>: Homicides\\n⟨208⟩ https://ourworldindata.org/</terrorism>: Terrorism\\n⟨209⟩ https://ourworldindata.org/<https:/global-change-data-lab.org/>: Global Change Data Lab\\n⟨210⟩ https://ourworldindata.org/<https:/creativecommons.org/licenses/by/4.0/>: CC BY\\n⟨211⟩ https://ourworldindata.org/<https:/github.com/owid/owid-grapher/blob/master/LICENSE.md>: MIT license\\n⟨212⟩ https://ourworldindata.org/</faqs>: FAQs\\n⟨213⟩ https://ourworldindata.org/yc-logo.svg: ![Y Combinator logo\\n⟨214⟩ https://ourworldindata.org/</#all-topics>: Topics\\n⟨215⟩ https://ourworldindata.org/</sdgs>: SDG Trackers\\n⟨216⟩ https://ourworldindata.org/</teaching>: Teaching Materials\\n⟨217⟩ https://ourworldindata.org/</about>: About Us\\n⟨218⟩ https://ourworldindata.org/</organization>: Organization\\n⟨219⟩ https://ourworldindata.org/</funding>: Funding\\n⟨220⟩ https://ourworldindata.org/</team>: Team\\n⟨221⟩ https://ourworldindata.org/</jobs>: Jobs\\n⟨222⟩ https://ourworldindata.org/</organization#legal-disclaimer>: Legal disclaimer\\n⟨223⟩ https://ourworldindata.org/<https:/ourworldindata.org/faqs>: **General FAQ**\\n⟨224⟩ https://ourworldindata.org/<https:/ourworldindata.org/covid-vaccinations#frequently-asked-questions>: **Vaccinations FAQ**\\n' fit_markdown='' fit_html=''",
  "generated_description": "**Our World in Data: Summary**\n\nFounded in 2013 as a part of Y Combinator's Batch W19, Our World in Data is based in Oxford, UK. This nonprofit focuses on harnessing research and data to tackle some of the world’s most pressing challenges—think poverty, disease, climate change, and inequality. With a committed team of 19 employees, their mission is clear: make information about critical global issues both accessible and understandable.\n\nAt its core, Our World in Data provides an incredible array of interactive data visualizations that help users grasp where the world is making progress and where it is falling behind. With over **13,000 charts across 120 topics**, the platform covers everything from CO₂ emissions to economic disparities and is widely recognized and cited by researchers and media outlets.\n\nThe platform is completely free and, as an open-source project, it serves as a vital tool for various stakeholders—from policymakers to educators and changemakers—who seek to drive meaningful impact in their communities and beyond.\n\nEvery month, millions of users turn to Our World in Data to make sense of complex global trends. They explore not just the data but also insights into why certain changes occur, enabling them to understand better how to contribute to a better future.\n\nYou can explore their full offerings and latest updates at [Our World in Data](https://ourworldindata.org/).\n\n**Key Points:**\n- **Foundation Year:** 2013\n- **Location:** Oxford, UK\n- **Mission:** Provide research and data to combat significant global issues.\n- **Content:** Over 13,000 interactive charts across 120 topics.\n- **Audience:** Millions of monthly users, including researchers and the general public.\n- **Access:** Free and open-source. \n- **Funding:** Supported by donations and operates as a nonprofit.\n\nIf you find their work valuable, consider supporting them through donations to help continue this essential mission."
}