{
  "links": "https://www.ycombinator.com/companies/payhippo",
  "name": "Payhippo",
  "headline": "Loans to Nigeria's SMEs in under 3 hours",
  "batch": "S21",
  "description": "Payhippo provides loans to small businesses in Africa in under 3 hours.\r\n\nWe made $42k in revenue in Nigeria in July 2021, growing 25% m/m with a 97% repayment rate.",
  "activity_status": "Active",
  "website": "https://payhippo.africa/",
  "founded_date": 2019.0,
  "team_size": 11.0,
  "location": "Lagos, Nigeria",
  "group_partner": null,
  "group_partner_yc": null,
  "company_linkedin": null,
  "company_twitter": null,
  "tags": "industry:fintech",
  "founders": [
    {
      "name": "Zach Bijesse, Founder",
      "description": "Hi everyone! I'm Zach. My favorite thing in the world is music (been playing guitar for 15 years).\nI used to be a certified weight loss specialist to pay the bills in undergrad. Started a mobile health app at the end of undergrad. \n\nBut I also did a lot of activism. I'm most proud of creating this campaign: https://www.nytimes.com/2014/01/28/opinion/bruni-emilios-great-race.html\n\nThen started teaching in Manhattan to learn about impact in education.\n\nDown to talk with fellow founders!",
      "linkedin": "https://linkedin.com/in/zbijesse"
    },
    {
      "name": "Uche Nnadi, Founder",
      "description": "Build | Grow | Accelerate",
      "linkedin": "https://www.linkedin.com/in/nnadi/"
    },
    {
      "name": "Chioma Okotcha, Founder",
      "description": "Whether I'm building a company, analysing policies or leading a flag-football team in a league, I'm driven to make a difference/learn something. This could be profit, impact or winning the league championship. \n\nHappy to chat and connect.",
      "linkedin": "https://www.linkedin.com/in/chiomaokotcha/"
    }
  ],
  "status": true,
  "markdown": null,
  "generated_description": "Payhippo is a fintech company based in Lagos, Nigeria, focused on providing swift loans to small and medium-sized enterprises (SMEs) across Africa, completing transactions in under three hours. Founded in 2019 and part of Y Combinator's Summer 2021 batch, Payhippo has made a significant impact in the lending space.\n\nAs of July 2021, the company reported a solid revenue figure of $42,000 in Nigeria, showcasing a robust month-over-month growth of 25%. Their impressive 97% repayment rate speaks volumes about their customer reliability and the effectiveness of their loan products.\n\nWith a lean team of 11 employees, Payhippo is tapping into the critical need for accessible financing solutions for SMEs in Nigeria, helping businesses overcome the common financing hurdles that can stifle growth. Although specifics about their current initiatives are not mentioned, it’s clear that they're focused on refining their services to empower more businesses.\n\nFor more information, you can check out their website at [Payhippo](https://payhippo.africa/). Overall, this company epitomizes how technology can facilitate financial services, making it easier for businesses in Africa to get the support they need, fast."
}