{
  "links": "https://www.ycombinator.com/companies/pesto",
  "name": "Pesto",
  "headline": null,
  "batch": "W21",
  "description": null,
  "activity_status": "Active",
  "website": "https://www.getpesto.com/",
  "founded_date": null,
  "team_size": 8.0,
  "location": "San Francisco",
  "group_partner": "Jared Friedman",
  "group_partner_yc": "https://www.ycombinator.com/people/jared-friedman",
  "company_linkedin": null,
  "company_twitter": null,
  "tags": "industry:fintech; location:san-francisco-bay-area",
  "founders": [],
  "status": true,
  "markdown": "raw_markdown=\"[](https://www.getpesto.com/</app>)\\nBusinessConsumerCardholdersFund Over Time\\nWhoops! An error occurred.\\nError:\\nWe're sorry, but an unexpected error has occurred. Please try reloading the page. If the issue persists, contact our support team for assistance.\\nGo Back\\n\" markdown_with_citations=\"[](https://www.getpesto.com/</app>)\\nBusinessConsumerCardholdersFund Over Time\\nWhoops! An error occurred.\\nError:\\nWe're sorry, but an unexpected error has occurred. Please try reloading the page. If the issue persists, contact our support team for assistance.\\nGo Back\\n\" references_markdown='\\n\\n## References\\n\\n' fit_markdown='' fit_html=''",
  "generated_description": "Pesto is an emerging fintech startup based in San Francisco, part of Y Combinator's Winter 2021 batch. With a compact team of eight employees, the company is making waves in the financial technology sector.\n\nWhile specific details about Pesto's mission and founding timeline were not provided, their presence in the Y Combinator ecosystem hints at their potential for innovation and growth. This affiliation often signifies a focus on building scalable solutions or enhancing financial services, aimed at both businesses and consumers.\n\nThe company is currently navigating its development, as indicated by some technical issues on their website. This could be a typical startup phase, where they're iterating on their product and infrastructure.\n\nJared Friedman, a noted figure in the startup community, serves as their Group Partner, which could provide them valuable insights and connections as they grow.\n\nIn summary, Pesto is a small but significant player in the fintech space—an exciting prospect worth keeping an eye on as they refine their offerings. You can check them out at [getpesto.com](https://www.getpesto.com/)."
}