{
  "links": "https://www.ycombinator.com/companies/promakhos-therapeutics",
  "name": "Promakhos Therapeutics",
  "headline": "A therapeutics platform for curing inflammatory disorders",
  "batch": "S21",
  "description": "We are building a platform of bacterial molecules to awaken our body’s innate ability to control inflammation and heal. Our first indication is Crohn’s Disease, which affects over 500,000 Americans at an annual cost of $10B. After Crohn's disease, we are going for type 1 Diabetes and Multiple Sclerosis.",
  "activity_status": "Active",
  "website": "https://www.promakhos.com/",
  "founded_date": 2021.0,
  "team_size": 2.0,
  "location": "Boston",
  "group_partner": null,
  "group_partner_yc": null,
  "company_linkedin": null,
  "company_twitter": null,
  "tags": "industry:therapeutics; location:boston",
  "founders": [
    {
      "name": "Katerina Chatzi, Founder",
      "description": "I believe we can discover unexpected things that can transform our lives. I have lived and performed research in 4 countries and 2 continents. Previously I was a postdoc at Harvard. I founded Promakhos because I think we have given to “autoimmune” diseases a grossly misleading name and we treat them in a primitive way. Promakhos means the first to enter a battle. In ancient Greece Promakhos was the strongest to put in the front line of an army so that they will not even have to start a battle.",
      "linkedin": "https://www.linkedin.com/in/katerina-chatzi-phd-366625179/"
    },
    {
      "name": "Jasper Edgar Neggers, Founder",
      "description": "In 2009, Jasper built a web-shop in the Netherlands. He then received a BSc, MSc and PhD in Biomedical Sciences from KU Leuven (Belgium). He pioneered the use of XPO1 inhibitors for treating cancer and invented a CRISPR-directed evolution technology for drug target deconvolution. Jasper then joined the Dana-Farber Cancer Institute and Broad Institute of MIT and Harvard to identify and validate new drug targets for gastrointestinal cancers. Now, he is developing drugs for chronic inflammation.",
      "linkedin": "https://www.linkedin.com/in/jasperneggers"
    }
  ],
  "status": true,
  "markdown": "raw_markdown=\"[![](https://cdn.prod.website-files.com/5f08987a4affa2787555ddd9/608cc5978103db993b192ca7_Promakhos%20Therapeutics.png)](https://www.promakhos.com/<#Landing>)\\n[Team](https://www.promakhos.com/<#Team>)[News](https://www.promakhos.com/<#News>)[Support](https://www.promakhos.com/<#Support>)[Contact](https://www.promakhos.com/<#Contact>)\\n![A calm and blue sea with very small waves.](https://cdn.prod.website-files.com/5f08987a4affa2787555ddd9/608d7f4e85a59564fc1d4aca_CC0%20-%20Public%20Domain%20Image%20Bird%20Eye%20View%20of%20Ocean-Resized.jpg)\\nOur body has the ability to defend and heal.We want to make it work for everyone. \\n# Transforming autoinflammatory disease treatment\\nThough inflammation is normally a healthy part of the body’s response to injury or infection, some people experience a dysfunctional immune response. The resulting chronic inflammation can damage the body and lead to further disease. Current therapies for chronic inflammatory diseases such as Crohn’s disease, multiple sclerosis, and ankylosing spondylitis often work by suppressing the immune system, and treat symptoms rather than addressing the root causes of the disease. However, only 25% of patients benefit from these therapies long term. What if – instead of working against the immune system – we figured out how to restore its balance and function?Promakhos Therapeutics aims to do just this. Founded in the spring of 2021 and based in Boston, Massachusetts, we develop transformative therapies that restore the function of the immune system, allowing the body to control inflammation and heal.\\n# Meet the team\\nWe are entrepreneurs, scientists and drug discovery professionals.\\n![Katerina Chatzi, Ph.D.](https://cdn.prod.website-files.com/60162107d3effb6f041245eb/65c2689cb6f40f737de939f6_Katerina_500px_reducedsize.png)\\nBio\\n## Katerina Chatzi, Ph.D.\\n### Co-founder, Chief Executive Officer and President\\n![Katerina Chatzi, Ph.D.](https://cdn.prod.website-files.com/60162107d3effb6f041245eb/65c2689cb6f40f737de939f6_Katerina_500px_reducedsize.png)\\n[![LinkedIn Logo.](https://cdn.prod.website-files.com/5f08987a4affa2787555ddd9/608f66f8b7c61ad0d7e1ff91_In-Blue-Logo.png.original.png)](https://www.promakhos.com/<https:/www.linkedin.com/in/katerina-chatzi-phd-366625179/>)[![Publication list](https://cdn.prod.website-files.com/5f08987a4affa2787555ddd9/614baec336fecf99b2f048e2_Graduation-Cap.png)](https://www.promakhos.com/<https:/scholar.google.com/citations?hl=en&user=cn25Hj4AAAAJ>)![Email Icon](https://cdn.prod.website-files.com/5f08987a4affa2787555ddd9/60aeb905d2ecff3be04d2dd6_Email-icon_blue.png)[![Twitter](https://cdn.prod.website-files.com/5f08987a4affa2787555ddd9/614ce97df55d556b7537161e_2021%20Twitter%20logo%20-%20blue.png)](https://www.promakhos.com/<https:/twitter.com/katerina_hatzi>)\\n**Postdoc, Molecular and Cellular Biology** Harvard University\\n**Postdoc, Biophysics** KU Leuven\\n\\u200d**PhD., Biochemistry and Microbiology\\u200d** Institute of Molecular Biology and Biotechnology\\n## Katerina Chatzi, Ph.D.\\n### Co-founder, Chief Executive Officer and President\\nKaterina Chatzi is a co-founder and the Chief Executive Officer and President of Promakhos Therapeutics. Katerina is a distinguished scientist-entrepreneur with expertise in immunology, protein secretion, biochemistry, bacteriology, cell biology and business development. She has performed biomedical research for over 15 years across four different countries, uncovering fundamental principles underlying bacterial secretion, protein folding, antibiotic resistance, and cell cycle regulation.\\nKaterina’s scientific journey started at the University of Crete, where she studied mechanisms underlying tolerogenic immunosuppression during pregnancy in mice. She then received an Erasmus fellowship to study antibiotic resistance at Uppsala University in Sweden. Returning to Greece, she received the Excellent Academic Performance Award and started her Ph.D. training to study and reconstitute bacterial secretion systems. For her work, she was awarded the prestigious Heraclitus II fellowship from the National Strategic Innovation Program. Katerina then continued her research on bacterial secretion and protein folding as a Research fellow at the KU Leuven in Belgium.\\nKaterina arrived in the United States of America to work as a postdoctoral researcher at Harvard University. Recognizing her passion for translational research, she engaged in various business development programs across the Harvard and Massachusetts ecosystems. Through her exposure to different scientific fields as well as clinical and business environments, Katerina realized how her skills can help in the development of novel immunomodulatory therapeutics. She assembled a team and founded Promakhos Therapeutics to carry out her vision.\\n[✖](https://www.promakhos.com/<#>)\\n![Jasper E. Neggers, Ph.D.](https://cdn.prod.website-files.com/60162107d3effb6f041245eb/65c268945f8c2812efef82ea_Jasper_500px_reducedsize.png)\\nBio\\n## Jasper E. Neggers, Ph.D.\\n### Co-Founder, Chief Scientific Officer and Secretary \\n![Jasper E. Neggers, Ph.D.](https://cdn.prod.website-files.com/60162107d3effb6f041245eb/65c268945f8c2812efef82ea_Jasper_500px_reducedsize.png)\\n[![LinkedIn Logo.](https://cdn.prod.website-files.com/5f08987a4affa2787555ddd9/608f66f8b7c61ad0d7e1ff91_In-Blue-Logo.png.original.png)](https://www.promakhos.com/<https:/www.linkedin.com/in/jasperneggers/>)[![Publication list](https://cdn.prod.website-files.com/5f08987a4affa2787555ddd9/614baec336fecf99b2f048e2_Graduation-Cap.png)](https://www.promakhos.com/<https:/scholar.google.com/citations?user=TlhsVWwAAAAJ&hl=en>)![Email Icon](https://cdn.prod.website-files.com/5f08987a4affa2787555ddd9/60aeb905d2ecff3be04d2dd6_Email-icon_blue.png)[![Twitter](https://cdn.prod.website-files.com/5f08987a4affa2787555ddd9/614ce97df55d556b7537161e_2021%20Twitter%20logo%20-%20blue.png)](https://www.promakhos.com/<#>)\\n**Postdoc, Medical Oncology** Dana-Farber Cancer Institute\\n**Postdoc, Target Identification & Validation**Broad Institute of MIT and Harvard\\n**PhD., Functional Genomics & Chemical Biology\\u200d**KU Leuven\\n## Jasper E. Neggers, Ph.D.\\n### Co-Founder, Chief Scientific Officer and Secretary \\nJasper Edgar Neggers is a co-founder and the Chief Scientific Officer and Secretary of Promakhos Therapeutics. Jasper is an entrepreneurial, pioneering and innovative scientist with a background in microbiology, immunology, cell biology, target identification and validation, drug discovery and functional genomics. His commitment to entrepreneurship, scientific inquiry and translational research stems from his natural curiosity for biology and biotechnology, which manifested as he grew up in the Netherlands.\\nJasper performed his Ph.D. studies at the Rega Institute for Medical Research at the KU Leuven, Belgium. He was among the first scientists to apply CRISPR/Cas to genetically engineer human cells. Jasper collaborated with Karyopharm Therapeutics to validate the mechanism of action of the now marketed anticancer drug Selinexor (XPOVIO®) and the clinical stage drug KPT-9274. In Belgium, Jasper also invented a CRISPR-based genetic screening approach for identification of the cellular target of new candidate drugs.\\nJasper arrived in the USA as a postdoctoral fellow at the Dana-Farber Cancer Institute and the Broad Institute of MIT and Harvard to spearhead a team of researchers to identify and validate new therapeutic targets for cancer. He quickly distinguished himself and was awarded a Damon Runyon Cancer Research Foundation fellowship. As a fellow, Jasper developed an updated compendium of synthetic lethal interactions in cancer, helped identify new metabolic vulnerabilities in pancreatic cancer and continued developing new CRISPR/Cas applications. His work has nominated several new high-priority therapeutic targets for cancer and has led to the initiation of new drug discovery campaigns. As a rising scientific leader, Jasper was on his way to become an assistant professor after receiving the National Cancer Institute Pathway to Independence Award for Outstanding Early-Stage Postdoctoral Researchers. However, ultimately, Jasper wants his research to translate into patient impact and felt that an academic career would not provide the right environment to pursue his vision. So, he handed back his million-dollar grant money and joined Katerina to co-found Promakhos Therapeutics.\\n[✖](https://www.promakhos.com/<#>)\\n![Sofía M. Martínez Navarro](https://cdn.prod.website-files.com/60162107d3effb6f041245eb/673816be8c09be533a198c39_Sofia_reducedsize.png)\\nBio\\n## Sofía M. Martínez Navarro\\n### Research Associate\\n![Sofía M. Martínez Navarro](https://cdn.prod.website-files.com/60162107d3effb6f041245eb/673816be8c09be533a198c39_Sofia_reducedsize.png)\\n[![LinkedIn Logo.](https://cdn.prod.website-files.com/5f08987a4affa2787555ddd9/608f66f8b7c61ad0d7e1ff91_In-Blue-Logo.png.original.png)](https://www.promakhos.com/<https:/www.linkedin.com/in/sofia-martinez-navarro>)[![Publication list](https://cdn.prod.website-files.com/5f08987a4affa2787555ddd9/614baec336fecf99b2f048e2_Graduation-Cap.png)](https://www.promakhos.com/<#>)[![Email Icon](https://cdn.prod.website-files.com/5f08987a4affa2787555ddd9/60aeb905d2ecff3be04d2dd6_Email-icon_blue.png)](https://www.promakhos.com/<#>)[![Twitter](https://cdn.prod.website-files.com/5f08987a4affa2787555ddd9/614ce97df55d556b7537161e_2021%20Twitter%20logo%20-%20blue.png)](https://www.promakhos.com/<#>)\\n**Postgraduate in Bioengineering management** University of California, Riverside\\n**Bachelor of Science** Universidad Europea\\n## Sofía M. Martínez Navarro\\n### Research Associate\\nI am a biotechnology researcher passionate about innovation and learning. Complementary to my degree in biotechnology, I have a minor in management of biotechnological companies and a minor in molecular architecture. I am looking forward to being able to apply the knowledge gained during my years of study to the real world. I am also training as a professional piano player, and I am enrolled at the Rodolfo Halffter Conservatory. Learning music has allowed me to acquire a more artistic and creative vision as well as broaden my horizons.\\n[✖](https://www.promakhos.com/<#>)\\n# Advisors & collaborators\\n![Joshua R. Korzenik, M.D.](https://cdn.prod.website-files.com/60162107d3effb6f041245eb/60b139aa08a3dc423ebe5cc9_Advisers%20-%20Joshua%20Korzenik%20-400px.jpg)\\nBio\\n## Joshua R. Korzenik, M.D.\\n## Clinical & Scientific\\n![Joshua R. Korzenik, M.D.](https://cdn.prod.website-files.com/60162107d3effb6f041245eb/60b139aa08a3dc423ebe5cc9_Advisers%20-%20Joshua%20Korzenik%20-400px.jpg)\\n[![LinkedIn Logo.](https://cdn.prod.website-files.com/5f08987a4affa2787555ddd9/608f66f8b7c61ad0d7e1ff91_In-Blue-Logo.png.original.png)](https://www.promakhos.com/<https:/www.linkedin.com/in/joshua-korzenik-27761a133/>)[![Publication list](https://cdn.prod.website-files.com/5f08987a4affa2787555ddd9/614baec336fecf99b2f048e2_Graduation-Cap.png)](https://www.promakhos.com/<https:/connects.catalyst.harvard.edu/Profiles/display/Person/81506>)[![Twitter](https://cdn.prod.website-files.com/5f08987a4affa2787555ddd9/614ce97df55d556b7537161e_2021%20Twitter%20logo%20-%20blue.png)](https://www.promakhos.com/<#>)\\n**Associate Professor of Medicine** Harvard Medical School\\u200d**Resnek Family Distinguished Chair in Gastroenterology and Hepatology** Brigham and Women's Hospital\\n**Director of the Resnek Family Center for Primary Sclerosing Cholangitis Research** Brigham and Women's Hospital\\n\\u200d**Founding Director of the Crohn's and Colitis Center** Brigham and Women's Hospital\\n## Joshua R. Korzenik, M.D.\\nDr. Korzenik is a specialist in Gastroenterology, Hepatology and Endoscopy that focuses on developing new therapies for inflammatory bowel disease and primary sclerosing cholangitis. He is also well recognized for his compassion and dedication to his patients and for his integrative team approach to patient care. He is an Associate Professor of Medicine at Harvard Medical School, the Founding Director of the Crohn's and Colitis Center at the Brigham and Women’s Hospital, the Director of the Resnek Family Center for Primary Sclerosing Cholangitis Research at the Brigham and Women’s Hospital and the Resnek Family Distinguished Chair in Gastroenterology and Hepatology at the Brigham and Women’s Hospital.\\nDr. Korzenik has been involved in inflammatory bowel disease research and patient care for almost 25 years. His insights in Crohn’s disease and ulcerative colitis have opened new avenues of research and possible therapies, and he was among the first investigators to research the intestinal microbiome for clues about the role it may play in the development of inflammatory bowel disease as well as in its management through nutrition and therapeutics. Dr. Korzenik is an author of over 100 peer-reviewed articles and research papers and frequently speaks at professional meetings. He was named Humanitarian of the Year in 2013 by the New England Chapter of the Crohn’s and Colitis Foundation of America and was awarded the Torch of Friendship in 1999 by the Mid-America Chapter in St. Louis. Moreover, he has sequentially been selected as a Top Doctor by Boston Magazine in 2016, 2017, 2019, 2020, 2021, 2022 and 2023.\\nDr. Korzenik has led and was involved in many major clinical trials of new therapies for inflammatory bowel disease. For example, he has initiated a different therapeutic approach to Crohn’s disease through a set of multi-center clinical studies utilizing granulocyte colony stimulating factor (G-CSF) and granulocyte macrophagecolony-stimulating factor (GM-CSF) as therapeutic agents. In addition, based on an understanding of ulcerative colitis as a vascular disease and under-appreciated properties of heparin, he has previously developed clinical trials using heparin for the treatment of ulcerative colitis. His research has also focused on uncovering better biomarkers that can guide drug development and determine which interventions tested in clinical trials may be most effective and on understanding what initiates and perpetuates inflammation.\\n[✖](https://www.promakhos.com/<#>)\\n![Séverine Vermeire, M.D., Ph.D.](https://cdn.prod.website-files.com/60162107d3effb6f041245eb/6737a932d4b41a838c15c70e_Severine%20Vermeire-500px.png)\\nBio\\n## Séverine Vermeire, M.D., Ph.D.\\n## Clinical & Scientific\\n![Séverine Vermeire, M.D., Ph.D.](https://cdn.prod.website-files.com/60162107d3effb6f041245eb/6737a932d4b41a838c15c70e_Severine%20Vermeire-500px.png)\\n[![LinkedIn Logo.](https://cdn.prod.website-files.com/5f08987a4affa2787555ddd9/608f66f8b7c61ad0d7e1ff91_In-Blue-Logo.png.original.png)](https://www.promakhos.com/<#>)[![Publication list](https://cdn.prod.website-files.com/5f08987a4affa2787555ddd9/614baec336fecf99b2f048e2_Graduation-Cap.png)](https://www.promakhos.com/<#>)[![Twitter](https://cdn.prod.website-files.com/5f08987a4affa2787555ddd9/614ce97df55d556b7537161e_2021%20Twitter%20logo%20-%20blue.png)](https://www.promakhos.com/<https:/x.com/severinevermei1>)\\n**Professor of Medicine** KU Leuven\\u200d**Research Director of Biomedical Sciences** KU Leuven\\n## Séverine Vermeire, M.D., Ph.D.\\nProf. Dr. Séverine Vermeire obtained her MD from KU Leuven in 1995 and a PhD at the same University in 2001. She further trained at the Universidad Nacional de Asuncion, Paraguay (1993), at the Wellcome Trust Centre for Human Genetics in Oxford, UK (1997-1998) and at the Montreal General Hospital McGill University Canada in 2000–2001. She is staff member at the Gastroenterology & Hepatology Department of the University Hospital Leuven and Full Professor of Medicine at the KU Leuven. Since 2021, she is Research Director of Biomedical Sciences at KU Leuven. \\nProf. Vermeire is actively involved as principle investigator in RCTs with new therapeutic compounds and has been lead investigator on several of these programs. Her scientific work resulted in more than 600 peer-reviewed articles and focuses on the role of the microbiome and genetic susceptibility in IBD and on identifying prognostic and predictive signatures of treatment response. She participated in the International iCHOM consortium on development of Patient-Centered Outcomes for Inflammatory Bowel Disease. \\nShe was awarded an Advanced H2020-European Research Council (ERC) Grant (2016-2022) and was President of the European Crohn’s and Colitis Organisation (ECCO) from 2014-2016 and of the Belgian IBD Research & Development (BIRD) Group from 2011-2013.\\n[✖](https://www.promakhos.com/<#>)\\n![Juan Patarroyo, B.Sc.](https://cdn.prod.website-files.com/60162107d3effb6f041245eb/65c26add62a04e51a8be21e3_Advisers%20-%20Juan%20Pattaroyo-340px.jpg)\\nBio\\n## Juan Patarroyo, B.Sc.\\n## Research & Development\\n![Juan Patarroyo, B.Sc.](https://cdn.prod.website-files.com/60162107d3effb6f041245eb/65c26add62a04e51a8be21e3_Advisers%20-%20Juan%20Pattaroyo-340px.jpg)\\n[![LinkedIn Logo.](https://cdn.prod.website-files.com/5f08987a4affa2787555ddd9/608f66f8b7c61ad0d7e1ff91_In-Blue-Logo.png.original.png)](https://www.promakhos.com/<https:/www.linkedin.com/in/juan-patarroyo-27227b108/>)[![Publication list](https://cdn.prod.website-files.com/5f08987a4affa2787555ddd9/614baec336fecf99b2f048e2_Graduation-Cap.png)](https://www.promakhos.com/<#>)[![Twitter](https://cdn.prod.website-files.com/5f08987a4affa2787555ddd9/614ce97df55d556b7537161e_2021%20Twitter%20logo%20-%20blue.png)](https://www.promakhos.com/<#>)\\n**Mentor/Advisor** UF Innovate\\n**Director, Science Operations & Strategy\\u200d**Lab Central\\n## Juan Patarroyo, B.Sc.\\nJuan Patarroyo is an experienced biomedical scientist and life sciences operations expert with over 25 years of experience in immunology/microbiology, with specific expertise on mucosal immunology and the microbiome. He is fascinated by the interplay between the immune system (and in extension the body) and the commensal microbes and their associated (by)products. By understanding and leveraging this interplay, he strongly believes that we can develop meaningful and safe immunomodulatory drugs to treat and cure disease.\\nJuan has designed, executed, and supervised a large range of _in vitro_ and _in vivo_ studies to evaluate immune signaling and candidate molecules for go/no-go drug development decisions within pharma (Novartis, Pfizer, Vedanta Biosciences) and academia (UCSF). He has built and managed R&D labs of newly formed biotechnology companies (Vedanta, Commence) and advised life sciences companies on science strategy and operations at LabCentral. His work has directly contributed to the advancement of several drug candidates to preclinical testing and of VE303 (Vedanta) to the clinic. Most recently, Juan was a Principal Scientist at the Novartis Institutes for BioMedical Research and established a discovery platform harnessing the gastrointestinal microbiome to identify next-generation small molecules for autoimmune and allergic conditions, with a focus on discovering therapeutics that promote wound healing and epithelial barrier function in inflammatory bowel disease. \\nEarly on, Juan has helped shaped our understanding of the role of major histocompatibility (MHC) class II restricted antigen processing and presentation in the central nervous system and in the role played by myelin-specific antibodies in experimental autoimmune encephalomyelitis (EAE), a model of multiple sclerosis. He has also been involved in studies characterizing the mechanism and protective effect of glatirameracetate (Copaxone), atorvastatin (Lipitor) and anti-CD20 antibody (Rituxan) in CNS autoimmune disease. Juan then joined the multiple sclerosis group at Pfizer to support the discovery and development of new drugs. There, he evaluated new anti-inflammatory biologics and small molecules. As the role of the microbiome in human health became established, he led evaluated natural ligand derivatives for their ability to promote immunotolerance and mucosal repair in inflammatory bowel disease.\\n[✖](https://www.promakhos.com/<#>)\\n![Tomi K. Sawyer, Ph.D.](https://cdn.prod.website-files.com/60162107d3effb6f041245eb/6093578627e7aed188c7ef3d_Tomi%20Sawyer.jpg)\\nBio\\n## Tomi K. Sawyer, Ph.D.\\n## Drug Discovery & Development\\n![Tomi K. Sawyer, Ph.D.](https://cdn.prod.website-files.com/60162107d3effb6f041245eb/6093578627e7aed188c7ef3d_Tomi%20Sawyer.jpg)\\n[![LinkedIn Logo.](https://cdn.prod.website-files.com/5f08987a4affa2787555ddd9/608f66f8b7c61ad0d7e1ff91_In-Blue-Logo.png.original.png)](https://www.promakhos.com/<https:/www.linkedin.com/in/tomi-sawyer-0090714/>)[![Publication list](https://cdn.prod.website-files.com/5f08987a4affa2787555ddd9/614baec336fecf99b2f048e2_Graduation-Cap.png)](https://www.promakhos.com/<https:/scholar.google.com/citations?user=3qbxorEAAAAJ&hl=en>)[![Twitter](https://cdn.prod.website-files.com/5f08987a4affa2787555ddd9/614ce97df55d556b7537161e_2021%20Twitter%20logo%20-%20blue.png)](https://www.promakhos.com/<#>)\\n**Chief Drug Hunter & President**Maestro Therapeutics\\u200d\\u200d**Adjunct Professor, Center for Drug Discovery** Northeastern University\\u200d**Adjunct Professor, Departments of Chemistry, Biochemistry & Molecular Biology**University of Massachusetts Amherst\\n## Tomi K. Sawyer, Ph.D.\\nTomi Sawyer serves as a drug discovery and development consultant. Tomi is an accomplished and entrepreneurial drug hunter, medicinal chemist and chemical biologist with a track record of developing both peptide and small molecule drugs. Tomi has over four decades of industrial experience in both pharma and biotech and is well known for his contributions to GPCR, kinase, protease and protein-protein interaction drug discovery. He is the inventor of the marketed drugs Afamelanotide (Scenesse®, Clinuvel) and Ponatinib (Iclusig®, Ariad Pharmaceuticals [now Takeda]) and is credited with over 600 scientific publications, patents, and presentations.\\nTomi is currently the Chief Drug Hunter and President of Maestro Therapeutics, a consulting/advisory enterprise that supports peptide drug discovery in academia, biotech and pharma. Tomi Sawyer has recently retired from his position as Distinguished Scientist, Global Chemistry at Merck Research Laboratories. In this role, he provided leadership to the Peptide Drug Hunter Network and several peptide R&D programs as well as innovative core capabilities and knowledge engine. He previously also served as the Chief Scientific Officer of Aileron, Senior Vice President, Drug Discovery at Ariad Pharmaceuticals, Senior Director, Chemical Sciences at Pfizer and was a past President of the American Peptide Society.\\nTomi is an Adjunct Professor at the University of Massachusetts and the Northeastern University Center for Drug Discovery. In addition, he is a Distinguished Alumni Entrepreneur from his undergraduate _alma mater_ , Minnesota State University at Moorhead, and previously served as a member of the MSUM Alumni Foundation Board of Directors. At his graduate _alma mater_ , the University of Arizona, Tomi is a Distinguished Alumni Entrepreneur and has received a Professional Achievement Award from the Department of Chemistry & Biochemistry and the College of Science. \\n[✖](https://www.promakhos.com/<#>)\\n![Alexander Bryant, Ph.D.](https://cdn.prod.website-files.com/60162107d3effb6f041245eb/6737a3b6cf7ace58f1c36f34_Advisers%20-%20Alexander%20Bryant.jpg)\\nBio\\n## Alexander Bryant, Ph.D.\\n## Pharmacology & Toxicology\\n![Alexander Bryant, Ph.D.](https://cdn.prod.website-files.com/60162107d3effb6f041245eb/6737a3b6cf7ace58f1c36f34_Advisers%20-%20Alexander%20Bryant.jpg)\\n[![LinkedIn Logo.](https://cdn.prod.website-files.com/5f08987a4affa2787555ddd9/608f66f8b7c61ad0d7e1ff91_In-Blue-Logo.png.original.png)](https://www.promakhos.com/<https:/www.linkedin.com/in/alexander-bryant-biotech/>)[![Publication list](https://cdn.prod.website-files.com/5f08987a4affa2787555ddd9/614baec336fecf99b2f048e2_Graduation-Cap.png)](https://www.promakhos.com/<#>)[![Twitter](https://cdn.prod.website-files.com/5f08987a4affa2787555ddd9/614ce97df55d556b7537161e_2021%20Twitter%20logo%20-%20blue.png)](https://www.promakhos.com/<#>)\\n**President\\u200d** Lightship Scientific Consulting, LLC\\n\\u200d\\n\\u200d\\n## Alexander Bryant, Ph.D.\\nDr. Alexander Bryant is a pharmacology-toxicology expert with over 20 years of experience in drug development. He previously served as the Vice President of Preclinical Research and Development, Pharmacology and Toxicology at Ironwood Pharmaceuticals. Prior to his role at Ironwood, he was a senior director in preclinical pharmacology at Microbia. \\nAt Ironwood and Microbia,he was responsible for the preclinical discovery, development and toxicology of linaclotide (LINZESS®), a non-systemic oral drug for treating irritable bowel syndrome with constipation (IBS-C). He authored a large part of the NDA for linaclotide’s FDA approval.\\nDr. Bryant is now the President of Lightship Scientific Consulting, which provides innovative advice and solutions from experienced pharmaceutical and biotech R&D professionals. His team of expert consultants can provide advice on every aspect of the drug discovery and development process.\\n[✖](https://www.promakhos.com/<#>)\\n![Caroline Kurtz, Ph.D.](https://cdn.prod.website-files.com/60162107d3effb6f041245eb/6737a84e22e0e3f6dd3bcfee_Synlogic_Dr_Caroline_Kurtz-300x300.jpg)\\nBio\\n## Caroline Kurtz, Ph.D.\\n## Drug Development\\n![Caroline Kurtz, Ph.D.](https://cdn.prod.website-files.com/60162107d3effb6f041245eb/6737a84e22e0e3f6dd3bcfee_Synlogic_Dr_Caroline_Kurtz-300x300.jpg)\\n[![LinkedIn Logo.](https://cdn.prod.website-files.com/5f08987a4affa2787555ddd9/608f66f8b7c61ad0d7e1ff91_In-Blue-Logo.png.original.png)](https://www.promakhos.com/<https:/www.linkedin.com/in/caroline-kurtz-02437313/>)[![Publication list](https://cdn.prod.website-files.com/5f08987a4affa2787555ddd9/614baec336fecf99b2f048e2_Graduation-Cap.png)](https://www.promakhos.com/<#>)[![Twitter](https://cdn.prod.website-files.com/5f08987a4affa2787555ddd9/614ce97df55d556b7537161e_2021%20Twitter%20logo%20-%20blue.png)](https://www.promakhos.com/<#>)\\n**CSO Partner** Lightship Scientific Consulting\\n**Chief Development Officer\\u200d** Synlogic Inc.\\n\\u200d**PhD., Immunology\\u200d** Harvard University\\n## Caroline Kurtz, Ph.D.\\nCaroline Kurtz, Ph. D, provides scientific and strategic guidance for drug development stage programs grounded in over 29 years of experience developing unique products for patients with metabolic and gastrointestinal diseases. Dr. Kurtz’s direct experience includes leadership in preclinical, clinical development and regulatory affairs for products in the stages of lead identification through marketing authorization. She brings specific expertise in developing novel therapeutic platforms, operating through local delivery in the GI tract, and rare disease drug development. In addition, throughout her career Dr. Kurtz has been a leader in the establishment of strong cross-functional and cross-company collaborations and teams.\\nPrior to joining Lightship Scientific Consulting, Dr. Kurtz was Chief Development Officer at Synlogic Inc, a clinical stage biopharmaceutical company developing engineered living cell therapies for the treatment of rare metabolic and immune-mediated diseases. At Synlogic, Dr. Kurtz oversaw translational research and development activities for discovery and clinical stage programs for inflammatory bowel disease, oncology and rare metabolic diseases, including advancing into Phase 3 the investigational product SYNB1934 for phenylketonuria. Prior to Synlogic, Caroline served as Vice President and Program Lead at Ironwood Pharmaceuticals, bringing the novel peptide drug linaclotide, (LINZESS®), from preclinical development through commercialization for the treatment of irritable bowel syndrome and chronic constipation. LINZESS is now one of the most highly prescribed products for patients with irritable bowel syndrome. Dr. Kurtz also worked at GelTex/Genzyme, overseeing the discovery and development of polymers for the treatment of infectious diseases, including leading a clinical stage program for the treatment of _C. difficile_ colitis.\\nHer early scientific training was in the fields of immunology, virology, and autoimmune demyelinating diseases. Dr. Kurtz holds a Ph.D. in Immunology from Harvard University, and a BSc (summa cum laude) in Biochemistry from the University of New Hampshire.\\n[✖](https://www.promakhos.com/<#>)\\n![Mary Christian, PharmD., MBA](https://cdn.prod.website-files.com/60162107d3effb6f041245eb/635730b67ed10054a208390b_202210124%20MaryC%20LYN%202022b.jpg)\\nBio\\n## Mary Christian, PharmD., MBA\\n## Regulatory Expert\\n![Mary Christian, PharmD., MBA](https://cdn.prod.website-files.com/60162107d3effb6f041245eb/635730b67ed10054a208390b_202210124%20MaryC%20LYN%202022b.jpg)\\n[![LinkedIn Logo.](https://cdn.prod.website-files.com/5f08987a4affa2787555ddd9/608f66f8b7c61ad0d7e1ff91_In-Blue-Logo.png.original.png)](https://www.promakhos.com/<https:/www.linkedin.com/in/mary-christianpharmd/>)[![Publication list](https://cdn.prod.website-files.com/5f08987a4affa2787555ddd9/614baec336fecf99b2f048e2_Graduation-Cap.png)](https://www.promakhos.com/<#>)[![Twitter](https://cdn.prod.website-files.com/5f08987a4affa2787555ddd9/614ce97df55d556b7537161e_2021%20Twitter%20logo%20-%20blue.png)](https://www.promakhos.com/<https:/twitter.com/drmarypharmd>)\\n**Senior Vice President, Regulatory** C4 Therapeutics\\n\\u200d\\n## Mary Christian, PharmD., MBA\\nDr. Christian is a pharmaceutical and biotech executive with more than 20 years of regulatory and drug development experience across pharmaceutical and biotechnology companies. She has created high functioning, fit-for-purpose teams for emerging biotech, envisioned and built new capabilities in large pharma (e.g. Bristol-Myers Squibb Oncology Strategic Collaborations, leading to success in >$50M in development partnerships), and led R&D efforts across a variety of therapeutic areas including, but not limited to, CNS, immunology, and immuno-oncology in all phases of development. \\nDr. Christian serves as the Senior Vice President of Regulatory at C4 Therapeutics, a clinical stage biotech developing a pipeline of targeted protein degraders for oncology. Besides her role at C4, Dr. Christian also serves as a scientific advisor to several emerging biotech companies and lectures at MIT on Regulatory Strategies for developing drugs and devices. \\nPrior to C4, Dr. Christian was the Senior Vice President of Regulatory, Quality and Compliance at Lyndra Therapeutics, a rapidly growing clinical stage biotech whose mission is to reinvent medicine for a healthier world. She was also a founding member of Cyclerion Therapeutics, a spinout of Ironwood Pharmaceuticals focused on serious and orphan diseases, where she led Regulatory, Quality and Pharmacovigilance. Before her role at Cyclerion, Dr. Christian was Vice President of Global Regulatory Affairs at Ironwood Pharmaceuticals, where she transformed the regulatory organization, successfully negotiated approval of a stalled marketing application for Linzess® in China, advanced rare disease assets into Phase 1 and 2 and built organization models that enabled the spinoff of various assets. \\nPrior to joining the world of biotech in Boston, Dr. Christian created and led successful and innovative teams at Bristol-Myers Squibb by identifying novel ways to accelerate research and the delivery of medicines to patients globally. Dr. Christian also held roles of increasing responsibility in Global Regulatory Affairs at Johnson & Johnson Pharmaceutical Research & Development (now Janssen Pharmaceutica) across several therapeutic areas.\\n[✖](https://www.promakhos.com/<#>)\\n# News\\n# February 10, 2025\\n## Listen to our latest interview by the Propel a Cure for Crohn's disease foundation\\n# News\\nPress Release\\n•\\n## Charlottesville, Virginia\\n•\\nFebruary 10, 2025\\n# Listen to our latest interview by the Propel a Cure for Crohn's disease foundation\\nWe are honored to have received the 2024 research award and support of Propel a Cure for Crohn's disease. In a [new interview,](https://www.promakhos.com/<https:/www.youtube.com/watch?v=a4PWkwPXD_U>) we had the honor of sitting down with Annabelle and Angela of Propel a Cure to share our latest results and discuss the work we’re doing. We want to extend our gratitude to the donors who support us and the foundation. Your contributions are making a difference and are the driving force behind the hope we are working to create.\\nPropel a Cure is an all-volunteer nonprofit organization that focuses on the needs of Crohn's patients, their families, friends, and caregivers. You can read more about their work [here](https://www.promakhos.com/<https:/www.propelacure.org/>).\\n\\u200d\\n[✖](https://www.promakhos.com/<#>)\\n# October 31, 2024\\n## Join Promakhos Therapeutics and our CEO Katerina Chatzi at the MassNextGen 2024 showcase event!\\n# News\\nAnnouncement\\n•\\n## Allston, Massachusetts, United States of America\\n•\\nOctober 31, 2024\\n# Join Promakhos Therapeutics and our CEO Katerina Chatzi at the MassNextGen 2024 showcase event!\\nOn Wednesday, November 6, 2024, our CEO Katerina Chatzi will present Promakhos Therapeutics at the MassNextGen 2024 Showcase event in Boston, Massachusetts. Register [here](https://www.promakhos.com/<https:/www.eventbrite.com/e/massnextgen-showcase-tickets-901471815467>). We look forward to seeing you there!\\nThis showcase event is organized by the Massachusetts Life Sciences Center to highlight award-winning and leading life sciences start-up companies in Massachusetts. This year, Katerina Chatzi of Promakhos Therapeutics won the Massachusetts Next Generation (MassNextGen) Initiative award. After a competitive process, Promakhos and four other women-led companies from Massachusetts were selected for this award, which includes ~$100K funding for the company, other in-kind services and access to a network of seasoned professionals from the life sciences ecosystem.\\nWe are very grateful to be able to grow our company in a state that supports entrepreneurship and under-represented founders!\\nFor more information on the Massachusetts Life Sciences Center please visit [here](https://www.promakhos.com/<https:/www.masslifesciences.com/about/>).[\\u200d](https://www.promakhos.com/<https:/www.massbio.org/>)\\u200d\\n\\u200d\\n[✖](https://www.promakhos.com/<#>)\\n# February 19, 2024\\n## Promakhos Therapeutics awarded the Propel a Cure for Crohn's disease 2024 research award\\n# News\\nAnnouncement\\n•\\n## Allston, Massachusetts, United States of America\\n•\\nFebruary 19, 2024\\n# Promakhos Therapeutics awarded the Propel a Cure for Crohn's disease 2024 research award\\nPromakhos Therapeutics is incredibly honored to share that the company has been awarded the [Propel a Cure for Crohn's Disease](https://www.promakhos.com/<https:/www.propelacure.org/researchprojects>) research award for 2024! \\u200dPropel a Cure is an all-volunteer nonprofit organization that focuses on the needs of Crohn's patients, their families, friends, and caregivers. This year, the organization raised funds and utilized its expert scientific advisory board to select a pioneering research team to support their research to identify the underlying cause or causes of Crohn’s disease and the development of a cure. The $100,000 award was awarded to a single team after a competitive review process of several applications submitted in December 2023.\\nPromakhos Therapeutics is humbled to have been awarded this project grant, as the Propel a Cure organization strives to change the status quo and deliver patient impact. As it is also run by Crohn's patients or their family or friends with close experience with this debilitating disease, it means a lot to us! Stay tuned to hear about our progress in the next 1~1.5 years.\\n[✖](https://www.promakhos.com/<#>)\\n# January 24, 2024\\n## Promakhos Therapeutics' Katerina Chatzi wins this year's MassNextGen award from the Massachusetts Life Sciences Center \\n# News\\nAnnouncement\\n•\\n## Cambridge, Massachusetts, United States of America\\n•\\nJanuary 24, 2024\\n# Promakhos Therapeutics' Katerina Chatzi wins this year's MassNextGen award from the Massachusetts Life Sciences Center \\n> _This is an announcement supporting the_[ _original article_](https://www.promakhos.com/<https:/www.masslifesciences.com/healey-driscoll-administration-and-massachusetts-life-sciences-center-announce-awardees-for-public-private-initiative-to-support-diverse-entrepreneurs/>) _published by the Massachusetts Life Sciences Center on January 24, 2024._\\nWe are very honored to announce that Promakhos Therapeutics' Katerina Chatzi, PhD won this year’s Massachusetts Next Generation (MassNextGen) Initiative award from the Massachusetts Life Sciences Center (MLSC). After a competitive process, Promakhos and four other women-led companies from Massachusetts were selected for this award, which includes ~$100K funding for the company, other in-kind services and access to a network of seasoned professionals from the life sciences ecosystem.\\nOn Wednesday, Massachusetts Secretary of Economic Development Yvonne Hao joined the Massachusetts Life Sciences Center at Takeda in Cambridge to announce the awardees of the Massachusetts Next Generation (MassNextGen) Initiative. We are very grateful to be able to grow our company in a state that supports entrepreneurship and under-represented founders!\\nFor more information on the Massachusetts Life Sciences Center please visit [here](https://www.promakhos.com/<https:/www.masslifesciences.com/about/>).[\\u200d](https://www.promakhos.com/<https:/www.massbio.org/>)\\u200d\\n[✖](https://www.promakhos.com/<#>)\\n# November 3, 2023\\n## Read the new interview of Katerina Chatzi, Promakhos Therapeutics' CEO and founder, by Alex Alexakis of Startup Pirate!\\n# News\\nThought Leadership\\n•\\n## Athens, Greece\\n•\\nNovember 3, 2023\\n# Read the new interview of Katerina Chatzi, Promakhos Therapeutics' CEO and founder, by Alex Alexakis of Startup Pirate!\\n> \\u200d _This is a news announcement supporting the_[ _original article_](https://www.promakhos.com/<https:/www.startuppirate.com/p/developing-therapies-for-chronic>) _published by the Startup Pirate on November 3, 2023._\\nSome of the most challenging diseases of our time — atherosclerotic, neurodegenerative, metabolic, autoimmune diseases, etc. — may ride the same steed: inflammation. Inflammation, by definition, should be good. It is the way our body heals itself after injury. But chronic, unchecked, continually ramped-up inflammation leads to the opposite: chronic disorders in many forms.\\nToday, [Alex Alexakis](https://www.promakhos.com/<https:/www.linkedin.com/in/ACoAAASLzlkBNRe5YUgsiGECu_SBiGHT0-qCVw4>) of Startup Pirate interviewed our CEO and founder [Katerina Chatzi, PhD](https://www.promakhos.com/<https:/www.linkedin.com/in/ACoAACpF3b4BmZn5-mU3ugQRAX46yDDb7q4hm28>). He asked all the right questions about inflammatory diseases and allowed Katerina to provide some context! [Check out the interview](https://www.promakhos.com/<https:/www.startuppirate.com/p/developing-therapies-for-chronic>) to learn about:\\n\\u200d _How inflammation becomes chronic and why inflammatory diseases are prevalent in our societies nowadays_\\n_Redefining how inflammatory diseases are cured by activating the immune system_\\n_The process from molecule design to developing new therapies_\\n_Challenges building a biotech startup_\\n[✖](https://www.promakhos.com/<#>)\\n# September 1, 2023\\n## Promakhos Therapeutics receives $272K NIH Phase 1 SBIR grant to develop new oral immunomodulating therapy for Crohn's disease\\n# News\\nAnnouncement\\n•\\n## Allston, Massachusetts, United States of America\\n•\\nSeptember 1, 2023\\n# Promakhos Therapeutics receives $272K NIH Phase 1 SBIR grant to develop new oral immunomodulating therapy for Crohn's disease\\nPromakhos Therapeutics is proud to announce the receipt of a Phase 1 Small Business Innovation Research (SBIR) Grant from the National Institute of Diabetes and Digestive and Kidney Diseases (NIDDK). [This SBIR grant (1R43DK135153-01)](https://www.promakhos.com/<https:/reporter.nih.gov/search/OrK86BmUM0uhfwlbER7edQ/project-details/10600659>) provides $271,865 to support the preclinical development and validation of Promakhos' oral drug candidate for treating Crohn's disease. This candidate is designed to restore intestinal innate immune function and wound healing to resolve bowel inflammation without suppressing the immune system.\\n[✖](https://www.promakhos.com/<#>)\\n# May 20, 2023\\n## Promakhos Therapeutics named as a Life Sciences Company to Watch by Big4Bio\\n# News\\nAnnouncement\\n•\\n## San Francisco, California, United States of America\\n•\\nMay 20, 2023\\n# Promakhos Therapeutics named as a Life Sciences Company to Watch by Big4Bio\\n> _This is a news announcement supporting the_[ _original article_](https://www.promakhos.com/<https:/big4bio.com/companies/to-watch/bio2023/the-big4bio-company-to-watch-program-june-2023-startup-stadium-finalists-at-bio-2023/>) _published by the Big4Bio news aggregator on May 20, 2023. To learn more about Big4Bio, visit:_[_https://big4bio.com/life-sciences-biotech-news/_](https://www.promakhos.com/<https:/big4bio.com/life-sciences-biotech-news/>)\\nPromakhos Therapeutics is excited to share that the company has been listed as a Life Sciences company to Watch by Big4Bio. Big4Bio is a premier aggregator of news and developments in the life sciences sector. Its name stands for the cornerstone “Big 4” in biosciences and health: drugs, devices, diagnostics, and digital (also known as the “four D’s”). Big4Bio produces individual summaries for the most significant life sciences markets in the world.\\n[✖](https://www.promakhos.com/<#>)\\n# May 1, 2023\\n## Promakhos Therapeutics selected as finalist at BIO 2023 and will present at the BIO 2023 Start-Up Stadium in Boston this June\\n# News\\nAnnouncement\\n•\\n## Boston, Massachusetts, United States of America\\n•\\nMay 1, 2023\\n# Promakhos Therapeutics selected as finalist at BIO 2023 and will present at the BIO 2023 Start-Up Stadium in Boston this June\\nPromakhos Therapeutics is pleased to announce that the company has been selected as a [Start-Up finalist for the 2023 BIO International convention](https://www.promakhos.com/<https:/www.bio.org/events/bio-international-convention/start-stadium-2023>). \\nOur CEO, Katerina Chatzi, will showcase and present our mission and vision on stage at the BIO 2023 Start-Up Stadium in Boston on Tuesday June 6th, 2023 11:00 AM-1:00 PM. We look forward to seeing you there!\\u200d\\n[✖](https://www.promakhos.com/<#>)\\n# March 30, 2023\\n## Promakhos Therapeutics selected as finalist of the 2023 Harvard President's Innovation Challenge\\n# News\\nAnnouncement\\n•\\n## Allston, Massachusetts, United States of America\\n•\\nMarch 30, 2023\\n# Promakhos Therapeutics selected as finalist of the 2023 Harvard President's Innovation Challenge\\nPromakhos Therapeutics has been selected as a finalist of the [2023 Harvard President's Innovation Challenge](https://www.promakhos.com/<https:/news.harvard.edu/gazette/story/2023/03/presidents-innovation-challenge-names-finalists-for-2023/>) - Health & Life Sciences track. The Innovation challenge is a call to action, innovation and entrepreneurship – and an opportunity to win up to $75,000 (Grand Prize) or $25,000 (Runner-up) in non-dilutive funding. In May, Katerina Chatzi, our CEO, will [present ](https://www.promakhos.com/<https:/www.youtube.com/watch?v=C5sU8G_jJJo>)the company to a large audience at the Harvard Business School during the final event. We hope to see you there!\\n[✖](https://www.promakhos.com/<#>)\\n# October 24, 2022\\n## Promakhos Therapeutics welcomes Dr. Mary Christian to the scientific advisory board\\n# News\\nAnnouncement\\n•\\n## Allston, Massachusetts, United States of America\\n•\\nOctober 24, 2022\\n# Promakhos Therapeutics welcomes Dr. Mary Christian to the scientific advisory board\\nPromakhos Therapeutics is excited to announce that Dr. Mary Christian has joined the company's scientific advisory board. \\nDr. Christian is a pharmaceutical and biotech executive who delivers visionary, innovative solutions in complex landscapes. She has a diverse experience in drug development spanning from regulatory strategy to establishing external partnerships with key academic institutions in the US to drive common research and development goals. She has created high functioning, fit-for-purpose teams for emerging biotech, envisioned and built new capabilities in large pharma (e.g. Bristol-Myers Squibb Oncology Strategic Collaborations, leading to success in >$50M in development partnerships), and led R&D efforts across a variety of therapeutic areas including but not limited to CNS, immunology, and immuno-oncology in all phases of development. She thrives where she is trusted, purpose-driven and ever-learning; strengths include collaborative problem solving, partnering for mutual success and diverse & inclusive leadership. \\nDr. Christian is the Senior Vice President of Regulatory, Quality and Compliance at Lyndra Therapeutics, a rapidly growing clinical stage biotech whose mission is to reinvent medicine for a healthier world. Lyndra is developing a pipeline of long-acting oral therapies. The regulatory pathway to global approval is uncharted for products this unique; Dr. Christian is committed to leveraging 20+ years of regulatory and drug development experience, working with the stellar Lyndra team, to accelerate these important therapies to patients. She also serves as a scientific advisor to several emerging biotech companies and lectures at MIT on Regulatory Strategies for developing drugs and devices. \\nPrior to Lyndra, Dr. Christian was a founding team member of Cyclerion Therapeutics, a spinout of Ironwood Pharmaceuticals focused on serious and orphan diseases, where she led Regulatory, Quality and Pharmacovigilance. She was Vice President of Global Regulatory Affairs at Ironwood Pharmaceuticals where she transformed the Regulatory organization and successfully negotiated approval of a stalled marketing application for Linzess® in China, advanced rare disease assets into Phase 1 and 2 and built organization models that enabled the spinoff. \\nPrior to joining the world of biotech in Boston, Dr. Christian created and led successful and innovative teams at Bristol-Myers Squibb by identifying novel ways to accelerate research and the delivery of medicines to patients globally. Dr. Christian also held roles of increasing responsibility in Global Regulatory Affairs at Johnson & Johnson Pharmaceutical Research & Development (now Janssen Pharmaceutica) across several therapeutic areas. \\n[✖](https://www.promakhos.com/<#>)\\n[ Older ](https://www.promakhos.com/<?911cbdbf_page=2>)\\n1 / 3\\n# Support\\n## Partners\\n![Metaplanet logo](https://cdn.prod.website-files.com/5f08987a4affa2787555ddd9/61ec3586f5a2cb3d6481435d_Metaplanet2.png)![Y Combinator Logo\\n](https://cdn.prod.website-files.com/5f08987a4affa2787555ddd9/61e1dc4913a6397895c207bf_Y%20Combinator.png)![Logo of the Propel a Cure for Crohn's disease nonprofit organization.](https://cdn.prod.website-files.com/5f08987a4affa2787555ddd9/65d76c560cfd02dd4e8685ac_Propel-a-Cure_2.png)![FAST logo](https://cdn.prod.website-files.com/5f08987a4affa2787555ddd9/62068b76aad1bde0b6888cf0_Fast1-t.png)![Logo of Harvard Innovation Labs](https://cdn.prod.website-files.com/5f08987a4affa2787555ddd9/61e1d9450e1bc429dfe4984c_Harvard%20Innovation%20Labs-new.png) ![Logo of the National Institute of Diabetes and Digestive and Kidney Diseases](https://cdn.prod.website-files.com/5f08987a4affa2787555ddd9/64ffb73370c590b73e122d4b_NIDDK.png)![Logo of The Massachusetts Life Sciences Center](https://cdn.prod.website-files.com/5f08987a4affa2787555ddd9/65c2a1105499fb72f5714970_MLSC_Logo2024.jpg)![The Allston Venture Fund](https://cdn.prod.website-files.com/5f08987a4affa2787555ddd9/60b7f8cd5ed14d90af2a209f_Allston%20Venture%20Fund.png)![Logo of Pioneer Fund](https://cdn.prod.website-files.com/5f08987a4affa2787555ddd9/61ec3878ef8694bfc2d304e9_Pioneer%20Fund2.png)![Morrison Foerster](https://cdn.prod.website-files.com/5f08987a4affa2787555ddd9/60b7f5a46b2c3c42a972358a_Morrison%20Foester%20-Transparent.png)\\n## Network\\n![Brigham and Women's Hospital](https://cdn.prod.website-files.com/5f08987a4affa2787555ddd9/60b7fe6ff3d9a1f51fc2213c_Brigham%20and%20Women%C2%B4s%20Hospital.png)![Broad Institute](https://cdn.prod.website-files.com/5f08987a4affa2787555ddd9/60b7f9f80f45f6457cda12e8_Broad-Logo_transparant.png)![IMBB-FORTH logo.\\n](https://cdn.prod.website-files.com/5f08987a4affa2787555ddd9/60c63f5c61a1021c9e68baa2_IMBB-FORTH.png)![MassBio](https://cdn.prod.website-files.com/5f08987a4affa2787555ddd9/60b7ff690babf92f5f02a07b_MassBio.png) ![Harvard University](https://cdn.prod.website-files.com/5f08987a4affa2787555ddd9/60b7ff0f07578230e9caa646_Harvard%20University.png)![Dana-Farber Cancer Institute](https://cdn.prod.website-files.com/5f08987a4affa2787555ddd9/60b7fa7d5878782c67c96ff2_Dana-Farber%20Cancer%20Institute%20Logo.png)![KU Leuven logo.](https://cdn.prod.website-files.com/5f08987a4affa2787555ddd9/60c63e8aba3a28cbb7b96709_KU%20Leuven.png)\\nContact us\\nfounders@promakhos.com\\nPagliuca Harvard Life Lab127 Western Avenue, Allston, MA 02134-1008United States of America\\n© 2021-2025 Promakhos Therapeutics, Inc. All rights reserved.\\n\" markdown_with_citations=\"![⟨1⟩](https://www.promakhos.com/<#Landing>)\\nTeam⟨2⟩News⟨3⟩Support⟨4⟩Contact⟨5⟩\\n![A calm and blue sea with very small waves.⟨6⟩]\\nOur body has the ability to defend and heal.We want to make it work for everyone. \\n# Transforming autoinflammatory disease treatment\\nThough inflammation is normally a healthy part of the body’s response to injury or infection, some people experience a dysfunctional immune response. The resulting chronic inflammation can damage the body and lead to further disease. Current therapies for chronic inflammatory diseases such as Crohn’s disease, multiple sclerosis, and ankylosing spondylitis often work by suppressing the immune system, and treat symptoms rather than addressing the root causes of the disease. However, only 25% of patients benefit from these therapies long term. What if – instead of working against the immune system – we figured out how to restore its balance and function?Promakhos Therapeutics aims to do just this. Founded in the spring of 2021 and based in Boston, Massachusetts, we develop transformative therapies that restore the function of the immune system, allowing the body to control inflammation and heal.\\n# Meet the team\\nWe are entrepreneurs, scientists and drug discovery professionals.\\n![Katerina Chatzi, Ph.D.⟨7⟩]\\nBio\\n## Katerina Chatzi, Ph.D.\\n### Co-founder, Chief Executive Officer and President\\n![Katerina Chatzi, Ph.D.⟨7⟩]\\n![LinkedIn Logo.⟨8⟩](https://www.promakhos.com/<https:/www.linkedin.com/in/katerina-chatzi-phd-366625179/>)![Publication list⟨9⟩](https://www.promakhos.com/<https:/scholar.google.com/citations?hl=en&user=cn25Hj4AAAAJ>)![Email Icon⟨10⟩]![Twitter⟨11⟩](https://www.promakhos.com/<https:/twitter.com/katerina_hatzi>)\\n**Postdoc, Molecular and Cellular Biology** Harvard University\\n**Postdoc, Biophysics** KU Leuven\\n\\u200d**PhD., Biochemistry and Microbiology\\u200d** Institute of Molecular Biology and Biotechnology\\n## Katerina Chatzi, Ph.D.\\n### Co-founder, Chief Executive Officer and President\\nKaterina Chatzi is a co-founder and the Chief Executive Officer and President of Promakhos Therapeutics. Katerina is a distinguished scientist-entrepreneur with expertise in immunology, protein secretion, biochemistry, bacteriology, cell biology and business development. She has performed biomedical research for over 15 years across four different countries, uncovering fundamental principles underlying bacterial secretion, protein folding, antibiotic resistance, and cell cycle regulation.\\nKaterina’s scientific journey started at the University of Crete, where she studied mechanisms underlying tolerogenic immunosuppression during pregnancy in mice. She then received an Erasmus fellowship to study antibiotic resistance at Uppsala University in Sweden. Returning to Greece, she received the Excellent Academic Performance Award and started her Ph.D. training to study and reconstitute bacterial secretion systems. For her work, she was awarded the prestigious Heraclitus II fellowship from the National Strategic Innovation Program. Katerina then continued her research on bacterial secretion and protein folding as a Research fellow at the KU Leuven in Belgium.\\nKaterina arrived in the United States of America to work as a postdoctoral researcher at Harvard University. Recognizing her passion for translational research, she engaged in various business development programs across the Harvard and Massachusetts ecosystems. Through her exposure to different scientific fields as well as clinical and business environments, Katerina realized how her skills can help in the development of novel immunomodulatory therapeutics. She assembled a team and founded Promakhos Therapeutics to carry out her vision.\\n✖⟨12⟩\\n![Jasper E. Neggers, Ph.D.⟨13⟩]\\nBio\\n## Jasper E. Neggers, Ph.D.\\n### Co-Founder, Chief Scientific Officer and Secretary \\n![Jasper E. Neggers, Ph.D.⟨13⟩]\\n![LinkedIn Logo.⟨8⟩](https://www.promakhos.com/<https:/www.linkedin.com/in/jasperneggers/>)![Publication list⟨9⟩](https://www.promakhos.com/<https:/scholar.google.com/citations?user=TlhsVWwAAAAJ&hl=en>)![Email Icon⟨10⟩]![Twitter⟨11⟩](https://www.promakhos.com/<#>)\\n**Postdoc, Medical Oncology** Dana-Farber Cancer Institute\\n**Postdoc, Target Identification & Validation**Broad Institute of MIT and Harvard\\n**PhD., Functional Genomics & Chemical Biology\\u200d**KU Leuven\\n## Jasper E. Neggers, Ph.D.\\n### Co-Founder, Chief Scientific Officer and Secretary \\nJasper Edgar Neggers is a co-founder and the Chief Scientific Officer and Secretary of Promakhos Therapeutics. Jasper is an entrepreneurial, pioneering and innovative scientist with a background in microbiology, immunology, cell biology, target identification and validation, drug discovery and functional genomics. His commitment to entrepreneurship, scientific inquiry and translational research stems from his natural curiosity for biology and biotechnology, which manifested as he grew up in the Netherlands.\\nJasper performed his Ph.D. studies at the Rega Institute for Medical Research at the KU Leuven, Belgium. He was among the first scientists to apply CRISPR/Cas to genetically engineer human cells. Jasper collaborated with Karyopharm Therapeutics to validate the mechanism of action of the now marketed anticancer drug Selinexor (XPOVIO®) and the clinical stage drug KPT-9274. In Belgium, Jasper also invented a CRISPR-based genetic screening approach for identification of the cellular target of new candidate drugs.\\nJasper arrived in the USA as a postdoctoral fellow at the Dana-Farber Cancer Institute and the Broad Institute of MIT and Harvard to spearhead a team of researchers to identify and validate new therapeutic targets for cancer. He quickly distinguished himself and was awarded a Damon Runyon Cancer Research Foundation fellowship. As a fellow, Jasper developed an updated compendium of synthetic lethal interactions in cancer, helped identify new metabolic vulnerabilities in pancreatic cancer and continued developing new CRISPR/Cas applications. His work has nominated several new high-priority therapeutic targets for cancer and has led to the initiation of new drug discovery campaigns. As a rising scientific leader, Jasper was on his way to become an assistant professor after receiving the National Cancer Institute Pathway to Independence Award for Outstanding Early-Stage Postdoctoral Researchers. However, ultimately, Jasper wants his research to translate into patient impact and felt that an academic career would not provide the right environment to pursue his vision. So, he handed back his million-dollar grant money and joined Katerina to co-found Promakhos Therapeutics.\\n✖⟨12⟩\\n![Sofía M. Martínez Navarro⟨14⟩]\\nBio\\n## Sofía M. Martínez Navarro\\n### Research Associate\\n![Sofía M. Martínez Navarro⟨14⟩]\\n![LinkedIn Logo.⟨8⟩](https://www.promakhos.com/<https:/www.linkedin.com/in/sofia-martinez-navarro>)![Publication list⟨9⟩](https://www.promakhos.com/<#>)![Email Icon⟨10⟩](https://www.promakhos.com/<#>)![Twitter⟨11⟩](https://www.promakhos.com/<#>)\\n**Postgraduate in Bioengineering management** University of California, Riverside\\n**Bachelor of Science** Universidad Europea\\n## Sofía M. Martínez Navarro\\n### Research Associate\\nI am a biotechnology researcher passionate about innovation and learning. Complementary to my degree in biotechnology, I have a minor in management of biotechnological companies and a minor in molecular architecture. I am looking forward to being able to apply the knowledge gained during my years of study to the real world. I am also training as a professional piano player, and I am enrolled at the Rodolfo Halffter Conservatory. Learning music has allowed me to acquire a more artistic and creative vision as well as broaden my horizons.\\n✖⟨12⟩\\n# Advisors & collaborators\\n![Joshua R. Korzenik, M.D.⟨15⟩]\\nBio\\n## Joshua R. Korzenik, M.D.\\n## Clinical & Scientific\\n![Joshua R. Korzenik, M.D.⟨15⟩]\\n![LinkedIn Logo.⟨8⟩](https://www.promakhos.com/<https:/www.linkedin.com/in/joshua-korzenik-27761a133/>)![Publication list⟨9⟩](https://www.promakhos.com/<https:/connects.catalyst.harvard.edu/Profiles/display/Person/81506>)![Twitter⟨11⟩](https://www.promakhos.com/<#>)\\n**Associate Professor of Medicine** Harvard Medical School\\u200d**Resnek Family Distinguished Chair in Gastroenterology and Hepatology** Brigham and Women's Hospital\\n**Director of the Resnek Family Center for Primary Sclerosing Cholangitis Research** Brigham and Women's Hospital\\n\\u200d**Founding Director of the Crohn's and Colitis Center** Brigham and Women's Hospital\\n## Joshua R. Korzenik, M.D.\\nDr. Korzenik is a specialist in Gastroenterology, Hepatology and Endoscopy that focuses on developing new therapies for inflammatory bowel disease and primary sclerosing cholangitis. He is also well recognized for his compassion and dedication to his patients and for his integrative team approach to patient care. He is an Associate Professor of Medicine at Harvard Medical School, the Founding Director of the Crohn's and Colitis Center at the Brigham and Women’s Hospital, the Director of the Resnek Family Center for Primary Sclerosing Cholangitis Research at the Brigham and Women’s Hospital and the Resnek Family Distinguished Chair in Gastroenterology and Hepatology at the Brigham and Women’s Hospital.\\nDr. Korzenik has been involved in inflammatory bowel disease research and patient care for almost 25 years. His insights in Crohn’s disease and ulcerative colitis have opened new avenues of research and possible therapies, and he was among the first investigators to research the intestinal microbiome for clues about the role it may play in the development of inflammatory bowel disease as well as in its management through nutrition and therapeutics. Dr. Korzenik is an author of over 100 peer-reviewed articles and research papers and frequently speaks at professional meetings. He was named Humanitarian of the Year in 2013 by the New England Chapter of the Crohn’s and Colitis Foundation of America and was awarded the Torch of Friendship in 1999 by the Mid-America Chapter in St. Louis. Moreover, he has sequentially been selected as a Top Doctor by Boston Magazine in 2016, 2017, 2019, 2020, 2021, 2022 and 2023.\\nDr. Korzenik has led and was involved in many major clinical trials of new therapies for inflammatory bowel disease. For example, he has initiated a different therapeutic approach to Crohn’s disease through a set of multi-center clinical studies utilizing granulocyte colony stimulating factor (G-CSF) and granulocyte macrophagecolony-stimulating factor (GM-CSF) as therapeutic agents. In addition, based on an understanding of ulcerative colitis as a vascular disease and under-appreciated properties of heparin, he has previously developed clinical trials using heparin for the treatment of ulcerative colitis. His research has also focused on uncovering better biomarkers that can guide drug development and determine which interventions tested in clinical trials may be most effective and on understanding what initiates and perpetuates inflammation.\\n✖⟨12⟩\\n![Séverine Vermeire, M.D., Ph.D.⟨16⟩]\\nBio\\n## Séverine Vermeire, M.D., Ph.D.\\n## Clinical & Scientific\\n![Séverine Vermeire, M.D., Ph.D.⟨16⟩]\\n![LinkedIn Logo.⟨8⟩](https://www.promakhos.com/<#>)![Publication list⟨9⟩](https://www.promakhos.com/<#>)![Twitter⟨11⟩](https://www.promakhos.com/<https:/x.com/severinevermei1>)\\n**Professor of Medicine** KU Leuven\\u200d**Research Director of Biomedical Sciences** KU Leuven\\n## Séverine Vermeire, M.D., Ph.D.\\nProf. Dr. Séverine Vermeire obtained her MD from KU Leuven in 1995 and a PhD at the same University in 2001. She further trained at the Universidad Nacional de Asuncion, Paraguay (1993), at the Wellcome Trust Centre for Human Genetics in Oxford, UK (1997-1998) and at the Montreal General Hospital McGill University Canada in 2000–2001. She is staff member at the Gastroenterology & Hepatology Department of the University Hospital Leuven and Full Professor of Medicine at the KU Leuven. Since 2021, she is Research Director of Biomedical Sciences at KU Leuven. \\nProf. Vermeire is actively involved as principle investigator in RCTs with new therapeutic compounds and has been lead investigator on several of these programs. Her scientific work resulted in more than 600 peer-reviewed articles and focuses on the role of the microbiome and genetic susceptibility in IBD and on identifying prognostic and predictive signatures of treatment response. She participated in the International iCHOM consortium on development of Patient-Centered Outcomes for Inflammatory Bowel Disease. \\nShe was awarded an Advanced H2020-European Research Council (ERC) Grant (2016-2022) and was President of the European Crohn’s and Colitis Organisation (ECCO) from 2014-2016 and of the Belgian IBD Research & Development (BIRD) Group from 2011-2013.\\n✖⟨12⟩\\n![Juan Patarroyo, B.Sc.⟨17⟩]\\nBio\\n## Juan Patarroyo, B.Sc.\\n## Research & Development\\n![Juan Patarroyo, B.Sc.⟨17⟩]\\n![LinkedIn Logo.⟨8⟩](https://www.promakhos.com/<https:/www.linkedin.com/in/juan-patarroyo-27227b108/>)![Publication list⟨9⟩](https://www.promakhos.com/<#>)![Twitter⟨11⟩](https://www.promakhos.com/<#>)\\n**Mentor/Advisor** UF Innovate\\n**Director, Science Operations & Strategy\\u200d**Lab Central\\n## Juan Patarroyo, B.Sc.\\nJuan Patarroyo is an experienced biomedical scientist and life sciences operations expert with over 25 years of experience in immunology/microbiology, with specific expertise on mucosal immunology and the microbiome. He is fascinated by the interplay between the immune system (and in extension the body) and the commensal microbes and their associated (by)products. By understanding and leveraging this interplay, he strongly believes that we can develop meaningful and safe immunomodulatory drugs to treat and cure disease.\\nJuan has designed, executed, and supervised a large range of _in vitro_ and _in vivo_ studies to evaluate immune signaling and candidate molecules for go/no-go drug development decisions within pharma (Novartis, Pfizer, Vedanta Biosciences) and academia (UCSF). He has built and managed R&D labs of newly formed biotechnology companies (Vedanta, Commence) and advised life sciences companies on science strategy and operations at LabCentral. His work has directly contributed to the advancement of several drug candidates to preclinical testing and of VE303 (Vedanta) to the clinic. Most recently, Juan was a Principal Scientist at the Novartis Institutes for BioMedical Research and established a discovery platform harnessing the gastrointestinal microbiome to identify next-generation small molecules for autoimmune and allergic conditions, with a focus on discovering therapeutics that promote wound healing and epithelial barrier function in inflammatory bowel disease. \\nEarly on, Juan has helped shaped our understanding of the role of major histocompatibility (MHC) class II restricted antigen processing and presentation in the central nervous system and in the role played by myelin-specific antibodies in experimental autoimmune encephalomyelitis (EAE), a model of multiple sclerosis. He has also been involved in studies characterizing the mechanism and protective effect of glatirameracetate (Copaxone), atorvastatin (Lipitor) and anti-CD20 antibody (Rituxan) in CNS autoimmune disease. Juan then joined the multiple sclerosis group at Pfizer to support the discovery and development of new drugs. There, he evaluated new anti-inflammatory biologics and small molecules. As the role of the microbiome in human health became established, he led evaluated natural ligand derivatives for their ability to promote immunotolerance and mucosal repair in inflammatory bowel disease.\\n✖⟨12⟩\\n![Tomi K. Sawyer, Ph.D.⟨18⟩]\\nBio\\n## Tomi K. Sawyer, Ph.D.\\n## Drug Discovery & Development\\n![Tomi K. Sawyer, Ph.D.⟨18⟩]\\n![LinkedIn Logo.⟨8⟩](https://www.promakhos.com/<https:/www.linkedin.com/in/tomi-sawyer-0090714/>)![Publication list⟨9⟩](https://www.promakhos.com/<https:/scholar.google.com/citations?user=3qbxorEAAAAJ&hl=en>)![Twitter⟨11⟩](https://www.promakhos.com/<#>)\\n**Chief Drug Hunter & President**Maestro Therapeutics\\u200d\\u200d**Adjunct Professor, Center for Drug Discovery** Northeastern University\\u200d**Adjunct Professor, Departments of Chemistry, Biochemistry & Molecular Biology**University of Massachusetts Amherst\\n## Tomi K. Sawyer, Ph.D.\\nTomi Sawyer serves as a drug discovery and development consultant. Tomi is an accomplished and entrepreneurial drug hunter, medicinal chemist and chemical biologist with a track record of developing both peptide and small molecule drugs. Tomi has over four decades of industrial experience in both pharma and biotech and is well known for his contributions to GPCR, kinase, protease and protein-protein interaction drug discovery. He is the inventor of the marketed drugs Afamelanotide (Scenesse®, Clinuvel) and Ponatinib (Iclusig®, Ariad Pharmaceuticals [now Takeda]) and is credited with over 600 scientific publications, patents, and presentations.\\nTomi is currently the Chief Drug Hunter and President of Maestro Therapeutics, a consulting/advisory enterprise that supports peptide drug discovery in academia, biotech and pharma. Tomi Sawyer has recently retired from his position as Distinguished Scientist, Global Chemistry at Merck Research Laboratories. In this role, he provided leadership to the Peptide Drug Hunter Network and several peptide R&D programs as well as innovative core capabilities and knowledge engine. He previously also served as the Chief Scientific Officer of Aileron, Senior Vice President, Drug Discovery at Ariad Pharmaceuticals, Senior Director, Chemical Sciences at Pfizer and was a past President of the American Peptide Society.\\nTomi is an Adjunct Professor at the University of Massachusetts and the Northeastern University Center for Drug Discovery. In addition, he is a Distinguished Alumni Entrepreneur from his undergraduate _alma mater_ , Minnesota State University at Moorhead, and previously served as a member of the MSUM Alumni Foundation Board of Directors. At his graduate _alma mater_ , the University of Arizona, Tomi is a Distinguished Alumni Entrepreneur and has received a Professional Achievement Award from the Department of Chemistry & Biochemistry and the College of Science. \\n✖⟨12⟩\\n![Alexander Bryant, Ph.D.⟨19⟩]\\nBio\\n## Alexander Bryant, Ph.D.\\n## Pharmacology & Toxicology\\n![Alexander Bryant, Ph.D.⟨19⟩]\\n![LinkedIn Logo.⟨8⟩](https://www.promakhos.com/<https:/www.linkedin.com/in/alexander-bryant-biotech/>)![Publication list⟨9⟩](https://www.promakhos.com/<#>)![Twitter⟨11⟩](https://www.promakhos.com/<#>)\\n**President\\u200d** Lightship Scientific Consulting, LLC\\n\\u200d\\n\\u200d\\n## Alexander Bryant, Ph.D.\\nDr. Alexander Bryant is a pharmacology-toxicology expert with over 20 years of experience in drug development. He previously served as the Vice President of Preclinical Research and Development, Pharmacology and Toxicology at Ironwood Pharmaceuticals. Prior to his role at Ironwood, he was a senior director in preclinical pharmacology at Microbia. \\nAt Ironwood and Microbia,he was responsible for the preclinical discovery, development and toxicology of linaclotide (LINZESS®), a non-systemic oral drug for treating irritable bowel syndrome with constipation (IBS-C). He authored a large part of the NDA for linaclotide’s FDA approval.\\nDr. Bryant is now the President of Lightship Scientific Consulting, which provides innovative advice and solutions from experienced pharmaceutical and biotech R&D professionals. His team of expert consultants can provide advice on every aspect of the drug discovery and development process.\\n✖⟨12⟩\\n![Caroline Kurtz, Ph.D.⟨20⟩]\\nBio\\n## Caroline Kurtz, Ph.D.\\n## Drug Development\\n![Caroline Kurtz, Ph.D.⟨20⟩]\\n![LinkedIn Logo.⟨8⟩](https://www.promakhos.com/<https:/www.linkedin.com/in/caroline-kurtz-02437313/>)![Publication list⟨9⟩](https://www.promakhos.com/<#>)![Twitter⟨11⟩](https://www.promakhos.com/<#>)\\n**CSO Partner** Lightship Scientific Consulting\\n**Chief Development Officer\\u200d** Synlogic Inc.\\n\\u200d**PhD., Immunology\\u200d** Harvard University\\n## Caroline Kurtz, Ph.D.\\nCaroline Kurtz, Ph. D, provides scientific and strategic guidance for drug development stage programs grounded in over 29 years of experience developing unique products for patients with metabolic and gastrointestinal diseases. Dr. Kurtz’s direct experience includes leadership in preclinical, clinical development and regulatory affairs for products in the stages of lead identification through marketing authorization. She brings specific expertise in developing novel therapeutic platforms, operating through local delivery in the GI tract, and rare disease drug development. In addition, throughout her career Dr. Kurtz has been a leader in the establishment of strong cross-functional and cross-company collaborations and teams.\\nPrior to joining Lightship Scientific Consulting, Dr. Kurtz was Chief Development Officer at Synlogic Inc, a clinical stage biopharmaceutical company developing engineered living cell therapies for the treatment of rare metabolic and immune-mediated diseases. At Synlogic, Dr. Kurtz oversaw translational research and development activities for discovery and clinical stage programs for inflammatory bowel disease, oncology and rare metabolic diseases, including advancing into Phase 3 the investigational product SYNB1934 for phenylketonuria. Prior to Synlogic, Caroline served as Vice President and Program Lead at Ironwood Pharmaceuticals, bringing the novel peptide drug linaclotide, (LINZESS®), from preclinical development through commercialization for the treatment of irritable bowel syndrome and chronic constipation. LINZESS is now one of the most highly prescribed products for patients with irritable bowel syndrome. Dr. Kurtz also worked at GelTex/Genzyme, overseeing the discovery and development of polymers for the treatment of infectious diseases, including leading a clinical stage program for the treatment of _C. difficile_ colitis.\\nHer early scientific training was in the fields of immunology, virology, and autoimmune demyelinating diseases. Dr. Kurtz holds a Ph.D. in Immunology from Harvard University, and a BSc (summa cum laude) in Biochemistry from the University of New Hampshire.\\n✖⟨12⟩\\n![Mary Christian, PharmD., MBA⟨21⟩]\\nBio\\n## Mary Christian, PharmD., MBA\\n## Regulatory Expert\\n![Mary Christian, PharmD., MBA⟨21⟩]\\n![LinkedIn Logo.⟨8⟩](https://www.promakhos.com/<https:/www.linkedin.com/in/mary-christianpharmd/>)![Publication list⟨9⟩](https://www.promakhos.com/<#>)![Twitter⟨11⟩](https://www.promakhos.com/<https:/twitter.com/drmarypharmd>)\\n**Senior Vice President, Regulatory** C4 Therapeutics\\n\\u200d\\n## Mary Christian, PharmD., MBA\\nDr. Christian is a pharmaceutical and biotech executive with more than 20 years of regulatory and drug development experience across pharmaceutical and biotechnology companies. She has created high functioning, fit-for-purpose teams for emerging biotech, envisioned and built new capabilities in large pharma (e.g. Bristol-Myers Squibb Oncology Strategic Collaborations, leading to success in >$50M in development partnerships), and led R&D efforts across a variety of therapeutic areas including, but not limited to, CNS, immunology, and immuno-oncology in all phases of development. \\nDr. Christian serves as the Senior Vice President of Regulatory at C4 Therapeutics, a clinical stage biotech developing a pipeline of targeted protein degraders for oncology. Besides her role at C4, Dr. Christian also serves as a scientific advisor to several emerging biotech companies and lectures at MIT on Regulatory Strategies for developing drugs and devices. \\nPrior to C4, Dr. Christian was the Senior Vice President of Regulatory, Quality and Compliance at Lyndra Therapeutics, a rapidly growing clinical stage biotech whose mission is to reinvent medicine for a healthier world. She was also a founding member of Cyclerion Therapeutics, a spinout of Ironwood Pharmaceuticals focused on serious and orphan diseases, where she led Regulatory, Quality and Pharmacovigilance. Before her role at Cyclerion, Dr. Christian was Vice President of Global Regulatory Affairs at Ironwood Pharmaceuticals, where she transformed the regulatory organization, successfully negotiated approval of a stalled marketing application for Linzess® in China, advanced rare disease assets into Phase 1 and 2 and built organization models that enabled the spinoff of various assets. \\nPrior to joining the world of biotech in Boston, Dr. Christian created and led successful and innovative teams at Bristol-Myers Squibb by identifying novel ways to accelerate research and the delivery of medicines to patients globally. Dr. Christian also held roles of increasing responsibility in Global Regulatory Affairs at Johnson & Johnson Pharmaceutical Research & Development (now Janssen Pharmaceutica) across several therapeutic areas.\\n✖⟨12⟩\\n# News\\n# February 10, 2025\\n## Listen to our latest interview by the Propel a Cure for Crohn's disease foundation\\n# News\\nPress Release\\n•\\n## Charlottesville, Virginia\\n•\\nFebruary 10, 2025\\n# Listen to our latest interview by the Propel a Cure for Crohn's disease foundation\\nWe are honored to have received the 2024 research award and support of Propel a Cure for Crohn's disease. In a new interview,⟨22⟩ we had the honor of sitting down with Annabelle and Angela of Propel a Cure to share our latest results and discuss the work we’re doing. We want to extend our gratitude to the donors who support us and the foundation. Your contributions are making a difference and are the driving force behind the hope we are working to create.\\nPropel a Cure is an all-volunteer nonprofit organization that focuses on the needs of Crohn's patients, their families, friends, and caregivers. You can read more about their work here⟨23⟩.\\n\\u200d\\n✖⟨12⟩\\n# October 31, 2024\\n## Join Promakhos Therapeutics and our CEO Katerina Chatzi at the MassNextGen 2024 showcase event!\\n# News\\nAnnouncement\\n•\\n## Allston, Massachusetts, United States of America\\n•\\nOctober 31, 2024\\n# Join Promakhos Therapeutics and our CEO Katerina Chatzi at the MassNextGen 2024 showcase event!\\nOn Wednesday, November 6, 2024, our CEO Katerina Chatzi will present Promakhos Therapeutics at the MassNextGen 2024 Showcase event in Boston, Massachusetts. Register here⟨24⟩. We look forward to seeing you there!\\nThis showcase event is organized by the Massachusetts Life Sciences Center to highlight award-winning and leading life sciences start-up companies in Massachusetts. This year, Katerina Chatzi of Promakhos Therapeutics won the Massachusetts Next Generation (MassNextGen) Initiative award. After a competitive process, Promakhos and four other women-led companies from Massachusetts were selected for this award, which includes ~$100K funding for the company, other in-kind services and access to a network of seasoned professionals from the life sciences ecosystem.\\nWe are very grateful to be able to grow our company in a state that supports entrepreneurship and under-represented founders!\\nFor more information on the Massachusetts Life Sciences Center please visit here⟨25⟩.\\u200d⟨26⟩\\u200d\\n\\u200d\\n✖⟨12⟩\\n# February 19, 2024\\n## Promakhos Therapeutics awarded the Propel a Cure for Crohn's disease 2024 research award\\n# News\\nAnnouncement\\n•\\n## Allston, Massachusetts, United States of America\\n•\\nFebruary 19, 2024\\n# Promakhos Therapeutics awarded the Propel a Cure for Crohn's disease 2024 research award\\nPromakhos Therapeutics is incredibly honored to share that the company has been awarded the Propel a Cure for Crohn's Disease⟨27⟩ research award for 2024! \\u200dPropel a Cure is an all-volunteer nonprofit organization that focuses on the needs of Crohn's patients, their families, friends, and caregivers. This year, the organization raised funds and utilized its expert scientific advisory board to select a pioneering research team to support their research to identify the underlying cause or causes of Crohn’s disease and the development of a cure. The $100,000 award was awarded to a single team after a competitive review process of several applications submitted in December 2023.\\nPromakhos Therapeutics is humbled to have been awarded this project grant, as the Propel a Cure organization strives to change the status quo and deliver patient impact. As it is also run by Crohn's patients or their family or friends with close experience with this debilitating disease, it means a lot to us! Stay tuned to hear about our progress in the next 1~1.5 years.\\n✖⟨12⟩\\n# January 24, 2024\\n## Promakhos Therapeutics' Katerina Chatzi wins this year's MassNextGen award from the Massachusetts Life Sciences Center \\n# News\\nAnnouncement\\n•\\n## Cambridge, Massachusetts, United States of America\\n•\\nJanuary 24, 2024\\n# Promakhos Therapeutics' Katerina Chatzi wins this year's MassNextGen award from the Massachusetts Life Sciences Center \\n> _This is an announcement supporting the_ _original article_⟨28⟩ _published by the Massachusetts Life Sciences Center on January 24, 2024._\\nWe are very honored to announce that Promakhos Therapeutics' Katerina Chatzi, PhD won this year’s Massachusetts Next Generation (MassNextGen) Initiative award from the Massachusetts Life Sciences Center (MLSC). After a competitive process, Promakhos and four other women-led companies from Massachusetts were selected for this award, which includes ~$100K funding for the company, other in-kind services and access to a network of seasoned professionals from the life sciences ecosystem.\\nOn Wednesday, Massachusetts Secretary of Economic Development Yvonne Hao joined the Massachusetts Life Sciences Center at Takeda in Cambridge to announce the awardees of the Massachusetts Next Generation (MassNextGen) Initiative. We are very grateful to be able to grow our company in a state that supports entrepreneurship and under-represented founders!\\nFor more information on the Massachusetts Life Sciences Center please visit here⟨25⟩.\\u200d⟨26⟩\\u200d\\n✖⟨12⟩\\n# November 3, 2023\\n## Read the new interview of Katerina Chatzi, Promakhos Therapeutics' CEO and founder, by Alex Alexakis of Startup Pirate!\\n# News\\nThought Leadership\\n•\\n## Athens, Greece\\n•\\nNovember 3, 2023\\n# Read the new interview of Katerina Chatzi, Promakhos Therapeutics' CEO and founder, by Alex Alexakis of Startup Pirate!\\n> \\u200d _This is a news announcement supporting the_ _original article_⟨29⟩ _published by the Startup Pirate on November 3, 2023._\\nSome of the most challenging diseases of our time — atherosclerotic, neurodegenerative, metabolic, autoimmune diseases, etc. — may ride the same steed: inflammation. Inflammation, by definition, should be good. It is the way our body heals itself after injury. But chronic, unchecked, continually ramped-up inflammation leads to the opposite: chronic disorders in many forms.\\nToday, Alex Alexakis⟨30⟩ of Startup Pirate interviewed our CEO and founder Katerina Chatzi, PhD⟨31⟩. He asked all the right questions about inflammatory diseases and allowed Katerina to provide some context! Check out the interview⟨29⟩ to learn about:\\n\\u200d _How inflammation becomes chronic and why inflammatory diseases are prevalent in our societies nowadays_\\n_Redefining how inflammatory diseases are cured by activating the immune system_\\n_The process from molecule design to developing new therapies_\\n_Challenges building a biotech startup_\\n✖⟨12⟩\\n# September 1, 2023\\n## Promakhos Therapeutics receives $272K NIH Phase 1 SBIR grant to develop new oral immunomodulating therapy for Crohn's disease\\n# News\\nAnnouncement\\n•\\n## Allston, Massachusetts, United States of America\\n•\\nSeptember 1, 2023\\n# Promakhos Therapeutics receives $272K NIH Phase 1 SBIR grant to develop new oral immunomodulating therapy for Crohn's disease\\nPromakhos Therapeutics is proud to announce the receipt of a Phase 1 Small Business Innovation Research (SBIR) Grant from the National Institute of Diabetes and Digestive and Kidney Diseases (NIDDK). This SBIR grant (1R43DK135153-01)⟨32⟩ provides $271,865 to support the preclinical development and validation of Promakhos' oral drug candidate for treating Crohn's disease. This candidate is designed to restore intestinal innate immune function and wound healing to resolve bowel inflammation without suppressing the immune system.\\n✖⟨12⟩\\n# May 20, 2023\\n## Promakhos Therapeutics named as a Life Sciences Company to Watch by Big4Bio\\n# News\\nAnnouncement\\n•\\n## San Francisco, California, United States of America\\n•\\nMay 20, 2023\\n# Promakhos Therapeutics named as a Life Sciences Company to Watch by Big4Bio\\n> _This is a news announcement supporting the_ _original article_⟨33⟩ _published by the Big4Bio news aggregator on May 20, 2023. To learn more about Big4Bio, visit:__https://big4bio.com/life-sciences-biotech-news/_⟨34⟩\\nPromakhos Therapeutics is excited to share that the company has been listed as a Life Sciences company to Watch by Big4Bio. Big4Bio is a premier aggregator of news and developments in the life sciences sector. Its name stands for the cornerstone “Big 4” in biosciences and health: drugs, devices, diagnostics, and digital (also known as the “four D’s”). Big4Bio produces individual summaries for the most significant life sciences markets in the world.\\n✖⟨12⟩\\n# May 1, 2023\\n## Promakhos Therapeutics selected as finalist at BIO 2023 and will present at the BIO 2023 Start-Up Stadium in Boston this June\\n# News\\nAnnouncement\\n•\\n## Boston, Massachusetts, United States of America\\n•\\nMay 1, 2023\\n# Promakhos Therapeutics selected as finalist at BIO 2023 and will present at the BIO 2023 Start-Up Stadium in Boston this June\\nPromakhos Therapeutics is pleased to announce that the company has been selected as a Start-Up finalist for the 2023 BIO International convention⟨35⟩. \\nOur CEO, Katerina Chatzi, will showcase and present our mission and vision on stage at the BIO 2023 Start-Up Stadium in Boston on Tuesday June 6th, 2023 11:00 AM-1:00 PM. We look forward to seeing you there!\\u200d\\n✖⟨12⟩\\n# March 30, 2023\\n## Promakhos Therapeutics selected as finalist of the 2023 Harvard President's Innovation Challenge\\n# News\\nAnnouncement\\n•\\n## Allston, Massachusetts, United States of America\\n•\\nMarch 30, 2023\\n# Promakhos Therapeutics selected as finalist of the 2023 Harvard President's Innovation Challenge\\nPromakhos Therapeutics has been selected as a finalist of the 2023 Harvard President's Innovation Challenge⟨36⟩ - Health & Life Sciences track. The Innovation challenge is a call to action, innovation and entrepreneurship – and an opportunity to win up to $75,000 (Grand Prize) or $25,000 (Runner-up) in non-dilutive funding. In May, Katerina Chatzi, our CEO, will present ⟨37⟩the company to a large audience at the Harvard Business School during the final event. We hope to see you there!\\n✖⟨12⟩\\n# October 24, 2022\\n## Promakhos Therapeutics welcomes Dr. Mary Christian to the scientific advisory board\\n# News\\nAnnouncement\\n•\\n## Allston, Massachusetts, United States of America\\n•\\nOctober 24, 2022\\n# Promakhos Therapeutics welcomes Dr. Mary Christian to the scientific advisory board\\nPromakhos Therapeutics is excited to announce that Dr. Mary Christian has joined the company's scientific advisory board. \\nDr. Christian is a pharmaceutical and biotech executive who delivers visionary, innovative solutions in complex landscapes. She has a diverse experience in drug development spanning from regulatory strategy to establishing external partnerships with key academic institutions in the US to drive common research and development goals. She has created high functioning, fit-for-purpose teams for emerging biotech, envisioned and built new capabilities in large pharma (e.g. Bristol-Myers Squibb Oncology Strategic Collaborations, leading to success in >$50M in development partnerships), and led R&D efforts across a variety of therapeutic areas including but not limited to CNS, immunology, and immuno-oncology in all phases of development. She thrives where she is trusted, purpose-driven and ever-learning; strengths include collaborative problem solving, partnering for mutual success and diverse & inclusive leadership. \\nDr. Christian is the Senior Vice President of Regulatory, Quality and Compliance at Lyndra Therapeutics, a rapidly growing clinical stage biotech whose mission is to reinvent medicine for a healthier world. Lyndra is developing a pipeline of long-acting oral therapies. The regulatory pathway to global approval is uncharted for products this unique; Dr. Christian is committed to leveraging 20+ years of regulatory and drug development experience, working with the stellar Lyndra team, to accelerate these important therapies to patients. She also serves as a scientific advisor to several emerging biotech companies and lectures at MIT on Regulatory Strategies for developing drugs and devices. \\nPrior to Lyndra, Dr. Christian was a founding team member of Cyclerion Therapeutics, a spinout of Ironwood Pharmaceuticals focused on serious and orphan diseases, where she led Regulatory, Quality and Pharmacovigilance. She was Vice President of Global Regulatory Affairs at Ironwood Pharmaceuticals where she transformed the Regulatory organization and successfully negotiated approval of a stalled marketing application for Linzess® in China, advanced rare disease assets into Phase 1 and 2 and built organization models that enabled the spinoff. \\nPrior to joining the world of biotech in Boston, Dr. Christian created and led successful and innovative teams at Bristol-Myers Squibb by identifying novel ways to accelerate research and the delivery of medicines to patients globally. Dr. Christian also held roles of increasing responsibility in Global Regulatory Affairs at Johnson & Johnson Pharmaceutical Research & Development (now Janssen Pharmaceutica) across several therapeutic areas. \\n✖⟨12⟩\\n Older ⟨38⟩\\n1 / 3\\n# Support\\n## Partners\\n![Metaplanet logo⟨39⟩]![Y Combinator Logo\\n⟨40⟩]![Logo of the Propel a Cure for Crohn's disease nonprofit organization.⟨41⟩]![FAST logo⟨42⟩]![Logo of Harvard Innovation Labs⟨43⟩] ![Logo of the National Institute of Diabetes and Digestive and Kidney Diseases⟨44⟩]![Logo of The Massachusetts Life Sciences Center⟨45⟩]![The Allston Venture Fund⟨46⟩]![Logo of Pioneer Fund⟨47⟩]![Morrison Foerster⟨48⟩]\\n## Network\\n![Brigham and Women's Hospital⟨49⟩]![Broad Institute⟨50⟩]![IMBB-FORTH logo.\\n⟨51⟩]![MassBio⟨52⟩] ![Harvard University⟨53⟩]![Dana-Farber Cancer Institute⟨54⟩]![KU Leuven logo.⟨55⟩]\\nContact us\\nfounders@promakhos.com\\nPagliuca Harvard Life Lab127 Western Avenue, Allston, MA 02134-1008United States of America\\n© 2021-2025 Promakhos Therapeutics, Inc. All rights reserved.\\n\" references_markdown=\"\\n\\n## References\\n\\n⟨1⟩ https://cdn.prod.website-files.com/5f08987a4affa2787555ddd9/608cc5978103db993b192ca7_Promakhos%20Therapeutics.png: ![\\n⟨2⟩ https://www.promakhos.com/<#Team>: Team\\n⟨3⟩ https://www.promakhos.com/<#News>: News\\n⟨4⟩ https://www.promakhos.com/<#Support>: Support\\n⟨5⟩ https://www.promakhos.com/<#Contact>: Contact\\n⟨6⟩ https://cdn.prod.website-files.com/5f08987a4affa2787555ddd9/608d7f4e85a59564fc1d4aca_CC0%20-%20Public%20Domain%20Image%20Bird%20Eye%20View%20of%20Ocean-Resized.jpg: A calm and blue sea with very small waves.\\n⟨7⟩ https://cdn.prod.website-files.com/60162107d3effb6f041245eb/65c2689cb6f40f737de939f6_Katerina_500px_reducedsize.png: Katerina Chatzi, Ph.D.\\n⟨8⟩ https://cdn.prod.website-files.com/5f08987a4affa2787555ddd9/608f66f8b7c61ad0d7e1ff91_In-Blue-Logo.png.original.png: ![LinkedIn Logo.\\n⟨9⟩ https://cdn.prod.website-files.com/5f08987a4affa2787555ddd9/614baec336fecf99b2f048e2_Graduation-Cap.png: ![Publication list\\n⟨10⟩ https://cdn.prod.website-files.com/5f08987a4affa2787555ddd9/60aeb905d2ecff3be04d2dd6_Email-icon_blue.png: Email Icon\\n⟨11⟩ https://cdn.prod.website-files.com/5f08987a4affa2787555ddd9/614ce97df55d556b7537161e_2021%20Twitter%20logo%20-%20blue.png: ![Twitter\\n⟨12⟩ https://www.promakhos.com/<#>: ✖\\n⟨13⟩ https://cdn.prod.website-files.com/60162107d3effb6f041245eb/65c268945f8c2812efef82ea_Jasper_500px_reducedsize.png: Jasper E. Neggers, Ph.D.\\n⟨14⟩ https://cdn.prod.website-files.com/60162107d3effb6f041245eb/673816be8c09be533a198c39_Sofia_reducedsize.png: Sofía M. Martínez Navarro\\n⟨15⟩ https://cdn.prod.website-files.com/60162107d3effb6f041245eb/60b139aa08a3dc423ebe5cc9_Advisers%20-%20Joshua%20Korzenik%20-400px.jpg: Joshua R. Korzenik, M.D.\\n⟨16⟩ https://cdn.prod.website-files.com/60162107d3effb6f041245eb/6737a932d4b41a838c15c70e_Severine%20Vermeire-500px.png: Séverine Vermeire, M.D., Ph.D.\\n⟨17⟩ https://cdn.prod.website-files.com/60162107d3effb6f041245eb/65c26add62a04e51a8be21e3_Advisers%20-%20Juan%20Pattaroyo-340px.jpg: Juan Patarroyo, B.Sc.\\n⟨18⟩ https://cdn.prod.website-files.com/60162107d3effb6f041245eb/6093578627e7aed188c7ef3d_Tomi%20Sawyer.jpg: Tomi K. Sawyer, Ph.D.\\n⟨19⟩ https://cdn.prod.website-files.com/60162107d3effb6f041245eb/6737a3b6cf7ace58f1c36f34_Advisers%20-%20Alexander%20Bryant.jpg: Alexander Bryant, Ph.D.\\n⟨20⟩ https://cdn.prod.website-files.com/60162107d3effb6f041245eb/6737a84e22e0e3f6dd3bcfee_Synlogic_Dr_Caroline_Kurtz-300x300.jpg: Caroline Kurtz, Ph.D.\\n⟨21⟩ https://cdn.prod.website-files.com/60162107d3effb6f041245eb/635730b67ed10054a208390b_202210124%20MaryC%20LYN%202022b.jpg: Mary Christian, PharmD., MBA\\n⟨22⟩ https://www.promakhos.com/<https:/www.youtube.com/watch?v=a4PWkwPXD_U>: new interview,\\n⟨23⟩ https://www.promakhos.com/<https:/www.propelacure.org/>: here\\n⟨24⟩ https://www.promakhos.com/<https:/www.eventbrite.com/e/massnextgen-showcase-tickets-901471815467>: here\\n⟨25⟩ https://www.promakhos.com/<https:/www.masslifesciences.com/about/>: here\\n⟨26⟩ https://www.promakhos.com/<https:/www.massbio.org/>: \\u200d\\n⟨27⟩ https://www.promakhos.com/<https:/www.propelacure.org/researchprojects>: Propel a Cure for Crohn's Disease\\n⟨28⟩ https://www.promakhos.com/<https:/www.masslifesciences.com/healey-driscoll-administration-and-massachusetts-life-sciences-center-announce-awardees-for-public-private-initiative-to-support-diverse-entrepreneurs/>:  _original article_\\n⟨29⟩ https://www.promakhos.com/<https:/www.startuppirate.com/p/developing-therapies-for-chronic>:  _original article_\\n⟨30⟩ https://www.promakhos.com/<https:/www.linkedin.com/in/ACoAAASLzlkBNRe5YUgsiGECu_SBiGHT0-qCVw4>: Alex Alexakis\\n⟨31⟩ https://www.promakhos.com/<https:/www.linkedin.com/in/ACoAACpF3b4BmZn5-mU3ugQRAX46yDDb7q4hm28>: Katerina Chatzi, PhD\\n⟨32⟩ https://www.promakhos.com/<https:/reporter.nih.gov/search/OrK86BmUM0uhfwlbER7edQ/project-details/10600659>: This SBIR grant (1R43DK135153-01)\\n⟨33⟩ https://www.promakhos.com/<https:/big4bio.com/companies/to-watch/bio2023/the-big4bio-company-to-watch-program-june-2023-startup-stadium-finalists-at-bio-2023/>:  _original article_\\n⟨34⟩ https://www.promakhos.com/<https:/big4bio.com/life-sciences-biotech-news/>: _https://big4bio.com/life-sciences-biotech-news/_\\n⟨35⟩ https://www.promakhos.com/<https:/www.bio.org/events/bio-international-convention/start-stadium-2023>: Start-Up finalist for the 2023 BIO International convention\\n⟨36⟩ https://www.promakhos.com/<https:/news.harvard.edu/gazette/story/2023/03/presidents-innovation-challenge-names-finalists-for-2023/>: 2023 Harvard President's Innovation Challenge\\n⟨37⟩ https://www.promakhos.com/<https:/www.youtube.com/watch?v=C5sU8G_jJJo>: present \\n⟨38⟩ https://www.promakhos.com/<?911cbdbf_page=2>:  Older \\n⟨39⟩ https://cdn.prod.website-files.com/5f08987a4affa2787555ddd9/61ec3586f5a2cb3d6481435d_Metaplanet2.png: Metaplanet logo\\n⟨40⟩ https://cdn.prod.website-files.com/5f08987a4affa2787555ddd9/61e1dc4913a6397895c207bf_Y%20Combinator.png: Y Combinator Logo\\n\\n⟨41⟩ https://cdn.prod.website-files.com/5f08987a4affa2787555ddd9/65d76c560cfd02dd4e8685ac_Propel-a-Cure_2.png: Logo of the Propel a Cure for Crohn's disease nonprofit organization.\\n⟨42⟩ https://cdn.prod.website-files.com/5f08987a4affa2787555ddd9/62068b76aad1bde0b6888cf0_Fast1-t.png: FAST logo\\n⟨43⟩ https://cdn.prod.website-files.com/5f08987a4affa2787555ddd9/61e1d9450e1bc429dfe4984c_Harvard%20Innovation%20Labs-new.png: Logo of Harvard Innovation Labs\\n⟨44⟩ https://cdn.prod.website-files.com/5f08987a4affa2787555ddd9/64ffb73370c590b73e122d4b_NIDDK.png: Logo of the National Institute of Diabetes and Digestive and Kidney Diseases\\n⟨45⟩ https://cdn.prod.website-files.com/5f08987a4affa2787555ddd9/65c2a1105499fb72f5714970_MLSC_Logo2024.jpg: Logo of The Massachusetts Life Sciences Center\\n⟨46⟩ https://cdn.prod.website-files.com/5f08987a4affa2787555ddd9/60b7f8cd5ed14d90af2a209f_Allston%20Venture%20Fund.png: The Allston Venture Fund\\n⟨47⟩ https://cdn.prod.website-files.com/5f08987a4affa2787555ddd9/61ec3878ef8694bfc2d304e9_Pioneer%20Fund2.png: Logo of Pioneer Fund\\n⟨48⟩ https://cdn.prod.website-files.com/5f08987a4affa2787555ddd9/60b7f5a46b2c3c42a972358a_Morrison%20Foester%20-Transparent.png: Morrison Foerster\\n⟨49⟩ https://cdn.prod.website-files.com/5f08987a4affa2787555ddd9/60b7fe6ff3d9a1f51fc2213c_Brigham%20and%20Women%C2%B4s%20Hospital.png: Brigham and Women's Hospital\\n⟨50⟩ https://cdn.prod.website-files.com/5f08987a4affa2787555ddd9/60b7f9f80f45f6457cda12e8_Broad-Logo_transparant.png: Broad Institute\\n⟨51⟩ https://cdn.prod.website-files.com/5f08987a4affa2787555ddd9/60c63f5c61a1021c9e68baa2_IMBB-FORTH.png: IMBB-FORTH logo.\\n\\n⟨52⟩ https://cdn.prod.website-files.com/5f08987a4affa2787555ddd9/60b7ff690babf92f5f02a07b_MassBio.png: MassBio\\n⟨53⟩ https://cdn.prod.website-files.com/5f08987a4affa2787555ddd9/60b7ff0f07578230e9caa646_Harvard%20University.png: Harvard University\\n⟨54⟩ https://cdn.prod.website-files.com/5f08987a4affa2787555ddd9/60b7fa7d5878782c67c96ff2_Dana-Farber%20Cancer%20Institute%20Logo.png: Dana-Farber Cancer Institute\\n⟨55⟩ https://cdn.prod.website-files.com/5f08987a4affa2787555ddd9/60c63e8aba3a28cbb7b96709_KU%20Leuven.png: KU Leuven logo.\\n\" fit_markdown='' fit_html=''",
  "generated_description": "**Promakhos Therapeutics: A New Frontier in Inflammatory Disease Treatment**\n\nFounded in 2021 and based in Boston, Promakhos Therapeutics is on a mission to revolutionize the treatment of inflammatory disorders. Their approach is refreshing and bold; instead of just suppressing the immune system—which is the standard method for treating chronic inflammatory diseases today—they aim to restore its inherent ability to regulate inflammation and facilitate healing.\n\n### The Beginning and Future Directions\n\nInitially, Promakhos began by focusing on leveraging bacterial molecules to enhance the body’s innate immune response. Their first target? Crohn's disease, which carries a staggering annual treatment cost of around $10 billion in the U.S. Following Crohn's, they plan to tackle type 1 diabetes and multiple sclerosis—conditions that also stem from immune system dysregulation.\n\n### A Small but Mighty Team\n\nWith a compact team of just two full-time employees, Promakhos is powered by the vision of Co-founders **Katerina Chatzi, Ph.D.**, and **Jasper E. Neggers, Ph.D.** Both bring extensive backgrounds in biology and immunology, complemented by their entrepreneurial spirit. Their impressive track records include postdoctoral work at prestigious institutions like Harvard University and KU Leuven, where they honed their expertise in research, business development, and drug discovery.\n\n### Innovative Therapeutics Platform\n\nPromakhos is not just another biotech company. They're developing a unique therapeutics platform that centers on treating the root causes of inflammatory diseases—an approach that very few in the industry are taking. Instead of simply managing symptoms, they aim to fundamentally change how chronic inflammation is addressed. As they grow, their platform may become a pivotal part of modern medicine in managing autoimmune conditions.\n\n### Awards and Recognition\n\nRecognizing its innovative approach and potential impact, Promakhos has garnered attention from organizations like Y Combinator and the Massachusetts Life Sciences Center. Their recent achievements include winning the **Massachusetts Next Generation Initiative Award**, awarded to women-led startups that show promise. They also received a **$272,000 NIH Phase 1 SBIR grant** to develop an oral immunomodulating therapy specifically focusing on Crohn's disease.\n\n### Future Aspirations\n\nPromakhos Therapeutics is clearly on the rise, combining scientific innovation with strategic foresight to create therapies that could alleviate the burden of chronic diseases affecting millions. Their mission aligns well with modern healthcare's need for effective solutions that prioritize restoring rather than suppressing our bodies' natural functions.\n\nIn short, if you’re looking at the biotech landscape through the lens of inflammation and autoimmunity, keep your eyes on Promakhos Therapeutics. They might just be the game-changer we've all been waiting for. \n\nTo learn more about their groundbreaking work, you can visit their [website](https://www.promakhos.com)."
}