{
  "links": "https://www.ycombinator.com/companies/propreturns",
  "name": "PropReturns",
  "headline": "End-to-end commercial real estate transaction platform",
  "batch": "S21",
  "description": "PropReturns is an online platform to buy, sell and rent commercial real estate in India. The real estate market in India is highly fragmented and plagued by lack of transparency. We empower businesses and individuals in India to transact commercial real estate backed by data.",
  "activity_status": "Active",
  "website": "https://www.propreturns.com/",
  "founded_date": 2021.0,
  "team_size": 40.0,
  "location": "India",
  "group_partner": null,
  "group_partner_yc": null,
  "company_linkedin": null,
  "company_twitter": null,
  "tags": "industry:fintech; industry:marketplace; industry:proptech",
  "founders": [
    {
      "name": "Jayant Panwar, Founder",
      "description": "Love to talk with founders, always available on Whatsapp",
      "linkedin": "https://www.linkedin.com/in/jayant-panwar/"
    },
    {
      "name": "Somil Mathur, Founder",
      "description": "Tech entrepreneur. Love talking about product design and innovation. Super passionate about cars and the incoming EV storm (I have my own bets), amateur astronomer in my free time and shuffle playing Gorillaz on Spotify more often than not.",
      "linkedin": "https://www.linkedin.com/in/somilmathur"
    },
    {
      "name": "Kenish Shah, Founder",
      "description": "Founder at PropReturns (YC S21)\nConnect with me and let's brainstorm!!",
      "linkedin": "https://www.linkedin.com/in/kenishshah/"
    }
  ],
  "status": true,
  "markdown": "raw_markdown='This deployment is temporarily paused.\\n`bom1::kwpl9-1739979612287-e1825bd426dd`\\n' markdown_with_citations='This deployment is temporarily paused.\\n`bom1::kwpl9-1739979612287-e1825bd426dd`\\n' references_markdown='\\n\\n## References\\n\\n' fit_markdown='' fit_html=''",
  "generated_description": "**Company Overview: PropReturns**\n\n**Founded**: 2021  \n**Location**: India  \n**Team Size**: 40 employees  \n**Y Combinator Batch**: S21  \n**Website**: [propreturns.com](https://www.propreturns.com)  \n**Industry Tags**: Fintech, Marketplace, Proptech  \n\n---\n\n### Mission\n\nPropReturns is on a clear mission: to create an end-to-end commercial real estate transaction platform. Their focus is on transforming the way businesses and individuals engage with the commercial real estate market in India—an arena that many find confusing and opaque.\n\n### Problem Tackled\n\nThe Indian commercial real estate market is notoriously fragmented and lacks transparency. This often leaves buyers, sellers, and renters feeling lost. PropReturns steps into this chaos with a promise to empower its users through data-backed transactions. By providing tools and insights, they aim to make the process of buying, selling, and renting commercial properties straightforward and reliable.\n\n### Background\n\nInitially launching as an online platform dedicated to commercial real estate in India, PropReturns recognizes the challenges faced by users in navigating this market. With technology as their backbone, they are working towards reimagining real estate transactions by making them more accessible and well-informed.\n\n### Team\n\nWith a lean team of 40 dedicated employees, PropReturns combines talent and innovation, striving to carve a niche in the proptech space. The company is guided by a robust partnership with their Group Partner, NaN, adding depth and experience to their operations.\n\n### Conclusion\n\nIn a nutshell, PropReturns is positioned to make waves in the Indian commercial real estate sector. With a solid foundation from Y Combinator and a clear focus on transparency and data-driven insights, they are working to reshape how commercial property transactions are conducted in India. If you’re in the market for commercial real estate, PropReturns might just be the partner you need."
}