{
  "links": "https://www.ycombinator.com/companies/proven-group",
  "name": "Proven Group",
  "headline": "PROVEN is using AI, data and personalization to disrupt CPG",
  "batch": "W18",
  "description": "Proven is a data powered skincare company that creates personalized skincare products based on more than 47 factors about an individual's skin, genetic background, lifestyle and environment. Our formulations are rooted in the largest beauty database in the world, the proprietary Skin Genome Project, built in-house by Proven's cofounder Amy Yuan, a computational physicist from Stanford. The database has won MIT's AI Technology of the Year award and encompasses more than 20Million consumer datapoints and thousands of scientific articles on skin. Our challenge now is to tell the story of Proven, and share our industry leading personalized skincare products with the world.",
  "activity_status": "Active",
  "website": "https://www.provenskincare.com",
  "founded_date": 2018.0,
  "team_size": 40.0,
  "location": "San Francisco",
  "group_partner": null,
  "group_partner_yc": null,
  "company_linkedin": null,
  "company_twitter": null,
  "tags": "industry:artificial-intelligence; industry:machine-learning; industry:consumer; industry:e-commerce; location:san-francisco-bay-area",
  "founders": [],
  "status": true,
  "markdown": "raw_markdown='![](https://www.provenskincare.com)\\nPersonalized 3 Step Skincare Set | PROVEN\\n' markdown_with_citations='![](https://www.provenskincare.com)\\nPersonalized 3 Step Skincare Set | PROVEN\\n' references_markdown='\\n\\n## References\\n\\n' fit_markdown='' fit_html=''",
  "generated_description": "**Proven Group Overview**\n\n**Founded:** 2018  \n**Location:** San Francisco  \n**Team Size:** 40  \n**Y Combinator Batch:** W18  \n**Website:** [Proven Skincare](https://www.provenskincare.com)  \n\n**Mission:**  \nProven aims to disrupt the Consumer Packaged Goods (CPG) space by leveraging artificial intelligence, data, and personalization to craft skincare solutions tailored specifically to individual needs.\n\n**What They Do:**  \nProven started its journey as a data-powered skincare company. Rather than taking a one-size-fits-all approach, they analyze over 47 factors that can influence your skin. These include genetic background, lifestyle, and the environment. At the heart of their operation is the Skin Genome Project—a massive database housing more than 20 million consumer data points and numerous scientific articles on skin. This project was developed by co-founder Amy Yuan, a computational physicist from Stanford, and has earned accolades like MIT's AI Technology of the Year award.\n\nWith a deep commitment to personalization, Proven creates customized skincare products designed to meet the unique needs of each user. They have positioned themselves as leaders in the personalized skincare market and now face the challenge of effectively communicating their story and innovative products to a wider audience.\n\n**Group Partner:**  \nProven is partnered with Nan, indicating an alliance that likely enhances their growth and reach.\n\n**Industry Tags:**  \nThey are categorized under various tags including artificial intelligence, machine learning, consumer, e-commerce, and are primarily located in the San Francisco Bay Area.\n\n**Current Offering:**  \nProven features a **Personalized 3 Step Skincare Set**, which exemplifies their approach to tailored skincare solutions.\n\nIn a world where generic beauty products flood the market, Proven Group’s commitment to data-driven personalization might just be the breath of fresh air the industry needs."
}