{
  "links": "https://www.ycombinator.com/companies/pulse-active-stations-network",
  "name": "Pulse Active Stations Network",
  "headline": "We are a connected network of smart health machines in India.",
  "batch": "W19",
  "description": "We are Pulse Active Stations Network and are setting up a network of connected IOT-enabled “Make in India” Smart Health Machines known as the Pulse Active Stations Network.\r\n\nWe have conducted over 600,000 Health Check-ups and through our Pulse Active Station Smart Health Machines, we conduct mass screening for NCD risk factors such as Obesity, Hypertension and other factors to empower people to take informed decisions for theirs and their family's health.",
  "activity_status": "Active",
  "website": "http://www.getpulse.in/",
  "founded_date": null,
  "team_size": 10.0,
  "location": "India",
  "group_partner": null,
  "group_partner_yc": null,
  "company_linkedin": null,
  "company_twitter": null,
  "tags": "industry:health-tech; industry:india",
  "founders": [
    {
      "name": "Joginder Tanikella, Founder",
      "description": "Hands-on CEO and full-stack developer in Software and Embedded Systems. \nInventor. Entrepreneur. Long Distance Runner.",
      "linkedin": "https://www.linkedin.com/in/jogindertanikella/"
    }
  ],
  "status": true,
  "markdown": "raw_markdown='# Server Error\\n## 500 - Internal server error.\\n### There is a problem with the resource you are looking for, and it cannot be displayed.\\n' markdown_with_citations='# Server Error\\n## 500 - Internal server error.\\n### There is a problem with the resource you are looking for, and it cannot be displayed.\\n' references_markdown='\\n\\n## References\\n\\n' fit_markdown='' fit_html=''",
  "generated_description": "**Pulse Active Stations Network: A Snapshot**\n\nPulse Active Stations Network is on a mission to revolutionize healthcare access in India through a connected network of smart health machines. The company originated from the vision of being at the forefront of India's health-tech revolution, launching its IoT-enabled \"Make in India\" Smart Health Machines. \n\nWith over 600,000 health check-ups under their belt, these smart machines facilitate mass screenings for non-communicable disease (NCD) risk factors like obesity and hypertension. By providing real-time data, Pulse Active Stations empowers individuals and families to make informed health decisions. \n\nThe company is still relatively small, with a dedicated team of 10 employees based in India, and proudly participated in the Y Combinator Batch W19, gaining valuable mentorship and exposure. Their group partner remains unspecified, but they are tagged under the health-tech and India categories, highlighting their niche focus.\n\nYou can learn more about their innovative services at [getpulse.in](http://www.getpulse.in/). \n\nIn a nutshell, Pulse Active Stations Network is not just about machines; it’s about creating a connected health ecosystem that prioritizes preventive care and empowers users to take charge of their health."
}