{
  "links": "https://www.ycombinator.com/companies/quadrant-eye",
  "name": "Quadrant Eye",
  "headline": "Breaking new ground in online eyecare.",
  "batch": "W21",
  "description": "Quadrant Eye is on a mission to improve eyecare access and fight preventable blindness. We're building the next generation eye exam... inside the average American home. \r\n\nOur team wants to enable patients' best and most visually rich lives. To this end, we're looking for curious and nimble minds to help us develop the world's first fully online eye exam and ultimately deliver high-quality eyecare at scale.\r\n\nSome QE highlights:\r\n\n🐝 We're a team of surgeons, scientists, venture partners, and hackers who mean business.\r\n💸 Our backers include Y Combinator, Khosla Ventures, and the creator of Google Image Search.\r\n🍥 We're a mission-driven company tackling an eye health market worth $USD137B.\r\n🌟 Our core focus is currently the development of patentable deep tech, and our overall vision is to change eyecare for good.",
  "activity_status": "Active",
  "website": "https://quadranteye.com",
  "founded_date": 2020.0,
  "team_size": 4.0,
  "location": "San Francisco",
  "group_partner": null,
  "group_partner_yc": null,
  "company_linkedin": null,
  "company_twitter": null,
  "tags": "industry:artificial-intelligence; industry:deep-learning; industry:digital-health; industry:telemedicine; location:san-francisco-bay-area",
  "founders": [
    {
      "name": "Quinn Wang MD, Founder",
      "description": "Cataract surgeon, occasional volcano climber",
      "linkedin": "https://www.linkedin.com/in/quinn-wang-md/"
    }
  ],
  "status": true,
  "markdown": "raw_markdown=\"404\\n# Page not found\\nThe page you are looking for doesn't exist or has been moved.\\n\" markdown_with_citations=\"404\\n# Page not found\\nThe page you are looking for doesn't exist or has been moved.\\n\" references_markdown='\\n\\n## References\\n\\n' fit_markdown='' fit_html=''",
  "generated_description": "**Quadrant Eye: Revolutionizing Eyecare Access**\n\nFounded in 2020 and hailing from the innovative Y Combinator W21 batch, Quadrant Eye is on a mission to redefine how we access eyecare. Their goal? To develop a fully online eye exam system that brings eye health directly into American homes, helping to combat preventable blindness and expand access to essential services.\n\nThe company is nestled in San Francisco, a hotspot for tech and innovation, and is powered by a passionate team of just four individuals—comprising surgeons, scientists, venture partners, and hackers. This diverse group is united by a shared commitment to improving the way we approach eye health. They're not just building products; they are on a quest to enable patients to lead visually rich lives, and they’re doing this in a market worth an astonishing $137 billion.\n\nBacked by formidable investors including Y Combinator, Khosla Ventures, and the creator of Google Image Search, Quadrant Eye is well-positioned to make significant strides. Their focus on developing patentable deep tech underscores their ambition to not only change eyecare but to do so distinctly and sustainably.\n\nAs part of the thriving San Francisco Bay Area tech scene, Quadrant Eye is tagged with keywords like 'artificial-intelligence', 'deep-learning', 'digital-health', and 'telemedicine', indicating their innovative approach and commitment to leveraging technology in medicine.\n\nIn sum, Quadrant Eye isn't just another health startup—it's a mission-driven enterprise dedicated to democratizing eyecare and ensuring that high-quality services are accessible to everyone. If you’re curious about how they plan to deliver this revolutionary approach, check out their website at [Quadrant Eye](https://quadranteye.com)."
}