{
  "links": "https://www.ycombinator.com/companies/radical",
  "name": "Radical",
  "headline": "High-altitude solar-powered aircraft",
  "batch": "W23",
  "description": "Radical makes high-altitude solar-powered aircraft. Our aircraft fly at 70,000 feet, autonomously navigating in the stratosphere. They can be used to provide cell service, collect multi-spectral imagery, or to carry weather and climate sensors. Our aircraft offer an inexpensive, zero-emissions way to connect and observe earth like never before. Prior to Radical, our founders worked together for 6 years developing Amazon’s delivery drones.",
  "activity_status": "Active",
  "website": "https://www.radicalaero.com/",
  "founded_date": 2022.0,
  "team_size": 2.0,
  "location": null,
  "group_partner": "Jared Friedman",
  "group_partner_yc": "https://www.ycombinator.com/people/jared-friedman",
  "company_linkedin": null,
  "company_twitter": null,
  "tags": null,
  "founders": [
    {
      "name": "James Thomas, Founder",
      "description": "Co-Founder & CEO at Radical (W23) - Radical makes high altitude solar-powered aircraft. Our aircraft are able to fly continuously in the stratosphere without landing. They provide an inexpensive, zero-emissions way to connect and observe earth like never before. Prior to this I worked at Amazon Prime Air for six years (doing aerodynamics and aircraft design for delivery drones).",
      "linkedin": "https://www.linkedin.com/in/james0thomas/"
    },
    {
      "name": "Cyriel Notteboom, Founder",
      "description": "Co-Founder & CTO at Radical (W23) - Radical makes high altitude solar-powered aircraft. Our aircraft are able to fly continuously in the stratosphere without landing. They provide an inexpensive, zero-emissions way to connect and observe earth like never before. Prior to this I worked at Amazon Prime Air for six years (mechanical design, structural analysis and optimization of delivery drones).",
      "linkedin": "https://www.linkedin.com/in/cyriel-notteboom/"
    }
  ],
  "status": true,
  "markdown": "raw_markdown='[News](https://www.radicalaero.com/</news/announcing-radicals-series-seed>)[Careers](https://www.radicalaero.com/</careers>)\\n![](https://cdn.prod.website-files.com/64bc6b1ce3df2ded5dd8dcb1/64bc7a098af96339082b3162_Radical_logo.png)\\n _Connectivity_ _Observation_ _Sensing_\\n|\\nfrom the stratosphere\\n© 2024 Radical\\ninfo@radicalaero.com\\n[LinkedIn](https://www.radicalaero.com/<https:/www.linkedin.com/company/radicalaero/>)\\n[X](https://www.radicalaero.com/<https:/twitter.com/radicalaero>)\\n[Newsletter](https://www.radicalaero.com/<http:/eepurl.com/h6b3XH>)\\n' markdown_with_citations='News⟨1⟩Careers⟨2⟩\\n![](https://cdn.prod.website-files.com/64bc6b1ce3df2ded5dd8dcb1/64bc7a098af96339082b3162_Radical_logo.png)\\n _Connectivity_ _Observation_ _Sensing_\\n|\\nfrom the stratosphere\\n© 2024 Radical\\ninfo@radicalaero.com\\nLinkedIn⟨3⟩\\nX⟨4⟩\\nNewsletter⟨5⟩\\n' references_markdown='\\n\\n## References\\n\\n⟨1⟩ https://www.radicalaero.com/</news/announcing-radicals-series-seed>: News\\n⟨2⟩ https://www.radicalaero.com/</careers>: Careers\\n⟨3⟩ https://www.radicalaero.com/<https:/www.linkedin.com/company/radicalaero/>: LinkedIn\\n⟨4⟩ https://www.radicalaero.com/<https:/twitter.com/radicalaero>: X\\n⟨5⟩ https://www.radicalaero.com/<http:/eepurl.com/h6b3XH>: Newsletter\\n' fit_markdown='' fit_html=''",
  "generated_description": "**Company Overview: Radical**\n\nFounded in 2022 and part of Y Combinator's Batch W23, Radical is on a mission to redefine aerial capabilities with their high-altitude, solar-powered aircraft. These innovative machines fly at an impressive 70,000 feet and operate autonomously in the stratosphere. Radical's technology has the potential to revolutionize various sectors by providing reliable cell service, capturing multi-spectral imagery, and deploying sensors for weather and climate monitoring.\n\nThe essence of Radical can be distilled down to three core functions: connectivity, observation, and sensing—all delivered from the stratosphere. This approach not only offers unprecedented observational capabilities but does so at a low cost and with zero emissions, prioritizing sustainability in a field traditionally reliant on fossil fuels.\n\nLed by a small but capable team of two, Radical's founders previously collaborated for six years on the development of Amazon's delivery drones, bringing extensive experience to their current venture. Their group partner, Jared Friedman, lends additional expertise to the growing company.\n\nAs they carve out a niche, Radical is using advanced technology to engage with the Earth like never before. This blend of innovation and purpose positions quite well for future developments and partnerships—especially in a world increasingly driven by data and connectivity.\n\nFor more insights and updates, you can visit their website [here](https://www.radicalaero.com/) or follow them on [LinkedIn](https://www.radicalaero.com/<https:/www.linkedin.com/company/radicalaero/>) and [Twitter](https://www.radicalaero.com/<http:/twitter.com/radicalaero>). \n\nRadical is not just another aerospace company; it’s at the forefront of a shift towards high-altitude surveillance and ecological responsibility. Keep an eye on them—they're just getting started."
}