{
  "links": "https://www.ycombinator.com/companies/ravn",
  "name": "Ravn",
  "headline": "Ravn is building a heads-up display for soldiers.",
  "batch": "W19",
  "description": "Ravn is a DefenseTech company building a heads-up display for soldiers that will allow them to see around corners. In doing so, we allow them to see the enemy and react while they're still behind cover. Our lightweight heads-up display displays videos feeds from a camera on a gun, to drones, robots or other external platforms. Our heads-up display will become a soldier's most relied upon computer.\r\n\nWe currently have four team members, all very experienced in their respective fields. Jake, the Founder, is a former Navy SEAL and understands the market and product. Our Chief Science Officer, Karl Guttag, is an industry leader in the optics and display space. Our VPs of Software and Hardware are both very experienced in their fields. Our primary technology focus is on peer-to-peer applications, near eye optics and displays, cameras/sensors/IoT, and UI/UX (hardware and software).",
  "activity_status": "Active",
  "website": "https://ravn.com/",
  "founded_date": null,
  "team_size": 10.0,
  "location": "San Francisco",
  "group_partner": null,
  "group_partner_yc": null,
  "company_linkedin": null,
  "company_twitter": null,
  "tags": "industry:augmented-reality; location:san-francisco-bay-area",
  "founders": [],
  "status": true,
  "markdown": "raw_markdown='![Ravn Logo](https://cdn.prod.website-files.com/5f89e457ce80166a04360b8d/621433d02edcccac441491a7_ravn_logotype_horiz_white.svg)\\n# Edge data at your fingertips... finally.\\nReal-time decision making requires actionable edge data, yet in today’s defense industry, while data abounds, actionable data is rare. Decision makers still rely on human operators to communicate the broader circumstances and context, missing from today’s data, before a decision can be made. \\n\\u200d\\nNot anymore. Our software creates and delivers useful edge data wherever it’s needed, in real time.\\n© 2022 Ravn Inc. All rights reserved. \\n[![](https://d3e54v103j8qbb.cloudfront.net/img/webflow-badge-icon-d2.89e12c322e.svg)![Made in Webflow](https://d3e54v103j8qbb.cloudfront.net/img/webflow-badge-text-d2.c82cec3b78.svg)](https://ravn.com/<https:/webflow.com?utm_campaign=brandjs>)\\n' markdown_with_citations='![Ravn Logo⟨1⟩]\\n# Edge data at your fingertips... finally.\\nReal-time decision making requires actionable edge data, yet in today’s defense industry, while data abounds, actionable data is rare. Decision makers still rely on human operators to communicate the broader circumstances and context, missing from today’s data, before a decision can be made. \\n\\u200d\\nNot anymore. Our software creates and delivers useful edge data wherever it’s needed, in real time.\\n© 2022 Ravn Inc. All rights reserved. \\n![⟨2⟩![Made in Webflow⟨3⟩]](https://ravn.com/<https:/webflow.com?utm_campaign=brandjs>)\\n' references_markdown='\\n\\n## References\\n\\n⟨1⟩ https://cdn.prod.website-files.com/5f89e457ce80166a04360b8d/621433d02edcccac441491a7_ravn_logotype_horiz_white.svg: Ravn Logo\\n⟨2⟩ https://d3e54v103j8qbb.cloudfront.net/img/webflow-badge-icon-d2.89e12c322e.svg: ![\\n⟨3⟩ https://d3e54v103j8qbb.cloudfront.net/img/webflow-badge-text-d2.c82cec3b78.svg: Made in Webflow\\n' fit_markdown='' fit_html=''",
  "generated_description": "### Ravn: Enhancing Soldier Capabilities\n\n**Company Overview**  \nRavn is a cutting-edge DefenseTech company based in San Francisco, focused on revolutionizing the battlefield experience for soldiers through innovative technology. Their flagship product is a heads-up display (HUD) designed to enable soldiers to see around corners. This technology provides a crucial advantage, allowing troops to identify threats and respond while still safely behind cover.\n\n**Mission**  \nRavn's mission is to equip soldiers with a sophisticated HUD that integrates video feeds from various platforms such as drones, cameras mounted on weapons, and other sensors. The goal is clear: to make this HUD the soldier's most indispensable piece of technology in the field.\n\n**Founding Team**  \nFounded in Y Combinator Batch W19, Ravn boasts a lean yet highly skilled team of four initially, with a current expansion to ten employees. The team is led by Jake, a former Navy SEAL who deeply understands the defense market's needs. Karl Guttag serves as the Chief Science Officer, bringing extensive expertise in optics and display technologies. The VPs of Software and Hardware complement the core team with their broad experience in their respective domains.\n\n**Technological Focus**  \nRavn's technology focuses on several critical areas:\n- Peer-to-peer communications\n- Near-eye optics and displays\n- Cameras, sensors, and IoT integration\n- User Interface/User Experience (UI/UX) development\n\n**Current Initiatives**  \nThe company is actively working on generating actionable edge data, crucial for real-time decision-making in defense situations. Ravn's software aims to provide this data precisely where it's needed, breaking the traditional reliance on human operators for contextual interpretations.\n\n**Tagline and Outreach**  \nRavn’s tagline, \"Edge data at your fingertips... finally,\" encapsulates their vision of making vital information readily available. The company is tagged under 'augmented-reality' and 'San Francisco Bay Area,' highlighting their innovative bent and geographic significance.\n\n### In Summary\nRavn is positioning itself at the forefront of military technology with a mission to redefine how soldiers receive and interact with information on the field. By leveraging a combination of advanced optics, software, and user-centric design, they are transforming the way soldiers operate in high-stakes environments. If you're looking for a company that's merging defense and technology in a groundbreaking way, Ravn is one to watch.\n\nFor more information, visit [Ravn's website](https://ravn.com/)."
}