{
  "links": "https://www.ycombinator.com/companies/rejuvenation-technologies-inc",
  "name": "Rejuvenation Technologies Inc.",
  "headline": "We extend telomeres to extend the human health span",
  "batch": "S18",
  "description": "Delivery of TERT mRNA extends telomeres sufficiently in a few days to reverse over a decade of telomere shortening during normal aging.  We are advancing TERT mRNA-based therapies to the clinic.",
  "activity_status": "Active",
  "website": "https://www.rejuvenationtech.com/",
  "founded_date": 2016.0,
  "team_size": 2.0,
  "location": "Mountain View",
  "group_partner": null,
  "group_partner_yc": null,
  "company_linkedin": null,
  "company_twitter": null,
  "tags": "industry:anti-aging; industry:gene-therapy; industry:nanomedicine; location:san-francisco-bay-area",
  "founders": [
    {
      "name": "Glenn Markov, Founder",
      "description": "Stanford PhD Genetics (2018)",
      "linkedin": "https://www.linkedin.com/in/glennmarkov/"
    },
    {
      "name": "John Ramunas, Founder",
      "description": null,
      "linkedin": "https://www.linkedin.com/in/johnramunas/"
    }
  ],
  "status": true,
  "markdown": null,
  "generated_description": "**Rejuvenation Technologies Inc.** is a forward-thinking biotech company with a clear mission: *to extend telomeres to enhance the human health span.* Founded in 2016 and part of the Y Combinator Batch S18, the company is making strides in the realm of gene therapy, specifically focusing on the potential of TERT mRNA.\n\nSo, what does that mean? In essence, Rejuvenation Technologies has developed a method to deliver TERT mRNA, a process that can significantly extend telomeres—structures at the ends of chromosomes that shorten with age. This shortening is a major contributor to the aging process, so reversing a decade's worth of telomere shortening in just a few days is a remarkable feat. Their goal is to take these promising therapies from the lab to clinical settings, moving closer to tangible solutions that could redefine aging.\n\nHeadquartered in Mountain View, California, their compact team of two is led by an experienced group with strong ties to the San Francisco Bay Area's vibrant tech and biotech scene. Their work falls under the exciting umbrellas of anti-aging, gene therapy, and nanomedicine—fields that are rich with potential but also require clever navigation to succeed.\n\nFor those interested in the intersection of technology and longevity, check out their website at [Rejuvenation Technologies](https://www.rejuvenationtech.com/). This company is positioning itself at the frontier of age-related research, and with their innovative approaches, they could unlock invaluable insights into human longevity."
}