{
  "links": "https://www.ycombinator.com/companies/rides",
  "name": "Rides",
  "headline": "The car community for the car community.",
  "batch": "S24",
  "description": "Rides is a car community platform built for and by enthusiasts. We want to give people a purpose built way to connect with other people that share their love of cars & motorcycles and creates showcases that give every vehicle a page that let's its design, performance, modifications & story take center stage. A social network where the cars shine and the community connects exactly how we do offline and on the road... around a shared passion.",
  "activity_status": "Active",
  "website": "http://www.RidesApp.com",
  "founded_date": 2024.0,
  "team_size": 3.0,
  "location": "Lake Oswego, OR",
  "group_partner": "Garry Tan",
  "group_partner_yc": "https://www.ycombinator.com/people/garry-tan",
  "company_linkedin": null,
  "company_twitter": null,
  "tags": "industry:consumer; industry:community; industry:social; industry:automotive",
  "founders": [
    {
      "name": "Darius \"Bubs\" Monsef, Founder",
      "description": "Founder/CEO, RidesApp.com (S24)\nPast: Founder/CEO BraveCare.com (S19), CreativeMarket.com (W10) & COLOURlovers.com",
      "linkedin": "http://linkedin.com/in/dariusmonsef"
    },
    {
      "name": "Asa Miller, Founder",
      "description": "Building awesome things for kids at Genie. I love design and building great user experience as well as the nerdy tech stuff.",
      "linkedin": "https://www.linkedin.com/in/asamiller/"
    }
  ],
  "status": true,
  "markdown": "raw_markdown=\"![](https://cdn.prod.website-files.com/674f7bd6c30ad547a713f8b6/677dc6a9db9a1ede7a2a32a0_rides_logo.png)\\nThe car community for the car community.\\nArriving soon...\\nEmail Address\\nThanks! We're excited to have you with us, and we'll be in contact soon!\\nOops! Something went wrong while submitting the form.\\n![](https://cdn.prod.website-files.com/674f7bd6c30ad547a713f8b6/677ddf4c1a16b5faec3cef94_Rides_Gallery.jpg)![](https://cdn.prod.website-files.com/674f7bd6c30ad547a713f8b6/677de32a06180dc126243a6a_Rides_GalleryMobile.jpg)\\n\" markdown_with_citations=\"![](https://cdn.prod.website-files.com/674f7bd6c30ad547a713f8b6/677dc6a9db9a1ede7a2a32a0_rides_logo.png)\\nThe car community for the car community.\\nArriving soon...\\nEmail Address\\nThanks! We're excited to have you with us, and we'll be in contact soon!\\nOops! Something went wrong while submitting the form.\\n![](https://cdn.prod.website-files.com/674f7bd6c30ad547a713f8b6/677ddf4c1a16b5faec3cef94_Rides_Gallery.jpg)![](https://cdn.prod.website-files.com/674f7bd6c30ad547a713f8b6/677de32a06180dc126243a6a_Rides_GalleryMobile.jpg)\\n\" references_markdown='\\n\\n## References\\n\\n' fit_markdown='' fit_html=''",
  "generated_description": "**Company Overview: Rides**\n\n- **Mission:** Rides is all about building a vibrant car and motorcycle community—essentially, it’s the social network where vehicles shine and enthusiasts connect over their shared passion.\n\n- **Origin:** Launched in 2024, Rides emerged from the idea that car and bike lovers need a dedicated platform to showcase their rides. The platform allows users to create detailed profiles for their vehicles, highlighting design, performance, modifications, and personal stories, much like sharing a favorite tale around a campfire.\n\n- **Location:** Rides operates from Lake Oswego, Oregon, and currently boasts a lean team of three passionate individuals. \n\n- **Backing:** The company is part of the Y Combinator Batch S24, which provides invaluable support and mentorship to help accelerate its growth.\n\n- **Leadership:** Garry Tan serves as the Group Partner guiding Rides through its early stages, which is a great advantage for any startup entering the automotive community space.\n\n- **Focus Areas:** Rides is tagged with key descriptors like ‘consumer’, ‘community’, ‘social’, and ‘automotive’. This tells you exactly where their focus lies—at the intersection of technology and automotive enthusiasm. \n\n- **Current Status:** While still in the early stages and gearing up for launch, Rides is setting the groundwork for what promises to be an engaging hub for car aficionados. They aim to create a platform where the love for vehicles thrives, backed by features that resonate with the community's offline experiences.\n\nIn a world increasingly driven by online interactions, Rides is carving out a niche that honors the culture of car and motorcycle enthusiasts—where every car has a story, and every enthusiast can find their tribe.\n\nFor more information, you can explore their platform [here](http://www.RidesApp.com). Keep an eye on this space—it’s likely to rev up into something truly exciting!"
}