{
  "links": "https://www.ycombinator.com/companies/roforco",
  "name": "Roforco",
  "headline": "YCombinator for Roblox games",
  "batch": "S22",
  "description": "Roforco runs a Roblox game accelerator that makes games successful by providing funding, resources and hands-on support. \r\n\nCo-founders Artem and Brain have been building games together since they were 14 were developers on 12 top grossing titles, accounting for over 2.74 billion plays/downloads.\r\n\nPrior to building the accelerator, Roforco was a game studio with a portfolio of games that reached benchmarks including 10 million monthly active users and 16,000 concurrent users. Roforco also worked with notable brands such as Unilever, for whom they made an branded game with over 50 million plays.\r\n\nIn 2022, Roforco joined YCombinator's coveted startup accelerator and went on to secure a $1.5 million seed funding round from investors including Paul Graham, Dentsu Group, the prev. COO of Activision and the CEOs of Guilded and Jellysmack. \r\n\nLearn more about us at https://roforco.com/\r\n\nFor press: tom@roforco.com\r\nBased and founded in San Francisco, CA",
  "activity_status": "Active",
  "website": "https://www.roforco.com/",
  "founded_date": 2021.0,
  "team_size": 14.0,
  "location": "London, United Kingdom",
  "group_partner": "Jared Friedman",
  "group_partner_yc": "https://www.ycombinator.com/people/jared-friedman",
  "company_linkedin": null,
  "company_twitter": null,
  "tags": "industry:gaming",
  "founders": [
    {
      "name": "Brain Xiang, Founder",
      "description": "As a passionate builder and self-taught programmer since age 12, I have dedicated my life to creating and\nleading innovative projects. I have founded a successful gaming startup, developed games with over 100 million players and 10 million monthly active users, and raised $1.5 million from top investors. \n\nCurrently learning machine learning from the ground up and exploring new avenues in AI.",
      "linkedin": "https://www.linkedin.com/in/brain-xiang-75b033217/"
    },
    {
      "name": "Artem T. Middleton, Founder",
      "description": "(Exited Roforco as of 2024)\nQuick learning generalist. 3x Founder. Worked + built things in Gaming, Marketing, Fashion & Consulting.",
      "linkedin": "https://www.linkedin.com/in/artemmiddleton/"
    }
  ],
  "status": true,
  "markdown": null,
  "generated_description": "Roforco is an innovative company on a mission to become the \"YCombinator for Roblox games.\" Founded in 2021 by co-founders Artem and Brian, who have been collaborating on game development since they were just 14, Roforco initially launched as a game studio and has transformed into a robust accelerator dedicated to making Roblox games successful. \n\nWith a background that includes developing games responsible for over 2.74 billion plays and downloads, Artem and Brian have a proven track record. Before shifting focus to the accelerator model, Roforco's game portfolio boasted benchmarks like 10 million monthly active users and 16,000 concurrent users. They've even partnered with well-known brands like Unilever, creating a branded game that attracted over 50 million plays.\n\nIn 2022, Roforco took a significant leap by joining Y Combinator's sought-after startup accelerator, which is a stamp of validation in the tech space. They secured $1.5 million in seed funding from a compelling lineup of investors, including the likes of Paul Graham, the former COO of Activision, and the CEOs of Guilded and Jellysmack. \n\nNow based in San Francisco, CA, with a team of 14 talented individuals and an office in London, Roforco is strategically positioned to support game developers with the funding, resources, and hands-on guidance they need to thrive in the competitive landscape of Roblox gaming.\n\nIf you’re curious about their work or want to dive deeper, you can check out their website at [roforco.com](https://roforco.com/). For media inquiries, reach out to Tom at tom@roforco.com. With a vision like theirs, Roforco is set to reshape the way games are developed and launched on Roblox, providing an exciting future for both creators and players alike."
}