{
  "links": "https://www.ycombinator.com/companies/roundabout-technologies",
  "name": "Roundabout Technologies",
  "headline": "Software for AI-powered traffic lights",
  "batch": "F24",
  "description": "Roundabout Technologies makes AI-powered traffic lights, allowing cities to reduce pedestrian deaths, improve traffic, and reduce resident complaints. Our founding team has experience building safety-critical embedded systems and AI at Waymo, Zoox, Google, and Verily.",
  "activity_status": "Active",
  "website": "https://roundabout.tech",
  "founded_date": 2024.0,
  "team_size": 2.0,
  "location": null,
  "group_partner": "Pete Koomen",
  "group_partner_yc": "https://www.ycombinator.com/people/pete-koomen",
  "company_linkedin": null,
  "company_twitter": null,
  "tags": null,
  "founders": [
    {
      "name": "Collin Barnwell, Founder",
      "description": "Founder & CEO at Roundabout Technologies. Collin is a software leader and engineer with extensive experience building and shipping safety-critical IoT and camera devices, including a device that has been implanted in humans. He's worked at Google and Verily Life Sciences, and interned for startups Handshake and G2 both when they had fewer than 5 engineers.",
      "linkedin": "https://www.linkedin.com/in/collinbarnwell"
    },
    {
      "name": "Sabeek Pradhan, Founder",
      "description": "Founder & CTO at Roundabout Technologies. Sabeek is a computer vision expert with extensive experience building systems for high-accuracy vehicle, pedestrian and bike detection and tracking at the self-driving car companies Zoox, Waymo and Applied Intuition, and his software has been deployed on public roads in fully driverless vehicles.",
      "linkedin": "https://www.linkedin.com/in/sabeek-pradhan-0135865a"
    }
  ],
  "status": true,
  "markdown": "raw_markdown=\"[![Roundabout Technologies](https://roundabout.tech/static/media/logo.a515319e8a78b1224522.png)](https://roundabout.tech/</>)[Team](https://roundabout.tech/</team>)[See a Demo](https://roundabout.tech/</contact>)\\n# Human-centric traffic lights, powered by AI\\nWe make AI-powered traffic signal systems that optimize signals in real time by tracking vehicles and pedestrians around the intersection for shorter wait times and safer, pedestrian-friendly cities\\n▼\\n## Real-time perception of all road users in 3D allows us to choose the best signal change at every moment\\nUnable to play demo video\\n▼\\n## Optimize wait times for all road users by understanding every vehicle\\nUnable to play demo video\\n▼\\n## Give red lights to speeding vehicles in high-injury corridors\\nUnable to play demo video\\n▼\\n## Protect pedestrians who need extra time to cross\\nUnable to play demo video\\n▼\\n# Roundabout isn't like other systems.\\nMore than simply detecting the presence of vehicles in fixed boxes near the intersection, Roundabout integrates with existing cameras and hardware and anticipates the movements of every vehicle, cyclist, and pedestrian to optimize signal changes in real time, and in doing so helps your city:\\n  * Prioritize buses & emergency vehicles with no additional hardware\\n  * Reliably detect and anticipate cyclists and pedestrians\\n  * Save hours of cumulative wait times for all road users\\n  * Avoid resident complaints about legacy detection systems making bad decisions\\n\\n\\n▼\\n# Let's talk about how we can help your city!\\n[Schedule a demo](https://roundabout.tech/</contact>)\\n![Roundabout Technologies](https://roundabout.tech/static/media/logo.a515319e8a78b1224522.png)[Contact Us](https://roundabout.tech/</contact>)[Careers](https://roundabout.tech/<https:/www.ycombinator.com/companies/roundabout-technologies/jobs>)\\n\" markdown_with_citations=\"![Roundabout Technologies⟨1⟩](https://roundabout.tech/</>)Team⟨2⟩See a Demo⟨3⟩\\n# Human-centric traffic lights, powered by AI\\nWe make AI-powered traffic signal systems that optimize signals in real time by tracking vehicles and pedestrians around the intersection for shorter wait times and safer, pedestrian-friendly cities\\n▼\\n## Real-time perception of all road users in 3D allows us to choose the best signal change at every moment\\nUnable to play demo video\\n▼\\n## Optimize wait times for all road users by understanding every vehicle\\nUnable to play demo video\\n▼\\n## Give red lights to speeding vehicles in high-injury corridors\\nUnable to play demo video\\n▼\\n## Protect pedestrians who need extra time to cross\\nUnable to play demo video\\n▼\\n# Roundabout isn't like other systems.\\nMore than simply detecting the presence of vehicles in fixed boxes near the intersection, Roundabout integrates with existing cameras and hardware and anticipates the movements of every vehicle, cyclist, and pedestrian to optimize signal changes in real time, and in doing so helps your city:\\n  * Prioritize buses & emergency vehicles with no additional hardware\\n  * Reliably detect and anticipate cyclists and pedestrians\\n  * Save hours of cumulative wait times for all road users\\n  * Avoid resident complaints about legacy detection systems making bad decisions\\n\\n\\n▼\\n# Let's talk about how we can help your city!\\nSchedule a demo⟨3⟩\\n![Roundabout Technologies⟨1⟩]Contact Us⟨3⟩Careers⟨4⟩\\n\" references_markdown='\\n\\n## References\\n\\n⟨1⟩ https://roundabout.tech/static/media/logo.a515319e8a78b1224522.png: ![Roundabout Technologies\\n⟨2⟩ https://roundabout.tech/</team>: Team\\n⟨3⟩ https://roundabout.tech/</contact>: See a Demo\\n⟨4⟩ https://roundabout.tech/<https:/www.ycombinator.com/companies/roundabout-technologies/jobs>: Careers\\n' fit_markdown='' fit_html=''",
  "generated_description": "### Roundabout Technologies: Revolutionizing Traffic Management\n\nFounded in 2024 and part of Y Combinator Batch F24, Roundabout Technologies is on a mission to transform urban traffic management with their AI-powered traffic lights. The founding team, seasoned in safety-critical embedded systems and AI from companies like Waymo, Zoox, Google, and Verily, is committed to creating a safer, more efficient driving and walking environment for cities.\n\n#### What They Do\n\nRoundabout Technologies develops intelligent traffic signal systems that adapt in real time to the dynamics of road users—vehicles, cyclists, and pedestrians. By integrating seamlessly with existing cameras and hardware, their system has the ability to:\n\n- **Optimize Wait Times:** The AI can anticipate and respond to the movements of all road users, ensuring that traffic signals adjust to minimize delays.\n- **Enhance Safety:** By detecting speeding vehicles in critical areas and giving pedestrians extra time to cross, they contribute significantly to reducing accidents and enhancing safety for vulnerable road users.\n- **Support Public Transport:** Their technology prioritizes buses and emergency vehicles without requiring additional hardware, making urban transit faster and more reliable.\n- **Reduce Resident Complaints:** Unlike legacy systems that often lead to frustration due to poor decision-making, Roundabout’s solution improves the overall traffic flow, addressing common resident grievances.\n\n#### Why It Matters\n\nTraffic management isn't merely about moving cars; it’s about creating pedestrian-friendly cities that prioritize safety and efficiency. Roundabout Technologies stands out because they leverage advanced AI to provide nuanced, real-time traffic responsiveness, thus rethinking how traffic lights function in modern urban landscapes.\n\nWith a small team of just two employees and under the guidance of their Group Partner Pete Koomen, Roundabout Technologies is poised to make significant strides in urban traffic systems.\n\n### Next Steps\n\nInterested cities can explore how Roundabout Technologies can help enhance their traffic systems by scheduling a demo through their [website](https://roundabout.tech).\n\nIn a world where every second counts and safety is paramount, the innovations emerging from Roundabout Technologies could very well pave the way for the future of urban traffic management."
}