{
  "links": "https://www.ycombinator.com/companies/sendo",
  "name": "Sendo",
  "headline": "The best SMS/RCS API for startups",
  "batch": "W22",
  "description": "We're making it easy, cheap and fun for startups to build on SMS again. Sendo is the most developer-friendly SMS API, with great documentation, a fast dashboard, helpful monitoring features, easier 10DLC compliance and much more.\r\n\nSave 40%+ compared to Twilio and other options, and get started sending messages in 1-2 days instead of waiting weeks for your 10DLC campaigns to get approved.",
  "activity_status": "Active",
  "website": "https://sendo.dev",
  "founded_date": 2022.0,
  "team_size": 1.0,
  "location": "New York",
  "group_partner": "Dalton Caldwell",
  "group_partner_yc": "https://www.ycombinator.com/people/dalton-caldwell",
  "company_linkedin": null,
  "company_twitter": null,
  "tags": "industry:developer-tools; industry:messaging; industry:api; industry:sms; location:new-york",
  "founders": [
    {
      "name": "Nick Rubin, Founder",
      "description": "Stanford '21. Building things since age 13, including a viral Chrome extension, an Ethereum prediction market and bots to buy streetwear. I love books and travel – ask me about my 11,000-mile train trip.",
      "linkedin": "https://www.linkedin.com/in/nick-rubin-6729569a/"
    }
  ],
  "status": true,
  "markdown": "raw_markdown='\\n' markdown_with_citations='\\n' references_markdown='\\n\\n## References\\n\\n' fit_markdown='' fit_html=''",
  "generated_description": "**Sendo: Simplifying SMS for Startups**\n\nFounded in 2022 and based in New York, Sendo emerged from the Y Combinator Batch W22 with a clear mission: to be the best SMS and RCS API for startups. The core idea behind Sendo is to make messaging not just accessible, but enjoyable and cost-effective for developers looking to harness the power of SMS.\n\nSendo prides itself on being the most developer-friendly SMS API available. With comprehensive documentation and a fast, user-friendly dashboard, they streamline the process of integrating SMS capabilities for startups. The platform also boasts advanced monitoring features and simplifies 10DLC compliance—an area many find daunting. \n\nThe financial implications are significant, too. By opting for Sendo, startups can save over 40% compared to other established solutions like Twilio. This cost-effectiveness, combined with the ability to launch messaging campaigns in just 1-2 days instead of waiting weeks for approvals, makes Sendo an attractive option for agile startups.\n\nWith a dedicated team of just one employee, the company is lean but focused. Dalton Caldwell, their Group Partner, is steering this innovative venture. \n\nIn the ever-evolving landscape of developer tools, messaging, and APIs, Sendo has tagged itself as a fresh player. If you're a startup looking for a straightforward SMS solution that values speed, affordability, and developer ease, it might just be time to explore what Sendo has to offer.\n\nFor more information, visit their website at [sendo.dev](https://sendo.dev)."
}