{
  "links": "https://www.ycombinator.com/companies/sendme-inc",
  "name": "Sendme, Inc",
  "headline": "On demand provider of meat to households and food businesses",
  "batch": "W22",
  "description": "Sendme is an on-demand provider of clean meat to individuals and food businesses. We built a chatbot that lets customers place orders for meat on WhatsApp and they get it within 3hours.",
  "activity_status": "Active",
  "website": "http://www.sendme.ng",
  "founded_date": 2021.0,
  "team_size": 40.0,
  "location": "Ibadan, Nigeria",
  "group_partner": null,
  "group_partner_yc": null,
  "company_linkedin": null,
  "company_twitter": null,
  "tags": "industry:artificial-intelligence; industry:e-commerce; industry:food-tech",
  "founders": [
    {
      "name": "Daniel Afolayan, Founder",
      "description": "Daniel Afolayan is the CEO of Sendme, where he shapes the vision and strategy of the company. He trained as a medical doctor before finding his passion in technology as a product manager. Previously, he worked as a Growth Lead at SeamlessHR before founding an innovation hub and a logistics company",
      "linkedin": "https://www.linkedin.com/in/danafolayan/"
    }
  ],
  "status": true,
  "markdown": "raw_markdown=\"![Sendme Logo](http://www.sendme.ng/IMG_0039.png)\\nHe\\nWe have been committed to delivering quality meat to your doorstep. Now, we're going a step further. We're improving the process to get you quality meat and more, so you can always enjoy even better quality at a cheaper price, anywhere you choose to dine.\\nYour servant\\n[ ![WhatsApp Icon](https://upload.wikimedia.org/wikipedia/commons/6/6b/WhatsApp.svg) ](http://www.sendme.ng/<https:/wa.me/2348036668485>)\\n\" markdown_with_citations=\"![Sendme Logo⟨1⟩]\\nHe\\nWe have been committed to delivering quality meat to your doorstep. Now, we're going a step further. We're improving the process to get you quality meat and more, so you can always enjoy even better quality at a cheaper price, anywhere you choose to dine.\\nYour servant\\n ![WhatsApp Icon⟨2⟩ ](http://www.sendme.ng/<https:/wa.me/2348036668485>)\\n\" references_markdown='\\n\\n## References\\n\\n⟨1⟩ http://www.sendme.ng/IMG_0039.png: Sendme Logo\\n⟨2⟩ https://upload.wikimedia.org/wikipedia/commons/6/6b/WhatsApp.svg:  ![WhatsApp Icon\\n' fit_markdown='' fit_html=''",
  "generated_description": "### Sendme, Inc: Overview\n\n**Founded:** 2021  \n**Location:** Ibadan, Nigeria  \n**Team Size:** 40 employees  \n**Y Combinator Batch:** W22  \n**Website:** [sendme.ng](http://www.sendme.ng)  \n**Group Partner:** Nan  \n**Tags:** Artificial Intelligence, E-commerce, Food Tech\n\n**Mission:** Sendme, Inc. aims to be the on-demand provider of clean meat to households and food businesses. \n\n### What They Do\n\nSendme started with a simple yet innovative idea: delivering quality meat right to your doorstep, quickly and efficiently. They’ve built a unique chatbot that operates on WhatsApp, allowing customers to place orders effortlessly. The promise? Fresh meat delivery within just three hours.\n\nBut Sendme isn’t just about speed; they are on a mission to continually enhance the quality of their offerings while ensuring affordable prices for consumers. This push for quality improvement is driven by their commitment to adapting and optimizing the meat supply process.\n\n### Why It Matters\n\nIn a world where convenience is king, Sendme's model not only caters to the busy consumer but also steps into the realm of food technology—demonstrating how traditional supply chains can be reimagined and efficiently augmented with digital tools. They’re blending the age-old trade of meat delivery with modern technology and AI, making a significant impact in Nigeria's food landscape.\n\nAs they continue to grow and improve their services, Sendme is set to become a household name for quality meat, reflecting a broader trend in how we think about food procurement in the modern age. \n\nSo, if you’re in the mood for quality meat and want it with minimal hassle, Sendme might just be the service you need to try. Just a click (or a tap) away!"
}