{
  "links": "https://www.ycombinator.com/companies/sentiyen",
  "name": "Sentiyen",
  "headline": "Conversational AI assistants using your knowledge",
  "batch": "S21",
  "description": "At Sentiyen, we build GPT-based AI assistants that are trained on your content and enable your audience to get the answers they need 24 hours a day. We allow creators and businesses scale themselves to unlimited 1:1 conversations with potential customers, which helps increase revenue, reduce spend, and improve customer satisfaction.",
  "activity_status": "Active",
  "website": "https://www.sentiyen.com",
  "founded_date": 2020.0,
  "team_size": 2.0,
  "location": "San Francisco",
  "group_partner": null,
  "group_partner_yc": null,
  "company_linkedin": null,
  "company_twitter": null,
  "tags": "industry:ai-enhanced-learning; industry:artificial-intelligence; industry:ai-assistant; location:san-francisco-bay-area",
  "founders": [
    {
      "name": "Alex Perelman, Founder",
      "description": "Co-Founder & CEO at Sentiyen. \nPreviously Co-Founder and CTO at PeerStreet. \n\nWriting at alexperelman.com",
      "linkedin": "https://www.linkedin.com/in/alexperelman/"
    },
    {
      "name": "Nathan Shinder, Founder",
      "description": "Most recently as a Strategic Operations Manager at PeerStreet I launched a new loan product (long-term rental loans) and scaled the business line to north of $40MM/month.",
      "linkedin": "https://www.linkedin.com/in/nathan-shinder-6387221/"
    }
  ],
  "status": true,
  "markdown": "raw_markdown=\"# Sentiyen\\n## Join the waitlist\\nSave your spot and get updates from Sentiyen. If you'd like to expedite, please fill out [this form](https://www.sentiyen.com/<https:/forms.gle/rP3ic8NBVfxoDSHe7>) instead.\\nEmail addressJoin\\n© 2025 Square Footage, Inc. All rights reserved.\\nTerms\\nPrivacy\\n\" markdown_with_citations=\"# Sentiyen\\n## Join the waitlist\\nSave your spot and get updates from Sentiyen. If you'd like to expedite, please fill out this form⟨1⟩ instead.\\nEmail addressJoin\\n© 2025 Square Footage, Inc. All rights reserved.\\nTerms\\nPrivacy\\n\" references_markdown='\\n\\n## References\\n\\n⟨1⟩ https://www.sentiyen.com/<https:/forms.gle/rP3ic8NBVfxoDSHe7>: this form\\n' fit_markdown='' fit_html=''",
  "generated_description": "### Sentiyen: A Quick Overview\n\nFounded in 2020 and hailing from the prestigious Y Combinator Batch S21, Sentiyen is a San Francisco-based company on a mission to revolutionize customer interaction through conversational AI. With a tiny yet potent team of two, the startup has crafted a unique offering: GPT-based AI assistants tailored specifically to your content. This means businesses and creators can engage with their audiences 24/7, fielding inquiries with ease and effectiveness.\n\nThe crux of Sentiyen's value proposition lies in scaling conversations. Imagine having unlimited one-on-one dialogues with potential customers without the overhead of hiring a whole support staff. This not only optimizes revenue but also slashes unnecessary costs while boosting customer satisfaction — a triple punch that’s hard to ignore.\n\nTheir playful but straightforward tagline captures this essence: \"Conversational AI assistants using your knowledge.\" Sentiyen aims to equip businesses with tools that make customer service both efficient and effortless.\n\n### Current Offerings\n\nCurrently, Sentiyen is inviting users to join a waitlist to get updates and express their interest in the service. They have a clear call to action on their website, urging potential clients to fill out a form to expedite their engagement.\n\n### Tags and Tech\n\nSentiyen is part of a growing trend in AI-enhanced learning and artificial intelligence. The tags associated with them—such as 'ai-assistant' and 'san-francisco-bay-area'—reflect their position in the bustling tech ecosystem of Silicon Valley.\n\nIn a world where customer expectations are rising, Sentiyen aims to partner with businesses to meet those needs head-on. If you’re curious about what they offer, you can find more details on their website: [Sentiyen.com](https://www.sentiyen.com).\n\nTo summarize, if you’re a business looking to innovate your customer interactions and operate around the clock without breaking the bank, Sentiyen might just be the spark you need."
}