{
  "links": "https://www.ycombinator.com/companies/shasqi",
  "name": "Shasqi",
  "headline": "Targeting Cancer with Click Chemistry",
  "batch": "W15",
  "description": "Shasqi is leading the development of therapeutics leveraging click chemistry to get active cancer treatments to tumors with its proprietary CAPAC™ platform. Our technology is based on localizing a click chemistry reagent in the tumor area, which then activates a second agent, a systemically infused protodrug. When the two 'click', a powerful localized therapy is activated at the tumor, while keeping its systemic exposure levels below toxic thresholds.",
  "activity_status": "Active",
  "website": "https://",
  "founded_date": 2015.0,
  "team_size": 28.0,
  "location": "San Francisco",
  "group_partner": null,
  "group_partner_yc": null,
  "company_linkedin": null,
  "company_twitter": null,
  "tags": "industry:biotech; industry:therapeutics; location:san-francisco-bay-area",
  "founders": [
    {
      "name": "Jose M. Mejia Oneto, Founder/CEO",
      "description": "José M Mejía Oneto is a physician scientist with training in Organic Chemistry at Emory and Orthopedics at UC Davis. During his clinical training, Jose recognized the need for a better way to get drugs to the right location in the body. Joined the YC program in 2015 with Tambo and in 2018 its spinoff Shasqi, focussing on pioneering click chemistry in humans for better cancer drugs. Shasqi has raised a more than $60M in funding, with its lead asset in Phase 2 and a growing pipeline of drugs.",
      "linkedin": "http://www.linkedin.com/in/joseperu/"
    }
  ],
  "status": true,
  "markdown": null,
  "generated_description": "**Company Summary: Shasqi**\n\nShasqi is a cutting-edge biotech company on a mission to revolutionize cancer treatment using a novel approach known as click chemistry. Founded in 2015 and part of the Y Combinator Batch W15, Shasqi is headquartered in San Francisco and comprises a dedicated team of 28 professionals.\n\nAt the heart of Shasqi’s innovation is its proprietary CAPAC™ platform, which is designed to deliver targeted cancer therapeutics effectively. The technology utilizes a clever mechanism of localized click chemistry—where a reagent is specifically concentrated in the tumor area. This localized approach allows an activated protodrug, infused systemically, to “click” and create a powerful therapy right at the tumor site. This method not only enhances the effectiveness of cancer treatment but also significantly reduces systemic exposure, keeping it below toxic thresholds.\n\nThough the company isn’t currently publicly sharing specific projects, it continues to solidify its reputation in the biotech field, tagged with key areas of expertise including therapeutics and innovation in cancer treatment.\n\nIn the competitive landscape of the San Francisco Bay Area biotech scene, Shasqi stands out for its distinct approach and commitment to battling cancer. You can learn more about their work and mission on their website."
}