{
  "links": "https://www.ycombinator.com/companies/shipper",
  "name": "Shipper",
  "headline": "Southeast Asiaâs e-commerce logistics and enablement platform",
  "batch": "W19",
  "description": null,
  "activity_status": "Active",
  "website": "https://shipper.id",
  "founded_date": 2017.0,
  "team_size": 600.0,
  "location": "Jakarta, Indonesia",
  "group_partner": "Gustaf Alstromer",
  "group_partner_yc": "https://www.ycombinator.com/people/gustaf-alstromer",
  "company_linkedin": null,
  "company_twitter": null,
  "tags": "industry:logistics; industry:e-commerce",
  "founders": [],
  "status": true,
  "markdown": "raw_markdown='\\n' markdown_with_citations='\\n' references_markdown='\\n\\n## References\\n\\n' fit_markdown='' fit_html=''",
  "generated_description": "### Shipper: Simplifying E-commerce Logistics in Southeast Asia\n\n**Overview**\nShipper is an ambitious logistics and enablement platform designed to cater specifically to the booming e-commerce market in Southeast Asia. Launched in 2017 and headquartered in Jakarta, Indonesia, Shipper has quickly established itself as a key player in the region.\n\n**Founding and Growth**\nInitially, Shipper started as a simple platform, but it's anything but simple now. Joining the prestigious Y Combinator Batch W19 has helped to propel the company to new heights, granting it access to invaluable resources and mentorship. With a team of about 600 skilled employees, Shipper is well-equipped to tackle the complexities of logistics in a rapidly growing e-commerce landscape.\n\n**Mission**\nThe core mission of Shipper is straightforward: to provide a comprehensive logistics solution that empowers e-commerce businesses across Southeast Asia. The goal is to streamline logistics processes, making them more efficient and accessible to merchants, regardless of their size.\n\n**Key Leadership**\nUnder the guidance of Gustaf Alstromer, a Group Partner at Y Combinator, Shipper is positioned to leverage strategic insights and best practices that can drive growth and innovation in the logistics sector.\n\n**Tags**\nShipper is tagged with keywords like 'logistics' and 'e-commerce,' underscoring its focus on facilitating the movement of goods and services in the digital marketplace.\n\nFor more information about Shipper, you can visit their website at [https://shipper.id](https://shipper.id).\n\n### Conclusion\nShipper is more than just a logistics company; it’s a vital partner for e-commerce businesses in Southeast Asia. By embracing technology and innovation, it aims to simplify the logistics process and support the growth of e-commerce in the region. If you’re in the e-commerce space, keeping an eye on Shipper could be worthwhile. They're clearly on the path to making significant waves in the logistics industry."
}