{
  "links": "https://www.ycombinator.com/companies/spadeworks",
  "name": "SpadeWorks",
  "headline": "Marketplace where Indian SMBs can book verified blue collar workforce",
  "batch": "W22",
  "description": "SpadeWorks is a marketplace where businesses can book trained and certified blue collar professionals for their maintenance / back end jobs.\r\nFor instance, Restaurant owners instead of coordinating with multiple partners, and spending hours in follow up can now seamlessly book and track pest control experts, HVAC professionals, Hob cleaners, runners with just a click of a button. On one hand it brings in transparency, convenience  and assurance for businesses and on the other hand it provides reliability of work, financial guarantee and dignity of labour for the professionals.",
  "activity_status": "Active",
  "website": "https://www.spadeworks.co",
  "founded_date": 2022.0,
  "team_size": 13.0,
  "location": "Hyderabad, India",
  "group_partner": null,
  "group_partner_yc": null,
  "company_linkedin": null,
  "company_twitter": null,
  "tags": "industry:marketplace; industry:saas; industry:b2b",
  "founders": [
    {
      "name": "Vamsee Koneru, Founder",
      "description": "2X Edtech Entrepreneur\nBootstrapped, built and exited $4 Mn YoY company\nDeep understanding of B2B Edtech space \nExceptional connects in Edtech space \nExperience of working in India, MENA, UK",
      "linkedin": "https://www.linkedin.com/in/vamsee-koneru"
    }
  ],
  "status": true,
  "markdown": null,
  "generated_description": "**SpadeWorks at a Glance**\n\nFounded in 2022 and part of Y Combinator's W22 batch, SpadeWorks is making waves in the blue-collar workforce marketplace in India. Based in Hyderabad, the company is a nimble operation with a team of 13 dedicated employees, all striving to provide seamless solutions for businesses looking to hire trained and certified blue-collar professionals.\n\n**Mission & Value Proposition**\n\nThe core mission of SpadeWorks is to empower Indian small and medium businesses (SMBs) by streamlining the hiring process for blue-collar workers. Gone are the days of juggling multiple vendors and being bogged down by endless follow-ups. Instead, restaurant owners and other businesses can now easily book verified professionals—be it for pest control, HVAC maintenance, or cleaning services—with just a click. This not only enhances transparency and convenience for businesses but also ensures reliability and dignity for the workers, creating a better ecosystem for all parties involved.\n\n**Key Features and Benefits**\n\nFor businesses:\n- **Convenience:** A user-friendly platform that eliminates the hassle of coordination with multiple service providers.\n- **Transparency:** Clear access to a network of vetted professionals.\n- **Assurance:** Trust in the reliability of the hired workforce.\n\nFor professionals:\n- **Reliability of Work:** Opportunities for consistent employment with trustworthy companies.\n- **Financial Guarantees:** Assurance around payment and job security.\n- **Dignity of Labour:** Elevating the status of blue-collar work with respect and recognition.\n\n**Tagline & Niche**\n\nSpadeWorks falls under the categories of marketplace, SaaS, and B2B, highlighting its innovative approach to modernizing an often-overlooked segment of the workforce.\n\nTo learn more about their offerings, you can visit [SpadeWorks](https://www.spadeworks.co). \n\nIn essence, SpadeWorks is not just filling jobs; it’s redefining how blue-collar work is perceived and accessed, making it a standout player in the competitive landscape of workforce solutions."
}