{
  "links": "https://www.ycombinator.com/companies/superglue",
  "name": "superglue",
  "headline": "a proxy server for automated data transformation",
  "batch": "W25",
  "description": "superglue is an open-source tool that sits as a proxy in front of your API calls, automatically transforming data into exactly the format your system needs. Instead of writing custom code to map fields, handle different data structures, failure states and normalizing inconsistent formats, integration engineers can now define their desired output format and let superglue handle the entire transformation process automatically.",
  "activity_status": "Active",
  "website": "https://superglue.cloud/",
  "founded_date": 2024.0,
  "team_size": 2.0,
  "location": "San Francisco",
  "group_partner": "Tom Blomfield",
  "group_partner_yc": "https://www.ycombinator.com/people/tom-blomfield",
  "company_linkedin": null,
  "company_twitter": null,
  "tags": "industry:artificial-intelligence; industry:developer-tools; industry:open-source; industry:api; location:san-francisco-bay-area",
  "founders": [
    {
      "name": "Stefan Faistenauer, Founder",
      "description": "Building superglue, an open source tool to automate data transformation. Former Software engineer and Google APM with a master’s from Stanford.",
      "linkedin": "https://www.linkedin.com/in/stefan-faistenauer/"
    },
    {
      "name": "Adina Goerres, Founder",
      "description": "Building superglue. Previously worked on GTM at Scalable Capital and commercial projects at Farfetch. Built wantviva.com, a community marketplace for aesthetically pleasing objects. Write girlveryonline.substack.com to dissect how culture affects business. \nB.B.A. from Reichman University, Master's in CS and Finance from TUM and CDTM",
      "linkedin": "https://linkedin.com/in/adinagoerres"
    }
  ],
  "status": true,
  "markdown": "raw_markdown=\"☰ [ Docs ](https://superglue.cloud/<https:/docs.superglue.cloud>) [ Pricing ](https://superglue.cloud/<https:/docs.superglue.cloud/pricing>) [ Get Updates ](https://superglue.cloud/<https:/forms.gle/BNH777oLdSZMCtWk7>) [ Join Discord ](https://superglue.cloud/<https:/discord.gg/vUKnuhHtfW>) ![superglue Logo](https://superglue.cloud/logo.svg)\\n# data that speaks your language 🍯\\nsuperglue translates data from any system into exactly the format you need. It's an open source proxy that automatically extracts, maps and transforms data so developers don't have to write and maintain complex integration code. \\n[Try Now](https://superglue.cloud/<https:/app.superglue.cloud>) [Book Demo](https://superglue.cloud/<https:/cal.com/teamindex/superglue-demo>) [ GitHub ](https://superglue.cloud/<https:/github.com/superglue-ai/superglue>)\\n![Y Combinator](https://superglue.cloud/yc.avif)\\n[Privacy](https://superglue.cloud/</privacy.html>) [Terms](https://superglue.cloud/</terms.html>) [Imprint](https://superglue.cloud/</imprint.html>)\\n\" markdown_with_citations=\"☰  Docs ⟨1⟩  Pricing ⟨2⟩  Get Updates ⟨3⟩  Join Discord ⟨4⟩ ![superglue Logo⟨5⟩]\\n# data that speaks your language 🍯\\nsuperglue translates data from any system into exactly the format you need. It's an open source proxy that automatically extracts, maps and transforms data so developers don't have to write and maintain complex integration code. \\nTry Now⟨6⟩ Book Demo⟨7⟩  GitHub ⟨8⟩\\n![Y Combinator⟨9⟩]\\nPrivacy⟨10⟩ Terms⟨11⟩ Imprint⟨12⟩\\n\" references_markdown='\\n\\n## References\\n\\n⟨1⟩ https://superglue.cloud/<https:/docs.superglue.cloud>:  Docs \\n⟨2⟩ https://superglue.cloud/<https:/docs.superglue.cloud/pricing>:  Pricing \\n⟨3⟩ https://superglue.cloud/<https:/forms.gle/BNH777oLdSZMCtWk7>:  Get Updates \\n⟨4⟩ https://superglue.cloud/<https:/discord.gg/vUKnuhHtfW>:  Join Discord \\n⟨5⟩ https://superglue.cloud/logo.svg: superglue Logo\\n⟨6⟩ https://superglue.cloud/<https:/app.superglue.cloud>: Try Now\\n⟨7⟩ https://superglue.cloud/<https:/cal.com/teamindex/superglue-demo>: Book Demo\\n⟨8⟩ https://superglue.cloud/<https:/github.com/superglue-ai/superglue>:  GitHub \\n⟨9⟩ https://superglue.cloud/yc.avif: Y Combinator\\n⟨10⟩ https://superglue.cloud/</privacy.html>: Privacy\\n⟨11⟩ https://superglue.cloud/</terms.html>: Terms\\n⟨12⟩ https://superglue.cloud/</imprint.html>: Imprint\\n' fit_markdown='' fit_html=''",
  "generated_description": "**Company Overview: Superglue**\n\nFounded in 2024 and hailing from the vibrant tech nest of San Francisco, Superglue is a promising player in the realm of data integration, currently participating in Y Combinator's Batch W25. With a lean team of just two, they're moving fast to change the way businesses handle data transformation.\n\n**Mission and Vision**\n\nSuperglue's mission is straightforward yet powerful: act as a proxy server for automated data transformation. Imagine a tool that takes the hassle out of data integration by automatically converting and structuring information from various systems into a format your applications require. Developers no longer need to write and maintain complex code for every data integration task; they can simply define their needs, and Superglue will do the heavy lifting.\n\n**What They Do**\n\nSuperglue operates as an open-source tool, positioned strategically in front of your API calls. It extracts, maps, and transforms data seamlessly. This means integration engineers can focus on more strategic coding tasks rather than slogging through mundane data formatting. Think of it as the translator for your technical needs, ensuring that data speaks the language your systems understand.\n\nIn more practical terms, Superglue allows developers to simplify the convoluted processes involved in handling different data structures and inconsistent formats. It effectively normalizes the chaos, automating transformations that would otherwise require extensive manual coding.\n\n**Key Features**\n\n- **Automated Transformation**: Automatically adjusts the data format as per user specifications.\n- **Open Source**: Encourages contributions and adaptations from the developer community.\n- **User-Friendly Tools**: Offers straightforward documentation and pricing plans to facilitate easy adoption.\n\n**Getting Involved**\n\nAre you interested in diving in? Superglue provides various options for potential users:\n- **Try it out**: You can test the service via their [app](https://superglue.cloud/<https:/app.superglue.cloud>).\n- **Book a demo**: Experience how Superglue can transform your data workflow.\n- **Join the community**: Engage with other users on Discord to exchange ideas and tips.\n\n**Future Prospects**\n\nWith its current focus on providing efficient data transformations, Superglue is positioned well in the markets of artificial intelligence, developer tools, and application programming interfaces (APIs). Their continuing evolution—especially under the guidance of Group Partner Tom Blomfield—holds promise for developers looking to streamline their workflow and foster innovation without being bogged down by the intricacies of data formats.\n\nFor more information, check out their website at [Superglue.cloud](https://superglue.cloud/). It's a startup that's not just about gluing data together but ensuring that it talks fluently and understandably across different platforms—an essential tool for modern developers."
}