{
  "links": "https://www.ycombinator.com/companies/synsorybio",
  "name": "SynsoryBio",
  "headline": "\"If-then\" conditional logic for protein drugs",
  "batch": "W24",
  "description": "SynsoryBio is creating next generation, protein therapeutics that sense where they are in the body and only activate at diseased tissue. This technology platform has the potential to expand the therapeutic window of highly potent drugs and apply to many diseases such as cancer and autoimmune disorders.",
  "activity_status": "Active",
  "website": "https://www.synsorybio.com/",
  "founded_date": 2023.0,
  "team_size": 2.0,
  "location": "Cambridge, MA",
  "group_partner": null,
  "group_partner_yc": null,
  "company_linkedin": null,
  "company_twitter": null,
  "tags": "industry:synthetic-biology; industry:biotech; industry:therapeutics; industry:oncology",
  "founders": [
    {
      "name": "Elliot Tague, Founder",
      "description": "I am a PhD and inventor in the fields of synthetic biology and protein engineering. I got my PhD from Boston University, spent time as a visiting graduate student in George Church's lab at Harvard, and worked in various biotech startups. In my free time, I like to spend time with friends and family, ride bikes, go hiking, and occasionally paint.",
      "linkedin": "https://linkedin.com/in/elliot-tague"
    },
    {
      "name": "Nathan Tague, Founder",
      "description": "I’m a co-founder of SynsoryBio, where we are creating therapeutics that sense-and-respond to disease. I have a background in synthetic biology and protein engineering with a PhD in Biomedical Engineering.",
      "linkedin": "https://linkedin.com/in/nathan-tague-533019198"
    }
  ],
  "status": true,
  "markdown": "raw_markdown='Search this site\\nEmbedded Files\\nSkip to main content\\nSkip to navigation\\n![](https://lh3.googleusercontent.com/Vwih9Nokj2tpZ3fsyKbsMDAmNWLFvqP5sAEF33R1vZ1XaO0PEaMIC5oKktom82sqe_c3gl5vMHKSozaepXx2KpIWakLi1z35Pg9hYw0zMs2etFiQd6X-6-sdKRNfMRMBjg=w1280)\\nMore info coming soon\\nGoogle Sites\\nReport abuse\\n' markdown_with_citations='Search this site\\nEmbedded Files\\nSkip to main content\\nSkip to navigation\\n![](https://lh3.googleusercontent.com/Vwih9Nokj2tpZ3fsyKbsMDAmNWLFvqP5sAEF33R1vZ1XaO0PEaMIC5oKktom82sqe_c3gl5vMHKSozaepXx2KpIWakLi1z35Pg9hYw0zMs2etFiQd6X-6-sdKRNfMRMBjg=w1280)\\nMore info coming soon\\nGoogle Sites\\nReport abuse\\n' references_markdown='\\n\\n## References\\n\\n' fit_markdown='' fit_html=''",
  "generated_description": "**Company Overview: SynsoryBio**\n\n**Founded**: 2023  \n**Location**: Cambridge, MA  \n**Team Size**: 2  \n**Incubator**: Y Combinator Batch W24  \n**Website**: [synsorybio.com](https://www.synsorybio.com)  \n**Group Partner**: Nan  \n\n**Mission**: SynsoryBio aims to revolutionize protein therapeutics with \"if-then\" conditional logic. This means that their protein drugs are designed to be activated selectively at diseased tissues, enhancing their effectiveness while reducing off-target effects. \n\n**Technology**: The core of SynsoryBio's innovation lies in its next-generation protein therapeutics. By developing drugs that are aware of their environment in the body, they can potentially expand the therapeutic window for highly potent drugs. This technology is particularly promising in treating complex and challenging diseases, including cancer and autoimmune disorders.\n\n**Tagline Areas**: Their current focus falls under the categories of synthetic biology, biotech, therapeutics, and oncology, reflecting a cutting-edge approach to modern medicine.\n\n**Current Activities**: While specifics on ongoing projects are limited, the company is actively working to refine its technology and bring its innovative solutions to market.\n\nIn summary, SynsoryBio is an ambitious newcomer in the biotech landscape, leveraging advanced synthetic biology to create smart protein therapeutics that promise to change how we approach the treatment of serious diseases. As they continue to develop their technology, there's a lot of excitement to see how they will impact the field of medicine."
}