{
  "links": "https://www.ycombinator.com/companies/threshold",
  "name": "Threshold",
  "headline": "Network for decentralized threshold cryptography and end-to-endâ¦",
  "batch": "S16",
  "description": "NuCypher is one of two founding teams of the Threshold Network (market cap ~$370m), which hosts tBTC, TACo, Random Beacon & tUSD. Since 2017, NuCypher has pioneered cryptographic primitives for end-to-end encrypted data sharing, including Proxy Re-Encryption and Threshold Access Control (TACo), novel cryptoeconomic mechanisms (e.g. Stable Yield). and original network/governance architectures (including a historic on-chain merger). TACo, our flagship product, is running on over 120 nodes with ~$80m of associated economic security, has paying adopting developers and major infrastructure partners (Ceramic, Irys, Textile, Unlock), and has been decentralized from genesis (mainnet launch in Jan 2024).",
  "activity_status": "Active",
  "website": "https://threshold.network/",
  "founded_date": 2015.0,
  "team_size": 10.0,
  "location": "Austin, TX",
  "group_partner": null,
  "group_partner_yc": null,
  "company_linkedin": null,
  "company_twitter": null,
  "tags": "industry:cryptography; industry:privacy; location:austin",
  "founders": [],
  "status": true,
  "markdown": "raw_markdown=\"Maximize your BTC in DeFi. [Mint tBTC now](https://threshold.network/<https:/dashboard.threshold.network/tBTC/mint>)\\n[![](https://threshold.network/)](https://threshold.network/</>)\\nEarn\\n[Liquidity Provider](https://threshold.network/</earn/liquidity-provider>)[tBTC Bridge](https://threshold.network/</earn/btc>)[Token Holder](https://threshold.network/</earn/token-holder>)\\nBuild\\n[TACo](https://threshold.network/<https:/docs.taco.build>)[tBTC SDK](https://threshold.network/</build/tbtc-sdk>)[Docs](https://threshold.network/<https:/docs.threshold.network/>)\\n[Governance](https://threshold.network/</governance>)[Ecosystem](https://threshold.network/</ecosystem>)\\nAbout\\n[Press](https://threshold.network/</press>)[Blog](https://threshold.network/<https:/blog.threshold.network/>)[Contributors](https://threshold.network/</about#contributors>)[FAQ](https://threshold.network/</about#faq>)[Audits](https://threshold.network/</about#audits>)[Brand Assets](https://threshold.network/<https:/bit.ly/threshold-brand-assets>)\\n[tBTC dApp](https://threshold.network/<https:/dashboard.threshold.network/tBTC>)\\n[](https://threshold.network/<https:/twitter.com/TheTNetwork>)[](https://threshold.network/<https:/t.me/thresholdnetwork>)[](https://threshold.network/<https:/discord.threshold.network>)[](https://threshold.network/<https:/github.com/threshold-network>)\\n[New!tBTC is live on Aave. Another opportunity to put your tBTC to work now!](https://threshold.network/<https:/app.aave.com/reserve-overview/?underlyingAsset=0x18084fba666a33d37592fa2633fd49a74dd93a88&marketName=proto_mainnet_v3>)\\n# Bridge your Bitcoin and start earning.\\n##### Deposit and redeem BTC in DeFi without intermediaries using Threshold's tBTC.\\n[Mint tBTC](https://threshold.network/<https:/dashboard.threshold.network/tBTC>)[Stay Updated](https://threshold.network/<https:/twitter.com/TheTNetwork>)\\n![](https://threshold.network/images/minting-tbtc.png)\\n# 0.00\\n###### btc\\n##### BTC TVL\\n# 0\\n##### tBTC unique address\\n# $0\\n##### USD TVL\\n[View Dune Analytics Dashboard](https://threshold.network/<https:/dune.com/threshold/tbtc>)\\nBug bounty\\n## Join the hunt: $500K Bug Bounty\\n##### Spot security risks, claim your prize.\\n[Read more](https://threshold.network/<https:/immunefi.com/bounty/thresholdnetwork/>)\\n![](https://threshold.network/images/immunefi.svg)\\nGet Started\\n## Provide Liquidity\\n##### Liquidity providers earn yields by depositing assets into liquidity pools.\\n[Learn More](https://threshold.network/</earn/liquidity-provider>)\\n![](https://threshold.network/images/liquidity.png)\\nGet Started\\n## Token Holder DAO\\n##### Make the most of your T tokens on the Threshold Network by participating in DAO governance.\\n[Governance Forum](https://threshold.network/<https:/forum.threshold.network/>)[Learn More](https://threshold.network/</earn/token-holder>)\\n![](https://threshold.network/images/token-holder.png)\\nGet Started\\n## Build uncensorable e2ee into your dapp\\n##### TACo is the only end-to-end encryption plugin that is end-to-end decentralized\\n[Taco.build](https://threshold.network/<https:/taco.build>)[Docs](https://threshold.network/<https:/docs.taco.build>)\\n![](https://threshold.network/images/taco-section-image.svg)\\n## Threshold is run by an active community.\\nThe Threshold DAO is a decentralized community of T token holders and their delegates who collectively vote to decide what's next for the network.\\n[About Governance](https://threshold.network/</governance>)\\n![](https://threshold.network/images/governance.png)\\n##### Current Proposals\\nTIP-101: Boar beta staker nodes\\nFeb 2025 · boar.network\\nPer TIP-92, immediate withdrawal applies only to non-beta stakers. The stake held by beta stakers will not be withdrawable until the beta nodes transition to DAO-provided delegations or a DAO-controlled whitelist. There are 6 beta staker nodes operated by Boar. Those nodes were being compensated entirely via rewards and operationally paid for by other entities out of pocket. All those stakers are early supporters of the network participating in the very first signing groups. **Out of all currently operating tBTC wallets, up to 21% of group key shares are held on those nodes.** Although with a 51-of-100 threshold disabling those nodes should not kill the liveness of wallets, in practice, the outcome will depend on the rest of the peers and the 21% liveness reduction is quite significant. Disabling those nodes today significantly increases the risk to the network with **up to 21% liveness reduction of signing groups.** With TIP-92 changes, the company is put in an extremely difficult position. **The stakes of customers will remain locked but they will not receive 15% rewards for their nodes as initially agreed.** Also, **the fact beta stakers remain locked is something new, introduced in TIP-92**. Before TIP-92, the beta stakers were required to cooperate with the DAO on unstaking and transitioning but their stake was not locked. To address this issue we propose to allow unlocking the stake of those beta stakers immediately, just like the rest of the stakers. In addition to that, we commit to keep running those nodes for $2000/mo per node, paid in T starting Feb 14th, with an option to switch to a single node in the future with the DAO delegation. Although nodes with no stake will not participate in key generation rituals, they will continue to respond to signing requests. The proposed solution fixes TIP-92 rugging a selected group of stakers and prevents degradation of the network.\\n[View Proposal](https://threshold.network/<https:/forum.threshold.network/t/tip-101-boar-beta-staker-nodes/1058>)\\nTIP-092: Make T Great Again, Part 1 (Eliminate Inflation)\\nNov 2024 · maclane\\n**Background on T Emissions** Currently, Threshold Network uses token emissions to incentivize stakers to run nodes via the [“Stable Yield” model](https://forum.threshold.network/t/tip-003-threshold-network-reward-mechanisms-proposal-i-stable-yield-for-non-institutional-staker-welfare/82). This incentive model targets a 15% annual yield for stakers who run both tBTC and TACo nodes. Given historical staking rates since the launch of Threshold, this has resulted in an effective annual inflation rate of ~5% (or 500M T per year). At the current price of ~$0.025 per token, this is an annual emission cost of ~$12.5M. **tBTC Beta Staker Program** tBTC currently operates under the Beta Staker model (https://docs.threshold.network/staking-and-running-a-node/tbtc-stakers-faq#what-is-the-tbtc-beta-stakers-program), where only a DAO approved subset of stakers are eligible to be selected for DKG ceremonies to become signers on custody wallets. Currently, there are 35 addresses approved as Beta Stakers, which are operated by 21 distinct legal and economic entities. The DAO pays 18 of these operators between $2,000 and $3,000 per month to run nodes as part of the Beta Staker program, which is currently expected to sunset with the upgrade to Schnorr signatures in early 2025. **Extend the Beta Staker Program and Eliminate Inflation** The DAO could elect to extend the Beta Staker program through the Schnorr upgrade, maintain the permissioned operator set, and transition all 21 operators to paid, DAO-provided delegations (~$500,000 annual cost). This would enable eliminating T inflation rewards. The fixed annual Beta Staker payments of ~$500,000 per year are less than the minting and redemption proceeds earned by the network, especially with the likely reinstating of the minting and redemption fees to 0.1% and 0.25%, respectively. Other major tBTC-related costs are bootstrap nodes ($360,000 annually) and optimistic minter and guardian role payments ($132,000 annually). If this proposal is approved it's likely that tBTC will achieve profitability at the protocol level (excluding other DAO-related costs). Surplus fees can optionally be directed to the [T buyback program](https://forum.threshold.network/t/tip-54-tbtc-t-better-together/635), potentially making T deflationary. **Path to Permissionless Signing** Signing will become fully permissionless with the introduction of BitVM2 vaults, rather than the Schnorr upgrade and there will be no incentive for non-Beta Staker nodes to stay up in the meantime. **Operational Details** Along with the cessation of staking rewards, this proposal would allow for immediate unstaking by non-Beta Stakers without the mandatory 45-day and 6-month cooldown periods for tBTC and TACo, respectively. The Beta Staker nodes with delegations that are not from the DAO treasury will need to unstake and spin up new nodes with DAO delegations. Additionally, any operators running multiple Beta Staker nodes will unstake their duplicate nodes so that each independent operator is running a single Beta Staker node. The end result will be 21 beta staker nodes operated by 21 distinct legal and economic entities. The DAO can of course approve additional Beta Stakers at any time. Deprecated Beta Staker nodes will need to be safely removed from any active tBTC wallets and TACo cohorts, via inter-wallet sweeping and the appropriate handover+refresh mechanism, respectively. Finally, since the DAO will control all Beta Staker delegations it can reduce the amount of its staked T tokens to at or near the minimum stake for all the Beta Stakers, allowing the 90M T tokens it is currently delegating to be reallocated for alternative use.\\n[View Proposal](https://threshold.network/<https:/forum.threshold.network/t/tip-092-make-t-great-again-part-1-eliminate-inflation/984>)\\nTIP 46: Defi Liquidity Bootstrap and Growth Part I - Market Maker\\nMar 2023 · sensecapital\\n**Vote Type:** Token holder DAO Governor Bravo Proposal **DAO Elected Representative Sponsor:** Will **Overview:** tBTC has successfully launched, but with limited utility, adoption at scale is currently bottlenecked. We need to establish tBTC use cases beyond the core BTC to ETH bridge. To do that, a solid liquidity foundation anchored around tBTC TVL and volume on DeFi needs to be built. This is a proposal for the Threshold DAO to engage with a Sense Capital to deliver market making services to bootstrap liquidity for tBTC across the DeFi ecosystem. Further details including services rendered and benefits to the DAO are included in the Detailed Summary section of this proposal. **Milestones and Deadlines:** * Commencement: Focus liquidity deployment, inventory rebalance and tweak and deploy smart contract based trading and concentrated liquidity management. * Ramp up (month 1): Increase volume and liquidity via V3 LP strategy and Dex arbitrage on mainnet, expand to additional L2s like Polygon and Optimism. * Growth (month 6 - 12): Grow volume with refined strategy. **Who Is Involved:** Sense Capital, Threshold Token Holder DAO, Threshold Treasury Guild **Detailed Summary:** This proposal calls for a 50m T loan to be given to Sense Capital from the Threshold DAO to be paid back in a basket of ETH based crypto assets potentially including stables and ETH. In addition to market making services Sense Capital will provide monthly reports on progress to the Threshold Treasury Guild. Other than executing the loan and monitoring performance of the engagement this proposal requires no further action on behalf of the Threshold DAO. **Who Is Sense Capital?** Bespoke trading firm based in Hong Kong/Australia, Market Making, Liquidity management on CEX/DEX since 2019. Focus on 3 apex assets like Bitcoin, ETH and Stablecoins. Advocate and early user of MakerDAO/Uniswap with strong Defi trading capabilities including automated Uniswap V3 liquidity management, cross DEX/CEX arbitrage based on our Defi orderflow and MEV data research. **Market Making Goals:** Make tBTC a dominant, trusted, distributed Bitcoin Representation on Defi, accessible / redeemable to Real BTC: * Bootstrap: Liquidity with Organic Defi Flywheel * Scale: AUM with large pockets with Unique value prop for each segment (exchange, mm, traders, miners) * Expand: Build out channels and rails (wallet, exchange, dapp, payment processors) **Key objectives** * Boost Defi trading volume on DEXes like Uniswap and Curve with concentrated liquidity deployment and MEV Arbitrage engine. * Increase sustainable yield generated for LP to incentivise liquidity growth in liquidity pools. * Improve user experience of liquidity to offer better depth and execution price on Dex liquidity pools. **Why this deal?** * Partnering with a DeFi focused market maker like Sense helps us lay the groundwork to attract tBTC DeFi Liquidity. * 50M T loan is a small price for this level of sophistication and in the trenches work is required to bootstrap tBTC. For comparison other firms asked for 200-300m T loan and only want to work on market making for T and on CeFi. * Sense is sensitive to T liquidity supply/demand market dynamics and has already laid out a calculated approach to minimize the supply impact when swapping T for ETH/BTC/stables (per the proposal). Post engagement, Sense Cap is flexible to pay back the loan back to the DAO in ETH/BTC/stables and/or T to aid in treasury diversification efforts. Tx Details (If required): Additional Info (Optional): T inventory would transfer over 3 stages. |Stages||T Inventory|Objectives| | --- | --- | --- | --- | |1|Commencement|10M|Rebalance T inventory, setup mainnet and arbitrum trading, data collection.| |2|Ramp up After 1-month from commencement.|15M|Increase volume and liquidity via V3 LP strategy and Dex arbitrage on mainnet, expand to additional L2s like Polygon and Optimism| |3|Growth After 6-month from commencement or KPI trigger|25M|Grow volume with refined strategy. KPI Trigger - Total Defi TVL exceeds 2000 tBTC - Daily trade volume exceeds $1M USD for 3 days (less TVL but higher yield and velocity) - DEX TVL increased $10M USD (excluding current Uniswap/Curve TVL)| Request Mint fee rebate in T token during stage 1, 2 to lower the cost of operation, a list of mint transaction id would be provided at the end of stage 2 for reimbursement. Example: Initial use of T token inventory at commencement. Passively rebalance 50% of first trench into Stable, ETH, Bitcoin over 2 weeks without price impact or supply shock. Current daily trading volume is $35M/day, passive rebalance would have negligible impact ($500/hour)\\n[View Proposal](https://threshold.network/<https:/forum.threshold.network/t/tip-46-defi-liquidity-bootstrap-and-growth-part-i-market-maker/560>)\\nGet involved\\n##### Become a part of our community\\nJoin our Discord server and our Telegram to get involved and stay up to date.\\n[![](https://threshold.network/images/logo-discord.png)Discord](https://threshold.network/<https:/discord.threshold.network>)[![](https://threshold.network/images/paper-plane-sharp.png)Telegram](https://threshold.network/<https:/t.me/thresholdnetwork>)\\nFor Developers\\n##### Learn more about the network\\nLearn more about the Threshold network by reading the documentation or visiting Github.\\n[![](https://threshold.network/images/logo-github.png)GitHub](https://threshold.network/<https:/github.com/threshold-network>)[Docs](https://threshold.network/<https:/docs.threshold.network/>)\\n##### Subscribe\\nReceive the latest news about Threshold\\n[![](https://threshold.network/)](https://threshold.network/</>)\\n[](https://threshold.network/<https:/twitter.com/TheTNetwork>)[](https://threshold.network/<https:/t.me/thresholdnetwork>)[](https://threshold.network/<https:/discord.threshold.network/>)[](https://threshold.network/<https:/forum.threshold.network>)[](https://threshold.network/<https:/github.com/threshold-network>)\\n[![](https://threshold.network/)](https://threshold.network/</>)\\n©2025 | All Rights Reserved\\nGeneral\\n[Dapp](https://threshold.network/<https:/dashboard.threshold.network/>)[Press](https://threshold.network/</press>)[Blog](https://threshold.network/<https:/blog.threshold.network/>)[Bug Bounty](https://threshold.network/<https:/immunefi.com/bounty/thresholdnetwork/>)\\nEarn\\n[Liquidity Provider](https://threshold.network/</earn/liquidity-provider>)[tBTC Bridge](https://threshold.network/</earn/btc>)[Token Holder](https://threshold.network/</earn/token-holder>)\\nCommunity\\n[Governance](https://threshold.network/</governance>)[Ecosystem](https://threshold.network/</ecosystem>)[Forum](https://threshold.network/<https:/forum.threshold.network/>)[Discord](https://threshold.network/<https:/discord.threshold.network>)[Telegram](https://threshold.network/<https:/t.me/thresholdnetwork>)\\nAbout\\n[Docs](https://threshold.network/<https:/docs.threshold.network/>)[Contributors](https://threshold.network/</about#contributors>)[FAQ](https://threshold.network/</about#faq>)[Brand Assets](https://threshold.network/<https:/bit.ly/threshold-brand-assets>)\\n\" markdown_with_citations=\"Maximize your BTC in DeFi. Mint tBTC now⟨1⟩\\n![⟨2⟩](https://threshold.network/</>)\\nEarn\\nLiquidity Provider⟨3⟩tBTC Bridge⟨4⟩Token Holder⟨5⟩\\nBuild\\nTACo⟨6⟩tBTC SDK⟨7⟩Docs⟨8⟩\\nGovernance⟨9⟩Ecosystem⟨10⟩\\nAbout\\nPress⟨11⟩Blog⟨12⟩Contributors⟨13⟩FAQ⟨14⟩Audits⟨15⟩Brand Assets⟨16⟩\\ntBTC dApp⟨17⟩\\n[](https://threshold.network/<https:/twitter.com/TheTNetwork>)[](https://threshold.network/<https:/t.me/thresholdnetwork>)[](https://threshold.network/<https:/discord.threshold.network>)[](https://threshold.network/<https:/github.com/threshold-network>)\\nNew!tBTC is live on Aave. Another opportunity to put your tBTC to work now!⟨18⟩\\n# Bridge your Bitcoin and start earning.\\n##### Deposit and redeem BTC in DeFi without intermediaries using Threshold's tBTC.\\nMint tBTC⟨17⟩Stay Updated⟨19⟩\\n![](https://threshold.network/images/minting-tbtc.png)\\n# 0.00\\n###### btc\\n##### BTC TVL\\n# 0\\n##### tBTC unique address\\n# $0\\n##### USD TVL\\nView Dune Analytics Dashboard⟨20⟩\\nBug bounty\\n## Join the hunt: $500K Bug Bounty\\n##### Spot security risks, claim your prize.\\nRead more⟨21⟩\\n![](https://threshold.network/images/immunefi.svg)\\nGet Started\\n## Provide Liquidity\\n##### Liquidity providers earn yields by depositing assets into liquidity pools.\\nLearn More⟨3⟩\\n![](https://threshold.network/images/liquidity.png)\\nGet Started\\n## Token Holder DAO\\n##### Make the most of your T tokens on the Threshold Network by participating in DAO governance.\\nGovernance Forum⟨22⟩Learn More⟨5⟩\\n![](https://threshold.network/images/token-holder.png)\\nGet Started\\n## Build uncensorable e2ee into your dapp\\n##### TACo is the only end-to-end encryption plugin that is end-to-end decentralized\\nTaco.build⟨23⟩Docs⟨6⟩\\n![](https://threshold.network/images/taco-section-image.svg)\\n## Threshold is run by an active community.\\nThe Threshold DAO is a decentralized community of T token holders and their delegates who collectively vote to decide what's next for the network.\\nAbout Governance⟨9⟩\\n![](https://threshold.network/images/governance.png)\\n##### Current Proposals\\nTIP-101: Boar beta staker nodes\\nFeb 2025 · boar.network\\nPer TIP-92, immediate withdrawal applies only to non-beta stakers. The stake held by beta stakers will not be withdrawable until the beta nodes transition to DAO-provided delegations or a DAO-controlled whitelist. There are 6 beta staker nodes operated by Boar. Those nodes were being compensated entirely via rewards and operationally paid for by other entities out of pocket. All those stakers are early supporters of the network participating in the very first signing groups. **Out of all currently operating tBTC wallets, up to 21% of group key shares are held on those nodes.** Although with a 51-of-100 threshold disabling those nodes should not kill the liveness of wallets, in practice, the outcome will depend on the rest of the peers and the 21% liveness reduction is quite significant. Disabling those nodes today significantly increases the risk to the network with **up to 21% liveness reduction of signing groups.** With TIP-92 changes, the company is put in an extremely difficult position. **The stakes of customers will remain locked but they will not receive 15% rewards for their nodes as initially agreed.** Also, **the fact beta stakers remain locked is something new, introduced in TIP-92**. Before TIP-92, the beta stakers were required to cooperate with the DAO on unstaking and transitioning but their stake was not locked. To address this issue we propose to allow unlocking the stake of those beta stakers immediately, just like the rest of the stakers. In addition to that, we commit to keep running those nodes for $2000/mo per node, paid in T starting Feb 14th, with an option to switch to a single node in the future with the DAO delegation. Although nodes with no stake will not participate in key generation rituals, they will continue to respond to signing requests. The proposed solution fixes TIP-92 rugging a selected group of stakers and prevents degradation of the network.\\nView Proposal⟨24⟩\\nTIP-092: Make T Great Again, Part 1 (Eliminate Inflation)\\nNov 2024 · maclane\\n**Background on T Emissions** Currently, Threshold Network uses token emissions to incentivize stakers to run nodes via the “Stable Yield” model⟨25⟩. This incentive model targets a 15% annual yield for stakers who run both tBTC and TACo nodes. Given historical staking rates since the launch of Threshold, this has resulted in an effective annual inflation rate of ~5% (or 500M T per year). At the current price of ~$0.025 per token, this is an annual emission cost of ~$12.5M. **tBTC Beta Staker Program** tBTC currently operates under the Beta Staker model (https://docs.threshold.network/staking-and-running-a-node/tbtc-stakers-faq#what-is-the-tbtc-beta-stakers-program), where only a DAO approved subset of stakers are eligible to be selected for DKG ceremonies to become signers on custody wallets. Currently, there are 35 addresses approved as Beta Stakers, which are operated by 21 distinct legal and economic entities. The DAO pays 18 of these operators between $2,000 and $3,000 per month to run nodes as part of the Beta Staker program, which is currently expected to sunset with the upgrade to Schnorr signatures in early 2025. **Extend the Beta Staker Program and Eliminate Inflation** The DAO could elect to extend the Beta Staker program through the Schnorr upgrade, maintain the permissioned operator set, and transition all 21 operators to paid, DAO-provided delegations (~$500,000 annual cost). This would enable eliminating T inflation rewards. The fixed annual Beta Staker payments of ~$500,000 per year are less than the minting and redemption proceeds earned by the network, especially with the likely reinstating of the minting and redemption fees to 0.1% and 0.25%, respectively. Other major tBTC-related costs are bootstrap nodes ($360,000 annually) and optimistic minter and guardian role payments ($132,000 annually). If this proposal is approved it's likely that tBTC will achieve profitability at the protocol level (excluding other DAO-related costs). Surplus fees can optionally be directed to the T buyback program⟨26⟩, potentially making T deflationary. **Path to Permissionless Signing** Signing will become fully permissionless with the introduction of BitVM2 vaults, rather than the Schnorr upgrade and there will be no incentive for non-Beta Staker nodes to stay up in the meantime. **Operational Details** Along with the cessation of staking rewards, this proposal would allow for immediate unstaking by non-Beta Stakers without the mandatory 45-day and 6-month cooldown periods for tBTC and TACo, respectively. The Beta Staker nodes with delegations that are not from the DAO treasury will need to unstake and spin up new nodes with DAO delegations. Additionally, any operators running multiple Beta Staker nodes will unstake their duplicate nodes so that each independent operator is running a single Beta Staker node. The end result will be 21 beta staker nodes operated by 21 distinct legal and economic entities. The DAO can of course approve additional Beta Stakers at any time. Deprecated Beta Staker nodes will need to be safely removed from any active tBTC wallets and TACo cohorts, via inter-wallet sweeping and the appropriate handover+refresh mechanism, respectively. Finally, since the DAO will control all Beta Staker delegations it can reduce the amount of its staked T tokens to at or near the minimum stake for all the Beta Stakers, allowing the 90M T tokens it is currently delegating to be reallocated for alternative use.\\nView Proposal⟨27⟩\\nTIP 46: Defi Liquidity Bootstrap and Growth Part I - Market Maker\\nMar 2023 · sensecapital\\n**Vote Type:** Token holder DAO Governor Bravo Proposal **DAO Elected Representative Sponsor:** Will **Overview:** tBTC has successfully launched, but with limited utility, adoption at scale is currently bottlenecked. We need to establish tBTC use cases beyond the core BTC to ETH bridge. To do that, a solid liquidity foundation anchored around tBTC TVL and volume on DeFi needs to be built. This is a proposal for the Threshold DAO to engage with a Sense Capital to deliver market making services to bootstrap liquidity for tBTC across the DeFi ecosystem. Further details including services rendered and benefits to the DAO are included in the Detailed Summary section of this proposal. **Milestones and Deadlines:** * Commencement: Focus liquidity deployment, inventory rebalance and tweak and deploy smart contract based trading and concentrated liquidity management. * Ramp up (month 1): Increase volume and liquidity via V3 LP strategy and Dex arbitrage on mainnet, expand to additional L2s like Polygon and Optimism. * Growth (month 6 - 12): Grow volume with refined strategy. **Who Is Involved:** Sense Capital, Threshold Token Holder DAO, Threshold Treasury Guild **Detailed Summary:** This proposal calls for a 50m T loan to be given to Sense Capital from the Threshold DAO to be paid back in a basket of ETH based crypto assets potentially including stables and ETH. In addition to market making services Sense Capital will provide monthly reports on progress to the Threshold Treasury Guild. Other than executing the loan and monitoring performance of the engagement this proposal requires no further action on behalf of the Threshold DAO. **Who Is Sense Capital?** Bespoke trading firm based in Hong Kong/Australia, Market Making, Liquidity management on CEX/DEX since 2019. Focus on 3 apex assets like Bitcoin, ETH and Stablecoins. Advocate and early user of MakerDAO/Uniswap with strong Defi trading capabilities including automated Uniswap V3 liquidity management, cross DEX/CEX arbitrage based on our Defi orderflow and MEV data research. **Market Making Goals:** Make tBTC a dominant, trusted, distributed Bitcoin Representation on Defi, accessible / redeemable to Real BTC: * Bootstrap: Liquidity with Organic Defi Flywheel * Scale: AUM with large pockets with Unique value prop for each segment (exchange, mm, traders, miners) * Expand: Build out channels and rails (wallet, exchange, dapp, payment processors) **Key objectives** * Boost Defi trading volume on DEXes like Uniswap and Curve with concentrated liquidity deployment and MEV Arbitrage engine. * Increase sustainable yield generated for LP to incentivise liquidity growth in liquidity pools. * Improve user experience of liquidity to offer better depth and execution price on Dex liquidity pools. **Why this deal?** * Partnering with a DeFi focused market maker like Sense helps us lay the groundwork to attract tBTC DeFi Liquidity. * 50M T loan is a small price for this level of sophistication and in the trenches work is required to bootstrap tBTC. For comparison other firms asked for 200-300m T loan and only want to work on market making for T and on CeFi. * Sense is sensitive to T liquidity supply/demand market dynamics and has already laid out a calculated approach to minimize the supply impact when swapping T for ETH/BTC/stables (per the proposal). Post engagement, Sense Cap is flexible to pay back the loan back to the DAO in ETH/BTC/stables and/or T to aid in treasury diversification efforts. Tx Details (If required): Additional Info (Optional): T inventory would transfer over 3 stages. |Stages||T Inventory|Objectives| | --- | --- | --- | --- | |1|Commencement|10M|Rebalance T inventory, setup mainnet and arbitrum trading, data collection.| |2|Ramp up After 1-month from commencement.|15M|Increase volume and liquidity via V3 LP strategy and Dex arbitrage on mainnet, expand to additional L2s like Polygon and Optimism| |3|Growth After 6-month from commencement or KPI trigger|25M|Grow volume with refined strategy. KPI Trigger - Total Defi TVL exceeds 2000 tBTC - Daily trade volume exceeds $1M USD for 3 days (less TVL but higher yield and velocity) - DEX TVL increased $10M USD (excluding current Uniswap/Curve TVL)| Request Mint fee rebate in T token during stage 1, 2 to lower the cost of operation, a list of mint transaction id would be provided at the end of stage 2 for reimbursement. Example: Initial use of T token inventory at commencement. Passively rebalance 50% of first trench into Stable, ETH, Bitcoin over 2 weeks without price impact or supply shock. Current daily trading volume is $35M/day, passive rebalance would have negligible impact ($500/hour)\\nView Proposal⟨28⟩\\nGet involved\\n##### Become a part of our community\\nJoin our Discord server and our Telegram to get involved and stay up to date.\\n![⟨29⟩Discord](https://threshold.network/<https:/discord.threshold.network>)![⟨30⟩Telegram](https://threshold.network/<https:/t.me/thresholdnetwork>)\\nFor Developers\\n##### Learn more about the network\\nLearn more about the Threshold network by reading the documentation or visiting Github.\\n![⟨31⟩GitHub](https://threshold.network/<https:/github.com/threshold-network>)Docs⟨8⟩\\n##### Subscribe\\nReceive the latest news about Threshold\\n![⟨2⟩](https://threshold.network/</>)\\n[](https://threshold.network/<https:/twitter.com/TheTNetwork>)[](https://threshold.network/<https:/t.me/thresholdnetwork>)[](https://threshold.network/<https:/discord.threshold.network/>)[](https://threshold.network/<https:/forum.threshold.network>)[](https://threshold.network/<https:/github.com/threshold-network>)\\n![⟨2⟩](https://threshold.network/</>)\\n©2025 | All Rights Reserved\\nGeneral\\nDapp⟨32⟩Press⟨11⟩Blog⟨12⟩Bug Bounty⟨21⟩\\nEarn\\nLiquidity Provider⟨3⟩tBTC Bridge⟨4⟩Token Holder⟨5⟩\\nCommunity\\nGovernance⟨9⟩Ecosystem⟨10⟩Forum⟨22⟩Discord⟨33⟩Telegram⟨34⟩\\nAbout\\nDocs⟨8⟩Contributors⟨13⟩FAQ⟨14⟩Brand Assets⟨16⟩\\n\" references_markdown='\\n\\n## References\\n\\n⟨1⟩ https://threshold.network/<https:/dashboard.threshold.network/tBTC/mint>: Mint tBTC now\\n⟨2⟩ https://threshold.network/: ![\\n⟨3⟩ https://threshold.network/</earn/liquidity-provider>: Liquidity Provider\\n⟨4⟩ https://threshold.network/</earn/btc>: tBTC Bridge\\n⟨5⟩ https://threshold.network/</earn/token-holder>: Token Holder\\n⟨6⟩ https://threshold.network/<https:/docs.taco.build>: TACo\\n⟨7⟩ https://threshold.network/</build/tbtc-sdk>: tBTC SDK\\n⟨8⟩ https://threshold.network/<https:/docs.threshold.network/>: Docs\\n⟨9⟩ https://threshold.network/</governance>: Governance\\n⟨10⟩ https://threshold.network/</ecosystem>: Ecosystem\\n⟨11⟩ https://threshold.network/</press>: Press\\n⟨12⟩ https://threshold.network/<https:/blog.threshold.network/>: Blog\\n⟨13⟩ https://threshold.network/</about#contributors>: Contributors\\n⟨14⟩ https://threshold.network/</about#faq>: FAQ\\n⟨15⟩ https://threshold.network/</about#audits>: Audits\\n⟨16⟩ https://threshold.network/<https:/bit.ly/threshold-brand-assets>: Brand Assets\\n⟨17⟩ https://threshold.network/<https:/dashboard.threshold.network/tBTC>: tBTC dApp\\n⟨18⟩ https://threshold.network/<https:/app.aave.com/reserve-overview/?underlyingAsset=0x18084fba666a33d37592fa2633fd49a74dd93a88&marketName=proto_mainnet_v3>: New!tBTC is live on Aave. Another opportunity to put your tBTC to work now!\\n⟨19⟩ https://threshold.network/<https:/twitter.com/TheTNetwork>: Stay Updated\\n⟨20⟩ https://threshold.network/<https:/dune.com/threshold/tbtc>: View Dune Analytics Dashboard\\n⟨21⟩ https://threshold.network/<https:/immunefi.com/bounty/thresholdnetwork/>: Read more\\n⟨22⟩ https://threshold.network/<https:/forum.threshold.network/>: Governance Forum\\n⟨23⟩ https://threshold.network/<https:/taco.build>: Taco.build\\n⟨24⟩ https://threshold.network/<https:/forum.threshold.network/t/tip-101-boar-beta-staker-nodes/1058>: View Proposal\\n⟨25⟩ https://forum.threshold.network/t/tip-003-threshold-network-reward-mechanisms-proposal-i-stable-yield-for-non-institutional-staker-welfare/82: “Stable Yield” model\\n⟨26⟩ https://forum.threshold.network/t/tip-54-tbtc-t-better-together/635: T buyback program\\n⟨27⟩ https://threshold.network/<https:/forum.threshold.network/t/tip-092-make-t-great-again-part-1-eliminate-inflation/984>: View Proposal\\n⟨28⟩ https://threshold.network/<https:/forum.threshold.network/t/tip-46-defi-liquidity-bootstrap-and-growth-part-i-market-maker/560>: View Proposal\\n⟨29⟩ https://threshold.network/images/logo-discord.png: ![\\n⟨30⟩ https://threshold.network/images/paper-plane-sharp.png: ![\\n⟨31⟩ https://threshold.network/images/logo-github.png: ![\\n⟨32⟩ https://threshold.network/<https:/dashboard.threshold.network/>: Dapp\\n⟨33⟩ https://threshold.network/<https:/discord.threshold.network>: Discord\\n⟨34⟩ https://threshold.network/<https:/t.me/thresholdnetwork>: Telegram\\n' fit_markdown='' fit_html=''",
  "generated_description": "**Threshold Network: A Quick Overview**\n\nThreshold is a forward-looking company at the intersection of decentralized finance (DeFi) and cryptography, aiming to maximize the utility of Bitcoin within the burgeoning DeFi ecosystem. Formerly known as NuCypher, Threshold was established in 2015 and is part of Y Combinator's Batch S16. Currently based in Austin, Texas, their compact team of 10 employees is working closely with major players in the industry, including organizations like Ceramic, Irys, Textile, and Unlock. \n\n### What They Do\nThreshold is focused on decentralized threshold cryptography and privacy solutions. Their flagship product, Threshold Access Control (TACo), operates on over 120 nodes, maintaining around $80 million in economic security. This not only ensures robust privacy and data sharing capabilities but has also attracted paying developers and partners. Their mainnet launched in January 2024, and the technology enables significant innovations in end-to-end encryption and decentralized governance.\n\nThe company's current projects include:\n- **tBTC**: A bridge for Bitcoin in the DeFi space, allowing users to mint and utilize Bitcoin without intermediaries.\n- **Liquidity Provision**: For those looking to earn yields by supplying liquidity within the DeFi ecosystem.\n- **Token Holder Governance**: Engaging the community to participate in the governance of the network through their DAO.\n\n### The Vision\nThreshold's vision is clear: to develop a network designed for secure, decentralized, and permissionless operations. The underlying idea rests on creating a constructive ecosystem where developers can build DeFi applications that integrate robust encryption techniques, allowing for safe data sharing and custodianship of digital assets.\n\n### Market Context\nWith a market cap of approximately $370 million, Threshold is positioned as a significant player in the DeFi landscape, especially as the use of stable tokens and decentralized governance continues to grow in importance. Their proposals and community-driven decisions, like the recent TIP-101 and TIP-092 for enhancing governance and reducing token inflation, illustrate a proactive approach to adapting and evolving in the crypto space.\n\n### How to Get Involved\nFor developers and curious participants alike, Threshold offers avenues to mint tBTC, become liquidity providers, and engage in governance discussions via their community platforms. They are also running a $500K bug bounty program to encourage security enhancement of their network.\n\n### Conclusion\nThreshold Network encapsulates the exciting potential of DeFi while tackling the vital issues of privacy and encryption with innovative cryptographic approaches. With a clear mission and a passionate team ready to embrace the decentralized future, they are definitely one to watch as the landscape continues to evolve.\n\nFor additional details, you can explore their website at [Threshold.Network](https://threshold.network/)."
}