{
  "links": "https://www.ycombinator.com/companies/titan",
  "name": "Titan",
  "headline": "We manage people's wealth",
  "batch": "S18",
  "description": "We're a modern wealth manager. There are many solutions out there for how one can invest by themselves (e.g., DIY brokerages like Robinhood). But for those who want to have their money managed, they must turn to high fee, high minimum advisors (e.g., RIAs like Edward Jones). With LLMs, we can now offer personalized wealth management to many more people, more cheaply and with faster service. Our goal is to grow their wealth more than they'd do on their own.",
  "activity_status": "Active",
  "website": "http://www.titan.com",
  "founded_date": 2018.0,
  "team_size": 50.0,
  "location": "New York",
  "group_partner": null,
  "group_partner_yc": null,
  "company_linkedin": null,
  "company_twitter": null,
  "tags": "industry:fintech; industry:saas; location:new-york",
  "founders": [
    {
      "name": "Clayton Gardner, Founder",
      "description": "Clay is co-founder and co-CEO of Titan. Prior to Titan, he spent six years as an investor at multi-billion dollar hedge funds and private equity firms including Goldman Sachs and Farallon Capital Management. He graduated summa cum laude from the Wharton School and School of Engineering at the University of Pennsylvania with degrees in economics and computer science.",
      "linkedin": "https://www.linkedin.com/in/claytongardner/"
    },
    {
      "name": "Joe Percoco, Founder",
      "description": "Co-founder @ Titan (based in NYC)",
      "linkedin": "https://www.linkedin.com/in/joe-percoco-62459839/"
    },
    {
      "name": "Max Bernardy, Founder/CTO",
      "description": null,
      "linkedin": "https://www.linkedin.com/in/max-bernardy-47292a60"
    }
  ],
  "status": true,
  "markdown": "raw_markdown='[](http://www.titan.com/</>)\\nMenu\\n  * [Wealth](http://www.titan.com/</wealth>)\\n  * [Testimonials](http://www.titan.com/</testimonials>)\\n  * [About](http://www.titan.com/</about>)\\n  * [FAQs](http://www.titan.com/</#faqs>)\\n[Join Now](http://www.titan.com/</join-now>)\\n\\n\\n# Time Is Money. You Deserve Both.\\nWe\\'re your investment team. Our goal is to make you more money and save you more time than you would trying to manage your wealth on your own.\\nPhone Number\\nGet Started\\n$1+ Billion AUM\\n500,000+ Downloads\\n4.6 App Store Rating\\n2024\\nFinancial Services Review\\nTop 10 Investment Firms\\n2023\\nUSA TODAY\\nBest Financial Advisory Firms\\n2022\\nFinovate Awards\\nBest Wealth Management Solution\\n2021\\nGlobal Brands Magazine\\nFastest Growing Retail Investment Brand\\nView Disclosures\\n![](https://cdn.titanvest.com/images/marketing/gaia/home/flare-bg.jpg)\\nWave goodbye to DIY\\n## Professional Wealth Management, Without the High Fees or Minimums\\n![](https://cdn.titanvest.com/images/marketing/gaia/home/overview/phone-1.png)\\n![](https://cdn.titanvest.com/images/marketing/gaia/home/overview/phone-frame-transparent.png)\\n### We Actively Manage Your Wealth\\nGet a tailored portfolio of our proprietary investment strategies across treasuries, stocks, ETFs, and more. Developed and managed by our in-house team.\\n![](https://cdn.titanvest.com/images/marketing/gaia/home/overview/phone-2.png)\\n![](https://cdn.titanvest.com/images/marketing/gaia/home/overview/phone-frame-transparent.png)\\n### Advice On Demand\\nFrom investment recommendations to tax saving strategies, stay on track with guidance from our licensed financial advisors.\\n![](https://cdn.titanvest.com/images/marketing/gaia/home/overview/phone-3.png)\\n![](https://cdn.titanvest.com/images/marketing/gaia/home/overview/phone-frame-transparent.png)\\n### Perks Beyond Wealth\\nWith wealth comes privilege. Our Concierge gets you access to the best in dining and events in major cities. We go the extra mile for our clients.\\n![](https://cdn.titanvest.com/images/marketing/gaia/home/overview/phone-1.png)\\n![](https://cdn.titanvest.com/images/marketing/gaia/home/overview/phone-2.png)\\n![](https://cdn.titanvest.com/images/marketing/gaia/home/overview/phone-3.png)\\n![](https://cdn.titanvest.com/images/marketing/gaia/home/overview/phone-frame-transparent.png)\\nLike a CIO in Your Pocket\\n## Straight Talk About Your Money\\n![](https://cdn.titanvest.com/images/marketing/gaia/home/road-signs.jpg)\\nLevel Up From DIY Investing\\nTitan clients have historically compounded their wealth at 10.72% per year on average. Studies show that the average DIY investor underperforms advisors and the broader market by ~3% per year.\\nPhone Number\\nGet Started\\nTitan\\'s performance figure represents the annualized return since 2/20/2018, when Titan launched, and is a composite of the median aggregate performance of all client accounts and portfolio allocations as of 12/31/2024, net of fees. View additional disclosures\\nTestimonials\\n## Hear From Our Clients\\n[View Testimonials](http://www.titan.com/</testimonials>)\\nWhat\\'s included\\n## Your Complete Wealth Team, at 0.2% Advisory Fee Per Year\\n(Traditional advisors typically charge 1-1.8% for less)\\n### Core Investment Strategies\\nAutomated index investing that tracks global markets - the foundation of a diversified portfolio. Simple, efficient, effective.\\n### Active Management\\nOur investment team\\'s conviction-driven ideas, actively managed in pursuit of long-term growth. We research, pick, and manage positions for you.\\n### Smart Treasury\\nYour cash should work as hard as you do. We automatically move it to our highest available after-tax yield for you.\\n### Alternative Assets\\nAccess to alternative investments, including options traditionally reserved for the ultra-wealthy: venture capital, private credit, real estate, and crypto. Managed by notable Wall Street firms, now available to you.\\nHelp on demand\\n## Get Guidance From Professional Advisors\\nBook one-on-one sessions and group calls with our financial advisors.\\n![Advisor](https://cdn.titanvest.com/images/marketing/gaia/home/advisory/avatars/advisor-1.jpg)\\nJack · Licensed Advisor\\n![Advisor](https://cdn.titanvest.com/images/marketing/gaia/home/advisory/avatars/advisor-2.jpg)\\nClay · Chief Investment Officer\\n![Advisor](https://cdn.titanvest.com/images/marketing/gaia/home/advisory/avatars/advisor-3.jpg)\\nSofia · Licensed Advisor\\n![Advisor](https://cdn.titanvest.com/images/marketing/gaia/home/advisory/avatars/advisor-4.jpg)\\nJohn · Investment Analyst\\nOur advisors and analysts come from experience:\\n![Goldman Sachs logo](https://cdn.titanvest.com/images/marketing/gaia/home/advisory/logos/goldman.png)![JP Morgan Chase logo](https://cdn.titanvest.com/images/marketing/gaia/home/advisory/logos/jp-morgan.png)![Blackstone logo](https://cdn.titanvest.com/images/marketing/gaia/home/advisory/logos/blackstone.png)![Farallon logo](https://cdn.titanvest.com/images/marketing/gaia/home/advisory/logos/farallon.png)![Cerberus logo](https://cdn.titanvest.com/images/marketing/gaia/home/advisory/logos/cerberus.png)\\n## Beyond Just Investment Management—Taxes, Too.\\nGet expert tax filing (valued at up to ~[$300](http://www.titan.com/<https:/www.investopedia.com/articles/taxes/021717/what-will-i-pay-tax-preparation-fees.asp>)), exclusive market insights through Titan Talks, and VIP hospitality access in major US cities.\\nTitan clients include high-earning professionals from some of the most iconic companies and institutions in the US.\\nCompare for yourself\\n## The 50th Floor Experience, In The Palm Of Your Hand\\nFeatures\\nStock Trading Apps\\ne.g. Robinhood\\nPrivate Wealth Managers\\ne.g. UBS, Goldman Sachs\\nInvestment Options\\nCash Management Strategies\\nTax optimized money market funds\\nAlpha Oriented Equity Strategies\\nLong only, actively managed\\nAutomated Index Investing\\nLow-cost, tax-advantaged passive investment strategies\\nAlternative Investments \\nVenture Capital, Real Estate, Credit, Crypto\\nBuy & Sell individual stocks and ETFs\\nAn investment \\'sidecar\\'\\nAdvisory Services\\nBespoke Asset Allocation\\nTailored portfolio construction\\nOngoing Investment Advice\\nContinuous financial expertise to navigate market shifts\\nPersonalized Financial Advisory\\nCustom-built and regularly fine-tuned\\nExclusive Benefits\\nComplimentary Tax Filing\\nHassle-free tax preparation with expert review\\nOn Demand Concierge Service\\nSMS an in-house Concierge Team\\nCurated Events & Experiences\\nBox suite tickets, courtside sports, speaker events\\nThe comparison above is for informational purposes only. Features listed for other platforms or services are not exhaustive, may vary, and are subject to change.\\nMake Managing Your Wealth Our Job.\\nWe\\'re ready when you are.\\nPhone Number\\nGet Started\\n## Frequently Asked Questions\\nHow is Titan different?\\nThink of us as the natural next step when you’ve outgrown “Do It Yourself” trading and want something more sophisticated than a basic robo-advisor.\\nWith trading apps, you’re on your own buying and selling stocks. With robo-advisors, you get a cookie-cutter ETF portfolio that never changes. Neither is ideal if you are serious about trying to grow your wealth.\\nWe’re building what comes next. Titan actively manages your money with a team of real investment professionals at your disposal, all focused on one goal: making you more money while saving you more time. Plus, you get premium benefits you’ll actually use, like free tax filing and direct access to our investment team.\\nWhy shouldn’t I just use the S&P 500?\\nWe’re big fans of the S&P 500. It’s a well-rounded index of equities that has historically performed very well over a long period of time relative to other investment options. But it shouldn’t be 100% of most people’s portfolios at all times. Wealth should be personalized.\\nWe take your personal situation into account and build you a portfolio that goes beyond just large US stocks. We mix passive and active strategies across different asset classes, and we’re tactical about when and how to invest – especially important when the S&P 500 is hitting all-time highs.\\nBottom line: The S&P 500 is a great tool, but it’s just one tool. Your wealth needs a full toolbox, and that’s what we provide.\\nHow is Titan choosing investment options for me?\\nWe get it – finance is full of jargon, endless options, and a lot of noise. Our approach is different. We’re incredibly picky about what makes it into your portfolio because our mission is simple: growing your wealth as efficiently as possible.\\nWe maintain a small but powerful suite of investment tools, carefully chosen by our investment team. No bloated menus of random options – just high-quality investment options at the lowest possible prices. Think of us as your investment filter, cutting through the Wall Street noise to identify what actually works.\\nOur analysts conduct deep research on every investment we offer, asking one simple question: How can this help grow your hard-earned money quicker and more efficiently? That’s it.\\nHow often should I expect to chat with an advisor?\\nThink of us as your personal advisor team that’s always just a tap away. You’re in control of how much support you want. Major life changes on the horizon? Let’s talk them through. Just want a quick portfolio review? We can do that too.\\nSome of our clients love having quarterly check-ins to stay on top of their financial goals and make sure everything’s tracking right. Others might only reach out once or twice a year when they’re facing big life decisions or want to revisit their strategy. Both approaches are perfectly fine – we’re here when you need us.\\nHow much does Titan membership cost?\\nOur membership is straightforward: $25/month (or $250/year if you choose annual billing). This isn’t just another fee – it’s your investment in having a team of professionals actively manage your wealth.\\nTitan clients have historically compounded their wealth at 11.6% per year on average. Studies show that the average DIY investor underperforms advisors and the broader market by ~3% per year. (Disclosure)\\nFor our average client making $75/hour, we save them over $10,000 worth of time annually – time they’d otherwise spend managing their own portfolio (most DIY investors spend 3-5 hours weekly on this).\\nPlus, we’re about 50% cheaper than traditional private wealth managers. If you’ve invested at least $6,000 in our Smart Treasury product, the earnings from our industry-leading yield can offset your membership fee. Bottom line: if we save you just 20 minutes a month (which we consistently do), the fee has already paid for itself.\\nMore info on pricing [here](http://www.titan.com/<https:/help.titan.com/en_us/titan-s-fees-B1lNrytB9>).\\nHow do I know Titan is the right wealth manager for me?\\nSimple: If you’ve graduated from DIY trading apps and want your wealth managed by professionals who actually explain what they’re doing, we’re your team. We’re built for people who value their time and want their money working harder for them.\\nThink of us as your personal chief financial officer, right in your pocket. We take the complex world of wealth management and make it straightforward, active, and tailored to you. No more juggling multiple apps or trying to piece together your own investment strategy – we handle everything in one place, with one clear goal: make you more money while saving you more time.\\nWhy do Titan clients choose us?\\nWe’re not your typical wealth manager. We’re building what we wanted but couldn’t find – a wealth manager that combines institutional-grade investing with modern technology and real human expertise, but without the high fees and minimums usually required by other firms. You get our proprietary investment strategies (like our Flagship equity portfolio), smart cash management solutions, and on-demand access to real financial advisors who know their stuff.\\nBut it’s more than just managing money. We’re giving you back your time and peace of mind, plus adding perks you’ll actually use – like free tax filing and access to investment opportunities typically reserved for the ultra-wealthy. We’re not just managing your wealth; we’re helping you build and enjoy it.\\nHow secure is my money with Titan?\\nLet us be crystal clear about this: Your security is our absolute priority. As an SEC-registered investment adviser, Titan is legally required to act in your best interest as a fiduciary.\\nSIPC protects investors against the loss of [cash and securities](http://www.titan.com/<https:/www.sipc.org/for-investors/what-sipc-protects#cash>) in the event of a SIPC-member brokerage firm failure. The limit of SIPC coverage is $500,000, which includes a $250,000 limit for cash. SIPC coverage is limited and does not protect against the decline in value of your securities. For more details, visit [www.sipc.org.](http://www.titan.com/<https:/www.sipc.org/>)\\nPlus, we use a third-party custodian to hold client assets separately. Most importantly, you own all your underlying assets in a separately managed account - we don\\'t hold your assets directly. We employ industry-leading encryption and cybersecurity measures to protect your data, from encryption to SAML protection, because we know we\\'re handling your hard-earned money. That\\'s a responsibility we take incredibly seriously.\\nProduct\\n[Smart Treasury](http://www.titan.com/</smart-treasury>)[Wealth](http://www.titan.com/</wealth>)[Performance](http://www.titan.com/</historical-performance>)[Log in](http://www.titan.com/</login>)\\nTitan\\n[Testimonials](http://www.titan.com/</testimonials>)[About](http://www.titan.com/</about>)[Careers](http://www.titan.com/</careers>)\\nMore\\n[Legal](http://www.titan.com/</legal>)[Privacy](http://www.titan.com/</privacy-policy>)[Terms](http://www.titan.com/<https:/cdn.titanvest.com/disclosures/titan-terms-of-use.pdf>)[Help](http://www.titan.com/<https:/help.titan.com/>)\\n© 2025 Titan Global Capital Management USA LLC. All Rights Reserved.\\n[Instagram](http://www.titan.com/<https:/www.instagram.com/titanvest/>)[Twitter](http://www.titan.com/<https:/twitter.com/titanvest>)[Youtube](http://www.titan.com/<https:/www.youtube.com/c/Titanvest>)[LinkedIn](http://www.titan.com/<https:/www.linkedin.com/company/titan-invest/>)\\nAdvisory services are provided by Titan Global Capital Management USA LLC (\"Titan\"), an investment adviser registered with the Securities and Exchange Commission (“SEC”). By using this website, you accept and agree to Titan’s [_Terms of Use_](http://www.titan.com/<https:/www.titan.com/terms>) and [_Privacy Policy_](http://www.titan.com/<https:/www.titan.com/privacypolicy>). Titan’s investment advisory services are available only to residents of the United States in jurisdictions where Titan is registered. Nothing on this website should be considered an offer, solicitation of an offer, or advice to buy or sell securities or investment products. Past performance is no guarantee of future results. Any historical returns, expected returns, or probability projections are purely hypothetical in nature and may not reflect actual or potential future performance; nor do they represent actual performance outcomes of a client. Please see Titan’s Interactive Performance Tool available at [_www.titan.com/historical-performance_](http://www.titan.com/<http:/www.titan.com/historical-performance>) for important information and disclosures. Strategy holdings and other information provided are for illustrative purposes only and are not to be considered investment recommendations. The content on this website is for informational purposes only and does not constitute a comprehensive description of Titan’s investment advisory services. Any visuals of the in-app experience are for illustrative purposes only.\\nPlease refer to Titan\\'s [_Program Brochure_](http://www.titan.com/<https:/cdn.titanvest.com/disclosures/TitanInvest_FormADV_Part2A_Wrap_Brochure.pdf>) for important additional information. Certain investments are not suitable for all investors. Before investing, you should consider your investment objectives and any fees charged by Titan. The rate of return on investments can vary widely over time, especially for long term investments. Investment losses are possible, including the potential loss of all amounts invested, including principal. Brokerage services are provided to Titan Clients by Titan Global Technologies LLC and Apex Clearing Corporation, both registered broker-dealers and members of [_FINRA_](http://www.titan.com/<https:/www.finra.org/>)/[_SIPC_](http://www.titan.com/<https:/www.sipc.org/>). For more information, visit our [_disclosures_](http://www.titan.com/<https:/www.titan.com/disclosures>) page. You may check the background of these firms by visiting [_FINRA\\'s BrokerCheck_](http://www.titan.com/<https:/brokercheck.finra.org/>).\\nVarious Registered Investment Company products (“Third Party Funds”) offered by third party fund families and investment companies are made available on the platform. Before investing in such Third Party Funds you should consult the specific supplemental information available for each product. Please refer to Titan\\'s [_Program Brochure_](http://www.titan.com/<https:/cdn.titanvest.com/disclosures/TitanInvest_FormADV_Part2A_Wrap_Brochure.pdf>) for important additional information. Certain Third Party Funds that are available on Titan’s platform are interval funds. Investments in interval funds are highly speculative and subject to a lack of liquidity that is generally available in other types of investments. Actual investment return and principal value is likely to fluctuate and may depreciate in value when redeemed. Liquidity and distributions are not guaranteed, and are subject to availability at the discretion of the Third Party Fund.\\nThe cash sweep program is made available in coordination with Apex Clearing Corporation through Titan Global Technologies LLC. Please visit [_www.titan.com/legal_](http://www.titan.com/<https:/www.titan.com/legal>) for applicable [_terms and conditions_](http://www.titan.com/<https:/cdn.titanvest.com/disclosures/Titan+Cash+Sweep+Program+Terms+and+Conditions.pdf>) and important disclosures.\\n**Investments with exposure to crypto assets are only suitable for investors who are willing to bear the risk of loss and experience sharp drawdowns, as they still carry inherent risk associated with cryptocurrencies.** You are solely responsible for evaluating the merits and risks associated with the use of any information, materials, content, user content, or third party content provided before making any decisions based on such content. All investments carry risk, including the potential loss of principal. Investment growth is not guaranteed.\\nTitan’s concierge services are available exclusively to Titan clients, subject to availability and location, and are not guaranteed. Certain perks are subject to eligibility. Terms and conditions apply. Tax filing services via Titan Tax are offered by Column Tax. Titan does not provide tax advice, and Column Tax is not an affiliate of Titan. Terms apply, and details are available in Column Tax’s [_Terms of Use_](http://www.titan.com/<https:/www.columntax.com/terms-of-use>).\\nAny logos or mentions of other companies are for informational purposes only and do not imply affiliation or endorsement of Titan by these companies.\\nInformation provided by Titan Support is for informational and general educational purposes only and is not investment or financial advice.\\nContact Titan at _support@titan.com_. 508 LaGuardia Place NY, NY 10012.\\nDisclosure: (1) Assets Under Management (“AUM”) is as of 12/15/2024. (2) App download numbers are estimates based on anonymous user IDs from both Android and Apple iOS platforms, and may include multiple instances of counting due to changes in IDs over time. Data is as of 10/10/2024, since 2021. This number does not represent Titan’s client count. (3) Apple App Store Rating is 4.6/5 stars as of 02/12/2025, based on 6.9K ratings; it reflects user feedback and may not represent all experiences.\\nBest Financial Advisory Firms 2023, USA Today: The ranking of the best registered investment advisory firms (“RIA Firms”) was compiled by USA Today and Statista, is based on two dimensions: recommendations by clients and peers and a firm’s growth of Assets under Management (AUM). The recommendations were collected via an independent survey sent to over 20,000 individuals. While clients were able to evaluate and recommend their RIA firm, financial advisors working for an RIA firm were asked to consider a scenario where their own firm could not take on a client and had to recommend another RIA firm they appreciate. The development of AUM was analyzed both, short and long term based on publicly available data. For the short term view, the growth of AUM over a twelve months period was calculated, from January 2022 to January 2023. For the long term view, the growth of AUM over a five year period was calculated, from 2018 to 2023. In the consideration for the top 500 RIA firms, recommendations had a weight of 20% while development of AUM had a weight of 80% (short term and long term growth were equally weighted) to derive the final score.\\nTop Private Y Combinator Companies, Y Combinator (2023): Inclusion in the 2023 \\'Top Private Y Combinator Companies\\' list is based on the company\\'s valuation from its latest funding round, and all companies on the list are valued at over $150M.\\nTitan participated in the Y Combinator funding cycle in 2018. Y Combinator runs two three-month funding cycles a year, during which selected entrepreneurial teams are given a seed investment in exchange for a small equity stake in the company. The teams move to Silicon Valley for the duration of the cycle, during which they receive intensive mentoring and assistance in refining their business plans, developing their products, and pitching to investors. The cycle culminates in a Demo Day, during which each startup presents a quick pitch to a carefully selected, invite-only audience of investors.\\nBest Wealth Management Solution, Finovate (2022): The \\'Best Wealth Management Solution\\' award is given to a wealth management firm, bank or FI with an excellent new solution to give consumers more control over their future wealth and help them meet long-term financial goals.\\nFastest Growing Retail Investment Brand, Global Brands Magazine (2021): Titan\\'s recognition as the 2021 Fastest Growing Retail Investment Brand by Global Brands Magazine is based on an evaluation process involving a nominations team, an internal research team, and an independent external research agency. Companies are proactively invited to participate, and all nominations are validated and researched for adequate data. The external research agency then scrutinizes the nominations based on various criteria and publicly available data. Final award winners are decided by the internal team based on fundamental objectives and announced on the Global Brands Magazine website.\\nThese recognitions do not evaluate client satisfaction or predict future investment performance. They should not be construed as an endorsement of Titan by any client. Rankings and recognitions should not be construed by a client or prospective client as a guarantee that they will experience a certain level of results if Titan is engaged, or continues to be engaged, to provide investment advisory services. Nor should they be construed as a current or past endorsement of Titan.\\nDisclosure: Titan\\'s performance figure represents the annualized return since 2/20/2018, when Titan launched, and is a composite of the median aggregate performance of all client accounts and portfolio allocations as of 12/31/2024. This includes all strategies and third-party funds added over time, with performance figures accounting for the reinvestment of dividends and net of advisory and membership fees (where applicable). The 5-year annualized return is 12.38% (1/01/2020 – 12/31/2024), and the 1-year cumulative return is 21.1% (1/01/2024 – 12/31/2024). Past performance is not indicative of future results. All investments carry risk, including the potential loss of principal, and investment growth is not guaranteed. Vanguard attributes the ~3% added by financial advisors primarily to strategic planning and behavioral coaching. Additionally, [DALBAR\\'s annual Quantitative Analysis of Investor Behavior report](http://www.titan.com/<https:/atlasfinancialinc.com/wp-content/uploads/2023/06/DALBAR-2023-QAIB.pdf>) indicates that, over a 30-year period ending December 31, 2022, self-directed investors often underperform by ~3% annually due to behavioral biases and poor decision-making.\\nIn addition to the annual advisory fee, a Membership Fee of $25 per month (or $250 annually if paid in advance) applies. This fee covers platform access, investment offerings, tools, and services included in your wealth management experience.\\nDisclosure: Titan’s performance figure represents the annualized return since 2/20/2018, when Titan launched, and is a composite of the median aggregate performance of all client accounts and portfolio allocations as of 12/9/2024. This includes all strategies and third-party funds added over time, with performance figures accounting for the reinvestment of dividends and net of advisory and membership fees (where applicable). The 5-year annualized return is 13.69%, and the 1-year cumulative return is 28% (12/15/2023 – 12/15/2024). Past performance is not indicative of future results. All investments carry risk, including the potential loss of principal, and investment growth is not guaranteed. Vanguard attributes the ~3% added by financial advisors primarily to strategic planning and behavioral coaching. Additionally, DALBAR\\'s annual Quantitative Analysis of Investor Behavior report indicates that, over a 30-year period ending 12/31/2022, self-directed investors often underperform by ~3% annually due to behavioral biases and poor decision-making.\\n![](https://bat.bing.com/action/0?ti=56348962&tm=gtm002&Ver=2&mid=ba6a6a06-dfe5-44d6-b097-39d005e1d755&bo=1&sid=cfb4d030eedb11ef938dc3ebbd078c6a&vid=cfb62370eedb11efbabcc385bd3523f6&vids=1&msclkid=N&pi=918639831&lg=en-US&sw=1080&sh=600&sc=24&tl=Titan%20-%20Your%20Investment%20Team&p=https%3A%2F%2Fwww.titan.com%2F&r=&lt=2658&evt=pageLoad&sv=1&cdb=AQAQ&rn=811933)\\n![dot image pixel](https://sp.analytics.yahoo.com/sp.pl?a=10000&d=Wed%2C%2019%20Feb%202025%2016%3A08%3A52%20GMT&n=-5&b=Titan%20-%20Your%20Investment%20Team&.yp=10150054&f=https%3A%2F%2Fwww.titan.com%2F&enc=UTF-8&yv=1.16.6&tagmgr=gtm)\\n' markdown_with_citations='[](http://www.titan.com/</>)\\nMenu\\n  * Wealth⟨1⟩\\n  * Testimonials⟨2⟩\\n  * About⟨3⟩\\n  * FAQs⟨4⟩\\nJoin Now⟨5⟩\\n\\n\\n# Time Is Money. You Deserve Both.\\nWe\\'re your investment team. Our goal is to make you more money and save you more time than you would trying to manage your wealth on your own.\\nPhone Number\\nGet Started\\n$1+ Billion AUM\\n500,000+ Downloads\\n4.6 App Store Rating\\n2024\\nFinancial Services Review\\nTop 10 Investment Firms\\n2023\\nUSA TODAY\\nBest Financial Advisory Firms\\n2022\\nFinovate Awards\\nBest Wealth Management Solution\\n2021\\nGlobal Brands Magazine\\nFastest Growing Retail Investment Brand\\nView Disclosures\\n![](https://cdn.titanvest.com/images/marketing/gaia/home/flare-bg.jpg)\\nWave goodbye to DIY\\n## Professional Wealth Management, Without the High Fees or Minimums\\n![](https://cdn.titanvest.com/images/marketing/gaia/home/overview/phone-1.png)\\n![](https://cdn.titanvest.com/images/marketing/gaia/home/overview/phone-frame-transparent.png)\\n### We Actively Manage Your Wealth\\nGet a tailored portfolio of our proprietary investment strategies across treasuries, stocks, ETFs, and more. Developed and managed by our in-house team.\\n![](https://cdn.titanvest.com/images/marketing/gaia/home/overview/phone-2.png)\\n![](https://cdn.titanvest.com/images/marketing/gaia/home/overview/phone-frame-transparent.png)\\n### Advice On Demand\\nFrom investment recommendations to tax saving strategies, stay on track with guidance from our licensed financial advisors.\\n![](https://cdn.titanvest.com/images/marketing/gaia/home/overview/phone-3.png)\\n![](https://cdn.titanvest.com/images/marketing/gaia/home/overview/phone-frame-transparent.png)\\n### Perks Beyond Wealth\\nWith wealth comes privilege. Our Concierge gets you access to the best in dining and events in major cities. We go the extra mile for our clients.\\n![](https://cdn.titanvest.com/images/marketing/gaia/home/overview/phone-1.png)\\n![](https://cdn.titanvest.com/images/marketing/gaia/home/overview/phone-2.png)\\n![](https://cdn.titanvest.com/images/marketing/gaia/home/overview/phone-3.png)\\n![](https://cdn.titanvest.com/images/marketing/gaia/home/overview/phone-frame-transparent.png)\\nLike a CIO in Your Pocket\\n## Straight Talk About Your Money\\n![](https://cdn.titanvest.com/images/marketing/gaia/home/road-signs.jpg)\\nLevel Up From DIY Investing\\nTitan clients have historically compounded their wealth at 10.72% per year on average. Studies show that the average DIY investor underperforms advisors and the broader market by ~3% per year.\\nPhone Number\\nGet Started\\nTitan\\'s performance figure represents the annualized return since 2/20/2018, when Titan launched, and is a composite of the median aggregate performance of all client accounts and portfolio allocations as of 12/31/2024, net of fees. View additional disclosures\\nTestimonials\\n## Hear From Our Clients\\nView Testimonials⟨2⟩\\nWhat\\'s included\\n## Your Complete Wealth Team, at 0.2% Advisory Fee Per Year\\n(Traditional advisors typically charge 1-1.8% for less)\\n### Core Investment Strategies\\nAutomated index investing that tracks global markets - the foundation of a diversified portfolio. Simple, efficient, effective.\\n### Active Management\\nOur investment team\\'s conviction-driven ideas, actively managed in pursuit of long-term growth. We research, pick, and manage positions for you.\\n### Smart Treasury\\nYour cash should work as hard as you do. We automatically move it to our highest available after-tax yield for you.\\n### Alternative Assets\\nAccess to alternative investments, including options traditionally reserved for the ultra-wealthy: venture capital, private credit, real estate, and crypto. Managed by notable Wall Street firms, now available to you.\\nHelp on demand\\n## Get Guidance From Professional Advisors\\nBook one-on-one sessions and group calls with our financial advisors.\\n![Advisor⟨6⟩]\\nJack · Licensed Advisor\\n![Advisor⟨7⟩]\\nClay · Chief Investment Officer\\n![Advisor⟨8⟩]\\nSofia · Licensed Advisor\\n![Advisor⟨9⟩]\\nJohn · Investment Analyst\\nOur advisors and analysts come from experience:\\n![Goldman Sachs logo⟨10⟩]![JP Morgan Chase logo⟨11⟩]![Blackstone logo⟨12⟩]![Farallon logo⟨13⟩]![Cerberus logo⟨14⟩]\\n## Beyond Just Investment Management—Taxes, Too.\\nGet expert tax filing (valued at up to ~$300⟨15⟩), exclusive market insights through Titan Talks, and VIP hospitality access in major US cities.\\nTitan clients include high-earning professionals from some of the most iconic companies and institutions in the US.\\nCompare for yourself\\n## The 50th Floor Experience, In The Palm Of Your Hand\\nFeatures\\nStock Trading Apps\\ne.g. Robinhood\\nPrivate Wealth Managers\\ne.g. UBS, Goldman Sachs\\nInvestment Options\\nCash Management Strategies\\nTax optimized money market funds\\nAlpha Oriented Equity Strategies\\nLong only, actively managed\\nAutomated Index Investing\\nLow-cost, tax-advantaged passive investment strategies\\nAlternative Investments \\nVenture Capital, Real Estate, Credit, Crypto\\nBuy & Sell individual stocks and ETFs\\nAn investment \\'sidecar\\'\\nAdvisory Services\\nBespoke Asset Allocation\\nTailored portfolio construction\\nOngoing Investment Advice\\nContinuous financial expertise to navigate market shifts\\nPersonalized Financial Advisory\\nCustom-built and regularly fine-tuned\\nExclusive Benefits\\nComplimentary Tax Filing\\nHassle-free tax preparation with expert review\\nOn Demand Concierge Service\\nSMS an in-house Concierge Team\\nCurated Events & Experiences\\nBox suite tickets, courtside sports, speaker events\\nThe comparison above is for informational purposes only. Features listed for other platforms or services are not exhaustive, may vary, and are subject to change.\\nMake Managing Your Wealth Our Job.\\nWe\\'re ready when you are.\\nPhone Number\\nGet Started\\n## Frequently Asked Questions\\nHow is Titan different?\\nThink of us as the natural next step when you’ve outgrown “Do It Yourself” trading and want something more sophisticated than a basic robo-advisor.\\nWith trading apps, you’re on your own buying and selling stocks. With robo-advisors, you get a cookie-cutter ETF portfolio that never changes. Neither is ideal if you are serious about trying to grow your wealth.\\nWe’re building what comes next. Titan actively manages your money with a team of real investment professionals at your disposal, all focused on one goal: making you more money while saving you more time. Plus, you get premium benefits you’ll actually use, like free tax filing and direct access to our investment team.\\nWhy shouldn’t I just use the S&P 500?\\nWe’re big fans of the S&P 500. It’s a well-rounded index of equities that has historically performed very well over a long period of time relative to other investment options. But it shouldn’t be 100% of most people’s portfolios at all times. Wealth should be personalized.\\nWe take your personal situation into account and build you a portfolio that goes beyond just large US stocks. We mix passive and active strategies across different asset classes, and we’re tactical about when and how to invest – especially important when the S&P 500 is hitting all-time highs.\\nBottom line: The S&P 500 is a great tool, but it’s just one tool. Your wealth needs a full toolbox, and that’s what we provide.\\nHow is Titan choosing investment options for me?\\nWe get it – finance is full of jargon, endless options, and a lot of noise. Our approach is different. We’re incredibly picky about what makes it into your portfolio because our mission is simple: growing your wealth as efficiently as possible.\\nWe maintain a small but powerful suite of investment tools, carefully chosen by our investment team. No bloated menus of random options – just high-quality investment options at the lowest possible prices. Think of us as your investment filter, cutting through the Wall Street noise to identify what actually works.\\nOur analysts conduct deep research on every investment we offer, asking one simple question: How can this help grow your hard-earned money quicker and more efficiently? That’s it.\\nHow often should I expect to chat with an advisor?\\nThink of us as your personal advisor team that’s always just a tap away. You’re in control of how much support you want. Major life changes on the horizon? Let’s talk them through. Just want a quick portfolio review? We can do that too.\\nSome of our clients love having quarterly check-ins to stay on top of their financial goals and make sure everything’s tracking right. Others might only reach out once or twice a year when they’re facing big life decisions or want to revisit their strategy. Both approaches are perfectly fine – we’re here when you need us.\\nHow much does Titan membership cost?\\nOur membership is straightforward: $25/month (or $250/year if you choose annual billing). This isn’t just another fee – it’s your investment in having a team of professionals actively manage your wealth.\\nTitan clients have historically compounded their wealth at 11.6% per year on average. Studies show that the average DIY investor underperforms advisors and the broader market by ~3% per year. (Disclosure)\\nFor our average client making $75/hour, we save them over $10,000 worth of time annually – time they’d otherwise spend managing their own portfolio (most DIY investors spend 3-5 hours weekly on this).\\nPlus, we’re about 50% cheaper than traditional private wealth managers. If you’ve invested at least $6,000 in our Smart Treasury product, the earnings from our industry-leading yield can offset your membership fee. Bottom line: if we save you just 20 minutes a month (which we consistently do), the fee has already paid for itself.\\nMore info on pricing here⟨16⟩.\\nHow do I know Titan is the right wealth manager for me?\\nSimple: If you’ve graduated from DIY trading apps and want your wealth managed by professionals who actually explain what they’re doing, we’re your team. We’re built for people who value their time and want their money working harder for them.\\nThink of us as your personal chief financial officer, right in your pocket. We take the complex world of wealth management and make it straightforward, active, and tailored to you. No more juggling multiple apps or trying to piece together your own investment strategy – we handle everything in one place, with one clear goal: make you more money while saving you more time.\\nWhy do Titan clients choose us?\\nWe’re not your typical wealth manager. We’re building what we wanted but couldn’t find – a wealth manager that combines institutional-grade investing with modern technology and real human expertise, but without the high fees and minimums usually required by other firms. You get our proprietary investment strategies (like our Flagship equity portfolio), smart cash management solutions, and on-demand access to real financial advisors who know their stuff.\\nBut it’s more than just managing money. We’re giving you back your time and peace of mind, plus adding perks you’ll actually use – like free tax filing and access to investment opportunities typically reserved for the ultra-wealthy. We’re not just managing your wealth; we’re helping you build and enjoy it.\\nHow secure is my money with Titan?\\nLet us be crystal clear about this: Your security is our absolute priority. As an SEC-registered investment adviser, Titan is legally required to act in your best interest as a fiduciary.\\nSIPC protects investors against the loss of cash and securities⟨17⟩ in the event of a SIPC-member brokerage firm failure. The limit of SIPC coverage is $500,000, which includes a $250,000 limit for cash. SIPC coverage is limited and does not protect against the decline in value of your securities. For more details, visit www.sipc.org.⟨18⟩\\nPlus, we use a third-party custodian to hold client assets separately. Most importantly, you own all your underlying assets in a separately managed account - we don\\'t hold your assets directly. We employ industry-leading encryption and cybersecurity measures to protect your data, from encryption to SAML protection, because we know we\\'re handling your hard-earned money. That\\'s a responsibility we take incredibly seriously.\\nProduct\\nSmart Treasury⟨19⟩Wealth⟨1⟩Performance⟨20⟩Log in⟨21⟩\\nTitan\\nTestimonials⟨2⟩About⟨3⟩Careers⟨22⟩\\nMore\\nLegal⟨23⟩Privacy⟨24⟩Terms⟨25⟩Help⟨26⟩\\n© 2025 Titan Global Capital Management USA LLC. All Rights Reserved.\\nInstagram⟨27⟩Twitter⟨28⟩Youtube⟨29⟩LinkedIn⟨30⟩\\nAdvisory services are provided by Titan Global Capital Management USA LLC (\"Titan\"), an investment adviser registered with the Securities and Exchange Commission (“SEC”). By using this website, you accept and agree to Titan’s _Terms of Use_⟨31⟩ and _Privacy Policy_⟨32⟩. Titan’s investment advisory services are available only to residents of the United States in jurisdictions where Titan is registered. Nothing on this website should be considered an offer, solicitation of an offer, or advice to buy or sell securities or investment products. Past performance is no guarantee of future results. Any historical returns, expected returns, or probability projections are purely hypothetical in nature and may not reflect actual or potential future performance; nor do they represent actual performance outcomes of a client. Please see Titan’s Interactive Performance Tool available at _www.titan.com/historical-performance_⟨33⟩ for important information and disclosures. Strategy holdings and other information provided are for illustrative purposes only and are not to be considered investment recommendations. The content on this website is for informational purposes only and does not constitute a comprehensive description of Titan’s investment advisory services. Any visuals of the in-app experience are for illustrative purposes only.\\nPlease refer to Titan\\'s _Program Brochure_⟨34⟩ for important additional information. Certain investments are not suitable for all investors. Before investing, you should consider your investment objectives and any fees charged by Titan. The rate of return on investments can vary widely over time, especially for long term investments. Investment losses are possible, including the potential loss of all amounts invested, including principal. Brokerage services are provided to Titan Clients by Titan Global Technologies LLC and Apex Clearing Corporation, both registered broker-dealers and members of _FINRA_⟨35⟩/_SIPC_⟨18⟩. For more information, visit our _disclosures_⟨36⟩ page. You may check the background of these firms by visiting _FINRA\\'s BrokerCheck_⟨37⟩.\\nVarious Registered Investment Company products (“Third Party Funds”) offered by third party fund families and investment companies are made available on the platform. Before investing in such Third Party Funds you should consult the specific supplemental information available for each product. Please refer to Titan\\'s _Program Brochure_⟨34⟩ for important additional information. Certain Third Party Funds that are available on Titan’s platform are interval funds. Investments in interval funds are highly speculative and subject to a lack of liquidity that is generally available in other types of investments. Actual investment return and principal value is likely to fluctuate and may depreciate in value when redeemed. Liquidity and distributions are not guaranteed, and are subject to availability at the discretion of the Third Party Fund.\\nThe cash sweep program is made available in coordination with Apex Clearing Corporation through Titan Global Technologies LLC. Please visit _www.titan.com/legal_⟨38⟩ for applicable _terms and conditions_⟨39⟩ and important disclosures.\\n**Investments with exposure to crypto assets are only suitable for investors who are willing to bear the risk of loss and experience sharp drawdowns, as they still carry inherent risk associated with cryptocurrencies.** You are solely responsible for evaluating the merits and risks associated with the use of any information, materials, content, user content, or third party content provided before making any decisions based on such content. All investments carry risk, including the potential loss of principal. Investment growth is not guaranteed.\\nTitan’s concierge services are available exclusively to Titan clients, subject to availability and location, and are not guaranteed. Certain perks are subject to eligibility. Terms and conditions apply. Tax filing services via Titan Tax are offered by Column Tax. Titan does not provide tax advice, and Column Tax is not an affiliate of Titan. Terms apply, and details are available in Column Tax’s _Terms of Use_⟨40⟩.\\nAny logos or mentions of other companies are for informational purposes only and do not imply affiliation or endorsement of Titan by these companies.\\nInformation provided by Titan Support is for informational and general educational purposes only and is not investment or financial advice.\\nContact Titan at _support@titan.com_. 508 LaGuardia Place NY, NY 10012.\\nDisclosure: (1) Assets Under Management (“AUM”) is as of 12/15/2024. (2) App download numbers are estimates based on anonymous user IDs from both Android and Apple iOS platforms, and may include multiple instances of counting due to changes in IDs over time. Data is as of 10/10/2024, since 2021. This number does not represent Titan’s client count. (3) Apple App Store Rating is 4.6/5 stars as of 02/12/2025, based on 6.9K ratings; it reflects user feedback and may not represent all experiences.\\nBest Financial Advisory Firms 2023, USA Today: The ranking of the best registered investment advisory firms (“RIA Firms”) was compiled by USA Today and Statista, is based on two dimensions: recommendations by clients and peers and a firm’s growth of Assets under Management (AUM). The recommendations were collected via an independent survey sent to over 20,000 individuals. While clients were able to evaluate and recommend their RIA firm, financial advisors working for an RIA firm were asked to consider a scenario where their own firm could not take on a client and had to recommend another RIA firm they appreciate. The development of AUM was analyzed both, short and long term based on publicly available data. For the short term view, the growth of AUM over a twelve months period was calculated, from January 2022 to January 2023. For the long term view, the growth of AUM over a five year period was calculated, from 2018 to 2023. In the consideration for the top 500 RIA firms, recommendations had a weight of 20% while development of AUM had a weight of 80% (short term and long term growth were equally weighted) to derive the final score.\\nTop Private Y Combinator Companies, Y Combinator (2023): Inclusion in the 2023 \\'Top Private Y Combinator Companies\\' list is based on the company\\'s valuation from its latest funding round, and all companies on the list are valued at over $150M.\\nTitan participated in the Y Combinator funding cycle in 2018. Y Combinator runs two three-month funding cycles a year, during which selected entrepreneurial teams are given a seed investment in exchange for a small equity stake in the company. The teams move to Silicon Valley for the duration of the cycle, during which they receive intensive mentoring and assistance in refining their business plans, developing their products, and pitching to investors. The cycle culminates in a Demo Day, during which each startup presents a quick pitch to a carefully selected, invite-only audience of investors.\\nBest Wealth Management Solution, Finovate (2022): The \\'Best Wealth Management Solution\\' award is given to a wealth management firm, bank or FI with an excellent new solution to give consumers more control over their future wealth and help them meet long-term financial goals.\\nFastest Growing Retail Investment Brand, Global Brands Magazine (2021): Titan\\'s recognition as the 2021 Fastest Growing Retail Investment Brand by Global Brands Magazine is based on an evaluation process involving a nominations team, an internal research team, and an independent external research agency. Companies are proactively invited to participate, and all nominations are validated and researched for adequate data. The external research agency then scrutinizes the nominations based on various criteria and publicly available data. Final award winners are decided by the internal team based on fundamental objectives and announced on the Global Brands Magazine website.\\nThese recognitions do not evaluate client satisfaction or predict future investment performance. They should not be construed as an endorsement of Titan by any client. Rankings and recognitions should not be construed by a client or prospective client as a guarantee that they will experience a certain level of results if Titan is engaged, or continues to be engaged, to provide investment advisory services. Nor should they be construed as a current or past endorsement of Titan.\\nDisclosure: Titan\\'s performance figure represents the annualized return since 2/20/2018, when Titan launched, and is a composite of the median aggregate performance of all client accounts and portfolio allocations as of 12/31/2024. This includes all strategies and third-party funds added over time, with performance figures accounting for the reinvestment of dividends and net of advisory and membership fees (where applicable). The 5-year annualized return is 12.38% (1/01/2020 – 12/31/2024), and the 1-year cumulative return is 21.1% (1/01/2024 – 12/31/2024). Past performance is not indicative of future results. All investments carry risk, including the potential loss of principal, and investment growth is not guaranteed. Vanguard attributes the ~3% added by financial advisors primarily to strategic planning and behavioral coaching. Additionally, DALBAR\\'s annual Quantitative Analysis of Investor Behavior report⟨41⟩ indicates that, over a 30-year period ending December 31, 2022, self-directed investors often underperform by ~3% annually due to behavioral biases and poor decision-making.\\nIn addition to the annual advisory fee, a Membership Fee of $25 per month (or $250 annually if paid in advance) applies. This fee covers platform access, investment offerings, tools, and services included in your wealth management experience.\\nDisclosure: Titan’s performance figure represents the annualized return since 2/20/2018, when Titan launched, and is a composite of the median aggregate performance of all client accounts and portfolio allocations as of 12/9/2024. This includes all strategies and third-party funds added over time, with performance figures accounting for the reinvestment of dividends and net of advisory and membership fees (where applicable). The 5-year annualized return is 13.69%, and the 1-year cumulative return is 28% (12/15/2023 – 12/15/2024). Past performance is not indicative of future results. All investments carry risk, including the potential loss of principal, and investment growth is not guaranteed. Vanguard attributes the ~3% added by financial advisors primarily to strategic planning and behavioral coaching. Additionally, DALBAR\\'s annual Quantitative Analysis of Investor Behavior report indicates that, over a 30-year period ending 12/31/2022, self-directed investors often underperform by ~3% annually due to behavioral biases and poor decision-making.\\n![](https://bat.bing.com/action/0?ti=56348962&tm=gtm002&Ver=2&mid=ba6a6a06-dfe5-44d6-b097-39d005e1d755&bo=1&sid=cfb4d030eedb11ef938dc3ebbd078c6a&vid=cfb62370eedb11efbabcc385bd3523f6&vids=1&msclkid=N&pi=918639831&lg=en-US&sw=1080&sh=600&sc=24&tl=Titan%20-%20Your%20Investment%20Team&p=https%3A%2F%2Fwww.titan.com%2F&r=&lt=2658&evt=pageLoad&sv=1&cdb=AQAQ&rn=811933)\\n![dot image pixel⟨42⟩]\\n' references_markdown=\"\\n\\n## References\\n\\n⟨1⟩ http://www.titan.com/</wealth>: Wealth\\n⟨2⟩ http://www.titan.com/</testimonials>: Testimonials\\n⟨3⟩ http://www.titan.com/</about>: About\\n⟨4⟩ http://www.titan.com/</#faqs>: FAQs\\n⟨5⟩ http://www.titan.com/</join-now>: Join Now\\n⟨6⟩ https://cdn.titanvest.com/images/marketing/gaia/home/advisory/avatars/advisor-1.jpg: Advisor\\n⟨7⟩ https://cdn.titanvest.com/images/marketing/gaia/home/advisory/avatars/advisor-2.jpg: Advisor\\n⟨8⟩ https://cdn.titanvest.com/images/marketing/gaia/home/advisory/avatars/advisor-3.jpg: Advisor\\n⟨9⟩ https://cdn.titanvest.com/images/marketing/gaia/home/advisory/avatars/advisor-4.jpg: Advisor\\n⟨10⟩ https://cdn.titanvest.com/images/marketing/gaia/home/advisory/logos/goldman.png: Goldman Sachs logo\\n⟨11⟩ https://cdn.titanvest.com/images/marketing/gaia/home/advisory/logos/jp-morgan.png: JP Morgan Chase logo\\n⟨12⟩ https://cdn.titanvest.com/images/marketing/gaia/home/advisory/logos/blackstone.png: Blackstone logo\\n⟨13⟩ https://cdn.titanvest.com/images/marketing/gaia/home/advisory/logos/farallon.png: Farallon logo\\n⟨14⟩ https://cdn.titanvest.com/images/marketing/gaia/home/advisory/logos/cerberus.png: Cerberus logo\\n⟨15⟩ http://www.titan.com/<https:/www.investopedia.com/articles/taxes/021717/what-will-i-pay-tax-preparation-fees.asp>: $300\\n⟨16⟩ http://www.titan.com/<https:/help.titan.com/en_us/titan-s-fees-B1lNrytB9>: here\\n⟨17⟩ http://www.titan.com/<https:/www.sipc.org/for-investors/what-sipc-protects#cash>: cash and securities\\n⟨18⟩ http://www.titan.com/<https:/www.sipc.org/>: www.sipc.org.\\n⟨19⟩ http://www.titan.com/</smart-treasury>: Smart Treasury\\n⟨20⟩ http://www.titan.com/</historical-performance>: Performance\\n⟨21⟩ http://www.titan.com/</login>: Log in\\n⟨22⟩ http://www.titan.com/</careers>: Careers\\n⟨23⟩ http://www.titan.com/</legal>: Legal\\n⟨24⟩ http://www.titan.com/</privacy-policy>: Privacy\\n⟨25⟩ http://www.titan.com/<https:/cdn.titanvest.com/disclosures/titan-terms-of-use.pdf>: Terms\\n⟨26⟩ http://www.titan.com/<https:/help.titan.com/>: Help\\n⟨27⟩ http://www.titan.com/<https:/www.instagram.com/titanvest/>: Instagram\\n⟨28⟩ http://www.titan.com/<https:/twitter.com/titanvest>: Twitter\\n⟨29⟩ http://www.titan.com/<https:/www.youtube.com/c/Titanvest>: Youtube\\n⟨30⟩ http://www.titan.com/<https:/www.linkedin.com/company/titan-invest/>: LinkedIn\\n⟨31⟩ http://www.titan.com/<https:/www.titan.com/terms>: _Terms of Use_\\n⟨32⟩ http://www.titan.com/<https:/www.titan.com/privacypolicy>: _Privacy Policy_\\n⟨33⟩ http://www.titan.com/<http:/www.titan.com/historical-performance>: _www.titan.com/historical-performance_\\n⟨34⟩ http://www.titan.com/<https:/cdn.titanvest.com/disclosures/TitanInvest_FormADV_Part2A_Wrap_Brochure.pdf>: _Program Brochure_\\n⟨35⟩ http://www.titan.com/<https:/www.finra.org/>: _FINRA_\\n⟨36⟩ http://www.titan.com/<https:/www.titan.com/disclosures>: _disclosures_\\n⟨37⟩ http://www.titan.com/<https:/brokercheck.finra.org/>: _FINRA's BrokerCheck_\\n⟨38⟩ http://www.titan.com/<https:/www.titan.com/legal>: _www.titan.com/legal_\\n⟨39⟩ http://www.titan.com/<https:/cdn.titanvest.com/disclosures/Titan+Cash+Sweep+Program+Terms+and+Conditions.pdf>: _terms and conditions_\\n⟨40⟩ http://www.titan.com/<https:/www.columntax.com/terms-of-use>: _Terms of Use_\\n⟨41⟩ http://www.titan.com/<https:/atlasfinancialinc.com/wp-content/uploads/2023/06/DALBAR-2023-QAIB.pdf>: DALBAR's annual Quantitative Analysis of Investor Behavior report\\n⟨42⟩ https://sp.analytics.yahoo.com/sp.pl?a=10000&d=Wed%2C%2019%20Feb%202025%2016%3A08%3A52%20GMT&n=-5&b=Titan%20-%20Your%20Investment%20Team&.yp=10150054&f=https%3A%2F%2Fwww.titan.com%2F&enc=UTF-8&yv=1.16.6&tagmgr=gtm: dot image pixel\\n\" fit_markdown='' fit_html=''",
  "generated_description": "**Titan: Your Modern Wealth Management Partner**\n\nFounded in 2018 and hailing from Y Combinator's S18 batch, Titan is a forward-thinking wealth management company based in New York City. With a team of around 50 dedicated professionals, Titan has already made a significant mark in the fintech space, managing over $1 billion in assets and boasting more than 500,000 downloads of its app with a solid 4.6-star rating.\n\n### **The Mission: Managing Wealth for All**\n\nAt its core, Titan embodies a simple yet powerful objective: **\"We manage people's wealth.\"** It seeks to bridge the gap between expensive traditional advisors and the DIY investing options that often leave people lost. Titan offers a unique solution by leveraging large language models (LLMs) to provide personalized wealth management—easier, faster, and more cost-effective than ever before.\n\n### **What Makes Titan Different?**\n\nTitan is positioned as a middle ground between do-it-yourself investing and high-fee wealth management. Unlike traditional models that can charge anywhere from 1% to 1.8% per annum, Titan offers their comprehensive services at just a **0.2% advisory fee** per year. This makes professional wealth management accessible to a broader audience.\n\nTheir main offerings include:\n- **Active Management**: Customized portfolios made from a curated selection of investment strategies across various asset classes, including stocks, ETFs, and treasuries.\n- **Personalized Guidance**: Direct access to licensed financial advisors for tailored advice, including investment strategies and tax optimization.\n- **Exclusive Perks**: Additional benefits like complimentary tax filing and access to concierge services for unique experiences in major cities.\n\n### **Historical Performance**\n\nTitan's approach has existed since its inception and has shown promising results: their clients have historically compounded their wealth at about **11.6% annually**, outperforming everyday DIY investors by approximately **3%** per year. \n\n### **Affordability Meets Excellence**\n\nTitan is about making wealth management efficient and effective without draining your resources. Priced at **$25 per month** (or $250 annually), this affordable fee includes not just management services but also tools and insights required for informed investing.\n\n### **Why Choose Titan?**\n\nIf you’ve moved beyond basic trading apps and find managing investments a tedious chore, Titan offers a smart alternative. They combine cutting-edge technology with a human touch, making financial management straightforward and accessible. \n\nWith accolades like \"Top 10 Investment Firms\" by Financial Services Review in 2024 and \"Best Financial Advisory Firms\" recognition from USA Today in 2023, Titan is not just another financial service; it’s a platform aimed at enriching your financial journey with simplicity and expertise. \n\nFor more information, visit [titan.com](http://www.titan.com)."
}