{
  "links": "https://www.ycombinator.com/companies/top-road",
  "name": "Top Road",
  "headline": "Payments & analytics for apps in the OpenAI GPT Store",
  "batch": "W22",
  "description": "Our no code tools enable developers to monetise their apps in the OpenAI GPT Store with in-chat payments, affiliate links and user analytics.",
  "activity_status": "Active",
  "website": "https://toproad.ai",
  "founded_date": 2024.0,
  "team_size": 2.0,
  "location": "Sydney, Australia",
  "group_partner": null,
  "group_partner_yc": null,
  "company_linkedin": null,
  "company_twitter": null,
  "tags": "industry:artificial-intelligence; industry:fintech; industry:generative-ai; industry:payments; industry:analytics",
  "founders": [
    {
      "name": "Jeevika Makani, Co-Founder",
      "description": "Jeevika is the co-founder & CEO of Top Road. Prior to being a founder, she worked at various early stage tech startups including Fat Llama (P2P rental marketplace, YC S17) and Lendable (emerging markets fintech). Jeevika studied economics at the University of Melbourne, and has an INSEAD MBA.",
      "linkedin": "https://www.linkedin.com/in/jeevikamakani/"
    },
    {
      "name": "Celilsemi Sam Erkiner, Founder",
      "description": "I'm a software engineer, full stack but heavy on the front. I love cross-platform solutions, so JS is my fav. Usually Node on the backend, Angular on the frontend. I've worked on 50+ web/mobile/smartwatch apps. I have some open source contributions, mostly on Ionic. If you need help designing a web/hybrid application architecture, ping me! If I'm being slow to respond, I'm busy trying to exploring AI to automate things.",
      "linkedin": "https://www.linkedin.com/in/cerkiner"
    }
  ],
  "status": true,
  "markdown": "raw_markdown='CUSTOM APPS \\nBacked By \\nGPT Builder Tools \\nartificial intelligence tools & applications \\nTOP ROAD \\nre-mint pty ltd trading as Top Road ABN 58 650 578 715 \\nA\\n' markdown_with_citations='CUSTOM APPS \\nBacked By \\nGPT Builder Tools \\nartificial intelligence tools & applications \\nTOP ROAD \\nre-mint pty ltd trading as Top Road ABN 58 650 578 715 \\nA\\n' references_markdown='\\n\\n## References\\n\\n' fit_markdown='' fit_html=''",
  "generated_description": "### Top Road: Simplifying Payments and Analytics for the GPT Store\n\n**Overview:**\nFounded in 2024 and based in Sydney, Australia, Top Road is a burgeoning startup that’s part of the prestigious Y Combinator Batch W22. With a lean team of just two, the company is focused on providing innovative payment and analytics solutions specifically for apps hosted in the OpenAI GPT Store.\n\n**Mission:**\nTop Road's mission revolves around enhancing the experience for developers by allowing them to monetize their apps effectively. They achieve this with their no-code tools which enable in-chat payments, the integration of affiliate links, and robust user analytics — all crucial elements for app developers looking to maximize revenue.\n\n**What They Do:**\nTop Road capitalizes on the growing intersection of artificial intelligence and fintech by offering custom apps built on the cutting-edge GPT Builder Tools. Their offerings are not just limited to payments; they encompass a wide array of analytics features that help developers understand user behavior and optimize engagement. This is crucial in today's app ecosystem where data-driven decisions can make or break your product.\n\n**Key Points:**\n- **Founded:** 2024\n- **Location:** Sydney, Australia\n- **Team Size:** 2 employees\n- **Key Partner:** Nan\n- **Website:** [toproad.ai](https://toproad.ai)\n- **Tags:** artificial-intelligence, fintech, generative-ai, payments, analytics\n\nIn summary, Top Road is strategically positioned at the forefront of AI innovation, simplifying how app developers interact with their users financially while also providing them with necessary insights to drive growth. As they continue to expand their capabilities, they’re set to become an essential player in the app monetization landscape."
}