{
  "links": "https://www.ycombinator.com/companies/tradex",
  "name": "TradeX",
  "headline": "Exchange to trade on outcome of events.",
  "batch": "W22",
  "description": "TradeX is an exchange to trade on the outcome of events that affect your everyday life. We are the world’s most simplified derivative exchange, where you can trade on yes or no (whether an event will happen). \r\n\nTradeX allows people to trade on what matters to them. Examples: Climate change, transportation, currencies, GDP, omicron cases, inflation rate, movie launch, next president & much more.\r\n\nOur USP: Allowing people to trade on what they know rather than studying company financials or worrying about market conditions. We are making opinions investable.\r\n\nOur MOTO: What do you do with your opinion? Believe in it.",
  "activity_status": "Active",
  "website": "http://tradexapp.co/",
  "founded_date": 2021.0,
  "team_size": 31.0,
  "location": "Gurugram, India",
  "group_partner": "Aaron Epstein",
  "group_partner_yc": "https://www.ycombinator.com/people/aaron-epstein",
  "company_linkedin": null,
  "company_twitter": null,
  "tags": "industry:fintech; industry:consumer; industry:gaming",
  "founders": [
    {
      "name": "Divij Goyal, Founder",
      "description": "Engineer, Poker player, Trader, Learner, Product Geek. An avid user of product hunt. Technologist by heart. Started career as a software developer. Wore different hats over time from being a  Trader in S&P500 to Product Lead for a NBCF.\n\nFormer Founder at CityMall, A half a billion dollar social commerce in India. Took early exit. Make some money and started TradeX",
      "linkedin": "https://www.linkedin.com/in/divijgoyal"
    },
    {
      "name": "Indrajeet Roy, Founder",
      "description": "An Industrial Engineer graduate from IIT Delhi,  Founder- Hoi Foods- India's 5th largest cloud kitchen company. Build and Sold Employability Assessment Platform Skillwill in 2016. An avid Crypto trader and first principle business thinker",
      "linkedin": "https://in.linkedin.com/in/indrajeetroy"
    },
    {
      "name": "Ankit Shrivastava, Founder",
      "description": "10+ years of experience in technology. I have worked with PwC, JPMC and developed a couple of Apps and Games as hobby projects which are live on PlayStore. A part time trader in Indian stock market and love to do sketching, play guitar and photography as hobbies.",
      "linkedin": "https://www.linkedin.com/in/ankit-shrivastava-682b4515"
    }
  ],
  "status": true,
  "markdown": "raw_markdown='![](http://tradexapp.co/static/media/logoname.9b64498c19bbba554a13.webp)\\nMarkets\\nPortfolio\\nWallet\\nActivity\\nRegister\\n![](http://tradexapp.co/static/media/ycFooter.2f0ce85145c6b4c66df8.webp)\\n![](http://tradexapp.co/static/media/ficciFooter.8dadca507d5e0a468d88.webp)\\nProduct\\nHow It Works\\nTradeX API\\nSupport\\nHelp Center\\nRaise a request\\nJoin TG Community\\nDocuments\\nPrivacy Policy\\nTerms and Conditions\\nCancellation and Refund Policy\\nAccount Reactivation\\nReport Fraud\\nGrievance Retrieval\\nGet the app\\n![](http://tradexapp.co/static/media/iosFooter.b6177bc8684e85db51b5.webp)\\n![](http://tradexapp.co/static/media/androidFooter.8b5b4de2beb1bcf35f8a.webp)\\n2024 © TradeX Software India Private Limited\\n![](http://tradexapp.co/static/media/instaFooter.e64dafdddd3040420fc3.webp)\\n![](http://tradexapp.co/static/media/xFooter.d61a1ebc6e534cbf38ee.webp)\\n![](http://tradexapp.co/static/media/youtubeFooter.06c3122af17d7ef67568.webp)\\n' markdown_with_citations='![](http://tradexapp.co/static/media/logoname.9b64498c19bbba554a13.webp)\\nMarkets\\nPortfolio\\nWallet\\nActivity\\nRegister\\n![](http://tradexapp.co/static/media/ycFooter.2f0ce85145c6b4c66df8.webp)\\n![](http://tradexapp.co/static/media/ficciFooter.8dadca507d5e0a468d88.webp)\\nProduct\\nHow It Works\\nTradeX API\\nSupport\\nHelp Center\\nRaise a request\\nJoin TG Community\\nDocuments\\nPrivacy Policy\\nTerms and Conditions\\nCancellation and Refund Policy\\nAccount Reactivation\\nReport Fraud\\nGrievance Retrieval\\nGet the app\\n![](http://tradexapp.co/static/media/iosFooter.b6177bc8684e85db51b5.webp)\\n![](http://tradexapp.co/static/media/androidFooter.8b5b4de2beb1bcf35f8a.webp)\\n2024 © TradeX Software India Private Limited\\n![](http://tradexapp.co/static/media/instaFooter.e64dafdddd3040420fc3.webp)\\n![](http://tradexapp.co/static/media/xFooter.d61a1ebc6e534cbf38ee.webp)\\n![](http://tradexapp.co/static/media/youtubeFooter.06c3122af17d7ef67568.webp)\\n' references_markdown='\\n\\n## References\\n\\n' fit_markdown='' fit_html=''",
  "generated_description": "### TradeX: Simplifying Event-Based Trading\n\n**Overview**  \nTradeX, founded in 2021 and part of Y Combinator's W22 batch, is located in Gurugram, India. With a team of 31 dedicated employees, it's on a mission to transform ordinary opinions into tradeable assets. The platform acts as a derivative exchange where individuals can bet on the occurrence of events that shape daily life—whether it's about climate change, movie releases, or economic indicators like inflation rates and GDP.\n\n**Mission and Unique Selling Proposition (USP)**  \nThe core mission of TradeX is to allow users to trade on the outcomes of significant events, simplifying the investment experience. Unlike traditional markets, which often require a deep understanding of financial statements and market conditions, TradeX empowers users to capitalize on their knowledge and opinions. Their slogan, \"What do you do with your opinion? Believe in it,\" captures this ethos perfectly.\n\n**How TradeX Works**  \nEssentially, TradeX allows participants to trade on binary outcomes—yes or no. This straightforward approach makes the platform accessible to everyone, whether you're an expert or just someone with a strong sense of what's going to happen in a given context. \n\n**Product Features**  \nThe platform boasts a variety of features, including markets for trading, a personal portfolio, and a user-friendly wallet system. Users can access help centers, community groups, and TradeX’s API for integration. The app is available on both iOS and Android, catering to modern, mobile-first users.\n\n**Conclusion**  \nTradeX is not just another financial tool; it's a new way to engage with the world around us. By democratizing opinion-based trading, it makes individual insights valuable—turning everyday thoughts into potential profits. If you're interested in exploring this innovative platform, check them out at [TradeX](http://tradexapp.co/). \n\nIn a nutshell, TradeX is bridging the gap between knowing and investing. It's about time your opinions mattered."
}