{
  "links": "https://www.ycombinator.com/companies/unschool",
  "name": "Unschool",
  "headline": "Learn, Intern and become Industry-Ready",
  "batch": "W21",
  "description": "Unschool provides real-world professional education that colleges in India do not provide. We are a marketplace where college students in India can learn about technology, management and arts from high-quality courses created by experts from around the world.",
  "activity_status": "Active",
  "website": "https://www.unschool.in/",
  "founded_date": 2019.0,
  "team_size": 35.0,
  "location": "Hyderabad, India",
  "group_partner": null,
  "group_partner_yc": null,
  "company_linkedin": null,
  "company_twitter": null,
  "tags": "industry:education; industry:elearning",
  "founders": [
    {
      "name": "Rahul Varma, Founder",
      "description": "Co-Founder and CEO at Unschool",
      "linkedin": "https://www.linkedin.com/in/rahul-varma-g/"
    },
    {
      "name": "Narayanan S, Founder",
      "description": "co-founder and Chief Business Officer",
      "linkedin": "https://www.linkedin.com/in/chalkmeout/"
    }
  ],
  "status": true,
  "markdown": "raw_markdown='\\n' markdown_with_citations='\\n' references_markdown='\\n\\n## References\\n\\n' fit_markdown='' fit_html=''",
  "generated_description": "**Company Overview: Unschool**\n\nFounded in 2019, Unschool is a pioneering venture in the realm of education based in Hyderabad, India. This Y Combinator Batch W21 startup identifies a crucial gap in the Indian educational landscape—providing real-world professional education that traditional colleges often overlook. \n\n**Mission and Vision**\n\nUnschool's mission can be summed up in three words: Learn, Intern, and Become Industry-Ready. They aim to equip college students with the practical knowledge and experience they need to thrive in today’s competitive job market. Their approach is straightforward: offer high-quality courses in technology, management, and arts, developed by global experts.\n\n**Marketplace for Learning**\n\nPositioned as a marketplace, Unschool empowers students by curating a variety of educational resources that bridges the gap between academia and the professional world. This model not only provides access to valuable skillsets but also fosters an environment where students can engage in internships, ensuring they gain practical experience alongside their learning.\n\n**Team and Growth**\n\nWith a dedicated team of 35 employees, the company thrives on collaboration and innovation. Their partnership with Nan as a Group Partner adds another layer of expertise and support, further enhancing their offerings in the education sector.\n\n**Industry Context**\n\nIn a world where traditional education often fails to keep pace with industry requirements, Unschool steps up as a solution for students seeking to be better equipped for their careers. By harnessing technology and a broad spectrum of knowledge, they embrace the e-learning paradigm that is transforming how education is delivered.\n\n**Conclusion**\n\nIn short, Unschool is not just about learning—it's about making learning actionable and relevant. For students in India, it's a refreshing alternative to conventional educational routes, intertwining academic learning with real-world applications. If you're keen on elevating your professional journey, Unschool is definitely worth checking out. Explore more at [Unschool's website](https://www.unschool.in/)."
}