{
    "links": "https://www.ycombinator.com/companies/vetcove",
    "name": "Vetcove",
    "headline": "Powering the animal health supply chain.",
    "batch": "S16",
    "description": "Vetcove is how veterinarians buy the supplies they need to keep America's pets healthy.  Our community of more than 18,000 veterinary hospitals employs tens of thousands of veterinarians and delivers care to many millions of animals every year across all 50 states.  As of 2022, we power purchasing and supply chain infrastructure for half of America's general practices, emergency and specialty clinics, SPCAs, zoos, aquariums, and veterinary consolidators.\r\n\nVetcove's eCommerce and mobile platforms afford veterinary hospitals a frictionless purchasing experience, and facilitate delivery of medications to pet parents across the country. Simply put, Vetcove helps veterinary organizations spend more time giving care, and less time comparing suppliers and managing inventory. We're completely revolutionizing the way veterinarians discover and buy products, and how animal health brands engage their veterinary customers.\r\n\nWe're hiring!  Come join us on our journey to transform how vets buy and prescribe the animal healthcare products that keep our pets in peak condition.",
    "activity_status": "Active",
    "website": "https://www.vetcove.com",
    "founded_date": 2015.0,
    "team_size": 83.0,
    "location": "Miami, FL",
    "group_partner": "Jared Friedman",
    "group_partner_yc": "https://www.ycombinator.com/people/jared-friedman",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:marketplace; industry:b2b; industry:healthcare; industry:e-commerce; industry:enterprise-software",
    "founders": [
        {
            "name": "Alex Kates, Founder/CEO",
            "description": null,
            "linkedin": "http://linkedin.com/in/alexkates"
        },
        {
            "name": "Mitchell Kates, Founder/Tech",
            "description": null,
            "linkedin": "https://www.linkedin.com/in/mitchkates"
        }
    ],
    "status": true,
    "markdown": "raw_markdown='[ ](https://www.vetcove.com/</home/>)\\n[ Product ](https://www.vetcove.com/</product/>)\\n[ How it Works ](https://www.vetcove.com/</product/>) [ Cash Back Deals ](https://www.vetcove.com/</deals/>) [ Hospital Groups ](https://www.vetcove.com/</hospital-groups/>)\\n[ Who\\'s Using ](https://www.vetcove.com/</customers/>) [ Why Free? ](https://www.vetcove.com/</why-is-it-free/>)\\n[ About ](https://www.vetcove.com/</about>)\\n[ About Vetcove ](https://www.vetcove.com/</about>) [ Support ](https://www.vetcove.com/<http:/help.vetcove.com/>) [ Cove Crew ](https://www.vetcove.com/</ambassadors/>) [ Careers ](https://www.vetcove.com/</careers>)\\n[ Login ](https://www.vetcove.com/</signin/>) [ Signup ](https://www.vetcove.com/</signup/>)\\n[ ](https://www.vetcove.com/</home/>)\\n[ How it Works ](https://www.vetcove.com/</product/>) [ Cash Back Deals ](https://www.vetcove.com/</deals/>) [ Who\\'s using Vetcove? ](https://www.vetcove.com/</customers/>) [ Why is it free? ](https://www.vetcove.com/</why-is-it-free/>) [ About Vetcove ](https://www.vetcove.com/</about/>) [ Cove Crew ](https://www.vetcove.com/</ambassadors/>) [ Support ](https://www.vetcove.com/<http:/help.vetcove.com>) [ Careers ](https://www.vetcove.com/</careers/>)\\n[Login](https://www.vetcove.com/</signin/>)\\n[Signup](https://www.vetcove.com/</signup/>)\\n[ New The AVMA and Vetcove have teamed up to launch AVMA Direct Connect ](https://www.vetcove.com/</avma/>)\\n#  Purchasing for your vet hospital? Shop every supplier at once. \\n##  Cut ordering time in half and save on supplies with the vendors you already use. Completely free to veterinary clinics & nonprofits. \\n[ Explore Features ](https://www.vetcove.com/</product/>) [ Get Started ](https://www.vetcove.com/</signup/>)\\n# Enrofloxacin Inj.\\n## 20ml (2.27%)\\nOut of Stock \\n-\\nOut of Stock \\n-\\nIn Stock \\n-\\nIn Stock \\n-\\n# Carprofen Caplets\\n## 75mg, 180 Count\\nIn Stock \\n$46.10\\nAlt Warehouse \\n$48.92\\nOut of Stock \\n$56.00\\nIn Stock \\n$51.23\\n# Lactated Ringers\\n## 1 Liter Bag, 12 Count\\nIn Stock \\n-\\nIn Stock \\n-\\nIn Stock \\n-\\nIn Stock \\n-\\n# Amoxicillin Caps\\n## 500mg, 500 Capsules\\nOut of Stock \\n-\\nAlt Warehouse \\n-\\nIn Stock \\n-\\nIn Stock \\n-\\n# Acepromazine Inj.\\n## 50ml (10mg/ml)\\nIn Stock \\n-\\nIn Stock \\n-\\nOut of Stock \\n-\\nIn Stock \\n-\\n# Enrofloxacin Inj.\\n## 20ml (2.27%)\\nOut of Stock \\n-\\nOut of Stock \\n-\\nIn Stock \\n-\\nIn Stock \\n-\\n# Carprofen Caplets\\n## 75mg, 180 Count\\nIn Stock \\n-\\nAlt Warehouse \\n-\\nOut of Stock \\n-\\nIn Stock \\n-\\n##### Official purchasing platform of trusted veterinary organizations\\n[ ![AVMA](https://media.vetcove.com/static/img/corporate/logos/avmalogo.svg) ](https://www.vetcove.com/</avma/>) [ ![AAEP](https://media.vetcove.com/static/img/corporate/logos/aaeplogo.svg) ](https://www.vetcove.com/</aaep/>) [ ![AAFP](https://media.vetcove.com/static/img/corporate/logos/fvma.png) ](https://www.vetcove.com/</felinevma/>)\\n# How it Works\\n## Getting started is quick and easy\\n1\\n# Add Your Suppliers\\nAdd your web accounts with all major veterinary vendors. Your special and GPO pricing is fully supported, and prices always match your suppliers’ websites. \\n2\\n# Compare Pricing & Availability\\nSearch all supplier catalogs at once to find the best products. See pricing, what\\'s in stock, and promotions in real time from all suppliers, customized for your clinic. \\n3\\n# Add To Cart\\nAdd items to your suppliers’ carts, and manage them all at once, right from Vetcove. When you finish shopping, complete checkout without leaving Vetcove. \\nAdd  Connected \\nAdd  Connected \\nAdd  Connected \\nAdd  Connected \\nAdd  Connected \\nAdd  Connected \\n# Built for Veterinary Purchasers\\n## Inventory Managers: You’re going to love Vetcove\\nWhether you’re new to inventory, or an experienced purchaser, you’re going to love Vetcove. Your days of juggling dozens of websites and phone calls are history! \\n# Over **19,000** veterinary hospitals trust Vetcove for their purchasing\\n## I really enjoy the ease it has made my ordering! Thank you so much Vetcove team.\\nMelissa Unzicker\\nFamily Pet Hospital | Platteville, WI\\n## Vetcove has been a huge time saver for me when ordering! I no longer have to check multiple sites for the best price or to find an item if it is back ordered. I also love that I can check out directly from the site instead of going to multiple web pages. If you aren\\'t using Vetcove, you are wasting time and money!!\\nAshley Willis\\nBasin Run Animal Hospital | Colora, MD\\n## I can\\'t say enough great things about Vetcove. The ability to compare prices instantly has saved us a LOT of money. Also, with a few key strokes, you can see if a product is on backorder, and potentially when it will be released.\\nElizabeth Cox\\nWestwood Animal Hospital PLC | Staunton, VA\\n## Vetcove has absolutely changed the way I do ordering- in a good way! Price shopping has gone from a mundane task to an exciting experience. Sticking to a budget has never been easier and I have never been more efficient.\\nSue Hutton, Hospital Administrator and Veterinary Consultant\\nAnimalia Veterinary Hospital | Franklin, TN\\n## Vetcove has been a real time saver for us. Instead of opening multiple tabs, typing (and retyping) product names, looking at the price, clicking back to see the other distributor\\'s price, etc, we now have one window open to Vetcove. All our distributors are there, with any special pricing pre-loaded. Quick and simple to compare prices. They even break it down to per tab price! Fantastic!\\nMichael Goldmann, DVM\\nNanuet Animal Hospital | Nanuet, NY\\n## Such an easy and essential time saver for our practice. I can\\'t imagine going back to the old site by site comparison that we used to do! You guys are great, and it\\'s been such a wonderful tool for our hospital to use. I love the forums as well!\\nThe Bristol County Veterinary Hospital Team\\nBristol County Veterinary Hospital | Seekonk, MA\\n## I love the community feel of Vetcove and the opportunity for managers to discuss products or issues. The organization Vetcove brings to inventory and ordering, making sure I am getting a product I ordered before and providing accurate history and prices, as well as the updates on backorder or alternate stocking.. extremely helpful, and easier to read than the vendor websites.\\nMonica Saunders\\nAnimal Clinic of Rockford | Rockford, IL\\n## As a solo practitioner of a 3 year old startup, I am always trying to keep costs down. With Vetcove, I now have the ability to do that while saving at least an hour a week. It\\'s so easy. I am so thankful that Vetcove is free for vets to use. The money I save and the extra time I have now are priceless to my young family. You guys rock!\\nEricka Yeley, DVM\\nFarm & Family Veterinary Service | Marshall, IL\\n## When I first started ordering products, I was a bit overwhelmed. Sorting through each item we needed took me hours. But since we started an account with Vetcove, it\\'s been a breeze to find which supplier to use! The site is very easy to navigate, and I\\'m constantly saving money through the instant price comparison. 100% would recommend!\\nKatie, Retail Manager\\nBlue Sky Animal Clinic | Loveland, CO\\n## Vetcove has hands-down made inventory management easier. It is quicker to order, faster to see who has products in stock and who has them on promotion, and track who we have been buying what from. We still visit with and support our reps, but I have a much better idea about where I should get items from (and how many)!\\nAlex Flinkstrom, Office Manager\\nLunenburg Veterinary Hospital | Lunenburg, MA\\n## Vetcove is a fantastic tool for any practice. The ability to quickly compare prices from different vendors is great by itself, but the developers have gone above and beyond with the purchase history analytics. We\\'ve been using Vetcove for two years now and it just keeps getting better and better.\\nHenry James, Practice Manager\\nAnimal Hospital of Pasco | Pasco, WA\\n## We love Vetcove!! It has completely changed the way we order and track purchasing. So much time and money saved!! Thank you Vetcove!\\nRebecca I, LVT\\nAnimal Medical Clinic of Goose Creek | Goose Creek, SC\\n## I am very thankful to have Vetcove in my life! This site saves me so much time not having to go back and forth to my different vendors. Inventory is a lot easier and faster now. I also like that there is a discussion board over many topics, it’s very helpful to reach out to other inventory managers.\\nAshley Ortiz, LVT\\nGulf Coast Veterinary Specialists | Houston, TX\\n## Purchasing and inventory management without Vetcove is like using dial-up internet in today’s world. This website is absolutely indispensable. There are so many valuable features and it is all FREE. I urge everyone to take full advantage of this amazing website; you won’t ever go back to your old methods.\\nCathy Davis, LVT\\nUpstate Veterinary Specialists | Greenville, SC\\n## Vetcove is by far the best company I work with. The amount of money and time I save is incredible. I can\\'t imagine practice life without them!\\nEmily Gordon, LVT\\nAutumn Trails Veterinary Center | Charlottesville, VA\\n## Our practice is currently updating our inventory guidelines, tracking, and ordering procedures. Vetcove has made it so much easier. Since cost is always a concern, it is so nice that this service is offered for free. Best new technological contribution to our field in awhile!\\nSamantha Riddels, DVM\\nLange Veterinary Hospital | Sherman, TX\\n## I can\\'t imagine the past 2 years without Vetcove. It absolutely has made ordering and maintaining my inventory much easier.\\nDr. Deb Robertson\\nSouth Bay Mobile Vet | Manhattan Beach, CA\\n## Prior to Vetcove, I would open multiple distributor websites and browse from one to another and back again. It took me hours to compare and select the best prices. Vetcove made it possible to view all my distributors in one location and truly compare prices. It eliminated the time I used to have to spend researching for sales and the best prices.\\nKelly Spagnoli, Practice Manager\\nAvalon Veterinary Clinic | Orlando, FL\\n## I love being able to see my pricing on all my distributors without having to go back and forth between websites. I like that most products are broken down into a per tab/cap price. It makes price comparisons easier.\\nBrandy Tabor, RVT\\nMeeker Animal Hospital | Meeker, OK\\n## Thank you for your fantastic customer support! I feel like an individual, rather than \"just another client\". They really take the time to help find a solution and genuinely value client suggestions. This personal touch brings me back to Vetcove every time.\\nJennifer Compton, LVT\\nCNY Veterinary Medical Services | Westmoreland, NY\\n## I LOVE Vetcove! Vetcove has really transformed my ordering process. Now I can easily and quickly see what other options of generics, prices and deals going on with seven different distributors at once! Vetcove also has a awesome support staff that I can quickly chat a question and get help in minutes. I don\\'t know how I handled ordering before Vetcove.\\nJodi See\\nNorthrock Hospital for Animals | Witchita, KS\\n## I LOVE Vetcove! Prior to Vetcove, I had tabs open for each of our distributors and would log in to each one and search their sites individually for most items that I needed to order. Now Vetcove does that for me, freeing up precious time to do other things!\\nMike Pope, DVM\\nDarien Animal Hospital | Darien, GA\\n## Vetcove has been a Godsend. I was skeptical at first. I didn\\'t really think this would save me time or money. The ease of ordering from my 3 top distributors has been pleasantly surprising. I like the ability to see all my shopping carts at once. I enjoy the other aspects of Vetcove as well, such as the order history and invoice look up features. Thank you for creating such a valuable site.\\nAngie Werth\\nGentle Doctor Animal Hospital | Omaha, NE\\n## Vetcove has been a lifesaver with ordering inventory. I used to have to price shop between 3 different distributor sites which took way too much of my time. This saves me so much time AND keeps my budget to a minimum!\\nKirsten Friedrichs, Practice Manager\\nFinan Animal Hospital | Darien, IL\\n## Vetcove has drastically decreased the amount of time it takes me to order supplies. It is so easy! I would recommend it to anyone! I love using Vetcove and it is my first thing I go to when ordering! Thank you for making such a great site!\\nStephanie La Tour\\nMahomet Animal Hospital | Mahomet, IL\\n## We absolutely love using Vetcove! It has made our jobs so much easier having all our vendors on one screen when searching items. Would highly recommend Vetcove to anyone who is looking for a more efficient way of stocking their practice.\\nRachel Brown, CVT\\nHaslet Veterinary Clinic | Haslet, TX\\n## Vetcove is the best! It has literally saved hours of my week by streamlining all my vendors into one, easy to use site. The staff at Vetcove is wonderful too. Overall it\\'s an A+ site! It\\'s the only way I shop anymore.\\nLuke, Practice Manager\\nLenox Hill Veterinarians | New York, NY\\n## I love Vetcove! I order inventory for 2 large veterinary practices and from multiple distributors. It is hard to remember what, when & how much I ordered. Through Vetcove, I save a lot of time and money. I can easily hover over order history and check if I recently purchased an item. No more ordering inventory that is already here & overlooked! LOVE LOVE LOVE!!!\\nMika H\\nSouthern Veterinary Partners | Statesboro, GA\\n## Vetcove makes it easier to price compare and shop multiple vendors at once. I love using it and would never want to order without it.\\nJessica B.\\nWilson Veterinary Hospital | North Salt Lake, UT\\n## Vetcove is awesome! It truly offers the best way to see which of your distributors have availability of an item at a quick glance. With all the chronic back orders of so many products, this is truly the quickest way to find what you need and get it on its way without making 4 phone calls or checking 4 websites.\\nLorrie Powalski, LVT\\nMt. McKinley Animal Hospital | Fairbanks, AK\\n## I was new to inventory and Vetcove really helped me adjust from being a tech to an inventory manager. To have one place I can compare prices, order and find out answers to questions I have is amazing. It really is an amazing tool.\\nSamantha\\nBroadview Animal and Bird Hospital | Seven Hills, OH\\n## Your website has become a huge asset for our ordering department. It simplifies the process, drastically cuts down on time, and above all - saves us money. The customer service has been amazing and extremely responsive. We absolutely LOVE this website!\\nJohn Curry\\nClearwater Marine Aquarium | Clearwater, FL\\n## Vetcove has been a time and money saver for our clinic. I do all our ordering via Vetcove. Being able to compare pricing and check out with all of our distributors in one location has been the most amazing thing! I would never go back to the way we use to order.\\nGeorgia Carter\\nWasilla Veterinary Clinic | Wasilla, AK\\n## With Vetcove, comparing prices between distributors is a breeze. Shop, purchase, check out all in one place.\\nStacey McKnight, CVPM\\nFairview Animal Hospital | Ellenwood, GA\\n## Vetcove has been a wonderful tool for ordering our weekly inventory. It is fantastic to have all the products and pricing in one location. This has DEFINITELY streamlined our system.\\nDanette Manning, LVMT\\nBlue Oasis Pet Hospital | Mt. Juliet, TN\\n## I have been in charge of my hospital\\'s inventory for the past 15+ years. At first I thought Vetcove sounded too good to be true, but I am SO glad I pursued it! WHAT A TIME SAVER! No more phone calls, no individually checking separate websites, no wasted time. All answers are at your fingertips...Simply brilliant.\\nDawn Frentzel\\nAnimal Medical Clinic of Wheaton | Wheaton, IL\\n## Vetcove allows me to compare products/pricing to make the smartest purchases for our practice. Product reviews let me share my first-hand experience with products that might be helpful to other clinics. I love the discussion boards! It\\'s so nice to be able to share ideas!\\nCaitlin\\nPoland Veterinary Centre | Poland, OH\\n## Vetcove has revolutionized the way our hospital locates and orders goods. We are able to quickly check pricing against vendors, look at trends in ordering and take advantage of promotions and deals. This has helped us cut costs and decrease the amount of time spend researching and ordering.\\nSam, LVT\\nMaine Veterinary Medical Center | Scarborough, ME\\n## We are still relatively new to ordering with Vetcove, but we don\\'t want to remember a day with it! Vetcove has made the ordering process so simple and organized from immediate price comparisons, to details on each and every product as well as order history. As a team, we have the utmost trust for Vetcove and we highly recommend it, to say the least.\\nDemy & Maggie\\nEureka Veterinary Hospital | Miami, FL\\n## I think this site is great. I recommend it all the time. It has saved me so much time and money!\\nAlison M.\\nSacramento Zoo | Sacramento, CA\\n## The ability to compare all of our available products and pricing in one place is indispensable. Finding alternatives through distributors is time-consuming. But with Vetcove, it\\'s instant! Thank you Vetcove for saving our business so much time in ordering inventory! This is the future of veterinary inventory management.\\nJamie Branham, CVT\\nThe Little Animal Hospital | Port Washington, WI\\n## Vetcove has been a game changer for me! It is incredibly simple, and saves me time and money. Having the ability to compare prices at my fingertips has made a significant impact to our practice!!\\nRachel\\nFrankfort Animal Care Center | Frankfort, IL\\n## Vetcove saves me so much time each week. I no longer have to float between the different distributor sites looking for product/prices. The Vetcove staff has been very helpful with any questions, and the discussion boards are a great source of information as well.\\nJess\\nEvans Family Pet Care | Marshall, MN\\n## I’ve been ordering inventory for over 17 years, and every rep tells me that their pricing is great, the best, etc. Now I no longer have to wonder. I log into Vetcove, type in what I want, and I KNOW which distributor gives me best price. I’m saving time, money and I have an unbelievably convenient way to order... If I have a problem, they respond real time, immediately!!!! Love them!!!\\nKaty Joyce, CVT, Hospital Manager\\nPond Point Animal Hospital | Milford, CT\\n## Vetcove is an asset to the veterinary community! It has made my job as inventory manager so much easier and it\\'s easy to save the hospital money with comparisons at your fingertips. The message boards are a great way to get insight from colleagues!\\nSean\\nMid North Animal Hospital | Chicago, IL\\n## Vetcove has been really helpful for us both in technical support and inventory control! Keep up the good work :)\\nJennifer Compton\\nCentral New York Veterinary Medical Services | Westmoreland, NY\\n## I love having current pricing and availability at my fingertips! Being able to price shop and arrange my orders within the shopping carts to satisfy various distributor agreements is great! Online access to various distributor catalogs has saved me so much time and headache!\\nJennifer O.\\nExclusively Cats Veterinary Hospital | Waterford, MI\\n## The amount of time we save ordering is priceless. Price shopping, sourcing backordered products, reviewing previous purchases, and highlighting specific promotional items, all in one easy to use site...We are thrilled with Vetcove!\\nChris Rehm, DVM\\nRehm Animal Clinic | Loxley, AL\\n## Vetcove makes ordering easy, and they have amazing deals!\\nJustin De Sola\\nAstoria Animal Society | Astoria, NY\\n## Vetcove has been an absolute game changer for SF SPCA since we began using it in late 2015. The cost to Veterinarians is nothing, but the benefits are enormous. This tool has been so important to our work; I think it would significantly help any nonprofit or small vet practice just as much as it helps us, possibly even more.\\nSusan Reeves, Director SF SPCA Supply Chain\\nSan Francisco SPCA | San Francisco, CA\\n## Vetcove is a game-changer! This web site has saved me time AND money! Plus I\\'m able to see what\\'s in stock and anticipate delivery delays. It\\'s super easy to navigate and I absolutely love the community forum they\\'ve added–so helpful! I wish there were a Vetcove for every aspect of life. I don\\'t know why you wouldn\\'t use it!?\\nMeghan S. Bingham\\nWest Alabama Animal Clinic | Houston, TX\\n## I LOVE Vetcove! It has made the headache of comparing prices so much easier. I also love how you can add the products to your cart on Vetcove and it automatically redirects you to the distributors website to place your order when you are ready. Very awesome website that is actually helpful and saves you time!\\nAlyssa Richards, RVT\\nConley & Koontz Equine Hospital | Columbia City, IN\\n## We had been putting off using Vetcove for some time. I decided to give it a try and we are so happy with the service. It makes price shopping so easy and the site is so user friendly. Highly recommend this to anyone who price shops. Thank You Vetcove!!\\nBernie\\nEarly Winter Equine Medicine and Surgery | Lansing, NY\\n## Direct Connect (Powered by Vetcove) has revolutionized our product purchasing by allowing us to rationally compare pricing and product characteristics across multiple suppliers. It’s the best inventory control tool yet devised in veterinary medicine and a wonderful workload reducer for our staff. Keep up the great work!\\nArnold L. Goldman DVM, MPH, CEM\\nCanton Animal Hospital LLC | Canton, CT\\n## Where has Vetcove been all my life?! I cannot believe how much time and money I save by price shopping all of my distributors on one user-friendly website. The website design is beautiful and is my go-to every single day for ordering. But what sticks with me most is their outstanding and personal customer service!\\nCaitlin Shaw\\nLyndon Veterinary Clinic | Fayetteville, NY\\n## I LOVE Vetcove! I used to spend so much time looking through each different distributor trying to find a medication and then trying to find the best price. This is one stop shopping and saves me so much time and there is no hassle. I just wish that I knew about this sooner!\\nDierdre Haley\\nMacDonald Veterinary Services | Gilford, NH\\n## Vetcove is so easy and convenient, all the products are in one place with all the pricing. You can see products that are out of stock and in different warehouse etc. Basically vetcove is amazing.\\nKeri\\nSt Francis Animal Hospital | Fredericksburg, VA\\n## I think that Vetcove is amazing!! I’ve already told a couple of other inventory managers about it as well! Thanks for the HUGE shortcut for my job!\\nKat Green\\nUpstate Veterinary Specialists | Greenville, SC\\n## Vetcove is absolutely a 5-Star must-have application for any busy vet practice. It has dramatically improved our ability to purchase at the best available price, and reduced the amount of time we spend performing purchasing tasks.\\nScott Carlin\\nAPC Veterinary | Tulsa, OK\\n## Vetcove is so awesome! It has cut my ordering times down by at least half. I love that they bring every one of my distributors up with price comparisons. I no longer have to have 4 tabs open while looking up who has what, and what the prices are.\\nMandy Jamerson\\nLake Forest Animal Hospital | Gaithersburg, MD\\n## I have utilized Vetcove for several years. It has been a tremendous tool for me to save time and money with sourcing medications or supplies that are on back order. In addition to price comparison, Vetcove is evolving and working to add additional value and support to its users.\\nBobby Becker\\nWoodlake Animal Hospital | Midlothian, VA\\n## The website is easy to use, and is a staple at our practice. Not only does it save me time with placing orders, but we are saving money by finding the lowest prices available. Thank you very much for making this excellent site available to us!!\\nSteve Askin, VMD\\nAnimal Welfare Society | West Kennebunk, ME\\n## Vetcove has been *extremely* helpful for me when I\\'m ordering. I used to have to open multiple pages at once, line them all up, search each one individually, and THEN compare pricing. Vetcove has spared me all the headache! Thank you!!\\nHannah Kienow\\nSafe Haven for Cats | Raleigh, NC\\n## It is so easy to search for the items needed and price match between your vendors all on one page. It\\'s simple, easy to use and just all around an awesome tool. I know if I ever have an issue the Vetcove team will be there to assist. I certainly would recommend Vetcove to anyone in an inventory position!\\nBrad Reynolds\\nSouth Carolina Veterinary Specialist and Emergency Care | Columbia, SC\\n## Vetcove has really become a vital tool that I check at least once a day! I love that all of my ordering information is in one place, so that I can easily find backordered items (if they are still being warehoused) at an alternate vendor. Pricing is right at your fingertips.The forums are so helpful!\\nTamara Fletcher\\nHeart of Chelsea Animal Hospital | New York, NY\\n## As a nonprofit we are constantly trying to find the best deal to better serve our shelter and clients. Vetcove has helped us to make smart buys and keep our prices low for the community so that we can better serve our mission.\\nAmanda Rosado\\nBrandywine Valley SPCA | Westchester, PA\\n## I used to go to all the vendor sites and compare prices, now Vetcove does this for me. Vetcove should develop the same program for Amazon, Target, and Walmart!\\nYoon Chay\\nTown & Country Veterinary Hospital | Media, PA\\n## This website is such a time saver for my position as finance and inventory manager! It enables me to efficiently check against 4 different distributors for pricing, availability and promotions! Thank you for this wonderful service!\\nJackie Ballay, Finance and Inventory Manager\\nErie Animal Hospital | Erie, PA\\n## Any time we need a new product, we look at Vetcove first to determine where to order and where we can get the best price. It has saved me hours of time. I can\\'t imagine my practice without it!\\nSarah S.\\nInverness Animal Clinic | Birmingham, AL\\n## I love Vetcove! It has made my ordering much easier. It has also helped me get my budget under control and track my order history with precision. Great site and a must have tool for incorporating an inventory management program.\\nAna Kiefer\\nSan Francisco Zoo | San Francisco, CA\\n## The amount of time saved placing orders, and money the hospital has saved in the first month, is amazing! It was very easy to set up my account and the ability to find products (and get the best price) is an Inventory Manager’s dream! I would recommend Vetcove for anyone who purchases for their hospital.\\nDanielle Muldoon\\nVeterinary Specialty Center of Delaware | New Castle, DE\\n## Vetcove has been an absolute time saver! I have been able to cut my ordering time in half. Being able to use the compare prices feature has saved us tons of money. I wish I had found it sooner.\\nBrandie Jacobia\\nCommunity Animal Hospital | Pocatello, ID\\n## Vetcove makes all my orders simple and efficient, and I know I am getting the best price. If you aren\\'t using them, you are paying too much for your inventory. They are also adding great new features like forums and product blogs, recall lists, and have an easy to use interface to track previous orders. This site is a blessing for any inventory manager.\\nBen Shindelus, LVT\\nSage Veterinary Care | Sparks, NV\\n## I absolutely love Vetcove. We\\'re a non-profit humane society where every penny counts. Vetcove has become my holy grail. I place my orders in 20 minutes instead of 2-3 hours. I would be devastated if it ever went away!\\nCourtney Werner, MBA\\nWomen\\'s Humane Society | Bensalem, PA\\n## We’re using Vetcove a lot, and it’s great! It almost makes shopping “fun” for our technician in charge of ordering. It\\'s definitely saving us some money too.\\nJoe Frost, DVM Owner\\nFrost Family Pet Clinic | Loves Park, IL\\n## Vetcove has benefited our practice as a one stop shop. So, my office staff can do other things in our practice besides talking to distributors and checking prices.\\nLaura DuVall Molony\\nGeorgia Equine Veterinary Services | Canton, GA\\n## I am so excited about Vetcove!! In the past, I felt like I spent more time bouncing from webpage to webpage to try and find the best deals, and would often end up working on my orders at home so I could at least be comfortable when I was trying to price check items! Your site is a game changer!!\\nLiz Gelhaar\\nWisconsin Humane Society | Racine, WI\\n## I absolutely love Vetcove here at Countrycare...The use of this website has actually changed my primary distributor as I can now see they are a more cost effective option for this clinic. I hope that Vetcove plans on sticking around for a while, because my entire protocol has changed here as an inventory manager because of it. Thank you!\\nKat Robertson, CVT\\nCountrycare Animal Complex | Green Bay, WI\\n## Vetcove is awesome! I am amazed at the fact that this such an easy way to compare prices. It\\'s a safe and legitimate website that does not cost anything, and has the best customer service of any online company I have ever dealt with!\\nJerrah King\\nPleasant Hill Animal Hospital | Pleasant Hill, OR\\n## I\\'ve been using it for months and I love it. Makes ordering so much easier since I don\\'t have to compare prices myself. It\\'s easy to train people to order when I\\'m off, since they don\\'t have to wonder which distributor they get what from. I also like the free samples.\\nLindsey Moyer, CVT\\nAnnville-Cleona Veterinary Associates | Annville, PA\\n## We\\'ve been using Vetcove all the time for over a year now. It\\'s a fabulous site that ensures we are getting our items for reasonable prices. It\\'s a great bargaining tool with the vendors too, because I can easily see what each vendor is charging for the same item!\\nKristen Anderson\\nCape Cod Veterinary Specialists | Bourne, MA\\n## I am very impressed with Vetcove. It has really revolutionized the way I look up products for our practice, thus saving us money! Thank you!!\\nKatlyn G.\\nAnimal Wellness Center of Buffalo Valley | Mondovi, WI\\n## I introduced Vetcove to our office manager. She came and thanked me right away because she absolutely loves it!! She said it is going to save her so much time. Thank you again!\\nShelly Martin, DVM\\nAdobe Veterinary Center | Tuscon, AZ\\n## I absolutely LOVE Vetcove! It has made ordering, locating hard to find items, and price comparisons a snap. We are saving time and money. It truly is amazing and I don\\'t think I could ever go back to ordering without it!\\nHeather Kilheeney\\nMill Creek Animal Clinic | Palos Park, IL\\n## I\\'m very thrilled with Vetcove! So far, it has cut down the time it takes to order our inventory, as well as keep costs in line by allowing us to see the price variance between our distributors, something we couldn\\'t readily see before. I also enjoy the conversations between users in Discuss!\\nPeg Gaven\\nUniversity Animal Clinic | Bradenton, FL\\n## Vetcove is the veterinarian’s “the miracle” program for doing it well! The ease of finding products surpasses individual distributor websites. If there is ever a question, it is amazing how quickly Vetcove responds and solves the question. I foresee Vetcove masterminding more useful additions to an awesome program and for this reason I am glad we are a part of the Vetcove family!\\nDelores Gockowski, DVM\\nNorth Ridge Veterinary SVC, LLC | Sturgeon Lake, MN\\n## It is easy to use and resulting in surprising savings. Companies that were not major suppliers of mine are getting more business. Very, very helpful!\\nPeter F. Veling, DVM\\nPalencia Pet Clinic | St. Augustine, FL\\n## We use Vetcove and love it! It makes it so easy to find the best price, and to locate some hard-to-find items or backordered items.\\nAaron Bessmer, DVM, Owner\\nElk Creek Animal Hospital | Souix City, IA\\n## This is a great product! We love it. I have shared it will all my friends and they also love it. It has saved us so much time and money!!! Thank you Vetcove team for providing such a money saving product for free!\\nZile Singh, DVM\\nGreenwood Animal Hospital | Seattle, WA\\n## It helps a great deal with time, organization and pricing. I would recommend Vetcove to any clinic looking to get the best deals on medications. Very quick and easy to operate. 5 stars!\\nRyan Hirt\\nPaces Ferry Veterinary Clinic | Atlanta, GA\\n## Vetcove is the best thing to happen to veterinary medicine in the last 5 years. We LOVE it! This website has made ordering easy, fast and saves us tons of money. We could never go back to the dark ages before Vetcove.\\nPaul Camilo\\nHometown Animal Hospital | Weston, FL\\n## I love Vetcove! The convenience of having everything all in one place is great, and I really appreciate not having to navigate a half-dozen different websites. In Vetcove, the interface is user-friendly and completely consistent. Vetcove is a tremendous time-saver, and I can\\'t imagine doing my ordering any other way!\\nLynda Reid, Practice Manager\\nCollege Avenue Animal Clinic | Levelland, TX\\n## I love the time I save not having to toggle back and forth between the vet suppliers!\\nRenee D., CVT\\nVet Neurology and Pain Management Center of NE | Wapole, MA\\n## Vetcove saves me so much time! I\\'m able to compare our vendors so I know I\\'m getting the best price! I use only Vetcove to order our supplies – it\\'s easy to use and it\\'s free! I love it!\\nLory\\nTLC Animal Hospital | Inverness, FL\\n## Vetcove is a game changer for the veterinary practitioner - especially for small practices. With Vetcove we have all our distributors consolidated into one location to search and choose the best price and product for the need. Vetcove has put purchasing power back in to the hands of the practitioner.\\nBen Character, DVM\\nMobile Veterinary Service | Eutaw, AL\\n## I really love your site. It has saved me so much time as I no longer have to check multiple vendors for prices before ordering! I was hoping someone would invent something like this! Since we discovered Vetcove, our life has been so much better. We can compare prices on one web site in seconds and place our orders through every company we use in a matter of minutes. Great invention. Great company!\\nShannon Miller, DVM\\nMiller Veterinary Services | Conyers, GA\\n## I just set it up and compared prices to invoices I have on my desk and it\\'s spot on. Love the ease of use and the PICTURES!!! Thank you! and congratulations on making a very useful tool.\\nSuzanne Butcher\\nTimber Creek Veterinary Hospital | Canyon, TX\\n## Vetcove has made ordering a much smoother and efficient process for us. Instead of comparing costs from one website to another, we can look at one site, cost compare, and order all within minutes!\\nNancy Bureau, DVM\\nLeft Hand Animal Hospital | Niwot, CO\\n## I absolutely love your site! It helps me order quicker and more efficiently. Thank you for offering such a great service!\\nBrad Seaman, DVM\\nGreenpoint Veterinary Hospital | Brooklyn, NY\\n## It took us awhile to try it out, but I have to tell you that you have saved me A LOT of time on my orders. I would open all my different distributors in different tabs and toggle between them all to compare the costs. Being part of a Humane Society and a low cost clinic, I can really help keep the costs low and keep going with our fast paced environment!\\nJanette Fetter, CVT\\nLongmont Humane Society | Longmont, CO\\n## It\\'s easy to navigate. It’s really nice to be able to see things in one place instead of having to have multiple web browsers open to look for the best price, or to look for something that is on backorder. Really glad this was developed!\\nKerry Balding, Practice Manager\\nThe Paw Patch Veterinary Hospital | Indianapolis, IN\\n## It make searching for products very easy and efficient. Readily available to asnwer questions, regarding products for my staff.\\nLogan C. Miller, CVT\\nDeer-Grove Veterinary Clinic | Cottage Grove, WI\\n## This has got to be one of the best programs I have seen in years!!!!! Very helpful and resourceful\\nYvonne\\nDallas Highway Animal Hospital | Powder Springs, GA\\n## I use Vetcove all the time and love it! It simplifies ordering by a hundredfold and saves me on average an hour per week or more ordering.\\nLisa Immerblum, LVT\\nGoldens Bridge Veterinary Care Center | Goldens Bridge, NY\\n## I am now using Vetcove for the past couple of months and I just love it. I can get things ordered in a jiffy, I am just so ecstatic about this new wonderful platform I cannot express in simple terms. Thank you very much!\\nDechamma Ballaranda, DVM\\nEast Detroit Animal Hospital | Eastpointe, MI\\n## I am amazed at how many options are available, and the pricing differences between the companies that we order from. The site is so easy to use, and is a definite time-saver and cost-saver!\\nJill Drinkwater, Office Manager\\nLancaster Vet Clinic | Lancaster, WI\\n## I love it! Vetcove has been a great time saver for comparing products against our different distributors. I really like that I can save lists so reordering the same product is simple and fast. Thank you for this great service!\\nMicha Piraino, DVM\\nStepping Stone Animal Society | Cumberland, MD\\n## I use Vetcove and I am very happy with it! I really like your reports and analytics. I always recommend Vetcove to all managers during meetings.\\nKasia Guzy, Hospital Administrator\\nBerkshire Vet | Pittsfield, MA\\n## It has made things very easy to be able to see all our vendors prices at one time. I like that the carts are saved and can be updated. The checkout process is easy. It sends us straight to the vendor\\'s site and the cart is uploaded automatically!\\nTheresa R.\\nAngel Animal Hospital | Naples, FL\\n## I have to say that I am LOVING Vetcove!! It has made finding the best deal on any items needed, very simple. I’m VERY happy with Vetcove and plan on continuing to use it for the future and growth of our hospital.\\nDeborah Fish\\nCinema Veterinary Centre | Santa Clarita, CA\\n## Vetcove has saved me a lot of time in comparison shopping across vendors. Its great!\\nSarah\\nLifetime Pet Center of New Richmond | New Richmond, OH\\n## Since I discovered Vetcove (I love that I can see the price comparisons) we have been able to save money. I have shared Vetcove with several people at a conference who are now using it. Keep up the good work!\\nP. Gonzalez, Hospital Manager\\nSanta Paula Animal Clinic | Santa Paula, CA\\n## I highly recommend Vetcove to everyone - it cuts down costs, especially if you only purchase from one place. There are some serious savings!\\nKeith Krempl\\nLancers Square Animal Clinic | Plano, TX\\n## I love it!! I absolutely love it! It saves so much time—and money! And it\\'s so easy.\\nJulie Cracolici, Inventory Manager\\nLebanon Equine Clinic | Lebanon, OH\\n## Vetcove is very user friendly. The price comparison is very helpful...It\\'s nice to see when products are on backorder and if someone else may still have some in stock. It has made online ordering even easier.\\nAnn Pawlak\\nThe Piedmont Equine Practice | The Plains, VA\\n## Your site has become indispensable! I use it every time I need to order. Congrats for coming up with the idea!\\nKenton Flaig, DVM, Owner\\nPortville Veterinary Clinic | Portville, NY\\n## Love the website! It\\'s very user friendly, and it really saves me a lot of time and the clinic money.\\nJennifer Wagner, CVT\\nAppanasha Pet Clinic | Menasha, WI\\n## Vetcove has added time to our day!! The ease of finding the least expensive option is right at our fingertips, Vetcove helps puts us in a much better position to communicate & negotiate with our vendors.\\nJay Wickham\\nPembroke Animal Hospital | Pembroke, MA\\n## Vetcove fast became a practice management bible of sorts. Complete product and supply lines for multiple distributors are available at your fingertips. Purchase history and order facilitation are made much simpler. Vetcove\\'s value is inestimable.\\nMichael P. Meaney\\nStamford Veterinary Center | Stamford, CT\\n## We have found Vetcove very easy to use. We use it to compare prices, of course, but also to track how often we are ordering items and how much we paid for them in the past. We can tell at a glance what is back ordered and what is available. I would recommend Vetcove to any hospital that wants to simplify ordering.\\nWendy C. Brooks, DVM\\nMar Vista Animal Medical Center | , None\\n## I love Vetcove! This has to be the most useful tool so far in veterinary medicine. Having access to all vendors at my fingertips in real time allows us to more effectively negotiate with our preferred vendors and improves our buying power.\\nDr. Ganon Harish, DVM\\nElmwood Small Animal Hospital | Buffalo, NY\\n## I love it, and I\\'ve told everyone I know on Facebook and practice manager groups. Thanks for creating such a useful site!\\nAmy Short-Jones, CVT\\nFox River Animal Hospital | Appleton, WI\\n## I have recommended this site to all my past places of employment , I love this site! I showed my boss and coworkers how to use Vetcove to order while I was away, and it made ordering very simple for them!\\nLisa Kowalski\\nGreen Road Animal Hospital | Cleveland, OH\\n## Vetcove is amazing, reduced my time spent placing my orders by 75%.\\nAnn Jayo, LVT\\nElko Veterinary | Elko, NV\\n## Vetcove has significantly reduced the amount of time I spend on ordering each week by allowing me to compare all my distributors in one place.\\nJennifer Bricker\\nEastern Maine Emergency Vet Clinic | Brewer, ME\\n## We really enjoy the \"one-stop shopping\" experience that Vetcove provides. Since we started using Vetcove we have saved both time and money when ordering the products we need most.\\nScott M. Stipe, Sr. D.V.M.\\nNoah\\'s Ark Animal Hospital | Fonda, NY\\n## I absolutely love Vetcove! It has helped to save so much time in my ordering process and simplified the teaching process for someone to step in and help me when I\\'m gone. Love it!!\\nMary Goble\\nWoodland Veterinary Hospital | Woodland, WA\\n## Vetcove makes ordering faster and easier. I love seeing purchase history and price comparisons. It is easy to allocate purchases between vendors if a distributor rep did something special for me.\\nDavid Hawkins, Practice Owner\\nDogwood Pet Hospital | Greshman, OR\\n## Using Vetcove has made my job a lot less time consuming. I love being able to go to one place to compare pricing instead of multiple websites!\\nNicole Burruss, Practice Manager\\nRed Barn Veterinary Hospital | Dahlonega, GA\\n## Vetcove is a lifesaver! No more having to check 4-5 different distributor websites! It is all there right in front of you! Thank you. If you aren\\'t using it yet, you should be :)\\nFred Davis, CVT\\nHilltowns Veterinary Clinic | Washington, MA\\n## Vetcove makes price comparisons easy. It finds what your looking for from each of your distributors and organizes it side by side so you can see what the best deal is, right away.\\nAmy Bradford, Office Manager\\nTrinity Animal Hospital | Weaverville, CA\\n## I use Vetcove exclusively....seriously the best website developed. I manage a 230k inventory and I am sure it has saved us money and time! I love it!\\nSiobhan Purser-Blackman, Purchasing Manager\\nCentral Hospital for Veterinary Medicine | North Haven, CT\\n## I didn\\'t have the time to compare prices across multiple websites, and I didn\\'t have the time to compare different products until I started using Vetcove. It has lowered my overhead costs and made ordering much easier.\\nKristian Shiver, DVM\\nAnimal Medical of Covington | Covington, GA\\n## Vetcove is incredible! They literally save me hours by helping us streamline our inventory process. In addition to time, they also help us save money by comparing all of our major vendors in one place. We would highly recommend them.\\nNate Crawford, Practice Manager\\nHannah\\'s Mill Animal Hospital | Thomaston, GA\\n## Vetcove is a miracle! It has saved me so much time and head aches when placing my weekly orders. I cannot imagine how I ever did it before Vetcove!\\nSheena Novick, CVPM\\nBeverly Oaks Animal Hospital | Sherman Oaks, CA\\n## It’s an awesome way to do everything in one spot. I love being able to compare numbers without having to jump around on different sites.\\nAli, Head Technician and Inventory Manager\\nSt. Louis Cat Clinic | St. Louis, MO\\n## It\\'s so convenient to go to one place to shop and get the lowest prices. Vetcove is a game changer.\\nJenny P.\\nNorth Boros Veterinary Hospital | Pittsburgh, PA\\n## I have grown to really love Vetcove. In the hectic rush of emergency Vetcove is a breath of fresh air when it comes to ordering.\\nLara, RVT\\nAnimal Urgent Care | Escondido, CA\\n## Vetcove is easy to use. I love that we customize our our orders. The support team is wonderful! My favorite thing about Vetcove is that it compares suppliers pricing, availability for each supplier, and the quick check out service!\\nKuuipo Betonio\\nAnimal Urgent Care of Fayetteville | Fayetteville, NC\\n## Vetcove is an incredibly helpful and easy to use tool for purchasing and tracking inventory! We love the ability to compare prices from all distributors in one convenient location.\\nApril Splawn, Hospital Owner\\nEbenezer Veterinary Hospital, LLC | Rockhill, SC\\n## I am so thankful that a friend told me about Vetcove. I always wondered if I was getting the best deal with each purchase but never had the time to compare prices on each distributor\\'s website. Now I know, and it’s so easy to use!\\nBonnie Abbott, DVM\\nVista Animal Hospital | Erie, CO\\n## Convenient! It\\'s very easy to find the products I need.\\nEYNC\\nC-Vet Animal Hospital | Naperville, IL\\n## Vetcove is a major process improvement to my position! The support and features that it offers are great and I would never want to “go back” to not relying on Vetcove for my daily duties! Thank you!\\nJacqueline Ballay\\nErie Animal Hospital | Erie, PA\\n## Starting a new practice we would have NEVER had the time to email or call each vendor for price checks for each product we use to pick a good match for us. This process would have been detrimental to our time management and financial budget. I cannot even imagine the impact that would have had on our success. Thank you for starting Vetcove well before we started a hospital!\\nLoretta Pesteanu\\nLoving Paws Animal Hospital | Brooklyn, NY\\n## I really love Vetcove! It has been a great help in managing inventory. It is very easy to look up information and saves me lots of time price shopping! Really happy to have it :)\\nFallon Ready\\nSpartan Animal Hospital | McFarland, WI\\n## LOVE IT! It\\'s easy, we save money, it\\'s quick, it\\'s personal (the owners of Vetcove are on any problem ASAP!)\\nKris Tajchman\\nWest Ridge Animal Center | Topeka, KS\\n## We are utilizing Vetcove and feel it saves us time. We like that the promotions pop up, and that we see if we have ordered from that vendor in the past. All good stuff!\\nMonique Pierpont, RVT\\nHarmony Animal Hospital | Jupiter, FL\\n## What a great tool! It makes ordering easier to get the best prices from vendors. How nice of you to share it for free! Love it!\\nBonnie\\nNorth Shore Animal Hospital | Duluth, MN\\n## My technician LOVES it! Thank you again for creating such a great service.\\nKimberlee Buck, DVM\\nFrankenmuth-Birch Run Veterinary Hospital | Birch Run, MI\\n## We are using it routinely and loving it! The search is easy, and we can compare prices instantly. I can\\'t think of anything I would change. Thanks for all of your hard work!\\nEva Beyer, VMD\\nSouth Mountain Vet Clinic | Phoenix, AZ\\n## Take 5 minutes to link your accounts, save yourself hours of work in the future. It REALLY is that easy with Vetcove!\\nAnn Frank, RVT\\nVeturgency | Frederick, MD\\n## Vetcove has been a very positive experience and has really simplified the ordering process. Instead of pulling up multiple websites of vendors that we purchase from, I call it \"one stop shopping\" through Vetcove.\\nBecky Vernon\\nMontclair Animal Hospital | Montclair, VA\\n## Vetcove is the easiest way to be sure you are getting the best pricing. It is also the perfect place to check on promotions and rebate programs! It has saved us so much money!\\nDani B.\\nMcClintock Animal Care Center | Tempe, AZ\\n## Vetcove saves me so much time. Before Vetcove I would have to do my ordering with four or five vendor windows open to find the best price and now it\\'s all on one screen.\\nCindy, CVT\\nCat Adoption Team | Sherwood, OR\\n## Vetcove has definitely been very useful!! This website has helped me spend less time ordering and made in sooo much easier to cut costs by being able to see the price for the same product from all my distributors. I have found things cheaper at opposite distributors than what I was getting for from my other one!! And it streamlines my ordering!\\nSara Hess, RVT\\nAsheville Veterinary Associates | Asheville, NC\\n## Vetcove is amazing and I use it every time I am going to order. I am a new start up so paying close attention to cost and any potential savings is huge. I would highly recommend Vetcove to any veterinary practice.\\nJessica Stumph, DVM\\nFirst Flight Mobile Veterinary Services | Kitty Hawk, NC\\n## One of the biggest frustrations of ordering is that no one supplier will ever be a on stop shop due to supply or widely differing pricing. Vetcove makes it easy to not only find what I need, but also see who has the best deal. I used to keep an excel sheet comparing all vendors which required updating 2-3 times a year. Vetcove has saved me hours of time!\\nRachel Wachter, RVT\\nSkylos Sports Medicine - Frederick | Frederick, MD\\n## I didn\\'t come from the vet field and Vetcove, their staff, and website has helped greatly in learning about products and pricing structure. Thank you! This has definitely helped me in learning about alternative items from other suppliers. It\\'s a great tool and I\\'m looking forward to using it in the future.\\nWendy Odgen, Inventory Supervisor\\nLas Vegas Veterinary Specialty Center | Las Vegas, NV\\n## Thanks for creating such an amazing website! Wish I would have found it sooner.\\nJamin Chenault, Practice Manager\\nRiverside Veterinary Hospital | Goode, VA\\n## We currently use Vetcove at both clinics and love it! I really like all the new features.\\nLauren Merrell, Practice Manager\\nTown East Galloway + Creek Crossing Animal Clinics | Mesquite, TX\\n## Vetcove is very user friendly. I enjoy doing all my shopping in one place. It makes ordering very quick and easy, and I love that you can compare prices all in one spot. It has saved me lots of time and money.\\nSierra Laskowski\\nHelena Veterinary Service | Helena, MT\\n## Vetcove lets me load all my carts, so I only have to go to my suppliers to checkout. I appreciate your efforts to make my job easier. Thank you for your hard work!\\nMichelle, Inventory Manager\\nOwen\\'s Ark Veterinary Clinic | Genoa, OH\\n## It took me less than 5 minutes to join, and the whole process was much easier than I thought. Make no mistake, the introduction and joining was well worth it. Vetcove is a valuable service that is totally free, and I recommend Vetcove to all the veterinary clinics.\\nAlbert Guirguis , DVM BVSc\\nRacetrack Animal Hospital | Tampa, FL\\n## Vetcove has been amazing so far! It has significantly cut down on our ordering time. Thanks again!\\nChanae Bowden, Clinical Manager\\nStapleton Veterinary Hospital | Denver, CO\\n## I love using Vetcove. It helps me find the lowest prices, and when things are on back-order somewhere I find an alternate supplier so easily... I like that it lets me know when I have a history of ordering the product from a supplier. It\\'s just great.\\nSarah Bloom\\nCoral Springs Animal Hospital | Coral Springs, FL\\n## Vetcove is like the Amazon of veterinary medicine! It makes bargain hunting a breeze!\\nBecky N., LVT\\nPresque Isle Animal Hospital | Presque Island, ME\\n## Vetcove is great for rapidly allowing me to price compare and find what I need\\nPilar Starman, DVM\\nLarkspur Pet Hospital | Larkspur, CO\\n## Love Vetcove! It cuts ordering time down by half!\\nMichele Ball\\nBack on Track Veterinary Hospital & Rehab Center | O\\'Fallon, MO\\n## Vetcove has helped to streamline the inventory process and save me valuable time.\\nDanielle T., Practice Manager\\nChippens Hill Veterinary Hospital | Bristol, CT\\n## We are very happy with the services you provide. It makes ordering from multiple distributors much easier.\\nGina Compton, RVT\\nWinchester Veterinary Clinic | Canal Winchester, OH\\n## Vetcove is a time and money saver. I love it.\\nBen Hendershott, LVT\\nPleasant Grove Animal Hospital | Texarkana, TX\\n## I love being able to go to one site and see price differences. It\\'s has saved me lots of money and time!\\nKira MacKinnon\\nEcho Ridge Veterinary Hospital | Evans, WA\\n## I have been using it and I love it! All of our distributors are in one place. It makes price comparisons very easy, as well as showing alternate products if something is not available.\\nJessica Best, CVT\\nPartridge Animal Hospital | St. Petersburg, FL\\n## I love Vetcove to check across the board pricing and availability on new products! It is very helpful to my medical team!\\nTerry G., RVT\\nBuckeye Veterinary Clinic | Akron, OH\\n## We love Vetcove. It makes ordering great and has saved us hundreds!\\nKristen Vance, DVM\\nHomeward Bound Mobile Vet | Bel Air, MD\\n## I visit Vetcove first and I don\\'t need to go to any other website to place my order. Good stuff!\\nBeth Hill\\nWestside Animal Clinic | Great Falls, MT\\n## Before I was forced to compare prices on 5 or 6 sites every time I ordered. Now when a price changes, boom - I can check if its cheaper somewhere else. When an item goes on backorder, boom - I can see who else has it.\\nKim Califano\\nColts Neck Equine | Colts Neck, NJ\\n## Excellent resource for making ordering less painful!\\nKevin Marecle, Owner\\nRussellville Animal Clinic | Russellville, AL\\n## Vetcove saves us time and money. I can find the best price on our products without searching through numerous websites.\\nShannon\\nPittsburgh Veterinary Dermatology | Pittsburgh, PA\\n## I love Vetcove. There is a lot of helpful information to complete my job thoroughly and easily!\\nJessica Stumph, DVM\\nDayton Care Center | Centerville, OH\\n## Vetcove is super easy to use! We love the fact that it compares prices for us so we know we are always getting the best deal for our practice.\\nMichele Jourdan, AVA, CVPM\\nClyde Park Veterinary Clinic | Wyoming, MI\\n## I have found that this is a very user friendly web app, analogous in many ways to Kayak as one would search fares. My main suppliers are represented in the distributor list. I recommend this to all vets just going into their own practice.\\nRobert Spiegel, DVM\\nAnimal Clinic of Oceanway | Jacksonville, FL\\n## Thank you Vetcove for taking the time to compare my distributors so I can focus on other tasks.\\nKelly\\nDavis Ford Animal Hospital | Woodbridge, VA\\n## As a solo practitioner of a start-up vet hospital, I was overwhelmed by many tasks, including ordering. Not only has it helped save time, but also helped my budgeting. Thank you for all you do!\\nRieko Tran, DVM\\nPearl Veterinary Hospital | Triangle, VA\\n## I’m very happy with Vetcove. It saves me time because I\\'m spared from the legwork of comparing vendors myself. It also gives me a better idea of the range of products available.\\nJohnathan Augusto, DVM\\nMilford Animal Hospital | Milford, MA\\n## I really enjoy the ease it has made my ordering! Thank you so much Vetcove team.\\nMelissa Unzicker\\nFamily Pet Hospital | Platteville, WI\\n## Vetcove has been a huge time saver for me when ordering! I no longer have to check multiple sites for the best price or to find an item if it is back ordered. I also love that I can check out directly from the site instead of going to multiple web pages. If you aren\\'t using Vetcove, you are wasting time and money!!\\nAshley Willis\\nBasin Run Animal Hospital | Colora, MD\\n![](https://media.vetcove.com/static/img/corporate/testimonialmap.png)\\n[ See how clinics are using Vetcove to simplify their ordering ](https://www.vetcove.com/</customers/>)\\n# Frequently Asked Questions\\n## Visit our [support](https://www.vetcove.com/<http:/help.vetcove.com>) page to view all our FAQs\\n### Is Vetcove compatible with my suppliers?\\n**Vetcove supports nearly all major veterinary vendors** in the United States, including distributors, manufacturers, diagnostic laboratories, compounding pharmacies, and office supply companies. You’ll be able to see which vendor accounts you can add once you sign up. If you have questions, email us at support@vetcove.com, or chat with us using the chat bubble at the bottom-right of our website. \\n### Will I still get my negotiated, GPO, or corporate pricing?\\n**Vetcove fully supports all special pricing** , including buying group deals, corporate group negotiated deals, and special pricing provided by your representatives. Once you add your vendor account to Vetcove, your special pricing with that vendor will automatically be reflected on Vetcove. You’ll still qualify for all rebates, promotions, and loyalty programs with your vendors, too! \\n### Is Vetcove a distributor? Is it a buying group?\\n**Vetcove is neither a distributor, nor a buying group.** We don’t buy and resell products, and we don’t negotiate deals on behalf of our members. Vetcove is a purchasing platform that helps clinics order smarter and easier from the suppliers they already use. You still qualify for all vendor promotions and rebates, and there are some additional Vetcove-exclusive deals too to help you save even more. \\n### Why is Vetcove free?\\n**Corporations pay, so that independently-owned veterinary practices don’t have to.** Vetcove provides rich content listings, payment processing, and order management capabilities to manufacturers that sell direct on Vetcove. Vetcove will never charge veterinary organizations to use Vetcove. Read more about [Why It’s Free](https://www.vetcove.com/</why-is-it-free/>) and [Vetcove’s commitment to veterinarians](https://www.vetcove.com/</about/>). \\n### Do I have to change who I order from?\\n**Of course not! You keep your suppliers and relationships** Vetcove is a purchasing tool that brings all of your existing vendors into one platform to make purchasing faster and easier. You still order from the vendors you know and trust, with the same pricing, shipping, billing, and support you’re used to. Your representatives will still receive their commissions, and your relationships with them will not be impacted at all. When you use Vetcove, the only thing that really changes is your purchasing experience–which becomes a whole lot better! \\n### Do I have to add my vendor accounts to use Vetcove?\\n**Yes, you must add your vendor accounts to use Vetcove.** Suppliers charge different prices to each clinic, even for the exact same items. The pricing you see on each vendor’s website is specific to your practice, depending on whether you’re a part of a GPO or corporate consolidator, or have negotiated a particular pricing tier with your rep. By adding your supplier accounts, Vetcove can display your clinic’s own unique prices and local stock information while you shop, and allows you to place orders with your vendors through Vetcove. \\n## [ See how Vetcove works  From price comparison to order management, Vetcove makes ordering a breeze. Learn all the ways Vetcove can be used to simplify your purchasing.  ](https://www.vetcove.com/</product/>)\\n## [ Who\\'s Using Vetcove?  Over 19,000 clinics use Vetcove on a daily basis to make ordering easier. See how these clinics use Vetcove to simplify their ordering.  ](https://www.vetcove.com/</customers/>)\\n# Ready to get started?\\n## Sign up (it\\'s free) in under 60 seconds, or schedule a live demo to see how it works.\\n[ Schedule a Demo ](https://www.vetcove.com/</schedule/>) [ Get Started ](https://www.vetcove.com/</signup/>)\\n[ ](https://www.vetcove.com/</home/>)\\n## Veterinary Supply Starts Here.\\n[ ](https://www.vetcove.com/<https:/www.facebook.com/vetcove>) [ ](https://www.vetcove.com/<https:/angel.co/vetcove>) [ ](https://www.vetcove.com/<https:/www.linkedin.com/company/vetcove>) [ ](https://www.vetcove.com/<http:/www.twitter.com/vetcove>)\\n# Product\\n[Explore Product](https://www.vetcove.com/</product/>)\\n[Who\\'s using Vetcove?](https://www.vetcove.com/</customers/>)\\n[Why is it free?](https://www.vetcove.com/</why-is-it-free/>)\\n# Company\\n[About Vetcove](https://www.vetcove.com/</about/>)\\n[Careers](https://www.vetcove.com/</careers/>)\\n[Support](https://www.vetcove.com/<http:/help.vetcove.com>)\\n[Contact](https://www.vetcove.com/</contact/>)\\n# Resources\\n[Privacy](https://www.vetcove.com/</privacy/>)\\n[Terms](https://www.vetcove.com/</terms/>)\\n[Sellers](https://www.vetcove.com/</sellers/>)\\n[Brand Assets](https://www.vetcove.com/</assets/>)\\n# Contact\\n382 NE 191st St. PMB 46115\\nMiami, FL 33179\\n**support@vetcove.com**\\n646.504.2696\\nCopyright © 2025 Vetcove Inc. All rights reserved. \\nA Y Combinator Company - Made with with our 🐾 friends \\n' markdown_with_citations=' ⟨1⟩\\n Product ⟨2⟩\\n How it Works ⟨2⟩  Cash Back Deals ⟨3⟩  Hospital Groups ⟨4⟩\\n Who\\'s Using ⟨5⟩  Why Free? ⟨6⟩\\n About ⟨7⟩\\n About Vetcove ⟨7⟩  Support ⟨8⟩  Cove Crew ⟨9⟩  Careers ⟨10⟩\\n Login ⟨11⟩  Signup ⟨12⟩\\n ⟨1⟩\\n How it Works ⟨2⟩  Cash Back Deals ⟨3⟩  Who\\'s using Vetcove? ⟨5⟩  Why is it free? ⟨6⟩  About Vetcove ⟨13⟩  Cove Crew ⟨9⟩  Support ⟨14⟩  Careers ⟨15⟩\\nLogin⟨11⟩\\nSignup⟨12⟩\\n New The AVMA and Vetcove have teamed up to launch AVMA Direct Connect ⟨16⟩\\n#  Purchasing for your vet hospital? Shop every supplier at once. \\n##  Cut ordering time in half and save on supplies with the vendors you already use. Completely free to veterinary clinics & nonprofits. \\n Explore Features ⟨2⟩  Get Started ⟨12⟩\\n# Enrofloxacin Inj.\\n## 20ml (2.27%)\\nOut of Stock \\n-\\nOut of Stock \\n-\\nIn Stock \\n-\\nIn Stock \\n-\\n# Carprofen Caplets\\n## 75mg, 180 Count\\nIn Stock \\n$46.10\\nAlt Warehouse \\n$48.92\\nOut of Stock \\n$56.00\\nIn Stock \\n$51.23\\n# Lactated Ringers\\n## 1 Liter Bag, 12 Count\\nIn Stock \\n-\\nIn Stock \\n-\\nIn Stock \\n-\\nIn Stock \\n-\\n# Amoxicillin Caps\\n## 500mg, 500 Capsules\\nOut of Stock \\n-\\nAlt Warehouse \\n-\\nIn Stock \\n-\\nIn Stock \\n-\\n# Acepromazine Inj.\\n## 50ml (10mg/ml)\\nIn Stock \\n-\\nIn Stock \\n-\\nOut of Stock \\n-\\nIn Stock \\n-\\n# Enrofloxacin Inj.\\n## 20ml (2.27%)\\nOut of Stock \\n-\\nOut of Stock \\n-\\nIn Stock \\n-\\nIn Stock \\n-\\n# Carprofen Caplets\\n## 75mg, 180 Count\\nIn Stock \\n-\\nAlt Warehouse \\n-\\nOut of Stock \\n-\\nIn Stock \\n-\\n##### Official purchasing platform of trusted veterinary organizations\\n ![AVMA⟨17⟩ ](https://www.vetcove.com/</avma/>)  ![AAEP⟨18⟩ ](https://www.vetcove.com/</aaep/>)  ![AAFP⟨19⟩ ](https://www.vetcove.com/</felinevma/>)\\n# How it Works\\n## Getting started is quick and easy\\n1\\n# Add Your Suppliers\\nAdd your web accounts with all major veterinary vendors. Your special and GPO pricing is fully supported, and prices always match your suppliers’ websites. \\n2\\n# Compare Pricing & Availability\\nSearch all supplier catalogs at once to find the best products. See pricing, what\\'s in stock, and promotions in real time from all suppliers, customized for your clinic. \\n3\\n# Add To Cart\\nAdd items to your suppliers’ carts, and manage them all at once, right from Vetcove. When you finish shopping, complete checkout without leaving Vetcove. \\nAdd  Connected \\nAdd  Connected \\nAdd  Connected \\nAdd  Connected \\nAdd  Connected \\nAdd  Connected \\n# Built for Veterinary Purchasers\\n## Inventory Managers: You’re going to love Vetcove\\nWhether you’re new to inventory, or an experienced purchaser, you’re going to love Vetcove. Your days of juggling dozens of websites and phone calls are history! \\n# Over **19,000** veterinary hospitals trust Vetcove for their purchasing\\n## I really enjoy the ease it has made my ordering! Thank you so much Vetcove team.\\nMelissa Unzicker\\nFamily Pet Hospital | Platteville, WI\\n## Vetcove has been a huge time saver for me when ordering! I no longer have to check multiple sites for the best price or to find an item if it is back ordered. I also love that I can check out directly from the site instead of going to multiple web pages. If you aren\\'t using Vetcove, you are wasting time and money!!\\nAshley Willis\\nBasin Run Animal Hospital | Colora, MD\\n## I can\\'t say enough great things about Vetcove. The ability to compare prices instantly has saved us a LOT of money. Also, with a few key strokes, you can see if a product is on backorder, and potentially when it will be released.\\nElizabeth Cox\\nWestwood Animal Hospital PLC | Staunton, VA\\n## Vetcove has absolutely changed the way I do ordering- in a good way! Price shopping has gone from a mundane task to an exciting experience. Sticking to a budget has never been easier and I have never been more efficient.\\nSue Hutton, Hospital Administrator and Veterinary Consultant\\nAnimalia Veterinary Hospital | Franklin, TN\\n## Vetcove has been a real time saver for us. Instead of opening multiple tabs, typing (and retyping) product names, looking at the price, clicking back to see the other distributor\\'s price, etc, we now have one window open to Vetcove. All our distributors are there, with any special pricing pre-loaded. Quick and simple to compare prices. They even break it down to per tab price! Fantastic!\\nMichael Goldmann, DVM\\nNanuet Animal Hospital | Nanuet, NY\\n## Such an easy and essential time saver for our practice. I can\\'t imagine going back to the old site by site comparison that we used to do! You guys are great, and it\\'s been such a wonderful tool for our hospital to use. I love the forums as well!\\nThe Bristol County Veterinary Hospital Team\\nBristol County Veterinary Hospital | Seekonk, MA\\n## I love the community feel of Vetcove and the opportunity for managers to discuss products or issues. The organization Vetcove brings to inventory and ordering, making sure I am getting a product I ordered before and providing accurate history and prices, as well as the updates on backorder or alternate stocking.. extremely helpful, and easier to read than the vendor websites.\\nMonica Saunders\\nAnimal Clinic of Rockford | Rockford, IL\\n## As a solo practitioner of a 3 year old startup, I am always trying to keep costs down. With Vetcove, I now have the ability to do that while saving at least an hour a week. It\\'s so easy. I am so thankful that Vetcove is free for vets to use. The money I save and the extra time I have now are priceless to my young family. You guys rock!\\nEricka Yeley, DVM\\nFarm & Family Veterinary Service | Marshall, IL\\n## When I first started ordering products, I was a bit overwhelmed. Sorting through each item we needed took me hours. But since we started an account with Vetcove, it\\'s been a breeze to find which supplier to use! The site is very easy to navigate, and I\\'m constantly saving money through the instant price comparison. 100% would recommend!\\nKatie, Retail Manager\\nBlue Sky Animal Clinic | Loveland, CO\\n## Vetcove has hands-down made inventory management easier. It is quicker to order, faster to see who has products in stock and who has them on promotion, and track who we have been buying what from. We still visit with and support our reps, but I have a much better idea about where I should get items from (and how many)!\\nAlex Flinkstrom, Office Manager\\nLunenburg Veterinary Hospital | Lunenburg, MA\\n## Vetcove is a fantastic tool for any practice. The ability to quickly compare prices from different vendors is great by itself, but the developers have gone above and beyond with the purchase history analytics. We\\'ve been using Vetcove for two years now and it just keeps getting better and better.\\nHenry James, Practice Manager\\nAnimal Hospital of Pasco | Pasco, WA\\n## We love Vetcove!! It has completely changed the way we order and track purchasing. So much time and money saved!! Thank you Vetcove!\\nRebecca I, LVT\\nAnimal Medical Clinic of Goose Creek | Goose Creek, SC\\n## I am very thankful to have Vetcove in my life! This site saves me so much time not having to go back and forth to my different vendors. Inventory is a lot easier and faster now. I also like that there is a discussion board over many topics, it’s very helpful to reach out to other inventory managers.\\nAshley Ortiz, LVT\\nGulf Coast Veterinary Specialists | Houston, TX\\n## Purchasing and inventory management without Vetcove is like using dial-up internet in today’s world. This website is absolutely indispensable. There are so many valuable features and it is all FREE. I urge everyone to take full advantage of this amazing website; you won’t ever go back to your old methods.\\nCathy Davis, LVT\\nUpstate Veterinary Specialists | Greenville, SC\\n## Vetcove is by far the best company I work with. The amount of money and time I save is incredible. I can\\'t imagine practice life without them!\\nEmily Gordon, LVT\\nAutumn Trails Veterinary Center | Charlottesville, VA\\n## Our practice is currently updating our inventory guidelines, tracking, and ordering procedures. Vetcove has made it so much easier. Since cost is always a concern, it is so nice that this service is offered for free. Best new technological contribution to our field in awhile!\\nSamantha Riddels, DVM\\nLange Veterinary Hospital | Sherman, TX\\n## I can\\'t imagine the past 2 years without Vetcove. It absolutely has made ordering and maintaining my inventory much easier.\\nDr. Deb Robertson\\nSouth Bay Mobile Vet | Manhattan Beach, CA\\n## Prior to Vetcove, I would open multiple distributor websites and browse from one to another and back again. It took me hours to compare and select the best prices. Vetcove made it possible to view all my distributors in one location and truly compare prices. It eliminated the time I used to have to spend researching for sales and the best prices.\\nKelly Spagnoli, Practice Manager\\nAvalon Veterinary Clinic | Orlando, FL\\n## I love being able to see my pricing on all my distributors without having to go back and forth between websites. I like that most products are broken down into a per tab/cap price. It makes price comparisons easier.\\nBrandy Tabor, RVT\\nMeeker Animal Hospital | Meeker, OK\\n## Thank you for your fantastic customer support! I feel like an individual, rather than \"just another client\". They really take the time to help find a solution and genuinely value client suggestions. This personal touch brings me back to Vetcove every time.\\nJennifer Compton, LVT\\nCNY Veterinary Medical Services | Westmoreland, NY\\n## I LOVE Vetcove! Vetcove has really transformed my ordering process. Now I can easily and quickly see what other options of generics, prices and deals going on with seven different distributors at once! Vetcove also has a awesome support staff that I can quickly chat a question and get help in minutes. I don\\'t know how I handled ordering before Vetcove.\\nJodi See\\nNorthrock Hospital for Animals | Witchita, KS\\n## I LOVE Vetcove! Prior to Vetcove, I had tabs open for each of our distributors and would log in to each one and search their sites individually for most items that I needed to order. Now Vetcove does that for me, freeing up precious time to do other things!\\nMike Pope, DVM\\nDarien Animal Hospital | Darien, GA\\n## Vetcove has been a Godsend. I was skeptical at first. I didn\\'t really think this would save me time or money. The ease of ordering from my 3 top distributors has been pleasantly surprising. I like the ability to see all my shopping carts at once. I enjoy the other aspects of Vetcove as well, such as the order history and invoice look up features. Thank you for creating such a valuable site.\\nAngie Werth\\nGentle Doctor Animal Hospital | Omaha, NE\\n## Vetcove has been a lifesaver with ordering inventory. I used to have to price shop between 3 different distributor sites which took way too much of my time. This saves me so much time AND keeps my budget to a minimum!\\nKirsten Friedrichs, Practice Manager\\nFinan Animal Hospital | Darien, IL\\n## Vetcove has drastically decreased the amount of time it takes me to order supplies. It is so easy! I would recommend it to anyone! I love using Vetcove and it is my first thing I go to when ordering! Thank you for making such a great site!\\nStephanie La Tour\\nMahomet Animal Hospital | Mahomet, IL\\n## We absolutely love using Vetcove! It has made our jobs so much easier having all our vendors on one screen when searching items. Would highly recommend Vetcove to anyone who is looking for a more efficient way of stocking their practice.\\nRachel Brown, CVT\\nHaslet Veterinary Clinic | Haslet, TX\\n## Vetcove is the best! It has literally saved hours of my week by streamlining all my vendors into one, easy to use site. The staff at Vetcove is wonderful too. Overall it\\'s an A+ site! It\\'s the only way I shop anymore.\\nLuke, Practice Manager\\nLenox Hill Veterinarians | New York, NY\\n## I love Vetcove! I order inventory for 2 large veterinary practices and from multiple distributors. It is hard to remember what, when & how much I ordered. Through Vetcove, I save a lot of time and money. I can easily hover over order history and check if I recently purchased an item. No more ordering inventory that is already here & overlooked! LOVE LOVE LOVE!!!\\nMika H\\nSouthern Veterinary Partners | Statesboro, GA\\n## Vetcove makes it easier to price compare and shop multiple vendors at once. I love using it and would never want to order without it.\\nJessica B.\\nWilson Veterinary Hospital | North Salt Lake, UT\\n## Vetcove is awesome! It truly offers the best way to see which of your distributors have availability of an item at a quick glance. With all the chronic back orders of so many products, this is truly the quickest way to find what you need and get it on its way without making 4 phone calls or checking 4 websites.\\nLorrie Powalski, LVT\\nMt. McKinley Animal Hospital | Fairbanks, AK\\n## I was new to inventory and Vetcove really helped me adjust from being a tech to an inventory manager. To have one place I can compare prices, order and find out answers to questions I have is amazing. It really is an amazing tool.\\nSamantha\\nBroadview Animal and Bird Hospital | Seven Hills, OH\\n## Your website has become a huge asset for our ordering department. It simplifies the process, drastically cuts down on time, and above all - saves us money. The customer service has been amazing and extremely responsive. We absolutely LOVE this website!\\nJohn Curry\\nClearwater Marine Aquarium | Clearwater, FL\\n## Vetcove has been a time and money saver for our clinic. I do all our ordering via Vetcove. Being able to compare pricing and check out with all of our distributors in one location has been the most amazing thing! I would never go back to the way we use to order.\\nGeorgia Carter\\nWasilla Veterinary Clinic | Wasilla, AK\\n## With Vetcove, comparing prices between distributors is a breeze. Shop, purchase, check out all in one place.\\nStacey McKnight, CVPM\\nFairview Animal Hospital | Ellenwood, GA\\n## Vetcove has been a wonderful tool for ordering our weekly inventory. It is fantastic to have all the products and pricing in one location. This has DEFINITELY streamlined our system.\\nDanette Manning, LVMT\\nBlue Oasis Pet Hospital | Mt. Juliet, TN\\n## I have been in charge of my hospital\\'s inventory for the past 15+ years. At first I thought Vetcove sounded too good to be true, but I am SO glad I pursued it! WHAT A TIME SAVER! No more phone calls, no individually checking separate websites, no wasted time. All answers are at your fingertips...Simply brilliant.\\nDawn Frentzel\\nAnimal Medical Clinic of Wheaton | Wheaton, IL\\n## Vetcove allows me to compare products/pricing to make the smartest purchases for our practice. Product reviews let me share my first-hand experience with products that might be helpful to other clinics. I love the discussion boards! It\\'s so nice to be able to share ideas!\\nCaitlin\\nPoland Veterinary Centre | Poland, OH\\n## Vetcove has revolutionized the way our hospital locates and orders goods. We are able to quickly check pricing against vendors, look at trends in ordering and take advantage of promotions and deals. This has helped us cut costs and decrease the amount of time spend researching and ordering.\\nSam, LVT\\nMaine Veterinary Medical Center | Scarborough, ME\\n## We are still relatively new to ordering with Vetcove, but we don\\'t want to remember a day with it! Vetcove has made the ordering process so simple and organized from immediate price comparisons, to details on each and every product as well as order history. As a team, we have the utmost trust for Vetcove and we highly recommend it, to say the least.\\nDemy & Maggie\\nEureka Veterinary Hospital | Miami, FL\\n## I think this site is great. I recommend it all the time. It has saved me so much time and money!\\nAlison M.\\nSacramento Zoo | Sacramento, CA\\n## The ability to compare all of our available products and pricing in one place is indispensable. Finding alternatives through distributors is time-consuming. But with Vetcove, it\\'s instant! Thank you Vetcove for saving our business so much time in ordering inventory! This is the future of veterinary inventory management.\\nJamie Branham, CVT\\nThe Little Animal Hospital | Port Washington, WI\\n## Vetcove has been a game changer for me! It is incredibly simple, and saves me time and money. Having the ability to compare prices at my fingertips has made a significant impact to our practice!!\\nRachel\\nFrankfort Animal Care Center | Frankfort, IL\\n## Vetcove saves me so much time each week. I no longer have to float between the different distributor sites looking for product/prices. The Vetcove staff has been very helpful with any questions, and the discussion boards are a great source of information as well.\\nJess\\nEvans Family Pet Care | Marshall, MN\\n## I’ve been ordering inventory for over 17 years, and every rep tells me that their pricing is great, the best, etc. Now I no longer have to wonder. I log into Vetcove, type in what I want, and I KNOW which distributor gives me best price. I’m saving time, money and I have an unbelievably convenient way to order... If I have a problem, they respond real time, immediately!!!! Love them!!!\\nKaty Joyce, CVT, Hospital Manager\\nPond Point Animal Hospital | Milford, CT\\n## Vetcove is an asset to the veterinary community! It has made my job as inventory manager so much easier and it\\'s easy to save the hospital money with comparisons at your fingertips. The message boards are a great way to get insight from colleagues!\\nSean\\nMid North Animal Hospital | Chicago, IL\\n## Vetcove has been really helpful for us both in technical support and inventory control! Keep up the good work :)\\nJennifer Compton\\nCentral New York Veterinary Medical Services | Westmoreland, NY\\n## I love having current pricing and availability at my fingertips! Being able to price shop and arrange my orders within the shopping carts to satisfy various distributor agreements is great! Online access to various distributor catalogs has saved me so much time and headache!\\nJennifer O.\\nExclusively Cats Veterinary Hospital | Waterford, MI\\n## The amount of time we save ordering is priceless. Price shopping, sourcing backordered products, reviewing previous purchases, and highlighting specific promotional items, all in one easy to use site...We are thrilled with Vetcove!\\nChris Rehm, DVM\\nRehm Animal Clinic | Loxley, AL\\n## Vetcove makes ordering easy, and they have amazing deals!\\nJustin De Sola\\nAstoria Animal Society | Astoria, NY\\n## Vetcove has been an absolute game changer for SF SPCA since we began using it in late 2015. The cost to Veterinarians is nothing, but the benefits are enormous. This tool has been so important to our work; I think it would significantly help any nonprofit or small vet practice just as much as it helps us, possibly even more.\\nSusan Reeves, Director SF SPCA Supply Chain\\nSan Francisco SPCA | San Francisco, CA\\n## Vetcove is a game-changer! This web site has saved me time AND money! Plus I\\'m able to see what\\'s in stock and anticipate delivery delays. It\\'s super easy to navigate and I absolutely love the community forum they\\'ve added–so helpful! I wish there were a Vetcove for every aspect of life. I don\\'t know why you wouldn\\'t use it!?\\nMeghan S. Bingham\\nWest Alabama Animal Clinic | Houston, TX\\n## I LOVE Vetcove! It has made the headache of comparing prices so much easier. I also love how you can add the products to your cart on Vetcove and it automatically redirects you to the distributors website to place your order when you are ready. Very awesome website that is actually helpful and saves you time!\\nAlyssa Richards, RVT\\nConley & Koontz Equine Hospital | Columbia City, IN\\n## We had been putting off using Vetcove for some time. I decided to give it a try and we are so happy with the service. It makes price shopping so easy and the site is so user friendly. Highly recommend this to anyone who price shops. Thank You Vetcove!!\\nBernie\\nEarly Winter Equine Medicine and Surgery | Lansing, NY\\n## Direct Connect (Powered by Vetcove) has revolutionized our product purchasing by allowing us to rationally compare pricing and product characteristics across multiple suppliers. It’s the best inventory control tool yet devised in veterinary medicine and a wonderful workload reducer for our staff. Keep up the great work!\\nArnold L. Goldman DVM, MPH, CEM\\nCanton Animal Hospital LLC | Canton, CT\\n## Where has Vetcove been all my life?! I cannot believe how much time and money I save by price shopping all of my distributors on one user-friendly website. The website design is beautiful and is my go-to every single day for ordering. But what sticks with me most is their outstanding and personal customer service!\\nCaitlin Shaw\\nLyndon Veterinary Clinic | Fayetteville, NY\\n## I LOVE Vetcove! I used to spend so much time looking through each different distributor trying to find a medication and then trying to find the best price. This is one stop shopping and saves me so much time and there is no hassle. I just wish that I knew about this sooner!\\nDierdre Haley\\nMacDonald Veterinary Services | Gilford, NH\\n## Vetcove is so easy and convenient, all the products are in one place with all the pricing. You can see products that are out of stock and in different warehouse etc. Basically vetcove is amazing.\\nKeri\\nSt Francis Animal Hospital | Fredericksburg, VA\\n## I think that Vetcove is amazing!! I’ve already told a couple of other inventory managers about it as well! Thanks for the HUGE shortcut for my job!\\nKat Green\\nUpstate Veterinary Specialists | Greenville, SC\\n## Vetcove is absolutely a 5-Star must-have application for any busy vet practice. It has dramatically improved our ability to purchase at the best available price, and reduced the amount of time we spend performing purchasing tasks.\\nScott Carlin\\nAPC Veterinary | Tulsa, OK\\n## Vetcove is so awesome! It has cut my ordering times down by at least half. I love that they bring every one of my distributors up with price comparisons. I no longer have to have 4 tabs open while looking up who has what, and what the prices are.\\nMandy Jamerson\\nLake Forest Animal Hospital | Gaithersburg, MD\\n## I have utilized Vetcove for several years. It has been a tremendous tool for me to save time and money with sourcing medications or supplies that are on back order. In addition to price comparison, Vetcove is evolving and working to add additional value and support to its users.\\nBobby Becker\\nWoodlake Animal Hospital | Midlothian, VA\\n## The website is easy to use, and is a staple at our practice. Not only does it save me time with placing orders, but we are saving money by finding the lowest prices available. Thank you very much for making this excellent site available to us!!\\nSteve Askin, VMD\\nAnimal Welfare Society | West Kennebunk, ME\\n## Vetcove has been *extremely* helpful for me when I\\'m ordering. I used to have to open multiple pages at once, line them all up, search each one individually, and THEN compare pricing. Vetcove has spared me all the headache! Thank you!!\\nHannah Kienow\\nSafe Haven for Cats | Raleigh, NC\\n## It is so easy to search for the items needed and price match between your vendors all on one page. It\\'s simple, easy to use and just all around an awesome tool. I know if I ever have an issue the Vetcove team will be there to assist. I certainly would recommend Vetcove to anyone in an inventory position!\\nBrad Reynolds\\nSouth Carolina Veterinary Specialist and Emergency Care | Columbia, SC\\n## Vetcove has really become a vital tool that I check at least once a day! I love that all of my ordering information is in one place, so that I can easily find backordered items (if they are still being warehoused) at an alternate vendor. Pricing is right at your fingertips.The forums are so helpful!\\nTamara Fletcher\\nHeart of Chelsea Animal Hospital | New York, NY\\n## As a nonprofit we are constantly trying to find the best deal to better serve our shelter and clients. Vetcove has helped us to make smart buys and keep our prices low for the community so that we can better serve our mission.\\nAmanda Rosado\\nBrandywine Valley SPCA | Westchester, PA\\n## I used to go to all the vendor sites and compare prices, now Vetcove does this for me. Vetcove should develop the same program for Amazon, Target, and Walmart!\\nYoon Chay\\nTown & Country Veterinary Hospital | Media, PA\\n## This website is such a time saver for my position as finance and inventory manager! It enables me to efficiently check against 4 different distributors for pricing, availability and promotions! Thank you for this wonderful service!\\nJackie Ballay, Finance and Inventory Manager\\nErie Animal Hospital | Erie, PA\\n## Any time we need a new product, we look at Vetcove first to determine where to order and where we can get the best price. It has saved me hours of time. I can\\'t imagine my practice without it!\\nSarah S.\\nInverness Animal Clinic | Birmingham, AL\\n## I love Vetcove! It has made my ordering much easier. It has also helped me get my budget under control and track my order history with precision. Great site and a must have tool for incorporating an inventory management program.\\nAna Kiefer\\nSan Francisco Zoo | San Francisco, CA\\n## The amount of time saved placing orders, and money the hospital has saved in the first month, is amazing! It was very easy to set up my account and the ability to find products (and get the best price) is an Inventory Manager’s dream! I would recommend Vetcove for anyone who purchases for their hospital.\\nDanielle Muldoon\\nVeterinary Specialty Center of Delaware | New Castle, DE\\n## Vetcove has been an absolute time saver! I have been able to cut my ordering time in half. Being able to use the compare prices feature has saved us tons of money. I wish I had found it sooner.\\nBrandie Jacobia\\nCommunity Animal Hospital | Pocatello, ID\\n## Vetcove makes all my orders simple and efficient, and I know I am getting the best price. If you aren\\'t using them, you are paying too much for your inventory. They are also adding great new features like forums and product blogs, recall lists, and have an easy to use interface to track previous orders. This site is a blessing for any inventory manager.\\nBen Shindelus, LVT\\nSage Veterinary Care | Sparks, NV\\n## I absolutely love Vetcove. We\\'re a non-profit humane society where every penny counts. Vetcove has become my holy grail. I place my orders in 20 minutes instead of 2-3 hours. I would be devastated if it ever went away!\\nCourtney Werner, MBA\\nWomen\\'s Humane Society | Bensalem, PA\\n## We’re using Vetcove a lot, and it’s great! It almost makes shopping “fun” for our technician in charge of ordering. It\\'s definitely saving us some money too.\\nJoe Frost, DVM Owner\\nFrost Family Pet Clinic | Loves Park, IL\\n## Vetcove has benefited our practice as a one stop shop. So, my office staff can do other things in our practice besides talking to distributors and checking prices.\\nLaura DuVall Molony\\nGeorgia Equine Veterinary Services | Canton, GA\\n## I am so excited about Vetcove!! In the past, I felt like I spent more time bouncing from webpage to webpage to try and find the best deals, and would often end up working on my orders at home so I could at least be comfortable when I was trying to price check items! Your site is a game changer!!\\nLiz Gelhaar\\nWisconsin Humane Society | Racine, WI\\n## I absolutely love Vetcove here at Countrycare...The use of this website has actually changed my primary distributor as I can now see they are a more cost effective option for this clinic. I hope that Vetcove plans on sticking around for a while, because my entire protocol has changed here as an inventory manager because of it. Thank you!\\nKat Robertson, CVT\\nCountrycare Animal Complex | Green Bay, WI\\n## Vetcove is awesome! I am amazed at the fact that this such an easy way to compare prices. It\\'s a safe and legitimate website that does not cost anything, and has the best customer service of any online company I have ever dealt with!\\nJerrah King\\nPleasant Hill Animal Hospital | Pleasant Hill, OR\\n## I\\'ve been using it for months and I love it. Makes ordering so much easier since I don\\'t have to compare prices myself. It\\'s easy to train people to order when I\\'m off, since they don\\'t have to wonder which distributor they get what from. I also like the free samples.\\nLindsey Moyer, CVT\\nAnnville-Cleona Veterinary Associates | Annville, PA\\n## We\\'ve been using Vetcove all the time for over a year now. It\\'s a fabulous site that ensures we are getting our items for reasonable prices. It\\'s a great bargaining tool with the vendors too, because I can easily see what each vendor is charging for the same item!\\nKristen Anderson\\nCape Cod Veterinary Specialists | Bourne, MA\\n## I am very impressed with Vetcove. It has really revolutionized the way I look up products for our practice, thus saving us money! Thank you!!\\nKatlyn G.\\nAnimal Wellness Center of Buffalo Valley | Mondovi, WI\\n## I introduced Vetcove to our office manager. She came and thanked me right away because she absolutely loves it!! She said it is going to save her so much time. Thank you again!\\nShelly Martin, DVM\\nAdobe Veterinary Center | Tuscon, AZ\\n## I absolutely LOVE Vetcove! It has made ordering, locating hard to find items, and price comparisons a snap. We are saving time and money. It truly is amazing and I don\\'t think I could ever go back to ordering without it!\\nHeather Kilheeney\\nMill Creek Animal Clinic | Palos Park, IL\\n## I\\'m very thrilled with Vetcove! So far, it has cut down the time it takes to order our inventory, as well as keep costs in line by allowing us to see the price variance between our distributors, something we couldn\\'t readily see before. I also enjoy the conversations between users in Discuss!\\nPeg Gaven\\nUniversity Animal Clinic | Bradenton, FL\\n## Vetcove is the veterinarian’s “the miracle” program for doing it well! The ease of finding products surpasses individual distributor websites. If there is ever a question, it is amazing how quickly Vetcove responds and solves the question. I foresee Vetcove masterminding more useful additions to an awesome program and for this reason I am glad we are a part of the Vetcove family!\\nDelores Gockowski, DVM\\nNorth Ridge Veterinary SVC, LLC | Sturgeon Lake, MN\\n## It is easy to use and resulting in surprising savings. Companies that were not major suppliers of mine are getting more business. Very, very helpful!\\nPeter F. Veling, DVM\\nPalencia Pet Clinic | St. Augustine, FL\\n## We use Vetcove and love it! It makes it so easy to find the best price, and to locate some hard-to-find items or backordered items.\\nAaron Bessmer, DVM, Owner\\nElk Creek Animal Hospital | Souix City, IA\\n## This is a great product! We love it. I have shared it will all my friends and they also love it. It has saved us so much time and money!!! Thank you Vetcove team for providing such a money saving product for free!\\nZile Singh, DVM\\nGreenwood Animal Hospital | Seattle, WA\\n## It helps a great deal with time, organization and pricing. I would recommend Vetcove to any clinic looking to get the best deals on medications. Very quick and easy to operate. 5 stars!\\nRyan Hirt\\nPaces Ferry Veterinary Clinic | Atlanta, GA\\n## Vetcove is the best thing to happen to veterinary medicine in the last 5 years. We LOVE it! This website has made ordering easy, fast and saves us tons of money. We could never go back to the dark ages before Vetcove.\\nPaul Camilo\\nHometown Animal Hospital | Weston, FL\\n## I love Vetcove! The convenience of having everything all in one place is great, and I really appreciate not having to navigate a half-dozen different websites. In Vetcove, the interface is user-friendly and completely consistent. Vetcove is a tremendous time-saver, and I can\\'t imagine doing my ordering any other way!\\nLynda Reid, Practice Manager\\nCollege Avenue Animal Clinic | Levelland, TX\\n## I love the time I save not having to toggle back and forth between the vet suppliers!\\nRenee D., CVT\\nVet Neurology and Pain Management Center of NE | Wapole, MA\\n## Vetcove saves me so much time! I\\'m able to compare our vendors so I know I\\'m getting the best price! I use only Vetcove to order our supplies – it\\'s easy to use and it\\'s free! I love it!\\nLory\\nTLC Animal Hospital | Inverness, FL\\n## Vetcove is a game changer for the veterinary practitioner - especially for small practices. With Vetcove we have all our distributors consolidated into one location to search and choose the best price and product for the need. Vetcove has put purchasing power back in to the hands of the practitioner.\\nBen Character, DVM\\nMobile Veterinary Service | Eutaw, AL\\n## I really love your site. It has saved me so much time as I no longer have to check multiple vendors for prices before ordering! I was hoping someone would invent something like this! Since we discovered Vetcove, our life has been so much better. We can compare prices on one web site in seconds and place our orders through every company we use in a matter of minutes. Great invention. Great company!\\nShannon Miller, DVM\\nMiller Veterinary Services | Conyers, GA\\n## I just set it up and compared prices to invoices I have on my desk and it\\'s spot on. Love the ease of use and the PICTURES!!! Thank you! and congratulations on making a very useful tool.\\nSuzanne Butcher\\nTimber Creek Veterinary Hospital | Canyon, TX\\n## Vetcove has made ordering a much smoother and efficient process for us. Instead of comparing costs from one website to another, we can look at one site, cost compare, and order all within minutes!\\nNancy Bureau, DVM\\nLeft Hand Animal Hospital | Niwot, CO\\n## I absolutely love your site! It helps me order quicker and more efficiently. Thank you for offering such a great service!\\nBrad Seaman, DVM\\nGreenpoint Veterinary Hospital | Brooklyn, NY\\n## It took us awhile to try it out, but I have to tell you that you have saved me A LOT of time on my orders. I would open all my different distributors in different tabs and toggle between them all to compare the costs. Being part of a Humane Society and a low cost clinic, I can really help keep the costs low and keep going with our fast paced environment!\\nJanette Fetter, CVT\\nLongmont Humane Society | Longmont, CO\\n## It\\'s easy to navigate. It’s really nice to be able to see things in one place instead of having to have multiple web browsers open to look for the best price, or to look for something that is on backorder. Really glad this was developed!\\nKerry Balding, Practice Manager\\nThe Paw Patch Veterinary Hospital | Indianapolis, IN\\n## It make searching for products very easy and efficient. Readily available to asnwer questions, regarding products for my staff.\\nLogan C. Miller, CVT\\nDeer-Grove Veterinary Clinic | Cottage Grove, WI\\n## This has got to be one of the best programs I have seen in years!!!!! Very helpful and resourceful\\nYvonne\\nDallas Highway Animal Hospital | Powder Springs, GA\\n## I use Vetcove all the time and love it! It simplifies ordering by a hundredfold and saves me on average an hour per week or more ordering.\\nLisa Immerblum, LVT\\nGoldens Bridge Veterinary Care Center | Goldens Bridge, NY\\n## I am now using Vetcove for the past couple of months and I just love it. I can get things ordered in a jiffy, I am just so ecstatic about this new wonderful platform I cannot express in simple terms. Thank you very much!\\nDechamma Ballaranda, DVM\\nEast Detroit Animal Hospital | Eastpointe, MI\\n## I am amazed at how many options are available, and the pricing differences between the companies that we order from. The site is so easy to use, and is a definite time-saver and cost-saver!\\nJill Drinkwater, Office Manager\\nLancaster Vet Clinic | Lancaster, WI\\n## I love it! Vetcove has been a great time saver for comparing products against our different distributors. I really like that I can save lists so reordering the same product is simple and fast. Thank you for this great service!\\nMicha Piraino, DVM\\nStepping Stone Animal Society | Cumberland, MD\\n## I use Vetcove and I am very happy with it! I really like your reports and analytics. I always recommend Vetcove to all managers during meetings.\\nKasia Guzy, Hospital Administrator\\nBerkshire Vet | Pittsfield, MA\\n## It has made things very easy to be able to see all our vendors prices at one time. I like that the carts are saved and can be updated. The checkout process is easy. It sends us straight to the vendor\\'s site and the cart is uploaded automatically!\\nTheresa R.\\nAngel Animal Hospital | Naples, FL\\n## I have to say that I am LOVING Vetcove!! It has made finding the best deal on any items needed, very simple. I’m VERY happy with Vetcove and plan on continuing to use it for the future and growth of our hospital.\\nDeborah Fish\\nCinema Veterinary Centre | Santa Clarita, CA\\n## Vetcove has saved me a lot of time in comparison shopping across vendors. Its great!\\nSarah\\nLifetime Pet Center of New Richmond | New Richmond, OH\\n## Since I discovered Vetcove (I love that I can see the price comparisons) we have been able to save money. I have shared Vetcove with several people at a conference who are now using it. Keep up the good work!\\nP. Gonzalez, Hospital Manager\\nSanta Paula Animal Clinic | Santa Paula, CA\\n## I highly recommend Vetcove to everyone - it cuts down costs, especially if you only purchase from one place. There are some serious savings!\\nKeith Krempl\\nLancers Square Animal Clinic | Plano, TX\\n## I love it!! I absolutely love it! It saves so much time—and money! And it\\'s so easy.\\nJulie Cracolici, Inventory Manager\\nLebanon Equine Clinic | Lebanon, OH\\n## Vetcove is very user friendly. The price comparison is very helpful...It\\'s nice to see when products are on backorder and if someone else may still have some in stock. It has made online ordering even easier.\\nAnn Pawlak\\nThe Piedmont Equine Practice | The Plains, VA\\n## Your site has become indispensable! I use it every time I need to order. Congrats for coming up with the idea!\\nKenton Flaig, DVM, Owner\\nPortville Veterinary Clinic | Portville, NY\\n## Love the website! It\\'s very user friendly, and it really saves me a lot of time and the clinic money.\\nJennifer Wagner, CVT\\nAppanasha Pet Clinic | Menasha, WI\\n## Vetcove has added time to our day!! The ease of finding the least expensive option is right at our fingertips, Vetcove helps puts us in a much better position to communicate & negotiate with our vendors.\\nJay Wickham\\nPembroke Animal Hospital | Pembroke, MA\\n## Vetcove fast became a practice management bible of sorts. Complete product and supply lines for multiple distributors are available at your fingertips. Purchase history and order facilitation are made much simpler. Vetcove\\'s value is inestimable.\\nMichael P. Meaney\\nStamford Veterinary Center | Stamford, CT\\n## We have found Vetcove very easy to use. We use it to compare prices, of course, but also to track how often we are ordering items and how much we paid for them in the past. We can tell at a glance what is back ordered and what is available. I would recommend Vetcove to any hospital that wants to simplify ordering.\\nWendy C. Brooks, DVM\\nMar Vista Animal Medical Center | , None\\n## I love Vetcove! This has to be the most useful tool so far in veterinary medicine. Having access to all vendors at my fingertips in real time allows us to more effectively negotiate with our preferred vendors and improves our buying power.\\nDr. Ganon Harish, DVM\\nElmwood Small Animal Hospital | Buffalo, NY\\n## I love it, and I\\'ve told everyone I know on Facebook and practice manager groups. Thanks for creating such a useful site!\\nAmy Short-Jones, CVT\\nFox River Animal Hospital | Appleton, WI\\n## I have recommended this site to all my past places of employment , I love this site! I showed my boss and coworkers how to use Vetcove to order while I was away, and it made ordering very simple for them!\\nLisa Kowalski\\nGreen Road Animal Hospital | Cleveland, OH\\n## Vetcove is amazing, reduced my time spent placing my orders by 75%.\\nAnn Jayo, LVT\\nElko Veterinary | Elko, NV\\n## Vetcove has significantly reduced the amount of time I spend on ordering each week by allowing me to compare all my distributors in one place.\\nJennifer Bricker\\nEastern Maine Emergency Vet Clinic | Brewer, ME\\n## We really enjoy the \"one-stop shopping\" experience that Vetcove provides. Since we started using Vetcove we have saved both time and money when ordering the products we need most.\\nScott M. Stipe, Sr. D.V.M.\\nNoah\\'s Ark Animal Hospital | Fonda, NY\\n## I absolutely love Vetcove! It has helped to save so much time in my ordering process and simplified the teaching process for someone to step in and help me when I\\'m gone. Love it!!\\nMary Goble\\nWoodland Veterinary Hospital | Woodland, WA\\n## Vetcove makes ordering faster and easier. I love seeing purchase history and price comparisons. It is easy to allocate purchases between vendors if a distributor rep did something special for me.\\nDavid Hawkins, Practice Owner\\nDogwood Pet Hospital | Greshman, OR\\n## Using Vetcove has made my job a lot less time consuming. I love being able to go to one place to compare pricing instead of multiple websites!\\nNicole Burruss, Practice Manager\\nRed Barn Veterinary Hospital | Dahlonega, GA\\n## Vetcove is a lifesaver! No more having to check 4-5 different distributor websites! It is all there right in front of you! Thank you. If you aren\\'t using it yet, you should be :)\\nFred Davis, CVT\\nHilltowns Veterinary Clinic | Washington, MA\\n## Vetcove makes price comparisons easy. It finds what your looking for from each of your distributors and organizes it side by side so you can see what the best deal is, right away.\\nAmy Bradford, Office Manager\\nTrinity Animal Hospital | Weaverville, CA\\n## I use Vetcove exclusively....seriously the best website developed. I manage a 230k inventory and I am sure it has saved us money and time! I love it!\\nSiobhan Purser-Blackman, Purchasing Manager\\nCentral Hospital for Veterinary Medicine | North Haven, CT\\n## I didn\\'t have the time to compare prices across multiple websites, and I didn\\'t have the time to compare different products until I started using Vetcove. It has lowered my overhead costs and made ordering much easier.\\nKristian Shiver, DVM\\nAnimal Medical of Covington | Covington, GA\\n## Vetcove is incredible! They literally save me hours by helping us streamline our inventory process. In addition to time, they also help us save money by comparing all of our major vendors in one place. We would highly recommend them.\\nNate Crawford, Practice Manager\\nHannah\\'s Mill Animal Hospital | Thomaston, GA\\n## Vetcove is a miracle! It has saved me so much time and head aches when placing my weekly orders. I cannot imagine how I ever did it before Vetcove!\\nSheena Novick, CVPM\\nBeverly Oaks Animal Hospital | Sherman Oaks, CA\\n## It’s an awesome way to do everything in one spot. I love being able to compare numbers without having to jump around on different sites.\\nAli, Head Technician and Inventory Manager\\nSt. Louis Cat Clinic | St. Louis, MO\\n## It\\'s so convenient to go to one place to shop and get the lowest prices. Vetcove is a game changer.\\nJenny P.\\nNorth Boros Veterinary Hospital | Pittsburgh, PA\\n## I have grown to really love Vetcove. In the hectic rush of emergency Vetcove is a breath of fresh air when it comes to ordering.\\nLara, RVT\\nAnimal Urgent Care | Escondido, CA\\n## Vetcove is easy to use. I love that we customize our our orders. The support team is wonderful! My favorite thing about Vetcove is that it compares suppliers pricing, availability for each supplier, and the quick check out service!\\nKuuipo Betonio\\nAnimal Urgent Care of Fayetteville | Fayetteville, NC\\n## Vetcove is an incredibly helpful and easy to use tool for purchasing and tracking inventory! We love the ability to compare prices from all distributors in one convenient location.\\nApril Splawn, Hospital Owner\\nEbenezer Veterinary Hospital, LLC | Rockhill, SC\\n## I am so thankful that a friend told me about Vetcove. I always wondered if I was getting the best deal with each purchase but never had the time to compare prices on each distributor\\'s website. Now I know, and it’s so easy to use!\\nBonnie Abbott, DVM\\nVista Animal Hospital | Erie, CO\\n## Convenient! It\\'s very easy to find the products I need.\\nEYNC\\nC-Vet Animal Hospital | Naperville, IL\\n## Vetcove is a major process improvement to my position! The support and features that it offers are great and I would never want to “go back” to not relying on Vetcove for my daily duties! Thank you!\\nJacqueline Ballay\\nErie Animal Hospital | Erie, PA\\n## Starting a new practice we would have NEVER had the time to email or call each vendor for price checks for each product we use to pick a good match for us. This process would have been detrimental to our time management and financial budget. I cannot even imagine the impact that would have had on our success. Thank you for starting Vetcove well before we started a hospital!\\nLoretta Pesteanu\\nLoving Paws Animal Hospital | Brooklyn, NY\\n## I really love Vetcove! It has been a great help in managing inventory. It is very easy to look up information and saves me lots of time price shopping! Really happy to have it :)\\nFallon Ready\\nSpartan Animal Hospital | McFarland, WI\\n## LOVE IT! It\\'s easy, we save money, it\\'s quick, it\\'s personal (the owners of Vetcove are on any problem ASAP!)\\nKris Tajchman\\nWest Ridge Animal Center | Topeka, KS\\n## We are utilizing Vetcove and feel it saves us time. We like that the promotions pop up, and that we see if we have ordered from that vendor in the past. All good stuff!\\nMonique Pierpont, RVT\\nHarmony Animal Hospital | Jupiter, FL\\n## What a great tool! It makes ordering easier to get the best prices from vendors. How nice of you to share it for free! Love it!\\nBonnie\\nNorth Shore Animal Hospital | Duluth, MN\\n## My technician LOVES it! Thank you again for creating such a great service.\\nKimberlee Buck, DVM\\nFrankenmuth-Birch Run Veterinary Hospital | Birch Run, MI\\n## We are using it routinely and loving it! The search is easy, and we can compare prices instantly. I can\\'t think of anything I would change. Thanks for all of your hard work!\\nEva Beyer, VMD\\nSouth Mountain Vet Clinic | Phoenix, AZ\\n## Take 5 minutes to link your accounts, save yourself hours of work in the future. It REALLY is that easy with Vetcove!\\nAnn Frank, RVT\\nVeturgency | Frederick, MD\\n## Vetcove has been a very positive experience and has really simplified the ordering process. Instead of pulling up multiple websites of vendors that we purchase from, I call it \"one stop shopping\" through Vetcove.\\nBecky Vernon\\nMontclair Animal Hospital | Montclair, VA\\n## Vetcove is the easiest way to be sure you are getting the best pricing. It is also the perfect place to check on promotions and rebate programs! It has saved us so much money!\\nDani B.\\nMcClintock Animal Care Center | Tempe, AZ\\n## Vetcove saves me so much time. Before Vetcove I would have to do my ordering with four or five vendor windows open to find the best price and now it\\'s all on one screen.\\nCindy, CVT\\nCat Adoption Team | Sherwood, OR\\n## Vetcove has definitely been very useful!! This website has helped me spend less time ordering and made in sooo much easier to cut costs by being able to see the price for the same product from all my distributors. I have found things cheaper at opposite distributors than what I was getting for from my other one!! And it streamlines my ordering!\\nSara Hess, RVT\\nAsheville Veterinary Associates | Asheville, NC\\n## Vetcove is amazing and I use it every time I am going to order. I am a new start up so paying close attention to cost and any potential savings is huge. I would highly recommend Vetcove to any veterinary practice.\\nJessica Stumph, DVM\\nFirst Flight Mobile Veterinary Services | Kitty Hawk, NC\\n## One of the biggest frustrations of ordering is that no one supplier will ever be a on stop shop due to supply or widely differing pricing. Vetcove makes it easy to not only find what I need, but also see who has the best deal. I used to keep an excel sheet comparing all vendors which required updating 2-3 times a year. Vetcove has saved me hours of time!\\nRachel Wachter, RVT\\nSkylos Sports Medicine - Frederick | Frederick, MD\\n## I didn\\'t come from the vet field and Vetcove, their staff, and website has helped greatly in learning about products and pricing structure. Thank you! This has definitely helped me in learning about alternative items from other suppliers. It\\'s a great tool and I\\'m looking forward to using it in the future.\\nWendy Odgen, Inventory Supervisor\\nLas Vegas Veterinary Specialty Center | Las Vegas, NV\\n## Thanks for creating such an amazing website! Wish I would have found it sooner.\\nJamin Chenault, Practice Manager\\nRiverside Veterinary Hospital | Goode, VA\\n## We currently use Vetcove at both clinics and love it! I really like all the new features.\\nLauren Merrell, Practice Manager\\nTown East Galloway + Creek Crossing Animal Clinics | Mesquite, TX\\n## Vetcove is very user friendly. I enjoy doing all my shopping in one place. It makes ordering very quick and easy, and I love that you can compare prices all in one spot. It has saved me lots of time and money.\\nSierra Laskowski\\nHelena Veterinary Service | Helena, MT\\n## Vetcove lets me load all my carts, so I only have to go to my suppliers to checkout. I appreciate your efforts to make my job easier. Thank you for your hard work!\\nMichelle, Inventory Manager\\nOwen\\'s Ark Veterinary Clinic | Genoa, OH\\n## It took me less than 5 minutes to join, and the whole process was much easier than I thought. Make no mistake, the introduction and joining was well worth it. Vetcove is a valuable service that is totally free, and I recommend Vetcove to all the veterinary clinics.\\nAlbert Guirguis , DVM BVSc\\nRacetrack Animal Hospital | Tampa, FL\\n## Vetcove has been amazing so far! It has significantly cut down on our ordering time. Thanks again!\\nChanae Bowden, Clinical Manager\\nStapleton Veterinary Hospital | Denver, CO\\n## I love using Vetcove. It helps me find the lowest prices, and when things are on back-order somewhere I find an alternate supplier so easily... I like that it lets me know when I have a history of ordering the product from a supplier. It\\'s just great.\\nSarah Bloom\\nCoral Springs Animal Hospital | Coral Springs, FL\\n## Vetcove is like the Amazon of veterinary medicine! It makes bargain hunting a breeze!\\nBecky N., LVT\\nPresque Isle Animal Hospital | Presque Island, ME\\n## Vetcove is great for rapidly allowing me to price compare and find what I need\\nPilar Starman, DVM\\nLarkspur Pet Hospital | Larkspur, CO\\n## Love Vetcove! It cuts ordering time down by half!\\nMichele Ball\\nBack on Track Veterinary Hospital & Rehab Center | O\\'Fallon, MO\\n## Vetcove has helped to streamline the inventory process and save me valuable time.\\nDanielle T., Practice Manager\\nChippens Hill Veterinary Hospital | Bristol, CT\\n## We are very happy with the services you provide. It makes ordering from multiple distributors much easier.\\nGina Compton, RVT\\nWinchester Veterinary Clinic | Canal Winchester, OH\\n## Vetcove is a time and money saver. I love it.\\nBen Hendershott, LVT\\nPleasant Grove Animal Hospital | Texarkana, TX\\n## I love being able to go to one site and see price differences. It\\'s has saved me lots of money and time!\\nKira MacKinnon\\nEcho Ridge Veterinary Hospital | Evans, WA\\n## I have been using it and I love it! All of our distributors are in one place. It makes price comparisons very easy, as well as showing alternate products if something is not available.\\nJessica Best, CVT\\nPartridge Animal Hospital | St. Petersburg, FL\\n## I love Vetcove to check across the board pricing and availability on new products! It is very helpful to my medical team!\\nTerry G., RVT\\nBuckeye Veterinary Clinic | Akron, OH\\n## We love Vetcove. It makes ordering great and has saved us hundreds!\\nKristen Vance, DVM\\nHomeward Bound Mobile Vet | Bel Air, MD\\n## I visit Vetcove first and I don\\'t need to go to any other website to place my order. Good stuff!\\nBeth Hill\\nWestside Animal Clinic | Great Falls, MT\\n## Before I was forced to compare prices on 5 or 6 sites every time I ordered. Now when a price changes, boom - I can check if its cheaper somewhere else. When an item goes on backorder, boom - I can see who else has it.\\nKim Califano\\nColts Neck Equine | Colts Neck, NJ\\n## Excellent resource for making ordering less painful!\\nKevin Marecle, Owner\\nRussellville Animal Clinic | Russellville, AL\\n## Vetcove saves us time and money. I can find the best price on our products without searching through numerous websites.\\nShannon\\nPittsburgh Veterinary Dermatology | Pittsburgh, PA\\n## I love Vetcove. There is a lot of helpful information to complete my job thoroughly and easily!\\nJessica Stumph, DVM\\nDayton Care Center | Centerville, OH\\n## Vetcove is super easy to use! We love the fact that it compares prices for us so we know we are always getting the best deal for our practice.\\nMichele Jourdan, AVA, CVPM\\nClyde Park Veterinary Clinic | Wyoming, MI\\n## I have found that this is a very user friendly web app, analogous in many ways to Kayak as one would search fares. My main suppliers are represented in the distributor list. I recommend this to all vets just going into their own practice.\\nRobert Spiegel, DVM\\nAnimal Clinic of Oceanway | Jacksonville, FL\\n## Thank you Vetcove for taking the time to compare my distributors so I can focus on other tasks.\\nKelly\\nDavis Ford Animal Hospital | Woodbridge, VA\\n## As a solo practitioner of a start-up vet hospital, I was overwhelmed by many tasks, including ordering. Not only has it helped save time, but also helped my budgeting. Thank you for all you do!\\nRieko Tran, DVM\\nPearl Veterinary Hospital | Triangle, VA\\n## I’m very happy with Vetcove. It saves me time because I\\'m spared from the legwork of comparing vendors myself. It also gives me a better idea of the range of products available.\\nJohnathan Augusto, DVM\\nMilford Animal Hospital | Milford, MA\\n## I really enjoy the ease it has made my ordering! Thank you so much Vetcove team.\\nMelissa Unzicker\\nFamily Pet Hospital | Platteville, WI\\n## Vetcove has been a huge time saver for me when ordering! I no longer have to check multiple sites for the best price or to find an item if it is back ordered. I also love that I can check out directly from the site instead of going to multiple web pages. If you aren\\'t using Vetcove, you are wasting time and money!!\\nAshley Willis\\nBasin Run Animal Hospital | Colora, MD\\n![](https://media.vetcove.com/static/img/corporate/testimonialmap.png)\\n See how clinics are using Vetcove to simplify their ordering ⟨5⟩\\n# Frequently Asked Questions\\n## Visit our support⟨14⟩ page to view all our FAQs\\n### Is Vetcove compatible with my suppliers?\\n**Vetcove supports nearly all major veterinary vendors** in the United States, including distributors, manufacturers, diagnostic laboratories, compounding pharmacies, and office supply companies. You’ll be able to see which vendor accounts you can add once you sign up. If you have questions, email us at support@vetcove.com, or chat with us using the chat bubble at the bottom-right of our website. \\n### Will I still get my negotiated, GPO, or corporate pricing?\\n**Vetcove fully supports all special pricing** , including buying group deals, corporate group negotiated deals, and special pricing provided by your representatives. Once you add your vendor account to Vetcove, your special pricing with that vendor will automatically be reflected on Vetcove. You’ll still qualify for all rebates, promotions, and loyalty programs with your vendors, too! \\n### Is Vetcove a distributor? Is it a buying group?\\n**Vetcove is neither a distributor, nor a buying group.** We don’t buy and resell products, and we don’t negotiate deals on behalf of our members. Vetcove is a purchasing platform that helps clinics order smarter and easier from the suppliers they already use. You still qualify for all vendor promotions and rebates, and there are some additional Vetcove-exclusive deals too to help you save even more. \\n### Why is Vetcove free?\\n**Corporations pay, so that independently-owned veterinary practices don’t have to.** Vetcove provides rich content listings, payment processing, and order management capabilities to manufacturers that sell direct on Vetcove. Vetcove will never charge veterinary organizations to use Vetcove. Read more about Why It’s Free⟨6⟩ and Vetcove’s commitment to veterinarians⟨13⟩. \\n### Do I have to change who I order from?\\n**Of course not! You keep your suppliers and relationships** Vetcove is a purchasing tool that brings all of your existing vendors into one platform to make purchasing faster and easier. You still order from the vendors you know and trust, with the same pricing, shipping, billing, and support you’re used to. Your representatives will still receive their commissions, and your relationships with them will not be impacted at all. When you use Vetcove, the only thing that really changes is your purchasing experience–which becomes a whole lot better! \\n### Do I have to add my vendor accounts to use Vetcove?\\n**Yes, you must add your vendor accounts to use Vetcove.** Suppliers charge different prices to each clinic, even for the exact same items. The pricing you see on each vendor’s website is specific to your practice, depending on whether you’re a part of a GPO or corporate consolidator, or have negotiated a particular pricing tier with your rep. By adding your supplier accounts, Vetcove can display your clinic’s own unique prices and local stock information while you shop, and allows you to place orders with your vendors through Vetcove. \\n##  See how Vetcove works  From price comparison to order management, Vetcove makes ordering a breeze. Learn all the ways Vetcove can be used to simplify your purchasing.  ⟨2⟩\\n##  Who\\'s Using Vetcove?  Over 19,000 clinics use Vetcove on a daily basis to make ordering easier. See how these clinics use Vetcove to simplify their ordering.  ⟨5⟩\\n# Ready to get started?\\n## Sign up (it\\'s free) in under 60 seconds, or schedule a live demo to see how it works.\\n Schedule a Demo ⟨20⟩  Get Started ⟨12⟩\\n ⟨1⟩\\n## Veterinary Supply Starts Here.\\n ⟨21⟩  ⟨22⟩  ⟨23⟩  ⟨24⟩\\n# Product\\nExplore Product⟨2⟩\\nWho\\'s using Vetcove?⟨5⟩\\nWhy is it free?⟨6⟩\\n# Company\\nAbout Vetcove⟨13⟩\\nCareers⟨15⟩\\nSupport⟨14⟩\\nContact⟨25⟩\\n# Resources\\nPrivacy⟨26⟩\\nTerms⟨27⟩\\nSellers⟨28⟩\\nBrand Assets⟨29⟩\\n# Contact\\n382 NE 191st St. PMB 46115\\nMiami, FL 33179\\n**support@vetcove.com**\\n646.504.2696\\nCopyright © 2025 Vetcove Inc. All rights reserved. \\nA Y Combinator Company - Made with with our 🐾 friends \\n' references_markdown=\"\\n\\n## References\\n\\n⟨1⟩ https://www.vetcove.com/</home/>:  \\n⟨2⟩ https://www.vetcove.com/</product/>:  Product \\n⟨3⟩ https://www.vetcove.com/</deals/>:  Cash Back Deals \\n⟨4⟩ https://www.vetcove.com/</hospital-groups/>:  Hospital Groups \\n⟨5⟩ https://www.vetcove.com/</customers/>:  Who's Using \\n⟨6⟩ https://www.vetcove.com/</why-is-it-free/>:  Why Free? \\n⟨7⟩ https://www.vetcove.com/</about>:  About \\n⟨8⟩ https://www.vetcove.com/<http:/help.vetcove.com/>:  Support \\n⟨9⟩ https://www.vetcove.com/</ambassadors/>:  Cove Crew \\n⟨10⟩ https://www.vetcove.com/</careers>:  Careers \\n⟨11⟩ https://www.vetcove.com/</signin/>:  Login \\n⟨12⟩ https://www.vetcove.com/</signup/>:  Signup \\n⟨13⟩ https://www.vetcove.com/</about/>:  About Vetcove \\n⟨14⟩ https://www.vetcove.com/<http:/help.vetcove.com>:  Support \\n⟨15⟩ https://www.vetcove.com/</careers/>:  Careers \\n⟨16⟩ https://www.vetcove.com/</avma/>:  New The AVMA and Vetcove have teamed up to launch AVMA Direct Connect \\n⟨17⟩ https://media.vetcove.com/static/img/corporate/logos/avmalogo.svg:  ![AVMA\\n⟨18⟩ https://media.vetcove.com/static/img/corporate/logos/aaeplogo.svg:  ![AAEP\\n⟨19⟩ https://media.vetcove.com/static/img/corporate/logos/fvma.png:  ![AAFP\\n⟨20⟩ https://www.vetcove.com/</schedule/>:  Schedule a Demo \\n⟨21⟩ https://www.vetcove.com/<https:/www.facebook.com/vetcove>:  \\n⟨22⟩ https://www.vetcove.com/<https:/angel.co/vetcove>:  \\n⟨23⟩ https://www.vetcove.com/<https:/www.linkedin.com/company/vetcove>:  \\n⟨24⟩ https://www.vetcove.com/<http:/www.twitter.com/vetcove>:  \\n⟨25⟩ https://www.vetcove.com/</contact/>: Contact\\n⟨26⟩ https://www.vetcove.com/</privacy/>: Privacy\\n⟨27⟩ https://www.vetcove.com/</terms/>: Terms\\n⟨28⟩ https://www.vetcove.com/</sellers/>: Sellers\\n⟨29⟩ https://www.vetcove.com/</assets/>: Brand Assets\\n\" fit_markdown='' fit_html=''",
    "generated_description": "**Vetcove: Revolutionizing Veterinary Supply Chain Management**\n\nFounded in 2015 and part of Y Combinator’s Batch S16, Vetcove is based in Miami, FL, and has quickly established itself as a crucial player in the veterinary supply landscape. Their mission? To power the animal health supply chain for a community of over 18,000 veterinary hospitals that service millions of animals across the United States.\n\nVetcove began as a simple idea: to streamline how veterinarians purchase the supplies essential for keeping pets healthy. As of 2022, they are now the go-to purchasing platform for approximately half of the country’s veterinary clinics, including general practices, specialty and emergency clinics, SPCAs, and even zoos and aquariums. The company employs a team of around 83 individuals, all devoted to improving veterinary supply efficiency.\n\n**What Does Vetcove Offer?**\n\nVetcove's eCommerce and mobile platforms are designed to eliminate the friction traditionally associated with veterinary supply ordering. It significantly reduces the time practitioners spend comparing prices from various suppliers. Instead of juggling multiple websites, veterinarians can access one integrated platform where they can quickly browse products, compare prices in real-time, manage inventories, and even have medications delivered directly to pet owners' doorsteps. \n\nThe beauty here lies in its simplicity and efficacy—this allows veterinary clinics to focus more on what they do best: providing care to animals, rather than getting lost in purchasing logistics.\n\n**Why Is It Free?**\n\nA key aspect of Vetcove’s business model is that it’s completely free for veterinary clinics. This financial structure is supported by partnerships with corporations that utilize Vetcove’s data and analytics services, essentially letting independent practices access a sophisticated purchasing platform without any costs.\n\n**Growing Community and Feedback**\n\nWith over 19,000 veterinary hospitals using Vetcove regularly, the feedback from the community has been overwhelmingly positive. Users appreciate the time savings, ease of price comparison, and a plethora of other features that improve ordering efficiency. Many have remarked how Vetcove has transformed their procurement processes from tedious and time-consuming to quick and enjoyable.\n\n**Join the Vetcove Movement**\n\nIf you’re involved in veterinary care and are tired of the cumbersome ordering processes that detract from your practice, Vetcove might just be the tool you didn’t know you needed. They’re actively hiring, which speaks volumes about their growth potential and commitment to revolutionizing veterinary supplies.\n\nFor more details or to get started, visit their website at [Vetcove](https://www.vetcove.com). Embrace a smarter way to manage your practice’s inventory—after all, effective supply chain management is a significant part of providing excellent animal care!",
    "embedding": [
        -0.05697188526391983,
        0.0023406962864100933,
        -0.006532900966703892,
        -0.016230907291173935,
        -0.006256149150431156,
        -0.052013739943504333,
        0.006108028348535299,
        0.008731323294341564,
        -0.00903536006808281,
        0.07265708595514297,
        0.02493104711174965,
        -0.030746731907129288,
        0.007101995870471001,
        -0.025554712861776352,
        -0.004911369178444147,
        0.05235675722360611,
        -0.035205941647291183,
        0.02209336683154106,
        0.015092716552317142,
        0.0059910910204052925,
        -0.010828400030732155,
        -0.015412344597280025,
        0.028361208736896515,
        -0.013440001755952835,
        0.016605105251073837,
        -0.0073475646786391735,
        -0.007507378701120615,
        0.003749791532754898,
        0.00355684501118958,
        0.007226729299873114,
        0.03738877549767494,
        -0.00043705341522581875,
        0.005172529723495245,
        0.01863202080130577,
        0.019816985353827477,
        -0.002738283248618245,
        -0.005223202519118786,
        -0.03526831045746803,
        0.022405199706554413,
        0.035767242312431335,
        0.017322322353720665,
        -0.025040188804268837,
        0.0060729472897946835,
        0.025102553889155388,
        0.020284734666347504,
        0.02937466651201248,
        -0.024369746446609497,
        0.017634155228734016,
        -0.0028357310220599174,
        0.03380269557237625,
        0.012839722447097301,
        -0.002110719447955489,
        -0.007211137562990189,
        0.01577095314860344,
        0.006201578304171562,
        0.02159443311393261,
        0.028906917199492455,
        0.013478980399668217,
        0.029171975329518318,
        -0.029748866334557533,
        -0.05818803235888481,
        -0.013354247435927391,
        0.028548309579491615,
        -0.015848910436034203,
        -0.004069420509040356,
        0.06517308950424194,
        -0.014819862321019173,
        0.04253401979804039,
        -0.025102553889155388,
        -0.00468529062345624,
        -0.05413420498371124,
        0.023808447644114494,
        0.037950072437524796,
        0.023387473076581955,
        0.028922509402036667,
        -0.002276380779221654,
        -0.02293531596660614,
        -0.0008297680760733783,
        -0.012902089394629002,
        0.01662069745361805,
        0.043095316737890244,
        -0.021267009899020195,
        0.020955175161361694,
        0.019551927223801613,
        0.07334311306476593,
        0.015537078492343426,
        -0.035580143332481384,
        -0.10065968334674835,
        -0.0306999571621418,
        -0.009409559890627861,
        -0.036016710102558136,
        0.007526868488639593,
        0.0016624595737084746,
        -0.0011820418294519186,
        0.01764974743127823,
        -0.007671091239899397,
        -0.016184130683541298,
        -0.005106265190988779,
        -0.0011206497438251972,
        -0.0017374943709000945,
        0.002077587181702256,
        0.004346172325313091,
        -0.007589234970510006,
        -0.020612159743905067,
        -0.0506104938685894,
        -0.016651881858706474,
        -0.018055129796266556,
        0.03642209246754646,
        -0.04830292984843254,
        0.01422738004475832,
        0.05441485345363617,
        -0.05029866099357605,
        -0.007421624846756458,
        0.01241095270961523,
        0.01754060573875904,
        0.0021477495320141315,
        -0.03888557106256485,
        -0.020846035331487656,
        -0.029826823621988297,
        -0.030138656497001648,
        0.008458469063043594,
        -0.027020327746868134,
        -0.0033600004389882088,
        -0.014430071227252483,
        -0.01149884145706892,
        -0.009199072606861591,
        -0.014788678847253323,
        0.0020425058901309967,
        0.029889190569519997,
        -0.008193411864340305,
        -0.02942144125699997,
        0.0027343854308128357,
        -0.047835178673267365,
        -0.007355360314249992,
        0.031027380377054214,
        -0.022794989868998528,
        0.06579675525426865,
        0.013821996748447418,
        -0.0010193040361627936,
        -0.005987192969769239,
        -0.036858659237623215,
        0.021376149728894234,
        -0.04094367101788521,
        0.020674526691436768,
        -0.03508121147751808,
        -0.02990478277206421,
        0.0008200232987292111,
        0.020362693816423416,
        -0.01922450214624405,
        -0.014812066219747066,
        0.0032956846989691257,
        -0.05313633754849434,
        0.032492995262145996,
        -0.008318144828081131,
        0.03654682636260986,
        -0.022342832759022713,
        0.028485942631959915,
        -0.038667287677526474,
        -0.014531416818499565,
        -0.013120372779667377,
        0.03283601254224777,
        -0.049893274903297424,
        -0.02243638224899769,
        0.00800631195306778,
        0.02142292633652687,
        -0.000959860859438777,
        0.021797124296426773,
        -0.04811582714319229,
        -0.02572622150182724,
        0.02499341405928135,
        0.013323063962161541,
        -0.013338655233383179,
        -0.02008204348385334,
        -0.02862626686692238,
        -0.03402097895741463,
        0.010773829184472561,
        0.009425152093172073,
        0.004420232493430376,
        0.019754618406295776,
        -0.03620380908250809,
        -0.03101179003715515,
        -0.007768539246171713,
        0.015482507646083832,
        -0.007472297642379999,
        0.02931229956448078,
        0.046868495643138885,
        0.04546524956822395,
        -0.003677680157124996,
        0.012886498123407364,
        -0.009199072606861591,
        0.003342459676787257,
        -0.008629977703094482,
        0.032492995262145996,
        0.005780603736639023,
        -0.007273504044860601,
        0.007593133021146059,
        -0.014508029446005821,
        0.0307623241096735,
        0.01813308708369732,
        0.014944595284759998,
        0.010469792410731316,
        -0.030123066157102585,
        0.016277682036161423,
        0.03770060837268829,
        0.008014107123017311,
        -0.024837495759129524,
        0.01468733325600624,
        -0.005854664370417595,
        0.02627192810177803,
        -0.018725570291280746,
        -0.04350069910287857,
        -0.010750441811978817,
        -0.006544594652950764,
        0.02323155663907528,
        -0.006228863727301359,
        0.008209003135561943,
        0.011397494934499264,
        -0.058874066919088364,
        0.011561207473278046,
        0.01989494450390339,
        -0.021812716498970985,
        -0.008021903224289417,
        0.014352113008499146,
        -0.04543406516313553,
        0.02249874919652939,
        -0.015942461788654327,
        -0.009659026749432087,
        0.005137448199093342,
        0.06058914586901665,
        0.044685665518045425,
        -0.00029794665169902146,
        -0.024525662884116173,
        0.003777076955884695,
        -0.018460512161254883,
        -0.05397828668355942,
        -0.053354620933532715,
        -0.0015679352218285203,
        -0.027410117909312248,
        -0.014180604368448257,
        -0.003591926069930196,
        0.009004177525639534,
        0.005956009961664677,
        -0.023699305951595306,
        -0.008481857366859913,
        0.027456894516944885,
        0.019739028066396713,
        -0.02730097807943821,
        0.03302311152219772,
        0.0025258471723645926,
        -0.03732640668749809,
        0.0125590730458498,
        -0.014671741984784603,
        -0.019754618406295776,
        -0.012824131175875664,
        -0.008419490419328213,
        0.026895593851804733,
        0.02608482912182808,
        0.02711387723684311,
        -0.056628867983818054,
        0.05400947108864784,
        -0.017883621156215668,
        -0.026770861819386482,
        0.007047425489872694,
        0.07041188329458237,
        0.02045624330639839,
        -0.04764807969331741,
        0.023933181539177895,
        0.0007167286239564419,
        0.0196610689163208,
        0.017743296921253204,
        0.039166223257780075,
        0.0329919308423996,
        0.043656617403030396,
        -0.02875100076198578,
        0.06454942375421524,
        -0.028111742809414864,
        0.008209003135561943,
        0.010423017665743828,
        0.008279165253043175,
        -0.0005096520180813968,
        0.008279165253043175,
        -0.02603805437684059,
        0.03901030495762825,
        0.0007571694441139698,
        -0.04387490078806877,
        0.023465432226657867,
        0.035704877227544785,
        -0.06448706239461899,
        -0.02195304073393345,
        -0.04215981811285019,
        -0.011148029007017612,
        -0.009167889133095741,
        0.02633429504930973,
        -0.01570858620107174,
        0.05273095518350601,
        0.011327332817018032,
        -0.014242971315979958,
        0.04178562015295029,
        -0.07215815037488937,
        -0.019926127046346664,
        0.011935407295823097,
        0.014391091652214527,
        0.007495685014873743,
        -0.0001411775010637939,
        -0.005878051742911339,
        0.03002951480448246,
        -0.0077958242036402225,
        0.03317902982234955,
        0.0280337855219841,
        -0.028844550251960754,
        0.036796290427446365,
        -0.010688074864447117,
        0.006587471812963486,
        -0.016059398651123047,
        0.04315768554806709,
        0.0013340604491531849,
        0.005059489980340004,
        -0.012465523555874825,
        0.0011645013000816107,
        -0.007721764035522938,
        0.006778469309210777,
        -0.0032645014580339193,
        -0.04970617592334747,
        0.006614757236093283,
        0.010789421387016773,
        0.007979026064276695,
        0.01055554673075676,
        -0.01380640547722578,
        -0.007351462263613939,
        0.028064968064427376,
        0.0333661288022995,
        -0.006353596691042185,
        0.008380510844290257,
        0.02906283363699913,
        0.024588029831647873,
        0.01953633688390255,
        -0.02755044400691986,
        -0.02535202167928219,
        0.009752576239407063,
        0.004081114195287228,
        -0.01231740228831768,
        -0.007928353734314442,
        -0.016293272376060486,
        0.04627601429820061,
        0.01158459484577179,
        0.0040772161446511745,
        -0.0041590724140405655,
        -0.007086404599249363,
        0.02597568742930889,
        -0.024712763726711273,
        0.0010612065671011806,
        -0.006454942747950554,
        -0.0112571706995368,
        0.004989327862858772,
        0.011569003574550152,
        0.02438533864915371,
        -0.022420791909098625,
        -0.041286684572696686,
        -0.012262831442058086,
        -0.00643155537545681,
        0.01525642815977335,
        -0.029327891767024994,
        -0.0341145284473896,
        0.016636289656162262,
        0.026053644716739655,
        0.06183648109436035,
        -0.03604789078235626,
        -0.018600836396217346,
        0.04281466826796532,
        -0.008520836010575294,
        -0.005737726576626301,
        -0.024728355929255486,
        0.03498765826225281,
        -0.016090581193566322,
        -0.01977021060883999,
        -0.020705709233880043,
        0.03629735857248306,
        -0.011179212480783463,
        -0.03542422503232956,
        0.020237959921360016,
        0.014063667505979538,
        -0.020674526691436768,
        -0.01185744907706976,
        0.010789421387016773,
        0.005780603736639023,
        -0.010843992233276367,
        0.023449840024113655,
        -0.02862626686692238,
        0.009853921830654144,
        0.01601262390613556,
        0.00684083579108119,
        0.011950998567044735,
        0.026490211486816406,
        0.020425060763955116,
        0.030013924464583397,
        -0.019692253321409225,
        -0.003513967851176858,
        0.027503669261932373,
        0.011350720189511776,
        -0.02469717152416706,
        -0.00574942072853446,
        0.017665337771177292,
        -0.01596584916114807,
        0.029281117022037506,
        -0.026911186054348946,
        -0.012075732462108135,
        -0.003562691854313016,
        -0.025632670149207115,
        -0.005016612820327282,
        -0.02190626598894596,
        -0.038324274122714996,
        -0.01680779829621315,
        -0.02348102256655693,
        0.012598052620887756,
        0.017852438613772392,
        0.014991370029747486,
        0.04228455200791359,
        -0.0040460326708853245,
        0.0018534573027864099,
        0.017337912693619728,
        0.03517476096749306,
        -0.008294757455587387,
        -0.010267101228237152,
        0.04047591984272003,
        -0.021921858191490173,
        0.003979768604040146,
        -0.0054064043797552586,
        0.02748807705938816,
        -0.0008380511426366866,
        0.03414571285247803,
        0.028735408559441566,
        0.04393726587295532,
        -0.03180696442723274,
        -0.03015424869954586,
        0.041099585592746735,
        -0.010064409114420414,
        0.05404065549373627,
        0.013424409553408623,
        -0.013611509464681149,
        -0.0016507657710462809,
        -0.02432297170162201,
        0.027768727391958237,
        -0.020253552123904228,
        -0.027410117909312248,
        -0.05987193062901497,
        -0.0072618103586137295,
        -0.043656617403030396,
        -0.01437550038099289,
        -0.014118238352239132,
        -0.006797959096729755,
        -0.036359723657369614,
        0.01844491995871067,
        -0.03626617416739464,
        0.028922509402036667,
        -0.03172900527715683,
        -0.004681392572820187,
        0.009440743364393711,
        -0.006762877572327852,
        0.06255369633436203,
        0.0003749304451048374,
        -0.017447054386138916,
        -0.006111926399171352,
        -0.018585246056318283,
        -0.03330376371741295,
        -0.027815502136945724,
        0.008583202958106995,
        -0.03991462290287018,
        0.005273875314742327,
        0.013416613452136517,
        -0.005850766319781542,
        -0.0047047799453139305,
        -0.035580143332481384,
        0.017384689301252365,
        0.04602654650807381,
        0.01838255487382412,
        0.0036679354961961508,
        0.028828958049416542,
        0.02583536133170128,
        0.026287520304322243,
        0.025866545736789703,
        0.00731248315423727,
        0.012177078053355217,
        0.011569003574550152,
        0.025741811841726303,
        -0.029561765491962433,
        -0.014274154789745808,
        0.018351370468735695,
        -0.004482598975300789,
        0.026770861819386482,
        -0.022467566654086113,
        -0.007495685014873743,
        0.0038842696230858564,
        -0.0384490042924881,
        -0.02900046668946743,
        0.008458469063043594,
        0.008801485411822796,
        -0.03657800704240799,
        -0.022311650216579437,
        -0.015326591208577156,
        -0.029686499387025833,
        -0.03118329681456089,
        0.013580325990915298,
        0.006474432069808245,
        -0.012746172957122326,
        -0.05728371813893318,
        -0.03445754572749138,
        0.0010465894592925906,
        0.004022645298391581,
        -0.001706311129964888,
        -0.01025150902569294,
        -0.005722135305404663,
        0.0563170351088047,
        -0.02681763656437397,
        -0.0022237589582800865,
        0.007468399591743946,
        0.006166497245430946,
        0.016028214246034622,
        -0.005644177086651325,
        0.031136522069573402,
        -0.01034505944699049,
        0.01856965385377407,
        0.0032956846989691257,
        -0.015233040787279606,
        -0.024291789159178734,
        -0.01789921335875988,
        0.0010767983039841056,
        0.0030520653817802668,
        0.004330580588430166,
        0.08288520574569702,
        -0.008302552625536919,
        -0.006240557413548231,
        0.006739490199834108,
        -0.0038862184155732393,
        0.028984874486923218,
        -0.012044548988342285,
        -0.003385336836799979,
        -0.03172900527715683,
        -0.012145894579589367,
        0.015272020362317562,
        -0.011966590769588947,
        -0.03741995617747307,
        -0.0006036891718395054,
        -0.00290394457988441,
        -0.03088705614209175,
        -0.0067433882504701614,
        -0.007472297642379999,
        -0.0033794899936765432,
        0.00891842320561409,
        0.016605105251073837,
        -0.006162599194794893,
        0.007659397553652525,
        -0.022529931738972664,
        -0.0031534109730273485,
        -0.003430162789300084,
        0.004081114195287228,
        -0.028064968064427376,
        0.02026914432644844,
        -0.02992037497460842,
        0.005308956373482943,
        -0.0329919308423996,
        -0.035330675542354584,
        0.0016517402837052941,
        0.04861476272344589,
        -0.038324274122714996,
        0.0013213922502472997,
        0.001597169553861022,
        -0.012091323733329773,
        0.02560148760676384,
        -0.019318053498864174,
        -0.005242691840976477,
        0.006470534484833479,
        0.0027071000076830387,
        0.024307381361722946,
        -0.023278331384062767,
        -0.02050301805138588,
        0.016152948141098022,
        -0.0016722043510526419,
        0.019208911806344986,
        0.02081485092639923,
        -0.024775130674242973,
        0.004330580588430166,
        0.008294757455587387,
        -0.02142292633652687,
        0.015856707468628883,
        0.0009881207952275872,
        0.017275547608733177,
        -0.009705801494419575,
        -0.020471835508942604,
        0.0049152672290802,
        -0.013089189305901527,
        0.009074339643120766,
        0.00864556897431612,
        0.0029565664008259773,
        -0.0011976335663348436,
        0.010999908670783043,
        -0.005129652563482523,
        -0.018179861828684807,
        0.023855222389101982,
        0.008372715674340725,
        -0.0024985617492347956,
        0.02287294901907444,
        0.013159351423382759,
        0.02402673102915287,
        0.017914803698658943,
        -0.016215315088629723,
        0.018055129796266556,
        0.025086963549256325,
        -0.0009608353720977902,
        0.030185433104634285,
        -0.0009559629834257066,
        -0.023075640201568604,
        -0.02875100076198578,
        0.0502362921833992,
        0.00468529062345624,
        0.024556847289204597,
        -0.013993504457175732,
        0.005145244300365448,
        0.03292956203222275,
        -0.009222459979355335,
        -0.012964456342160702,
        -0.008723527193069458,
        -0.009768168441951275,
        -0.011639165692031384,
        -0.030653182417154312,
        0.045777082443237305,
        -0.007152669131755829,
        -0.021812716498970985,
        -0.02488427236676216,
        -0.0163712315261364,
        -0.009050952270627022,
        0.013323063962161541,
        -0.02383963204920292,
        0.007503481116145849,
        -0.008536428213119507,
        0.010539954528212547,
        -0.02371489815413952,
        0.011381903663277626,
        0.01237976923584938,
        -0.0012960558524355292,
        0.013416613452136517,
        -0.036921024322509766,
        0.0020541998092085123,
        0.006388678215444088,
        0.11961913108825684,
        -0.021454108878970146,
        -0.003800464328378439,
        -0.002689559478312731,
        -0.002122413134202361,
        0.02209336683154106,
        0.028111742809414864,
        -0.012161485850811005,
        0.011327332817018032,
        -0.014289746060967445,
        0.004244826268404722,
        0.009245847351849079,
        -0.013284084387123585,
        -0.0017560094129294157,
        -0.011452065780758858,
        0.01855406165122986,
        0.003804362379014492,
        0.0013301625149324536,
        0.012582460418343544,
        -0.015607240609824657,
        0.01270719338208437,
        0.006084640976041555,
        -0.04253401979804039,
        -0.02572622150182724,
        -0.0015270070871338248,
        0.002001577988266945,
        -0.011132437735795975,
        -0.005800093524158001,
        -0.008388306945562363,
        0.00465410714969039,
        0.0046930862590670586,
        0.0169948972761631,
        -0.010539954528212547,
        -0.0061041307635605335,
        0.017181996256113052,
        0.006669327616691589,
        0.013362043537199497,
        -0.0061158244498074055,
        -0.006969467271119356,
        -0.007370952051132917,
        0.005488260183483362,
        0.027347752824425697,
        0.00017382252553943545,
        -0.00447480333968997,
        0.013736242428421974,
        -0.006119722034782171,
        -0.014367704279720783,
        -0.01428194995969534,
        0.0030208819080144167,
        0.04113076999783516,
        -0.023512206971645355,
        0.02719183638691902,
        0.030731139704585075,
        5.862094621988945e-05,
        -0.06860325485467911,
        0.02415146492421627,
        -0.016651881858706474,
        -0.01576315611600876,
        -0.0016156845958903432,
        -0.013938934542238712,
        -0.012403156608343124,
        -0.017883621156215668,
        0.01869438774883747,
        0.0024712763261049986,
        -0.004513782449066639,
        -0.004237030632793903,
        -0.002303666202351451,
        -0.0164959654211998,
        -0.016823388636112213,
        0.018725570291280746,
        -0.009479722939431667,
        0.022545523941516876,
        0.007483991328626871,
        -0.009354989044368267,
        0.04100603610277176,
        -0.004806125536561012,
        -0.014297542162239552,
        0.0279090516269207,
        0.038916755467653275,
        0.01543573196977377,
        0.0006426682812161744,
        -0.02608482912182808,
        -0.011732716113328934,
        0.025554712861776352,
        0.0014802321093156934,
        -0.004724269732832909,
        -0.015061533078551292,
        -9.858977136900648e-06,
        -0.006380882114171982,
        -0.030356939882040024,
        0.013907751068472862,
        0.003287889063358307,
        -0.0015591648407280445,
        0.014632762409746647,
        -0.011381903663277626,
        0.011537820100784302,
        0.005753318313509226,
        0.004899675492197275,
        0.02226487547159195,
        0.007526868488639593,
        -0.010563341900706291,
        0.0017501625698059797,
        -0.005757216364145279,
        0.047835178673267365,
        0.012598052620887756,
        0.018787937238812447,
        -0.042627569288015366,
        0.03664037585258484,
        -0.01802394539117813,
        0.006443249061703682,
        -0.01844491995871067,
        -0.007686682976782322,
        -0.007070812862366438,
        -0.00711369002237916,
        0.019146544858813286,
        0.021828308701515198,
        0.01880352944135666,
        0.014211787842214108,
        0.012395360507071018,
        -0.028236476704478264,
        0.007901067845523357,
        0.013814200647175312,
        -0.02214014157652855,
        -0.022826174274086952,
        -0.01796158030629158,
        0.00919127743691206,
        -0.007269606459885836,
        -0.004965940024703741,
        -0.015521486289799213,
        0.020705709233880043,
        0.003989513032138348,
        -0.02329392358660698,
        0.013884363695979118,
        0.035517774522304535,
        0.015217449516057968,
        0.0053752209059894085,
        -0.00992408487945795,
        -0.007394339423626661,
        -0.01549809891730547,
        0.0337403267621994,
        -0.030232207849621773,
        0.010337263345718384,
        -9.793504432309419e-05,
        0.05185782536864281,
        -0.023917589336633682,
        -0.0008443852420896292,
        0.032181162387132645,
        -0.012122507207095623,
        0.005967703647911549,
        0.013619305565953255,
        -0.008427286520600319,
        0.005484362598508596,
        0.001077772700227797,
        0.023870814591646194,
        -0.019442785531282425,
        -0.019863760098814964,
        0.014414479024708271,
        0.04434264823794365,
        -0.0018427380127832294,
        -0.012075732462108135,
        -0.003915452864021063,
        -0.019801393151283264,
        -0.00503610260784626,
        -0.008715732023119926,
        -0.01771211251616478,
        -0.01613735593855381,
        0.01905299536883831,
        -0.004630719777196646,
        0.03592316061258316,
        -0.007004548329859972,
        0.06074506416916847,
        -0.004958144389092922,
        -0.006166497245430946,
        -0.012504502199590206,
        -0.00885605625808239,
        -0.027020327746868134,
        0.03645327687263489,
        0.0019362878520041704,
        -0.01722877286374569,
        -0.005698747467249632,
        -0.012083527632057667,
        -0.03302311152219772,
        -0.0060027847066521645,
        0.022108957171440125,
        -0.0010699769482016563,
        -0.016589514911174774,
        0.000446798192569986,
        -0.023028865456581116,
        -0.009199072606861591,
        -0.0306375902146101,
        0.014858840964734554,
        0.021734759211540222,
        0.004151276312768459,
        0.024229422211647034,
        0.015451324172317982,
        0.02602246217429638,
        0.020580977201461792,
        -0.03766942396759987,
        0.0036328542046248913,
        -0.017244363203644753,
        0.0016039909096434712,
        -0.006517309229820967,
        -0.002490765880793333,
        -0.024057913571596146,
        0.017914803698658943,
        -0.015303202904760838,
        0.00794394500553608,
        -0.017244363203644753,
        -0.04081893712282181,
        -0.01252788957208395,
        0.014702924527227879,
        0.025710629299283028,
        0.018289003521203995,
        0.005008817184716463,
        -0.019926127046346664,
        -0.013424409553408623,
        0.008474061265587807,
        -0.002077587181702256,
        0.001908028032630682,
        0.022763807326555252,
        0.014336520805954933,
        0.04761689528822899,
        0.02535202167928219,
        -0.03168223053216934,
        -0.018491694703698158,
        0.0003508121008053422,
        0.009963063523173332,
        -0.00643155537545681,
        -0.007456705905497074,
        0.004849002696573734,
        0.02650580368936062,
        0.00287471036426723,
        -0.0195987019687891,
        -0.031401582062244415,
        0.0441555492579937,
        0.027675176039338112,
        -0.009885105304419994,
        0.010836196132004261,
        0.010859583504498005,
        -0.006486125756055117,
        -0.012356381863355637,
        0.007721764035522938,
        -0.05575573816895485,
        0.016246497631072998,
        0.005340139847248793,
        0.006154803559184074,
        0.012613643892109394,
        -0.03651564195752144,
        0.020097635686397552,
        -0.04060065373778343,
        -0.021750349551439285,
        0.003983666189014912,
        0.013089189305901527,
        0.007951741106808186,
        0.012660418637096882,
        0.009300418198108673,
        -0.0013584224507212639,
        0.013751834630966187,
        -0.003519814694300294,
        -0.045777082443237305,
        -0.0170572642236948,
        0.0046930862590670586,
        0.009440743364393711,
        0.011280558072030544,
        -0.020892810076475143,
        0.006127518136054277,
        -0.010298283770680428,
        -0.008209003135561943,
        -0.020892810076475143,
        0.012145894579589367,
        0.024650396779179573,
        -0.038012441247701645,
        0.029998332262039185,
        -0.008458469063043594,
        -0.005098469089716673,
        0.005889745429158211,
        -0.03405215963721275,
        0.020674526691436768,
        0.0126214399933815,
        -0.013307472690939903,
        -0.002915638266131282,
        -0.03607907518744469,
        0.016698656603693962,
        0.0023290026001632214,
        0.0071955458261072636,
        -0.0010504873935133219,
        -0.016246497631072998,
        0.010797216556966305,
        0.02318478189408779,
        0.0196610689163208,
        -0.05956009775400162,
        -0.017181996256113052,
        -0.021625617519021034,
        -0.006283434573560953,
        0.0005851740716025233,
        0.021079909056425095,
        0.00027114851400256157,
        0.023138007149100304,
        0.0033015315420925617,
        -0.010204734280705452,
        0.015162878669798374,
        -0.01813308708369732,
        -0.05943536385893822,
        0.024837495759129524,
        -0.011264965869486332,
        -0.003190441057085991,
        0.017026079818606377,
        0.005609095562249422,
        0.004248724319040775,
        0.006949977483600378,
        -0.015856707468628883,
        0.044935133308172226,
        -0.008364919573068619,
        -0.02814292535185814,
        -0.013167147524654865,
        0.02839239314198494,
        0.007955638691782951,
        0.011982182040810585,
        0.024120280519127846,
        0.023855222389101982,
        0.0035217637196183205,
        -0.0015133643755689263,
        0.005593503825366497,
        0.022062182426452637,
        -0.01101549994200468,
        -0.001440278603695333,
        0.03966515511274338,
        0.0026310908142477274,
        0.016355639323592186,
        -0.017665337771177292,
        0.03738877549767494,
        0.005784501787275076,
        0.017384689301252365,
        -0.046993229538202286,
        -0.04144260287284851,
        -0.024291789159178734,
        0.02474394626915455,
        0.006856427527964115,
        -0.0164959654211998,
        -0.013876567594707012,
        0.021344967186450958,
        0.018226638436317444,
        -0.00755415391176939,
        -0.020658934488892555,
        -0.016527147963643074,
        -0.02862626686692238,
        -0.01570858620107174,
        0.008341532200574875,
        0.0035880282521247864,
        0.0005520418053492904,
        -0.022763807326555252,
        -0.004619026090949774,
        0.0024712763261049986,
        -0.007031833752989769,
        0.011639165692031384,
        0.0019460326293483377,
        -0.04580826312303543,
        -0.011943203397095203,
        0.012481114827096462,
        -0.02178153395652771,
        -0.019988493993878365,
        0.0034769377671182156,
        -0.01137410756200552,
        0.026661720126867294,
        0.04877067729830742,
        -0.060090214014053345,
        -0.03498765826225281,
        -0.023091232404112816,
        -0.009518701583147049,
        0.00696167116984725,
        -0.02644343674182892,
        -0.010625708848237991,
        0.011537820100784302,
        0.0060027847066521645,
        -0.02360575646162033,
        -0.005168631672859192,
        -0.016792206093668938,
        0.0017160559073090553,
        0.0036114156246185303,
        0.02062775194644928,
        -0.004958144389092922,
        0.0011732715647667646,
        0.015692993998527527,
        -0.029281117022037506,
        0.028174109756946564,
        0.02426060475409031,
        -0.010812808759510517,
        -0.007694478612393141,
        -0.0030150350648909807,
        0.0018164271023124456,
        -0.006291230209171772,
        0.02256111614406109,
        0.010617912746965885,
        0.014383296482264996,
        -0.06230422854423523,
        -0.010781625285744667,
        -0.015513690188527107,
        0.01936482824385166,
        0.0017404177924618125,
        -0.016605105251073837,
        0.021547658368945122,
        -0.0025433877017349005,
        -0.013517959974706173,
        -0.0020912298932671547,
        0.005683156196027994,
        0.009869514033198357,
        -0.04010172188282013,
        0.005207610782235861,
        -0.010859583504498005,
        0.005667564459145069,
        0.004505986347794533,
        -0.0009228307171724737,
        -0.03754469007253647,
        -0.025445571169257164,
        -0.011280558072030544,
        0.007865986786782742,
        0.011202599853277206,
        0.010695870965719223,
        -0.029702091589570045,
        0.03573605790734291,
        -0.04041355475783348,
        -0.01911536231637001,
        -0.011865245178341866,
        -0.005527239292860031,
        0.015022553503513336,
        0.014936799183487892,
        -0.04665021225810051,
        0.016464781016111374,
        0.00014190837100613862,
        0.010150163434445858,
        0.0004545940028037876,
        -0.01371285505592823,
        -0.00580788915976882,
        -0.001751137082464993,
        -0.005242691840976477,
        -0.011116845533251762,
        -0.0007103945245034993,
        -0.020191185176372528,
        -0.0011001856764778495,
        -0.0008706961525604129,
        -0.02371489815413952,
        0.0007776335114613175,
        0.0451534166932106,
        -0.002276380779221654,
        0.012847518548369408,
        0.006829142104834318,
        -0.013673876412212849,
        -0.028407983481884003,
        0.006864223629236221,
        0.01298004761338234,
        -0.012699398212134838,
        -0.02365253120660782,
        -0.010368446819484234,
        -0.009853921830654144,
        0.03888557106256485,
        0.010945337824523449,
        0.017602970823645592,
        -0.016043806448578835,
        -0.01326069701462984,
        -0.00864556897431612,
        0.004096705932170153,
        0.0008794664172455668,
        0.012223852798342705,
        0.018600836396217346,
        0.00794394500553608,
        -0.021017542108893394,
        -0.002726589562371373,
        0.02146970108151436,
        -0.014024687930941582,
        -0.013658284209668636,
        0.01407146267592907,
        0.0016585616394877434,
        -0.007581439334899187,
        -0.013627100735902786,
        0.001069002435542643,
        -0.003184594213962555,
        -0.02373049035668373,
        0.0017014386830851436,
        -0.010376241989433765,
        -0.0395716056227684,
        -0.024463297799229622,
        -0.012278423644602299,
        -0.026599353179335594,
        -0.004494292661547661,
        0.005340139847248793,
        0.005117958877235651,
        0.01995731145143509,
        0.0041707661002874374,
        -0.0008107657195068896,
        -0.0014061718247830868,
        -0.006755081936717033,
        0.029624132439494133,
        -0.05082877352833748,
        -0.020830443128943443,
        -0.021438516676425934,
        -0.004194153472781181,
        -0.025336429476737976,
        -0.00010621811088640243,
        -0.025164920836687088,
        0.010243712924420834,
        -0.005484362598508596,
        0.0014354061568155885,
        -0.01905299536883831,
        -0.010586729273200035,
        0.03302311152219772,
        0.005601299926638603,
        -0.019676661118865013,
        -0.022826174274086952,
        -0.004057726822793484,
        0.05185782536864281,
        0.01134292408823967,
        0.0020814852323383093,
        0.014328725636005402,
        0.012356381863355637,
        -0.009736984968185425,
        0.01291768066585064,
        0.01543573196977377,
        -0.020612159743905067,
        -0.012161485850811005,
        0.016963714733719826,
        0.002424501348286867,
        -0.0011187008349224925,
        -0.018101904541254044,
        -0.02596009522676468,
        0.004346172325313091,
        -0.015864502638578415,
        0.005164733622223139,
        -0.00873911939561367,
        0.023870814591646194,
        0.008778098039329052,
        0.02014441043138504,
        -0.008310348726809025,
        -0.0004553248581942171,
        -0.025804178789258003,
        -0.004954246338456869,
        0.00397197250276804,
        0.0019635732751339674,
        0.010477587580680847,
        0.004630719777196646,
        -0.009783759713172913,
        -0.01531879510730505,
        -0.033459678292274475,
        0.013783017173409462,
        0.012083527632057667,
        -0.01468733325600624,
        0.019692253321409225,
        -2.9127757443347946e-05,
        -0.0152876116335392,
        -0.01977021060883999,
        -0.043531883507966995,
        0.001295081339776516,
        0.028673041611909866,
        0.00631071999669075,
        0.004225336946547031,
        -0.010890766978263855,
        -0.009152297861874104,
        0.010649096220731735,
        -0.03087146393954754,
        0.01899062842130661,
        0.002315359888598323,
        0.0029273321852087975,
        -0.01191981602460146,
        0.017930395901203156,
        -0.0006202553049661219,
        0.0017998609691858292,
        -0.023387473076581955,
        0.04075656831264496,
        0.0006407193141058087,
        -0.01556046586483717,
        -0.005648074671626091,
        -0.0018222739454358816,
        -0.001044640433974564,
        -0.015872297808527946,
        0.02536761201918125,
        -0.0005564269958995283,
        0.0028727613389492035,
        0.01422738004475832,
        0.008060882799327374,
        0.020643342286348343,
        0.03670274093747139,
        0.01892826147377491,
        0.009807147085666656,
        -0.0007206264999695122,
        -0.020518610253930092,
        0.03107415698468685,
        -0.014508029446005821,
        0.010766033083200455,
        -0.01140529103577137,
        0.004525476135313511,
        0.03283601254224777,
        -0.0014899770030751824,
        0.008060882799327374,
        -0.01571638137102127,
        -0.006365290842950344,
        -0.002584315836429596,
        0.008481857366859913,
        0.00550774997100234,
        -0.01863202080130577,
        -0.01613735593855381,
        -0.007873782888054848,
        -0.003266450483351946,
        0.026240745559334755,
        0.003502274164929986,
        -0.025632670149207115,
        -0.0012141996994614601,
        0.00645884033292532,
        -0.03876084089279175,
        0.0016780511941760778,
        -0.006583573762327433,
        -0.027753135189414024,
        -0.013751834630966187,
        -0.0336155965924263,
        0.018959445878863335,
        -0.031230073422193527,
        0.04240928590297699,
        -0.0029819027986377478,
        0.029203157871961594,
        0.001977215986698866,
        -0.007164362818002701,
        -0.0024927149061113596,
        0.0006168446270748973,
        0.008801485411822796,
        0.014757495373487473,
        -0.025164920836687088,
        -0.01525642815977335,
        0.021329374983906746,
        0.01977021060883999,
        -0.006135313771665096,
        -0.002617448102682829,
        0.008286961354315281,
        0.022046592086553574,
        0.001503619598224759,
        0.01507712434977293,
        0.002574570942670107,
        -0.0009335499489679933,
        0.004872390069067478,
        -0.011639165692031384,
        0.019130952656269073,
        -0.019505152478814125,
        -0.0007756845443509519,
        -0.02341865748167038,
        0.011031091213226318,
        -0.02755044400691986,
        0.0328671969473362,
        -0.036609191447496414,
        0.006513411179184914,
        -0.0036445478908717632,
        -0.01265262346714735,
        0.035829607397317886,
        0.03296074643731117,
        -0.007476195693016052,
        0.0033892346546053886,
        -0.0023679817095398903,
        0.004544965457171202,
        -0.006653736345469952,
        -0.005605197977274656,
        -0.014788678847253323,
        0.04131786897778511,
        0.0082479827105999,
        0.009643434546887875,
        -0.02862626686692238,
        0.03112093172967434,
        0.010625708848237991,
        0.0007815313874743879,
        0.003519814694300294,
        -0.001231740228831768,
        -0.015092716552317142,
        -0.011319536715745926,
        0.021282600238919258,
        -0.006162599194794893,
        0.014336520805954933,
        -0.017790071666240692,
        0.012364177964627743,
        -0.012301811017096043,
        0.013050209730863571,
        -0.003083248622715473,
        -0.007858190685510635,
        0.016838980838656425,
        0.013424409553408623,
        0.0170572642236948,
        -0.004673596937209368,
        0.013447796925902367,
        0.007160464767366648,
        -0.017010489478707314,
        -0.002512204460799694,
        0.02765958569943905,
        -0.0008273318526335061,
        0.02209336683154106,
        0.019146544858813286,
        0.015334386378526688,
        0.024369746446609497,
        0.00015579468163195997,
        -0.011545616202056408,
        0.004085011780261993,
        0.0002103654551319778,
        0.007378747686743736,
        0.010274896398186684,
        0.016792206093668938,
        -0.0023465431295335293,
        -0.00014970419579185545,
        0.010033225640654564,
        -0.022062182426452637,
        -0.022639073431491852,
        -0.00257846899330616,
        -0.0010602321708574891,
        0.0067316945642232895,
        0.016043806448578835,
        -0.007406033109873533,
        0.003788770642131567,
        0.0012911834055557847,
        -0.001869048923254013,
        -0.0005242691840976477,
        -0.025554712861776352,
        -0.006860325578600168,
        0.012496707029640675,
        0.004155174363404512,
        0.02359016425907612,
        -0.007838701829314232,
        -0.03420807793736458,
        -0.011319536715745926,
        -0.01716640591621399,
        0.026069236919283867,
        0.008824873715639114,
        -0.009199072606861591,
        0.0013584224507212639,
        0.01179508212953806,
        0.00014544084842782468,
        -0.00016687937022652477,
        0.014040280133485794,
        -0.005121856462210417,
        -0.0085286321118474,
        -0.032056428492069244,
        -0.008021903224289417,
        -0.0023387472610920668,
        0.004494292661547661,
        -0.00275387498550117,
        -0.009931880049407482,
        -0.03191610425710678,
        -0.007865986786782742,
        0.016527147963643074,
        -0.005090673454105854,
        0.0022062184289097786,
        0.010298283770680428,
        -0.004420232493430376,
        -0.0024381440598517656,
        0.014812066219747066,
        -0.01613735593855381,
        0.008045290596783161,
        -0.032118797302246094,
        0.017337912693619728,
        -0.02444770559668541,
        -0.011116845533251762,
        -0.007725662086158991,
        -0.015997031703591347,
        0.023933181539177895,
        -0.0047203716821968555,
        0.01270719338208437,
        -0.008029699325561523,
        -0.03093383088707924,
        -0.014788678847253323,
        0.03088705614209175,
        0.003919350914657116,
        -0.0007849420653656125,
        0.011873040348291397,
        0.01941160298883915,
        -0.0040616244077682495,
        0.0494878925383091,
        0.0306999571621418,
        0.02633429504930973,
        0.02037828415632248,
        -0.0036757311318069696,
        0.008910627104341984,
        0.007047425489872694,
        -0.001300928182899952,
        -0.0223896075040102,
        -0.009347193874418736,
        0.035704877227544785,
        -0.012629235163331032,
        -0.006887611001729965,
        0.004580046981573105,
        0.016667472198605537,
        0.010446405038237572,
        -0.011997774243354797,
        0.008333736099302769,
        0.0004119605873711407,
        -0.024229422211647034,
        0.015006962232291698,
        -0.0015806034207344055,
        0.017868028953671455,
        0.0009033411624841392,
        0.026911186054348946,
        -0.011927611194550991,
        -0.003250858746469021,
        0.012496707029640675,
        -0.02026914432644844,
        0.016464781016111374,
        -0.0026856614276766777,
        -0.026178378611803055,
        0.0016955918399617076,
        0.004599536303430796,
        0.009393968619406223,
        -0.0014393040910363197,
        -0.017135221511125565,
        -0.028501534834504128,
        -0.029639724642038345,
        0.011413087137043476,
        -0.02268584817647934,
        -0.02178153395652771,
        0.016293272376060486,
        -0.01371285505592823,
        -0.03027898259460926,
        -0.011475453153252602,
        -0.0019489560509100556,
        0.024915454909205437,
        0.009814943186938763,
        0.011335128918290138,
        -0.00222180993296206,
        -0.017618563026189804,
        -0.012964456342160702,
        -0.021984225139021873,
        0.011358516290783882,
        -0.0010222274577245116,
        0.00615870114415884,
        0.015505895018577576,
        0.01461717113852501,
        -0.018538471311330795,
        0.04215981811285019,
        -0.0030812995973974466,
        -0.022374015301465988,
        0.021797124296426773,
        0.005737726576626301,
        -0.0024985617492347956,
        -0.025211695581674576,
        -0.012941068969666958,
        -0.016059398651123047,
        -0.027347752824425697,
        -0.009284826926887035,
        0.017088446766138077,
        -0.002523898147046566,
        0.023699305951595306,
        -0.014359908178448677,
        -0.024416523054242134,
        5.9047280956292525e-05,
        0.016168540343642235,
        0.021828308701515198,
        -0.030544040724635124,
        0.007846496999263763,
        0.028064968064427376,
        -0.010797216556966305,
        -0.0025648262817412615,
        -0.01101549994200468,
        0.008840464986860752,
        -0.019505152478814125,
        0.03791889175772667,
        -0.023808447644114494,
        0.00045361954835243523,
        0.034551095217466354,
        0.0066030630841851234,
        0.011600187048316002,
        -0.0012668215204030275,
        -0.010750441811978817,
        -0.0059092347510159016,
        0.034675825387239456,
        -0.004985429812222719,
        0.03941568732261658,
        0.010485383681952953,
        -0.021454108878970146,
        0.0012522042961791158,
        -0.030201023444533348,
        0.01729113794863224,
        0.005854664370417595,
        0.022654665634036064,
        -0.013346451334655285,
        -0.00684083579108119,
        -0.006454942747950554,
        0.010298283770680428,
        0.027753135189414024,
        -0.016636289656162262,
        0.020721301436424255,
        0.030356939882040024,
        0.017431464046239853,
        -0.010212530381977558,
        0.003453550161793828,
        -0.009409559890627861,
        0.02681763656437397,
        -0.046681396663188934,
        0.002153596607968211,
        0.004486497025936842,
        -0.012816335074603558,
        0.011109049431979656,
        0.015373365953564644,
        -0.007273504044860601,
        0.016885755583643913,
        0.0035938750952482224,
        0.011724920012056828,
        -0.002167239086702466,
        -0.01155341137200594,
        0.021189050748944283,
        -0.0041707661002874374,
        -0.01710403896868229,
        0.022420791909098625,
        0.00649002380669117,
        -0.006762877572327852,
        0.007429420482367277,
        -0.01013457216322422,
        0.014765291474759579,
        -0.0030637590680271387,
        -0.0023621348664164543,
        0.005078979767858982,
        0.002732436405494809,
        0.005994989071041346,
        0.008575406856834888,
        -0.0018914618995040655,
        -0.012122507207095623,
        -0.008131044916808605,
        0.0007293968228623271,
        -0.004634617827832699,
        0.02020677737891674,
        -0.011623574420809746,
        5.2347742894198745e-05,
        0.02876659296452999,
        -0.01158459484577179,
        -0.0037478425074368715,
        0.0005315777962096035,
        -0.000555452483240515,
        0.007495685014873743,
        -0.028376800939440727,
        -0.00992408487945795,
        0.0032761951442807913,
        -0.010664687491953373,
        -0.01507712434977293,
        -0.009947472251951694,
        -0.013853180222213268,
        0.0016156845958903432,
        -0.010002043098211288,
        0.01185744907706976,
        -0.015521486289799213,
        0.006953875534236431,
        0.021344967186450958,
        0.043095316737890244,
        -0.004042135085910559,
        0.000702111457940191,
        -0.00589754106476903,
        0.015131695196032524,
        0.013798609375953674,
        0.010992112569510937,
        -0.02039387635886669,
        0.0054064043797552586,
        0.009464130736887455,
        0.025274062529206276,
        -0.029951557517051697,
        0.0036854760255664587,
        0.008965197950601578,
        -0.0073163812048733234,
        -0.005901439115405083,
        -0.014469049870967865,
        -0.011023296043276787,
        -0.01025150902569294,
        0.0024810212198644876,
        0.01899062842130661,
        -0.002662274055182934,
        0.025320837274193764,
        0.011358516290783882,
        0.0030968913342803717,
        -0.011997774243354797,
        -0.0040772161446511745,
        0.008817077614367008,
        -0.004505986347794533,
        -0.01504594087600708,
        0.02203099988400936,
        0.0017024131957441568,
        -0.022420791909098625,
        0.011218191124498844,
        0.013938934542238712,
        0.013338655233383179,
        -0.011241578496992588,
        -2.0281324395909905e-05,
        -0.01052436325699091,
        0.005675360094755888,
        0.004544965457171202,
        -0.012403156608343124,
        0.011662553064525127,
        0.013549142517149448,
        0.004782738164067268,
        -0.00547656649723649,
        0.032181162387132645,
        -0.005632482934743166,
        0.00331517425365746,
        -0.01538116205483675,
        -0.006657633930444717,
        0.004038237035274506,
        0.00885605625808239,
        0.00024215779558289796,
        0.004057726822793484,
        -0.00714097497984767,
        -0.00595990801230073,
        0.004634617827832699,
        -0.0014334572479128838,
        0.002759721828624606,
        0.015326591208577156,
        0.003262552432715893,
        -0.0036172624677419662,
        -0.015310999006032944,
        -0.009089930914342403,
        0.017868028953671455,
        0.014671741984784603,
        -0.007694478612393141,
        -0.002816241467371583,
        -0.021641207858920097,
        -0.01510830782353878,
        -0.002732436405494809,
        -0.014461254701018333,
        0.004619026090949774,
        2.614341974549461e-05,
        -0.0009861717699095607,
        -0.008692344650626183,
        -0.00711369002237916,
        -0.00019940256606787443,
        -0.003369745099917054,
        -0.004420232493430376,
        0.0066186548210680485,
        -0.008848261088132858,
        0.024946637451648712,
        0.008318144828081131,
        -0.00435396796092391,
        0.027316568419337273,
        0.002013271674513817,
        -0.007760743144899607,
        0.0026642230805009604,
        -0.010960929095745087,
        0.008310348726809025,
        0.006334107369184494,
        -0.002623294945806265,
        0.01116362027823925,
        0.020066451281309128,
        -0.025024596601724625,
        0.006291230209171772,
        0.0033833878114819527,
        0.01729113794863224,
        0.01496018748730421,
        0.006275638472288847,
        0.003950533922761679,
        0.013440001755952835,
        -0.002239350462332368,
        -0.015997031703591347,
        0.012465523555874825,
        -0.010992112569510937,
        -0.019910534843802452,
        0.01496018748730421,
        -0.023636939004063606,
        0.026864411309361458,
        0.044935133308172226,
        0.018101904541254044,
        0.021734759211540222,
        -0.002720742719247937,
        -0.0031534109730273485,
        0.003580232383683324,
        -0.006478330120444298,
        -0.008138841018080711,
        -0.027223018929362297,
        -0.0011752205900847912,
        0.01867879554629326,
        -0.00527777336537838,
        0.002942923689261079,
        0.0005413225735537708,
        -0.008575406856834888,
        0.0072618103586137295,
        0.009214664809405804,
        0.03779415786266327,
        -0.00456445524469018,
        0.002596009522676468,
        -0.0040772161446511745,
        -0.003529559588059783,
        -0.023995548486709595,
        -0.002699304139241576,
        -0.005289467051625252,
        0.004626821726560593,
        0.007066914811730385,
        -0.011834061704576015,
        -0.002613550052046776,
        -0.00036689097760245204,
        0.012613643892109394,
        -0.008684548549354076,
        -0.0010884919902309775,
        0.002870812313631177,
        0.01155341137200594,
        -0.008380510844290257,
        0.0010738747660070658,
        0.0009101625182665884,
        0.01347118429839611,
        -0.014305338263511658,
        -0.01825782097876072,
        0.012941068969666958,
        -0.01070366706699133,
        -0.025196105241775513,
        0.018522879108786583,
        0.009877309203147888,
        0.008926219306886196,
        -1.827146297728177e-05,
        0.00257846899330616,
        -0.008700139820575714,
        -0.012036752887070179,
        -0.018366962671279907,
        0.029203157871961594,
        0.024853087961673737,
        0.009082135744392872,
        0.0036036197561770678,
        0.007101995870471001,
        0.026864411309361458,
        0.009869514033198357,
        -0.002243248512968421,
        0.004911369178444147,
        0.0018700234359130263,
        -0.009378376416862011,
        0.01783684641122818,
        0.005850766319781542,
        -0.008926219306886196,
        0.010025430470705032,
        0.010875174775719643,
        0.0014168911147862673,
        0.006712204776704311,
        -0.028018193319439888,
        0.005164733622223139,
        -0.04562116414308548,
        -0.012091323733329773,
        -0.026303112506866455,
        -0.02092399261891842,
        -0.0054025063291192055,
        -0.029951557517051697,
        -0.012512298300862312,
        0.010415221564471722,
        -0.01977021060883999,
        0.019972901791334152,
        -0.006544594652950764,
        -0.015201857313513756,
        -0.0002801624359562993,
        0.02468157932162285,
        0.0030267287511378527,
        -0.011834061704576015,
        -0.007328074891120195,
        0.004899675492197275,
        -0.016605105251073837,
        0.010306079871952534,
        -0.015365569852292538,
        -0.023792855441570282,
        -0.0035938750952482224,
        -0.0168701633810997,
        -0.011218191124498844,
        0.008115453645586967,
        -0.010126776061952114,
        -0.006883712951093912,
        0.007452808320522308,
        0.01143647450953722,
        -0.01741587184369564,
        0.03598552569746971,
        0.009362785145640373,
        0.005324548110365868,
        0.005153039935976267,
        -0.003931044600903988,
        -0.006509513594210148,
        0.004314988851547241,
        0.013455593027174473,
        -0.0041045015677809715,
        0.010469792410731316,
        -0.008325940929353237,
        0.02826765924692154,
        -0.006334107369184494,
        0.00958886370062828,
        0.004852900747209787,
        0.004771044477820396,
        0.016823388636112213,
        -0.007437216583639383,
        -0.0010397681035101414,
        -0.005612993612885475,
        -0.03191610425710678,
        -0.01074264571070671,
        -0.01590348221361637,
        -0.00930821429938078,
        0.0014831556472927332,
        -0.005242691840976477,
        0.0060027847066521645,
        0.0022744317539036274,
        0.0037088633980602026,
        -0.013440001755952835,
        -0.004919165279716253,
        0.005983295384794474,
        0.011756103485822678,
        -0.011849652975797653,
        -3.252320675528608e-05,
        0.005620789248496294,
        -0.0009725291165523231,
        -0.02306004799902439,
        -0.020050860941410065,
        0.002572622150182724,
        0.00394273828715086,
        -0.026178378611803055,
        0.019006220623850822,
        -0.018039537593722343,
        -0.01989494450390339,
        0.004108399618417025,
        0.01752501353621483,
        0.006540696602314711,
        0.007682784926146269,
        -0.014547008089721203,
        -5.557570329983719e-05,
        -0.019162137061357498,
        -0.004876288119703531,
        -0.0003483759064693004,
        -0.004026543349027634,
        0.0021360558457672596,
        -0.004291601479053497,
        0.010571138001978397,
        -0.00640037190169096,
        -4.242024806444533e-05,
        0.00029063806869089603,
        0.010516567155718803,
        -0.025944503024220467,
        0.005675360094755888,
        -0.0019577264320105314,
        0.007530766539275646,
        0.0036367520224303007,
        0.004311090800911188,
        0.004942552652209997,
        -0.021812716498970985,
        0.010196938179433346,
        0.010157959535717964,
        0.024588029831647873,
        -0.012364177964627743,
        -0.0009998144814744592,
        -0.01572417840361595,
        -0.0018485848559066653,
        -0.01304241456091404,
        -0.016277682036161423,
        0.012777356430888176,
        -0.007254014723002911,
        -0.020768076181411743,
        0.008544223383069038,
        -0.0010017633903771639,
        0.04727387800812721,
        -0.005383016541600227,
        -0.004868492484092712,
        -0.00117132265586406,
        -0.006735592149198055,
        -0.007632112130522728,
        0.021329374983906746,
        -0.003562691854313016,
        -0.002738283248618245,
        0.013268493115901947,
        -0.011600187048316002,
        0.0012307658325880766,
        0.01546691544353962,
        0.015591648407280445,
        0.01595805212855339,
        -0.0280337855219841,
        0.018943853676319122,
        -0.00352566153742373,
        0.03186932951211929,
        -0.01934923604130745,
        -0.00017552786448504776,
        0.02075248397886753,
        -0.018398145213723183,
        0.018585246056318283,
        -8.258701564045623e-05,
        0.014734108000993729,
        -0.00014239561278373003,
        -0.0036581906024366617,
        0.009510905481874943,
        0.004934757016599178,
        -0.0007917634211480618,
        0.0038472393061965704,
        0.0016341997543349862,
        0.0028571696020662785,
        0.010384038090705872,
        -0.018881486728787422,
        0.006373086478561163,
        0.008271370083093643,
        0.015669606626033783,
        -5.8864563470706344e-05,
        0.023215964436531067,
        0.008076474070549011,
        -0.016651881858706474,
        -0.016402414068579674,
        0.011896427720785141,
        0.00287471036426723,
        -0.0038959633093327284,
        0.007390441372990608,
        -0.027098285034298897,
        -0.02001967653632164,
        0.013611509464681149,
        -0.025024596601724625,
        -0.0020873320754617453,
        -0.006856427527964115,
        -0.01018914207816124,
        0.01576315611600876,
        0.0023406962864100933,
        0.013299676589667797,
        0.019520744681358337,
        -0.011350720189511776,
        -0.011506636627018452,
        -0.005421996116638184,
        0.007483991328626871,
        0.007784130517393351,
        0.008021903224289417,
        0.012629235163331032,
        0.02359016425907612,
        0.001641995506361127,
        -0.01863202080130577,
        -0.010602321475744247,
        0.011880836449563503,
        -0.016901347786188126,
        -0.028314433991909027,
        0.004778840579092503,
        -0.0011752205900847912,
        -0.010033225640654564,
        0.01307359803467989,
        0.0152876116335392,
        0.0060729472897946835,
        0.022483156993985176,
        -0.015100511722266674,
        0.007721764035522938,
        0.019396010786294937,
        -0.014398887753486633,
        -0.014882229268550873,
        -0.016230907291173935,
        -0.0002369199792155996,
        -0.01947396993637085,
        0.008271370083093643,
        0.005102367140352726,
        0.023558981716632843,
        -0.008364919573068619,
        -0.016168540343642235,
        -0.0021029235795140266,
        0.0020425058901309967,
        0.0022198609076440334,
        -0.025258470326662064,
        0.02469717152416706,
        0.013237309642136097,
        0.00400315597653389,
        0.034551095217466354,
        -0.003426264738664031,
        0.01704167202115059,
        0.010259305126965046,
        0.007503481116145849,
        -0.005683156196027994,
        0.016293272376060486,
        0.004166868049651384,
        -0.006755081936717033,
        0.0040889098308980465,
        -0.01273837685585022,
        -0.006092436611652374,
        -0.006435452960431576,
        0.01924009434878826,
        -0.027690768241882324,
        0.012356381863355637,
        0.026178378611803055,
        0.010578934103250504,
        0.024135872721672058,
        0.005230998154729605,
        -0.004611229989677668,
        -0.010477587580680847,
        0.014422275125980377,
        0.0004365661588963121,
        0.005663666408509016,
        -0.01668306440114975,
        -0.011109049431979656,
        0.03233708068728447,
        0.022950906306505203,
        0.002677865792065859,
        -0.011592390947043896,
        0.012177078053355217,
        -0.020970767363905907,
        0.0054025063291192055,
        0.001633225241675973,
        0.020222367718815804,
        -0.0007196520455181599,
        0.0022412994876503944,
        0.002494663931429386,
        -0.013213922269642353,
        -0.0026330396067351103,
        0.006723898462951183,
        -0.012847518548369408,
        0.0012103017652407289,
        0.006614757236093283,
        -0.0033346638083457947,
        0.0060339681804180145,
        0.0007303712773136795,
        -0.004256519954651594,
        0.0017521115951240063,
        0.0003527610679157078,
        0.015162878669798374,
        -0.021313784644007683,
        -0.011927611194550991,
        -0.0056285853497684,
        0.005351833533495665,
        -0.002293921308591962,
        -0.00937058124691248,
        0.003755638375878334,
        0.014562600292265415,
        0.007624316494911909,
        0.0073163812048733234,
        0.0018934108084067702,
        0.0032040837686508894,
        -0.013603713363409042,
        0.003983666189014912,
        0.02645902894437313,
        0.008084270171821117,
        -0.0011791184078902006,
        0.0017160559073090553,
        -0.007893272675573826,
        -0.003535406431183219,
        -0.00684083579108119,
        -0.00927703082561493,
        0.00122881680727005,
        -0.013377634808421135,
        -0.016121765598654747,
        0.014765291474759579,
        0.004408538807183504,
        0.008388306945562363,
        -0.008271370083093643,
        0.0072618103586137295,
        -0.0031241767574101686,
        0.021563250571489334,
        -0.02712946943938732,
        -0.0006991879781708121,
        -0.01577095314860344,
        -0.01191981602460146,
        0.003453550161793828,
        0.007367054000496864,
        -0.03838663920760155,
        0.006801856681704521,
        0.02324714884161949,
        -0.0040460326708853245,
        0.007004548329859972,
        -0.006571880076080561,
        0.009838330559432507,
        0.008910627104341984,
        0.011693736538290977,
        -0.012605847790837288,
        0.008014107123017311,
        0.0054999543353915215,
        -0.0030520653817802668,
        -0.004958144389092922,
        -0.01543573196977377,
        0.01377522200345993,
        -0.021438516676425934,
        -0.011280558072030544,
        0.0013272390933707356,
        0.006322413682937622,
        -0.004509884398430586,
        0.012512298300862312,
        -0.014188400469720364,
        0.018787937238812447,
        -0.005632482934743166,
        0.006981160957366228,
        0.001457819133065641,
        0.002040557097643614,
        0.009752576239407063,
        0.011927611194550991,
        -0.0038511373568326235,
        0.004525476135313511,
        -0.019162137061357498,
        0.017883621156215668,
        0.007862089201807976,
        -0.02985800802707672,
        -0.0020113226491957903,
        0.01983257755637169,
        -0.012434340082108974,
        -0.004525476135313511,
        0.009775963611900806,
        -0.012746172957122326,
        0.006844733841717243,
        0.00479443185031414,
        0.004182459786534309,
        0.0012463574530556798,
        0.019162137061357498,
        -0.016885755583643913,
        0.02062775194644928,
        0.013673876412212849,
        0.023200374096632004,
        -0.0007980975206010044,
        0.01468733325600624,
        -0.02474394626915455,
        -0.004486497025936842,
        -0.006111926399171352,
        0.007519072853028774,
        0.010750441811978817,
        0.02299768291413784,
        -0.0017413923051208258,
        -0.009230256080627441,
        0.011031091213226318,
        0.004085011780261993,
        0.026973553001880646,
        -0.015209653414785862,
        0.013440001755952835,
        -0.018055129796266556,
        0.012286219745874405,
        -0.009238052181899548,
        -0.00524658989161253,
        -0.0056285853497684,
        0.026739677414298058,
        0.0022120652720332146,
        -0.01880352944135666,
        0.005223202519118786,
        -0.022420791909098625,
        0.01319053489714861,
        0.001132343546487391,
        0.004583944566547871,
        -0.0037010677624493837,
        0.02293531596660614,
        0.0033658472821116447,
        -0.001958700828254223,
        -0.005854664370417595,
        0.02589772827923298,
        -0.005800093524158001,
        -0.008590998128056526,
        0.0020873320754617453,
        0.013658284209668636,
        0.03483174368739128,
        -0.010126776061952114,
        0.001608863240107894,
        0.007448910269886255,
        -0.012870905920863152,
        -0.015100511722266674,
        0.004178561735898256,
        -6.82743702782318e-05,
        0.012255036272108555,
        0.027503669261932373,
        0.0197234358638525,
        -0.02444770559668541,
        0.015388957224786282,
        0.01022032555192709,
        0.014609375037252903,
        0.013970117084681988,
        0.013463389128446579,
        0.015396753326058388,
        0.0021341070532798767,
        0.012629235163331032,
        0.006139211822301149,
        -0.013330860063433647,
        -0.0015104409540072083,
        0.003085197415202856,
        0.007889374159276485,
        0.015053736977279186,
        0.0025706731248646975,
        0.0225767083466053,
        -0.007191648241132498,
        0.009300418198108673,
        -0.002056148601695895,
        0.0022081672213971615,
        -0.02553912065923214,
        -0.00030915316892787814,
        -0.0005325522506609559,
        -0.006131415721029043,
        0.007600928656756878,
        -0.014710720628499985,
        0.010002043098211288,
        -0.008107657544314861,
        0.0072345249354839325,
        0.0041200933046638966,
        -0.02093958482146263,
        -0.015739768743515015,
        -0.010960929095745087,
        0.02274821512401104,
        0.003876473754644394,
        0.0008794664172455668,
        -0.011818469502031803,
        -0.008138841018080711,
        0.005160835571587086,
        -0.030232207849621773,
        -0.0028844550251960754,
        0.024463297799229622,
        0.013798609375953674,
        -0.017790071666240692,
        -0.008481857366859913,
        0.014305338263511658,
        -0.022732624784111977,
        0.014009096659719944,
        0.0029331790283322334,
        0.0020054758060723543,
        0.00965123064815998,
        -0.006821346469223499,
        -0.012231648899614811,
        -0.012520094402134418,
        -0.010212530381977558,
        0.00016493041766807437,
        0.0012638979824259877,
        0.01004102174192667,
        0.023870814591646194,
        -0.0030150350648909807,
        -0.036921024322509766,
        0.013510163873434067,
        0.016527147963643074,
        -0.01722877286374569,
        -0.010173550806939602,
        -0.008014107123017311,
        -0.021875083446502686,
        0.013611509464681149,
        -0.006423759274184704,
        -0.00717215845361352,
        0.011685940437018871,
        -0.008123248815536499,
        -0.02207777462899685,
        0.014484642073512077,
        -0.005519443657249212,
        0.008146636188030243,
        0.011171416379511356,
        0.012792947702109814,
        0.011771694757044315,
        0.0007552204770036042,
        -0.0008117402321659029,
        0.02675526961684227,
        0.0023348494432866573,
        0.03567369282245636,
        0.006330209318548441,
        -0.00263888668268919,
        -0.003480835584923625,
        0.010017634369432926,
        0.00018880511925090104,
        0.011662553064525127,
        -0.02287294901907444,
        0.03645327687263489,
        0.006185986567288637,
        0.01010338868945837,
        -9.120505637838505e-06,
        0.015030349604785442,
        0.0025219491217285395,
        0.02026914432644844,
        0.004377355333417654,
        -0.023075640201568604,
        0.01819545403122902,
        0.004958144389092922,
        -0.018959445878863335,
        -0.008505244739353657,
        0.003888167440891266,
        0.007893272675573826,
        -0.004365661647170782,
        0.03268009424209595,
        -0.008357123471796513,
        -0.015100511722266674,
        -0.011514432728290558,
        0.006147007457911968,
        -0.0013321115402504802,
        0.008201207034289837,
        0.014383296482264996,
        0.0008614385733380914,
        -0.0036679354961961508,
        0.0082479827105999,
        0.004981531761586666,
        0.0074021355248987675,
        -0.012824131175875664,
        0.010758237913250923,
        -0.02973327413201332,
        -0.01276956032961607,
        0.0030754527542740107,
        -0.010711463168263435,
        -0.0003069605736527592,
        0.0003062297182623297,
        -3.1327947453974048e-06,
        0.00906654354184866,
        0.024556847289204597,
        -0.0026973553467541933,
        0.013572529889643192,
        0.01489782053977251,
        -0.013837588019669056,
        -0.01928686909377575,
        -0.0010573086328804493,
        0.014648353680968285,
        0.02457243949174881,
        0.004926960915327072,
        0.005269977264106274,
        0.0040460326708853245,
        -0.025383204221725464,
        0.02165680006146431,
        0.01722877286374569,
        -0.010033225640654564,
        -0.019146544858813286,
        0.013354247435927391,
        0.012403156608343124,
        -0.015264224261045456,
        -0.008778098039329052,
        -0.006412065587937832,
        -0.013003434985876083,
        0.00037273784982971847,
        -0.00940176472067833,
        -0.0026934572961181402,
        -0.02008204348385334,
        -0.007698376663029194,
        -0.01298004761338234,
        -0.012878702022135258,
        -0.0018154525896534324,
        -0.016761021688580513,
        0.014172809198498726,
        -0.003738097846508026,
        -0.015030349604785442,
        -0.004377355333417654,
        0.023340698331594467,
        0.0006943155894987285,
        0.011896427720785141,
        -0.019692253321409225,
        0.02528965473175049,
        0.014578191563487053,
        -0.021204642951488495,
        0.004997123498469591,
        0.010906358249485493,
        0.024962229654192924,
        -0.006700511090457439,
        0.0017745245713740587,
        -0.010150163434445858,
        0.012964456342160702,
        -0.0067044091410934925,
        0.034239262342453,
        0.015420140698552132,
        -0.02705151028931141,
        -0.0197234358638525,
        0.015700791031122208,
        -0.009347193874418736,
        0.008590998128056526,
        -0.022904131561517715,
        0.009955267421901226,
        -0.003683527000248432,
        0.0028220885433256626,
        -0.024588029831647873,
        -0.005379118956625462,
        0.020347101613879204,
        0.013377634808421135,
        -0.011693736538290977,
        -0.01416501309722662,
        0.025757404044270515,
        0.03221234679222107,
        0.011997774243354797,
        0.004696984309703112,
        -0.029405849054455757,
        0.0007727611227892339,
        0.013650489039719105,
        0.0023445941042155027,
        0.0035899770446121693,
        0.01280074380338192,
        -0.007441114634275436,
        -0.009542088955640793,
        -0.006642042193561792,
        -0.0001773550029611215,
        0.007176056504249573,
        0.009744780138134956,
        0.0036094665993005037,
        0.013736242428421974,
        -0.013058005832135677,
        -0.00016054525622166693,
        -0.0085286321118474,
        0.025679444894194603,
        0.009659026749432087,
        0.023215964436531067,
        0.001952853985130787,
        0.013385430909693241,
        6.388921610778198e-05,
        -0.01867879554629326,
        -0.038979120552539825,
        -0.015233040787279606,
        0.010212530381977558,
        0.0010514617897570133,
        0.00456445524469018,
        -0.006252251099795103,
        0.013377634808421135,
        -0.009518701583147049,
        -0.011537820100784302,
        0.013814200647175312,
        -0.000558375904802233,
        -0.0010124826803803444,
        0.0014383295783773065,
        -0.010641300119459629,
        -0.020892810076475143,
        0.0018407889874652028,
        0.007398237474262714,
        0.00843508169054985,
        -0.01000983826816082,
        -0.018055129796266556,
        -0.0012697449419647455,
        0.012028956785798073,
        -0.010508771054446697,
        0.0036913228686898947,
        0.015872297808527946,
        -0.003979768604040146,
        0.0027889562770724297,
        0.004268214106559753,
        -0.0038530861493200064,
        0.012192669324576855,
        -0.024556847289204597,
        0.011062274686992168,
        -0.013627100735902786,
        0.006147007457911968,
        0.00044241303112357855,
        -0.0010553597239777446,
        0.013416613452136517,
        -0.009736984968185425,
        -0.005881949327886105,
        0.011935407295823097,
        -0.010867379605770111,
        0.0009169838740490377,
        0.021079909056425095,
        0.007254014723002911,
        0.011085662059485912,
        -0.00788547657430172,
        0.004276009742170572,
        0.009409559890627861,
        -0.005394710693508387,
        -0.00021133992413524538,
        -0.00411229720339179,
        0.0007225754670798779,
        0.0007250116905197501,
        0.00026067288126796484,
        -0.01513949129730463,
        0.004934757016599178,
        -0.008450673893094063,
        -0.0018271463923156261,
        0.023886406794190407,
        -0.013362043537199497,
        0.0026973553467541933,
        0.009994246996939182,
        0.01880352944135666,
        0.0021808817982673645,
        -0.017213180661201477,
        0.03135480731725693,
        -0.01577095314860344,
        -0.011717123910784721,
        0.01137410756200552,
        0.013058005832135677,
        0.012847518548369408,
        0.005917030852288008,
        0.006981160957366228,
        0.006809652782976627,
        -0.03126125782728195,
        0.026053644716739655,
        0.0060339681804180145,
        -0.02719183638691902,
        0.019208911806344986,
        -0.005086775403469801,
        0.001298004761338234,
        -0.023278331384062767,
        -0.016542740166187286,
        0.011335128918290138,
        0.018975036218762398,
        0.000833178753964603,
        -0.011023296043276787,
        -0.0163712315261364,
        0.00933939777314663,
        0.007628214079886675,
        0.005702645517885685,
        -0.0017316475277766585,
        -0.001997679937630892,
        -0.0014948493335396051,
        -0.0028552208095788956,
        -0.006306821946054697,
        0.0023251045495271683,
        -0.017337912693619728,
        -0.002153596607968211,
        -0.000559837615583092,
        -0.005690951831638813,
        0.0018154525896534324,
        0.023995548486709595,
        -0.012473318725824356,
        -0.007164362818002701,
        -0.012613643892109394,
        0.00070357316872105,
        0.0004889443516731262,
        -0.0041473787277936935,
        0.0027460791170597076,
        0.0052660792134702206,
        -0.002001577988266945,
        -0.015568261034786701,
        -0.005016612820327282,
        0.0060768453404307365,
        0.008778098039329052,
        -0.0112571706995368,
        -0.002231554826721549,
        0.005971601698547602,
        0.013143760152161121,
        -0.01970784366130829,
        -0.009744780138134956,
        0.02087721787393093,
        0.01510830782353878,
        0.0171196311712265,
        0.007086404599249363,
        0.004926960915327072,
        -0.016792206093668938,
        0.0038862184155732393,
        -0.01674543134868145,
        -0.006291230209171772,
        -0.01764974743127823,
        -0.0007060093339532614,
        -0.012964456342160702,
        -0.004272111691534519,
        0.006408167537301779,
        -0.0011849653674289584,
        -0.00553893344476819,
        0.016761021688580513,
        0.003936891444027424,
        0.012995638884603977,
        0.002040557097643614,
        -0.008653365075588226,
        0.004178561735898256,
        -0.013868771493434906,
        0.022218098863959312,
        0.005850766319781542,
        -0.002759721828624606,
        0.002104872604832053,
        0.0036270073615014553,
        0.001113828388042748,
        0.005234896205365658,
        -0.002143851714208722,
        0.010352854616940022,
        -0.010181346908211708,
        -0.0016293273074552417,
        0.012177078053355217,
        -0.017400279641151428,
        -0.009900696575641632,
        -0.0023874712642282248,
        -0.006482228171080351,
        -0.008926219306886196,
        -0.027690768241882324,
        -0.015926869586110115,
        -0.0027831094339489937,
        0.003876473754644394,
        -0.01964547671377659,
        -0.013159351423382759,
        -0.020549792796373367,
        0.0012190720299258828,
        -0.010002043098211288,
        -0.011054478585720062,
        0.012777356430888176,
        -0.013689467683434486,
        -0.002759721828624606,
        -0.00912891048938036,
        0.00909772701561451,
        -0.019754618406295776,
        0.027643993496894836,
        -0.003907657228410244,
        0.003975870553404093,
        -0.02178153395652771,
        -0.008965197950601578,
        -0.008388306945562363,
        0.0023465431295335293,
        -0.020674526691436768,
        -0.014632762409746647,
        -0.007772436831146479,
        -0.0061431098729372025,
        -0.015934664756059647,
        0.01758738048374653,
        -0.008177819661796093,
        -0.019988493993878365,
        0.018834711983799934,
        0.0009111369727179408,
        -0.013112576678395271,
        -0.016230907291173935,
        0.010812808759510517,
        -0.0059482138603925705,
        0.01850728690624237,
        0.029811233282089233,
        0.022311650216579437,
        -0.008988585323095322,
        -0.004665800835937262,
        -0.00888723973184824,
        0.003223573323339224,
        0.0032761951442807913,
        -0.002512204460799694,
        0.005698747467249632,
        -0.012644827365875244,
        0.003100789152085781,
        -0.0072657084092497826,
        0.004923063330352306,
        0.015303202904760838,
        0.02136055938899517,
        -0.0027948031201958656,
        0.01010338868945837,
        -0.004014849662780762,
        -0.021765941753983498,
        0.008871648460626602,
        -0.02893809974193573,
        0.010002043098211288,
        -0.006914896424859762,
        -0.014266358688473701,
        -0.0017228771466761827,
        0.02045624330639839,
        -0.005117958877235651,
        -0.011132437735795975,
        0.005542831029742956,
        0.006439351011067629,
        0.00465410714969039,
        -0.004463109653443098,
        -0.014219583943486214,
        -0.000830255274195224,
        0.0054726689122617245,
        0.006501717492938042,
        0.013697263784706593,
        0.031105339527130127,
        -0.02014441043138504,
        -0.0004565429699141532,
        -0.020487425848841667,
        0.005308956373482943,
        0.01691693812608719,
        -0.010321671143174171,
        -0.009666821919381618,
        0.0006202553049661219,
        -0.0002002552355406806,
        -0.0008658237638883293,
        -0.006162599194794893,
        0.02020677737891674,
        -0.00183591665700078,
        0.002200371352955699,
        -0.0032528077717870474,
        0.01589568518102169,
        -0.00022571347653865814,
        0.007000650279223919,
        0.01572417840361595,
        0.009846126660704613,
        -0.006770673673599958,
        -0.01098431646823883,
        0.0015747565776109695,
        0.013884363695979118,
        0.02171916700899601,
        -0.009721392765641212,
        0.009768168441951275,
        0.014757495373487473,
        -0.00148218113463372,
        0.008848261088132858,
        0.008793690241873264,
        -0.009666821919381618,
        -0.005620789248496294,
        0.00029965199064463377,
        -0.0084662651643157,
        -0.02171916700899601,
        -0.0013516010949388146,
        0.0006373086362145841,
        -0.013291880488395691,
        0.01273837685585022,
        -0.014788678847253323,
        -0.001715081394650042,
        0.006330209318548441,
        0.006529002916067839,
        0.013580325990915298,
        0.01814867928624153,
        0.009604455903172493,
        0.0003737123333849013,
        0.001080696121789515,
        -0.01819545403122902,
        0.012457727454602718,
        -0.0054180980660021305,
        0.028407983481884003,
        -0.01983257755637169,
        -0.00010274653322994709,
        -0.011031091213226318,
        0.01838255487382412,
        -0.010914154350757599,
        -0.014141625724732876,
        0.01827341318130493,
        -0.00011176045518368483,
        -0.026287520304322243,
        0.009814943186938763,
        -0.023340698331594467,
        -0.018164271488785744,
        0.00326060364022851,
        0.01821104623377323,
        -0.007546358276158571,
        -0.01031387597322464,
        -0.015155082568526268,
        -0.02474394626915455,
        0.014126033522188663,
        -0.000861925829667598,
        -0.01483545359224081,
        -0.013206126168370247,
        -0.019162137061357498,
        -0.018476104363799095,
        -0.00797512847930193,
        -0.009121114388108253,
        0.011007703840732574,
        0.014843249693512917,
        -0.005644177086651325,
        -0.009425152093172073,
        -0.014211787842214108,
        0.017696522176265717,
        -0.013798609375953674,
        -0.0012093272525817156,
        0.009199072606861591,
        0.006345801055431366,
        -0.00040513926069252193,
        0.0098929014056921,
        -0.012021161615848541,
        0.0001522621896583587,
        -0.025242879986763,
        0.004252622369676828,
        -0.027831092476844788,
        0.031198889017105103,
        0.013354247435927391,
        0.00687201926484704,
        -0.021064316853880882,
        0.013159351423382759,
        -0.020970767363905907,
        0.0026583762373775244,
        0.007678886875510216,
        0.008965197950601578,
        0.019676661118865013,
        0.00039563808240927756,
        0.0012210210552439094,
        0.0036387010477483273,
        0.01983257755637169,
        -0.003447703318670392,
        0.0020113226491957903,
        -0.010267101228237152,
        0.002467378508299589,
        0.010516567155718803,
        0.002613550052046776,
        0.005012715235352516,
        0.022186916321516037,
        -0.01389215886592865,
        -0.018304595723748207,
        0.01241095270961523,
        0.010680279694497585,
        0.010407425463199615,
        0.013736242428421974,
        -0.01347118429839611,
        -0.0029409746639430523,
        -0.017010489478707314,
        0.002808445831760764,
        0.012629235163331032,
        0.004751555155962706,
        0.013416613452136517,
        -0.00979935098439455,
        -0.00583907263353467,
        0.008606590330600739,
        -0.006478330120444298,
        0.00643155537545681,
        -0.014203991740942001,
        -0.008318144828081131,
        -0.017556196078658104,
        -0.02214014157652855,
        0.015615036711096764,
        -0.019380420446395874,
        -0.010438608936965466,
        -0.0009647332481108606,
        0.008879443630576134,
        -0.023979956284165382,
        -0.004314988851547241,
        -0.0018622275674715638,
        -0.007990719750523567,
        -0.0037400468718260527,
        -0.017868028953671455,
        0.0035217637196183205,
        -0.017244363203644753,
        0.006805754732340574,
        -0.01880352944135666,
        -0.0006353596691042185,
        -0.018585246056318283,
        0.002699304139241576,
        0.0005111137288622558,
        -0.012488910928368568,
        -0.0011947101447731256,
        0.005827378947287798,
        -0.007686682976782322,
        -0.0011722970521077514,
        0.005301160737872124,
        -0.001542598707601428,
        -0.0002140197466360405,
        0.015872297808527946,
        0.013634896837174892,
        0.01674543134868145,
        0.004424130544066429,
        0.0020814852323383093,
        -0.007862089201807976,
        -0.005648074671626091,
        -0.01808631233870983,
        -0.004864594433456659,
        -0.016340047121047974,
        0.00968241412192583,
        0.004252622369676828,
        0.0007859165780246258,
        0.007043527439236641,
        0.01697930507361889,
        0.005994989071041346,
        -0.024400930851697922,
        -0.019162137061357498,
        -0.007328074891120195,
        -0.002276380779221654,
        -0.01977021060883999,
        0.010906358249485493,
        -0.006821346469223499,
        0.00012680396321229637,
        0.008489652536809444,
        -0.007869884371757507,
        0.007569745648652315,
        -0.010508771054446697,
        -0.013821996748447418,
        -0.0006738515803590417,
        -0.026848819106817245,
        0.029218750074505806,
        -0.003420417895540595,
        0.014383296482264996,
        -0.01651155576109886,
        -0.003463295055553317,
        -0.021282600238919258,
        -0.004162970464676619,
        -0.004728167317807674,
        -0.002034710254520178,
        0.014445662498474121,
        0.004568353295326233,
        -0.0005379118956625462,
        -0.012122507207095623,
        -0.0016429700190201402,
        0.012691602110862732,
        -0.005531137343496084,
        -0.002239350462332368,
        -0.00571823725476861,
        -0.015942461788654327,
        0.01407146267592907,
        -0.0007313457899726927,
        -0.007242321036756039,
        0.0029273321852087975,
        0.012878702022135258,
        0.020721301436424255,
        0.005207610782235861,
        0.045402880758047104,
        0.010212530381977558,
        0.012660418637096882,
        -0.005082877352833748,
        8.427712600678205e-06,
        -0.00767498929053545,
        -0.01941160298883915,
        -0.033709146082401276,
        0.056815966963768005,
        0.0073592583648860455,
        0.027160651981830597,
        -0.014967982657253742,
        -0.00014069027383811772,
        0.006914896424859762,
        0.007936148904263973,
        0.0005145244067534804,
        -0.00909772701561451,
        0.022982090711593628,
        0.005441485438495874,
        0.0016039909096434712,
        0.026225153356790543,
        0.011124641634523869,
        0.01970784366130829,
        0.02698914334177971,
        0.00734366662800312,
        0.025866545736789703,
        0.008271370083093643,
        -0.023917589336633682,
        -0.004919165279716253,
        0.0018583296332508326,
        -0.00012729119043797255,
        0.005453179124742746,
        0.019816985353827477,
        0.011483249254524708,
        0.01691693812608719,
        -0.00873911939561367,
        0.019068585708737373,
        0.004135685041546822,
        0.0053596291691064835,
        -0.003188492264598608,
        0.013486776500940323,
        -0.007811415940523148,
        0.005585708189755678,
        0.0034710909239947796,
        0.005550627131015062,
        0.016792206093668938,
        -0.0016994897741824389,
        0.0013866822700947523,
        -0.018289003521203995,
        0.012247240170836449,
        0.012184873223304749,
        0.0010553597239777446,
        0.00016846289508976042,
        0.0019489560509100556,
        -0.019442785531282425,
        0.02207777462899685,
        -0.013026822358369827,
        0.009565476328134537,
        -0.01298004761338234,
        0.002683712635189295,
        0.0028123436495661736,
        -0.014009096659719944,
        -0.0020269143860787153,
        0.00447480333968997,
        -0.0277843177318573,
        0.0041434806771576405,
        -0.004209745209664106,
        0.0111948037520051,
        -0.0029663112945854664,
        -0.01796158030629158,
        0.0031144318636506796,
        -0.005016612820327282,
        -0.031339213252067566,
        -0.02203099988400936,
        -0.0225767083466053,
        -0.019255686551332474,
        0.01291768066585064,
        0.013291880488395691,
        -0.01930246129631996,
        -0.003085197415202856,
        -0.037045758217573166,
        -0.01018914207816124,
        -0.009814943186938763,
        -0.011522228829562664,
        -0.008209003135561943,
        -0.01588789001107216,
        -0.002601856365799904,
        -0.01276956032961607,
        0.019754618406295776,
        -0.007604826707392931,
        -0.013876567594707012,
        -0.014079258777201176,
        0.003755638375878334,
        0.028439167886972427,
        -0.0016536893090233207,
        0.0018339677480980754,
        0.0006655685137957335,
        -0.005819582846015692,
        0.012722785584628582,
        0.009768168441951275,
        -0.003149513155221939,
        0.0030423204880207777,
        0.004872390069067478,
        0.020487425848841667,
        -0.0024381440598517656,
        0.01128835417330265,
        0.0017394432798027992,
        0.010196938179433346,
        -0.005180325359106064,
        0.023278331384062767,
        -0.005772808101028204,
        -0.00023582369612995535,
        0.018725570291280746,
        -0.012223852798342705,
        0.019754618406295776,
        -0.012255036272108555,
        0.011756103485822678,
        -0.0046229236759245396,
        0.007339768577367067,
        0.029592949897050858,
        -0.011116845533251762,
        0.02117345854640007,
        0.002545336727052927,
        0.0024771231692284346,
        0.008801485411822796,
        -0.0036445478908717632,
        -0.005230998154729605,
        -0.0016595361521467566,
        -0.0053206500597298145,
        0.012972251512110233,
        0.008045290596783161,
        0.0328671969473362,
        -0.005028306972235441,
        0.02809615060687065,
        -0.0048022279515862465,
        -0.00479443185031414,
        -0.006299026310443878,
        0.00536742527037859,
        0.011545616202056408,
        -0.023621348664164543,
        -0.005285569000989199,
        0.00559740187600255,
        0.01930246129631996,
        0.013572529889643192,
        0.01039962936192751,
        0.0020269143860787153,
        0.004907471593469381,
        -0.0021867286413908005,
        -0.017727704718708992,
        -0.001994756516069174,
        0.007573643233627081,
        -0.019614294171333313,
        -0.015194062143564224,
        -0.011062274686992168,
        -0.0197234358638525,
        0.003860882017761469,
        0.0029955455102026463,
        -0.019926127046346664,
        -0.001814478193409741,
        0.004568353295326233,
        0.015303202904760838,
        0.004891879856586456,
        -0.004182459786534309,
        -0.002403062768280506,
        0.0040733180940151215,
        -0.004938654601573944,
        0.024946637451648712,
        -0.018881486728787422,
        -0.002991647692397237,
        0.025928912684321404,
        0.009877309203147888,
        0.00571823725476861,
        0.012216056697070599,
        0.006174292881041765,
        0.02050301805138588,
        -0.0019996289629489183,
        0.0010348956566303968,
        -0.0029624132439494133,
        0.0012629235861822963,
        -0.017696522176265717,
        -0.0036581906024366617,
        0.00606904923915863,
        -0.014648353680968285,
        0.01819545403122902,
        0.01758738048374653,
        -0.0006572854472324252,
        0.006856427527964115,
        0.005176427308470011,
        0.001913874875754118,
        0.013751834630966187,
        0.016651881858706474,
        -6.524435320898192e-06,
        0.01237976923584938,
        -0.02190626598894596,
        0.014328725636005402,
        0.01350236777216196,
        0.000279918807791546,
        0.006166497245430946,
        -0.007031833752989769,
        0.014032484032213688,
        0.010586729273200035,
        -0.01116362027823925,
        -0.01265262346714735,
        -0.004646311514079571,
        -0.014531416818499565,
        -0.014149420894682407,
        0.0022744317539036274,
        -0.010337263345718384,
        0.0014120186679065228,
        -0.005702645517885685,
        -0.019692253321409225,
        -0.019926127046346664
    ],
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/b9cca8d2bef50b69ced30e3a802a565dda609a8a.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192047Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=5be1f942921cd29546e8ae56f75f2debbf5200f4279d52611fd792488e664532",
    "social_links": [
        "https://www.linkedin.com/company/vetcove",
        "https://twitter.com/vetcove",
        "https://www.facebook.com/vetcove/",
        "https://www.crunchbase.com/organization/vetcove-2",
        "https://github.com/vetcove"
    ],
    "logo_path": "data/logos\\Vetcove_logo.png"
}