{
  "links": "https://www.ycombinator.com/companies/votingworks",
  "name": "VotingWorks",
  "headline": "Non-profit building open-source voting machines for US elections.",
  "batch": "W19",
  "description": "VotingWorks is a non-partisan non-profit founded on the powerful idea that the operating system of our democracy should be publicly owned. Every citizen’s vote is sacred, and every citizen deserves evidence that our elections are free and fair.\r\n\nForty states use voting machines that are over ten years old. Their technology is outdated, their source code proprietary and their security vulnerabilities – described in detail by the security community over many years – are left unpatched. It’s not surprising that 76% of voters are concerned that our elections are vulnerable to hacking. And if voters lose trust in elections, then the very foundation of our democracy is at risk.\r\n\nWe’re using open-source software, off-the-shelf hardware, and modern product engineering to make elections dramatically safer, more accessible, and more affordable. Affordability may sound pedestrian, but it is key. The front line of America’s election security rests in the hands of the 50% of US counties that struggle to afford basic services, let alone upgrade aging voting equipment.",
  "activity_status": "Active",
  "website": "https://voting.works",
  "founded_date": 2018.0,
  "team_size": 18.0,
  "location": "CA",
  "group_partner": null,
  "group_partner_yc": null,
  "company_linkedin": null,
  "company_twitter": null,
  "tags": "industry:election-tech",
  "founders": [],
  "status": true,
  "markdown": "raw_markdown='[![VotingWorks logo](https://cdn.prod.website-files.com/6019f09d7421c167cbfeaafd/603817c9f25cc17ddc8a873e_votingworks-wordmark-white.svg)](https://voting.works/</>)[Machines](https://voting.works/</machines>)[Audits](https://voting.works/</audits>)[Docs](https://voting.works/<https:/docs.voting.works/>)[About](https://voting.works/</about>)[Contact](https://voting.works/</contact>)\\n# Elections you can trust.\\n## VotingWorks is a non-profit on a mission to increase trust in elections with transparent, simple, and secure technology.\\n## Voting Machines\\nThe only open-source voting system in the United States. Designed to VVSG 2.0.\\nAll voters can independently mark, verify, and cast a paper ballot by hand or using a ballot marking device.\\nIndustry-leading data authentication and tamper evidence guarantee system integrity.\\n[Learn More](https://voting.works/</machines>)\\n## Post-Election Audits\\nOur open-source post-election auditing tool enables election officials to confirm election results by hand counting a sample of the paper ballots.\\n10 states conduct rigorous post-election audits with VotingWorks — from traditional audits to risk-limiting audits.\\n[Learn More](https://voting.works/</audits>)\\n[![VotingWorks logo](https://cdn.prod.website-files.com/6019f09d7421c167cbfeaafd/603817c9f25cc17ddc8a873e_votingworks-wordmark-white.svg)](https://voting.works/</>)\\n  * [Machines](https://voting.works/</machines>)\\n  * [Audits](https://voting.works/</audits>)[Docs](https://voting.works/<https:/docs.voting.works/>)\\n\\n\\n  * [About](https://voting.works/</about>)[Careers](https://voting.works/<https:/votingworks.breezy.hr/>)[News](https://voting.works/</news>)\\n\\n\\n[Contact](https://voting.works/</contact>)[Donate](https://voting.works/</donate>)\\nVotingWorks is a 501(c)(3) registered nonprofit organization and does not support or oppose any political candidate or party.\\n' markdown_with_citations='![VotingWorks logo⟨1⟩](https://voting.works/</>)Machines⟨2⟩Audits⟨3⟩Docs⟨4⟩About⟨5⟩Contact⟨6⟩\\n# Elections you can trust.\\n## VotingWorks is a non-profit on a mission to increase trust in elections with transparent, simple, and secure technology.\\n## Voting Machines\\nThe only open-source voting system in the United States. Designed to VVSG 2.0.\\nAll voters can independently mark, verify, and cast a paper ballot by hand or using a ballot marking device.\\nIndustry-leading data authentication and tamper evidence guarantee system integrity.\\nLearn More⟨2⟩\\n## Post-Election Audits\\nOur open-source post-election auditing tool enables election officials to confirm election results by hand counting a sample of the paper ballots.\\n10 states conduct rigorous post-election audits with VotingWorks — from traditional audits to risk-limiting audits.\\nLearn More⟨3⟩\\n![VotingWorks logo⟨1⟩](https://voting.works/</>)\\n  * Machines⟨2⟩\\n  * Audits⟨3⟩Docs⟨4⟩\\n\\n\\n  * About⟨5⟩Careers⟨7⟩News⟨8⟩\\n\\n\\nContact⟨6⟩Donate⟨9⟩\\nVotingWorks is a 501(c)(3) registered nonprofit organization and does not support or oppose any political candidate or party.\\n' references_markdown='\\n\\n## References\\n\\n⟨1⟩ https://cdn.prod.website-files.com/6019f09d7421c167cbfeaafd/603817c9f25cc17ddc8a873e_votingworks-wordmark-white.svg: ![VotingWorks logo\\n⟨2⟩ https://voting.works/</machines>: Machines\\n⟨3⟩ https://voting.works/</audits>: Audits\\n⟨4⟩ https://voting.works/<https:/docs.voting.works/>: Docs\\n⟨5⟩ https://voting.works/</about>: About\\n⟨6⟩ https://voting.works/</contact>: Contact\\n⟨7⟩ https://voting.works/<https:/votingworks.breezy.hr/>: Careers\\n⟨8⟩ https://voting.works/</news>: News\\n⟨9⟩ https://voting.works/</donate>: Donate\\n' fit_markdown='' fit_html=''",
  "generated_description": "### VotingWorks - A New Era of Election Integrity\n\nVotingWorks is a non-profit organization with a crucial mission: to build open-source voting machines for U.S. elections. Founded in 2018 and part of Y Combinator’s Batch W19, VotingWorks is grounded in the belief that the system underpinning our democracy should be publicly owned. Every citizen’s vote is sacred, and they deserve assurance that elections are conducted freely and fairly.\n\n#### The Problem with Current Voting Systems\n\nTake a moment to consider that forty U.S. states still rely on voting machines that are over a decade old. These systems are not only outdated, but they also have proprietary source codes filled with vulnerabilities that have been flagged by security experts for years. A staggering 76% of voters are worried that elections could be hacked, and when trust in the electoral process wanes, democracy itself is at risk.\n\n#### The VotingWorks Solution\n\nVotingWorks aims to change that landscape by leveraging open-source software, off-the-shelf hardware, and contemporary product engineering. Their approach makes elections not only safer and more accessible but also significantly more affordable. Think about the many counties across the U.S. — especially those struggling financially — that need reliable election equipment but can't afford it. Ensuring that every county can implement up-to-date technology is a crucial part of safeguarding the democratic process.\n\n#### What They Offer\n\n1. **Voting Machines**: VotingWorks is the only provider of open-source voting systems in the U.S., designed to meet the Voluntary Voting System Guidelines (VVSG) 2.0. This ensures that every voter can independently verify and cast their ballot securely, either on paper or through a ballot marking device.\n\n2. **Post-Election Audits**: They provide an open-source auditing tool that allows election officials to verify results by manually counting samples of paper ballots. Currently, ten states use this tool for various types of post-election audits.\n\n#### The Team\n\nBased in California, VotingWorks is a lean team of 18 dedicated professionals, guided by their Group Partner, Nan. Despite its size, the company is making significant strides in election technology, emphasizing transparency and trust.\n\n#### Why It Matters\n\nVotingWorks doesn’t just build technology; they are fostering a belief that elections can be conducted with the highest levels of security and integrity. By making their systems accessible and affordable, they are ensuring that the backbone of democracy remains strong.\n\nIf you want to learn more or get involved, check out their website at [VotingWorks](https://voting.works).\n\nIn a time where election security is paramount, VotingWorks stands as a beacon of hope, proving that it's possible for technology to serve the public good and keep the foundations of democracy intact."
}