{
  "links": "https://www.ycombinator.com/companies/weathercheck",
  "name": "WeatherCheck",
  "headline": "WeatherCheck monitors properties for hail damage so that insuranceâ¦",
  "batch": "W19",
  "description": "WeatherChecks application tells anyone when severe hail is about to strike and when it has in fact impacted a property. Using state of the science technologies we compute and analyze geo-weather data faster than every weather company globally. This allows companies, insurance companies specifically to gain dynamic insight into their overall exposure and enabling them to respond more quickly and efficiently to disaster.",
  "activity_status": "Active",
  "website": "https://www.weathercheck.co/",
  "founded_date": null,
  "team_size": 10.0,
  "location": "Louisville, KY",
  "group_partner": null,
  "group_partner_yc": null,
  "company_linkedin": null,
  "company_twitter": null,
  "tags": "industry:weather; industry:insurance",
  "founders": [
    {
      "name": "Jermaine Watkins",
      "description": "I am a seasoned CTO with 20+ years of experience in creating complex, web-based applications, and e-commerce applications. Proven ability to lead software development teams. Strong understanding of AI, machine learning, server-less, and distributed systems.",
      "linkedin": "https://linkedin.com/in/jermainewatkins"
    },
    {
      "name": "Demetrius Gray",
      "description": null,
      "linkedin": "https://www.linkedin.com/in/demetriusgray/"
    }
  ],
  "status": true,
  "markdown": "raw_markdown=\"#  Connection timed out Error code 522\\nVisit [cloudflare.com](https://www.weathercheck.co/<https:/www.cloudflare.com/5xx-error-landing?utm_source=errorcode_522&utm_campaign=digitalequityforlearning.org>) for more information. \\n2025-02-19 16:07:04 UTC\\nYou\\n###  Browser \\nWorking\\n[ ](https://www.weathercheck.co/<https:/www.cloudflare.com/5xx-error-landing?utm_source=errorcode_522&utm_campaign=digitalequityforlearning.org>)\\nLondon\\n###  [ Cloudflare ](https://www.weathercheck.co/<https:/www.cloudflare.com/5xx-error-landing?utm_source=errorcode_522&utm_campaign=digitalequityforlearning.org>)\\nWorking\\ndigitalequityforlearning.org\\n###  Host \\nError\\n## What happened?\\nThe initial connection between Cloudflare's network and the origin web server timed out. As a result, the web page can not be displayed.\\n## What can I do?\\n### If you're a visitor of this website:\\nPlease try again in a few minutes.\\n### If you're the owner of this website:\\nContact your hosting provider letting them know your web server is not completing requests. An Error 522 means that the request was able to connect to your web server, but that the request didn't finish. The most likely cause is that something on your server is hogging resources. [Additional troubleshooting information here.](https://www.weathercheck.co/<https:/support.cloudflare.com/hc/en-us/articles/200171906-Error-522>)\\nCloudflare Ray ID: **914781085a9bcd35** • Your IP: Click to reveal 103.97.165.190 • Performance & security by [Cloudflare](https://www.weathercheck.co/<https:/www.cloudflare.com/5xx-error-landing?utm_source=errorcode_522&utm_campaign=digitalequityforlearning.org>)\\n\" markdown_with_citations=\"#  Connection timed out Error code 522\\nVisit cloudflare.com⟨1⟩ for more information. \\n2025-02-19 16:07:04 UTC\\nYou\\n###  Browser \\nWorking\\n ⟨1⟩\\nLondon\\n###   Cloudflare ⟨1⟩\\nWorking\\ndigitalequityforlearning.org\\n###  Host \\nError\\n## What happened?\\nThe initial connection between Cloudflare's network and the origin web server timed out. As a result, the web page can not be displayed.\\n## What can I do?\\n### If you're a visitor of this website:\\nPlease try again in a few minutes.\\n### If you're the owner of this website:\\nContact your hosting provider letting them know your web server is not completing requests. An Error 522 means that the request was able to connect to your web server, but that the request didn't finish. The most likely cause is that something on your server is hogging resources. Additional troubleshooting information here.⟨2⟩\\nCloudflare Ray ID: **914781085a9bcd35** • Your IP: Click to reveal 103.97.165.190 • Performance & security by Cloudflare⟨1⟩\\n\" references_markdown='\\n\\n## References\\n\\n⟨1⟩ https://www.weathercheck.co/<https:/www.cloudflare.com/5xx-error-landing?utm_source=errorcode_522&utm_campaign=digitalequityforlearning.org>: cloudflare.com\\n⟨2⟩ https://www.weathercheck.co/<https:/support.cloudflare.com/hc/en-us/articles/200171906-Error-522>: Additional troubleshooting information here.\\n' fit_markdown='' fit_html=''",
  "generated_description": "**WeatherCheck: Overview**\n\nFounded out of Louisville, KY, WeatherCheck is a cutting-edge company that has made significant strides in weather monitoring, particularly focusing on hail damage. As part of the Y Combinator Batch W19, it brings a unique solution to the insurance industry, enabling insurers to assess property risk in real-time.\n\n**Mission and Technology**\n\nThe mission of WeatherCheck is straightforward yet critical: to monitor properties for hail damage so that insurance companies can respond more swiftly and accurately. They leverage advanced geo-weather data analysis—claiming to compute and analyze this data faster than any other weather company worldwide. This informs insurers of their exposure to severe weather events, allowing them to act decisively during disasters.\n\n**The Team and Structure**\n\nWeatherCheck operates with a lean team of about 10 employees, ensuring agility and effective communication within the organization. Their hands-on approach allows them to innovate and adapt quickly in an ever-changing weather landscape.\n\n**Current Activities**\n\nWhile the company seems to be facing some technical difficulties with its website (noted by a connection timeout error), it remains clear that the primary focus is on integrating advanced weather technology into the insurance framework. This reflects a growing trend of applying tech-driven insights to traditional sectors, marking a significant shift toward data-informed decision-making in insurance.\n\n**Conclusion**\n\nIn essence, WeatherCheck sits at the nexus of weather technology and insurance, providing essential tools for risk assessment and response. The intersection of these domains is ripe for growth, and with their innovative approach, WeatherCheck is positioning itself to be a key player in the future of property insurance. \n\nFor more information, you can check out their website: [WeatherCheck](https://www.weathercheck.co/)."
}