{
  "links": "https://www.ycombinator.com/companies/wishroll",
  "name": "WishRoll",
  "headline": "Building something new in Consumer AI",
  "batch": "W22",
  "description": null,
  "activity_status": "Active",
  "website": "https://www.wishroll.co/",
  "founded_date": 2022.0,
  "team_size": 5.0,
  "location": "New York",
  "group_partner": "Michael Seibel",
  "group_partner_yc": "https://www.ycombinator.com/people/michael-seibel",
  "company_linkedin": null,
  "company_twitter": null,
  "tags": "industry:social; industry:music; location:new-york",
  "founders": [
    {
      "name": "Fai Nur, Founder",
      "description": "CEO and co-founder of WishRoll. Former Snap and FB. Working and living in NYC!",
      "linkedin": "https://www.linkedin.com/in/fainur/"
    },
    {
      "name": "Blossom Okonkwo, Founder",
      "description": "marketing and growth",
      "linkedin": "https://www.linkedin.com/in/blossom-okonkwo-21807b160/"
    },
    {
      "name": "Great Okonkwo, Founder",
      "description": "Build something people love!",
      "linkedin": "https://linkedin.com/in/greatokonkwo"
    }
  ],
  "status": true,
  "markdown": null,
  "generated_description": "**Company Overview: WishRoll**\n\nWishRoll is an exciting venture at the intersection of consumer technology and artificial intelligence, founded in 2022. The company began as a small seed of an idea and has since grown into a part of Y Combinator's Winter 2022 batch—an endorsement that speaks volumes about its potential.\n\nThe team is currently based in New York City and consists of just five ambitious employees. This lean structure allows for agility and rapid iteration, crucial traits for any startup trying to carve out a niche in the tech world. They benefit from the mentorship of Michael Seibel, a notable figure in the entrepreneurial landscape, who serves as their Group Partner at Y Combinator.\n\nWishRoll's mission is clear: they aspire to build something new in the realm of consumer AI. This focus hints at a creative approach to technology—one that could potentially reshape how we interact with our devices and access information. \n\nThe company's characteristics are pretty interesting too; they are tagged with terms like 'social,' 'music,' and, of course, 'New York,' suggesting they may be looking to integrate elements of community, culture, and perhaps even entertainment into their product.\n\nWhile the specifics of what they are currently doing remain a bit vague, the potential is certainly there for WishRoll to disrupt the realm of consumer technology. It’s a space to watch, especially as they further develop their offerings in the growing field of AI."
}