{
  "links": "https://www.ycombinator.com/companies/wuri",
  "name": "Wuri",
  "headline": "App to read fiction stories as visual novels with images, videos,â¦",
  "batch": "W24",
  "description": "Wuri is an app for reading fiction stories that transforms stories into visual novels having audio, images & video. This opens a new world of storytelling for our writers and readers, who can now offer or consume stories in the format of their choice.",
  "activity_status": "Active",
  "website": "https://www.wuri.in/",
  "founded_date": 2023.0,
  "team_size": 7.0,
  "location": null,
  "group_partner": "Harj Taggar",
  "group_partner_yc": "https://www.ycombinator.com/people/harj-taggar",
  "company_linkedin": null,
  "company_twitter": null,
  "tags": null,
  "founders": [
    {
      "name": "Akshay Megharaj, Founder",
      "description": "Akshay has 8+ years experience of working as a software engineer at consumer startups in India including decacorns Flipkart & Swiggy. Akshay was the first engineer at Flipkart Commerce Cloud, which is a new cloud offering from Flipkart currently valued at $3 billion internally.",
      "linkedin": "https://linkedin.com/in/akshay-megharaj-aba3646"
    },
    {
      "name": "Pratik Gangwal, Founder",
      "description": "Pratik is an engineer from BITS Pilani, India (â11-â15) and an MBA from IIM Calcutta (â15-â17). 5 years of consulting with his last stint with Bain & Company. Led projects for tech & consumer clients. After that, he & Akshay built a consumer ed-tech platform to $12k MRR before starting Wuri.",
      "linkedin": "https://linkedin.com/in/pratikgangwal"
    }
  ],
  "status": true,
  "markdown": null,
  "generated_description": "Wuri is an innovative startup that aims to revolutionize the way we experience storytelling. Founded in 2023, Wuri has emerged as a part of Y Combinator’s Batch W24, which gives it a solid foundation and mentorship from one of the most recognized accelerators in the tech world. \n\nThe core mission of Wuri is to create an app that transforms traditional fiction stories into immersive visual novels. By incorporating elements like audio, images, and videos, Wuri not only enhances the reader's experience but also provides writers with a new medium to express their stories. This approach opens up a world of possibilities, making storytelling more engaging and accessible for both writers and readers.\n\nCurrently, Wuri operates with a small team of seven employees, all focused on developing this creative platform. They are guided by Harj Taggar, their Group Partner, who likely helps steer the company with valuable insights and support. Although specific details about ongoing projects are sparse, the potential for growth in the realm of interactive storytelling is vast.\n\nIf you're interested in exploring modern narratives that capture the imagination in new and dynamic ways, Wuri seems like a company to keep an eye on. Check out their progress at [wuri.in](https://www.wuri.in/)."
}