{
    "links": "https://www.ycombinator.com/companies/yardbook",
    "name": "Yardbook",
    "headline": "Marketplace & Software Revolutionizing Yard Care",
    "batch": "W16",
    "description": "At Yardbook we know how proud you are to own and operate your own landscaping business. We also know how challenging it can be to make sure everything is running smoothly. With this in mind we are pleased to offer our free software for running landscaping businesses!\r\n\nYardbook is designed to provide an end-to-end solution in helping businesses with a multitude of roles such as creating schedules, estimates, completing invoices, payments, timesheets and so much more.\r\n\nSince we launched a little over a year ago, over 7,000 businesses in the US are now powered by Yardbook. During that time we have processed millions of dollars in invoices and helped owners, like you, organize their many administrative responsibilities.\r\n\nIf you’re still using paper and pencil, or juggling between many different systems or spreadsheets in order to stay organized, give Yardbook a try today!",
    "activity_status": "Active",
    "website": "https://www.yardbook.com",
    "founded_date": null,
    "team_size": null,
    "location": "San Mateo, CA",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:marketplace; location:san-francisco-bay-area",
    "founders": [],
    "status": true,
    "markdown": "raw_markdown='Toggle navigation [ Yardbook ](https://www.yardbook.com/<#intro>)\\n  * [Home](https://www.yardbook.com/<#body>)\\n  * [Features](https://www.yardbook.com/<#features>)\\n  * [Support](https://www.yardbook.com/<http:/support.yardbook.com>)\\n  * [Log In](https://www.yardbook.com/</users/sign_in>)\\n  * [SIGN UP FREE](https://www.yardbook.com/</users/sign_up>)\\n\\n\\n  * #  RUN AND GROW YOUR  **LANDSCAPING BUSINESS**\\nPromote Services, Manage Customer Data, Generate Estimates, Schedule Jobs, Manage Billing, and much more. \\n[Watch Video](https://www.yardbook.com/<#my_video_1>) [Join Today - Free!](https://www.yardbook.com/</users/sign_up>)\\n[ Why is it free?](https://www.yardbook.com/<#why_is_free_fancybox>)\\nGet more business - [Claim your Yardbook profile today!](https://www.yardbook.com/<#raise_your_profile>)\\n\\n\\n# AS SEEN ON\\n![](https://www.yardbook.com/assets/pr_logos/techcrunch-17350501b3c15da56fca499ad5aad95f2655b45743a578ff394c8cd952d66011.png)\\n![](https://www.yardbook.com/assets/pr_logos/ycombinator-381145644835a64d82ce183c788e1270ac7254051ef0f38734eaa641aa5bdbd9.png)\\n![](https://www.yardbook.com/assets/pr_logos/inc-5cd5ad92c9bfe6f271dd6fbb4e0550cbb31ad3aa1da099fdef2ee313767d1450.png)\\n![](https://www.yardbook.com/assets/pr_logos/yahoonews-bcfe1b5742102c8870205ed51d2d6d9821366f2d75bb6ff1a4f9e23e2718b830.png)\\n![](https://www.yardbook.com/assets/pr_logos/entrepreneur-32c8c7c7c17fb7ec702066f86fd665724bddfb94f1ac4d6c7aa8cb945f795119.png)\\n![](https://www.yardbook.com/assets/pr_logos/landscapemgmt-d6797277fd6acfd8ed0a026f955c206510a4c49140ab431f7b274241b2675109.png)\\nOVER 20,000 COMPANIES ARE USING YARDBOOK\\nGet started for free today! \\n\"The thing I like best about Yardbook is how easy it is to get started. I was able to learn the system without any training.\" \\n- Jason L. \\n\"A very user friendly platform yet complex enough to handle all the details in running a business.\" \\n- [Buhler Landscape](https://www.yardbook.com/<http:/www.buhlerlandscape.com/>)\\n\"The guys at Yardbook clearly get software, and not only that, they understand customer service and the importance of interacting with their customers.\" \\n- [South Metro Lawn Care](https://www.yardbook.com/<http:/www.southmetrolawncare.com>)\\n\"The program is very easy to understand and if you can\\'t figure something out just send them a email and they will let you know how to resolve it very quickly which is hard to find in this day and age.\" \\n- [360 Lawn Care](https://www.yardbook.com/<http:/www.360lawncarenc.com>)\\n\"I had tried several programs but Yardbook was a perfect fit for my lawn care business. Easy to navigate and very professional looking invoices.\" \\n- [Mow N Lawns](https://www.yardbook.com/<http:/www.mownlawns.com/>)\\n\"The program is straight forward and easy to learn. The customer service is second to none.\" \\n- North Florida Lawns and More Inc. \\n[‹](https://www.yardbook.com/<#myCarousel>) [›](https://www.yardbook.com/<#myCarousel>)\\n[Read More](https://www.yardbook.com/</recommendations/customer_recommendations>)\\nA COMPLETE SUITE OF FEATURES\\n## SALES\\nCreate new relationships with your customers that keep them coming back\\n  * [Business Profile](https://www.yardbook.com/</pages/new_landscaper_profile>)\\n  * Lead Management\\n  * [Estimates](https://www.yardbook.com/</pages/invoice_landing_page>)\\n  * [Account Management](https://www.yardbook.com/</pages/start_landscaping_business_landing_page>)\\n  * [Text/Email Messages](https://www.yardbook.com/</pages/home>)\\n\\n\\n## BUSINESS OPERATIONS\\nSpend less time and money managing your business and more time growing it\\n  * [Job Scheduling](https://www.yardbook.com/</pages/job_scheduling_landing_page>)\\n  * [Routing](https://www.yardbook.com/</pages/routing_optimization_landing_page>)\\n  * Timesheets\\n  * GPS Tracking\\n  * Equipment Maint.\\n\\n\\n## FINANCE AND RECORDS\\nGet paid faster and manage your numbers with far less effort\\n  * Pricing Catalog\\n  * [Invoices & Payments](https://www.yardbook.com/</pages/invoice_landing_page>)\\n  * Expenses\\n  * Credit Cards\\n  * Chemical Tracking\\n\\n\\n![](https://www.yardbook.com/assets/yardbook2/mac_screen_shot_small-0a6f7df0de367bcc94e00a8d057a695e495267c0bd091e4a5f091ce26033dde6.png)\\n[VIEW DEMO ACCOUNT](https://www.yardbook.com/</customers?guest_user=Yes>)\\nPlay\\nCurrent Time 0:00\\n/\\nDuration Time 0:00\\nRemaining Time -0:00\\nStream TypeLIVE\\nLoaded: 0%\\nProgress: 0%\\n0:00\\nFullscreen\\n00:00\\nMute\\nPlayback Rate\\n1\\nSubtitles\\n  * subtitles off\\n\\n\\nCaptions\\n  * captions off\\n\\n\\nChapters\\n  * Chapters\\n\\n\\nThe video could not be loaded, either because the server or network failed or because the format is not supported.\\n#  RAISE YOUR PROFILE\\n####  Yardbook Profiles are designed to attract customers. Claim or create your Yardbook Profile page today\\n####  Put yourself out there so more homeowners can find you \\n####  Showcase your best work to the world \\n####  Define your services and where you work \\n####  Manage your inbound leads from a single platform \\n#### **It only takes a few minutes to get your profile up and running. Create your profile and start getting more business today!**\\n[ GET MY PROFILE ](https://www.yardbook.com/<#confirmHaveAccountModal>)\\n![](https://www.yardbook.com/assets/yardbook2/directorySamplePhoto-bc694ff69b9d482dc7be1d04f2954d8058584232858e60807ace379fa70bc363.jpg)\\n[Scroll Up ](https://www.yardbook.com/<>) [Scroll Down](https://www.yardbook.com/<>)\\n#  OUR MISSION \\n### **To provide landscapers with robust and easy-to-use online tools that empower them to efficiently grow their businesses and build long-lasting relationships with their customers.**\\n©2013-2025 Yardbook. All rights reserved. [Privacy & Terms](https://www.yardbook.com/<#tos>)\\n  * [](https://www.yardbook.com/<https:/www.facebook.com/yardbook>)\\n  * [](https://www.yardbook.com/<https:/www.twitter.com/yardbook>)\\n  * [](https://www.yardbook.com/<https:/plus.google.com/116201316210278363572/posts>)\\n\\n\\n## Privacy & Terms\\n## [Privacy Statement](https://www.yardbook.com/<#tos2>)\\nYardbook, Inc. (\"**Yardbook** \" \"**our** \" or \"**we** \") is committed to protecting your privacy and providing you a safe online experience. This Privacy Statement applies to the Yardbook website, including any optimized mobile version and related webpages and mobile application (collectively \"**Services** \"), and also governs its data collection and usage. By using our Services, you consent to the data practices described herein. If you do not agree to any part of this Privacy Statement, then you must immediately stop use of the Yardbook Services.\\n#### Collection of Personal Information\\nWhile the Yardbook Services may be utilized anonymously, when you register for our Services, we collect and store personally identifiable information (\"**PII** \"), including your name, billing address, e-mail, mailing address, ip-address, and telephone number.\\nYardbook also collects usage information about your computer hardware, software and usage when accessing our Services. This information can include your Internet Protocol (IP) address, operating system, browser type, domain names, access times and referring website addresses, items you click on, the pages you view and the amount of time you spend on a particular page. We use this information for the operation of the Services, to maintain the quality of the Services, and to provide general statistics regarding your use of our Services. \\nWe use third-party analytics tools to help us measure traffic and usage trends for the Services. These tools, such as Google Analytics and other Mobile Analytics Tools, collect information sent by your device or our Services, including the web pages you visit, add-ons, and other information that assists us in improving the Services. We collect and use this analytics information with analytics information from other users so that it cannot reasonably be used to identify any particular individual user.\\n#### Location Based Information\\nTo provide location-based features with our Services, we may collect, use, and share precise location data, including the real-time geographic location of your mobile device. Where available, location-based services may use GPS, along with cell tower locations, and other technologies to determine your device\\'s approximate location. You consent to location data being collected that personally identifies you when using specific features of our Services. For example, when you use your device to check in or check out at a specific location, your device will share its geographic location and the time of access. Other location data may be collected anonymously in a form that does not personally identify you and is used by Yardbook to provide and improve location-based products and services.\\n#### Photo/Image Uploads \\nOur app allows users to upload photos, including business logos, photos of completed work, and user photos. These photos are optional and the app will function correctly even if users do not upload any images. \\n* The business logo photo is displayed on customer-facing documents, while photos uploaded from different customer sites are displayed to customers after the work is done. The user photo is displayed on the user settings page. \\n* All user images are stored on Amazon AWS servers and are accessed using secure protocols (https). Our app takes reasonable measures to protect user images from unauthorized access or disclosure. \\n* Users have the right to delete their photos at any time from their own account. If a user deletes a photo, it will be removed from all customer-facing documents and from the app\\'s storage servers. \\n####  File Uploads \\nOur app allows users to upload attachment files that can be associated with different types of records. (Customer, Property, Invoices, Product and Services) \\n* All user files are stored on Amazon AWS servers and are accessed using secure protocols (https). Our app takes reasonable measures to protect user files from unauthorized access or disclosure. \\n* Users have the right to delete their files at any time from their own account. If a user deletes a file, it will be removed from the app\\'s storage servers. \\n#### Use of Personal Information\\nWe collect and use your PII to operate the Yardbook Services and deliver the services requested by you. Yardbook may also use PII to inform you of other products or services available from Yardbook and its affiliates.\\nWe may use the information we collect about you for a variety of purposes, including to:\\n  * Personalize and improve the Yardbook Services, and provide content, features, and/or advertisements that match your interests and preferences or otherwise customize your experience on the Yardbook Services;\\n  * Provide, operate, maintain and improve the Yardbook Services;\\n  * Send you technical notices, updates, security alerts and support and administrative messages;/li>\\n  * Provide and deliver the services and features you request, process and complete transactions, and send you related information, including purchase confirmations and invoices;\\n  * Respond to your comments, questions, and requests and provide customer service and support;\\n  * Communicate with you about services, features, offers, promotions, and provide other news or information about Yardbook and our affiliates;\\n  * Monitor and analyze trends, usage, and activities in connection with the Yardbook Services and for marketing or advertising purposes;\\n  * Investigate and prevent fraudulent transactions, unauthorized access to the Yardbook Services, and other illegal activities;\\n  * Track the ip-address of the online approver of an estimate;\\n  * Link or combine with other information we receive from third parties to help understand your needs and provide you with better service; and\\n  * For other purposes about which we notify you.\\n\\n\\n#### Processing\\nBy accessing or using the Yardbook Services, or otherwise providing information to us, you consent to the processing and transfer of information in and to the U.S. and other countries and territories, which may have different privacy laws from your country of residence.\\n#### Disclosure to Third Parties\\nYardbook takes your privacy seriously. We will not share PII about you with any third party except as described in this Privacy Statement or in connection with the Yardbook Services. Yardbook does not use or disclose sensitive personal information, such as race, religion, or political affiliations, without your explicit consent. However, how we disclose your personal information to third parties under this Agreement includes:\\n  * _Vendors, Consultants and Other Service Providers_ : We may share your information with third-party vendors, suppliers and other service providers who are working on our behalf and require access to your information to carry out that work, such as to process billing, provide customer support, perform statistical analysis, facilitate communication with you, arrange for deliveries, etc. All such third parties are prohibited from using your personal information except to provide these services to Yardbook, and they are required to maintain the confidentiality of your information.\\n  * _Business Transfers_ : We may disclose your information to a third party in connection with a corporate reorganization, merger, sale, joint venture, assignment, transfer or other disposition of all or any portion of our business, assets or stock, including in connection with any bankruptcy or similar proceedings.\\n  * _Compliance with Laws_ : We may disclose your information to a third party if (a) we believe that disclosure is reasonably necessary to comply with any applicable law, regulation, legal process or governmental request, (b) to enforce our agreements, policies and Terms of Service, (c) to protect the security or integrity of the Yardbook Services, (d) to protect Yardbook, our customers or the public from harm or illegal activities, or (e) to respond to an emergency which we believe in the good faith requires us to disclose information to assist in preventing the death or serious bodily injury of any person.\\n  * _Third Party Promotional Offers_ : Yardbook does not sell, rent or lease its customer lists to third parties. Yardbook may, from time to time, contact you on behalf of external business partners about a particular offering that may be of interest to you. In those cases, your unique PII (e-mail, name, address, telephone number) is not transferred to the third party.\\n  * _Advertisers and Affiliates_ : Yardbook does not send personal user-level information to advertisers and/or partners. Yardbook\\'s advertising partners provide contextual targeting services that solely rely on cookie-level tracking which contains no identifying information. Yardbook does not sell, trade, or otherwise transfer to outside parties your PII. \\n  * _Aggregated or Anonymized Data_ : We may also share aggregated or anonymized information with third parties that does not directly identify you.\\n\\n\\n#### Links to Third Party Websites\\nWe may place links on the Yardbook Services. We are not responsible for the practices and policies employed by any websites linked to or from our Services, including the information or content contained within them. Please remember that when you use a link to go from the Yardbook Services to another website, our Privacy Statement does not apply to those third-party websites. Your browsing and interaction on any third-party website, including those that have a link on our website, are subject to that third party\\'s own rules and policies. We recommend that you consult the privacy statements of all third-party websites you visit by clicking on the \"Privacy Policy\" link typically located at the bottom of the webpage you are visiting.\\n#### Protection of Personal Information\\nYardbook secures your PII from unauthorized access, use or disclosure by implementing a variety of security measures to maintain the safety of your PII. Yardbook secures the PII you provide on computer servers in a controlled, secure environment, protected from unauthorized access, use or disclosure. When PII is transmitted to other websites, it is protected through the use of encryption, such as the Secure Socket Layer (SSL) protocol. All supplied sensitive/credit information is transmitted via SSL. SSL certificates encrypt communication between the Yardbook Services and your web browser, preventing others from eavesdropping. \\n#### Use of Cookies\\nThe Yardbook website may use \"cookies\" to help you personalize your online experience. A cookie is a text file that is placed on your hard disk by a webpage server. Cookies cannot be used to run programs or deliver viruses to your computer. Cookies are uniquely assigned to you, and can only be read by a web server in the domain that issued the cookie to you.\\nOne of the primary purposes of cookies is to provide a convenience feature to save you time. The purpose of a cookie is to tell the Web server that you have returned to a specific page. For example, if you register with Yardbook, a cookie helps Yardbook recall your specific information on subsequent visits. This simplifies the process of recording your personal information, such as billing addresses, shipping addresses, etc. When you return to the same Yardbook website, the information you previously provided can be retrieved, so you can easily use the Yardbook features that you customized.\\n#### Personalized or Targeted Advertising and Do Not Track\\nWe believe that a more personalized experience will better serve your use of our Services and we may provide targeted advertising and other opportunities based upon our collection of PII from your use of our Services and use of other online websites. You may opt out of targeted advertising subject to the \"Do Not Track\" Policy below.\\nOther than as provided in this Privacy Statement we do not collect or use your PII. We may not recognize or respond to every type of \"do not track\" signal or other mechanisms that provide consumers the ability to exercise choice regarding the collection of PII about the individual user\\'s online activity, whether through our Services, third-party services or online services. We do not control any third party\\'s collection of your PII, including third parties that advertise on our Services or when you access a third-party site through our Services.\\nMany Web browsers are set to accept cookies by default. If you prefer, you can usually choose to set your browser to remove and reject cookies. If you choose to remove cookies or reject cookies (such as using an opt-out cookie), this could affect certain features or the user experience of our Services. Please note that cookie management tools provided by your browser usually will not remove Flash cookies. To learn how to manage privacy and storage settings for Flash cookies, visit the Adobe [Macromedia website.](https://www.yardbook.com/<https:/www.macromedia.com/support/documentation/en/flashplayer/help/settings_manager07.html>) Using do not track options provided by third party websites will not affect non-personalized ads on the Services and elsewhere, use of PII by Yardbook for other analytics purposes, such as to improve Services and track effectiveness and frequency of non-personalized ads. We encourage you to review the privacy policies of our third-party advertisers and analytics service providers to learn more about the information they collect from you. To opt out of Google Analytics, you can download the [Google Analytics Opt-out Browser Add-on.](https://www.yardbook.com/<https:/tools.google.com/dlpage/gaoptout>)\\n#### Google AdSense\\nWe may use Google AdSense from time to time to publish ads on our Services and when you click on such an ad, a cookie will be sent to your browser to help better provide advertisements that may be of interest to you on this and other websites. For further information regarding Google advertising and privacy policies or to opt-out of the use of such cookies, visit Google\\'s Advertising and Privacy page: [http://google.com/privacy_ads.html.](https://www.yardbook.com/<http:/google.com/privacy_ads.html>)\\n#### Account Information & Retention.\\nYou may update, correct or delete information about you at any time by logging into your online account and modifying your information or by emailing us at support@yardbook.com. We will retain your personal information for the period necessary to fulfill the purposes outlined in this Privacy Statement. If you wish to deactivate your account, please email us at support@yardbook.com, but note that we may retain certain information as required by law or for legitimate business purposes. We may also retain cached or archived copies of information about you for a certain period of time. To request removal of your PII from testimonials, contact us at the email address listed above. We will respond to your access request within thirty (30) days. In some cases, we may not be able to remove your PII, in which case we will let you know if we are unable to do so and why. We will retain your information for as long as your account is active or as needed to provide you services. We will retain and use your information to comply with our legal obligations, resolve disputes and enforce our agreements.\\n#### Promotional and SMS Communications.\\nYou may opt out of receiving promotional emails and SMS notifications from Yardbook by following the opt-out instructions provided in those emails or texting \"STOP\" to discontinue receiving text notifications. You may also opt-out of receiving promotional emails, SMS texts, push notifications and other promotional communications from us at any time by emailing support@yardbook.com with your specific request. If you opt out, we may still send you non-promotional communications, such as security alerts and notices related to your access to or use of the Yardbook Services or those about your online account or our ongoing business relations.\\n#### California Online Privacy Protection Act Compliance\\nBecause Yardbook values your privacy, we have taken the necessary precautions to be in compliance with the California Online Privacy Protection Act. Yardbook will not distribute your PII to outside parties without your consent, except as provided expressly herein. As part of the California Online Privacy Protection Act, all users of our site may make any changes to their information at any time by logging into the account link. \\nAs of January 1, 2005, California Civil Code §1798.83 permits visitors to this website who are residents of California to request information regarding Yardbook\\'s disclosure of their information to third parties for direct marketing purposes. To make such a request, please contact our customer support at support@yardbook.com.\\n#### Children\\'s Online Privacy Protection Act Compliance\\nWe are in compliance with the requirements of COPPA (Children\\'s Online Privacy Protection Act); we do not collect any information from anyone under 13 years of age. Our website, products and services are all directed to people who are at least 13 years old or older. If you become aware of a minor under the age of 13 using our Services or that the PII of anyone under the age of 13 has been collected, please contact us immediately at support@yardbook.com.\\n#### Information You Publicly Post\\nPII that you post to your public business profile becomes publicly available and is no longer considered PII. Yardbook has no control over how this information will be used. Your posting to such public business profile constitutes consent to share such information publicly, and you should assume that such information will be widely disseminated, including via search engines and other tools to locate information online (e.g., internet archive). You can always edit any information you post to your public profile.\\n#### Changes to this Privacy Statement\\nWe may change the provisions of this Privacy Policy at any time, and we will always post the most up-to-date version on our website at <https://www.yardbook.com/pages/tos>. We will notify you of significant changes to our Privacy Statement by placing a prominent notice on our site. All changes will go into effect immediately upon posting. You should periodically check the [Terms of Service](https://www.yardbook.com/<https:/www.yardbook.com/pages/tos>) webpage for Privacy Statement updates.\\n#### Questions\\nIf you have any questions or comments about the Privacy Policy or the practices relating to our Services, or you wish to verify, correct or delete any PII we have collected, please contact us at support@yardbook.com.\\n## Terms of Service\\n#### Acceptance of Terms\\nWelcome to Yardbook, dedicated to helping you run and grow your landscaping business. The following Terms of Service (\"**Terms** \" or \"**Agreement** \") govern and regulate your access to and use of [www.yardbook.com](https://www.yardbook.com/<https:/www.yardbook.com>), including any optimized mobile version and related webpages, and our mobile applications (\"**Services** \"). These Terms, along with our Privacy Statement, and any documents incorporated herein by reference, constitute a legally binding contract between Yardbook Inc. (\"**Yardbook,** \" \"**our,** \" \"**we** \") and you (\"**You** \" or \"**User** \").\\nPlease read all terms and conditions carefully before accessing our Services. If you do not agree to be bound by these Terms, you must immediately discontinue access of the Services because your continued access signifies your acceptance of the Agreement and any modification or revision thereto.\\nBY ACCESSING THE YARDBOOK SERVICES YOU ACKNOWLEDGE YOU HAVE THE AUTHORITY TO ENTER INTO THIS AGREEMENT, THAT YOU HAVE READ AND UNDERSTOOD AND UNCONDITIONALLY AGREED TO BE BOUND BY THE TERMS OF THIS AGREEMENT AND THAT THE TERMS OF THIS AGREEMENT WILL APPLY EACH TIME YOU ACCESS OUR SERVICES.\\n#### Summary of Service\\nYardbook is a vertical business application focused on the landscaping industry. Yardbook has been designed to save time and enhance organization--all in a user-friendly interface. Yardbook aims to provide landscapers with the most robust and easy-to-use online tools--empowering them to efficiently grow their business, and build long-lasting relationships with customers.\\n#### ACCOUNT ELIGIBILITY\\nBy accessing or using our Services (or any part thereof), or third party services or products offered in or linked to via our Services, you represent and warrant that (a) you are at least thirteen (13) years of age; (b) if registering for a business entity, that you possess the legal authority to enter into these Terms and form a binding agreement under applicable law; and (c) all information provided by you as part of the registration process or continued use of the Services is accurate, current and complete and remains up-to-date. If you are unable to fulfill all of these requirements, you must immediately stop all use and terminate your access to the Services.\\n#### USER RESPONSIBILITIES\\n#### Your Yardbook.com Account and Site\\n_Registration_ : Registration is not required to access and use the Services. However, some features of the Yardbook Services require you to register a user account. Registration requires you to provide a valid e-mail address and a password. We encourage you to use \"strong\" passwords (a password that uses a combination of upper and lower case letters, numbers and symbols) with your account.\\n_User Information_ : In order to fully use the Yardbook Services, you must register an account and provide personal identifying information, including, without limitation, your full name, e-mail address, telephone number, mailing address, and billing address (\"**PII** \"). We reserve the right, in our sole discretion, to deny registration of a user account, prohibit or deny you access to the Service (or any part thereof), with or without prior notice. The Privacy Statement above governs any PII you provide us. By using the Services, you agree to the terms of the Privacy Statement.\\n_Inactivity and Improper Use_ : Yardbook further retains the right to cancel unconfirmed user accounts or accounts that have been inactive for more than twelve (12) months or are considered to be deceptive or misleading, without prior notice to the User.\\n_Account Security_ : You are responsible for safeguarding the password that you use to access the Services and for all activity that occurs under your account. We encourage you to periodically change your password as an additional security measure. You may not share your account information with another person or use another user\\'s account. You are solely responsible for protecting any confidential or PPI sent from or stored on any computer, mobile phone or mobile device as a result of your use of the Services. You agree to immediately change your password and notify Yardbook of any suspected or unauthorized access associated with your use of the Services or any other breach of security.\\n#### Restrictions\\nYou agree to act responsibly and to treat other users with respect. Any user who engages in prohibited conduct may be removed from the Services or blocked from the website. While not an exhaustive list, you agree not to:\\n  * describe or assign keywords to your posts/activities in a misleading or unlawful manner, including, without limitation, in a manner intended to trade on the name or reputation of others. Yardbook reserve the right, in our sole discretion, to remove any description or keyword that we consider inappropriate or unlawful, or otherwise likely to cause Yardbook liability.\\n  * upload, transmit, post, email, or otherwise make available any content that is unlawful, harmful, threatening, abusive, harassing, defamatory, obscene, pornographic, libelous, tortious, vulgar, hateful (including based upon race, age, gender, sexual-orientation, or religion), or otherwise objectionable (in Yardbook\\'s sole opinion);\\n  * upload, transmit, post, email, or otherwise make available any content that violates anyone\\'s Intellectual Property Rights;\\n  * upload, transmit, post, email, or otherwise make available any content that constitutes or encourages a criminal offense, illegal activity, violates the rights of any party, or that otherwise creates liability or violates any local, state, national, or international law;\\n  * modify, adapt, sublicense, translate, sell, reverse engineer, decipher, decompile or otherwise disassemble any portion of the Services or any software or application used on, or for the Services, or causes others to do so;\\n  * disrupt or interfere with the Services in any manner that could damage, impair, disable, overburden or harm the Services, network or servers, software or hardware or telecommunications equipment;\\n  * use \"bots,\" \"spiders,\" \"crawlers,\" website search/retrieval application, or other manual or automatic device or process to retrieve, index, \"data mine,\" probe, scan, test the vulnerability of any system or network or breach or otherwise circumvent the intended functionality of the Services;\\n  * forge headers or otherwise manipulates identifiers in order to disguise the origin of any information transmitted to or through the Services (either directly or indirectly through use of third party software);\\n  * disrupt, interfere with or inhibit the operation or use of the Services by others in any way, through any means or device, including, but not limited to, \"spam,\" \"viruses,\" \"worms,\" or other computer codes, files or programs, or by other means;\\n  * upload, transmit, post, email, or otherwise make available any content that contains Personal Information about another member that is published without the member\\'s express consent;\\n  * collect, stores or solicit information about other users or members for commercial or unlawful purposes or engage in commercial activity such as contests, sweepstakes, and the like, without Yardbook\\'s prior consent;\\n  * upload, transmit, post, email, or otherwise make available any content that contains material originally posted by another member that is reposted without permission or attribution;\\n  * upload, transmit or engage in \"junk mail,\" \"spam,\" \"chain letters,\" \"Pyramid schemes,\" or other unsolicited messages;\\n  * purposefully upload, transmit, post, email, or otherwise make available any content in an irrelevant category or city, repeatedly post the same or similar content or otherwise impose an unreasonably disproportionately large load on Yardbook\\'s servers;\\n  * access or attempt to access the Services by any means other than the interface provided or authorized, or access or attempt to access content or non-public areas of the Services, Yardbook\\'s computer system or the technical delivery systems of Yardbook\\'s providers; or\\n  * use meta tags or code or other devices containing any reference to Yardbook or the Services (or any existing trademark, trade name, service mark, logo or slogan of Yardbook), to any person or entity or other website for any purpose;\\n  * that violates these Terms in any manner, or\\n  * that otherwise violates any third-party provider\\'s terms and conditions.\\n\\n\\nYardbook reserves the right, in its sole discretion, to terminate your license, remove your User Content, assist law enforcement in the prosecution of criminal liability, or assert a civil or criminal legal action with respect to User Content or use of the Services that Yardbook reasonably believes is or might be in violation of these Terms. Failure or delay in taking such actions does not constitute a waiver of our rights to enforce these Terms. \\n#### SUBSCRIPTION PLANS\\nUse of most Service features requires a Subscription Plan subject to these Terms.\\n_Basic Plan_ : Certain Yardbook services are provided to you free-of-charge in the basic plan. Your free account under the Basic Plan will continue (i) until cancelled or (ii) you upgrade to a premium account, or as otherwise provided in this Agreement.\\n_Premium Plans_ :\\nPremium Subscription Plans provide access to additional features not otherwise available under the Basic Plan and are available on a monthly basis or in a Premium Package. When purchasing a Premium Plan or Premium Package your subscription will start immediately upon setting up your plan and your credit card will be charged automatically on the same day each month, or for a Premium Package on the renewal date of the current term, unless you terminate your account before the start of the next billing period.\\n#### Promotional Offers\\nIf you have purchased or received a promotional offer or other offer provided or sold by or on behalf of Yardbook for access to a Premium Subscription or specific features, separate terms and conditions presented to you along with the promotion may also apply to your access to the Services and you agree to comply with any such terms and conditions.\\n#### Trial Offers\\nFrom time to time, we may offer the opportunity to experience features included in our Premium Subscription Plans for a specified period without payment (\"**Trial** \"). Yardbook reserves the right, in its absolute discretion, to determine your eligibility for a Trial, and, subject to applicable laws, to withdraw or to modify a Trial at any time without prior notice and with no liability, to the greatest extent permitted under the law. Trials may, for example run either 30 or 60 days, depending upon the feature covered by the Trial offer.\\n#### Changes in Fees; Promotions\\nPrices for any subscription plan may change at any time and Yardbook does not provide price protection or refunds in the event of a price reduction or promotional offering. In the event of a subscription plan increase, you will be notified by email regarding the new subscription rate for your plan. Renewal of your subscription plan indicates your consent to the rate increase in your Premium Subscription plan.\\nIF YOU DO NOT WANT TO CONTINUE TO BE CHARGED ON A RECURRING MONTHLY BASIS, YOU MUST CANCEL THE APPLICABLE PREMIUM SUBSCRIPTION THROUGH YOUR YARDBOOK ACCOUNT\\'S SUBSCRIPTION PAGE OR TERMINATE YOUR YARDBOOK ACCOUNT BEFORE THE END OF THE RECURRING MONTHLY PERIOD. PREMIUM SUBSCRIPTIONS CANNOT BE TERMINATED BEFORE THE END OF THE PERIOD FOR WHICH YOU HAVE ALREADY PAID, AND EXCEPT AS EXPRESSLY PROVIDED IN THESE TERMS, YARDBOOK WILL NOT REFUND ANY FEES THAT YOU HAVE ALREADY PAID.\\n#### Subscription Cancellation:\\nYou may cancel your subscription at any time online by following the instructions on the \"change/cancel membership\" or similar page on your \"Account Billing\" page. You may also cancel your subscription by sending us written notice of cancellation to Yardbook Inc. 1900 S. Norfolk Street, Suite 350. San Mateo, CA 94403.\\n_Early Termination_ : Please note that if you terminate this Agreement early we will keep your account open and continue to charge your credit card the recurring monthly fee until the current term of your subscription package expires. You hereby agree that should Yardbook be forced to take legal action or enlist the services of a collection agency to enforce our rights under this provision, you shall pay all such attorneys\\' fees or agency fees and other fees associated with the collection of such sums.\\n#### Fees Non-refundable:\\nAll subscription fees paid are non-refundable (in whole or in part) even if the Services are suspended or terminated prior to the end of your Premium Subscription plan. If you cancel your subscription, you will enjoy membership benefits until the end of the last month you made your subscription payment. If you purchased a Premium Package, in no event will you be entitled for a refund of any portion of the subscription fees paid for the then-current membership.\\n####  PLAID \\nYardbook uses Plaid Technologies, Inc. (“Plaid”) to gather End User’s data from financial institutions. By using our service, you grant Yardbook and Plaid the right, power, and authority to act on your behalf to access and transmit your personal and financial information from the relevant financial institution. You agree to your personal and financial information being transferred, stored, and processed by Plaid in accordance with the [Plaid Privacy Policy](https://www.yardbook.com/<https:/plaid.com/legal>). \\nIf you link your bank accounts through the Plaid Integration (Optional), Yardbook will receive bank transaction data from your bank. These transactions are stored in your account, and can be converted to expense records to help you track your spending. Your bank transaction data will include information such as account name, acount type, transaction amount, time, description and status. \\n#### STRIPE AND FINANCIAL AND MONETARY TRANSACTIONS\\nPayment processing services for users on Yardbook are provided by Stripe and are subject to the [Stripe Connected Account Agreement](https://www.yardbook.com/<https:/stripe.com/gb/connect-account/legal>), which includes the [Stripe Terms of Service](https://www.yardbook.com/<https:/stripe.com/gb/legal>) (collectively, the “Stripe Services Agreement”). By agreeing to these terms or continuing to operate as a user on Yardbook, you agree to be bound by the Stripe Services Agreement, as the same may be modified by Stripe from time to time. As a condition of Yardbook enabling payment processing services through Stripe, you agree to provide Yardbook accurate and complete information about you and your business, and you authorize Yardbook to share it and transaction information related to your use of the payment processing services provided by Stripe. \\nYardbook uses the third-party payment platform, Stripe, the Stripe API, and in conjunction, your Stripe account to process credit and debit card transactions for your Yardbook account. By using Yardbook and agreeing to the Yardbook Terms, you also agree to be bound by Stripe\\'s Terms of Service.\\nYou expressly understand and agree that Yardbook shall not be liable for any payments and monetary transactions that occur through your use of the Services. You expressly understand and agree that all payments and monetary transactions are handled by Stripe. You agree that Yardbook shall not be liable for any issues regarding financial and monetary transactions between you and any other party, including Stripe.\\nYou are responsible for all transactions (one-time, recurring, and refunds) processed through the Services and/or Stripe. Yardbook is not liable for loss or damage from errant or invalid transactions processed with your Stripe account. This includes transactions that were not processed due to a network communication error, or any other reason. If you process a transaction, it is your responsibility to verify that the transaction was successfully processed.\\nYou understand that Yardbook uses the Stripe API to run the Services and that the Stripe API is subject to change at any time and such changes may adversely affect the Services. You understand and agree to not hold Yardbook liable for any adverse effects that result from actions (whether intentional or unintentional) on the part of Stripe that may cause harm to Your Stripe account, your Yardbook account, or your business.\\nYou must not process stolen credit cards, or unauthorized credit cards through Stripe and/or your Yardbook account.\\nIn addition to transaction fees charged directly by Stripe, you will also be charged a processing fee by Yardbook. This fee will be automatically deducted from each online payment from your customers to you. \\nThe Yardbook processing fee for non-premium accounts is 1% of each transaction. This fee also applies to any free trial accounts. \\nFor premium paid accounts (Business Plan and Enterprise Plan),  this fee is waived.\\n#### INTELLECTUAL PROPERTY RIGHTS\\n#### Your Content Submitted into System\\n_Ownership_ : Yardbook does not claim ownership of the User Content that you post or upload, input or submit to our Services. \"**User Content** \" mean data, text, files, information, usernames, images, sounds, photographs, graphics, video, messages, notes, links, tags and other material you may submit to our Services.\\n_Warranties of Ownershi_ p: You understand that all User Content you upload, post, input, or submit to our Services is the sole responsibility of the person or business entity from whom such User Content originated. By uploading your User Content to the Services, you agree that: (i) you own the User Content or have the necessary licenses and permissions to use and share the User Content and (ii) the rights necessary to grant the licenses in these Terms. If you incorporate any Intellectual Property or material owned by a third party into your User Content, you do so at your own risk. \"**Intellectual Property Rights** \" means patent, trademark, copyright, service mark, trade dress, unfair competition, right of privacy and publicity, moral rights, unfair competition and any other proprietary rights.\\n_License Grant_ : To operate and provide the Services we require certain licenses from you to your User Content. you herby grant Yardbook an irrevocable, unrestricted, non-exclusive, worldwide, royalty-free, fully-paid up, sub-licensable, and transferrable license to host, use, publicly display, exhibit, distribute, edit, modify, transmit, retransmit, reproduce, and translate the content as needed in response to user driven actions on or through any media, technology or device now known or hereafter developed. Examples of how we may use your User Content under the license you have granted us includes, without limitation, to i) display your User Content on our Services; (ii) use your User Content to promote our Services through our site or other third party affiliate partners and/or; and (iii) for archival purposes or preservation of your User Content for legal proceedings, investigations or disputes.\\n_User Content_ : You understand and agree that the User Content you upload to the website will be stored for an indefinite period of time on Yardbook\\'s servers. You are responsible for ensuring that any files uploaded to our servers is free of corruption and contain no viruses or malicious software. You warrant and represent that any User Content you upload to our Services does not breach any applicable law and will not damage user computer systems, software or hardware devices or contain any malicious or contaminated files, software or content.\\n_Public Access and Display_ : When you upload and post User Content in your public business profile you understand that this User Content may be viewable by the public. You agree that you are solely responsible for any User Content or information posted. Therefore, it is recommended that any User Content you store or submit to our Services be tasteful and reflective of community standards.\\n_Removal_ : In our sole discretion, Yardbook may or may not monitor any User Content you upload and post, accept or reject your User Content or delete your User Content, with or without notice, that includes, without limitation, when, in our determination, you may have violated these Terms or any applicable laws or regulations. Yardbook will not be liable for any use or disclosure of your User Content to anyone, including, without limitation, users and visitors of the Yardbook Services, or intellectual property owners providing a notice of claimed infringement.\\n#### Proprietary Intellectual Property Rights\\n_Yardbook Content_ : The Services contain content owned by or licensed to Yardbook, including, without limitation, Yardbook, yardbook, yardbook.com, the yardbook.com logo, and all other trademarks, service marks, trade dress, and copyrighted materials such as graphics, logos, sounds, text, and source code used in connection thereto (\"**Yardbook Content** \"). We (and our licensors) remain the sole owner of all rights, title and interest in the Services and Yardbook Content. We reserve all rights not otherwise expressly granted under these terms. You will not remove, alter or conceal any copyright, trademark, service mark, trade dress or other proprietary rights notices incorporated in or accompanying the Yardbook Content. You will not reproduce, modify, adapt, prepare derivative works, perform, display, publish, distribute, transmit, broadcast, sell, license, or otherwise exploit the Yardbook Content.\\n_Limited License_ : Subject to your compliance with these Terms and applicable law, Yardbook grants you a personal, worldwide, royalty-free, non-assignable and non-exclusive, limited, revocable license to use the Services for personal purposes and commercial purposes as expressly limited herein. You may only use the Yardbook Services on a computer, mobile phone or other mobile device that you own or control. Any use of the Services in any other manner, including, without limitation, resale, transfer, modification or distribution of any Yardbook Content or any User-Generated Content by another user of the Services is expressly prohibited. This Agreement also governs any updates, or supplements, or replacements to the Yardbook Content unless separate terms accompany such updates or supplements or replacements, in which case separate terms will apply.\\n_Third Party Content_ : You will not remove, alter or conceal any copyright, trademark, service mark or other proprietary rights notices incorporated in or accompanying the content of any third-party partner (\"**Third-Party Partner Content** \") and you will not reproduce, modify, adapt, prepare derivative works based on, perform, display, publish, distribute, transmit, sell, license, or otherwise exploit any Third Party Partner Content.\\n#### DMCA Policy\\nYardbook takes the intellectual property rights of others seriously and expects you to do the same on our Services. We will respond to notices of copyright infringement that comply with the requirements of the Digital Millennium Copyright Act (\"**DMCA** \") (17 U.S.C. § 512). If you believe in good faith that User Content available through our Services infringes one or more of your copyrights, you may provide us written notice (\"Take Down Notice\") as described below.\\nTake Down Notice:\\nYour Take Down Notice must include the following:\\n  * A physical or electronic signature of the owner or a person authorized to act on behalf of the owner of an exclusive right that is allegedly infringed;\\n  * Identification of the copyrighted work claimed to have been infringed (including a hyperlink to said work(s), if available), or, if multiple copyrighted works at a single online site are covered by a single notification, a representative list of such works at that website;\\n  * Identification of the material that is claimed to be infringing or to be the subject of infringing activity and that is to be removed or access to which is to be disabled and information reasonably sufficient to permit the service provider to locate the material (including a hyperlink to said work(s));\\n  * Information reasonably sufficient to permit the service provider to contact you, such as an address, telephone number, and, if available, an email;\\n  * A statement that you have a good faith belief that use of the material in the manner complained of is not authorized by the copyright owner, his/her/its agent, or the law; and\\n  * A statement that the information in the notification is accurate, and under penalty of perjury, that you are authorized to act on behalf of the owner of an exclusive right that is allegedly infringed.\\n\\n\\n_Steps to File a Notice_ :\\n  * Verify that the webpage in question is hosted by Yardbook. We only host pages that have \"yardbook.com\" in their URL. Contact the listing party directly.\\n  * Go to the listing post in question and send an email with your complaint to see if the matter can be resolved directly between you and the listing party. \\n  * Send your Take Down Notice to our designated agent. If the issue cannot be resolved directly with the listing party, send your complaint to our designated agent at (we prefer email): \\nMrs. Leaman Email: dmca@yardbook.com Yardbook, Inc. 1900 S. Norfolk Street, Suite 350 San Mateo, CA 94403\\n\\n\\nIf Yardbook takes action in response to a Take Down Notice, we will make a good faith attempt to contact the party that posted, uploaded, inputted or submitted such User Content by means of the most recent email address, if any, provided by such party to Yardbook.\\n#### Your Take Down Notice may also be forwarded to the party that made the content available or to third parties such as ChillingEffects.org.\\nFor more information regarding our DMCA policy, including submitting a Counter Take Down Notice or your liability for submitting a Take Notice in bad faith go to www.yardbook.com/page/dmca.\\n#### Communications; Notices; Mobile Services\\nWe use email and electronic means to communicate with users and you agree to consent to receive email and/or SMS or text messages (collectively \"**Communications** \") from us. These Communications may be transactional or member communications relating to the Services, such as administrative notices and service announcements or changes, or communications containing commercial offers, promotions. Please see our Privacy Policy above for more information regarding these communications. \\nIf you change or deactivate your mobile telephone number, you agree to update your Yardbook account information to ensure that your messages are not sent to the person that acquires your old number. Notices may not be received if you violate these Terms by accessing the Services in an unauthorized manner. You agree that you are deemed to have received any and all notices that would have been delivered had you accessed the Services in an authorized manner.\\nCommunications made through email or any private messaging system via the Services will not constitute legal notice to Yardbook or any of our managers, employees, agents or representatives in any situation where notice to Yardbook is required by contract or any law or regulation.\\n#### Affiliate Promotions and Communications to Customers\\nFrom time to time you may receive promotions and/or offers from Yardbook affiliates and/or users via email through our Services. You may opt out of these emails at any time as provided in the Communications; Notice; Mobile Devices section above.\\nWe allow you to provide promotions or offers to Users subject to the following:\\n  1. You may carry out Promotions to the extent permitted by applicable local law and you are solely responsible for ensuring that you and any Promotions comply with any and all applicable local law obligations and restrictions.\\n  2. You, at your expense, will be solely responsible for all aspects of your promotion or offer including, without limitation, the execution, administration, and operation of the promotion; drafting the offer and/or requirements for the promotion; obtaining all necessary third-party permissions and approvals, if necessary. Yardbook has the right to remove your promotion or offer from the Yardbook Services for any reason.\\n  3. Yardbook is not responsible for and does not endorse or support any such promotions or offers and you may not indicate that Yardbook endorses or supports your promotion or offer.\\n\\n\\n#### No Endorsement; Responsibility of Visitors\\nYou understand that Yardbook does not endorse, condone or verify any content uploaded, posted, inputted or submitted to our Services. We further do not endorse, condone or verify any products, statistics, or information posted on our Services. We do not control and are not responsible for User Content made available through the Services and you accepted that you may be exposed to User Content that is offensive, indecent, inaccurate, misleading or otherwise objectionable. The website may also contain material that violates the privacy or publicity rights, or infringes the intellectual property and other proprietary rights, of third parties, or the downloading, copying or use of which is subject to additional terms and conditions, stated or unstated.\\nVisitors are further responsible for taking the precautions necessary to protect themselves and their computer systems from malicious software and other harmful or destructive content. Yardbook disclaims any responsibility for any harm resulting from the use by visitors of the website, or from any downloading by those visitors of content there posted. Your sole remedy is to stop viewing the User Content. If you believe in good faith another user is violating these Terms you may email us regarding such conduct at support@yardbook.com.\\n#### Content and Links of Third Party Websites\\nYardbook, in its sole discretion, may provide links to other locations or websites on the Internet. The content of such third party websites have not been reviewed by Yardbook and are maintained by third parties over which Yardbook has no control. You acknowledge and agree that you use or follow these links entirely at your own risk. Yardbook is not responsible for the damage or loss suffered by you arising out of, or in connection with your access to or use of these third party websites, including, but not limited to, damage or loss to your computer system or loss of data arising from your use of documents or information found on these third party websites. Any links to such third-party websites are for your convenience and the inclusion of such links on our website does not imply any endorsement, guarantee, warranty or representation by Yardbook of the quality or accuracy of the content, information, products or services or other materials provided to you on those third party websites.\\n#### Taxes and Third-Party Fees\\nYou are solely responsible for and must pay all applicable taxes, and any applicable third-party fee (such as telephone charges, mobile carrier fees, ISP charges, data plan charges, SMS and third-party payment processing fees) that may result from your use of our Services.\\n#### Consent to Send Text Messages\\nPrior to sending the first message, you must obtain agreement from the message recipient to communicate with them - this is referred to as \"consent\", you must make clear to the individual they are agreeing to receive messages of the type you\\'re going to send. You need to keep a record of the consent, such as a copy of the document or form that the message recipient signed, or a timestamp of when the customer completed a sign-up flow. \\nIf an individual sends a message to you, you are free to respond in an exchange with that individual. For example, if an individual texts your phone number asking for your hours of operation, you can respond directly to that individual, relaying your open hours. In such a case, the individual’s inbound message to you constitutes both consent and proof of consent. Remember that the consent is limited only to that particular conversation. Unless you obtain additional consent, don\\'t send messages that are outside that conversation. \\nYou may send a message to an individual where you have a prior relationship, provided that individual provided their phone number to you, and has taken some action to trigger the potential communication, and has not expressed a preference to not receive messages from you. Actions can include a button press, alert setup, appointments, or order placements. Examples of acceptable messages in these scenarios include appointment reminders, receipts, one-time passwords, order/shipping/reservation confirmations, drivers coordinating pick up locations with riders, and repair persons confirming service call times. In this case, the message can\\'t attempt to promote a product, convince someone to buy something, or advocate for a social cause.\\n#### Feedback and Suggestions\\nIf you submit feedback, comments, ideas or suggestions (collectively \"**Suggestions** \") about our Services, you acknowledge that such Suggestions are unsolicited and that we may, but have no obligation, to use your Suggestions. You further agree and acknowledge that any use of your Suggestions by us, for any purpose, will be without any liability to us, or payment of any kind to you.\\n#### LIMITATIONS AND DISCLAIMERS\\n#### Warranty Disclaimer\\nYOU ACKNOWLEDGE THAT YOUR ACCESS AND USE OF OUR SERVICES IS AT YOUR SOLE RISK. YARDBOOK MAKES NO REPRESENTATIONS OR WARRANTY OR ENDORSEMENT OF ANY KIND WHATSOEVER, EXPRESS OR IMPLIED, AS TO: (i) YARDBOOK\\'S CONTENT; (ii) USER CONTENT; (iii) SECURITY ASSOCIATED WITH THE TRANSMISSION OF INFORMATION TO YARDBOOK AND THROUGH THE SERVICES; (iv) OPTIMIZED MOBILE FEATURES; (v) MOBIL APPLICATION FEATURES; (vi) ANY THIRD PARTY CONTENT AVAILABLE ON THE SERVICES; AND (vii) ANY OTHER MATTER RELATED TO THE SERVICES. YARDBOOK MAKES NO REPRESENTATIONS OR WARRANTY ABOUT THE SUITABILITY, RELIABILITY, AVAILABILITY, TIMELINESS, AND ACCURACY OF THE INFORMATION, SOFTWARE, PRODUCTS, SERVICES AND RELATED GRAPHICS CONTAINED IN THE SYSTEM FOR ANY PURPOSE. TO THE MAXIMUM EXTENT PERMITTED BY APPLICABLE LAW, ALL SUCH INFORMATION, SYSTEM, PRODUCTS, SERVICES AND RELATED GRAPHICS ARE PROVIDED \"AS IS\" AND \"AS AVAILABLE\" WITHOUT WARRANTY OR CONDITION OF ANY KIND. PROVIDER AND/OR ITS SUPPLIERS HEREBY DISCLAIM ALL WARRANTIES AND CONDITIONS, EXPRESS OR IMPLIED, WITH REGARD TO THIS SYSTEM, INFORMATION, SOFTWARE, PRODUCTS, SERVICES AND RELATED GRAPHICS, INCLUDING, BUT NOT LIMITED TO, ALL IMPLIED WARRANTIES OR CONDITIONS OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, TITLE AND NON-INFRINGEMENT.\\nThe website is provided \"as is.\" Yardbook disclaims all warranties of any kind, express or implied, including, without limitation, the warranties of merchantability, fitness for a particular purpose and non-infringement. Yardbook does not make any warranty that the website will be error free or that access thereto will be continuous or uninterrupted. You understand that you download from, or otherwise obtain content or services through, the website at your own discretion and risk.\\nWITHOUT LIMITING THE FOREGOING, YARDBOOK AND OUR MANAGERS, EMPLOYEES, AGENTS, SUPPLIERS, VENDORS, CONTENT PROVIDERS, LICENSORS, LICENSEES, SERVICE PROVIDERS, AND OTHER AFFILIATES (COLLECTIVELY \"**ASSOCIATED PARTIES** \") DO NOT REPRESENT OR WARRANT THAT YOUR USE OF THE YARDBOOK SERVICES WILL BE FREE FROM INTERCEPTION, CORRUPTION, ERROR, DELAY OR LOSS OF DATA OR TIMELY; THAT DEFECTS OR ERRORS WILL BE CORRECTED; OR THAT THE SERVICES OR THE SERVER THAT MAKES THE YARDBOOK SERVICES AVAILABLE IS FREE FROM ANY HARMFUL COMPONENTS, INCLUDING, WITHOUT LIMITATION, VIRUSES. YARDBOOK AND ASSOCIATED PARTIES DO NOT MAKE ANY REPRESENTATIONS OR WARRANTIES THAT THE INFORMATION (INCLUDING ANY INSTRUCTIONS) ON THE YARDBOOK SERVICES IS ACCURATE, FREE OF ERRORS COMPLETE, OR USEFUL (INCLUDING, WITHOUT LIMITATION, PRICING, AVAILABILITY, GENERAL PRODUCT AND SERVICE DESCRIPTIONS ETC.), AND THE POSSIBILITY THAT UNAUTHORIZED ALTERATIONS COULD BE MADE TO YARDBOOK SERVICES BY THIRD PARTIES. YOU ASSUME TOTAL RESPONSIBILITY AND RISK FOR YOUR USE OF THE SERVICES AND YOUR RELIANCE THEREON. NO OPINION, ADVICE, OR STATEMENT OF YARDBOOK OR ANY ASSOCIATED PARTY, WHETHER MADE ON THE YARDBOOK SERVICES, OR OTHERWISE, SHALL CREATE ANY WARRANTY NOT OTHERWISE EXPRESSLY STATED HEREIN.\\n#### Limitation of Liability\\nTHE INFORMATION, SOFTWARE, PRODUCTS, AND SERVICES INCLUDED IN OR AVAILABLE THROUGH THE SERVICE MAY INCLUDE INACCURACIES OR TYPOGRAPHICAL ERRORS. CHANGES ARE PERIODICALLY ADDED TO THE INFORMATION HEREIN. YARDBOOK AND/OR ITS SUPPLIERS MAY MAKE IMPROVEMENTS AND/OR CHANGES IN THE SYSTEM AT ANY TIME. ADVICE RECEIVED VIA THE SYSTEM SHOULD NOT BE RELIED UPON FOR PERSONAL, MEDICAL, LEGAL OR FINANCIAL DECISIONS. USERS SHOULD CONSULT AN APPROPRIATE PROFESSIONAL FOR SPECIFIC ADVICE TAILORED TO THEIR SPECIFIC SITUATION.\\nTO THE MAXIMUM EXTENT PERMITTED BY APPLICABLE LAW, IN NO EVENT SHALL YARDBOOK BE LIABLE FOR ANY DIRECT, INDIRECT, PUNITIVE, INCIDENTAL, SPECIAL, CONSEQUENTIAL DAMAGES OR ANY DAMAGES WHATSOEVER INCLUDING, WITHOUT LIMITATION, DAMAGES FOR LOSS OF USE, DATA OR PROFITS, MISUSE OR INACCURACY OF DATA, ARISING OUT OF OR IN ANY WAY CONNECTED WITH THE USE OR PERFORMANCE OF THE SYSTEM, WITH THE DELAY OR INABILITY TO USE THE SYSTEM OR RELATED SERVICES, THE PROVISION OF OR FAILURE TO PROVIDE SERVICES, OR FOR ANY INFORMATION, SOFTWARE, PRODUCTS, SERVICES AND RELATED GRAPHICS OBTAINED THROUGH THE SYSTEM, OR OTHERWISE ARISING OUT OF THE USE OF THE SYSTEM, WHETHER BASED ON CONTRACT, TORT, NEGLIGENCE, STRICT LIABILITY OR OTHERWISE, EVEN IF PROVIDER OR ANY OF ITS SUPPLIERS HAS BEEN ADVISED OF THE POSSIBILITY OF DAMAGES. BECAUSE SOME STATES/JURISDICTIONS DO NOT ALLOW THE EXCLUSION OR LIMITATION OF LIABILITY FOR CONSEQUENTIAL OR INCIDENTAL DAMAGES, THE ABOVE LIMITATION MAY NOT APPLY TO A USER. IF USER IS DISSATISFIED WITH ANY PORTION OF THE SYSTEM, OR WITH ANY OF THESE TERMS OF USE, USER\\'S SOLE AND EXCLUSIVE REMEDY IS TO DISCONTINUE USING THE SYSTEM. YOU AGREE THAT IN THE EVENT YOU INCUR ANY DAMAGES, LOSSES OR INJURIES THAT ARISE OUT OF YARDBOOK\\'S ACTS OR OMISSIONS, THE DAMAGES, IF ANY, CAUSED TO YOU ARE NOT IRREPARABLE OR SUFFICIENT TO ENTITLE YOU TO AN INJUNCTION PREVENTING ANY EXPLOITATION OF THE YARDBOOK SERVICES, AND YOU WILL HAVE NO RIGHTS TO ENJOIN OR RESTRAIN THE DEVELOPMENT, PRODUCTION, DISTRIBUTION, ADVERTISING, EXHIBITION OR EXPLOITATION OF ANY YARDBOOK SERVICES, PROPERTY, PRODUCT, SERVICE, OR OTHER WEBSITE CONTENT OR MOBILE APPLICATION OWNED OR CONTROLLED BY YARDBOOK AND ASSOCIATED PARTIES.\\nYardbook shall not be held liable for loss or corruption of data, as above, caused due to interruptions or other defects in backup. Furthermore, Yardbook shall not be responsible for backup of User\\'s data on a regular basis. It is advised that User may adopt its own procedures for backup of its data if it requires regular or frequent backups.\\nYardbook will not be liable with respect to any subject matter of this agreement under any contract, negligence, strict liability or other legal or equitable theory for: (i) any special, incidental or consequential damages; (ii) the cost of procurement for substitute products or services; (iii) for interruption of use or loss or corruption of data; or (iv) for any amounts that exceed the fees paid by you to Yardbook under this agreement during the six (6) month period prior to the cause of action. Yardbook shall have no liability for any failure or delay due to matters beyond our reasonable control. The foregoing shall not apply to the extent prohibited by applicable law.\\nBY ACCESSING THE YARDBOOK SERVICES YOU UNDERSTAND THAT YOU MAY BE WAIVING RIGHTS WITH RESPECT TO CLAIMS THAT ARE AT THIS TIME UNKNOWN OR UNSUSPECTED, AND IN ACCORDANCE WITH SUCH WAIVER, YOU ACKNOWLEDGE THAT YOU HAVE READ AND UNDERSTAND, AND HEREBY EXPRESSLY WAIVE, THE BENEFITS OF CALIFORNIA CODE § 1542, AND ANY SIMILAR LAW OF ANY STATE OR TERRITORY, WHICH PROVIDES AS FOLLOWS: \"A GENERAL RELEASE DOES NOT EXTEND TO CLAIMS WHICH THE CREDITOR DOES NOT KNOW OR SUSPECT TO EXIST IN HIS FAVOR AT THE TIME OF EXECUTING THE RELEASE, WHICH IF KNOWN BY HIM MUST HAVE MATERIALLY AFFECTED HIS SETTLEMENT WITH THE DEBTOR.\"\\n#### Indemnification\\nYou agree to indemnify and hold Yardbook and Associated Parties harmless from any loss, liability, claim, or demand, including reasonable attorney\\'s fees, made or incurred by any third party due to or arising (directly or indirectly) out of your use of the website and/or mobile application, or arising from your breach of this Agreement.\\nYou are solely responsible for your interactions with merchants and other users of the Services. To the extent permitted under applicable laws, you hereby release Yardbook from any and all claims or liability related to any product or service of a merchant, any action or inaction by merchant, including merchant\\'s failure to comply with applicable law, and any conduct or speech, whether online or offline, of any other user.\\n#### Interruption of Service\\nWe reserve the right to update, modify, suspend, discontinue or close, temporarily or permanently, the Services (or any part thereof) at any time with or without notice. Features or services available through our Services may be discontinued at any time without notice. You agree that we shall not be liable to you or to any third party for any modification, suspension or discontinuance of our Services. To protect the integrity of our Services, we reserve the right at any time, in our sole discretion, to block users from certain IP addresses from accessing the Services.\\nTransactions conducted through the Internet may be subject to interruption, blackout, delay or error. Yardbook shall not be responsible in any way for loss of accuracy or timeliness of any message sent or transaction conducted through this website arising from or in relation to any malfunctions in communication facilities that are out of the control of Yardbook.\\n#### No Refunds\\nUnless we state in writing otherwise, all fees paid are nonrefundable.\\n#### Modifications to Terms of Service\\nYardbook reserves the right, in our sole discretion, to modify, add or remove portions of this Agreement at any time. Please check this Agreement periodically for changes. Your continued use of or access to the website and/or mobile application following the posting of any changes to this Agreement constitutes your binding acceptance of such changes. Yardbook may also, in the future, offer new services and/or features through our Services (including, the release of new tools and resources). Such new features and/or services shall be subject to the terms of this Agreement.\\n#### Termination\\n_Termination by Yardbook_ : We may terminate this Agreement at any time. Without limiting the foregoing, Yardbook shall have the right to immediately terminate or suspend any of your passwords or accounts in the event Yardbook considers, in its sole discretion, any of your conduct to be unacceptable, or in the event you breach any terms of this Agreement. Yardbook may terminate your access to all or any part of the Services at any time, with or without cause, with or without notice to you, effective immediately.\\nIf you have a Subscription Plan, such account can only be terminated by Yardbook if you materially breach this Agreement and fail to cure such breach within thirty (30) days of notice provided by to you; provided that, Yardbook can terminate the website immediately as part of a general shut down of our service.\\n_Termination by You_ : You may terminate this Agreement and cancel your account in the user profile screen at any time. In the event of early termination your account shall remain active and your credit card will continue to be charged the recurring monthly fee until the end of the month in which you terminated your account for all monthly premium plans and at the end of your current package term for all premium package plans. See Subscription Plans above for more information regarding termination of subscription plans.\\n_User Content and Termination_ : Upon processing your cancellation, all of your User Content will be deleted from the Services. This information cannot be recovered once your account is cancelled. We reserve the right, but have no obligation, to retain and use your information as necessary to comply with our legal obligations, resolve disputes, and enforce our agreements. Barring any legal obligations, we will delete your full user account and any associated listing services within thirty (30) days of your request or if on a subscription plan, within thirty (30) days of the last day of your then current plan. By removing your User Content from our Services or deleting your user account, all licenses granted to you by Yardbook shall immediately terminate.\\n_Survival of Terms_ : Upon termination of this Agreement, all provisions which by their nature should survive termination shall survive, including, without limitation, ownership provisions; indemnification obligations; warranty disclaimers, limitations of liabilities, statute of limitations; and dispute resolution provisions stated in these Terms.\\n#### Governing Law; Venue; Arbitration\\n_Governing Law_ : The laws of the State of California, USA. govern the interpretation of these Terms and apply to claims for breach of these Terms, regardless of conflict of laws principles of your state or country of residence. The Parties specifically exclude from application to these Terms the United Nations Convention on Contracts for the International Sale of Goods and the Uniform Computer Information Transactions Act. If you reside outside the United States you understand and agree to submit to the jurisdiction and venue of San Mateo County, California and hereby waive all forum non conveniens defenses. Any legal proceeding shall be in the County of San Mateo. In case of legal action, the prevailing party shall be entitled to reasonable attorney\\'s fees in addition to any other relief to which the party may be entitled.\\n_Binding Arbitration_ : Except for claims for injunctive or equitable relief or claims regarding intellectual property rights (which may be brought in any competent court without the posting of a bond) or claims brought in small claims court, any dispute arising under this Agreement shall be finally settled in accordance with the Comprehensive Arbitration Rules of the Judicial Arbitration and Mediation Service, Inc. (\"JAMS\"). The arbitration will be conducted by one arbitrator, as agreed on by you and Yardbook (and if you and Yardbook cannot agree within twenty (20) days, appointed in accordance with the said arbitration rules. The arbitration shall take place in the County of San Mateo, California, in the English language, but any witness whose native language is not English may give testimony in the witness\\' native language, with simultaneous translation into English at the expense of the party presenting the witness. You understand that by using the Services YOU GIVE UP YOUR RIGHT TO GO TO COURT to assert or defend any claims between you and Yardbook (except for claims for injunctive or equitable relief or claims regarding intellectual property rights or claims brought in small claims court) BEFORE A JUDGE OR JURY. Judgment on the award rendered by the arbitrator may be entered in any court having competent jurisdiction over the parties. Any provision of applicable law notwithstanding, the arbitrator will not have authority to award damages, remedies or awards that conflict with these Terms. The prevailing party in any action or proceeding to enforce this Agreement shall be entitled to costs and attorneys\\' fees.\\n_Small Claims Action_ : If your claim meets the requirements to file a small claims action, you agree to the sole jurisdiction and venue of any small claims court located in San Mateo County, California. To the extent state law applies, California law shall govern without regard to or application of the conflict of law provisions of your state or country of residence.\\n_No Class Action_ : You agree to give up your right to participate in a class action or class proceeding, including class arbitration, limited attorney general action, or other representative action or proceeding.\\n_Limitations on Time to Bring Action_ : You further agree that any claim you may have arising out of, or related to your use of our Services must be filed within one (1) year after such claim arose; otherwise, your claim is permanently barred.\\n#### Entire Agreement, Severability\\nThis Agreement, accepted upon your access and use of the Services, and further affirmed by becoming a User, contains the entire agreement between you and Yardbook regarding the use of the Services. This Agreement may not be orally amended, and may only be modified by a written amendment signed by an authorized executive of Yardbook, or by the posting by Yardbook of a revised version. If any term of this Agreement is held by a court of competent jurisdiction to be invalid or unenforceable, then this Agreement, including all of the remaining terms, will remain in full force and effect as if such invalid or unenforceable term had never been included.\\n#### No Implied Waiver\\nA waiver by either party of any term or condition of this Agreement or any breach thereof, in any one instance, will not waive such term or condition or any subsequent breach thereof. Either party\\'s failure to insist in any one or more instances for strict performance by the other party of any of the terms of this Agreement shall not be construed as a waiver of any continuing or subsequent failure to perform or delay in performance of any term hereof.\\n#### Advertising\\nYardbook reserves the right to display advertisements on its Services.\\n#### Assignability\\nYou may assign your rights under this Agreement to any party that consents to, and agrees to be bound by, its terms and conditions; Yardbook may assign its rights under this Agreement without condition. This Agreement will be binding upon and will inure to the benefit of the parties, their successors and permitted assigns.\\n#### Headings\\nHeadings used in this Agreement are provided for convenience only and shall not be used to construe meaning or intent.\\n#### Conflict of Terms\\nIf there is a conflict or contradiction between the provisions of these Terms and any relevant terms and conditions, policies or notices, the other relevant terms and conditions, policies or notices that relate specifically to a particular section or features of the Services shall take precedence solely as regards your use of the relevant section or feature of the Services. These terms shall control in all other respects.\\n#### California Users and Residents\\nPursuant to California Civil Code § 1789.3, any questions regarding pricing, complaints, or inquiries about Yardbook must be addressed to our agent for notice and sent via certified mail to: Agent of Yardbook, Inc., 1900 S. Norfolk Street, Suite 350, San Mateo, California 94403. California users are also entitled to the following specific consumer rights notice: The Complaint Assistance Unit of the Division of Consumer Services of the California Department of Consumer Affairs may be contacted in writing at 1625 North Market Blvd., Sacramento, CA 95834, or by telephone at (916) 445-1254 or (800) 952-5210.\\n#### Changes\\nYardbook reserves the right, in its sole discretion, to modify or replace any part of this Agreement. It is your responsibility to check this Agreement periodically for changes. Your continued use of or access to the website following the posting of any changes to this Agreement constitutes acceptance of those changes. Yardbook may also, in the future, offer new services and/or features through the website (including, the release of new tools and resources). Such new features and/or services shall be subject to the terms and conditions of this Agreement.\\n#### Contact Information\\nYou may send notice to us at the address below. If you have any questions relating to these Terms, please contact us at support@yardbook.com or by regular mail at:\\nYardbook, Inc. 1900 S. Norfolk Street, Suite 350 San Mateo, CA 94403\\nLast updated: 1/22/2014, 11/20/2013, 4/18/2015, 7/13/2016, 3/27/2017, 5/20/2018, 2/21/2020, 4/25/2023\\n## Privacy & Terms\\n## DMCA Policy\\nYardbook is committed to protecting your privacy and providing you a safe online experience. This Privacy Statement applies to the Yardbook website, mobile application, and also governs its data collection and usage. By using the Yardbook website and/or mobile application, you consent to the data practices described herein.\\n#### DMCA Policy\\nYardbook, Inc. takes the intellectual property rights of others seriously and expects you to do the same on our Services. We will respond to notices of copyright infringement that comply with the requirements of the Digital Millennium Copyright Act (\"**DMCA** \") (17 U.S.C. § 512). If you believe in good faith that User Content available through our Services infringes one or more of your copyrights, you may provide us written notice (\"Take Down Notice\") as described below.\\n_Take Down Notice_ :\\nYour Take Down Notice must include the following:\\n  * A physical or electronic signature of the owner or a person authorized to act on behalf of the owner of an exclusive right that is allegedly infringed;\\n  * Identification of the copyrighted work claimed to have been infringed (including a hyperlink to said work(s), if available), or, if multiple copyrighted works at a single online site are covered by a single notification, a representative list of such works at that website;\\n  * Identification of the material that is claimed to be infringing or to be the subject of infringing activity and that is to be removed or access to which is to be disabled and information reasonably sufficient to permit the service provider to locate the material (including a hyperlink to said work(s));\\n  * Information reasonably sufficient to permit the service provider to contact you, such as an address, telephone number, and, if available, an email;\\n  * A statement that you have a good faith belief that use of the material in the manner complained of is not authorized by the copyright owner, his/her/its agent, or the law; and\\n  * A statement that the information in the notification is accurate, and under penalty of perjury, that you are authorized to act on behalf of the owner of an exclusive right that is allegedly infringed.\\n\\n\\n_Steps to File a Take Down Notice_ :\\n  * Verify that the webpage in question is hosted by Yardbook. We only host pages that have \"yardbook.com\" in their URL. Contact the listing party directly.\\n  * Go to the listing post in question and send an email with your complaint to see if the matter can be resolved directly between you and the listing party.\\n  * Send your Take Down Notice to our designated agent. If the issue cannot be resolved directly with the listing party, send your complaint to our designated agent at (we prefer email): \\nMrs. Leaman Email: dmca@yardbook.com Yardbook, Inc. 1900 S. Norfolk Street, Suite 350 San Mateo, CA 94403\\n\\n\\nFor clarity, only DMCA notices or counter-notices should go to the Copyright Agent; any other feedback, comments, requests for technical support, and other communications should be directed to Yardbook customer support by email at support@yardbook.com. You acknowledge that if you fail to comply with all of the requirements as set forth herein, your DMCA notice may not be valid and may not be considered by Yardbook.\\n#### Your Take Down Notice may also be forwarded to the party that made the content available or to third parties such as ChillingEffects.org.\\n_Counter-Notice To Restore Removed Content_ :\\nIf you believe that your User Content that was removed (or to which access was disabled) is not infringing, or that you have the authorization from the copyright owner, the copyright owner\\'s agent, or pursuant to the law, to post and use the material in your Content, you may send a counter-notice containing the following information:\\n  * Your physical or electronic signature;\\n  * Identification of the Content that has been removed or to which access has been disabled and the location at which the Content appeared before it was removed or disabled;\\n  * A statement that you have a good faith belief that the Content was removed or disabled as a result of mistake or a misidentification of the Content;\\n  * Your name, address, telephone number, and email address, a statement that you consent to the jurisdiction of the federal court in the district where you live (if you reside in the U.S.), or your consent to the jurisdiction of a federal court in Pleasanton, California in Alameda County (if you reside outside the U.S.); and\\n  * A statement that you will accept service of process from the person who provided notification of the alleged infringement.\\n\\n\\nIf a counter-notice is received by the Copyright Agent, Yardbook may send a copy of the counter-notice to the original complaining party informing that person that it may replace the removed User Content or cease disabling it in ten (10) business days. Unless the copyright owner files an action seeking a court order against the user content provider or user, the removed User Content may be replaced, or access to Yardbook\\'s Services restored, at Yardbook\\'s sole discretion.\\n_Repeat Infringer Policy_ : Yardbook will terminate user accounts that have been subject to three (3) separate DMCA notices. In the event a user\\'s materials are removed based on a DMCA notice and then subsequently restored due to the filing of a DMCA counter-notification, the underlying DMCA notice will be deemed withdrawn for purposes of this policy. We reserve the right to terminate user accounts subject to less than three (3) DMCA notices in appropriate circumstances (i.e. the user has a history of violating or willfully disregarding Yardbook\\'s Terms of Service).\\n_Requests For Further Information_ : To ensure a timely processing of your notice or counter-notice, please make sure you have complied with the steps set forth above. If we request additional information required to make your DMCA notice or counter-notice complete, please provide that information promptly. If you fail to comply with these requirements, we may not be able to process your notice or counter-notice.\\n_Bad Faith Conduct_ : Please be advised that you will be liable for damages (including costs and attorneys\\' fees) if you materially misrepresent that a product or activity infringes your copyright. If you are unsure whether User Content located on, or third-party content linked to our Services infringes your copyright, you should consult an attorney before submitting a Take Down Notice.\\n####  ![](https://www.yardbook.com/assets/logo-996aca0596a08f3b4f2624a440840dbbfe38bb5a4551afe32808a16b5197f718.png) Yardbook is a FREE web-based application designed to help manage landscaping businesses. \\n  * Manage Customers \\n  * Schedule Jobs \\n  * Create Estimates and Bills \\n  * List Your Business In Our Public Directory \\n\\n\\n####  Do you already have a yardbook account? [No](https://www.yardbook.com/</users/sign_up>) [Yes](https://www.yardbook.com/</users/sign_in>)\\n## Why is Yardbook free?\\nYardbook has a sponsored ad business model similar to Google and Facebook. This model enables our users to benefit from the software for free and has enabled Yardbook to continuously innovate and improve the product. We also now offer **optional** premium features for larger companies that may require more sophisticated functionality to run their business. \\nThe Yardbook team is committed to providing affordable and tailored software to best support your landscape business, no matter the size. \\n' markdown_with_citations='Toggle navigation  Yardbook ⟨1⟩\\n  * Home⟨2⟩\\n  * Features⟨3⟩\\n  * Support⟨4⟩\\n  * Log In⟨5⟩\\n  * SIGN UP FREE⟨6⟩\\n\\n\\n  * #  RUN AND GROW YOUR  **LANDSCAPING BUSINESS**\\nPromote Services, Manage Customer Data, Generate Estimates, Schedule Jobs, Manage Billing, and much more. \\nWatch Video⟨7⟩ Join Today - Free!⟨6⟩\\n Why is it free?⟨8⟩\\nGet more business - Claim your Yardbook profile today!⟨9⟩\\n\\n\\n# AS SEEN ON\\n![](https://www.yardbook.com/assets/pr_logos/techcrunch-17350501b3c15da56fca499ad5aad95f2655b45743a578ff394c8cd952d66011.png)\\n![](https://www.yardbook.com/assets/pr_logos/ycombinator-381145644835a64d82ce183c788e1270ac7254051ef0f38734eaa641aa5bdbd9.png)\\n![](https://www.yardbook.com/assets/pr_logos/inc-5cd5ad92c9bfe6f271dd6fbb4e0550cbb31ad3aa1da099fdef2ee313767d1450.png)\\n![](https://www.yardbook.com/assets/pr_logos/yahoonews-bcfe1b5742102c8870205ed51d2d6d9821366f2d75bb6ff1a4f9e23e2718b830.png)\\n![](https://www.yardbook.com/assets/pr_logos/entrepreneur-32c8c7c7c17fb7ec702066f86fd665724bddfb94f1ac4d6c7aa8cb945f795119.png)\\n![](https://www.yardbook.com/assets/pr_logos/landscapemgmt-d6797277fd6acfd8ed0a026f955c206510a4c49140ab431f7b274241b2675109.png)\\nOVER 20,000 COMPANIES ARE USING YARDBOOK\\nGet started for free today! \\n\"The thing I like best about Yardbook is how easy it is to get started. I was able to learn the system without any training.\" \\n- Jason L. \\n\"A very user friendly platform yet complex enough to handle all the details in running a business.\" \\n- Buhler Landscape⟨10⟩\\n\"The guys at Yardbook clearly get software, and not only that, they understand customer service and the importance of interacting with their customers.\" \\n- South Metro Lawn Care⟨11⟩\\n\"The program is very easy to understand and if you can\\'t figure something out just send them a email and they will let you know how to resolve it very quickly which is hard to find in this day and age.\" \\n- 360 Lawn Care⟨12⟩\\n\"I had tried several programs but Yardbook was a perfect fit for my lawn care business. Easy to navigate and very professional looking invoices.\" \\n- Mow N Lawns⟨13⟩\\n\"The program is straight forward and easy to learn. The customer service is second to none.\" \\n- North Florida Lawns and More Inc. \\n‹⟨14⟩ ›⟨14⟩\\nRead More⟨15⟩\\nA COMPLETE SUITE OF FEATURES\\n## SALES\\nCreate new relationships with your customers that keep them coming back\\n  * Business Profile⟨16⟩\\n  * Lead Management\\n  * Estimates⟨17⟩\\n  * Account Management⟨18⟩\\n  * Text/Email Messages⟨19⟩\\n\\n\\n## BUSINESS OPERATIONS\\nSpend less time and money managing your business and more time growing it\\n  * Job Scheduling⟨20⟩\\n  * Routing⟨21⟩\\n  * Timesheets\\n  * GPS Tracking\\n  * Equipment Maint.\\n\\n\\n## FINANCE AND RECORDS\\nGet paid faster and manage your numbers with far less effort\\n  * Pricing Catalog\\n  * Invoices & Payments⟨17⟩\\n  * Expenses\\n  * Credit Cards\\n  * Chemical Tracking\\n\\n\\n![](https://www.yardbook.com/assets/yardbook2/mac_screen_shot_small-0a6f7df0de367bcc94e00a8d057a695e495267c0bd091e4a5f091ce26033dde6.png)\\nVIEW DEMO ACCOUNT⟨22⟩\\nPlay\\nCurrent Time 0:00\\n/\\nDuration Time 0:00\\nRemaining Time -0:00\\nStream TypeLIVE\\nLoaded: 0%\\nProgress: 0%\\n0:00\\nFullscreen\\n00:00\\nMute\\nPlayback Rate\\n1\\nSubtitles\\n  * subtitles off\\n\\n\\nCaptions\\n  * captions off\\n\\n\\nChapters\\n  * Chapters\\n\\n\\nThe video could not be loaded, either because the server or network failed or because the format is not supported.\\n#  RAISE YOUR PROFILE\\n####  Yardbook Profiles are designed to attract customers. Claim or create your Yardbook Profile page today\\n####  Put yourself out there so more homeowners can find you \\n####  Showcase your best work to the world \\n####  Define your services and where you work \\n####  Manage your inbound leads from a single platform \\n#### **It only takes a few minutes to get your profile up and running. Create your profile and start getting more business today!**\\n GET MY PROFILE ⟨23⟩\\n![](https://www.yardbook.com/assets/yardbook2/directorySamplePhoto-bc694ff69b9d482dc7be1d04f2954d8058584232858e60807ace379fa70bc363.jpg)\\nScroll Up ⟨24⟩ Scroll Down⟨24⟩\\n#  OUR MISSION \\n### **To provide landscapers with robust and easy-to-use online tools that empower them to efficiently grow their businesses and build long-lasting relationships with their customers.**\\n©2013-2025 Yardbook. All rights reserved. Privacy & Terms⟨25⟩\\n  * [](https://www.yardbook.com/<https:/www.facebook.com/yardbook>)\\n  * [](https://www.yardbook.com/<https:/www.twitter.com/yardbook>)\\n  * [](https://www.yardbook.com/<https:/plus.google.com/116201316210278363572/posts>)\\n\\n\\n## Privacy & Terms\\n## Privacy Statement⟨26⟩\\nYardbook, Inc. (\"**Yardbook** \" \"**our** \" or \"**we** \") is committed to protecting your privacy and providing you a safe online experience. This Privacy Statement applies to the Yardbook website, including any optimized mobile version and related webpages and mobile application (collectively \"**Services** \"), and also governs its data collection and usage. By using our Services, you consent to the data practices described herein. If you do not agree to any part of this Privacy Statement, then you must immediately stop use of the Yardbook Services.\\n#### Collection of Personal Information\\nWhile the Yardbook Services may be utilized anonymously, when you register for our Services, we collect and store personally identifiable information (\"**PII** \"), including your name, billing address, e-mail, mailing address, ip-address, and telephone number.\\nYardbook also collects usage information about your computer hardware, software and usage when accessing our Services. This information can include your Internet Protocol (IP) address, operating system, browser type, domain names, access times and referring website addresses, items you click on, the pages you view and the amount of time you spend on a particular page. We use this information for the operation of the Services, to maintain the quality of the Services, and to provide general statistics regarding your use of our Services. \\nWe use third-party analytics tools to help us measure traffic and usage trends for the Services. These tools, such as Google Analytics and other Mobile Analytics Tools, collect information sent by your device or our Services, including the web pages you visit, add-ons, and other information that assists us in improving the Services. We collect and use this analytics information with analytics information from other users so that it cannot reasonably be used to identify any particular individual user.\\n#### Location Based Information\\nTo provide location-based features with our Services, we may collect, use, and share precise location data, including the real-time geographic location of your mobile device. Where available, location-based services may use GPS, along with cell tower locations, and other technologies to determine your device\\'s approximate location. You consent to location data being collected that personally identifies you when using specific features of our Services. For example, when you use your device to check in or check out at a specific location, your device will share its geographic location and the time of access. Other location data may be collected anonymously in a form that does not personally identify you and is used by Yardbook to provide and improve location-based products and services.\\n#### Photo/Image Uploads \\nOur app allows users to upload photos, including business logos, photos of completed work, and user photos. These photos are optional and the app will function correctly even if users do not upload any images. \\n* The business logo photo is displayed on customer-facing documents, while photos uploaded from different customer sites are displayed to customers after the work is done. The user photo is displayed on the user settings page. \\n* All user images are stored on Amazon AWS servers and are accessed using secure protocols (https). Our app takes reasonable measures to protect user images from unauthorized access or disclosure. \\n* Users have the right to delete their photos at any time from their own account. If a user deletes a photo, it will be removed from all customer-facing documents and from the app\\'s storage servers. \\n####  File Uploads \\nOur app allows users to upload attachment files that can be associated with different types of records. (Customer, Property, Invoices, Product and Services) \\n* All user files are stored on Amazon AWS servers and are accessed using secure protocols (https). Our app takes reasonable measures to protect user files from unauthorized access or disclosure. \\n* Users have the right to delete their files at any time from their own account. If a user deletes a file, it will be removed from the app\\'s storage servers. \\n#### Use of Personal Information\\nWe collect and use your PII to operate the Yardbook Services and deliver the services requested by you. Yardbook may also use PII to inform you of other products or services available from Yardbook and its affiliates.\\nWe may use the information we collect about you for a variety of purposes, including to:\\n  * Personalize and improve the Yardbook Services, and provide content, features, and/or advertisements that match your interests and preferences or otherwise customize your experience on the Yardbook Services;\\n  * Provide, operate, maintain and improve the Yardbook Services;\\n  * Send you technical notices, updates, security alerts and support and administrative messages;/li>\\n  * Provide and deliver the services and features you request, process and complete transactions, and send you related information, including purchase confirmations and invoices;\\n  * Respond to your comments, questions, and requests and provide customer service and support;\\n  * Communicate with you about services, features, offers, promotions, and provide other news or information about Yardbook and our affiliates;\\n  * Monitor and analyze trends, usage, and activities in connection with the Yardbook Services and for marketing or advertising purposes;\\n  * Investigate and prevent fraudulent transactions, unauthorized access to the Yardbook Services, and other illegal activities;\\n  * Track the ip-address of the online approver of an estimate;\\n  * Link or combine with other information we receive from third parties to help understand your needs and provide you with better service; and\\n  * For other purposes about which we notify you.\\n\\n\\n#### Processing\\nBy accessing or using the Yardbook Services, or otherwise providing information to us, you consent to the processing and transfer of information in and to the U.S. and other countries and territories, which may have different privacy laws from your country of residence.\\n#### Disclosure to Third Parties\\nYardbook takes your privacy seriously. We will not share PII about you with any third party except as described in this Privacy Statement or in connection with the Yardbook Services. Yardbook does not use or disclose sensitive personal information, such as race, religion, or political affiliations, without your explicit consent. However, how we disclose your personal information to third parties under this Agreement includes:\\n  * _Vendors, Consultants and Other Service Providers_ : We may share your information with third-party vendors, suppliers and other service providers who are working on our behalf and require access to your information to carry out that work, such as to process billing, provide customer support, perform statistical analysis, facilitate communication with you, arrange for deliveries, etc. All such third parties are prohibited from using your personal information except to provide these services to Yardbook, and they are required to maintain the confidentiality of your information.\\n  * _Business Transfers_ : We may disclose your information to a third party in connection with a corporate reorganization, merger, sale, joint venture, assignment, transfer or other disposition of all or any portion of our business, assets or stock, including in connection with any bankruptcy or similar proceedings.\\n  * _Compliance with Laws_ : We may disclose your information to a third party if (a) we believe that disclosure is reasonably necessary to comply with any applicable law, regulation, legal process or governmental request, (b) to enforce our agreements, policies and Terms of Service, (c) to protect the security or integrity of the Yardbook Services, (d) to protect Yardbook, our customers or the public from harm or illegal activities, or (e) to respond to an emergency which we believe in the good faith requires us to disclose information to assist in preventing the death or serious bodily injury of any person.\\n  * _Third Party Promotional Offers_ : Yardbook does not sell, rent or lease its customer lists to third parties. Yardbook may, from time to time, contact you on behalf of external business partners about a particular offering that may be of interest to you. In those cases, your unique PII (e-mail, name, address, telephone number) is not transferred to the third party.\\n  * _Advertisers and Affiliates_ : Yardbook does not send personal user-level information to advertisers and/or partners. Yardbook\\'s advertising partners provide contextual targeting services that solely rely on cookie-level tracking which contains no identifying information. Yardbook does not sell, trade, or otherwise transfer to outside parties your PII. \\n  * _Aggregated or Anonymized Data_ : We may also share aggregated or anonymized information with third parties that does not directly identify you.\\n\\n\\n#### Links to Third Party Websites\\nWe may place links on the Yardbook Services. We are not responsible for the practices and policies employed by any websites linked to or from our Services, including the information or content contained within them. Please remember that when you use a link to go from the Yardbook Services to another website, our Privacy Statement does not apply to those third-party websites. Your browsing and interaction on any third-party website, including those that have a link on our website, are subject to that third party\\'s own rules and policies. We recommend that you consult the privacy statements of all third-party websites you visit by clicking on the \"Privacy Policy\" link typically located at the bottom of the webpage you are visiting.\\n#### Protection of Personal Information\\nYardbook secures your PII from unauthorized access, use or disclosure by implementing a variety of security measures to maintain the safety of your PII. Yardbook secures the PII you provide on computer servers in a controlled, secure environment, protected from unauthorized access, use or disclosure. When PII is transmitted to other websites, it is protected through the use of encryption, such as the Secure Socket Layer (SSL) protocol. All supplied sensitive/credit information is transmitted via SSL. SSL certificates encrypt communication between the Yardbook Services and your web browser, preventing others from eavesdropping. \\n#### Use of Cookies\\nThe Yardbook website may use \"cookies\" to help you personalize your online experience. A cookie is a text file that is placed on your hard disk by a webpage server. Cookies cannot be used to run programs or deliver viruses to your computer. Cookies are uniquely assigned to you, and can only be read by a web server in the domain that issued the cookie to you.\\nOne of the primary purposes of cookies is to provide a convenience feature to save you time. The purpose of a cookie is to tell the Web server that you have returned to a specific page. For example, if you register with Yardbook, a cookie helps Yardbook recall your specific information on subsequent visits. This simplifies the process of recording your personal information, such as billing addresses, shipping addresses, etc. When you return to the same Yardbook website, the information you previously provided can be retrieved, so you can easily use the Yardbook features that you customized.\\n#### Personalized or Targeted Advertising and Do Not Track\\nWe believe that a more personalized experience will better serve your use of our Services and we may provide targeted advertising and other opportunities based upon our collection of PII from your use of our Services and use of other online websites. You may opt out of targeted advertising subject to the \"Do Not Track\" Policy below.\\nOther than as provided in this Privacy Statement we do not collect or use your PII. We may not recognize or respond to every type of \"do not track\" signal or other mechanisms that provide consumers the ability to exercise choice regarding the collection of PII about the individual user\\'s online activity, whether through our Services, third-party services or online services. We do not control any third party\\'s collection of your PII, including third parties that advertise on our Services or when you access a third-party site through our Services.\\nMany Web browsers are set to accept cookies by default. If you prefer, you can usually choose to set your browser to remove and reject cookies. If you choose to remove cookies or reject cookies (such as using an opt-out cookie), this could affect certain features or the user experience of our Services. Please note that cookie management tools provided by your browser usually will not remove Flash cookies. To learn how to manage privacy and storage settings for Flash cookies, visit the Adobe Macromedia website.⟨27⟩ Using do not track options provided by third party websites will not affect non-personalized ads on the Services and elsewhere, use of PII by Yardbook for other analytics purposes, such as to improve Services and track effectiveness and frequency of non-personalized ads. We encourage you to review the privacy policies of our third-party advertisers and analytics service providers to learn more about the information they collect from you. To opt out of Google Analytics, you can download the Google Analytics Opt-out Browser Add-on.⟨28⟩\\n#### Google AdSense\\nWe may use Google AdSense from time to time to publish ads on our Services and when you click on such an ad, a cookie will be sent to your browser to help better provide advertisements that may be of interest to you on this and other websites. For further information regarding Google advertising and privacy policies or to opt-out of the use of such cookies, visit Google\\'s Advertising and Privacy page: http://google.com/privacy_ads.html.⟨29⟩\\n#### Account Information & Retention.\\nYou may update, correct or delete information about you at any time by logging into your online account and modifying your information or by emailing us at support@yardbook.com. We will retain your personal information for the period necessary to fulfill the purposes outlined in this Privacy Statement. If you wish to deactivate your account, please email us at support@yardbook.com, but note that we may retain certain information as required by law or for legitimate business purposes. We may also retain cached or archived copies of information about you for a certain period of time. To request removal of your PII from testimonials, contact us at the email address listed above. We will respond to your access request within thirty (30) days. In some cases, we may not be able to remove your PII, in which case we will let you know if we are unable to do so and why. We will retain your information for as long as your account is active or as needed to provide you services. We will retain and use your information to comply with our legal obligations, resolve disputes and enforce our agreements.\\n#### Promotional and SMS Communications.\\nYou may opt out of receiving promotional emails and SMS notifications from Yardbook by following the opt-out instructions provided in those emails or texting \"STOP\" to discontinue receiving text notifications. You may also opt-out of receiving promotional emails, SMS texts, push notifications and other promotional communications from us at any time by emailing support@yardbook.com with your specific request. If you opt out, we may still send you non-promotional communications, such as security alerts and notices related to your access to or use of the Yardbook Services or those about your online account or our ongoing business relations.\\n#### California Online Privacy Protection Act Compliance\\nBecause Yardbook values your privacy, we have taken the necessary precautions to be in compliance with the California Online Privacy Protection Act. Yardbook will not distribute your PII to outside parties without your consent, except as provided expressly herein. As part of the California Online Privacy Protection Act, all users of our site may make any changes to their information at any time by logging into the account link. \\nAs of January 1, 2005, California Civil Code §1798.83 permits visitors to this website who are residents of California to request information regarding Yardbook\\'s disclosure of their information to third parties for direct marketing purposes. To make such a request, please contact our customer support at support@yardbook.com.\\n#### Children\\'s Online Privacy Protection Act Compliance\\nWe are in compliance with the requirements of COPPA (Children\\'s Online Privacy Protection Act); we do not collect any information from anyone under 13 years of age. Our website, products and services are all directed to people who are at least 13 years old or older. If you become aware of a minor under the age of 13 using our Services or that the PII of anyone under the age of 13 has been collected, please contact us immediately at support@yardbook.com.\\n#### Information You Publicly Post\\nPII that you post to your public business profile becomes publicly available and is no longer considered PII. Yardbook has no control over how this information will be used. Your posting to such public business profile constitutes consent to share such information publicly, and you should assume that such information will be widely disseminated, including via search engines and other tools to locate information online (e.g., internet archive). You can always edit any information you post to your public profile.\\n#### Changes to this Privacy Statement\\nWe may change the provisions of this Privacy Policy at any time, and we will always post the most up-to-date version on our website at <https://www.yardbook.com/pages/tos>. We will notify you of significant changes to our Privacy Statement by placing a prominent notice on our site. All changes will go into effect immediately upon posting. You should periodically check the Terms of Service⟨30⟩ webpage for Privacy Statement updates.\\n#### Questions\\nIf you have any questions or comments about the Privacy Policy or the practices relating to our Services, or you wish to verify, correct or delete any PII we have collected, please contact us at support@yardbook.com.\\n## Terms of Service\\n#### Acceptance of Terms\\nWelcome to Yardbook, dedicated to helping you run and grow your landscaping business. The following Terms of Service (\"**Terms** \" or \"**Agreement** \") govern and regulate your access to and use of www.yardbook.com⟨31⟩, including any optimized mobile version and related webpages, and our mobile applications (\"**Services** \"). These Terms, along with our Privacy Statement, and any documents incorporated herein by reference, constitute a legally binding contract between Yardbook Inc. (\"**Yardbook,** \" \"**our,** \" \"**we** \") and you (\"**You** \" or \"**User** \").\\nPlease read all terms and conditions carefully before accessing our Services. If you do not agree to be bound by these Terms, you must immediately discontinue access of the Services because your continued access signifies your acceptance of the Agreement and any modification or revision thereto.\\nBY ACCESSING THE YARDBOOK SERVICES YOU ACKNOWLEDGE YOU HAVE THE AUTHORITY TO ENTER INTO THIS AGREEMENT, THAT YOU HAVE READ AND UNDERSTOOD AND UNCONDITIONALLY AGREED TO BE BOUND BY THE TERMS OF THIS AGREEMENT AND THAT THE TERMS OF THIS AGREEMENT WILL APPLY EACH TIME YOU ACCESS OUR SERVICES.\\n#### Summary of Service\\nYardbook is a vertical business application focused on the landscaping industry. Yardbook has been designed to save time and enhance organization--all in a user-friendly interface. Yardbook aims to provide landscapers with the most robust and easy-to-use online tools--empowering them to efficiently grow their business, and build long-lasting relationships with customers.\\n#### ACCOUNT ELIGIBILITY\\nBy accessing or using our Services (or any part thereof), or third party services or products offered in or linked to via our Services, you represent and warrant that (a) you are at least thirteen (13) years of age; (b) if registering for a business entity, that you possess the legal authority to enter into these Terms and form a binding agreement under applicable law; and (c) all information provided by you as part of the registration process or continued use of the Services is accurate, current and complete and remains up-to-date. If you are unable to fulfill all of these requirements, you must immediately stop all use and terminate your access to the Services.\\n#### USER RESPONSIBILITIES\\n#### Your Yardbook.com Account and Site\\n_Registration_ : Registration is not required to access and use the Services. However, some features of the Yardbook Services require you to register a user account. Registration requires you to provide a valid e-mail address and a password. We encourage you to use \"strong\" passwords (a password that uses a combination of upper and lower case letters, numbers and symbols) with your account.\\n_User Information_ : In order to fully use the Yardbook Services, you must register an account and provide personal identifying information, including, without limitation, your full name, e-mail address, telephone number, mailing address, and billing address (\"**PII** \"). We reserve the right, in our sole discretion, to deny registration of a user account, prohibit or deny you access to the Service (or any part thereof), with or without prior notice. The Privacy Statement above governs any PII you provide us. By using the Services, you agree to the terms of the Privacy Statement.\\n_Inactivity and Improper Use_ : Yardbook further retains the right to cancel unconfirmed user accounts or accounts that have been inactive for more than twelve (12) months or are considered to be deceptive or misleading, without prior notice to the User.\\n_Account Security_ : You are responsible for safeguarding the password that you use to access the Services and for all activity that occurs under your account. We encourage you to periodically change your password as an additional security measure. You may not share your account information with another person or use another user\\'s account. You are solely responsible for protecting any confidential or PPI sent from or stored on any computer, mobile phone or mobile device as a result of your use of the Services. You agree to immediately change your password and notify Yardbook of any suspected or unauthorized access associated with your use of the Services or any other breach of security.\\n#### Restrictions\\nYou agree to act responsibly and to treat other users with respect. Any user who engages in prohibited conduct may be removed from the Services or blocked from the website. While not an exhaustive list, you agree not to:\\n  * describe or assign keywords to your posts/activities in a misleading or unlawful manner, including, without limitation, in a manner intended to trade on the name or reputation of others. Yardbook reserve the right, in our sole discretion, to remove any description or keyword that we consider inappropriate or unlawful, or otherwise likely to cause Yardbook liability.\\n  * upload, transmit, post, email, or otherwise make available any content that is unlawful, harmful, threatening, abusive, harassing, defamatory, obscene, pornographic, libelous, tortious, vulgar, hateful (including based upon race, age, gender, sexual-orientation, or religion), or otherwise objectionable (in Yardbook\\'s sole opinion);\\n  * upload, transmit, post, email, or otherwise make available any content that violates anyone\\'s Intellectual Property Rights;\\n  * upload, transmit, post, email, or otherwise make available any content that constitutes or encourages a criminal offense, illegal activity, violates the rights of any party, or that otherwise creates liability or violates any local, state, national, or international law;\\n  * modify, adapt, sublicense, translate, sell, reverse engineer, decipher, decompile or otherwise disassemble any portion of the Services or any software or application used on, or for the Services, or causes others to do so;\\n  * disrupt or interfere with the Services in any manner that could damage, impair, disable, overburden or harm the Services, network or servers, software or hardware or telecommunications equipment;\\n  * use \"bots,\" \"spiders,\" \"crawlers,\" website search/retrieval application, or other manual or automatic device or process to retrieve, index, \"data mine,\" probe, scan, test the vulnerability of any system or network or breach or otherwise circumvent the intended functionality of the Services;\\n  * forge headers or otherwise manipulates identifiers in order to disguise the origin of any information transmitted to or through the Services (either directly or indirectly through use of third party software);\\n  * disrupt, interfere with or inhibit the operation or use of the Services by others in any way, through any means or device, including, but not limited to, \"spam,\" \"viruses,\" \"worms,\" or other computer codes, files or programs, or by other means;\\n  * upload, transmit, post, email, or otherwise make available any content that contains Personal Information about another member that is published without the member\\'s express consent;\\n  * collect, stores or solicit information about other users or members for commercial or unlawful purposes or engage in commercial activity such as contests, sweepstakes, and the like, without Yardbook\\'s prior consent;\\n  * upload, transmit, post, email, or otherwise make available any content that contains material originally posted by another member that is reposted without permission or attribution;\\n  * upload, transmit or engage in \"junk mail,\" \"spam,\" \"chain letters,\" \"Pyramid schemes,\" or other unsolicited messages;\\n  * purposefully upload, transmit, post, email, or otherwise make available any content in an irrelevant category or city, repeatedly post the same or similar content or otherwise impose an unreasonably disproportionately large load on Yardbook\\'s servers;\\n  * access or attempt to access the Services by any means other than the interface provided or authorized, or access or attempt to access content or non-public areas of the Services, Yardbook\\'s computer system or the technical delivery systems of Yardbook\\'s providers; or\\n  * use meta tags or code or other devices containing any reference to Yardbook or the Services (or any existing trademark, trade name, service mark, logo or slogan of Yardbook), to any person or entity or other website for any purpose;\\n  * that violates these Terms in any manner, or\\n  * that otherwise violates any third-party provider\\'s terms and conditions.\\n\\n\\nYardbook reserves the right, in its sole discretion, to terminate your license, remove your User Content, assist law enforcement in the prosecution of criminal liability, or assert a civil or criminal legal action with respect to User Content or use of the Services that Yardbook reasonably believes is or might be in violation of these Terms. Failure or delay in taking such actions does not constitute a waiver of our rights to enforce these Terms. \\n#### SUBSCRIPTION PLANS\\nUse of most Service features requires a Subscription Plan subject to these Terms.\\n_Basic Plan_ : Certain Yardbook services are provided to you free-of-charge in the basic plan. Your free account under the Basic Plan will continue (i) until cancelled or (ii) you upgrade to a premium account, or as otherwise provided in this Agreement.\\n_Premium Plans_ :\\nPremium Subscription Plans provide access to additional features not otherwise available under the Basic Plan and are available on a monthly basis or in a Premium Package. When purchasing a Premium Plan or Premium Package your subscription will start immediately upon setting up your plan and your credit card will be charged automatically on the same day each month, or for a Premium Package on the renewal date of the current term, unless you terminate your account before the start of the next billing period.\\n#### Promotional Offers\\nIf you have purchased or received a promotional offer or other offer provided or sold by or on behalf of Yardbook for access to a Premium Subscription or specific features, separate terms and conditions presented to you along with the promotion may also apply to your access to the Services and you agree to comply with any such terms and conditions.\\n#### Trial Offers\\nFrom time to time, we may offer the opportunity to experience features included in our Premium Subscription Plans for a specified period without payment (\"**Trial** \"). Yardbook reserves the right, in its absolute discretion, to determine your eligibility for a Trial, and, subject to applicable laws, to withdraw or to modify a Trial at any time without prior notice and with no liability, to the greatest extent permitted under the law. Trials may, for example run either 30 or 60 days, depending upon the feature covered by the Trial offer.\\n#### Changes in Fees; Promotions\\nPrices for any subscription plan may change at any time and Yardbook does not provide price protection or refunds in the event of a price reduction or promotional offering. In the event of a subscription plan increase, you will be notified by email regarding the new subscription rate for your plan. Renewal of your subscription plan indicates your consent to the rate increase in your Premium Subscription plan.\\nIF YOU DO NOT WANT TO CONTINUE TO BE CHARGED ON A RECURRING MONTHLY BASIS, YOU MUST CANCEL THE APPLICABLE PREMIUM SUBSCRIPTION THROUGH YOUR YARDBOOK ACCOUNT\\'S SUBSCRIPTION PAGE OR TERMINATE YOUR YARDBOOK ACCOUNT BEFORE THE END OF THE RECURRING MONTHLY PERIOD. PREMIUM SUBSCRIPTIONS CANNOT BE TERMINATED BEFORE THE END OF THE PERIOD FOR WHICH YOU HAVE ALREADY PAID, AND EXCEPT AS EXPRESSLY PROVIDED IN THESE TERMS, YARDBOOK WILL NOT REFUND ANY FEES THAT YOU HAVE ALREADY PAID.\\n#### Subscription Cancellation:\\nYou may cancel your subscription at any time online by following the instructions on the \"change/cancel membership\" or similar page on your \"Account Billing\" page. You may also cancel your subscription by sending us written notice of cancellation to Yardbook Inc. 1900 S. Norfolk Street, Suite 350. San Mateo, CA 94403.\\n_Early Termination_ : Please note that if you terminate this Agreement early we will keep your account open and continue to charge your credit card the recurring monthly fee until the current term of your subscription package expires. You hereby agree that should Yardbook be forced to take legal action or enlist the services of a collection agency to enforce our rights under this provision, you shall pay all such attorneys\\' fees or agency fees and other fees associated with the collection of such sums.\\n#### Fees Non-refundable:\\nAll subscription fees paid are non-refundable (in whole or in part) even if the Services are suspended or terminated prior to the end of your Premium Subscription plan. If you cancel your subscription, you will enjoy membership benefits until the end of the last month you made your subscription payment. If you purchased a Premium Package, in no event will you be entitled for a refund of any portion of the subscription fees paid for the then-current membership.\\n####  PLAID \\nYardbook uses Plaid Technologies, Inc. (“Plaid”) to gather End User’s data from financial institutions. By using our service, you grant Yardbook and Plaid the right, power, and authority to act on your behalf to access and transmit your personal and financial information from the relevant financial institution. You agree to your personal and financial information being transferred, stored, and processed by Plaid in accordance with the Plaid Privacy Policy⟨32⟩. \\nIf you link your bank accounts through the Plaid Integration (Optional), Yardbook will receive bank transaction data from your bank. These transactions are stored in your account, and can be converted to expense records to help you track your spending. Your bank transaction data will include information such as account name, acount type, transaction amount, time, description and status. \\n#### STRIPE AND FINANCIAL AND MONETARY TRANSACTIONS\\nPayment processing services for users on Yardbook are provided by Stripe and are subject to the Stripe Connected Account Agreement⟨33⟩, which includes the Stripe Terms of Service⟨34⟩ (collectively, the “Stripe Services Agreement”). By agreeing to these terms or continuing to operate as a user on Yardbook, you agree to be bound by the Stripe Services Agreement, as the same may be modified by Stripe from time to time. As a condition of Yardbook enabling payment processing services through Stripe, you agree to provide Yardbook accurate and complete information about you and your business, and you authorize Yardbook to share it and transaction information related to your use of the payment processing services provided by Stripe. \\nYardbook uses the third-party payment platform, Stripe, the Stripe API, and in conjunction, your Stripe account to process credit and debit card transactions for your Yardbook account. By using Yardbook and agreeing to the Yardbook Terms, you also agree to be bound by Stripe\\'s Terms of Service.\\nYou expressly understand and agree that Yardbook shall not be liable for any payments and monetary transactions that occur through your use of the Services. You expressly understand and agree that all payments and monetary transactions are handled by Stripe. You agree that Yardbook shall not be liable for any issues regarding financial and monetary transactions between you and any other party, including Stripe.\\nYou are responsible for all transactions (one-time, recurring, and refunds) processed through the Services and/or Stripe. Yardbook is not liable for loss or damage from errant or invalid transactions processed with your Stripe account. This includes transactions that were not processed due to a network communication error, or any other reason. If you process a transaction, it is your responsibility to verify that the transaction was successfully processed.\\nYou understand that Yardbook uses the Stripe API to run the Services and that the Stripe API is subject to change at any time and such changes may adversely affect the Services. You understand and agree to not hold Yardbook liable for any adverse effects that result from actions (whether intentional or unintentional) on the part of Stripe that may cause harm to Your Stripe account, your Yardbook account, or your business.\\nYou must not process stolen credit cards, or unauthorized credit cards through Stripe and/or your Yardbook account.\\nIn addition to transaction fees charged directly by Stripe, you will also be charged a processing fee by Yardbook. This fee will be automatically deducted from each online payment from your customers to you. \\nThe Yardbook processing fee for non-premium accounts is 1% of each transaction. This fee also applies to any free trial accounts. \\nFor premium paid accounts (Business Plan and Enterprise Plan),  this fee is waived.\\n#### INTELLECTUAL PROPERTY RIGHTS\\n#### Your Content Submitted into System\\n_Ownership_ : Yardbook does not claim ownership of the User Content that you post or upload, input or submit to our Services. \"**User Content** \" mean data, text, files, information, usernames, images, sounds, photographs, graphics, video, messages, notes, links, tags and other material you may submit to our Services.\\n_Warranties of Ownershi_ p: You understand that all User Content you upload, post, input, or submit to our Services is the sole responsibility of the person or business entity from whom such User Content originated. By uploading your User Content to the Services, you agree that: (i) you own the User Content or have the necessary licenses and permissions to use and share the User Content and (ii) the rights necessary to grant the licenses in these Terms. If you incorporate any Intellectual Property or material owned by a third party into your User Content, you do so at your own risk. \"**Intellectual Property Rights** \" means patent, trademark, copyright, service mark, trade dress, unfair competition, right of privacy and publicity, moral rights, unfair competition and any other proprietary rights.\\n_License Grant_ : To operate and provide the Services we require certain licenses from you to your User Content. you herby grant Yardbook an irrevocable, unrestricted, non-exclusive, worldwide, royalty-free, fully-paid up, sub-licensable, and transferrable license to host, use, publicly display, exhibit, distribute, edit, modify, transmit, retransmit, reproduce, and translate the content as needed in response to user driven actions on or through any media, technology or device now known or hereafter developed. Examples of how we may use your User Content under the license you have granted us includes, without limitation, to i) display your User Content on our Services; (ii) use your User Content to promote our Services through our site or other third party affiliate partners and/or; and (iii) for archival purposes or preservation of your User Content for legal proceedings, investigations or disputes.\\n_User Content_ : You understand and agree that the User Content you upload to the website will be stored for an indefinite period of time on Yardbook\\'s servers. You are responsible for ensuring that any files uploaded to our servers is free of corruption and contain no viruses or malicious software. You warrant and represent that any User Content you upload to our Services does not breach any applicable law and will not damage user computer systems, software or hardware devices or contain any malicious or contaminated files, software or content.\\n_Public Access and Display_ : When you upload and post User Content in your public business profile you understand that this User Content may be viewable by the public. You agree that you are solely responsible for any User Content or information posted. Therefore, it is recommended that any User Content you store or submit to our Services be tasteful and reflective of community standards.\\n_Removal_ : In our sole discretion, Yardbook may or may not monitor any User Content you upload and post, accept or reject your User Content or delete your User Content, with or without notice, that includes, without limitation, when, in our determination, you may have violated these Terms or any applicable laws or regulations. Yardbook will not be liable for any use or disclosure of your User Content to anyone, including, without limitation, users and visitors of the Yardbook Services, or intellectual property owners providing a notice of claimed infringement.\\n#### Proprietary Intellectual Property Rights\\n_Yardbook Content_ : The Services contain content owned by or licensed to Yardbook, including, without limitation, Yardbook, yardbook, yardbook.com, the yardbook.com logo, and all other trademarks, service marks, trade dress, and copyrighted materials such as graphics, logos, sounds, text, and source code used in connection thereto (\"**Yardbook Content** \"). We (and our licensors) remain the sole owner of all rights, title and interest in the Services and Yardbook Content. We reserve all rights not otherwise expressly granted under these terms. You will not remove, alter or conceal any copyright, trademark, service mark, trade dress or other proprietary rights notices incorporated in or accompanying the Yardbook Content. You will not reproduce, modify, adapt, prepare derivative works, perform, display, publish, distribute, transmit, broadcast, sell, license, or otherwise exploit the Yardbook Content.\\n_Limited License_ : Subject to your compliance with these Terms and applicable law, Yardbook grants you a personal, worldwide, royalty-free, non-assignable and non-exclusive, limited, revocable license to use the Services for personal purposes and commercial purposes as expressly limited herein. You may only use the Yardbook Services on a computer, mobile phone or other mobile device that you own or control. Any use of the Services in any other manner, including, without limitation, resale, transfer, modification or distribution of any Yardbook Content or any User-Generated Content by another user of the Services is expressly prohibited. This Agreement also governs any updates, or supplements, or replacements to the Yardbook Content unless separate terms accompany such updates or supplements or replacements, in which case separate terms will apply.\\n_Third Party Content_ : You will not remove, alter or conceal any copyright, trademark, service mark or other proprietary rights notices incorporated in or accompanying the content of any third-party partner (\"**Third-Party Partner Content** \") and you will not reproduce, modify, adapt, prepare derivative works based on, perform, display, publish, distribute, transmit, sell, license, or otherwise exploit any Third Party Partner Content.\\n#### DMCA Policy\\nYardbook takes the intellectual property rights of others seriously and expects you to do the same on our Services. We will respond to notices of copyright infringement that comply with the requirements of the Digital Millennium Copyright Act (\"**DMCA** \") (17 U.S.C. § 512). If you believe in good faith that User Content available through our Services infringes one or more of your copyrights, you may provide us written notice (\"Take Down Notice\") as described below.\\nTake Down Notice:\\nYour Take Down Notice must include the following:\\n  * A physical or electronic signature of the owner or a person authorized to act on behalf of the owner of an exclusive right that is allegedly infringed;\\n  * Identification of the copyrighted work claimed to have been infringed (including a hyperlink to said work(s), if available), or, if multiple copyrighted works at a single online site are covered by a single notification, a representative list of such works at that website;\\n  * Identification of the material that is claimed to be infringing or to be the subject of infringing activity and that is to be removed or access to which is to be disabled and information reasonably sufficient to permit the service provider to locate the material (including a hyperlink to said work(s));\\n  * Information reasonably sufficient to permit the service provider to contact you, such as an address, telephone number, and, if available, an email;\\n  * A statement that you have a good faith belief that use of the material in the manner complained of is not authorized by the copyright owner, his/her/its agent, or the law; and\\n  * A statement that the information in the notification is accurate, and under penalty of perjury, that you are authorized to act on behalf of the owner of an exclusive right that is allegedly infringed.\\n\\n\\n_Steps to File a Notice_ :\\n  * Verify that the webpage in question is hosted by Yardbook. We only host pages that have \"yardbook.com\" in their URL. Contact the listing party directly.\\n  * Go to the listing post in question and send an email with your complaint to see if the matter can be resolved directly between you and the listing party. \\n  * Send your Take Down Notice to our designated agent. If the issue cannot be resolved directly with the listing party, send your complaint to our designated agent at (we prefer email): \\nMrs. Leaman Email: dmca@yardbook.com Yardbook, Inc. 1900 S. Norfolk Street, Suite 350 San Mateo, CA 94403\\n\\n\\nIf Yardbook takes action in response to a Take Down Notice, we will make a good faith attempt to contact the party that posted, uploaded, inputted or submitted such User Content by means of the most recent email address, if any, provided by such party to Yardbook.\\n#### Your Take Down Notice may also be forwarded to the party that made the content available or to third parties such as ChillingEffects.org.\\nFor more information regarding our DMCA policy, including submitting a Counter Take Down Notice or your liability for submitting a Take Notice in bad faith go to www.yardbook.com/page/dmca.\\n#### Communications; Notices; Mobile Services\\nWe use email and electronic means to communicate with users and you agree to consent to receive email and/or SMS or text messages (collectively \"**Communications** \") from us. These Communications may be transactional or member communications relating to the Services, such as administrative notices and service announcements or changes, or communications containing commercial offers, promotions. Please see our Privacy Policy above for more information regarding these communications. \\nIf you change or deactivate your mobile telephone number, you agree to update your Yardbook account information to ensure that your messages are not sent to the person that acquires your old number. Notices may not be received if you violate these Terms by accessing the Services in an unauthorized manner. You agree that you are deemed to have received any and all notices that would have been delivered had you accessed the Services in an authorized manner.\\nCommunications made through email or any private messaging system via the Services will not constitute legal notice to Yardbook or any of our managers, employees, agents or representatives in any situation where notice to Yardbook is required by contract or any law or regulation.\\n#### Affiliate Promotions and Communications to Customers\\nFrom time to time you may receive promotions and/or offers from Yardbook affiliates and/or users via email through our Services. You may opt out of these emails at any time as provided in the Communications; Notice; Mobile Devices section above.\\nWe allow you to provide promotions or offers to Users subject to the following:\\n  1. You may carry out Promotions to the extent permitted by applicable local law and you are solely responsible for ensuring that you and any Promotions comply with any and all applicable local law obligations and restrictions.\\n  2. You, at your expense, will be solely responsible for all aspects of your promotion or offer including, without limitation, the execution, administration, and operation of the promotion; drafting the offer and/or requirements for the promotion; obtaining all necessary third-party permissions and approvals, if necessary. Yardbook has the right to remove your promotion or offer from the Yardbook Services for any reason.\\n  3. Yardbook is not responsible for and does not endorse or support any such promotions or offers and you may not indicate that Yardbook endorses or supports your promotion or offer.\\n\\n\\n#### No Endorsement; Responsibility of Visitors\\nYou understand that Yardbook does not endorse, condone or verify any content uploaded, posted, inputted or submitted to our Services. We further do not endorse, condone or verify any products, statistics, or information posted on our Services. We do not control and are not responsible for User Content made available through the Services and you accepted that you may be exposed to User Content that is offensive, indecent, inaccurate, misleading or otherwise objectionable. The website may also contain material that violates the privacy or publicity rights, or infringes the intellectual property and other proprietary rights, of third parties, or the downloading, copying or use of which is subject to additional terms and conditions, stated or unstated.\\nVisitors are further responsible for taking the precautions necessary to protect themselves and their computer systems from malicious software and other harmful or destructive content. Yardbook disclaims any responsibility for any harm resulting from the use by visitors of the website, or from any downloading by those visitors of content there posted. Your sole remedy is to stop viewing the User Content. If you believe in good faith another user is violating these Terms you may email us regarding such conduct at support@yardbook.com.\\n#### Content and Links of Third Party Websites\\nYardbook, in its sole discretion, may provide links to other locations or websites on the Internet. The content of such third party websites have not been reviewed by Yardbook and are maintained by third parties over which Yardbook has no control. You acknowledge and agree that you use or follow these links entirely at your own risk. Yardbook is not responsible for the damage or loss suffered by you arising out of, or in connection with your access to or use of these third party websites, including, but not limited to, damage or loss to your computer system or loss of data arising from your use of documents or information found on these third party websites. Any links to such third-party websites are for your convenience and the inclusion of such links on our website does not imply any endorsement, guarantee, warranty or representation by Yardbook of the quality or accuracy of the content, information, products or services or other materials provided to you on those third party websites.\\n#### Taxes and Third-Party Fees\\nYou are solely responsible for and must pay all applicable taxes, and any applicable third-party fee (such as telephone charges, mobile carrier fees, ISP charges, data plan charges, SMS and third-party payment processing fees) that may result from your use of our Services.\\n#### Consent to Send Text Messages\\nPrior to sending the first message, you must obtain agreement from the message recipient to communicate with them - this is referred to as \"consent\", you must make clear to the individual they are agreeing to receive messages of the type you\\'re going to send. You need to keep a record of the consent, such as a copy of the document or form that the message recipient signed, or a timestamp of when the customer completed a sign-up flow. \\nIf an individual sends a message to you, you are free to respond in an exchange with that individual. For example, if an individual texts your phone number asking for your hours of operation, you can respond directly to that individual, relaying your open hours. In such a case, the individual’s inbound message to you constitutes both consent and proof of consent. Remember that the consent is limited only to that particular conversation. Unless you obtain additional consent, don\\'t send messages that are outside that conversation. \\nYou may send a message to an individual where you have a prior relationship, provided that individual provided their phone number to you, and has taken some action to trigger the potential communication, and has not expressed a preference to not receive messages from you. Actions can include a button press, alert setup, appointments, or order placements. Examples of acceptable messages in these scenarios include appointment reminders, receipts, one-time passwords, order/shipping/reservation confirmations, drivers coordinating pick up locations with riders, and repair persons confirming service call times. In this case, the message can\\'t attempt to promote a product, convince someone to buy something, or advocate for a social cause.\\n#### Feedback and Suggestions\\nIf you submit feedback, comments, ideas or suggestions (collectively \"**Suggestions** \") about our Services, you acknowledge that such Suggestions are unsolicited and that we may, but have no obligation, to use your Suggestions. You further agree and acknowledge that any use of your Suggestions by us, for any purpose, will be without any liability to us, or payment of any kind to you.\\n#### LIMITATIONS AND DISCLAIMERS\\n#### Warranty Disclaimer\\nYOU ACKNOWLEDGE THAT YOUR ACCESS AND USE OF OUR SERVICES IS AT YOUR SOLE RISK. YARDBOOK MAKES NO REPRESENTATIONS OR WARRANTY OR ENDORSEMENT OF ANY KIND WHATSOEVER, EXPRESS OR IMPLIED, AS TO: (i) YARDBOOK\\'S CONTENT; (ii) USER CONTENT; (iii) SECURITY ASSOCIATED WITH THE TRANSMISSION OF INFORMATION TO YARDBOOK AND THROUGH THE SERVICES; (iv) OPTIMIZED MOBILE FEATURES; (v) MOBIL APPLICATION FEATURES; (vi) ANY THIRD PARTY CONTENT AVAILABLE ON THE SERVICES; AND (vii) ANY OTHER MATTER RELATED TO THE SERVICES. YARDBOOK MAKES NO REPRESENTATIONS OR WARRANTY ABOUT THE SUITABILITY, RELIABILITY, AVAILABILITY, TIMELINESS, AND ACCURACY OF THE INFORMATION, SOFTWARE, PRODUCTS, SERVICES AND RELATED GRAPHICS CONTAINED IN THE SYSTEM FOR ANY PURPOSE. TO THE MAXIMUM EXTENT PERMITTED BY APPLICABLE LAW, ALL SUCH INFORMATION, SYSTEM, PRODUCTS, SERVICES AND RELATED GRAPHICS ARE PROVIDED \"AS IS\" AND \"AS AVAILABLE\" WITHOUT WARRANTY OR CONDITION OF ANY KIND. PROVIDER AND/OR ITS SUPPLIERS HEREBY DISCLAIM ALL WARRANTIES AND CONDITIONS, EXPRESS OR IMPLIED, WITH REGARD TO THIS SYSTEM, INFORMATION, SOFTWARE, PRODUCTS, SERVICES AND RELATED GRAPHICS, INCLUDING, BUT NOT LIMITED TO, ALL IMPLIED WARRANTIES OR CONDITIONS OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, TITLE AND NON-INFRINGEMENT.\\nThe website is provided \"as is.\" Yardbook disclaims all warranties of any kind, express or implied, including, without limitation, the warranties of merchantability, fitness for a particular purpose and non-infringement. Yardbook does not make any warranty that the website will be error free or that access thereto will be continuous or uninterrupted. You understand that you download from, or otherwise obtain content or services through, the website at your own discretion and risk.\\nWITHOUT LIMITING THE FOREGOING, YARDBOOK AND OUR MANAGERS, EMPLOYEES, AGENTS, SUPPLIERS, VENDORS, CONTENT PROVIDERS, LICENSORS, LICENSEES, SERVICE PROVIDERS, AND OTHER AFFILIATES (COLLECTIVELY \"**ASSOCIATED PARTIES** \") DO NOT REPRESENT OR WARRANT THAT YOUR USE OF THE YARDBOOK SERVICES WILL BE FREE FROM INTERCEPTION, CORRUPTION, ERROR, DELAY OR LOSS OF DATA OR TIMELY; THAT DEFECTS OR ERRORS WILL BE CORRECTED; OR THAT THE SERVICES OR THE SERVER THAT MAKES THE YARDBOOK SERVICES AVAILABLE IS FREE FROM ANY HARMFUL COMPONENTS, INCLUDING, WITHOUT LIMITATION, VIRUSES. YARDBOOK AND ASSOCIATED PARTIES DO NOT MAKE ANY REPRESENTATIONS OR WARRANTIES THAT THE INFORMATION (INCLUDING ANY INSTRUCTIONS) ON THE YARDBOOK SERVICES IS ACCURATE, FREE OF ERRORS COMPLETE, OR USEFUL (INCLUDING, WITHOUT LIMITATION, PRICING, AVAILABILITY, GENERAL PRODUCT AND SERVICE DESCRIPTIONS ETC.), AND THE POSSIBILITY THAT UNAUTHORIZED ALTERATIONS COULD BE MADE TO YARDBOOK SERVICES BY THIRD PARTIES. YOU ASSUME TOTAL RESPONSIBILITY AND RISK FOR YOUR USE OF THE SERVICES AND YOUR RELIANCE THEREON. NO OPINION, ADVICE, OR STATEMENT OF YARDBOOK OR ANY ASSOCIATED PARTY, WHETHER MADE ON THE YARDBOOK SERVICES, OR OTHERWISE, SHALL CREATE ANY WARRANTY NOT OTHERWISE EXPRESSLY STATED HEREIN.\\n#### Limitation of Liability\\nTHE INFORMATION, SOFTWARE, PRODUCTS, AND SERVICES INCLUDED IN OR AVAILABLE THROUGH THE SERVICE MAY INCLUDE INACCURACIES OR TYPOGRAPHICAL ERRORS. CHANGES ARE PERIODICALLY ADDED TO THE INFORMATION HEREIN. YARDBOOK AND/OR ITS SUPPLIERS MAY MAKE IMPROVEMENTS AND/OR CHANGES IN THE SYSTEM AT ANY TIME. ADVICE RECEIVED VIA THE SYSTEM SHOULD NOT BE RELIED UPON FOR PERSONAL, MEDICAL, LEGAL OR FINANCIAL DECISIONS. USERS SHOULD CONSULT AN APPROPRIATE PROFESSIONAL FOR SPECIFIC ADVICE TAILORED TO THEIR SPECIFIC SITUATION.\\nTO THE MAXIMUM EXTENT PERMITTED BY APPLICABLE LAW, IN NO EVENT SHALL YARDBOOK BE LIABLE FOR ANY DIRECT, INDIRECT, PUNITIVE, INCIDENTAL, SPECIAL, CONSEQUENTIAL DAMAGES OR ANY DAMAGES WHATSOEVER INCLUDING, WITHOUT LIMITATION, DAMAGES FOR LOSS OF USE, DATA OR PROFITS, MISUSE OR INACCURACY OF DATA, ARISING OUT OF OR IN ANY WAY CONNECTED WITH THE USE OR PERFORMANCE OF THE SYSTEM, WITH THE DELAY OR INABILITY TO USE THE SYSTEM OR RELATED SERVICES, THE PROVISION OF OR FAILURE TO PROVIDE SERVICES, OR FOR ANY INFORMATION, SOFTWARE, PRODUCTS, SERVICES AND RELATED GRAPHICS OBTAINED THROUGH THE SYSTEM, OR OTHERWISE ARISING OUT OF THE USE OF THE SYSTEM, WHETHER BASED ON CONTRACT, TORT, NEGLIGENCE, STRICT LIABILITY OR OTHERWISE, EVEN IF PROVIDER OR ANY OF ITS SUPPLIERS HAS BEEN ADVISED OF THE POSSIBILITY OF DAMAGES. BECAUSE SOME STATES/JURISDICTIONS DO NOT ALLOW THE EXCLUSION OR LIMITATION OF LIABILITY FOR CONSEQUENTIAL OR INCIDENTAL DAMAGES, THE ABOVE LIMITATION MAY NOT APPLY TO A USER. IF USER IS DISSATISFIED WITH ANY PORTION OF THE SYSTEM, OR WITH ANY OF THESE TERMS OF USE, USER\\'S SOLE AND EXCLUSIVE REMEDY IS TO DISCONTINUE USING THE SYSTEM. YOU AGREE THAT IN THE EVENT YOU INCUR ANY DAMAGES, LOSSES OR INJURIES THAT ARISE OUT OF YARDBOOK\\'S ACTS OR OMISSIONS, THE DAMAGES, IF ANY, CAUSED TO YOU ARE NOT IRREPARABLE OR SUFFICIENT TO ENTITLE YOU TO AN INJUNCTION PREVENTING ANY EXPLOITATION OF THE YARDBOOK SERVICES, AND YOU WILL HAVE NO RIGHTS TO ENJOIN OR RESTRAIN THE DEVELOPMENT, PRODUCTION, DISTRIBUTION, ADVERTISING, EXHIBITION OR EXPLOITATION OF ANY YARDBOOK SERVICES, PROPERTY, PRODUCT, SERVICE, OR OTHER WEBSITE CONTENT OR MOBILE APPLICATION OWNED OR CONTROLLED BY YARDBOOK AND ASSOCIATED PARTIES.\\nYardbook shall not be held liable for loss or corruption of data, as above, caused due to interruptions or other defects in backup. Furthermore, Yardbook shall not be responsible for backup of User\\'s data on a regular basis. It is advised that User may adopt its own procedures for backup of its data if it requires regular or frequent backups.\\nYardbook will not be liable with respect to any subject matter of this agreement under any contract, negligence, strict liability or other legal or equitable theory for: (i) any special, incidental or consequential damages; (ii) the cost of procurement for substitute products or services; (iii) for interruption of use or loss or corruption of data; or (iv) for any amounts that exceed the fees paid by you to Yardbook under this agreement during the six (6) month period prior to the cause of action. Yardbook shall have no liability for any failure or delay due to matters beyond our reasonable control. The foregoing shall not apply to the extent prohibited by applicable law.\\nBY ACCESSING THE YARDBOOK SERVICES YOU UNDERSTAND THAT YOU MAY BE WAIVING RIGHTS WITH RESPECT TO CLAIMS THAT ARE AT THIS TIME UNKNOWN OR UNSUSPECTED, AND IN ACCORDANCE WITH SUCH WAIVER, YOU ACKNOWLEDGE THAT YOU HAVE READ AND UNDERSTAND, AND HEREBY EXPRESSLY WAIVE, THE BENEFITS OF CALIFORNIA CODE § 1542, AND ANY SIMILAR LAW OF ANY STATE OR TERRITORY, WHICH PROVIDES AS FOLLOWS: \"A GENERAL RELEASE DOES NOT EXTEND TO CLAIMS WHICH THE CREDITOR DOES NOT KNOW OR SUSPECT TO EXIST IN HIS FAVOR AT THE TIME OF EXECUTING THE RELEASE, WHICH IF KNOWN BY HIM MUST HAVE MATERIALLY AFFECTED HIS SETTLEMENT WITH THE DEBTOR.\"\\n#### Indemnification\\nYou agree to indemnify and hold Yardbook and Associated Parties harmless from any loss, liability, claim, or demand, including reasonable attorney\\'s fees, made or incurred by any third party due to or arising (directly or indirectly) out of your use of the website and/or mobile application, or arising from your breach of this Agreement.\\nYou are solely responsible for your interactions with merchants and other users of the Services. To the extent permitted under applicable laws, you hereby release Yardbook from any and all claims or liability related to any product or service of a merchant, any action or inaction by merchant, including merchant\\'s failure to comply with applicable law, and any conduct or speech, whether online or offline, of any other user.\\n#### Interruption of Service\\nWe reserve the right to update, modify, suspend, discontinue or close, temporarily or permanently, the Services (or any part thereof) at any time with or without notice. Features or services available through our Services may be discontinued at any time without notice. You agree that we shall not be liable to you or to any third party for any modification, suspension or discontinuance of our Services. To protect the integrity of our Services, we reserve the right at any time, in our sole discretion, to block users from certain IP addresses from accessing the Services.\\nTransactions conducted through the Internet may be subject to interruption, blackout, delay or error. Yardbook shall not be responsible in any way for loss of accuracy or timeliness of any message sent or transaction conducted through this website arising from or in relation to any malfunctions in communication facilities that are out of the control of Yardbook.\\n#### No Refunds\\nUnless we state in writing otherwise, all fees paid are nonrefundable.\\n#### Modifications to Terms of Service\\nYardbook reserves the right, in our sole discretion, to modify, add or remove portions of this Agreement at any time. Please check this Agreement periodically for changes. Your continued use of or access to the website and/or mobile application following the posting of any changes to this Agreement constitutes your binding acceptance of such changes. Yardbook may also, in the future, offer new services and/or features through our Services (including, the release of new tools and resources). Such new features and/or services shall be subject to the terms of this Agreement.\\n#### Termination\\n_Termination by Yardbook_ : We may terminate this Agreement at any time. Without limiting the foregoing, Yardbook shall have the right to immediately terminate or suspend any of your passwords or accounts in the event Yardbook considers, in its sole discretion, any of your conduct to be unacceptable, or in the event you breach any terms of this Agreement. Yardbook may terminate your access to all or any part of the Services at any time, with or without cause, with or without notice to you, effective immediately.\\nIf you have a Subscription Plan, such account can only be terminated by Yardbook if you materially breach this Agreement and fail to cure such breach within thirty (30) days of notice provided by to you; provided that, Yardbook can terminate the website immediately as part of a general shut down of our service.\\n_Termination by You_ : You may terminate this Agreement and cancel your account in the user profile screen at any time. In the event of early termination your account shall remain active and your credit card will continue to be charged the recurring monthly fee until the end of the month in which you terminated your account for all monthly premium plans and at the end of your current package term for all premium package plans. See Subscription Plans above for more information regarding termination of subscription plans.\\n_User Content and Termination_ : Upon processing your cancellation, all of your User Content will be deleted from the Services. This information cannot be recovered once your account is cancelled. We reserve the right, but have no obligation, to retain and use your information as necessary to comply with our legal obligations, resolve disputes, and enforce our agreements. Barring any legal obligations, we will delete your full user account and any associated listing services within thirty (30) days of your request or if on a subscription plan, within thirty (30) days of the last day of your then current plan. By removing your User Content from our Services or deleting your user account, all licenses granted to you by Yardbook shall immediately terminate.\\n_Survival of Terms_ : Upon termination of this Agreement, all provisions which by their nature should survive termination shall survive, including, without limitation, ownership provisions; indemnification obligations; warranty disclaimers, limitations of liabilities, statute of limitations; and dispute resolution provisions stated in these Terms.\\n#### Governing Law; Venue; Arbitration\\n_Governing Law_ : The laws of the State of California, USA. govern the interpretation of these Terms and apply to claims for breach of these Terms, regardless of conflict of laws principles of your state or country of residence. The Parties specifically exclude from application to these Terms the United Nations Convention on Contracts for the International Sale of Goods and the Uniform Computer Information Transactions Act. If you reside outside the United States you understand and agree to submit to the jurisdiction and venue of San Mateo County, California and hereby waive all forum non conveniens defenses. Any legal proceeding shall be in the County of San Mateo. In case of legal action, the prevailing party shall be entitled to reasonable attorney\\'s fees in addition to any other relief to which the party may be entitled.\\n_Binding Arbitration_ : Except for claims for injunctive or equitable relief or claims regarding intellectual property rights (which may be brought in any competent court without the posting of a bond) or claims brought in small claims court, any dispute arising under this Agreement shall be finally settled in accordance with the Comprehensive Arbitration Rules of the Judicial Arbitration and Mediation Service, Inc. (\"JAMS\"). The arbitration will be conducted by one arbitrator, as agreed on by you and Yardbook (and if you and Yardbook cannot agree within twenty (20) days, appointed in accordance with the said arbitration rules. The arbitration shall take place in the County of San Mateo, California, in the English language, but any witness whose native language is not English may give testimony in the witness\\' native language, with simultaneous translation into English at the expense of the party presenting the witness. You understand that by using the Services YOU GIVE UP YOUR RIGHT TO GO TO COURT to assert or defend any claims between you and Yardbook (except for claims for injunctive or equitable relief or claims regarding intellectual property rights or claims brought in small claims court) BEFORE A JUDGE OR JURY. Judgment on the award rendered by the arbitrator may be entered in any court having competent jurisdiction over the parties. Any provision of applicable law notwithstanding, the arbitrator will not have authority to award damages, remedies or awards that conflict with these Terms. The prevailing party in any action or proceeding to enforce this Agreement shall be entitled to costs and attorneys\\' fees.\\n_Small Claims Action_ : If your claim meets the requirements to file a small claims action, you agree to the sole jurisdiction and venue of any small claims court located in San Mateo County, California. To the extent state law applies, California law shall govern without regard to or application of the conflict of law provisions of your state or country of residence.\\n_No Class Action_ : You agree to give up your right to participate in a class action or class proceeding, including class arbitration, limited attorney general action, or other representative action or proceeding.\\n_Limitations on Time to Bring Action_ : You further agree that any claim you may have arising out of, or related to your use of our Services must be filed within one (1) year after such claim arose; otherwise, your claim is permanently barred.\\n#### Entire Agreement, Severability\\nThis Agreement, accepted upon your access and use of the Services, and further affirmed by becoming a User, contains the entire agreement between you and Yardbook regarding the use of the Services. This Agreement may not be orally amended, and may only be modified by a written amendment signed by an authorized executive of Yardbook, or by the posting by Yardbook of a revised version. If any term of this Agreement is held by a court of competent jurisdiction to be invalid or unenforceable, then this Agreement, including all of the remaining terms, will remain in full force and effect as if such invalid or unenforceable term had never been included.\\n#### No Implied Waiver\\nA waiver by either party of any term or condition of this Agreement or any breach thereof, in any one instance, will not waive such term or condition or any subsequent breach thereof. Either party\\'s failure to insist in any one or more instances for strict performance by the other party of any of the terms of this Agreement shall not be construed as a waiver of any continuing or subsequent failure to perform or delay in performance of any term hereof.\\n#### Advertising\\nYardbook reserves the right to display advertisements on its Services.\\n#### Assignability\\nYou may assign your rights under this Agreement to any party that consents to, and agrees to be bound by, its terms and conditions; Yardbook may assign its rights under this Agreement without condition. This Agreement will be binding upon and will inure to the benefit of the parties, their successors and permitted assigns.\\n#### Headings\\nHeadings used in this Agreement are provided for convenience only and shall not be used to construe meaning or intent.\\n#### Conflict of Terms\\nIf there is a conflict or contradiction between the provisions of these Terms and any relevant terms and conditions, policies or notices, the other relevant terms and conditions, policies or notices that relate specifically to a particular section or features of the Services shall take precedence solely as regards your use of the relevant section or feature of the Services. These terms shall control in all other respects.\\n#### California Users and Residents\\nPursuant to California Civil Code § 1789.3, any questions regarding pricing, complaints, or inquiries about Yardbook must be addressed to our agent for notice and sent via certified mail to: Agent of Yardbook, Inc., 1900 S. Norfolk Street, Suite 350, San Mateo, California 94403. California users are also entitled to the following specific consumer rights notice: The Complaint Assistance Unit of the Division of Consumer Services of the California Department of Consumer Affairs may be contacted in writing at 1625 North Market Blvd., Sacramento, CA 95834, or by telephone at (916) 445-1254 or (800) 952-5210.\\n#### Changes\\nYardbook reserves the right, in its sole discretion, to modify or replace any part of this Agreement. It is your responsibility to check this Agreement periodically for changes. Your continued use of or access to the website following the posting of any changes to this Agreement constitutes acceptance of those changes. Yardbook may also, in the future, offer new services and/or features through the website (including, the release of new tools and resources). Such new features and/or services shall be subject to the terms and conditions of this Agreement.\\n#### Contact Information\\nYou may send notice to us at the address below. If you have any questions relating to these Terms, please contact us at support@yardbook.com or by regular mail at:\\nYardbook, Inc. 1900 S. Norfolk Street, Suite 350 San Mateo, CA 94403\\nLast updated: 1/22/2014, 11/20/2013, 4/18/2015, 7/13/2016, 3/27/2017, 5/20/2018, 2/21/2020, 4/25/2023\\n## Privacy & Terms\\n## DMCA Policy\\nYardbook is committed to protecting your privacy and providing you a safe online experience. This Privacy Statement applies to the Yardbook website, mobile application, and also governs its data collection and usage. By using the Yardbook website and/or mobile application, you consent to the data practices described herein.\\n#### DMCA Policy\\nYardbook, Inc. takes the intellectual property rights of others seriously and expects you to do the same on our Services. We will respond to notices of copyright infringement that comply with the requirements of the Digital Millennium Copyright Act (\"**DMCA** \") (17 U.S.C. § 512). If you believe in good faith that User Content available through our Services infringes one or more of your copyrights, you may provide us written notice (\"Take Down Notice\") as described below.\\n_Take Down Notice_ :\\nYour Take Down Notice must include the following:\\n  * A physical or electronic signature of the owner or a person authorized to act on behalf of the owner of an exclusive right that is allegedly infringed;\\n  * Identification of the copyrighted work claimed to have been infringed (including a hyperlink to said work(s), if available), or, if multiple copyrighted works at a single online site are covered by a single notification, a representative list of such works at that website;\\n  * Identification of the material that is claimed to be infringing or to be the subject of infringing activity and that is to be removed or access to which is to be disabled and information reasonably sufficient to permit the service provider to locate the material (including a hyperlink to said work(s));\\n  * Information reasonably sufficient to permit the service provider to contact you, such as an address, telephone number, and, if available, an email;\\n  * A statement that you have a good faith belief that use of the material in the manner complained of is not authorized by the copyright owner, his/her/its agent, or the law; and\\n  * A statement that the information in the notification is accurate, and under penalty of perjury, that you are authorized to act on behalf of the owner of an exclusive right that is allegedly infringed.\\n\\n\\n_Steps to File a Take Down Notice_ :\\n  * Verify that the webpage in question is hosted by Yardbook. We only host pages that have \"yardbook.com\" in their URL. Contact the listing party directly.\\n  * Go to the listing post in question and send an email with your complaint to see if the matter can be resolved directly between you and the listing party.\\n  * Send your Take Down Notice to our designated agent. If the issue cannot be resolved directly with the listing party, send your complaint to our designated agent at (we prefer email): \\nMrs. Leaman Email: dmca@yardbook.com Yardbook, Inc. 1900 S. Norfolk Street, Suite 350 San Mateo, CA 94403\\n\\n\\nFor clarity, only DMCA notices or counter-notices should go to the Copyright Agent; any other feedback, comments, requests for technical support, and other communications should be directed to Yardbook customer support by email at support@yardbook.com. You acknowledge that if you fail to comply with all of the requirements as set forth herein, your DMCA notice may not be valid and may not be considered by Yardbook.\\n#### Your Take Down Notice may also be forwarded to the party that made the content available or to third parties such as ChillingEffects.org.\\n_Counter-Notice To Restore Removed Content_ :\\nIf you believe that your User Content that was removed (or to which access was disabled) is not infringing, or that you have the authorization from the copyright owner, the copyright owner\\'s agent, or pursuant to the law, to post and use the material in your Content, you may send a counter-notice containing the following information:\\n  * Your physical or electronic signature;\\n  * Identification of the Content that has been removed or to which access has been disabled and the location at which the Content appeared before it was removed or disabled;\\n  * A statement that you have a good faith belief that the Content was removed or disabled as a result of mistake or a misidentification of the Content;\\n  * Your name, address, telephone number, and email address, a statement that you consent to the jurisdiction of the federal court in the district where you live (if you reside in the U.S.), or your consent to the jurisdiction of a federal court in Pleasanton, California in Alameda County (if you reside outside the U.S.); and\\n  * A statement that you will accept service of process from the person who provided notification of the alleged infringement.\\n\\n\\nIf a counter-notice is received by the Copyright Agent, Yardbook may send a copy of the counter-notice to the original complaining party informing that person that it may replace the removed User Content or cease disabling it in ten (10) business days. Unless the copyright owner files an action seeking a court order against the user content provider or user, the removed User Content may be replaced, or access to Yardbook\\'s Services restored, at Yardbook\\'s sole discretion.\\n_Repeat Infringer Policy_ : Yardbook will terminate user accounts that have been subject to three (3) separate DMCA notices. In the event a user\\'s materials are removed based on a DMCA notice and then subsequently restored due to the filing of a DMCA counter-notification, the underlying DMCA notice will be deemed withdrawn for purposes of this policy. We reserve the right to terminate user accounts subject to less than three (3) DMCA notices in appropriate circumstances (i.e. the user has a history of violating or willfully disregarding Yardbook\\'s Terms of Service).\\n_Requests For Further Information_ : To ensure a timely processing of your notice or counter-notice, please make sure you have complied with the steps set forth above. If we request additional information required to make your DMCA notice or counter-notice complete, please provide that information promptly. If you fail to comply with these requirements, we may not be able to process your notice or counter-notice.\\n_Bad Faith Conduct_ : Please be advised that you will be liable for damages (including costs and attorneys\\' fees) if you materially misrepresent that a product or activity infringes your copyright. If you are unsure whether User Content located on, or third-party content linked to our Services infringes your copyright, you should consult an attorney before submitting a Take Down Notice.\\n####  ![](https://www.yardbook.com/assets/logo-996aca0596a08f3b4f2624a440840dbbfe38bb5a4551afe32808a16b5197f718.png) Yardbook is a FREE web-based application designed to help manage landscaping businesses. \\n  * Manage Customers \\n  * Schedule Jobs \\n  * Create Estimates and Bills \\n  * List Your Business In Our Public Directory \\n\\n\\n####  Do you already have a yardbook account? No⟨6⟩ Yes⟨5⟩\\n## Why is Yardbook free?\\nYardbook has a sponsored ad business model similar to Google and Facebook. This model enables our users to benefit from the software for free and has enabled Yardbook to continuously innovate and improve the product. We also now offer **optional** premium features for larger companies that may require more sophisticated functionality to run their business. \\nThe Yardbook team is committed to providing affordable and tailored software to best support your landscape business, no matter the size. \\n' references_markdown='\\n\\n## References\\n\\n⟨1⟩ https://www.yardbook.com/<#intro>:  Yardbook \\n⟨2⟩ https://www.yardbook.com/<#body>: Home\\n⟨3⟩ https://www.yardbook.com/<#features>: Features\\n⟨4⟩ https://www.yardbook.com/<http:/support.yardbook.com>: Support\\n⟨5⟩ https://www.yardbook.com/</users/sign_in>: Log In\\n⟨6⟩ https://www.yardbook.com/</users/sign_up>: SIGN UP FREE\\n⟨7⟩ https://www.yardbook.com/<#my_video_1>: Watch Video\\n⟨8⟩ https://www.yardbook.com/<#why_is_free_fancybox>:  Why is it free?\\n⟨9⟩ https://www.yardbook.com/<#raise_your_profile>: Claim your Yardbook profile today!\\n⟨10⟩ https://www.yardbook.com/<http:/www.buhlerlandscape.com/>: Buhler Landscape\\n⟨11⟩ https://www.yardbook.com/<http:/www.southmetrolawncare.com>: South Metro Lawn Care\\n⟨12⟩ https://www.yardbook.com/<http:/www.360lawncarenc.com>: 360 Lawn Care\\n⟨13⟩ https://www.yardbook.com/<http:/www.mownlawns.com/>: Mow N Lawns\\n⟨14⟩ https://www.yardbook.com/<#myCarousel>: ‹\\n⟨15⟩ https://www.yardbook.com/</recommendations/customer_recommendations>: Read More\\n⟨16⟩ https://www.yardbook.com/</pages/new_landscaper_profile>: Business Profile\\n⟨17⟩ https://www.yardbook.com/</pages/invoice_landing_page>: Estimates\\n⟨18⟩ https://www.yardbook.com/</pages/start_landscaping_business_landing_page>: Account Management\\n⟨19⟩ https://www.yardbook.com/</pages/home>: Text/Email Messages\\n⟨20⟩ https://www.yardbook.com/</pages/job_scheduling_landing_page>: Job Scheduling\\n⟨21⟩ https://www.yardbook.com/</pages/routing_optimization_landing_page>: Routing\\n⟨22⟩ https://www.yardbook.com/</customers?guest_user=Yes>: VIEW DEMO ACCOUNT\\n⟨23⟩ https://www.yardbook.com/<#confirmHaveAccountModal>:  GET MY PROFILE \\n⟨24⟩ https://www.yardbook.com/<>: Scroll Up \\n⟨25⟩ https://www.yardbook.com/<#tos>: Privacy & Terms\\n⟨26⟩ https://www.yardbook.com/<#tos2>: Privacy Statement\\n⟨27⟩ https://www.yardbook.com/<https:/www.macromedia.com/support/documentation/en/flashplayer/help/settings_manager07.html>: Macromedia website.\\n⟨28⟩ https://www.yardbook.com/<https:/tools.google.com/dlpage/gaoptout>: Google Analytics Opt-out Browser Add-on.\\n⟨29⟩ https://www.yardbook.com/<http:/google.com/privacy_ads.html>: http://google.com/privacy_ads.html.\\n⟨30⟩ https://www.yardbook.com/<https:/www.yardbook.com/pages/tos>: Terms of Service\\n⟨31⟩ https://www.yardbook.com/<https:/www.yardbook.com>: www.yardbook.com\\n⟨32⟩ https://www.yardbook.com/<https:/plaid.com/legal>: Plaid Privacy Policy\\n⟨33⟩ https://www.yardbook.com/<https:/stripe.com/gb/connect-account/legal>: Stripe Connected Account Agreement\\n⟨34⟩ https://www.yardbook.com/<https:/stripe.com/gb/legal>: Stripe Terms of Service\\n' fit_markdown='' fit_html=''",
    "generated_description": "**Yardbook: Revolutionizing Yard Care**\n\n**Overview**\n\nYardbook is a web-based platform tailored for landscaping businesses, launched with the mission to revolutionize yard care through comprehensive software solutions and a marketplace. Founded in Y Combinator's Winter 2016 batch and based in San Mateo, California, Yardbook has rapidly gained traction, empowering over 7,000 landscaping businesses across the U.S. with its multifaceted application.\n\n**Why Yardbook?**\n\nRecognizing the pride and challenges of managing a landscaping business, Yardbook provides a free, intuitive software solution to help owners streamline their operations. The platform facilitates scheduling jobs, creating estimates, processing invoices, managing payments, and handling timesheets—all crucial components for running a landscaping business efficiently.\n\n**Key Features**\n\nYardbook’s suite of tools includes:\n- **Customer Management:** Create and maintain relationships through a robust profile system.\n- **Job Scheduling & Routing:** Optimize job assignments to enhance productivity.\n- **Estimates & Invoicing:** Quickly generate professional estimates and invoices to get paid faster.\n- **Business Operations:** Manage expenses, track chemical usage, and oversee equipment maintenance from a single dashboard.\n\n**User Friendly and Accessible**\n\nOne of the biggest advantages of Yardbook is its user-friendly nature. Customers regularly report a low learning curve, enabling them to get started without requiring extensive training. The platform is designed for those who might still rely on traditional methods or an array of disjointed systems—Yardbook makes it easy to transition to a digital, organized operation.\n\n**A Growing Community**\n\nWith over 20,000 businesses utilizing Yardbook, the platform is fostering a community of landscapers eager to connect and collaborate. Users can claim profiles in a public directory, enhancing their visibility to potential clients and generating leads directly from the Yardbook platform.\n\n**Why is it Free?**\n\nYardbook operates on a sponsorship model, similar to those of major tech companies, allowing users to access essential tools at no charge. While core functionalities are free, premium features are available for businesses that require more advanced capabilities.\n\n**Conclusion**\n\nIn an industry where efficiency and organization are paramount, Yardbook emerges as a powerful ally for landscaping professionals. Its commitment to simplifying yard care management is not only refreshing but necessary in today's fast-paced market. If you’re still manually juggling tasks or stuck with an outdated system, it might be time to give Yardbook a try. Check it out at [yardbook.com](https://www.yardbook.com). \n\nIn summary, Yardbook isn’t just software; it’s a game-changer for anyone serious about growing their landscaping business and improving their operational efficiency.",
    "embedding": [
        0.005562859121710062,
        0.023647107183933258,
        -0.014963813126087189,
        -0.02550271525979042,
        -0.0011696674628183246,
        -0.04351956024765968,
        0.01616123504936695,
        0.015939196571707726,
        -0.03853955119848251,
        0.07485871762037277,
        0.03457457572221756,
        -0.01965041272342205,
        0.001802080892957747,
        -0.0023988094180822372,
        -0.033400945365428925,
        0.02193423919379711,
        -0.040284138172864914,
        0.0011002804385498166,
        -0.0059990063309669495,
        -0.013544352725148201,
        0.0038063754327595234,
        -0.01292581669986248,
        -0.002166858408600092,
        -0.021172963082790375,
        -0.010293073952198029,
        0.006351889111101627,
        0.002862711437046528,
        -0.003857920179143548,
        0.041870128363370895,
        0.02507449872791767,
        0.017778946086764336,
        0.0023492472246289253,
        -0.00646290834993124,
        0.033147186040878296,
        0.006054515950381756,
        -0.007045759353786707,
        0.02026894874870777,
        0.02331404946744442,
        0.0013639512471854687,
        0.022203857079148293,
        0.02366296760737896,
        0.02409118413925171,
        0.04342440143227577,
        0.03562133014202118,
        0.030276544392108917,
        0.011093998327851295,
        -0.025122078135609627,
        -0.011109858751296997,
        -0.03790515661239624,
        0.02472558058798313,
        0.02209283784031868,
        -0.000845035188831389,
        0.042663123458623886,
        0.048594728112220764,
        0.04412223398685455,
        0.02961042895913124,
        0.028595395386219025,
        0.00865157414227724,
        -0.023187169805169106,
        0.010602341964840889,
        0.0005912767956033349,
        0.00045151147060096264,
        0.006324134301394224,
        -0.018207162618637085,
        0.004865023773163557,
        0.03457457572221756,
        0.0020181720610708,
        0.020665446296334267,
        -0.020062770694494247,
        -0.010063105262815952,
        -0.02986418642103672,
        0.03815891221165657,
        -0.0065065231174230576,
        0.0049244980327785015,
        0.008405745960772038,
        -0.005408225115388632,
        0.017096970230340958,
        -0.016177095472812653,
        -0.02959456853568554,
        0.03568476811051369,
        0.026327429339289665,
        -0.005650088656693697,
        -0.01947595365345478,
        -0.015328590758144855,
        -0.0009377164533361793,
        -0.012346929870545864,
        -0.02734246291220188,
        -0.10239149630069733,
        -0.004702459555119276,
        0.01326680462807417,
        -0.022647934034466743,
        0.015740947797894478,
        -0.031561195850372314,
        0.0017554924124851823,
        0.04792860895395279,
        0.014384927228093147,
        0.00037642475217580795,
        0.019269775599241257,
        -0.008009248413145542,
        0.005852302070707083,
        -0.010515112429857254,
        -0.03205285221338272,
        -0.005122746806591749,
        -0.05059307441115379,
        -0.03368642181158066,
        -0.027088705450296402,
        -0.006982319988310337,
        0.049292560666799545,
        -0.018032703548669815,
        -0.011371546424925327,
        0.048150647431612015,
        -0.019412513822317123,
        0.015090692788362503,
        0.02131570316851139,
        -0.03511381149291992,
        0.04643778130412102,
        0.006514452863484621,
        -0.04066477715969086,
        0.0031006098724901676,
        -0.004928463138639927,
        -0.012346929870545864,
        -0.030784061178565025,
        -0.017667926847934723,
        -0.04031585901975632,
        -0.015209642238914967,
        0.00389756984077394,
        0.007937878370285034,
        -0.008116303011775017,
        0.025566155090928078,
        -0.00877845287322998,
        -0.013988429680466652,
        0.025090357288718224,
        0.025359977036714554,
        0.022584494203329086,
        -0.0013897235039621592,
        0.02715214528143406,
        0.03048272244632244,
        0.049895238131284714,
        -0.001332231448031962,
        -0.0009287952561862767,
        -0.00882603321224451,
        -0.008092512376606464,
        -0.023536087945103645,
        0.010982979089021683,
        -0.03961802273988724,
        -0.0020498917438089848,
        -0.0010685606393963099,
        0.029404250904917717,
        -0.034542858600616455,
        0.029499409720301628,
        -0.02236245572566986,
        -0.02915049158036709,
        0.03368642181158066,
        -0.020570287480950356,
        0.01641499437391758,
        -0.027881700545549393,
        -0.037936873733997345,
        -0.02715214528143406,
        -0.0037488832604140043,
        0.022917551919817924,
        -0.022949272766709328,
        0.007489836774766445,
        -0.013893269933760166,
        0.054970405995845795,
        0.013258874416351318,
        0.0033841056283563375,
        0.02672392688691616,
        -0.015748878940939903,
        -0.02158532105386257,
        0.02069716714322567,
        0.011205017566680908,
        -0.019000157713890076,
        -0.03895190730690956,
        -0.03381330147385597,
        -0.008175777271389961,
        0.006819755770266056,
        0.008191636763513088,
        -0.04462975263595581,
        0.0010923504596576095,
        -0.05100543051958084,
        -0.023536087945103645,
        -0.0034931425470858812,
        0.011141577735543251,
        -0.010205844417214394,
        0.03536757081747055,
        0.04808720946311951,
        0.038285791873931885,
        0.019856592640280724,
        -0.003201716812327504,
        -0.02961042895913124,
        0.009833136573433876,
        0.005118782166391611,
        -0.008001318201422691,
        -0.009381129406392574,
        0.023440929129719734,
        0.008913262747228146,
        0.022632073611021042,
        0.037334199994802475,
        0.009856926277279854,
        -0.011133648455142975,
        -0.008469185791909695,
        0.008786383084952831,
        0.025217236950993538,
        0.02478902041912079,
        0.03955458477139473,
        0.010205844417214394,
        0.008223356679081917,
        -0.03030826523900032,
        0.011514285579323769,
        -0.01467040553689003,
        -0.0076484354212880135,
        0.04846784844994545,
        -0.019618693739175797,
        0.010824380442500114,
        -0.03257622942328453,
        0.009531798772513866,
        0.008944982662796974,
        -0.029816607013344765,
        0.03046686388552189,
        0.0038242177106440067,
        0.002371054608374834,
        -0.019682133570313454,
        -0.004214767832309008,
        -0.019618693739175797,
        0.017953403294086456,
        -0.013219224289059639,
        0.003978851716965437,
        0.028484376147389412,
        0.03888846933841705,
        0.040474459528923035,
        0.011775974184274673,
        0.006328098941594362,
        -0.007184533402323723,
        0.0007473976584151387,
        -0.041077133268117905,
        -0.022901691496372223,
        0.022949272766709328,
        -0.042821723967790604,
        -0.058491300791502,
        -0.012878237292170525,
        0.002801254391670227,
        0.0030906975734978914,
        -0.05484352633357048,
        -0.0054439096711575985,
        0.04332923889160156,
        0.0027992718387395144,
        0.01939665526151657,
        0.037841714918613434,
        0.006328098941594362,
        -0.0010398145532235503,
        -0.00018523864855524153,
        -0.05582683905959129,
        -0.03647776320576668,
        -0.023980164900422096,
        0.010975048877298832,
        -0.032179731875658035,
        0.03711216151714325,
        0.01099883858114481,
        -0.006569962482899427,
        0.049038805067539215,
        -0.013560212217271328,
        0.03246521204710007,
        0.018397482112050056,
        0.022632073611021042,
        0.025613734498620033,
        -0.026660487055778503,
        0.022552775219082832,
        0.014416647143661976,
        0.015209642238914967,
        0.030181385576725006,
        0.02087162435054779,
        0.0018397481180727482,
        0.05522416532039642,
        -0.0004879396583419293,
        0.021061943843960762,
        -0.012965465895831585,
        0.018445061519742012,
        0.04494694992899895,
        0.018445061519742012,
        0.039681464433670044,
        0.004650915041565895,
        -0.042314205318689346,
        0.07784038037061691,
        0.04393191635608673,
        -0.0022580528166145086,
        0.008722943253815174,
        0.030165525153279305,
        -0.05560480058193207,
        -0.016232606023550034,
        -0.044756632298231125,
        -0.021410861983895302,
        0.015201712027192116,
        0.045549627393484116,
        0.0141866784542799,
        0.041172295808792114,
        0.02025309018790722,
        0.03587508946657181,
        0.0008693206473253667,
        -0.03800031542778015,
        -0.01999933086335659,
        0.03971318528056145,
        -0.005309100728482008,
        -0.011474636383354664,
        -0.026438448578119278,
        -0.006110025569796562,
        0.042567964643239975,
        0.0032155942171812057,
        0.03466973453760147,
        -0.03168807551264763,
        -0.027183864265680313,
        0.03711216151714325,
        -0.015844037756323814,
        0.0032453315798193216,
        0.013790180906653404,
        0.035843368619680405,
        0.05132262781262398,
        0.02854781597852707,
        0.004865023773163557,
        -0.020316528156399727,
        0.002890466246753931,
        0.037841714918613434,
        -0.004896743223071098,
        -0.05110058933496475,
        0.02601023204624653,
        -0.0018298357026651502,
        0.010649921372532845,
        -0.03650948405265808,
        0.019777292385697365,
        0.0007255903328768909,
        0.017144549638032913,
        0.025217236950993538,
        0.0235836673527956,
        0.00018573427223600447,
        0.0021509986836463213,
        -0.0045835105702281,
        -0.042663123458623886,
        -0.008810172788798809,
        -0.006625472102314234,
        0.04088681563735008,
        0.01765206642448902,
        -0.0427900031208992,
        -0.018143722787499428,
        0.009381129406392574,
        0.06832443922758102,
        0.0032948937732726336,
        -0.00018821237608790398,
        -0.013829831033945084,
        0.016732191666960716,
        0.008437465876340866,
        -0.015685439109802246,
        0.001160746207460761,
        -0.012505529448390007,
        0.02550271525979042,
        0.019491814076900482,
        0.0011637200368568301,
        0.009103581309318542,
        -0.011276387609541416,
        -0.010340653359889984,
        -0.01676391251385212,
        0.006728561595082283,
        0.0170176699757576,
        -0.02507449872791767,
        -0.012759287841618061,
        0.06309067457914352,
        0.012727567926049232,
        0.04288516193628311,
        -0.015701299533247948,
        0.03205285221338272,
        0.01850850135087967,
        -0.011553935706615448,
        0.012473809532821178,
        0.004769864026457071,
        -0.005618368741124868,
        -0.00016652893100399524,
        -0.029404250904917717,
        0.021093664690852165,
        0.019190475344657898,
        0.013972570188343525,
        -0.01052304171025753,
        0.021458441391587257,
        0.01980901136994362,
        -0.013813970610499382,
        -0.0010080947540700436,
        -0.01782652549445629,
        0.020205508917570114,
        -0.011411196552217007,
        0.008084583096206188,
        -0.008659504354000092,
        0.038380950689315796,
        0.002105401363223791,
        -0.020744746550917625,
        0.04853128641843796,
        -0.023456787690520287,
        -0.018286462873220444,
        -0.009841066785156727,
        -0.016367414966225624,
        0.019079456105828285,
        -0.0033147186040878296,
        0.035335853695869446,
        -0.02026894874870777,
        0.00929389987140894,
        0.016399133950471878,
        -0.010530971921980381,
        0.03974490240216255,
        -0.027532782405614853,
        0.0015096639981493354,
        -0.0036755313631147146,
        -0.013679161667823792,
        0.003064925316721201,
        -0.013028905726969242,
        -0.01643085479736328,
        -0.01161737460643053,
        -0.026692207902669907,
        0.051830146461725235,
        0.013774321414530277,
        0.010039315558969975,
        -0.005388400051742792,
        0.03476489707827568,
        0.021204683929681778,
        0.014369066804647446,
        -0.003635881468653679,
        -0.0012519406154751778,
        -0.0157171580940485,
        0.03246521204710007,
        -0.035050373524427414,
        0.02172805927693844,
        0.052401103079319,
        -0.005150501616299152,
        -0.00851676519960165,
        -0.010626131668686867,
        0.018571939319372177,
        0.0410454161465168,
        0.002920203609392047,
        -0.005959356669336557,
        0.03869815170764923,
        0.015471329912543297,
        0.050688233226537704,
        0.01643085479736328,
        -0.012069381773471832,
        0.01782652549445629,
        -0.02478902041912079,
        -0.01765206642448902,
        -0.0015592261916026473,
        -0.042916882783174515,
        -0.02899189293384552,
        0.02680322714149952,
        -0.0283892173320055,
        0.003007433144375682,
        -0.001717825187370181,
        -0.03869815170764923,
        -0.03081578016281128,
        0.012243840843439102,
        -0.04269484430551529,
        0.06232939660549164,
        -0.03482833504676819,
        -0.004928463138639927,
        -0.008096477948129177,
        0.0029102913103997707,
        0.02769138105213642,
        -0.001327275182120502,
        -0.004865023773163557,
        -0.009325619786977768,
        0.003990746568888426,
        -0.04735765606164932,
        -0.06267831474542618,
        0.01336196344345808,
        -0.01022170390933752,
        -0.03974490240216255,
        0.020570287480950356,
        0.00868329405784607,
        -0.008231286890804768,
        -0.03949114680290222,
        -0.010578551329672337,
        0.016541874036192894,
        -0.0046548801474273205,
        0.0349552147090435,
        0.01972971297800541,
        -0.00715677859261632,
        0.021680479869246483,
        -0.0044011217541992664,
        0.0010824380442500114,
        0.006538242567330599,
        0.022029398009181023,
        0.01577266864478588,
        0.012426230125129223,
        -0.04941944032907486,
        0.03381330147385597,
        -0.016446713358163834,
        0.024519402533769608,
        -0.011807694099843502,
        -0.03511381149291992,
        0.02340920828282833,
        -0.04665981978178024,
        -0.014900374226272106,
        0.01340954378247261,
        0.019967611879110336,
        -0.037492796778678894,
        -0.0038420602213591337,
        -0.024487681686878204,
        -0.022758953273296356,
        -0.018492640927433968,
        0.011783904395997524,
        -0.016795631498098373,
        0.0030728550627827644,
        -0.06385194510221481,
        -0.012220051139593124,
        0.015193781815469265,
        0.010308933444321156,
        0.029816607013344765,
        -0.022219717502593994,
        0.00731141259893775,
        0.03990350291132927,
        -0.019412513822317123,
        -0.003300841199234128,
        0.026216410100460052,
        -0.009579378180205822,
        -0.01558234915137291,
        -0.014606965705752373,
        0.0296897292137146,
        0.02548685483634472,
        0.0124500198289752,
        -0.016002636402845383,
        -0.010055175051093102,
        -0.02873813360929489,
        -0.007493801414966583,
        0.01153014600276947,
        -0.007351062726229429,
        0.013298524543642998,
        0.07669846713542938,
        -0.012814797461032867,
        -0.0059990063309669495,
        0.01527308113873005,
        0.008096477948129177,
        0.015098623000085354,
        -0.013433333486318588,
        0.012220051139593124,
        -0.002535601146519184,
        0.03866643086075783,
        -0.011466706171631813,
        -0.0040997834876179695,
        -0.04158465191721916,
        -0.012323140166699886,
        -0.01431355718523264,
        -0.03289342671632767,
        0.01747760735452175,
        0.031307436525821686,
        0.03822235390543938,
        0.0096031678840518,
        -0.004849163815379143,
        0.020633727312088013,
        -0.0318625345826149,
        -0.018730539828538895,
        0.013560212217271328,
        -0.024297364056110382,
        0.013274733908474445,
        -0.030054505914449692,
        -0.009341479279100895,
        -0.004547825548797846,
        -0.00038856748142279685,
        -0.01806442253291607,
        -0.012196261435747147,
        0.007814964279532433,
        0.06397882848978043,
        -0.013425403274595737,
        0.0024424241855740547,
        -0.02444010227918625,
        0.005328925792127848,
        0.012545178644359112,
        0.0035109848249703646,
        -0.017604487016797066,
        0.020284809172153473,
        -0.0014521718258038163,
        -0.026089532300829887,
        -0.01885741762816906,
        -0.003939202055335045,
        -0.011688744649291039,
        -0.0007682137656956911,
        0.006407398730516434,
        0.05046619474887848,
        -0.03939598426222801,
        0.0022263331338763237,
        0.011205017566680908,
        -0.01419460866600275,
        0.017398307099938393,
        -0.012553108856081963,
        0.018127862364053726,
        -0.019856592640280724,
        0.005435979925096035,
        0.0057333530858159065,
        0.02550271525979042,
        -0.005971251521259546,
        0.019016018137335777,
        -0.03730247914791107,
        0.0002437220246065408,
        0.005955391563475132,
        -0.012648268602788448,
        -0.029673868790268898,
        0.015915406867861748,
        0.021791499108076096,
        0.0019249951001256704,
        0.04995867609977722,
        -0.004769864026457071,
        0.0349552147090435,
        0.017667926847934723,
        -0.01738244853913784,
        -0.01149049587547779,
        0.0488802045583725,
        -0.006994214840233326,
        0.01885741762816906,
        0.006328098941594362,
        -0.007644470781087875,
        0.022108696401119232,
        0.0323224700987339,
        -0.024027744308114052,
        0.03958630561828613,
        0.007771349977701902,
        -0.024646280333399773,
        0.003899552393704653,
        0.005975216627120972,
        -0.012759287841618061,
        -0.01384569052606821,
        -0.014369066804647446,
        -0.026612907648086548,
        -0.03311546519398689,
        0.015011393465101719,
        0.022330736741423607,
        -0.027643801644444466,
        -0.01850850135087967,
        -0.002369072288274765,
        -0.0027477273251861334,
        0.01668461225926876,
        0.0179058238863945,
        -0.02356780879199505,
        0.0016484381631016731,
        0.02558201551437378,
        0.006942670326679945,
        0.014702125452458858,
        -0.01528894156217575,
        -0.0022600353695452213,
        -0.013282664120197296,
        -0.002666445216163993,
        -0.004349576774984598,
        -0.006423258688300848,
        0.1407090127468109,
        -0.019523533061146736,
        -0.002575250808149576,
        0.02627984993159771,
        0.02897603251039982,
        0.009769696742296219,
        0.026073671877384186,
        -0.026168830692768097,
        0.02602609246969223,
        0.01610572636127472,
        0.02566131390631199,
        0.006407398730516434,
        0.016716331243515015,
        -0.00012774651986546814,
        -0.022489335387945175,
        0.022933412343263626,
        0.026073671877384186,
        0.02872227504849434,
        0.01695423014461994,
        0.009040141478180885,
        0.009658677503466606,
        0.0016930440906435251,
        0.00543994503095746,
        -0.011260527186095715,
        0.013465053401887417,
        0.022299015894532204,
        -0.015003463253378868,
        0.00039724085945636034,
        0.0013302488951012492,
        -0.00038262002635747194,
        0.013036835938692093,
        0.01693837158381939,
        -0.013354034163057804,
        0.006034690886735916,
        0.023282330483198166,
        -0.00628844927996397,
        -0.021188823506236076,
        0.001464066794142127,
        -0.021426722407341003,
        -0.00035213929368183017,
        -0.0091670211404562,
        -0.01419460866600275,
        -0.005475629586726427,
        -0.03298858553171158,
        -0.018968436866998672,
        0.004420946352183819,
        0.026755647733807564,
        0.005142571870237589,
        -0.0034614226315170527,
        0.01895257830619812,
        0.011768043972551823,
        0.018048563972115517,
        -0.0035486521665006876,
        -0.015423750504851341,
        -0.04031585901975632,
        0.015082762576639652,
        -0.011926642619073391,
        0.00038782405317761004,
        -0.011323967017233372,
        0.00417115306481719,
        -0.03562133014202118,
        -0.014575245790183544,
        0.03248107060790062,
        -0.0013708899496123195,
        -0.023092010989785194,
        -0.0021569461096078157,
        -0.016557732596993446,
        -0.0060386559925973415,
        -0.002515776315703988,
        0.012069381773471832,
        0.021157102659344673,
        0.012513459660112858,
        -0.03168807551264763,
        0.00726779829710722,
        0.012021802365779877,
        -0.029467688873410225,
        0.004294067155569792,
        0.02079232595860958,
        0.007513626478612423,
        0.008603994734585285,
        -0.035050373524427414,
        -0.02724730409681797,
        0.00030009899637661874,
        0.009278040379285812,
        -0.019935891032218933,
        0.01546340063214302,
        -0.01279100775718689,
        -0.013964639976620674,
        0.001404592185281217,
        -0.007477941922843456,
        0.0013094327878206968,
        0.013647441752254963,
        -0.01022170390933752,
        0.015780597925186157,
        -0.016446713358163834,
        -0.03695356100797653,
        0.0124500198289752,
        0.012806867249310017,
        0.002065751701593399,
        -0.007719804998487234,
        -0.018556080758571625,
        0.004888813477009535,
        0.02183907851576805,
        0.009523868560791016,
        0.00869122426956892,
        -0.015233431942760944,
        -0.015955056995153427,
        0.018032703548669815,
        -0.002468196675181389,
        -0.046057142317295074,
        -0.022203857079148293,
        -0.003435650374740362,
        0.009523868560791016,
        0.0010229634353891015,
        0.007029899396002293,
        -0.010816450230777264,
        0.017350727692246437,
        -0.010459602810442448,
        0.013790180906653404,
        -0.004290102515369654,
        0.025106217712163925,
        0.0014957865932956338,
        -0.0005878074443899095,
        -0.010174124501645565,
        -0.015574419870972633,
        0.009896576404571533,
        -0.016137445345520973,
        0.0064311884343624115,
        0.0013560212682932615,
        0.011498426087200642,
        -0.010499252006411552,
        -0.014384927228093147,
        0.018635379150509834,
        0.019713852554559708,
        0.020031049847602844,
        -0.009095651097595692,
        -0.02889673411846161,
        0.011886993423104286,
        -0.0016543855890631676,
        0.011339826509356499,
        -0.02304443158209324,
        0.0023829496931284666,
        -0.005094991996884346,
        0.028056159615516663,
        -0.011775974184274673,
        -0.008580205030739307,
        0.01947595365345478,
        -0.0048729535192251205,
        -0.015994707122445107,
        0.003330578561872244,
        -0.0024067393969744444,
        0.03390846028923988,
        0.0005912767956033349,
        0.013813970610499382,
        -0.02288583293557167,
        -0.02304443158209324,
        0.001312406500801444,
        -0.009151160717010498,
        -0.022061116993427277,
        -0.01982487179338932,
        -0.027485202997922897,
        0.009016351774334908,
        -0.011783904395997524,
        0.010308933444321156,
        -0.010594411753118038,
        -0.007699980400502682,
        0.03508209437131882,
        0.011736324056982994,
        0.046850137412548065,
        -0.007688085548579693,
        0.030419284477829933,
        -0.008151987567543983,
        0.0015066902851685882,
        -0.002547495998442173,
        -0.027263164520263672,
        -0.02645430900156498,
        0.024947619065642357,
        -0.01711282879114151,
        -0.02943596988916397,
        0.0028290092013776302,
        -0.0067721763625741005,
        -0.03508209437131882,
        0.008770523592829704,
        0.030244825407862663,
        -0.015899546444416046,
        -0.01649429276585579,
        -0.013346103951334953,
        -0.013893269933760166,
        0.02478902041912079,
        -0.039681464433670044,
        0.014305627904832363,
        -0.0009030229412019253,
        -0.003913429565727711,
        0.002614900702610612,
        0.04155293107032776,
        0.031021960079669952,
        0.03568476811051369,
        0.0031283649150282145,
        -0.012172471731901169,
        -0.007426396943628788,
        0.022901691496372223,
        -0.012719637714326382,
        -0.008659504354000092,
        -0.024995198473334312,
        0.02261621318757534,
        0.004972077906131744,
        -0.0035883018281310797,
        -0.019238056614995003,
        0.008485045284032822,
        -0.0035149496980011463,
        0.0061774300411343575,
        0.015249291434884071,
        -0.009325619786977768,
        0.027310743927955627,
        -0.0030708727426826954,
        -0.008389885537326336,
        0.019317355006933212,
        0.006439118646085262,
        -0.01575680822134018,
        -0.030974380671977997,
        -0.006577892694622278,
        0.03815891221165657,
        0.0014174783136695623,
        0.005281345918774605,
        -0.0629003569483757,
        -0.0036715662572532892,
        0.007719804998487234,
        -0.019428374245762825,
        0.01860366016626358,
        0.03971318528056145,
        0.005114817060530186,
        -0.027009405195713043,
        -0.01306062564253807,
        0.0022858078591525555,
        0.027294883504509926,
        0.012545178644359112,
        -0.029880046844482422,
        -0.0019071527058258653,
        -0.01057062204927206,
        -0.02095092460513115,
        -0.010229634121060371,
        0.04202872887253761,
        -0.036731522530317307,
        0.00536857545375824,
        -0.01719212904572487,
        0.026692207902669907,
        0.0066452971659600735,
        -0.02175978012382984,
        0.006209149956703186,
        -0.03850783035159111,
        -0.012862376868724823,
        -0.01384569052606821,
        -0.010419952683150768,
        -0.0012420282000675797,
        -0.023282330483198166,
        -0.01693837158381939,
        -0.008080617524683475,
        0.009309760294854641,
        -0.01402014959603548,
        -0.011450845748186111,
        0.00294795841909945,
        0.016446713358163834,
        0.014614895917475224,
        0.019682133570313454,
        0.012545178644359112,
        -0.019777292385697365,
        -0.021157102659344673,
        -0.01730314828455448,
        -0.004210802726447582,
        -0.01868295855820179,
        -0.0009352383203804493,
        -0.018048563972115517,
        0.005083097144961357,
        -0.023900866508483887,
        -0.0026961825788021088,
        0.015090692788362503,
        -0.03127571940422058,
        0.032100431621074677,
        0.012632408179342747,
        -0.031830813735723495,
        -0.011458775959908962,
        -0.03137087821960449,
        0.035748209804296494,
        0.019158756360411644,
        0.0012767217122018337,
        -0.02061786688864231,
        0.012109031900763512,
        0.024503542110323906,
        0.0007602838450111449,
        0.03657292574644089,
        -0.013853620737791061,
        -0.002428546780720353,
        -0.029356669634580612,
        -0.01965041272342205,
        -0.0022838253062218428,
        0.002319510094821453,
        -0.005788862705230713,
        -0.004274242557585239,
        0.01823888160288334,
        -0.009928296320140362,
        0.0030629427637904882,
        -0.015209642238914967,
        -0.016113655641674995,
        0.005713528022170067,
        0.02339334972202778,
        -0.017049390822649002,
        0.014408716931939125,
        0.01431355718523264,
        -0.0008717987220734358,
        -0.021886657923460007,
        -0.027659662067890167,
        -0.0007280684076249599,
        0.010285143740475178,
        -0.01782652549445629,
        -0.02548685483634472,
        -0.038190633058547974,
        0.022378316149115562,
        -0.03132329881191254,
        0.031053679063916206,
        0.018381621688604355,
        0.014464226551353931,
        0.013560212217271328,
        0.06781692057847977,
        0.011672884225845337,
        -0.0059990063309669495,
        0.0019814958795905113,
        0.03213215246796608,
        -0.012164541520178318,
        0.006847510579973459,
        0.036287445574998856,
        0.0384443923830986,
        -0.01684321090579033,
        -0.001640508184209466,
        -0.015130341984331608,
        -0.029245650395751,
        -0.027818260714411736,
        -0.015344451181590557,
        -0.01947595365345478,
        -0.020570287480950356,
        -0.03727075830101967,
        0.0016821403987705708,
        0.02199767716228962,
        -0.0001204980508191511,
        -0.02156946063041687,
        -0.013076485134661198,
        -0.03194183483719826,
        0.013940850272774696,
        -0.038476113229990005,
        -0.01620088517665863,
        -0.00973797682672739,
        -0.0602358914911747,
        -0.002428546780720353,
        0.023853285238146782,
        0.0515446662902832,
        0.0055707888677716255,
        0.00838195625692606,
        -0.03311546519398689,
        -0.022156277671456337,
        -0.03955458477139473,
        -0.014376997016370296,
        -0.006530312821269035,
        -0.012410369701683521,
        -0.040030382573604584,
        0.0017118776449933648,
        0.024741441011428833,
        -0.028246477246284485,
        -0.0022580528166145086,
        0.0034415978007018566,
        -0.005007762461900711,
        0.011458775959908962,
        -0.014654545113444328,
        -0.00804096832871437,
        0.02025309018790722,
        0.019713852554559708,
        -0.027881700545549393,
        0.015923338010907173,
        -0.016113655641674995,
        -0.03141845762729645,
        0.005225836299359798,
        0.04967319965362549,
        -0.004131503403186798,
        -0.0039729042910039425,
        0.023726407438516617,
        -0.015479260124266148,
        0.0002007268340094015,
        0.012584828771650791,
        0.022314876317977905,
        -0.013734671287238598,
        0.018920857459306717,
        0.006391538772732019,
        -0.004072028677910566,
        0.015376171097159386,
        0.004928463138639927,
        0.003810340305790305,
        -0.053479574620723724,
        -0.001953741069883108,
        -0.00471831951290369,
        -0.01720798946917057,
        -0.0038876573089510202,
        -0.004202872980386019,
        0.013679161667823792,
        -0.00035213929368183017,
        -0.032956868410110474,
        -0.007041794713586569,
        0.015574419870972633,
        -0.012204191647469997,
        -0.02540755644440651,
        -0.01068957056850195,
        -0.013964639976620674,
        0.010182054713368416,
        0.009825206361711025,
        -0.01939665526151657,
        -0.007430362049490213,
        -0.024408383294939995,
        -0.029705587774515152,
        0.006284484639763832,
        0.009048071689903736,
        0.011601515114307404,
        -0.017271429300308228,
        -0.013496773317456245,
        -0.008199566975235939,
        0.016874931752681732,
        -0.006486698053777218,
        -0.01326680462807417,
        1.3350811968848575e-05,
        0.013322314247488976,
        -0.03508209437131882,
        0.030768200755119324,
        0.006478768307715654,
        0.005685773212462664,
        -0.025455135852098465,
        -0.03860298916697502,
        0.01340161357074976,
        -0.01633569411933422,
        0.0015205676900222898,
        -0.020379967987537384,
        -0.014868654310703278,
        -0.030720621347427368,
        0.015534769743680954,
        0.011546005494892597,
        -0.019935891032218933,
        0.0021192787680774927,
        0.019190475344657898,
        -0.009135301224887371,
        0.016137445345520973,
        0.009349409490823746,
        -0.017398307099938393,
        -0.027913419529795647,
        -0.004214767832309008,
        -0.012109031900763512,
        -0.025026919320225716,
        0.009317689575254917,
        -0.024043604731559753,
        -0.027374183759093285,
        0.05528760328888893,
        0.0077594551257789135,
        0.03160877525806427,
        -0.0038638676051050425,
        -0.0014977690298110247,
        -0.041774969547986984,
        0.019793152809143066,
        -0.004571615718305111,
        -0.0006770193576812744,
        -0.0031085398513823748,
        0.016137445345520973,
        -0.010729220695793629,
        -0.02253691479563713,
        -0.04244108498096466,
        -0.0035288273356854916,
        0.013599862344563007,
        -0.0030609602108597755,
        0.02306029200553894,
        0.005626298487186432,
        0.028706414625048637,
        0.017525186762213707,
        0.0021172964479774237,
        0.0035823544021695852,
        0.013425403274595737,
        -0.001958697335794568,
        -0.01540789008140564,
        0.009983805939555168,
        0.00787840411067009,
        -0.012981326319277287,
        -0.01183941401541233,
        0.00789822917431593,
        -0.0002423590631224215,
        0.010245493613183498,
        -0.00942870881408453,
        -0.0029558883979916573,
        -0.008960842154920101,
        -0.010792660526931286,
        0.02114124409854412,
        0.001660333015024662,
        0.002380967140197754,
        0.007374852430075407,
        0.01747760735452175,
        -0.008120267651975155,
        -0.016890790313482285,
        -0.020490987226366997,
        0.015915406867861748,
        -0.02323474921286106,
        0.004381296690553427,
        -0.0009823223808780313,
        0.008255076594650745,
        0.008849822916090488,
        -0.0032691212836652994,
        -0.020237229764461517,
        0.006669086869806051,
        -0.010007595643401146,
        0.0366998016834259,
        0.013195434585213661,
        0.006669086869806051,
        0.01528894156217575,
        0.04263140633702278,
        -0.014567315578460693,
        -0.007929949089884758,
        0.0068594058975577354,
        -0.04818236827850342,
        0.007902193814516068,
        -0.006542207673192024,
        -0.010546832345426083,
        0.010372373275458813,
        0.004916568286716938,
        0.00847711507230997,
        -0.00834230612963438,
        -0.00676424615085125,
        0.020570287480950356,
        0.016906650736927986,
        0.022140417248010635,
        -0.005487524438649416,
        -0.0026386904064565897,
        -0.0044011217541992664,
        0.007604821119457483,
        -0.009111511521041393,
        0.006419293582439423,
        0.023694686591625214,
        -0.009833136573433876,
        -0.005725422874093056,
        0.0026882525999099016,
        0.01183941401541233,
        0.010768870823085308,
        -0.020570287480950356,
        -0.006994214840233326,
        -0.0017564836889505386,
        -0.021775638684630394,
        0.01122087799012661,
        0.0006368739996105433,
        -0.009389059618115425,
        -0.011942503042519093,
        -0.00820749718695879,
        0.025788193568587303,
        0.028611255809664726,
        0.015915406867861748,
        0.005059307441115379,
        0.004377331584692001,
        -0.009936225600540638,
        0.022552775219082832,
        -0.01842920109629631,
        0.018984297290444374,
        -0.0002055591467069462,
        0.022156277671456337,
        -0.009048071689903736,
        0.008810172788798809,
        -0.014710054732859135,
        -0.013560212217271328,
        0.007664295379072428,
        0.02478902041912079,
        0.02366296760737896,
        0.015122412703931332,
        -0.002273912774398923,
        -0.02453526109457016,
        -0.008588134311139584,
        0.013623652048408985,
        -0.0008058810490183532,
        -0.020808186382055283,
        0.009238390251994133,
        0.007707910146564245,
        -0.02794514037668705,
        0.0015314713818952441,
        0.006280519533902407,
        0.020046910271048546,
        -0.032100431621074677,
        0.01747760735452175,
        0.002250123070552945,
        0.014432506635785103,
        -0.009278040379285812,
        -0.010982979089021683,
        -0.017160410061478615,
        0.029324950650334358,
        0.031497757881879807,
        -0.005261520855128765,
        -0.011252596974372864,
        -0.018476780503988266,
        0.004987937863916159,
        -0.011863203719258308,
        0.013298524543642998,
        0.011403266340494156,
        -0.01972971297800541,
        -0.007362957578152418,
        0.015392030589282513,
        -0.017683785408735275,
        0.028928453102707863,
        -0.003711216151714325,
        -0.017620345577597618,
        -0.012045592069625854,
        0.017271429300308228,
        -0.03451113775372505,
        0.0026684277690947056,
        0.0023076150100678205,
        0.016042286530137062,
        -0.016811491921544075,
        -0.015962986275553703,
        0.004607300274074078,
        -0.013322314247488976,
        0.02792927995324135,
        0.010578551329672337,
        -0.013782250694930553,
        -0.01631983555853367,
        -0.005543034058064222,
        0.03308374807238579,
        -0.0063399942591786385,
        0.03394018113613129,
        -0.0007340158917941153,
        -0.008611924014985561,
        -0.007739630062133074,
        -0.003558564465492964,
        -0.008492975495755672,
        -0.029372530058026314,
        -0.005558894015848637,
        -0.009975875727832317,
        0.020189650356769562,
        0.011680814437568188,
        0.0013153802137821913,
        -0.0034951248671859503,
        -0.023472648113965988,
        0.010102754458785057,
        -0.026676347479224205,
        0.01226763054728508,
        0.000852469471283257,
        -0.02612125128507614,
        -0.034701455384492874,
        -0.028785714879631996,
        0.021601181477308273,
        0.03806375339627266,
        -0.02819889783859253,
        -0.019888311624526978,
        0.0029915731865912676,
        -0.004301997367292643,
        0.023853285238146782,
        -0.00039996678242459893,
        -0.008017178624868393,
        0.0059474618174135685,
        0.015764737501740456,
        0.017049390822649002,
        0.010594411753118038,
        0.016288114711642265,
        -0.013472982682287693,
        -0.025819912552833557,
        -0.003849990200251341,
        -0.001928960089571774,
        -0.022838251665234566,
        0.010626131668686867,
        0.011236737482249737,
        -0.0007369896047748625,
        0.03473317623138428,
        0.00790615938603878,
        -0.021807359531521797,
        -0.00766033073887229,
        0.012759287841618061,
        -0.01039616297930479,
        0.0213950015604496,
        -0.01340954378247261,
        0.019364934414625168,
        -0.005313065834343433,
        -3.009353531524539e-05,
        -0.005257556214928627,
        0.013758460991084576,
        -0.0056778434664011,
        0.013385753147304058,
        0.010205844417214394,
        -0.009325619786977768,
        -0.013465053401887417,
        0.02532825618982315,
        0.008810172788798809,
        -0.006042621098458767,
        -0.0044050863943994045,
        0.007117128930985928,
        0.00519411638379097,
        -0.008310586214065552,
        0.029055332764983177,
        0.007743595167994499,
        -0.01130810659378767,
        -0.0213950015604496,
        0.00816784705966711,
        0.008025107905268669,
        -0.0055549293756484985,
        0.017509326338768005,
        0.01480521447956562,
        -0.024329083040356636,
        -0.00014794310845900327,
        0.011411196552217007,
        -0.021617040038108826,
        -0.015621999278664589,
        0.014710054732859135,
        -0.014305627904832363,
        0.024773159995675087,
        -0.0031402597669512033,
        -0.028531955555081367,
        -0.004524035844951868,
        -0.03571648895740509,
        0.007696015294641256,
        -0.006776141468435526,
        -0.015384100377559662,
        -0.0043654367327690125,
        -0.0035803718492388725,
        0.008199566975235939,
        0.03387674316763878,
        0.0032651564106345177,
        -0.029895907267928123,
        -0.016177095472812653,
        -0.01842920109629631,
        0.004761934280395508,
        -0.013417473062872887,
        -0.022663794457912445,
        -0.015090692788362503,
        -0.0031680145766586065,
        0.018127862364053726,
        -0.0006566988886334002,
        0.01183148380368948,
        0.003723111003637314,
        0.0026327429804950953,
        -0.004115643445402384,
        -0.02236245572566986,
        0.0021133313421159983,
        0.0008797287009656429,
        -0.006157605443149805,
        -0.00323145417496562,
        -0.0261846911162138,
        -0.0051386067643761635,
        0.044502872973680496,
        -0.03160877525806427,
        0.0071131642907857895,
        -0.02532825618982315,
        0.00637171370908618,
        -0.006046585738658905,
        0.017778946086764336,
        -0.01720798946917057,
        0.013568142428994179,
        -0.03222731128334999,
        0.028769854456186295,
        0.004857093561440706,
        -0.02767552062869072,
        0.012243840843439102,
        0.014567315578460693,
        0.03346438333392143,
        0.006934740114957094,
        -0.0009961997857317328,
        0.010634060949087143,
        -0.027786539867520332,
        0.007136953994631767,
        0.027818260714411736,
        0.01869881898164749,
        -0.0205227080732584,
        0.010467532090842724,
        0.04148949310183525,
        0.003693373640999198,
        0.029848327860236168,
        0.010023455135524273,
        0.013829831033945084,
        -0.011427056044340134,
        0.005447874777019024,
        -0.007386747281998396,
        -0.007394677493721247,
        -0.01972971297800541,
        -0.01099883858114481,
        -0.03457457572221756,
        0.020284809172153473,
        -0.03179909288883209,
        -0.010316863656044006,
        0.010269283317029476,
        0.001685114111751318,
        -0.0007166691357269883,
        -0.026057811453938484,
        0.008572274819016457,
        -0.01754104718565941,
        -0.018112003803253174,
        0.0037151810247451067,
        -0.022061116993427277,
        0.015368240885436535,
        0.006367749068886042,
        0.015558559447526932,
        -0.04053789749741554,
        -0.024566981941461563,
        -0.024519402533769608,
        -0.01903187669813633,
        0.0009114485001191497,
        0.0024523367173969746,
        -0.018667099997401237,
        0.003931272309273481,
        -0.0062527647241950035,
        0.005975216627120972,
        -0.004119608551263809,
        -0.0024622490163892508,
        -0.03257622942328453,
        0.013909130357205868,
        0.012235910631716251,
        -0.01431355718523264,
        -0.02122054249048233,
        0.00438922643661499,
        -0.025693034753203392,
        -0.006022796034812927,
        0.005388400051742792,
        -0.0004116139025427401,
        0.03091094084084034,
        0.005757142789661884,
        0.00022550791618414223,
        0.0063399942591786385,
        -0.0065937526524066925,
        -0.010895749554038048,
        -0.01858779974281788,
        0.008905332535505295,
        0.021061943843960762,
        0.03416221961379051,
        -0.0023651071824133396,
        -0.012124891392886639,
        0.01493209321051836,
        0.013211295008659363,
        0.029245650395751,
        -0.018556080758571625,
        0.006149675231426954,
        0.007501731626689434,
        0.003358333371579647,
        -0.0034990899730473757,
        -0.0061655351892113686,
        -0.012037661857903004,
        -0.022378316149115562,
        -0.019095316529273987,
        0.014955883845686913,
        -0.010982979089021683,
        0.014868654310703278,
        -0.006657192017883062,
        -0.03904706612229347,
        0.00995208602398634,
        -0.00011640917364275083,
        0.0002988599590025842,
        -0.0034415978007018566,
        -0.003964974544942379,
        0.023821566253900528,
        -0.002646620385348797,
        0.0033484208397567272,
        0.006383609026670456,
        0.012085242196917534,
        0.01566164940595627,
        -0.0014382944209501147,
        0.006427223328500986,
        0.003653723979368806,
        -0.004765899386256933,
        0.014099448919296265,
        0.0025118112098425627,
        0.0009986779186874628,
        -0.004682634957134724,
        -0.008255076594650745,
        0.002293737605214119,
        -0.02829405665397644,
        -0.008588134311139584,
        0.03682668134570122,
        -0.020982645452022552,
        -0.019872451201081276,
        -0.01999933086335659,
        0.013996359892189503,
        0.012973396107554436,
        0.007588961161673069,
        0.017160410061478615,
        -0.019269775599241257,
        0.011918713338673115,
        0.024170484393835068,
        -0.014131168834865093,
        -0.010356512852013111,
        -0.006827685981988907,
        0.0033464382868260145,
        -0.007315377704799175,
        -0.0205068476498127,
        0.004726249724626541,
        0.020855765789747238,
        0.021093664690852165,
        -0.014392857439815998,
        -0.0018149670213460922,
        0.013782250694930553,
        -0.015003463253378868,
        0.0015542699256911874,
        0.004734179470688105,
        0.006185360252857208,
        0.004710389766842127,
        0.01860366016626358,
        0.010475462302565575,
        -0.008722943253815174,
        -0.014892444014549255,
        0.012973396107554436,
        -0.010316863656044006,
        -0.017445886507630348,
        0.026755647733807564,
        -0.0035308096557855606,
        0.018191302195191383,
        0.020189650356769562,
        0.00900049228221178,
        0.018841559067368507,
        0.010626131668686867,
        -0.006530312821269035,
        0.018809838220477104,
        0.011165368370711803,
        -0.015035183168947697,
        -0.02172805927693844,
        -0.016018496826291084,
        -0.013036835938692093,
        0.011316036805510521,
        -0.0062250099144876,
        0.003917394671589136,
        0.022394174709916115,
        -0.013552282936871052,
        -0.02172805927693844,
        0.0037369884084910154,
        0.001185527304187417,
        -0.0009322646073997021,
        -0.007870473898947239,
        0.006486698053777218,
        0.004730214364826679,
        -0.014099448919296265,
        -0.016303975135087967,
        0.008556414395570755,
        -0.007624645717442036,
        0.00346935261040926,
        -0.003705268492922187,
        0.006522383075207472,
        0.00011541792628122494,
        -0.008715013973414898,
        0.01763620600104332,
        -0.019840732216835022,
        0.00019515107851475477,
        0.030879219993948936,
        0.037334199994802475,
        0.005206011235713959,
        0.006752351298928261,
        0.008255076594650745,
        0.005539069417864084,
        0.027215585112571716,
        0.006248799618333578,
        -0.008611924014985561,
        0.006807860918343067,
        -0.007933913730084896,
        -0.00294795841909945,
        -0.025217236950993538,
        -0.0008286796510219574,
        -0.0031561197247356176,
        -0.017414167523384094,
        -0.007355027366429567,
        -0.002418634481728077,
        0.0009258215432055295,
        0.016010567545890808,
        -0.005776967853307724,
        0.027104565873742104,
        -0.005063272546976805,
        0.014043939299881458,
        -0.016811491921544075,
        0.012648268602788448,
        -0.013377823866903782,
        -0.017921684309840202,
        -0.01257689855992794,
        -0.006022796034812927,
        -0.008833963423967361,
        0.01972971297800541,
        0.023203030228614807,
        -0.009571447968482971,
        0.003681478789076209,
        -0.006264659576117992,
        0.017778946086764336,
        -0.0183340422809124,
        0.01558234915137291,
        -0.006550137884914875,
        -0.004853128455579281,
        0.016890790313482285,
        -0.0028944313526153564,
        0.030974380671977997,
        0.012013872154057026,
        -0.0064311884343624115,
        -0.005451839882880449,
        0.0240118857473135,
        -0.00028696501976810396,
        0.008588134311139584,
        -0.017874104902148247,
        -0.014710054732859135,
        0.0033841056283563375,
        0.00450024614110589,
        0.007370887324213982,
        0.014892444014549255,
        -0.010982979089021683,
        0.009848996065557003,
        0.015740947797894478,
        0.022917551919817924,
        -0.005400295369327068,
        -0.01515413261950016,
        0.01625639572739601,
        -0.01214075181633234,
        -0.013679161667823792,
        -0.004222697578370571,
        0.01868295855820179,
        0.026501888409256935,
        0.004575580358505249,
        0.00471831951290369,
        -0.009563518688082695,
        -0.0009813312208279967,
        -0.009706256911158562,
        0.016779771074652672,
        0.010808520019054413,
        -0.010982979089021683,
        -0.005384435411542654,
        -0.011363616213202477,
        -0.0080726882442832,
        -0.0007320333970710635,
        0.0017683785408735275,
        -0.004397156648337841,
        0.011641165241599083,
        0.012156611308455467,
        -0.01693837158381939,
        -0.012426230125129223,
        -0.00851676519960165,
        0.026216410100460052,
        -0.00018226492102257907,
        0.0015612086281180382,
        0.015138272196054459,
        -0.014162888750433922,
        0.011847343295812607,
        -0.001200395985506475,
        -0.00834230612963438,
        -0.0002043200802290812,
        -0.0027457447722554207,
        -0.017223848029971123,
        -0.006879230495542288,
        0.022996852174401283,
        -0.007065584417432547,
        -0.00833437591791153,
        0.021188823506236076,
        0.027358323335647583,
        -0.016652893275022507,
        -0.00030282491934485734,
        -0.009936225600540638,
        0.0034316852688789368,
        -0.023266470059752464,
        0.0067364913411438465,
        0.0042623477056622505,
        -0.034701455384492874,
        0.022410035133361816,
        0.01367123145610094,
        0.001155790057964623,
        -0.0011865185806527734,
        0.011577725410461426,
        -0.002985625760629773,
        -0.001906161429360509,
        -0.005884021986275911,
        -0.011022629216313362,
        -0.011553935706615448,
        -0.0257723331451416,
        -0.014162888750433922,
        -0.013655371963977814,
        0.007604821119457483,
        -0.0048333038575947285,
        -0.005221871193498373,
        0.007600856013596058,
        0.022299015894532204,
        0.02699354663491249,
        -0.011149507947266102,
        -0.003419790416955948,
        -0.013155785389244556,
        -0.02061786688864231,
        -0.017081109806895256,
        -0.011990082450211048,
        -0.0017842384986579418,
        0.012204191647469997,
        -0.0022461579646915197,
        0.021283982321619987,
        0.002077646553516388,
        0.019190475344657898,
        0.018318181857466698,
        -0.028262337669730186,
        -0.007323307916522026,
        -0.007299517747014761,
        -0.015201712027192116,
        -0.003986781928688288,
        0.010229634121060371,
        0.016526013612747192,
        0.029055332764983177,
        -0.01782652549445629,
        -0.017588626593351364,
        0.004337681923061609,
        0.007279693149030209,
        -0.0213791411370039,
        0.02915049158036709,
        0.009024281986057758,
        0.0018308269791305065,
        0.0020498917438089848,
        0.0031581020448356867,
        -0.029102912172675133,
        0.006847510579973459,
        0.0045676506124436855,
        0.018730539828538895,
        0.020808186382055283,
        0.006161570083349943,
        0.007747559808194637,
        -0.00709333922713995,
        -0.012164541520178318,
        0.0008058810490183532,
        -0.006573927588760853,
        -0.00434561213478446,
        -0.006839580833911896,
        0.0046191951259970665,
        0.017953403294086456,
        0.016383273527026176,
        -0.005935566499829292,
        0.01153014600276947,
        0.014345277100801468,
        -0.004603335168212652,
        -0.008873612619936466,
        -0.01581231877207756,
        0.006363783963024616,
        -0.02532825618982315,
        -0.009309760294854641,
        -0.03600196912884712,
        -0.00046489323722198606,
        -0.009841066785156727,
        -0.024503542110323906,
        -0.0035308096557855606,
        0.02321889065206051,
        -0.021965958178043365,
        0.01230728067457676,
        0.005535104312002659,
        -0.03501865267753601,
        -0.011141577735543251,
        -0.0036913910880684853,
        -0.014115309342741966,
        -0.008112337440252304,
        0.0022402105387300253,
        0.01230728067457676,
        -0.02786584012210369,
        0.00851676519960165,
        -0.0021807358134537935,
        -0.00977762695401907,
        -0.013005116023123264,
        -0.009214600548148155,
        -8.921192056732252e-05,
        0.0006071366951800883,
        -0.039332546293735504,
        -0.020379967987537384,
        0.007121094036847353,
        -0.011284316889941692,
        -0.017509326338768005,
        0.00757706630975008,
        -0.0025712859351187944,
        -0.0003248800931032747,
        0.016216745600104332,
        -0.009983805939555168,
        0.002977695781737566,
        0.018793977797031403,
        0.009563518688082695,
        -0.0027774646878242493,
        0.005515279248356819,
        -0.019174616783857346,
        0.00788633432239294,
        -0.007727735210210085,
        0.016874931752681732,
        0.008802243508398533,
        0.002428546780720353,
        0.008461255580186844,
        0.0011785886017605662,
        -0.00473814457654953,
        -0.012037661857903004,
        -0.028579534962773323,
        0.0022184031549841166,
        -0.01641499437391758,
        -0.0023670897353440523,
        -0.01056269183754921,
        0.016351554542779922,
        0.0002629273512866348,
        -0.014963813126087189,
        0.0055311392061412334,
        -0.018302321434020996,
        -0.009880715981125832,
        0.03129157796502113,
        -0.019253915175795555,
        0.022489335387945175,
        -3.218444180674851e-05,
        -0.005098957102745771,
        -0.011704604141414165,
        -0.01257689855992794,
        0.007279693149030209,
        0.022758953273296356,
        0.007902193814516068,
        -0.009698327630758286,
        0.023107871413230896,
        -0.005594579037278891,
        -0.011260527186095715,
        -0.002898396225646138,
        -0.011268457397818565,
        0.02550271525979042,
        0.008849822916090488,
        0.004194942768663168,
        0.002359159756451845,
        -0.018460920080542564,
        -0.0018258707132190466,
        0.008374026045203209,
        0.009698327630758286,
        0.0045280009508132935,
        -0.010158264078199863,
        0.011276387609541416,
        0.007481906563043594,
        -0.0032592089846730232,
        0.005919707007706165,
        -0.0039748866111040115,
        -0.00374293583445251,
        -0.01602642610669136,
        -0.012053522281348705,
        -0.013139924965798855,
        0.011498426087200642,
        0.00357838929630816,
        0.001704938942566514,
        -0.01711282879114151,
        -0.007529486436396837,
        0.006149675231426954,
        0.006819755770266056,
        -0.0023333874996751547,
        0.000715677859261632,
        0.027390042319893837,
        -0.015019322745501995,
        -0.011990082450211048,
        -0.0030312228482216597,
        -0.0071131642907857895,
        0.0028290092013776302,
        -0.021268121898174286,
        0.0057095629163086414,
        -0.007374852430075407,
        0.025344116613268852,
        0.0200944896787405,
        -0.007977528497576714,
        0.0008717987220734358,
        -0.014638685621321201,
        -0.012870307080447674,
        -0.009833136573433876,
        -0.007584996055811644,
        0.014765564352273941,
        -0.016399133950471878,
        0.004900708328932524,
        -0.004075993783771992,
        -0.00044333370169624686,
        0.008159917779266834,
        0.011442916467785835,
        -0.021410861983895302,
        0.004575580358505249,
        0.011902852915227413,
        0.0010398145532235503,
        -0.0117918336763978,
        0.014036009088158607,
        0.029451830312609673,
        -0.0031303472351282835,
        0.000966958119533956,
        0.002811166923493147,
        0.01747760735452175,
        -0.007949773222208023,
        -0.003586319275200367,
        0.0066096121445298195,
        0.0021529810037463903,
        -0.010277213528752327,
        0.012259701266884804,
        -0.015915406867861748,
        0.00489277858287096,
        0.012243840843439102,
        -0.018270602449774742,
        -0.007569136098027229,
        0.02149016037583351,
        0.002567320829257369,
        0.0009094660053960979,
        0.0069902497343719006,
        -0.021442580968141556,
        -0.02044340781867504,
        -0.015376171097159386,
        0.013036835938692093,
        -0.018286462873220444,
        -0.01711282879114151,
        0.007370887324213982,
        -0.020824044942855835,
        -0.035335853695869446,
        0.016716331243515015,
        0.002539566019549966,
        -0.009357339702546597,
        0.00834230612963438,
        0.006641332060098648,
        0.02226729691028595,
        0.025978513062000275,
        -0.025280676782131195,
        0.005927636753767729,
        0.01852435991168022,
        0.02199767716228962,
        0.00393325462937355,
        0.019364934414625168,
        -0.018397482112050056,
        -0.00757706630975008,
        -0.008389885537326336,
        0.011577725410461426,
        0.005118782166391611,
        -0.004876918625086546,
        -0.008619854226708412,
        0.0036755313631147146,
        -0.008175777271389961,
        -0.03181495517492294,
        -0.022758953273296356,
        -0.014947953633964062,
        0.001973565900698304,
        0.013250944204628468,
        -0.006320169195532799,
        -0.0024543192703276873,
        0.022663794457912445,
        -0.006145710125565529,
        -0.021157102659344673,
        -0.0056937034241855145,
        -0.007771349977701902,
        -0.003407895565032959,
        -0.0018298357026651502,
        -0.010427882894873619,
        0.004298032261431217,
        0.00583247747272253,
        0.0022283156868070364,
        0.00652634771540761,
        -0.010055175051093102,
        0.017874104902148247,
        -0.01226763054728508,
        0.008469185791909695,
        0.013147855177521706,
        -0.010721290484070778,
        0.006922845263034105,
        0.007473976816982031,
        0.018460920080542564,
        0.006752351298928261,
        0.015883687883615494,
        0.004631089977920055,
        0.00726779829710722,
        0.02164876088500023,
        -0.004880883265286684,
        0.021204683929681778,
        0.023250609636306763,
        0.00683561572805047,
        -0.00019217735098209232,
        -0.004579545464366674,
        0.008675363846123219,
        0.005094991996884346,
        -0.002001320943236351,
        -0.018714679405093193,
        0.03267138823866844,
        0.021283982321619987,
        0.02383742667734623,
        -0.0017237726133316755,
        0.01479728426784277,
        -0.009135301224887371,
        -0.02261621318757534,
        0.022806532680988312,
        -0.0012182383798062801,
        -0.002535601146519184,
        0.0002631751704029739,
        -0.011886993423104286,
        -0.0027774646878242493,
        -0.004270277451723814,
        0.0035189148038625717,
        -0.0033860881812870502,
        0.022378316149115562,
        -0.03273482993245125,
        0.00279332441277802,
        0.0015740948729217052,
        0.01746174693107605,
        -0.0022402105387300253,
        0.01974557340145111,
        0.0152810113504529,
        0.007259868085384369,
        0.018540220335125923,
        -0.004896743223071098,
        0.0009079791489057243,
        -0.013734671287238598,
        0.017065249383449554,
        0.005701633170247078,
        0.007771349977701902,
        -0.0032096467912197113,
        0.01497174333781004,
        0.001409548451192677,
        0.0008688250090926886,
        -0.005067237187176943,
        -0.006784071214497089,
        -0.013346103951334953,
        0.0015354363713413477,
        0.0035149496980011463,
        -0.0025633559562265873,
        0.002813149243593216,
        0.0043138922192156315,
        -0.0024642315693199635,
        0.021601181477308273,
        -0.002450354164466262,
        0.013766391202807426,
        0.009563518688082695,
        -0.014265977777540684,
        -0.0016187008004635572,
        0.021252263337373734,
        0.00816784705966711,
        0.003142242319881916,
        -0.002499916357919574,
        0.009396988898515701,
        0.007446222007274628,
        -0.023203030228614807,
        -0.00471831951290369,
        -0.02672392688691616,
        0.017604487016797066,
        -0.022124556824564934,
        0.02312372997403145,
        0.03660464286804199,
        -0.011998012661933899,
        0.006415328476577997,
        0.013433333486318588,
        -0.011038488708436489,
        0.009769696742296219,
        -0.012299350462853909,
        0.00885775312781334,
        -0.01693837158381939,
        0.002095489064231515,
        -0.00244638929143548,
        -0.00615364033728838,
        -0.017921684309840202,
        0.0031600845977663994,
        0.00011300176993245259,
        -0.01449594646692276,
        0.00251974118873477,
        -0.0009565500658936799,
        0.01825474202632904,
        0.0033186834771186113,
        0.016462573781609535,
        0.0030451002530753613,
        0.013219224289059639,
        0.001464066794142127,
        -0.0036794962361454964,
        -0.0020191632211208344,
        -0.013663302175700665,
        0.010729220695793629,
        0.0183340422809124,
        0.00035461739753372967,
        -0.0057095629163086414,
        0.02147430181503296,
        -0.01980901136994362,
        0.013488843105733395,
        0.010316863656044006,
        0.010237564332783222,
        0.009928296320140362,
        0.014162888750433922,
        0.01624053530395031,
        0.0016989915166050196,
        0.0002505368320271373,
        0.013504702597856522,
        -0.0009456463740207255,
        -0.015859898179769516,
        -0.003516932250931859,
        -0.0016395169077441096,
        0.007751524914056063,
        -0.014392857439815998,
        0.012608618475496769,
        0.006879230495542288,
        0.0024424241855740547,
        -0.0020092506892979145,
        0.013591932132840157,
        -0.018318181857466698,
        0.0021311738528311253,
        0.015867827460169792,
        0.010007595643401146,
        -0.008588134311139584,
        0.010887819342315197,
        -0.02129984274506569,
        0.01728728786110878,
        -0.02420220337808132,
        0.010530971921980381,
        0.0042782071977853775,
        -0.018841559067368507,
        -0.0014085571747273207,
        -0.0047817593440413475,
        -0.016478434205055237,
        -0.0007939861388877034,
        -0.0006794974906370044,
        0.00023653550306335092,
        0.007549311500042677,
        0.01257689855992794,
        0.022949272766709328,
        -0.00045374175533652306,
        0.02862711437046528,
        -0.01825474202632904,
        0.005166361574083567,
        -0.019317355006933212,
        0.01210110168904066,
        -0.02513793855905533,
        0.019174616783857346,
        0.009555588476359844,
        -0.010927469469606876,
        -6.622746150242165e-05,
        -0.019158756360411644,
        -0.008921192027628422,
        -0.025804053992033005,
        0.003849990200251341,
        0.012339000590145588,
        -0.028658835217356682,
        0.007029899396002293,
        -0.011212947778403759,
        0.008976701647043228,
        0.009317689575254917,
        -0.0047064246609807014,
        0.022822393104434013,
        -0.0017207989003509283,
        -0.010269283317029476,
        0.0032473141327500343,
        0.004825373645871878,
        -0.00188931031152606,
        0.007069549523293972,
        0.0076325759291648865,
        0.011109858751296997,
        -0.006895090453326702,
        -0.010626131668686867,
        -0.008429535664618015,
        -0.004496281035244465,
        -0.005380470305681229,
        0.023900866508483887,
        0.033559542149305344,
        -0.006688911933451891,
        -0.004650915041565895,
        -0.0055549293756484985,
        0.0157171580940485,
        0.006847510579973459,
        0.015526839531958103,
        -0.010895749554038048,
        0.0005010736640542746,
        0.03286170959472656,
        -0.015859898179769516,
        -0.006803896278142929,
        -0.013734671287238598,
        -0.012902026996016502,
        0.007957703433930874,
        0.006137780379503965,
        0.012957536615431309,
        0.023012710735201836,
        0.017414167523384094,
        0.007965633645653725,
        0.003740953281521797,
        0.014416647143661976,
        0.00847711507230997,
        0.013988429680466652,
        0.0023076150100678205,
        -0.004286137409508228,
        -0.008286796510219574,
        -0.009484218433499336,
        -0.01463075540959835,
        0.01152221579104662,
        -0.01825474202632904,
        -0.002547495998442173,
        0.02478902041912079,
        -0.01754104718565941,
        -0.002323474967852235,
        0.002850816585123539,
        -0.0117918336763978,
        -0.0028250443283468485,
        -0.005991076119244099,
        -0.004321821965277195,
        0.014083589427173138,
        0.0002340573992114514,
        0.014059798792004585,
        0.012902026996016502,
        0.0002515280502848327,
        0.0042266626842319965,
        0.011760113760828972,
        -0.01947595365345478,
        -0.004337681923061609,
        0.017271429300308228,
        0.006272589322179556,
        0.011395336128771305,
        0.010990909300744534,
        -0.0025534434244036674,
        -0.012862376868724823,
        -0.022124556824564934,
        -0.017144549638032913,
        0.0062250099144876,
        -0.017620345577597618,
        0.01577266864478588,
        0.003703286172822118,
        -0.019238056614995003,
        -0.016478434205055237,
        0.0034911599941551685,
        0.014741774648427963,
        -0.03761967644095421,
        -0.010197914205491543,
        0.00045200707972981036,
        -0.029832467436790466,
        0.009103581309318542,
        -0.006942670326679945,
        -0.01414702832698822,
        0.015011393465101719,
        -0.03790515661239624,
        -0.008730873465538025,
        0.0020816116593778133,
        -0.0071647088043391705,
        0.00788633432239294,
        -0.02312372997403145,
        0.006966460030525923,
        -0.00882603321224451,
        -0.004599370528012514,
        -0.00011300176993245259,
        0.012489669024944305,
        -0.008429535664618015,
        0.0023532123304903507,
        -0.0009491157252341509,
        -0.00036799919325858355,
        0.005150501616299152,
        0.002028084360063076,
        0.00026441423688083887,
        0.008302656002342701,
        -0.0015344450948759913,
        0.011760113760828972,
        0.008286796510219574,
        -0.006054515950381756,
        -1.1740041372831911e-05,
        -0.01453559659421444,
        0.024297364056110382,
        0.014202537946403027,
        -0.0029519235249608755,
        -0.018476780503988266,
        0.0018982314504683018,
        -0.005114817060530186,
        -0.0018407393945381045,
        0.01148256566375494,
        -0.007743595167994499,
        0.008302656002342701,
        -0.0021866834722459316,
        0.000820254092104733,
        -0.019713852554559708,
        -0.0066849468275904655,
        -0.007929949089884758,
        -0.01754104718565941,
        0.000849991396535188,
        -0.0010150334564968944,
        0.005186186637729406,
        -0.00029390372219495475,
        0.0061258855275809765,
        0.003235419047996402,
        -0.003919376991689205,
        0.008556414395570755,
        -0.010039315558969975,
        -0.005166361574083567,
        -0.020903345197439194,
        -0.012537249363958836,
        -0.003467370057478547,
        -0.017001809552311897,
        -0.002654550364241004,
        0.007339167408645153,
        -0.009071861393749714,
        0.0045835105702281,
        0.008580205030739307,
        -0.02348850853741169,
        0.007965633645653725,
        0.013924989849328995,
        -0.04120401293039322,
        -0.02716800384223461,
        0.015828177332878113,
        0.0025514611043035984,
        0.012989256531000137,
        -0.011918713338673115,
        0.001958697335794568,
        -0.00014447375724557787,
        -0.011601515114307404,
        -0.0014601018046960235,
        -0.01322715450078249,
        4.959315629093908e-05,
        -0.039681464433670044,
        -0.023425068706274033,
        0.015621999278664589,
        -0.021014364436268806,
        -0.014955883845686913,
        0.01275135762989521,
        -0.010753010399639606,
        0.022584494203329086,
        0.012505529448390007,
        -0.014099448919296265,
        0.007541381288319826,
        -0.0026287781074643135,
        -0.00895291194319725,
        -0.013203364796936512,
        0.01755690574645996,
        -0.007771349977701902,
        0.004139433149248362,
        0.010301003232598305,
        -0.020633727312088013,
        0.01122087799012661,
        0.018016843125224113,
        -0.01903187669813633,
        0.015701299533247948,
        -0.005689738318324089,
        -0.013124065473675728,
        0.00046960165491327643,
        -0.006795966066420078,
        0.02166461944580078,
        0.009381129406392574,
        -0.002154963556677103,
        -0.0053527154959738255,
        0.0019378812285140157,
        -0.00882603321224451,
        -0.011442916467785835,
        -0.02112538367509842,
        0.02593093179166317,
        -0.00851676519960165,
        -0.018223023042082787,
        -0.02122054249048233,
        0.030958520248532295,
        0.0028349566273391247,
        0.028246477246284485,
        -0.03176737576723099,
        0.0017882034881040454,
        -0.013552282936871052,
        0.0053408206440508366,
        -0.002940028440207243,
        0.006867335643619299,
        -0.002232280559837818,
        -0.005031552631407976,
        -0.006946634966880083,
        -0.027453482151031494,
        0.02699354663491249,
        0.023710547015070915,
        0.013488843105733395,
        0.0007241034763865173,
        0.01515413261950016,
        -0.015296870842576027,
        0.015066903084516525,
        0.007358992472290993,
        0.014408716931939125,
        0.015447540208697319,
        -0.025788193568587303,
        0.018889138475060463,
        0.008889473043382168,
        0.010340653359889984,
        0.006205184850841761,
        0.010197914205491543,
        -0.00838195625692606,
        0.014813144691288471,
        -0.009960015304386616,
        0.010134474374353886,
        0.0008569300989620388,
        0.027469342574477196,
        -0.0106975007802248,
        0.006181395146995783,
        -0.01616123504936695,
        -0.023520227521657944,
        -0.013932920061051846,
        -0.0020677342545241117,
        -0.02742176316678524,
        -0.005626298487186432,
        0.00083512271521613,
        -0.0068990555591881275,
        0.012561039067804813,
        -0.01449594646692276,
        0.013861550949513912,
        -0.015431680716574192,
        -0.028706414625048637,
        0.01720798946917057,
        -0.00864364393055439,
        -0.023520227521657944,
        0.0035565821453928947,
        -0.02131570316851139,
        -0.0034237552899867296,
        -0.005158431828022003,
        -0.0064668734557926655,
        -0.0023532123304903507,
        -0.017683785408735275,
        0.004194942768663168,
        0.012473809532821178,
        0.01524136122316122,
        -0.0038143054116517305,
        0.004484386183321476,
        0.028167178854346275,
        -0.019095316529273987,
        -0.009032211266458035,
        0.001366924960166216,
        0.016002636402845383,
        0.010285143740475178,
        0.007612750865519047,
        0.0044407714158296585,
        -0.0024225993547588587,
        -0.008286796510219574,
        -0.020110350102186203,
        0.006054515950381756,
        0.003685443662106991,
        -0.014392857439815998,
        -0.010951259173452854,
        0.024820739403367043,
        -0.028944313526153564,
        -0.00899256207048893,
        0.010039315558969975,
        0.01676391251385212,
        -0.007803069427609444,
        0.0008569300989620388,
        0.03546272963285446,
        0.001498760306276381,
        0.009856926277279854,
        0.018889138475060463,
        -0.01730314828455448,
        -0.004845198709517717,
        -0.022933412343263626,
        0.0027992718387395144,
        0.011189158074557781,
        0.010816450230777264,
        -0.0013986447593197227,
        0.007489836774766445,
        0.020744746550917625,
        0.023012710735201836,
        0.01227556075900793,
        0.002097471384331584,
        0.02629571035504341,
        -0.0013094327878206968,
        -6.684698746539652e-05,
        0.02575647458434105,
        -0.02017378993332386,
        -0.015994707122445107,
        0.019444234669208527,
        0.0393008254468441,
        -0.009999665431678295,
        -0.0018228970002382994,
        0.008944982662796974,
        0.003094662446528673,
        -0.00410771369934082,
        0.012013872154057026,
        -0.001053691958077252,
        -0.00543994503095746,
        0.021347422152757645,
        -0.0068237208761274815,
        0.014599035494029522,
        0.001988434698432684,
        -0.0009421770228073001,
        0.018191302195191383,
        0.009936225600540638,
        -0.003390053054317832,
        -0.017255568876862526,
        -0.005808687303215265,
        -0.007212288677692413,
        -0.015130341984331608,
        0.022124556824564934,
        -0.015051042661070824,
        0.0006264659459702671,
        -0.0130923455581069,
        0.002781429560855031,
        0.011149507947266102,
        -0.009135301224887371,
        -0.0021787534933537245,
        0.009151160717010498,
        0.003455475205555558,
        0.004555755760520697,
        -0.02155360020697117,
        0.0013570125447586179,
        -0.010007595643401146,
        -0.004888813477009535,
        -0.00201321579515934,
        0.023789847269654274,
        -0.006248799618333578,
        -0.010071034543216228,
        -0.0010606306605041027,
        0.02036410942673683,
        -0.012878237292170525,
        -0.003655706299468875,
        0.0033761756494641304,
        0.004853128455579281,
        -0.00552320946007967,
        0.0044050863943994045,
        0.005273416172713041,
        -0.0009461420122534037,
        -0.025915073230862617,
        -0.012220051139593124,
        -0.005249626003205776,
        0.02637501060962677,
        0.012283490970730782,
        0.02769138105213642,
        -0.0058245472609996796,
        -0.008310586214065552,
        -0.003808357985690236,
        -0.002351229777559638,
        -0.015376171097159386,
        -0.017525186762213707,
        0.011276387609541416,
        -0.015748878940939903,
        -0.012973396107554436,
        -0.0017158426344394684,
        -0.017001809552311897,
        0.022061116993427277,
        0.015518910251557827,
        0.011379476636648178,
        -0.009309760294854641,
        0.004361471626907587,
        -0.005209976341575384,
        0.014599035494029522,
        0.014480086974799633,
        0.011125718243420124,
        0.002842886606231332,
        -0.021172963082790375,
        -0.004309927113354206,
        0.009761766530573368,
        0.018540220335125923,
        0.02740590274333954,
        -0.0085088349878788,
        -0.022679653018712997,
        -0.006641332060098648,
        -0.006827685981988907,
        4.457498653209768e-05,
        -0.0036794962361454964,
        -0.002712042536586523,
        -0.004377331584692001,
        -0.0008380964864045382,
        0.014123238623142242,
        -0.001160746207460761,
        0.007232113275676966,
        0.013718811795115471,
        0.0053487503901124,
        0.0004963652463629842,
        -0.02761208266019821,
        -0.001906161429360509,
        -0.021363282576203346,
        -0.007188498508185148,
        -0.0022957201581448317,
        0.0003357837558723986,
        0.021204683929681778,
        -0.0009074835106730461,
        -0.017271429300308228,
        0.01903187669813633,
        0.015621999278664589,
        0.0019031877163797617,
        0.015669578686356544,
        0.0017108864849433303,
        0.0021569461096078157,
        0.007902193814516068,
        0.014440436847507954,
        4.197296948404983e-05,
        0.020713025704026222,
        -0.000815297884400934,
        -0.007799104787409306,
        0.015328590758144855,
        -0.014154958538711071,
        0.02147430181503296,
        0.0031065575312823057,
        -0.015399960801005363,
        0.02348850853741169,
        0.0020181720610708,
        0.004040308762341738,
        -0.014416647143661976,
        -0.01711282879114151,
        0.006102095823734999,
        0.008068722672760487,
        -0.0004145876446273178,
        -0.006895090453326702,
        0.00615364033728838,
        -0.009143231436610222,
        -0.015019322745501995,
        -0.00977762695401907,
        0.013512632809579372,
        0.015217571519315243,
        -0.020031049847602844,
        -0.007172638550400734,
        -0.0002604492474347353,
        -0.02567717432975769,
        -0.029198070988059044,
        0.010507182218134403,
        0.0035704595502465963,
        0.016906650736927986,
        0.020855765789747238,
        0.013956709764897823,
        -0.0019775310065597296,
        -0.015550629235804081,
        0.0017009740695357323,
        -0.016985950991511345,
        -0.01248173974454403,
        0.006256729830056429,
        0.022299015894532204,
        0.000802907336037606,
        0.0007429370889440179,
        0.004920533392578363,
        -0.005943496711552143,
        0.012997185811400414,
        -0.0004242522700224072,
        -0.004480421077460051,
        -0.006137780379503965,
        -0.0021291912999004126,
        0.00037122072535566986,
        0.004575580358505249,
        0.0005476620863191783,
        0.015066903084516525,
        0.02593093179166317,
        -0.01695423014461994,
        -0.003800428006798029,
        -0.008572274819016457,
        -0.007117128930985928,
        0.01326680462807417,
        0.001384767354466021,
        0.003261191537603736,
        0.003255243878811598,
        0.008080617524683475,
        -0.005221871193498373,
        -0.007049724459648132,
        0.011894923634827137,
        -0.02209283784031868,
        0.02463042177259922,
        -0.00045795453479513526,
        0.009341479279100895,
        0.020031049847602844,
        0.013758460991084576,
        0.002997520612552762,
        0.030181385576725006,
        0.00395307969301939,
        -0.008849822916090488,
        0.012204191647469997,
        -0.004702459555119276,
        0.03679496422410011,
        0.0026010232977569103,
        -0.018984297290444374,
        -0.007295553106814623,
        -0.030609602108597755,
        -0.018016843125224113,
        -0.008469185791909695,
        -0.006022796034812927,
        0.005241696257144213,
        -0.015867827460169792,
        -0.012703778222203255,
        -0.020475128665566444,
        -0.007192463614046574,
        0.014678334817290306,
        -0.0067206318490207195,
        0.020205508917570114,
        -0.02007863111793995,
        -0.015962986275553703,
        -0.00964281801134348,
        -0.00838195625692606,
        -0.013631582260131836,
        -0.00217280606739223,
        0.021426722407341003,
        -0.01693837158381939,
        -0.001625639502890408,
        -0.0061258855275809765,
        0.02637501060962677,
        0.0020617865957319736,
        0.0016038321191444993,
        0.001538410084322095,
        0.0027834121137857437,
        0.014876583591103554,
        -0.00978555716574192,
        -0.0023333874996751547,
        -0.01765206642448902,
        0.012973396107554436,
        -0.0058721271343529224,
        -0.006086235865950584,
        0.01649429276585579,
        0.0003424746682867408,
        0.019682133570313454,
        0.005059307441115379,
        0.008366095833480358,
        -0.009634887799620628,
        0.002021145774051547,
        -0.002371054608374834,
        0.0009902523597702384,
        0.0014819091884419322,
        0.006078305654227734,
        -0.012465879321098328,
        -0.020855765789747238,
        -0.009634887799620628,
        -0.01928563602268696,
        -0.01479728426784277,
        0.02583577297627926,
        0.019697992131114006,
        -0.01788996532559395,
        0.01387741044163704,
        0.022647934034466743,
        -0.004575580358505249,
        0.013290594331920147,
        -0.022156277671456337,
        -0.008278866298496723,
        0.02437666244804859,
        0.019713852554559708,
        -0.008108372800052166,
        -0.012640338391065598,
        -0.0016761929728090763,
        0.0022203857079148293,
        -0.017081109806895256,
        0.021696340292692184,
        -0.017493467777967453,
        -0.0009456463740207255,
        0.005983146373182535,
        0.04006209969520569,
        0.0007424414507113397,
        0.011990082450211048,
        -0.01658945344388485,
        -0.0019101264188066125,
        0.02732660435140133,
        -0.01419460866600275,
        0.04342440143227577,
        0.0016613242914900184,
        0.00028746065800078213,
        -0.021268121898174286,
        0.03194183483719826,
        -0.0030133805703371763,
        0.02995934709906578,
        0.005562859121710062,
        -0.0040244488045573235,
        0.020839905366301537,
        -0.014733844436705112,
        0.01515413261950016,
        0.00172972003929317,
        0.0071647088043391705,
        -0.000800429203081876,
        0.01965041272342205,
        0.0205068476498127,
        0.013909130357205868,
        0.003132329788058996,
        -0.017319008708000183,
        -0.013005116023123264,
        0.0023254575207829475,
        -0.009880715981125832,
        0.005713528022170067,
        0.006827685981988907,
        8.20873594875593e-07,
        -0.012323140166699886,
        -0.004030396696180105,
        -0.0012271596351638436,
        -0.001925986260175705,
        -6.223151285666972e-05,
        -0.023948445916175842,
        -0.002823061775416136,
        -0.009682467207312584,
        -0.030022786930203438,
        -0.0026486029382795095,
        -0.012497599236667156,
        0.007414502091705799,
        -0.008588134311139584,
        0.01166495494544506,
        0.009896576404571533,
        -0.0031501720659434795,
        -0.013909130357205868,
        -0.008770523592829704,
        0.02253691479563713,
        -0.012909956276416779,
        0.02864297479391098,
        -0.014091518707573414,
        0.01130810659378767,
        -0.024154623970389366,
        -0.01240243948996067,
        -0.00015735991473775357,
        -0.008730873465538025,
        -0.0028171143494546413,
        -0.005154466722160578,
        -0.02279067225754261,
        -0.0039054998196661472,
        -0.0061258855275809765,
        -0.013980499468743801,
        0.003025275422260165,
        0.005868162028491497,
        0.013306453824043274,
        0.002428546780720353,
        0.006522383075207472,
        -0.00345944007858634,
        -0.008572274819016457,
        -0.0003456962003838271,
        -0.01947595365345478,
        0.0046707396395504475,
        -0.01876225881278515,
        -0.02455112151801586,
        -0.01056269183754921,
        0.022806532680988312,
        0.026248130947351456,
        0.015550629235804081,
        0.007192463614046574,
        -0.004286137409508228,
        -0.0006081279716454446,
        0.023028571158647537,
        -0.0200944896787405,
        -0.0030986275523900986,
        -0.02366296760737896,
        -0.028690554201602936,
        0.003467370057478547,
        0.00471831951290369,
        0.014480086974799633,
        0.006756316404789686,
        -0.010364443063735962,
        0.008833963423967361,
        -0.007850649766623974,
        -0.015177922323346138,
        -0.0019656361546367407,
        -0.011189158074557781,
        0.029213931411504745,
        0.020713025704026222,
        0.02566131390631199,
        -0.02548685483634472,
        -0.0011825535912066698,
        -0.013203364796936512,
        -0.0020023121032863855,
        0.021680479869246483,
        -0.005106886848807335,
        -0.024915900081396103,
        -0.015162061899900436,
        0.004888813477009535,
        -0.00014868653670419008,
        0.00438922643661499,
        0.005186186637729406,
        0.012902026996016502,
        -0.0002988599590025842,
        -0.007807034533470869,
        -0.008865682408213615,
        0.005598543677479029,
        0.005071202293038368,
        -0.006982319988310337,
        -0.0037350058555603027,
        -0.010404093191027641,
        0.008017178624868393,
        0.012703778222203255,
        0.01651015318930149,
        0.012164541520178318,
        -0.0071647088043391705,
        -0.0019012052798643708,
        0.0017713523702695966,
        0.0040482389740645885,
        -0.02934081107378006,
        -0.023789847269654274,
        0.054875247180461884,
        -0.005305135622620583,
        0.001205352251417935,
        -0.02531239576637745,
        0.012902026996016502,
        0.00044630744378082454,
        -0.0009803399443626404,
        -0.008762593381106853,
        -0.012656197883188725,
        -0.00271997251547873,
        -0.022854112088680267,
        -0.00464694993570447,
        0.008619854226708412,
        -5.6779674196150154e-05,
        -0.004757969174534082,
        0.025344116613268852,
        0.0021509986836463213,
        0.002377002267166972,
        -0.003663636278361082,
        -0.015439609996974468,
        -0.005495454650372267,
        -0.001742606284096837,
        0.01693837158381939,
        0.029356669634580612,
        0.03267138823866844,
        -0.01322715450078249,
        -0.010784730315208435,
        -0.004472491331398487,
        0.0023532123304903507,
        0.004424911458045244,
        -0.005451839882880449,
        -0.014115309342741966,
        -0.00419097812846303,
        0.005459769628942013,
        -0.012037661857903004,
        -0.014376997016370296,
        -0.011736324056982994,
        0.014107379131019115,
        0.0016821403987705708,
        -0.002949940972030163,
        -0.016272254288196564,
        0.018032703548669815,
        0.010713361203670502,
        0.009032211266458035,
        0.00017842384113464504,
        -0.017001809552311897,
        -0.021077804267406464,
        0.03638260439038277,
        0.014765564352273941,
        0.02689838595688343,
        -0.011078138835728168,
        -0.003661653958261013,
        -0.016700472682714462,
        -0.017160410061478615,
        0.022394174709916115,
        0.006010901182889938,
        -0.003136294661089778,
        0.0022560704965144396,
        -0.02445596270263195,
        0.010015524923801422,
        0.009254250675439835,
        -0.012212120927870274,
        0.0010943328961730003,
        -0.026866666972637177,
        -0.02699354663491249,
        -0.005360645242035389,
        0.003399965586140752,
        0.0034455626737326384,
        -0.0017356675816699862,
        -0.0019973558373749256,
        -0.01720798946917057,
        -0.004270277451723814,
        -0.0340353399515152,
        -0.005091027356684208,
        -0.008318516425788403,
        -0.007894263602793217,
        -0.013084415346384048,
        -0.02880157344043255,
        0.009365269914269447,
        -0.024995198473334312,
        0.008461255580186844,
        0.005483559798449278,
        -0.028420936316251755,
        -0.0027853944338858128,
        -0.005364610347896814,
        -0.01738244853913784,
        0.004222697578370571,
        -0.013901200145483017,
        0.0005223853513598442,
        0.013139924965798855,
        0.020903345197439194,
        0.01876225881278515,
        -0.006458943244069815,
        -0.006768211256712675,
        -0.004258382599800825,
        0.01625639572739601,
        -0.0033761756494641304,
        0.004416981711983681,
        -0.0008043941925279796,
        0.01099883858114481,
        0.014963813126087189,
        0.016732191666960716,
        -0.008944982662796974,
        0.004987937863916159,
        0.01990417204797268,
        -0.021268121898174286,
        0.000472327577881515,
        -0.006708736531436443,
        -0.008905332535505295,
        0.015653718262910843,
        0.02374226599931717,
        0.02409118413925171,
        -0.00942870881408453,
        0.007914088666439056,
        -0.004868988413363695,
        0.010990909300744534,
        -0.0033960004802793264,
        -0.013020975515246391,
        -0.0005372540326789021,
        0.0038876573089510202,
        -0.006157605443149805,
        0.004103748593479395,
        0.00511085195466876,
        -0.0052654859609901905,
        -0.00016801578749436885,
        0.01730314828455448,
        -0.00350503739900887,
        0.00847711507230997,
        0.006954565178602934,
        0.009745907038450241,
        -0.007180568762123585,
        -0.027104565873742104,
        -0.008833963423967361,
        -0.00028349566855467856,
        0.03116469830274582,
        -0.004757969174534082,
        -0.014107379131019115,
        0.010324792936444283,
        -0.005364610347896814,
        0.0055549293756484985,
        -0.019238056614995003,
        0.013116135261952877,
        0.007339167408645153,
        0.00015017340774647892,
        -0.0027179899625480175,
        0.00217280606739223,
        -0.012148682028055191,
        0.006629437208175659,
        0.022283155471086502,
        0.000773170031607151,
        0.010094825178384781,
        -0.001762431114912033,
        0.009270110167562962,
        0.007922018878161907,
        -0.004127538297325373,
        0.0016464556101709604,
        0.0027060951106250286,
        -0.015169992111623287,
        0.007442256901413202,
        0.01676391251385212,
        -0.007933913730084896,
        0.008921192027628422,
        0.005007762461900711,
        -0.004837268963456154,
        0.0058245472609996796,
        0.0011647111969068646,
        0.023377489298582077,
        0.002888483926653862,
        0.004022466484457254,
        0.013465053401887417,
        0.003007433144375682,
        -0.021061943843960762,
        -0.004944323096424341,
        -0.001180571154691279,
        0.015328590758144855,
        0.008318516425788403,
        0.021283982321619987,
        0.016605312004685402,
        0.032259032130241394,
        -0.010459602810442448,
        -0.0011270439717918634,
        0.0012033696984872222,
        -0.005800757557153702,
        0.003390053054317832,
        0.030022786930203438,
        -0.013615721836686134,
        -0.0010100771905854344,
        0.00497604301199317,
        0.006562032736837864,
        -0.006554102525115013,
        -0.0003533783310558647,
        -0.005277380812913179,
        0.014892444014549255,
        -0.009896576404571533,
        -0.005574753973633051,
        0.006300344131886959,
        0.007414502091705799,
        -0.014099448919296265,
        0.018127862364053726,
        0.005582684185355902,
        0.003738970961421728,
        0.007529486436396837,
        -0.015804387629032135,
        -0.025899212807416916
    ],
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/32a41ad0f478e8ac2c39e6834058a0a89192f299.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192104Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=a2ce4b204cdb8aef41ae0265c127e769f19ea72464480f3d5d6fdc734584400f",
    "social_links": [
        "https://www.crunchbase.com/organization/yardbook"
    ],
    "logo_path": "data/logos\\Yardbook_logo.png"
}