{
  "links": "https://www.ycombinator.com/companies/zenflow",
  "name": "Zenflow",
  "headline": "Medical device that provides a more effective, less invasiveâ¦",
  "batch": "W15",
  "description": "Forty million men in the US and over 500 million worldwide suffer from urinary obstruction related to benign prostatic hyperplasia (BPH). The majority of men will experience symptoms of this disease at some point in life. BPH, also known as prostate enlargement, leads to urinary straining, frequency, urgency, and sleep disruption. Despite the high prevalence and significant quality of life burden of BPH, established treatments are limited to drugs, which have limited effectiveness, and surgery, which carries a high risk of sexual side effects. The Zenflow Spring is a small implant delivered in the urologist's office in a simple procedure that provides quick and long-lasting symptom relief.",
  "activity_status": "Active",
  "website": "http://zenflow.com",
  "founded_date": 2014.0,
  "team_size": 18.0,
  "location": "South San Francisco, CA",
  "group_partner": null,
  "group_partner_yc": null,
  "company_linkedin": null,
  "company_twitter": null,
  "tags": "industry:medical-devices",
  "founders": [],
  "status": true,
  "markdown": null,
  "generated_description": "**Zenflow: A New Light in Urology**\n\nZenflow is on a mission to transform the treatment landscape for urinary obstruction caused by benign prostatic hyperplasia (BPH). With around forty million men in the U.S. and over 500 million worldwide affected by this condition, the need for effective solutions is glaring. BPH, or prostate enlargement, leads to a cascade of frustrating symptoms—think frequent trips to the bathroom, urgency, and even disrupted sleep. The common treatments now? Medications that often fall short and surgeries that come with daunting risks of sexual side effects.\n\nEnter the Zenflow Spring—a small, innovative implant that offers a breakthrough. Delivered in a urologist's office through a straightforward procedure, this device provides quick and long-lasting symptom relief. For many men, this could mean a significant improvement in their quality of life, all without the invasive implications of traditional surgical approaches.\n\nFounded in 2014 and nurtured through Y Combinator's W15 batch, Zenflow is based in South San Francisco, California, and operates with a team of 18 talented individuals. They’re focused and efficient, and their ambition is backed by strong partnership ties. \n\nIn a world where the discomfort of BPH is all too common, Zenflow is forging a path forward—redefining how this condition is treated and ultimately improving the lives of millions. For more information, check out their website at [zenflow.com](http://zenflow.com). \n\nSo, if you’re looking for an example of how innovation can disrupt inadequacies in healthcare, you’d do well to keep an eye on Zenflow."
}