{
  "links": "https://www.ycombinator.com/companies/zeroentropy",
  "name": "ZeroEntropy",
  "headline": "High accuracy search API over unstructured data.",
  "batch": "W25",
  "description": "We are on a mission to build the world’s most accurate search engine over complex and unstructured documents.\r\n\nMost AI products - whether Q&A bots or AI agents - depend on retrieval systems to provide relevant context from knowledge bases.\r\n\nYet, the vast majority of these systems rely on basic semantic or hybrid search methods, which still frequently fail. \r\n\nThese mistakes lead to inaccurate responses and hallucinations by LLMs, frustrating developers and end users alike. \r\n\nThat is why we’re building ZeroEntropy: to add intelligence to retrieval and empower developers to create AI products that are more reliable and accurate.",
  "activity_status": "Active",
  "website": "https://www.zeroentropy.dev",
  "founded_date": 2024.0,
  "team_size": 2.0,
  "location": "San Francisco",
  "group_partner": "Harj Taggar",
  "group_partner_yc": "https://www.ycombinator.com/people/harj-taggar",
  "company_linkedin": null,
  "company_twitter": null,
  "tags": "industry:developer-tools; industry:api; industry:search; industry:ai; location:san-francisco-bay-area",
  "founders": [
    {
      "name": "Ghita Houir Alami, Founder",
      "description": "cofounder & CEO @ ZeroEntropy (YC W25)\n-\nmoroccan founder with 2 masters in applied maths from École Polytechnique and UC Berkeley",
      "linkedin": "https://linkedin.com/in/ghita-houir-alami"
    },
    {
      "name": "Nicholas Pipitone, Founder",
      "description": "Cofounder & CTO @ ZeroEntropy (YC W25) -\n\nMy background is in theoretical mathematics and computer science.\n\nDropped out of CMU to pursue startups. Worked on low-level C/C++/Assembly/GPU Code. CTO and/or main dev for 5 different startups. Created stat-arb algorithms and audited blockchains for bug bounties and hedge fund due diligence.\n\nBuilt the AI @ myko.ai, manifestapp.xyz, magibook.co",
      "linkedin": "https://www.linkedin.com/in/nicholas-pipitone-5736a2107/"
    }
  ],
  "status": true,
  "markdown": "raw_markdown='\\n' markdown_with_citations='\\n' references_markdown='\\n\\n## References\\n\\n' fit_markdown='' fit_html=''",
  "generated_description": "**ZeroEntropy: Revolutionizing Search for AI**\n\nZeroEntropy is a San Francisco-based startup on a bold mission—to create the world’s most accurate search engine tailored for dealing with complex, unstructured documents. Founded in 2024 and part of the Y Combinator Batch W25, this two-person team is setting out to tackle a pervasive issue in the world of AI.\n\nIn an age where AI products like Q&A bots and virtual assistants rely heavily on retrieval systems, the limitations of current methods are glaring. Most existing systems employ basic semantic or hybrid search techniques that often miss the mark, leading to inaccuracies and frustrating hallucinations generated by large language models (LLMs). This isn't just a minor inconvenience; it can derail entire projects and erode trust in AI capabilities.\n\nZeroEntropy aims to change all that. By infusing its search API with enhanced intelligence, the company is empowering developers to build AI applications that are not only more reliable but also significantly more accurate. This dual focus on precision and user experience sets ZeroEntropy apart in a crowded field of Developer Tools.\n\nWith Harj Taggar as their Group Partner, the startup is poised to make waves in the realms of search, AI, and developer tools. If you’re interested in learning more or diving into the details of their offerings, check out their website at [zeroentropy.dev](https://www.zeroentropy.dev).\n\nIn summary, ZeroEntropy is tackling a core problem in AI—search accuracy over unstructured data—with a fresh perspective that aims to elevate the capabilities of AI products everywhere. Watch this space; they may just be the solution the industry has been waiting for."
}