{
  "links": "https://www.ycombinator.com/companies/ziffyhomes",
  "name": "ZiffyHomes",
  "headline": "ZiffyHomes is managed corporate housing for white collar employees inâ¦",
  "batch": "S18",
  "description": "ZiffyHomes is a living solace for young professionals with beautiful living spaces, vibrant community, excellent services and full time support to all our customers. We work towards providing the highest standards of living for young professionals and saving them from woes of house hunt. We wish to provide a space for them where they can flourish. \r\n\nFounded by Saurabh Kumar & Sanchal Ranjan where they are fascinated about formation of communities around both living and working spaces in a country like India for the last 15 years of their educational and corporate lifetimes and now fostering India's first physical social network via co-living.\r\n\nJoin us on our journey of excited times ahead.\r\n\nVisit us at www.ziffyhomes.com or follow our progress on:\r\n\nFacebook: https://www.facebook.com/ziffyhomes/\r\nTwitter: https://twitter.com/ZiffyHomes\r\nInstagram: https://www.instagram.com/ziffyhomes/",
  "activity_status": "Active",
  "website": "https://www.ziffyhomes.com/",
  "founded_date": 2016.0,
  "team_size": 57.0,
  "location": "Gurugram, India",
  "group_partner": null,
  "group_partner_yc": null,
  "company_linkedin": null,
  "company_twitter": null,
  "tags": "industry:real-estate; industry:india",
  "founders": [
    {
      "name": "Sanchal Ranjan",
      "description": "Hi there, feel free to reach out for any product-related feedback, etc.",
      "linkedin": "https://linkedin.com/in/sanchal"
    },
    {
      "name": "Saurabh Kumar",
      "description": null,
      "linkedin": "https://linkedin.com/in/saurabhksinha"
    }
  ],
  "status": true,
  "markdown": null,
  "generated_description": "ZiffyHomes, founded in 2016 by Saurabh Kumar and Sanchal Ranjan, is carving out an innovative niche in the corporate housing market for young professionals in India. Their mission is straightforward: to provide meticulously managed living spaces for white-collar employees, thereby liberating them from the headaches of house hunting.\n\nThink of ZiffyHomes as a vibrant oasis for professionals—a place where not only can they find beautiful accommodations but also foster community and enjoy excellent services with full-time support. The founders, armed with over 15 years of combined experience in education and the corporate world, are passionate about building communities centered around living and working in India. Their vision is revolutionary, aiming to create what they call “India’s first physical social network” through co-living spaces.\n\nLocated in Gurugram, the company started as a haven for young professionals, and now it boasts a dedicated team of 57 employees focused on maintaining high living standards. ZiffyHomes is part of Y Combinator's S18 batch, which signifies a level of endorsement and support from one of the most prestigious startup accelerators.\n\nThey are currently tagged in the real estate scene in India, a move that positions them well in a country ripe for innovation in living arrangements.\n\nIf you want to keep tabs on their journey or if you’re a young professional seeking a home that aligns with your lifestyle, head over to their website at www.ziffyhomes.com. You can also connect with them on social media for updates and insights into their exciting growth ahead.\n\nSo, if you're navigating the hustle of urban life, ZiffyHomes might just be the solution you're looking for—where comfort meets community in a rapidly changing landscape."
}