[
    {
        "id": "artemis-search",
        "score": 7.434310826000001,
        "metadata": {
            "batch": "S22",
            "description": "Artemis Search is a vector database search with a twist. We use special-purpose deep-learning models instead of using textual / semantic similarity to evaluate how good a search result is.\r\n\nThis enables us to actually reason how well search results match the intent of the search query, eliminating the problems that come from evaluating search results on how much they look like the search query.",
            "founded_date": "2021.0",
            "founder_1_description": "Austin is a Caltech CS graduate with an emphasis in applied mathematics and finance. Austin has an academic background developing and publishing computer graphics technology and machine learning models at Caltech's Aerospace Robotics and Control (ARCL) laboratory. Austin also has experience launching and selling several small technology businesses ($100k - $1M ARR) centered around developing and selling B2B and B2C software products.",
            "founder_1_linkedin": "https://www.linkedin.com/in/austin-mccoy-833600229/",
            "founder_1_name": "Austin McCoy, Founder",
            "founder_2_description": "Manvir is a self-taught software engineer who specializes in building robust and intuitive technology accessible to clients from all backgrounds. He has coordinated with his co-founder, Austin, on previous ventures and looks forward to bringing his experience to bear with Artemis.",
            "founder_2_linkedin": "https://www.linkedin.com/in/manvir-singh-abb298247/",
            "founder_2_name": "Manvir Singh, Founder",
            "generated_description": "Artemis Search is shaking things up in the world of search technology. Founded in 2021 and a proud member of Y Combinator’s Batch S22, this San Francisco-based startup has a mission that’s refreshingly straightforward: to create a search technology that actually finds what you’re looking for.\n\nWhile most search engines rely heavily on textual or semantic similarity to rank results, Artemis Search goes a step further. It employs special-purpose deep-learning models designed to evaluate how well search results align with the intent behind your queries. This innovative approach means that Artemis can not only return results that look similar to what you asked for but actually make sense in the context of your intent.\n\nCurrently, the company operates with a small but mighty team of three, led by Group Partner Dalton Caldwell. Artemis is tagged in the bustling sectors of artificial intelligence, machine learning, SaaS, B2B, and, of course, search. They are currently in beta and are focused on developing an AI-powered prospecting tool that combs the internet to identify ideal customers for businesses.\n\nIf you're curious to see what Artemis Search is all about, you can check out their website at [search-artemis.com](https://search-artemis.com/). Whether you're a business looking for smarter search solutions or someone interested in cutting-edge AI technologies, Artemis is a company to keep on your radar. They’re tackling one of the most persistent problems in tech — making search actually work. The future of search could be a lot brighter thanks to them.",
            "headline": "A search technology that actually finds what youâre looking for.",
            "location": "San Francisco",
            "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/6416951e63f83a45cc0146cec5a1279ab70e050b.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191005Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=80548822805d38f219443706c976343b8af0d57ddd687a56962adc49a83d141c",
            "name": "Artemis Search",
            "social_links": [
                "https://www.linkedin.com/company/search-artemis"
            ],
            "tags": [
                "artificial-intelligence"
            ],
            "team_size": "3.0",
            "website": "https://search-artemis.com/",
            "ycpage": "https://www.ycombinator.com/companies/artemis-search"
        }
    },
    {
        "id": "zeroentropy",
        "score": 7.190873594000001,
        "metadata": {
            "batch": "W25",
            "description": "We are on a mission to build the world’s most accurate search engine over complex and unstructured documents.\r\n\nMost AI products - whether Q&A bots or AI agents - depend on retrieval systems to provide relevant context from knowledge bases.\r\n\nYet, the vast majority of these systems rely on basic semantic or hybrid search methods, which still frequently fail. \r\n\nThese mistakes lead to inaccurate responses and hallucinations by LLMs, frustrating developers and end users alike. \r\n\nThat is why we’re building ZeroEntropy: to add intelligence to retrieval and empower developers to create AI products that are more reliable and accurate.",
            "founded_date": "2024.0",
            "founder_1_description": "cofounder & CEO @ ZeroEntropy (YC W25)\n-\nmoroccan founder with 2 masters in applied maths from École Polytechnique and UC Berkeley",
            "founder_1_linkedin": "https://linkedin.com/in/ghita-houir-alami",
            "founder_1_name": "Ghita Houir Alami, Founder",
            "founder_2_description": "Cofounder & CTO @ ZeroEntropy (YC W25) -\n\nMy background is in theoretical mathematics and computer science.\n\nDropped out of CMU to pursue startups. Worked on low-level C/C++/Assembly/GPU Code. CTO and/or main dev for 5 different startups. Created stat-arb algorithms and audited blockchains for bug bounties and hedge fund due diligence.\n\nBuilt the AI @ myko.ai, manifestapp.xyz, magibook.co",
            "founder_2_linkedin": "https://www.linkedin.com/in/nicholas-pipitone-5736a2107/",
            "founder_2_name": "Nicholas Pipitone, Founder",
            "generated_description": "**ZeroEntropy: Revolutionizing Search for AI**\n\nZeroEntropy is a San Francisco-based startup on a bold mission—to create the world’s most accurate search engine tailored for dealing with complex, unstructured documents. Founded in 2024 and part of the Y Combinator Batch W25, this two-person team is setting out to tackle a pervasive issue in the world of AI.\n\nIn an age where AI products like Q&A bots and virtual assistants rely heavily on retrieval systems, the limitations of current methods are glaring. Most existing systems employ basic semantic or hybrid search techniques that often miss the mark, leading to inaccuracies and frustrating hallucinations generated by large language models (LLMs). This isn't just a minor inconvenience; it can derail entire projects and erode trust in AI capabilities.\n\nZeroEntropy aims to change all that. By infusing its search API with enhanced intelligence, the company is empowering developers to build AI applications that are not only more reliable but also significantly more accurate. This dual focus on precision and user experience sets ZeroEntropy apart in a crowded field of Developer Tools.\n\nWith Harj Taggar as their Group Partner, the startup is poised to make waves in the realms of search, AI, and developer tools. If you’re interested in learning more or diving into the details of their offerings, check out their website at [zeroentropy.dev](https://www.zeroentropy.dev).\n\nIn summary, ZeroEntropy is tackling a core problem in AI—search accuracy over unstructured data—with a fresh perspective that aims to elevate the capabilities of AI products everywhere. Watch this space; they may just be the solution the industry has been waiting for.",
            "headline": "High accuracy search API over unstructured data.",
            "location": "San Francisco",
            "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/9352c7f0a853e8d313b670567e81d5c3c0271694.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192109Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=866bb1a577fc2a95386a84cca1c80b4bf9b99996e94e34e8a3863241eb958fc3",
            "name": "ZeroEntropy",
            "social_links": [
                "https://www.linkedin.com/company/zeroentropy-inc/",
                "https://x.com/zeroentropy_ai",
                "https://github.com/ZeroEntropy-AI"
            ],
            "tags": [
                "developer-tools"
            ],
            "team_size": "2.0",
            "website": "https://www.zeroentropy.dev",
            "ycpage": "https://www.ycombinator.com/companies/zeroentropy"
        }
    },
    {
        "id": "trieve",
        "score": 7.031921444,
        "metadata": {
            "batch": "W24",
            "description": "Infrastructure for search teams building retrieval and RAG. Trieve combines search language models with tools for tuning ranking and relevance.\r\n\nBuilding excellent search is difficult and can take months to implement then even more time to maintain. Trieve offers production-ready infrastructure that works out of the box to help search teams build adjustable AI search and RAG into their products. With tools for custom models, relevancy weighting, date-recency biasing, semantic full-text hybrid search, recommendations, and more Trieve covers the full spectrum of what a team wants from their discovery infrastructure.",
            "founded_date": "2023.0",
            "founder_1_description": "Find me at https://github.com/skeptrunedev . My primary hobbies are reading progression fantasy, riding motorcycles, and running.",
            "founder_1_linkedin": "https://linkedin.com/in/nicholas-khami-5a0a7a135",
            "founder_1_name": "Nicholas Khami, Founder",
            "founder_2_description": "https://github.com/cdxker",
            "founder_2_linkedin": "https://linkdin.com/in/denzell-ford",
            "founder_2_name": "Denzell Ford, Founder",
            "generated_description": "**Trieve: Simplifying AI-Powered Search**\n\nFounded in 2023 and currently part of Y Combinator’s Batch W24, Trieve is a San Francisco-based startup on a mission to revolutionize the way search and recommendations are done. With a relatively small team of just 7 employees, Trieve is tackling one of the most complex problems in tech: building an effective search infrastructure.\n\nAt its core, Trieve serves as an all-in-one API designed for search, retrieval-augmented generation (RAG), and recommendations. Think of it as the ultimate toolkit for developers who want to integrate sophisticated search capabilities into their applications without the usual hassle. Historically, creating a robust search function could take months, but Trieve promises a production-ready solution that works right out of the box.\n\n### What Sets Trieve Apart?\n\nTrieve combines cutting-edge search language models with advanced tools that allow teams to fine-tune their search results. The features include:\n- **Semantic Vector and Hybrid Search**: Out-of-the-box support for both semantic and full-text search.\n- **Custom Models and Embedding Options**: A flexible infrastructure that allows for stock or custom embedding models.\n- **Relevancy Tuning**: Fine-tune search results and boost performance via an API or a no-code dashboard.\n- **Comprehensive Coverage**: From chunking data to providing analytics, Trieve covers all bases with its API.\n\nThis comprehensive approach lets teams manage everything from ingestion to analytics with ease. For those with stringent data requirements, Trieve even offers self-hosting capabilities.\n\n### Use Cases and Applications\n\nToday, Trieve is already powering over 30,000 discovery experiences across various sectors, including e-commerce and analytics. Companies leveraging Trieve can build a competitive edge by enhancing their search functionality and overall user experience.\n\n### Why Choose Trieve?\n\nIf you want to set up industry-leading search capabilities in under 30 minutes, Trieve is your go-to solution. By simply uploading data, integrating the API, and tweaking search parameters, businesses can have a sophisticated search engine up and running without extensive downtime or ongoing maintenance burdens. \n\nIn short, if search is a crucial component of your product, or if you’re committed to building an exceptional discovery experience, Trieve positions itself as a powerful partner. For a closer look at what Trieve can do, visit their website at [trieve.ai](https://trieve.ai) or request a demo to see the magic in action.",
            "headline": "All-in-one API for search, RAG, & recommendations",
            "location": "San Francisco",
            "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/ee1f9c0657e84d04e1a03799a7f8d9c4860f89da.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192028Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=69cc123c8d26222b2452e18ffd930b16297f7a138df7b9a5c1c303e46ecb2b2f",
            "name": "Trieve",
            "social_links": [
                "https://www.linkedin.com/company/trieveai/",
                "https://twitter.com/trieveai",
                "https://github.com/devflowinc/trieve"
            ],
            "tags": [
                "developer-tools"
            ],
            "team_size": "7.0",
            "website": "https://trieve.ai",
            "ycpage": "https://www.ycombinator.com/companies/trieve"
        }
    },
    {
        "id": "promoted.ai",
        "score": 6.942144780999999,
        "metadata": {
            "batch": "W21",
            "description": "Promoted.ai unifies search, native ads, and feed ranking for online marketplaces and scaled e-commerce apps to dramatically improve relevance (and revenue) using AI. We are a team of ex-Google, Meta, and Pinterest ads engineers. Our customers are publicly traded and late-stage marketplace companies like Eventbrite, Upwork, and Outschool. Our mission is to connect every buyer and seller.",
            "founded_date": "2020.0",
            "founder_1_description": "I built ad marketplaces at Facebook and Pinterest.",
            "founder_1_linkedin": "https://www.linkedin.com/in/andrew-yates-0217a985/",
            "founder_1_name": "Andrew Yates, Founder",
            "founder_2_description": "I've worked on ad systems for ~15 years at Google, Pinterest and Promoted.ai.  I'm passionate about growing team members and revenue.",
            "founder_2_linkedin": "https://www.linkedin.com/in/dan-hill-1a891820/",
            "founder_2_name": "Dan Hill, Founder",
            "generated_description": "**Promoted.ai Overview**\n\nFounded in 2020 and an alumnus of Y Combinator’s W21 batch, Promoted.ai is making a significant dent in the marketplace world by leveraging advanced artificial intelligence for search and advertising. Based in the tech hub of San Francisco, the tight-knit team of 12 engineers—drawn from giants like Google, Meta, and Pinterest—focuses on enhancing the relevance and revenue of online marketplaces.\n\n### Mission and Vision\nPromoted.ai’s mission is clear: to dramatically improve search and advertising for marketplaces, ultimately connecting buyers and sellers in a more meaningful way. They aim to deliver \"shockingly better relevance,\" touting a potential revenue increase of up to 10% through innovations that blend traditional machine learning with cutting-edge generative AI technology.\n\n### Core Offerings\nPromoted.ai specializes in:\n\n- **Search Optimization**: Improving the quality of search functions in marketplaces to help users find exactly what they need efficiently.\n- **Native Ads Solutions**: Designing advertisements that perform seamlessly within the user experience, akin to organic content.\n- **Feed Ranking Improvements**: Ensuring that product listings are optimized based on user behavior and search queries.\n\nThe company has a strong client list that includes well-known names like Eventbrite, Upwork, and Outschool, underscoring its capability to cater to both publicly traded and late-stage marketplace companies.\n\n### Why It Matters\nIn a world where attention is fleeting, Promoted.ai aims to solve the core pain points that online marketplaces face—relevance in search results and ad performance. By offering solutions that are not just about generating traffic but ensuring the traffic converts, they address a fundamental issue affecting revenue streams for marketplaces.\n\n### Notable Achievements\nPromoted.ai has demonstrated impressive results with its clients:\n- **Hipcamp** saw an 11% increase in guest-to-host conversions.\n- **Outschool** realized a 16% boost in revenue through better matchmaking between teachers and learners.\n- **RVshare** experienced a remarkable 25% increase in booking rates.\n\nThese testimonials speak volumes about the effectiveness and potential of their technology.\n\n### Team and Leadership\nMichael Seibel, a prominent figure in the startup ecosystem and partner at Y Combinator, serves as a group partner. The strength of the team not only lies in their technical skills but also in their innovative approach to solving complex problems.\n\n### The Road Ahead\nPromoted.ai is not just about product features—it’s about building lasting relationships between buyers and sellers. Their approach to search and ads is rooted in a belief that better technology can lead to better outcomes for all stakeholders involved. \n\nIf you're curious about their offerings or want to see how they can elevate your marketplace experience, check them out at [Promoted.ai](http://www.promoted.ai).",
            "headline": "Dramatically better search and ads for marketplaces",
            "location": "San Francisco",
            "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/f0f2a773ca0bfb3af498c9f655c55f5c2a4cac54.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191654Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=fa1756c64799b0a49d64ddf55486546358686fe0fbe51d5056856f9b1a5c7f68",
            "name": "Promoted.ai",
            "social_links": [
                "https://www.linkedin.com/company/promoted-ai",
                "https://www.crunchbase.com/organization/promoted-ai",
                "https://github.com/promotedai"
            ],
            "tags": [
                "machine-learning"
            ],
            "team_size": "12.0",
            "website": "http://www.promoted.ai",
            "ycpage": "https://www.ycombinator.com/companies/promoted"
        }
    },
    {
        "id": "shaped",
        "score": 5.484011239999999,
        "metadata": {
            "batch": "W22",
            "description": "Increase engagement, conversion, and revenue with a configurable search and recommendation system that adapts in real-time.",
            "founded_date": "2021.0",
            "founder_1_description": "CEO of Shaped. \nPreviously an AI researcher at Facebook AI Research (FAIR).\nCreator of PyTorchVideo & original core contributor to PyTorch Lightning.\nPassionate about anything AI, machine-learning and statistics.",
            "founder_1_linkedin": "https://www.linkedin.com/in/tullie/",
            "founder_1_name": "Tullie Murrell, Founder/CEO",
            "founder_2_description": "COO of Shaped. \nPreviously head of product research at Afterpay and lead UXR at Uber. \nPassionate about behavioural economics, statistics and design.",
            "founder_2_linkedin": "https://www.linkedin.com/in/danielcamilleri/",
            "founder_2_name": "Daniel Camilleri, Founder",
            "generated_description": "**Shaped: Your Partner in Real-Time Recommendations**\n\nFounded in 2021 and located in New York, Shaped is on a mission to enhance the way users receive recommendations and navigate searches online. At its core, Shaped offers a configurable search and recommendation system designed to boost engagement, conversion rates, and revenue for businesses of all sizes. With a team of 12 and backers like Y Combinator (Batch W22), Shaped is quickly establishing itself as a leader in the AI-driven recommendation space.\n\n**What Does Shaped Do?**\n\nShaped provides tools that allow businesses to seamlessly integrate sophisticated search and recommendation functionalities into their existing workflow. Their system adapts in real-time, meaning that as user behavior changes, so too do the recommendations and search results. This adaptability translates into higher engagement and better user experiences across platforms, whether it’s a marketplace, e-commerce site, or media platform.\n\nTheir product offerings include:\n- **Semantic Search**: Making search results more relevant by understanding user intent better.\n- **Recommendations**: Tailoring suggestions based on user behavior and preferences.\n- **Analytics**: Providing insights into user interactions and system performance.\n\n**Why Choose Shaped?**\n\n1. **Easy Integration**: Businesses can connect to Shaped rapidly without extensive overhauls of their existing data systems.\n2. **Real-Time Adaptability**: The platform utilizes behavioral signals to adjust recommendations dynamically.\n3. **Advanced Technology**: Shaped makes use of Large Language Models (LLMs) for nuanced understanding of unstructured data.\n4. **Customization**: Users can create and test various ranking models tailored to their specific needs.\n5. **Security**: With enterprise-grade security measures, including GDPR and SOC2 compliance, Shaped is designed with data privacy in mind.\n\nShaped has built a platform that caters not just to developers but also to data scientists and data engineers, ensuring that everyone can benefit from its capabilities.\n\n**Proven Impact**\n\nShaped boasts impressive metrics:\n- Over 100 million users and items processed.\n- Capable of handling over 1,000 queries per second.\n- In some implementations, clients have seen up to a 4x increase in redemption rates and a 16% lift in average order value.\n\nSo if you’re looking to fundamentally change how your users interact with your digital spaces, consider Shaped. With their innovative approach to AI-driven recommendations and a proven track record of success, they may just be the partner you need to elevate your platform’s performance.\n\nYou can learn more or request a demo through their [website](https://shaped.ai).",
            "headline": "The fastest path to relevant recommendations and search",
            "location": "New York",
            "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/14c3fc0353a7300e602c0819335b94ad82914cf1.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191918Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=d43766ef0737a5c0f6ba7911bc02fcda65c77a37a9c0af1c91ffa83d9eb63516",
            "name": "Shaped",
            "social_links": [
                "https://www.linkedin.com/company/shapedai",
                "https://twitter.com/shapedai"
            ],
            "tags": [
                "artificial-intelligence"
            ],
            "team_size": "12.0",
            "website": "https://shaped.ai",
            "ycpage": "https://www.ycombinator.com/companies/shaped"
        }
    },
    {
        "id": "andi",
        "score": 5.295937091,
        "metadata": {
            "batch": "W22",
            "description": "Instead of just links, Andi gives you answers - like chatting with a smart friend. \r\n\nAndi is a new type of search engine that uses generative AI and language models combined with live data to generate factually correct answers to questions, and to explain and summarize information combined from the best sources. \r\n\nAndi works as a search chatbot that's ad-free and privacy-focused. Ask Andi to...\r\n\n✅  Answer questions\r\n🧠  Find, summarize and explain information\r\n🔍  Navigate and search the web\r\n\nSearch is broken because of SEO spam, ads, and surveillance capitalism. Andi cuts through the clutter to get you straight to the knowledge you need. It presents results visually in a way that's easy to understand with a simple chat interface, and protects you from ad tech and distraction.",
            "founded_date": "2021.0",
            "founder_1_description": "Angela (CEO) is from a totally non-traditional founder background. She's a community college dropout who went from construction laborer to working with Microsoft on Azure, before launching Angie's Travels, a travel influencer startup. She started Andi after going through YC Startup School as a 23-year-old non-technical female founder with the idea for a \"not searching\" engine for Gen-Z.",
            "founder_1_linkedin": "https://www.linkedin.com/in/angela-hoover/",
            "founder_1_name": "Angela Hoover, Founder",
            "founder_2_description": "Jed (CTO) has been programming since he was 8, and sold his first software aged 12. He studied computer science (USyd-part/USFCA), and was editor-in-chief of Australia's top computer magazine at 23, before making a popular start page with 3m users, and building a media search and personalization startup. He has 20+ years experience in search and AI.",
            "founder_2_linkedin": "http://linkedin.com/in/jedwhite",
            "founder_2_name": "Jed White, Founder",
            "generated_description": "### Andi: The Future of Search\n\n**Overview**  \nAndi is a search engine reimagined. Founded in 2021 and initially backed by Y Combinator's W22 batch, Andi leverages the latest advancements in generative AI to transform how we find information online. Based in San Francisco, it operates with a small, focused team of two, including a group partner named Nan.\n\n**Mission**  \nAndi's mission is straightforward: \"Search for the next generation using generative AI.\" This reflects its commitment to providing a user-friendly, intelligent search experience—like having a conversation with a knowledgeable friend rather than sifting through links and ads.\n\n**What Makes Andi Unique?**  \nTraditional search engines often drown users in SEO-optimized spam, intrusive ads, and endless tracking. Andi cuts through this clutter. Here’s how:\n- **Chat-Based Interface**: Andi operates as a chatbot, allowing users to ask questions naturally and receive concise, accurate answers.\n- **Privacy-Focused**: There are no ads or tracking. Your queries remain your own.\n- **Visual Results**: Information is presented in a visually appealing and digestible format, making it easier to understand complex topics.\n\n**Core Features**  \n- ✅ **Instant Answers**: Ask Andi anything, from \"how to lose belly fat\" to \"best places for digital nomads,\" and get reliable, succinct responses.\n- 🧠 **Information Summarization**: Andi can find, summarize, and explain information from the best sources available, enhancing your understanding of any subject.\n- 🔍 **Web Navigation**: With Andi, you can navigate the web more efficiently, sidestepping the usual distractions found in traditional search engines.\n\n**The Verdict**  \nAndi is a refreshing take on search, aiming to enhance the user experience with cutting-edge AI while prioritizing privacy and simplicity. If you're fed up with endless scrolling and irrelevant ads, Andi might just be the smarter, more efficient solution you've been looking for. \n\nCheck it out at [Andi's Website](https://andisearch.com) and experience search like never before.",
            "headline": "Search for the next generation using generative AI",
            "location": "San Francisco",
            "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/dfd2443343f5af1e6a45fe931fa45b73ad024966.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T190957Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=cebba8f0631176d045106c6b816a715e86254e26b6685685574d73136f0d1697",
            "name": "Andi",
            "social_links": [
                "https://www.linkedin.com/company/andisearch/",
                "https://twitter.com/andi_search",
                "https://www.facebook.com/andisearch",
                "https://www.crunchbase.com/organization/andi",
                "https://github.com/andisearch/"
            ],
            "tags": [],
            "team_size": "2.0",
            "website": "https://andisearch.com",
            "ycpage": "https://www.ycombinator.com/companies/andi"
        }
    },
    {
        "id": "superpowered-ai",
        "score": 4.656816913,
        "metadata": {
            "batch": "S22",
            "description": "Superpowered AI makes it easy to build production-ready LLM applications with access to external knowledge.\r\n\nOur API lets you connect external sources of knowledge (like regulatory archives, for example) to LLMs. We leverage proprietary RAG technology to dramatically improve retrieval performance and reliability for a wide variety of use cases.\r\n\nIf you have an LLM-based application in mind, please reach out! We've helped companies build real-world applications, ranging from internal productivity tools to complete external products.",
            "founded_date": "2021.0",
            "founder_1_description": "System Architect at Superpowered.ai\n\nProfessional interests: AI systems, software architecture, Python, IaC\nPersonal interests: biological systems, skiing, mountain biking, and just about anything outside",
            "founder_1_linkedin": "https://www.linkedin.com/in/justin-m-clark/",
            "founder_1_name": "Justin Clark, Founder",
            "founder_2_description": "Dillon Martin is the co-CEO of Superpowered AI, a startup that provides a developer API for building sophisticated LLM-based applications. Previously, he worked as a Financial Advisor at Bank of America Merrill Lynch before co-founding a quantitative hedge fund with the same team that later founded Superpowered AI. When Dillon is not conversing with AI models, he can be found skating the streets of Salt Lake City.",
            "founder_2_linkedin": "https://www.linkedin.com/in/dillon-t-martin-8809b6126",
            "founder_2_name": "Dillon Martin, Founder",
            "founder_3_description": "Nick McCormick is the lead developer at Superpowered AI. He studied engineering at the University of Tennessee. Prior to starting Superpowered, he worked as a developer at a quant hedge fund where he developed the backtesting system. Outside of work, Nick's main passions are mountain biking and running, where he frequently competes in races.",
            "founder_3_linkedin": "https://www.linkedin.com/in/nick-mccormick-6813828b/",
            "founder_3_name": "Nicholas McCormick, Founder",
            "founder_4_description": "Zach is the co-CEO of Superpowered AI. Prior to starting Superpowered, he was the Chief Investment Officer at a small quant hedge fund that he ran with his future Superpowered co-founders, where he put his Applied Mathematics degree to good use. When he’s not working, Zach enjoys spending time in the mountains, usually either skiing or biking.",
            "founder_4_linkedin": "https://www.linkedin.com/in/zach-mccormick-295a5953/",
            "founder_4_name": "Zach McCormick, Founder",
            "generated_description": "### Superpowered AI: Your Go-To for LLM Application Development\n\nFounded in 2021 and hailing from Y Combinator’s Batch S22, Superpowered AI is based in Salt Lake City, UT, and operates with a nimble team of four. This innovative company is on a mission to enhance the development of production-ready applications utilizing Large Language Models (LLMs), all while tapping into external knowledge sources through their API.\n\n#### What Sets Superpowered AI Apart?\n\nAt its core, Superpowered AI focuses on Retrieval Augmented Generation (RAG) technology, a smart move that greatly boosts retrieval performance and reliability. Their API enables developers to connect LLMs to diverse external knowledge bases, such as regulatory archives, making it easier than ever to build applications that leverage both AI and real-world data.\n\nWhether it’s an internal productivity tool or a customer-facing application, Superpowered AI has already partnered with numerous companies to realize their ideas. If you have an LLM-based project in mind, they’re eager to collaborate with you. \n\n#### Who's Behind It?\n\nThe company is guided by Harj Taggar, their Group Partner from Y Combinator. This pedigree alone suggests a focus on ambition and potential.\n\n#### Services Offered\n\nSuperpowered AI caters to both technical and non-technical users:\n- For developers, their **REST API** provides unparalleled flexibility, and a **Python SDK** simplifies integration. They also offer customizable React components for rapid deployment.\n- Non-coders can utilize their user-friendly web interface, which requires no programming skills—just input your data and get results.\n\n**Use Cases:**\n- Building vertical AI products, like marketing tools and workflow automation.\n- Crafting long-form content, including complete chapters for books.\n- Developing customer support solutions and ERPs that enhance productivity.\n- Creating educational apps that serve as personal tutors for students.\n\n#### Why Trust Superpowered AI?\n\nSecurity is paramount here. They uphold industry-standard best practices, using robust 256-bit AES encryption to keep data secure and ensuring that your data is never used to train models. They also feature scoped API keys for granular control over data access and seamless fallback options.\n\n#### Join the Superpowered Movement\n\nBacked by over 10,000 users and boasting over 5 million uploaded pages of text, Superpowered AI is poised for rapid growth. If you're interested, their platform offers a **14-day free trial**—a perfect opportunity to explore the power of RAG technology yourself.\n\nIn short, Superpowered AI is altering the landscape for LLM-based applications and making sophisticated AI integrations more accessible to anyone with a vision. So, if you’re ready to turn your ideas into reality, they might just be the partners you’re looking for.\n\n**Check them out at** [superpowered.ai](https://superpowered.ai).",
            "headline": "API for Retrieval Augmented Generation",
            "location": "Salt Lake City, UT",
            "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/5ba544bfa44b62b9746aa9fd3fe1547a681144d0.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191957Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=06ce14425d8b29bee60e7bd997bff9abb5281c2164d00e7d8582eb8120e71156",
            "name": "Superpowered AI",
            "social_links": [
                "https://twitter.com/superpowered_ai",
                "https://github.com/SuperpoweredAI"
            ],
            "tags": [
                "artificial-intelligence"
            ],
            "team_size": "4.0",
            "website": "https://superpowered.ai",
            "ycpage": "https://www.ycombinator.com/companies/superpowered-ai"
        }
    },
    {
        "id": "phind",
        "score": 4.595678747,
        "metadata": {
            "batch": "S22",
            "description": "Phind is an AI search engine. It uses multi-step reasoning to find the best answer for your question and generative UI to present it in the most beautiful and interactive way.",
            "founded_date": "2022.0",
            "founder_1_description": "Co-founder & CEO at phind.com\nUT Austin Turing Scholar '22\nPreviously an undergrad NLP researcher, as well as ML at Lyft, Cloudflare, and Microsoft.",
            "founder_1_linkedin": "https://www.linkedin.com/in/michaelroyzen/",
            "founder_1_name": "Michael Royzen, Founder",
            "generated_description": "Phind is an innovative AI search engine founded in 2022, positioned as a company that leverages artificial intelligence to deliver precise answers through multi-step reasoning. With its headquarters in San Francisco and a lean team of just four employees, Phind aims to transform the search experience by using generative UI to present information in a visually stunning and interactive manner.\n\nHaving participated in Y Combinator's Batch S22, Phind has gained valuable mentorship and networking opportunities under the guidance of its Group Partner, Michael Seibel. The company's commitment to the realms of artificial intelligence, generative AI, and AI-assisted search positions it well within the tech ecosystem, especially in the bustling San Francisco Bay Area.\n\nEssentially, Phind is about making information accessible and engaging. It’s not just another search engine; it’s designed for those who seek depth and clarity in their inquiries, incorporating AI to sift through data intelligently. Their vision points towards an evolved search landscape, where understanding and presentation go hand in hand. If you want to learn more or try their service, you can visit their website at [phind.com](https://phind.com). Keep an eye on Phind; they’re one of those startups that could redefine how we approach searches in the digital age.",
            "headline": "AI search engine",
            "location": "San Francisco",
            "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/0e416df58c622768343d439b2e48936ab1453f0e.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191635Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=e23881531df0561ea4bfdec2e5963b84f03c6f17e2ea210f752bea6d3d1e2350",
            "name": "Phind",
            "social_links": [
                "https://www.linkedin.com/company/phindsearch",
                "https://twitter.com/phindsearch"
            ],
            "tags": [
                "artificial-intelligence"
            ],
            "team_size": "4.0",
            "website": "https://phind.com",
            "ycpage": "https://www.ycombinator.com/companies/phind"
        }
    },
    {
        "id": "undermind",
        "score": 4.537005635,
        "metadata": {
            "batch": "S24",
            "description": "At Undermind, we're building a search engine that can handle extremely complex questions. It’s geared at experts, like research scientists and doctors, who need to find very specific resources to solve high-stakes problems. \r\n\nWe’ve rebuilt search from the ground up to address this. Our new approach employs high-quality LLMs to adaptively explore a database, mimicking how a human researcher carefully discovers information. This approach dramatically outperforms (by 10-50x) traditional keyword search and other modern AI-based retrieval methods.\r\n\nOur first target users are the 50 million researchers searching for scientific literature on PubMed and Google Scholar every month. We’ve have users paying us $200-$500 per seat per year, from fields like medicine, ML, biotech, finance, and more.",
            "founded_date": "2023.0",
            "founder_1_description": "Josh is the co-founder and CEO at Undermind. He has research experience in gravitational-wave astrophysics (LIGO), particle physics (CERN), atomic physics, and quantum information science. He did his PhD at MIT studying quantum computing architecture design and inventing techniques for generating entangled multi-particle states using atom-light interactions, with 3 patents pending and 6 peer-reviewed publications.",
            "founder_1_linkedin": "https://linkedin.com/in/joshua-ramette-50984791",
            "founder_1_name": "Joshua Ramette, Founder",
            "founder_2_description": "Tom is the co-founder and CTO at Undermind. He studied physics at Princeton, then did his PhD in quantum physics at MIT. His thesis was recognized by the American Physical Society as one of the top 4 theses in the field of atomic physics in 2022, and he has published 10 papers in the field, including two in Nature and Science. Tom has deep expertise in building and deploying complex systems.",
            "founder_2_linkedin": "https://www.linkedin.com/in/thomas-hartke-229a0679/",
            "founder_2_name": "Tom Hartke, Founder",
            "generated_description": "**Company Overview: Undermind**\n\n**Mission**: Undermind aims to revolutionize scientific research with an AI agent that acts as a powerful assistant, enabling researchers, doctors, and other experts to navigate complex questions efficiently.\n\n**Foundation**: Founded in 2023, Undermind is a part of Y Combinator's Batch S24, situated in San Francisco, and currently operates with a small but agile team of two.\n\n**Innovation in Search**: Traditional keyword searches just don't cut it for serious researchers. This is where Undermind steps in. It has completely reimagined the search engine experience tailored specifically for high-stakes scientific inquiry. Using sophisticated large language models (LLMs), Undermind can search through vast databases, simulating a thorough, human-like research methodology. Unlike traditional tools, Undermind can deliver results that are **10-50 times more accurate**, helping researchers swiftly find precise resources.\n\n**Target Audience**: The platform primarily caters to the 50 million researchers who rely on resources like PubMed and Google Scholar each month, charging between $200 and $500 annually per user from fields such as medicine, machine learning, biotech, and finance.\n\n**User Experience**: Undermind's design allows researchers to interact with the AI as they would with a smart colleague. It deciphers complex topics, digging through hundreds of academic papers to unearth exactly what's needed. Users gain access to accurate results presented with contextual explanations, complemented by the ability to ask follow-up questions—ensuring a deep understanding of the material.\n\n**Testimonials**: Early users, like researchers from prestigious institutions such as MIT and Harvard, emphasize the high-powered synthesis algorithms that deliver timely, relevant insights, drastically improving their research workflows.\n\n**Critical Features**:\n- **Autonomous Research**: Undermind doesn’t just search; it performs an independent investigation into intricate topics, improving accuracy with every query.\n- **Database Coverage**: It pulls from the extensive Semantic Scholar database containing over 200 million articles, enveloping numerous fields of science.\n- **Time Efficiency**: While typical searches may yield quick results, Undermind invests a few minutes to meticulously analyze and present the most relevant information—a game-changer for serious investigations.\n\n**Founders' Background**: Built by two MIT PhDs with deep expertise in quantum physics and AI, Undermind is rooted in an understanding of the daunting challenges researchers face in sifting through vast amounts of literature.\n\n**Contact and Engagement**: For research professionals looking to streamline their literature search or gain insights at a new level, Undermind offers a free trial, encouraging them to experience firsthand how it can transform their research experience.\n\nIn a nutshell, if you're in the business of complex research, Undermind is your new go-to assistant—ready to empower you to conduct deeper, faster, and more precise scientific exploration. \n\n**Website**: Explore Undermind at [undermind.ai](https://www.undermind.ai).",
            "headline": "An AI agent for scientific research",
            "location": "San Francisco",
            "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/32eecc0df268b1e23bbd4ffb11e7d47a96bfb55f.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192035Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=70145454adef58a9d73869cffccdb13a0ffc668106cbb7a3ddb9d9f87ff02caa",
            "name": "Undermind",
            "social_links": [
                "https://www.linkedin.com/company/undermind-ai",
                "https://twitter.com/UndermindAI"
            ],
            "tags": [
                "artificial-intelligence"
            ],
            "team_size": "2.0",
            "website": "https://www.undermind.ai",
            "ycpage": "https://www.ycombinator.com/companies/undermind"
        }
    },
    {
        "id": "glimmer",
        "score": 4.49298665,
        "metadata": {
            "batch": "W24",
            "description": "Glimmer is a new way to search massive PDFs using AI.\r\n\nIf you've ever dealt with massive PDFs (i.e. over 1,000 pages), you know how broken search can be. You have no choice but to use “Cmd-F” and manually sift through thousands of search results to find specific information. Professionals in construction, law, finance, and healthcare spend hours doing this every day.\r\n\nGlimmer makes searching these large documents 10x easier. \r\n\nWhen you upload a PDF, Glimmer uses AI to intelligently index your documents. You can then search your PDF in natural language and get answers with verifiable page sources.\r\n\nYou can get started with Glimmer for free with any kind of PDF at withglimmer.com.",
            "founded_date": "2023.0",
            "founder_1_description": "Praneeth is the co-founder and CEO of Glimmer. Previously, he built computer vision widgets at Palantir and launched the first AI video editing tool for Facebook Reels at Meta. Praneeth graduated from UIUC with a computer science degree where where he and his co-founder built software for nonprofits together.",
            "founder_1_linkedin": "https://linkedin.com/in/praneethguduguntla",
            "founder_1_name": "Praneeth Guduguntla, Founder",
            "founder_2_description": "Arman is the co-founder and CTO of Glimmer. Previously, he worked on corporate cards at Mercury, the first-ever BNPL debit card at Affirm, and helped launch AWS's Heroku competitor, AppRunner. Arman studied Computer Science & Economics at UIUC. He spent most of his free time in college building software for nonprofits, and most of his free time in high school reselling sneakers and building an app that he sold to his high school.",
            "founder_2_linkedin": "https://linkedin.com/in/armanrafati",
            "founder_2_name": "Arman Rafati, Founder",
            "generated_description": "**Company Name:** Glimmer  \n**Founded:** 2023  \n**Location:** San Francisco  \n**Team Size:** 2 employees  \n**Backing:** Y Combinator (Batch W24)  \n**Website:** [withglimmer.com](https://www.withglimmer.com/)  \n\n---\n\n**Mission:**  \nGlimmer aims to revolutionize the way professionals search through massive PDFs, leveraging AI to make the process 10 times easier. \n\n**The Problem:**  \nIf you've ever dealt with PDFs that are longer than 1,000 pages—think legal documents, construction reports, or lengthy financial filings—you'll know that traditional search methods (like \"Cmd-F\") are woefully inadequate. Sifting through hundreds of search results to find that one critical piece of information is not only frustrating but wastes valuable time for professionals across various industries.\n\n**The Solution:**  \nGlimmer turns this tedious task into a breeze. By using advanced AI, it indexes your large PDFs intelligently. Users can upload a PDF, then search it using natural language, receiving precise answers that are linked back to their original pages. This not only saves time but also enhances the accuracy of the information retrieved.\n\n**Key Features:**\n- **Supports massive PDFs:** Glimmer can handle documents with over 10,000 pages.\n- **Fast search engine:** Results appear instantly as you type.\n- **Natural language processing:** Ask questions in normal language rather than syntax.\n- **Verification of sources:** Every answer includes a verifiable citation from the document, increasing trustworthiness.\n- **Robust document processing:** Identifies sections, parses tables, and optimizes search latency.\n\n**Current Focus:**  \nGlimmer's biggest expense in 2023 has been marketing and advertising, emphasizing a strategic push to grow its market presence and reach potential users who spend hours navigating through extensive PDFs.\n\n**Why It Stands Out:**  \nGlimmer is currently the only tool specifically designed for AI search on extensive files, making it a unique player in the tech landscape. It combines accuracy with user-friendly operation, pushing the boundaries of what's possible with document search.\n\nIf you're ready to save hours of searching, you can [get started for free](https://www.withglimmer.com/) or try their interactive demo to see Glimmer in action.",
            "headline": "AI search for massive PDFs",
            "location": "San Francisco",
            "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/0dd9de2fe8b936d8f8ddae0fb4a106b40c06e8b4.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191359Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=fee93deabdfb24bcb54a636a7f25dcc8867e62a7a1e580ffc9f3ddcbb295a5e4",
            "name": "Glimmer",
            "social_links": [
                "https://www.linkedin.com/company/98872753/admin/feed/posts/"
            ],
            "tags": [
                "search"
            ],
            "team_size": "2.0",
            "website": "https://www.withglimmer.com/",
            "ycpage": "https://www.ycombinator.com/companies/glimmer"
        }
    },
    {
        "id": "medisearch",
        "score": 3.4301270829999995,
        "metadata": {
            "batch": "S23",
            "description": "MediSearch gives direct answers to medical questions based on trustworthy sources.",
            "founded_date": "2023.0",
            "founder_1_description": "Working on giving people instant answers to health questions with https://medisearch.io.",
            "founder_1_linkedin": "https://www.linkedin.com/in/eduard-oravkin-7637b420b/",
            "founder_1_name": "Eduard Oravkin, Founder",
            "founder_2_description": "I am an Imperial & Cambridge CS grad with ML research experience from Waymo, Google Brain, and Facebook AI. These days I'm trying to make the world a better place one medical question at a time.",
            "founder_2_linkedin": "https://linkedin.com/in/michal-pandy",
            "founder_2_name": "Michal Pándy, Founder",
            "generated_description": "**MediSearch: A Beacon of Trustworthy Medical Information**\n\nFounded in 2023 and part of Y Combinator’s Batch S23, MediSearch is on a mission to be your reliable search engine for medical inquiries. Based in London, UK, this dynamic startup is a compact team of four, driven by the belief that everyone deserves access to trustworthy health information.\n\nMediSearch was born from the need for direct, science-based answers to pressing medical questions. It utilizes artificial intelligence and generative AI technologies to sift through vast amounts of data and provide clear, concise responses drawn from credible sources. Whether you’re curious about the benefits of coffee or the potential side effects of vaccines, MediSearch aims to deliver evidence-based insights.\n\nTheir web platform offers an array of features, including the ability to filter both common and complex medical queries. For example, users can explore questions like “Does sport increase life expectancy?” or “What is the probability of blood clots after surgery?” with just a few clicks. \n\nMediSearch is particularly relevant today, as misinformation in healthcare can have serious consequences. The company maintains that while their tool is an excellent resource for information, it doesn’t replace professional medical advice. \n\nYou can find them online at [medisearch.io](https://medisearch.io), where they also provide an app for on-the-go access to trustworthy health information. The company is tagged under several categories, including artificial intelligence, consumer health services, and digital health, underscoring their innovative approach to healthcare solutions. \n\nIn summary, MediSearch is setting out to empower users with reliable medical knowledge, striving to enhance the way individuals seek answers in healthcare. If you're looking for clarity in a world awash with conflicting health information, MediSearch could just be what you need.",
            "headline": "Search engine for trustworthy medical information.",
            "location": "London, United Kingdom",
            "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/fe26cb16573954a39bf39fd2f10498de3a189219.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191529Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=ca4007ea34439158e758efee551007ccb18d09417241599795c9f6102deeb329",
            "name": "MediSearch",
            "social_links": [
                "https://www.linkedin.com/company/medisearchio",
                "https://twitter.com/medi_search"
            ],
            "tags": [
                "artificial-intelligence"
            ],
            "team_size": "4.0",
            "website": "https://medisearch.io",
            "ycpage": "https://www.ycombinator.com/companies/medisearch"
        }
    },
    {
        "id": "capitol-ai",
        "score": 3.413331896,
        "metadata": {
            "batch": "S24",
            "description": "As Perplexity or Gemini replaces the Google Search we all use today, it will remove the need to ever visit a website. This is an existential risk to all media brands, which is why Capitol went from zero to $1.68M in revenue during YC: all media companies need to offer THEIR OWN Perplexity-like experience to maintain their direct relationship with customers. The most trusted brand in political news and analysis, Politico, chose us to power their Politico Pro Subscription product.\r\n\nConsumers expect instant personalized answers. Publishers won’t build this on their own.\r\n\nCapitol’s API lights up publishers' websites and apps so their end users can generate personalized search results, cited research reports, and even tweet storms using the publisher’s proprietary data—all within their paywall. \r\n\nCapitol is the new last mile of content delivery for publishing. This market is $16b in 2023, and will grow to $85.6b in 2030.\r\n\nGemini and Perplexity are the imperial forces. Capitol is arming the rebels.",
            "founded_date": "2021.0",
            "founder_1_description": "Shaun Modi is the founder and CEO of Capitol AI, an infinitely smart research assistant that instantly generates high-quality content from your documents. One of the founding designers of Airbnb, Shaun has been named one of Business Insider’s Top 75 Designers in Technology. Shaun has designed software products for technology giants, the government, and its agencies, including Google, the White House, DoD, NASA, CDC, and Motorola. At Airbnb, Shaun worked side by side with CEO Brian Chesky.",
            "founder_1_linkedin": "https://www.linkedin.com/in/shaunmodi/",
            "founder_1_name": "Shaun Modi, Founder & CEO",
            "founder_2_description": "Software engineer and technical manager with a product mindset. Two decades of experience, including IC and Director positions in academia, venture backed startups, and the US Federal Government.",
            "founder_2_linkedin": "https://www.linkedin.com/in/tomhallaran/",
            "founder_2_name": "thomas hallaran, Founder",
            "generated_description": "**Capitol AI: Revolutionizing Content Delivery**\n\nFounded in 2021 and based in Washington, DC, Capitol AI is on a mission to create a “custom perplexity” solution for every website in the world. Initially launching as As Perplexity or Gemini—innovative tools aiming to replace traditional Google searches—Capitol AI is addressing a looming existential threat faced by media brands. By offering a sophisticated API, Capitol empowers publishers to deliver personalized search results, research reports, and even social media content all within their paywalls, thereby enhancing their relationship with users.\n\nCapitol AI experienced rapid growth, generating $1.68 million in revenue during its time at Y Combinator. It became a vital partner for Politico, helping power their Politico Pro Subscription product, and positioned itself directly in the fight against generic search engines that strip publishers of direct customer engagement. \n\nThe demand for instant, personalized answers has never been higher, and Capitol aims to bridge the gap where publishers can't—or won't—develop these capabilities on their own. With an expansive market currently valued at $16 billion, projected to grow to $85.6 billion by 2030, Capitol AI is poised to become the critical last mile of content delivery for publishers. \n\nWith a lean team of 11 and under the guidance of Y Combinator Group Partner Garry Tan, Capitol AI is tagged in fields like artificial intelligence, workflow automation, analytics, and media. They are armed and ready; while Gemini and Perplexity may dominate the landscape, Capitol is empowering the rebellion of content creators.\n\nFor more about Capitol AI and their offerings, you can visit their website at [capitol.ai](https://www.capitol.ai/).",
            "headline": "Capitol is a custom perplexity for every website in the world.",
            "location": "Washington, DC",
            "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/bebcfbbaa96f9693f2a4c94fe16594ce6881031b.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191040Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=b4de9460738795a21bbaceb6d2ff72683460480f499c6f85c9685b560bcb024b",
            "name": "Capitol AI",
            "social_links": [
                "https://www.linkedin.com/company/capitolai/",
                "https://x.com/usecapitol"
            ],
            "tags": [
                "ai-enhanced-learning"
            ],
            "team_size": "11.0",
            "website": "https://www.capitol.ai/",
            "ycpage": "https://www.ycombinator.com/companies/capitol-ai"
        }
    },
    {
        "id": "happenstance",
        "score": 3.153509469,
        "metadata": {
            "batch": "W24",
            "description": "Happenstance is people search powered by AI.\r\n\nFor example, you ask Happenstance \"find people who work on notification systems at big companies\", and it comes back with two who follow you on Twitter and five who are connected to your partners. That kind of thing you just can't do on LinkedIn.",
            "founded_date": "2023.0",
            "founder_1_description": "Angel investor & AI advisor\nCofounder Lighthouse AI :: \"Best AI Camera\" - Gizmodo\nStanford CS PhD :: Perception systems for self-driving cars",
            "founder_1_linkedin": "https://linkedin.com/in/alexteichman",
            "founder_1_name": "Alex Teichman, Founder",
            "generated_description": "**Happenstance: Revolutionizing People Search with AI**\n\nFounded in 2023 and hailing from the Y Combinator Batch W24, Happenstance is a fresh player in the realm of artificial intelligence, seeking to redefine how we connect with people. Its mission? To power people searches like never before.\n\nAt its core, Happenstance enables users to ask tailored questions, such as \"find people who work on notification systems at big companies,\" and receive curated results that spotlight connections within their networks. Already, you could discover two individuals who follow you on Twitter and five more linked to your partners—insights you won't find on traditional platforms like LinkedIn.\n\n**How It Works:**\n1. **Connect Accounts**: Start by linking your Gmail, LinkedIn, and Twitter.\n2. **Invite Friends**: Expand your search potential by inviting others to do the same.\n3. **Search**: Tap into the collective reach of your network and your friends' networks to find exactly who you're looking for.\n\nHappenstance thrives on collaboration and is designed to facilitate meaningful connections. Whether you’re searching for experts in 3D computer vision or climate-focused angel investors, the platform makes it much easier to uncover talent in your extended network.\n\nOperating from a compact yet agile team of three, led by visionary CEO Alex, Happenstance is supported by notable partners including Garry Tan. The company is located in Nashville, Texas, and has already gained traction with investors, growing its brand significantly.\n\n**Why Happenstance Matters:**\nIn a world where establishing connections can often feel like navigating a labyrinth, Happenstance stands out as a beacon of efficiency—utilizing AI to foster serendipity and build the future. It's not just about finding people; it’s about creating luck for teams that can leverage these connections effectively.\n\nIf you’re curious about trying Happenstance, you can find more information or sign up at [happenstance.ai](https://happenstance.ai). \n\nSo, whether you're a recruiter, entrepreneur, or just someone looking to expand your network, Happenstance promises to make your search not only easier but also more insightful. After all, in today's hyper-connected world, who you know can often be just as important as what you know.",
            "headline": "People search powered by AI",
            "location": "None",
            "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/b783fa920aa40edfb19abc0acae7dbd48614463f.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191411Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=27b75a7e0e08f2538abb141d0e4fa9840f1c91def11be6780261d0c31905c58e",
            "name": "Happenstance",
            "social_links": [],
            "tags": [
                "artificial-intelligence"
            ],
            "team_size": "3.0",
            "website": "https://happenstance.ai",
            "ycpage": "https://www.ycombinator.com/companies/happenstance"
        }
    },
    {
        "id": "aiflow",
        "score": 2.528094619,
        "metadata": {
            "batch": "W23",
            "description": "AiFlow Powers Executive Search and Board Advisory at the Speed of AI. In today's competitive landscape, quickly delivering exceptional candidates is essential for building long term partnerships with clients. AiFlow empowers your firm to exceed expectations through the power of artificial intelligence. Our AI possesses unparalleled insights into C-level and board candidates, enabling search firms to deliver the absolute highest quality candidates at unprecedented speeds.",
            "founded_date": "2022.0",
            "founder_1_description": "Nick Manske is the CEO & co-founder of AiFlow, a specialized CRM platform designed for executive recruiting firms. Prior to his role at AiFlow, Nick co-founded and served as CTO at Alariss Global, a VC-backed startup using NLP to match overseas SaaS companies with American salespeople. Prior to startup life, Nick served as a U.S. diplomat in technology & economic affairs in three different countries. Nick did his studies at Harvard College and INSEAD.",
            "founder_1_linkedin": "https://www.linkedin.com/in/nicholas-manske/",
            "founder_1_name": "Nicholas Manske, Founder",
            "founder_2_description": "Trained under one of the creators of OpenAI's GPT - the leading AI model today - Josh Gardner is a Princeton-educated computer scientist. Josh's research has been published in top journals and helped him secure a spot as an engineering leader at Alariss Global upon completing graduate school. At Alariss, Josh spearheaded the design and creation of a state of the art AI applicant tracking system, leading an 8 person engineering team. Josh's understanding of cutting edge AI research and experience",
            "founder_2_linkedin": "None",
            "founder_2_name": "Josh Gardner, Founder",
            "generated_description": "**AiFlow: Revolutionizing Executive Search with AI**\n\nFounded in 2022 and based in the heart of San Francisco, AiFlow is a startup that’s taking the complexities out of executive recruitment—especially for C-suite positions—through the power of artificial intelligence. Initially launched as AiFlow Powers Executive Search and Board Advisory, the company quickly recognized that speed and quality in candidate identification are crucial in today’s competitive landscape.\n\n### Why AiFlow Matters\nAt its core, AiFlow is on a mission to provide AI-based candidate identification specifically tailored for the C-Suite. With an emphasis on private equity-supported firms, the platform aggregates data on top executives from successful businesses, from CEOs to CFOs, allowing recruitment firms to exceed client expectations like never before.\n\nThe company operates with a small but mighty team of just two employees, co-founders Nick Manske and Josh Gardner, both of whom bring deep expertise in technology and executive search. They’ve created an environment where AI performs research and market mapping with a speed and accuracy that outpaces manual methods.\n\n### Key Features\n- **Curated Database**: AiFlow offers a compilation of CEOs, CFOs, and executives from leading private equity firms, equipped with functionality to narrow search results by various criteria such as industry, location, and specific roles.\n- **Real-Time Updates**: Recruiters can quickly identify executives who are currently open to new roles, facilitating timely engagements.\n- **Granular Filtering**: The platform allows for focused searches based on deal size and functional expertise, ensuring users find the right fit without sifting through unqualified candidates.\n- **Deep Intelligence**: With the ability to analyze and interpret vast amounts of data, AiFlow can inform recruiters about executive backgrounds and suitability faster than any human effort.\n\n### Security and Customization\nTrust is paramount in executive search. AiFlow is SOC II Type 1 certified and implements robust data protection measures, ensuring all client information remains secure. Plus, the platform is highly customizable to meet the enterprise needs of its clients, ensuring tailored solutions that fit specific requirements.\n\n### Built by Experts\nThe founding team includes:\n- **Nick Manske** (Co-Founder & CEO): An experienced technologist with a background in international executive search platforms, Nick has a history of building and managing tech teams effectively.\n- **Josh Gardner** (Co-Founder & CTO): A Princeton-educated specialist in AI and machine learning, Josh has previously led engineering teams in developing cutting-edge recruitment technologies.\n\n### Backed by Y Combinator\nAiFlow is part of Y Combinator’s Batch W23, providing it with additional mentorship and support from one of the most prestigious startup accelerators in the world.\n\nIn summary, AiFlow is tackling the age-old pain point of finding and engaging high-quality executive talent with an innovative, data-driven approach. If you're looking to elevate your recruiting processes, this platform might just be the game changer you've been waiting for.\n\nFor more information, visit [AiFlow](https://aiflow.solutions).",
            "headline": "AI-Based Candidate Identification for the C-Suite",
            "location": "San Francisco",
            "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/e38821a3ecded2b3116dd7254a708789d8ca6944.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T190948Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=d6fa4ba195bbc0c9db1df843473fc0991e4e468ece153ccb72d6a3084c95810d",
            "name": "AiFlow",
            "social_links": [
                "https://www.linkedin.com/company/aiflow-inc",
                "https://twitter.com/aiflow_inc",
                "https://www.crunchbase.com/organization/aiflow"
            ],
            "tags": [
                "generative-ai"
            ],
            "team_size": "2.0",
            "website": "https://aiflow.solutions",
            "ycpage": "https://www.ycombinator.com/companies/aiflow"
        }
    },
    {
        "id": "sciphi",
        "score": 2.066591173,
        "metadata": {
            "batch": "W24",
            "description": "Start your AI application with agentic RAG, ingestion, document management, and more.",
            "founded_date": "2023.0",
            "founder_1_description": "2nd YC Founder, prev @ Algofi,\nFormer quant @ Citadel,\nPhD in Particle Physics, research @ CERN (UCSB, 2019).",
            "founder_1_linkedin": "https://linkedin.com/in/owencolegrove",
            "founder_1_name": "Owen Colegrove, Founder",
            "generated_description": "**SciPhi: Pioneering Advanced AI Retrieval**\n\nWelcome to SciPhi, a fresh face in the vibrant tech scene, founded in 2023 and already making waves as part of Y Combinator Batch W24. Situated in San Francisco and comprised of just two sharp minds, SciPhi is on a mission to redefine how we interact with data and AI through its groundbreaking retrieval system, known as R2R.\n\n### What’s the Buzz About?\n\nSciPhi emerged with a clear focus: to create the most advanced Retrieval-Augmented Generation (RAG) system on the market. This isn’t just tech jargon; R2R is designed to bridge the gap from RAG prototypes to robust production environments. By tackling challenges related to infrastructure, retrieval speed, and scalability, they aim to empower enterprises to build reliable, context-aware AI applications. \n\n### Enterprise Solutions at Your Fingertips\n\nThe team at SciPhi understands the need for effective data management in today’s AI-driven world. Their platform promises quick document ingestion—handling over 40 formats ranging from PDFs to audio files—and advanced document intelligence, which automatically uncovers hidden relationships within your data through knowledge graphs. They focus on three core features:\n\n1. **Universal Document Processing**: Process millions of documents swiftly. \n2. **Enterprise Access Control**: Secure document sharing with detailed permission settings, making collaboration seamless.\n3. **Advanced Document Intelligence**: Enrich context and automate insights extraction, turning raw data into actionable knowledge.\n\n### Why SciPhi Stands Out\n\nBacked by Dalton Caldwell as their Group Partner, and a strong emphasis on developer-friendliness, SciPhi is crafted with real-world applications in mind. Their R2R API simplifies the deployment and scaling of RAG pipelines, offering a streamlined setup that reduces traditional configuration time to mere minutes.\n\nWith a commitment to improving accuracy through their HybridRAG technology, which combines knowledge graphs and vector retrieval, SciPhi has marked impressive performance stats, like significant reductions in setup time and costs—a no-brainer for enterprises scrambling to optimize their workflows.\n\n### Join the Revolution\n\nAs they continue to make strides in AI infrastructure and document management, SciPhi invites you to transform your AI projects. Whether you're looking to accelerate your data management or capsize traditional RAG frameworks, SciPhi's tools promise to redefine your approach to AI workflows. \n\nCurious to see what SciPhi can do for your next project? Visit [SciPhi.ai](https://www.sciphi.ai) to learn more or schedule a demo and step into the future of intelligent retrieval. \n\nIn a space getting increasingly crowded with competitors, SciPhi isn't just another startup—it's a visionary outfit ready to lead us into a new era of AI-powered data management.",
            "headline": "SciPhi is building R2R, the most advanced retrieval system.",
            "location": "San Francisco",
            "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/f389ad4ea421234cf66ef4cf37e4cbd82b0ccd9e.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191911Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=e14c443e1a663e3c396506b9dc14817bdf7692cc3a97501610074576c8c168af",
            "name": "SciPhi",
            "social_links": [
                "https://www.linkedin.com/company/sciphi-ai/",
                "https://github.com/SciPhi-AI"
            ],
            "tags": [
                "artificial-intelligence"
            ],
            "team_size": "2.0",
            "website": "https://www.sciphi.ai",
            "ycpage": "https://www.ycombinator.com/companies/sciphi"
        }
    },
    {
        "id": "anglera",
        "score": 1.042400479,
        "metadata": {
            "batch": "S24",
            "description": "At Anglera, we're developing a suite of AI agents to help e-commerce companies run their operations more efficiently. Our flagship agent helps our customers onboard, enrich, and manage their product data, reducing time per product from 15 mins down to 5 seconds.\r\n\nWe previously developed ML to automatically enrich millions of products at Uber Eats, and we're now on a mission to automate the most common manual workflows for every e-commerce business.",
            "founded_date": "2024.0",
            "founder_1_description": "Amay is the Co-Founder of Anglera. \nHe graduated from Stanford with Bachelor's & Master's degrees, specializing in AI/ML.\nPreviously, he led Catalog AI efforts to onboard, enrich, & standardize millions of products sold on Uber Eats.",
            "founder_1_linkedin": "https://www.linkedin.com/in/amayaggarwal/",
            "founder_1_name": "Amay Aggarwal, Founder",
            "founder_2_description": "Ray is the Co-Founder of Anglera. He graduated from Stanford with a BS and MS in Computer Science, specializing in Systems & AI. Previously, he launched the first CPG Ads products at Uber Eats, and worked in engineering roles at Meta, Verkada, & Microsoft.",
            "founder_2_linkedin": "https://www.linkedin.com/in/~iyer",
            "founder_2_name": "Ray Iyer, Founder",
            "generated_description": "**Company Overview: Anglera**\n\nAnglera is an exciting startup founded in 2024, based in San Francisco, and part of Y Combinator's Batch S24. With a razor-sharp focus on e-commerce, Anglera is on a mission to revolutionize merchandising through the power of AI. Imagine reducing the average time it takes to onboard and manage product data from 15 minutes to just 5 seconds—sounds almost magical, doesn’t it? That’s what Anglera is all about.\n\n**Mission Statement**\n\nAt its core, Anglera’s mission is to be the AI copilot for merchandising. Their goal? To automate and streamline the most common manual workflows in e-commerce, allowing businesses to operate more efficiently and effectively.\n\n**Innovative Solutions**\n\nAnglera has developed a suite of AI agents designed to tackle the complexities of e-commerce operations. Their flagship product enables seamless onboarding, enriching, and managing of product catalogs. Just a few features that make Anglera stand out include:\n\n- **Supplier Onboarding:** Simplifying the transformation of messy product data into structured attributes.\n- **Detailed Metadata Management:** Ensuring that product information is always complete, accurate, and up to date.\n- **Pricing Intelligence:** Analyzing competitors’ pricing in real time to help e-commerce businesses stay competitive.\n- **Trend Analysis and Image Processing:** Allowing businesses to maintain quality and relevancy in their product offerings.\n- **Listing Optimization:** Helping products rank better and convert more efficiently.\n\nIn just a short time, Anglera has curated over 500,000 products and saved their customers an impressive 25,000+ hours. The testimonials from happy clients echo the impact of Anglera’s solutions—transforming tedious processes into near-instantaneous actions.\n\n**Team and Backing**\n\nWith a lean team of two and Aaron Epstein as their Group Partner, Anglera may be small but packs a punch. The company is backed by Y Combinator, which lends significant credence to its potential in the competitive e-commerce landscape.\n\n**Conclusion**\n\nAnglera is not just another tech startup; it's a game-changer for e-commerce. By leveraging AI to automate complex tasks, they're helping businesses save time and money while enhancing the overall shopping experience. For e-commerce companies looking to streamline their operations, Anglera is definitely worth watching. Want to see the magic for yourself? You can [book a demo](https://www.anglera.com/<https:/calendly.com/amay-anglera/15-min>) and experience their AI-powered solutions firsthand at [Anglera's website](https://www.anglera.com/).",
            "headline": "AI Copilot for Merchandising",
            "location": "San Francisco",
            "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/861ee07f24c09c2cf2de6ffd6358f21d832acf81.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T190958Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=bfdeb27eb218d39d2b02ee96e7eea3713439eb0aee76cd721d9323ea58e397a9",
            "name": "Anglera",
            "social_links": [
                "https://www.linkedin.com/company/anglera/",
                "https://www.crunchbase.com/organization/anglera"
            ],
            "tags": [
                "artificial-intelligence"
            ],
            "team_size": "2.0",
            "website": "https://www.anglera.com/",
            "ycpage": "https://www.ycombinator.com/companies/anglera"
        }
    },
    {
        "id": "curatle",
        "score": 1.0198715630000001,
        "metadata": {
            "batch": "S23",
            "description": "Find products through real user recommendations and get all links and prices across all e-commerce stores.\r\n\nhttps://curatle.com",
            "founded_date": "2023.0",
            "founder_1_description": "Founder at curatle.com",
            "founder_1_linkedin": "https://linkedin.com/in/timjang3",
            "founder_1_name": "Tim Jang, Founder",
            "generated_description": "Curatle is shaking up the e-commerce world in a smart way. Launched in 2023 and nestled in Irvine, CA, this innovative startup operates as an AI product search engine. It began its journey by helping users discover products through genuine recommendations from real people, gathering links and prices from various e-commerce platforms—all designed to save you time and effort.\n\nAs part of Y Combinator's Summer 2023 batch, Curatle is grabbing attention with a straightforward mission: make product discovery easier and more reliable. That's not just marketing speak; they deliver tangible solutions. Think of it as your personal shopping assistant that compiles the best options available online based on user insights.\n\nAt its core, Curatle caters to a range of shopping needs through interactive features designed to engage users. You can search for anything—from the best mineral sunscreen to custom keyboards—while benefiting from access to price matching and a unique product builder that lets you create your ideal setups across categories like skincare and gaming PCs. \n\nDespite having a lean team of just one, Curatle is under the guidance of Group Partner Aaron Epstein, signaling a commitment to quality and growth. The company is tagged with important themes like artificial intelligence, consumer goods, and search technologies, making it part of a rapidly evolving marketplace.\n\nSo, if you’re in the market for something specific or just curious about what’s out there, Curatle is geared to help you nail down the best options with ease. Check it out at [Curatle.com](https://curatle.com) and see what all the fuss is about!",
            "headline": "AI product search engine",
            "location": "Irvine, CA",
            "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/734e84a121678fcba7ac5d338ef2811d29fff582.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191109Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=ff1498a6e63d09c644803266b25a6b2aa2a7d6e1c638ab5070ded7ae481747f2",
            "name": "Curatle",
            "social_links": [],
            "tags": [
                "artificial-intelligence"
            ],
            "team_size": "1.0",
            "website": "https://curatle.com",
            "ycpage": "https://www.ycombinator.com/companies/curatle"
        }
    },
    {
        "id": "directed-edge",
        "score": 1.002542555,
        "metadata": {
            "batch": "S09",
            "description": "Directed Edge delivers Amazon-like \"People who bought this also bought...\" and \"We think you'd also like\"-style recommendations to other sites, using existing data being collected such as purchase or click histories. Recommendations are served in real-time via a REST API, with language bindings in several programming languages to make integration easy.",
            "founded_date": "None",
            "generated_description": "**Directed Edge Overview**\n\nDirected Edge, a tech startup based in San Francisco, aims to transform e-commerce with its advanced product recommendation services. Think of those \"People who bought this also bought...\" suggestions you see on sites like Amazon—Directed Edge brings that capability to your online store through a seamless integration.\n\n**Mission Statement**  \nAt its core, Directed Edge focuses on delivering precise product recommendations to enhance the shopping experience. Their technology analyzes existing purchase and click histories in real-time, offering insightful suggestions that foster increased sales and customer engagement.\n\n**Background**  \nFounded during Y Combinator's Summer 2009 batch, Directed Edge is a nimble team of just two employees. This startup ethos reflects its innovative drive and capacity to adapt quickly in a dynamic tech landscape.\n\n**Product Features**  \nDirected Edge’s primary product is a plugin for Shopify, where it has been remarkably successful, currently delivering over half a million recommendations per day. Here’s a glimpse of what their recommendation system offers:\n\n- **Related Products:** Suggests items that are commonly paired with the product a customer views.\n- **Shopping Cart Recommendations:** Offers suggestions based on the contents of a customer’s shopping cart.\n- **Product Bundles:** Shows potential bundles of products available for a single purchase.\n- **Personalized Recommendations:** Tailors suggestions for returning customers based on their previous interactions.\n- **Top Products:** Highlights the most popular items in the user's shop.\n- **Recently Viewed Products:** Keeps track of items a customer has viewed recently for quick reference.\n- **Transactional Email Recommendations:** Incorporates recommendations into order and shipping confirmation emails.\n\n**Additional Features**  \nIn addition to its core offerings, Directed Edge allows businesses to customize their recommendations through features like an advanced hand-picker for manually selecting products, business rule creations for tailored suggestions, and a CSV importer/exporter that simplifies the transfer of external data into their system.\n\n**Why It Matters**  \nAt a time when e-commerce is saturated with options, effectively curating product suggestions can make or break customer experiences. Directed Edge’s approach leverages the power of artificial intelligence and machine learning to create a personal touch that retailers need to stand out.\n\n**Key Takeaway**  \nFor businesses looking to harness the potential of AI-driven recommendations, Directed Edge provides a robust solution that promises not just to enhance sales, but also to improve customer satisfaction. Their integration simplicity and advanced features keep them at the forefront of e-commerce innovation.\n\nIf you're interested in elevating your online store’s performance, check out their services at [Directed Edge](http://directededge.com) or find them on the Shopify App Store.",
            "headline": "Product recommendations.",
            "location": "San Francisco",
            "logo": "/logos/medium/missing.png",
            "name": "Directed Edge",
            "social_links": [
                "https://www.crunchbase.com/organization/directed-edge",
                "https://github.com/directededge"
            ],
            "tags": [
                "artificial-intelligence"
            ],
            "team_size": "2.0",
            "website": "http://directededge.com",
            "ycpage": "https://www.ycombinator.com/companies/directed-edge"
        }
    },
    {
        "id": "depict",
        "score": 1.019564062,
        "metadata": {
            "batch": "S20",
            "description": "None",
            "founded_date": "2019.0",
            "generated_description": "**Depict: Revolutionizing Fashion E-commerce Merchandising**\n\nFounded in 2019 and hailing from Stockholm, Sweden, Depict is quickly making waves in the fashion e-commerce space. As part of the Y Combinator Batch S20, it brings a fresh perspective on how brands can present their collections online. With a dynamic team of 32, led under the guidance of Group Partner Gustaf Alstromer, Depict is on a mission to enhance merchandising for fashion-focused online retailers.\n\nTheir platform stands out by enabling e-commerce brands to create visually engaging collection pages that encourage customer interaction. Depict simplifies the process of curating storefronts, allowing retailers to enhance product discovery by over 25%. This is not just a theoretical promise; brands that adopt Depict see significant improvements in how shoppers engage with their offerings.\n\nThe company is tagged as a player in the fields of personalization, e-commerce, and fashion – three areas where they excel by not only improving aesthetics but also backing up their solutions with robust data. Depict allows users to:\n\n1. **Create Smart Editorial Grids**: These grids render collections in a way that captivates visitors and encourages them to explore further.\n2. **Drag-and-Drop Functionality**: Merchandising becomes a breeze with an intuitive interface that makes layout changes seamless and instant.\n3. **Visual Content Integration**: Brands can add videos and images to their product grids, transforming static display into rich storytelling that resonates with customers.\n4. **Automated and Manual Sorting Options**: Retailers can set sorting rules based on tags or dynamically adjust which products get highlighted based on stock and sales data.\n\nWith endorsements from various fashion brands, including KOTN and CLDP, Depict is proving to be a game-changer. Retailers using the app have reported up to 40% time savings in their merchandising efforts, along with enhanced efficiency in workflow processes.\n\nTheir approach is particularly relevant in today's market, where the storefront competition is fierce, and standing out is critical. By focusing on the user experience, Depict ensures that even small e-commerce players can compete with larger brands.\n\nIf you’re looking to supercharge your fashion e-commerce business, consider exploring what Depict has to offer. Their platform is not just about selling products; it's about creating a shopping experience that captivates and converts.\n\nFor more information, visit their website at [Depict AI](https://depict.ai/).",
            "headline": "Merchandising for fashion e-commerce",
            "location": "Stockholm, Sweden",
            "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/1b91942bfa2126f7666a7d7761859330a54739a0.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191118Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=8eb787dbfbbf3cf5da520a63ba67567496b04b215737bb43bd91b7b4547f8704",
            "name": "Depict",
            "social_links": [
                "https://www.linkedin.com/company/depict-ai/"
            ],
            "tags": [
                "personalization"
            ],
            "team_size": "32.0",
            "website": "https://depict.ai/",
            "ycpage": "https://www.ycombinator.com/companies/depict"
        }
    },
    {
        "id": "ai-sell",
        "score": 0.995523036,
        "metadata": {
            "batch": "S24",
            "description": "We're building AI Sales Associates for eCommerce. Imagine going on nike.com and facetiming an AI Lebron James and getting his advice on which his shoes to buy. Traditional brick-and-mortar retail stores rely on sales associates to provide personalized customer service, guide product discovery and close sales, but it's always been too expensive and unscaleable for online stores. We're building video-based AI agents that are experts in their products and can gently steer customers to a purchase, delighting customers and lifting conversion/AOV.\r\n\nJerry and Jeffrey are brothers who previously worked together to scale The Coding School to a 6mil+ in revenue. Jerry built software to help run the 50+ Shopify brands that Openstore acquired more profitably and efficiently. He was also an engineer at Flexport and Google.\r\n\nJeffrey previously worked at DRW as a quant trader, and as an engineer at Facebook, Snowflake and Amazon.",
            "founded_date": "2024.0",
            "founder_1_description": "CEO/Cofounder @ AI Sell. Excited to build on my work at Openstore where I built software to run 50+ Shopify brands more profitably. Also worked on payments at Flexport and ads at Google. Was CTO of The Coding School, a nonprofit that raised 6m+ from Google/IBM/Department of Defense. CS @ Duke.",
            "founder_1_linkedin": "https://linkedin.com/in/jerryzliu",
            "founder_1_name": "Jerry Liu, Cofounder, CEO",
            "generated_description": "**AI Sell: Revolutionizing E-Commerce with AI Sales Associates**\n\nAI Sell is an innovative startup with a clear mission: to create AI Sales Associates specifically designed for eCommerce. Imagine visiting a site like Nike.com and having the chance to FaceTime with an AI version of LeBron James for personalized shoe advice. This vision reflects the core of AI Sell’s approach—providing customers with engaging and tailored shopping experiences that traditional brick-and-mortar retailers have long depended on, but in a scalable online format.\n\nFounded in 2024, AI Sell emerged from the minds of brothers Jerry and Jeffrey, who bring a wealth of experience to the table. Previously, they scaled The Coding School to over $6 million in revenue. Jerry, with a solid background in software engineering from places like Flexport and Google, developed tools to help manage multiple Shopify brands for Openstore more effectively. Jeffrey complements this with his experience as a quant trader at DRW and roles at giants such as Facebook, Snowflake, and Amazon. Together, they harness their diverse skills to tackle the challenge of personalized service in eCommerce.\n\nOperating out of San Francisco and currently part of Y Combinator's Batch S24, AI Sell is small but mighty, with a team of just two employees. Their Group Partner is Jared Friedman, who adds invaluable guidance and mentorship.\n\nIn an industry where sales and customer experiences are crucial, AI Sell is poised to innovate the way consumers interact with online shopping. By combining video technology with AI expertise, they hope to not just improve conversion rates but also enhance overall customer satisfaction through a delightful shopping journey.\n\nFor more information and to keep an eye on their progress, visit their website at [AI Sell](https://www.aisell.com). \n\n**Tags:** Sales, E-commerce, AI, San Francisco Bay Area.",
            "headline": "AI Sales Associate for Ecommerce",
            "location": "San Francisco",
            "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/6aa2a822648a1ff67cad183ec8604adee4b59b5a.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T190951Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=0e7091ac5f2c798f9051252eab0a26cce85b17c449c7ce0b8796c54454455e1f",
            "name": "AI Sell",
            "social_links": [
                "https://www.linkedin.com/company/104935678"
            ],
            "tags": [
                "sales"
            ],
            "team_size": "2.0",
            "website": "https://www.aisell.com",
            "ycpage": "https://www.ycombinator.com/companies/ai-sell"
        }
    },
    {
        "id": "operand",
        "score": 0.97664246,
        "metadata": {
            "batch": "W25",
            "description": "Operand is building an AI to replace traditional consulting. We help businesses make better decisions by deeply analyzing their data across all sources—something consultants can’t do at scale.\r\n\nWe’re starting in e-commerce and retail, where the businesses’ high data density and real-time feedback loops allow us to show impact fast. Our first capability is pricing and discount strategy. Operand considers everything—competitor pricing, ad strategy, inventory, and more—to ensure businesses maximize profit.\r\n\nAnd unlike other AI solutions, every Operand result is verified by human experts, including ex-MBB consultants, so you get actual impact, not just AI hype.\r\n\nWe’re already generating 6-figure P&L improvements for early customers.",
            "founded_date": "2024.0",
            "founder_1_description": "Dartmouth drop-out, CS & Math major. Formerly @ OpenAI Researcher Access Program",
            "founder_1_linkedin": "https://www.linkedin.com/in/ramgorthi",
            "founder_1_name": "Ram Gorthi, Founder",
            "founder_2_description": "Ex-Cornell CS & Econ. Building Operand.",
            "founder_2_linkedin": "https://www.linkedin.com/in/akhiliyengar/",
            "founder_2_name": "Akhil Iyengar, Founder",
            "founder_3_description": "Ex-Dartmouth CS and Physics. Building Operand.",
            "founder_3_linkedin": "https://www.linkedin.com/in/arjun-sahney-40b88624b/",
            "founder_3_name": "Arjun Sahney, Founder",
            "generated_description": "# Operand: The AI-Powered Consultant for E-Commerce\n\nFounded in 2024, Operand has emerged from the Y Combinator W25 batch with a clear mission: to reinvent consulting for e-commerce brands using AI. The company is based in San Francisco and operates with a lean team of just three employees. They've set their sights on simplifying the decision-making process for retailers and e-commerce businesses by analyzing data more effectively than traditional consultants ever could.\n\n## The Problem Operand Solves\n\nIn the crowded world of e-commerce and retail, businesses are drowning in data yet often struggle to leverage it for insightful decision-making. Operand addresses this issue head-on by providing AI-driven insights that help brands optimize crucial areas like pricing, discount strategies, and marketing. The high data density present in these sectors allows Operand to demonstrate immediate impacts on the bottom line.\n\n## How Does Operand Work?\n\nUnlike many AI solutions that offer vague predictions, Operand has a unique spin: every result is vetted by human experts, many of whom have roots in top consulting firms (think McKinsey, BCG). This means that users benefit from AI's efficiency and data-crunching ability while gaining the confidence that comes from human expertise. Operand’s first capability focuses on pricing strategies, evaluating competitor pricing, advertising effectiveness, inventory levels, and more to help businesses maximize profits.\n\n## Early Success\n\nOperand is already making waves with early customers, reportedly driving six-figure improvements in their profit and loss statements. Brands are turning to Operand to replace the reliance on slow and cumbersome analytics processes that delay actionable insights.\n\n## Features to Love\n\n- **Data Integration**: Operand connects to a variety of data sources, including platforms like Shopify, Amazon, Salesforce, Google Analytics, Google Ads, Meta, and Excel, creating a unified view of performance metrics. No more messy spreadsheets!\n  \n- **AI + Human Expertise**: Operand’s recommendations result from advanced algorithms, followed by expert review, ensuring accuracy before delivery. Reports are polished and tailored to fit the recipient’s needs.\n\n- **Ongoing Optimization**: Operand continuously analyzes data and suggests adjustments, proactively responding to market changes (e.g., competitor pricing shifts) and ensuring that strategies evolve in real-time.\n\n## Why Operand?\n\nCompanies in e-commerce need decision-making grounded in rigorous analysis, not guesswork. Operand empowers teams to ask the right questions and deliver insights that drive real results, all while saving time in reporting and analysis.\n\nIf you're looking for a way to up your e-commerce game and make data-driven decisions, Operand might just be the partner you need.\n\nFor more information and to see Operand in action, check out their website: [Try Operand](https://www.tryoperand.com/). \n\n### Tags: \n- Generative AI\n- B2B\n- E-Commerce\n- Retail\n- San Francisco Bay Area\n\nUltimately, Operand is setting a new standard in the way e-commerce brands leverage their data to make informed decisions that lead to growth and success. It's not just about data; it’s about smart, impactful action.",
            "headline": "AI that Runs E-Commerce Brands",
            "location": "San Francisco",
            "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/c0d3688df1888d97f23c83b2c52e2fe814f8bd91.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191613Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=0c60099926463012f9fe0ff79b06a3b0d26d5404fdec2a0141f6f3de3e6a9e08",
            "name": "Operand",
            "social_links": [
                "https://www.linkedin.com/company/tryoperand"
            ],
            "tags": [
                "generative-ai"
            ],
            "team_size": "3.0",
            "website": "https://www.tryoperand.com/",
            "ycpage": "https://www.ycombinator.com/companies/operand"
        }
    },
    {
        "id": "hypotenuse-ai",
        "score": 0.968136459,
        "metadata": {
            "batch": "S20",
            "description": "We’re building a new way for ecommerce brands to manage their product data and create content using AI, unlocking a new wave of creativity and productivity for them. Hypotenuse is an all-in-one AI platform that manages product data, creates product descriptions and marketing content, and edits product images at scale—all in a way that captures a brand’s unique style. We’re reshaping what takes months to do, and turning it into days.",
            "founded_date": "2020.0",
            "founder_1_description": "Founder & CEO @ Hypotenuse AI. Formerly applied research scientist (machine learning) and software engineer at Amazon's AI team. CS grad from Cambridge University.",
            "founder_1_linkedin": "https://www.linkedin.com/in/jwonged/",
            "founder_1_name": "Joshua Wong, Founder",
            "generated_description": "### Hypotenuse AI Overview\n\n**Company Name:** Hypotenuse AI  \n**Founded:** 2020  \n**Location:** Singapore  \n**Team Size:** 10 employees  \n**Incubator:** Y Combinator Batch S20  \n\n**Mission:** Hypotenuse AI is on a mission to manage, create, and optimize e-commerce product content using the power of AI. The aim is to revolutionize how e-commerce brands handle product data and content creation, unlocking new levels of creativity and efficiency.\n\n### What They Do\nInitially established to provide a fresh way for e-commerce brands to handle their product information, Hypotenuse has evolved into an all-in-one platform. Their capabilities include:\n- **Product Data Management:** Efficiently manages and enriches product data.\n- **Content Creation:** Automatically generates compelling product descriptions and marketing materials that align with a brand’s voice.\n- **Image Optimization:** Edits product images at scale to enhance visual appeal.\n- **Time Efficiency:** Tasks that traditionally take months can now be completed in days.\n\n### Core Features\nHypotenuse AI offers several powerful features that cater to e-commerce businesses:\n- **Bulk Workflows:** Create large volumes of product and marketing content seamlessly.\n- **Product Data Enrichment:** Auto-fill missing product details, ensuring a complete catalog.\n- **Customized Brand Voice:** Generate content that adheres to specific brand guidelines.\n- **SEO Monitoring:** Keeps track of search performance across various platforms, including marketplaces.\n- **Automated Tagging:** Enrich and standardize product tags using advanced AI.\n\n### Target Industries\nThe platform is tailored for a range of sectors, including:\n- Agencies\n- Fashion\n- Furniture\n- Industrial Supplies\n\n### Marketplace Integration\nHypotenuse AI seamlessly integrates with key platforms such as:\n- Amazon\n- Walmart\n- Target\n\nThey also connect with popular e-commerce tools like Shopify, WordPress, and Webflow, allowing clients to optimize their workflows effortlessly.\n\n### Customer Base\nThe platform has gained traction with over 500,000 e-commerce brands and marketers worldwide, showcasing its reliability and scalability.\n\n### Conclusion\nHypotenuse AI stands out in the generative AI space by focusing specifically on e-commerce needs. It’s not just about automating tasks; it’s about elevating the entire content creation process for online businesses. If you’re an e-commerce brand looking to refine your product content and improve efficiency, Hypotenuse AI could be your go-to solution.\n\nVisit their website for more information: [Hypotenuse AI](https://hypotenuse.ai)",
            "headline": "Manage, create & optimize your ecommerce product content using AI",
            "location": "Singapore, Singapore",
            "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/cf1495521d372e905c88e7d86a628553de813ebd.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191426Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=dfb5f0ca3d4f50d5d90df24487d07f47665a35a89710742028d54e852bd7545e",
            "name": "Hypotenuse AI",
            "social_links": [
                "https://www.linkedin.com/company/hypotenuse-ai"
            ],
            "tags": [
                "generative-ai"
            ],
            "team_size": "10.0",
            "website": "https://hypotenuse.ai/",
            "ycpage": "https://www.ycombinator.com/companies/hypotenuse-ai"
        }
    },
    {
        "id": "circlemind",
        "score": 0.506774068,
        "metadata": {
            "batch": "F24",
            "description": "Circlemind is developing the next-generation of memory systems for AI that surpasses current Retrieval Augmented Generation (RAG) methods. Our technology based on Knowledge Graphs and PageRank, allows for efficient, interpretable, and context-aware reasoning and retrieval.",
            "founded_date": "2024.0",
            "founder_1_description": "Antonio is the co-founder and CEO of Circlemind. He holds a Master’s degree in Computing from Imperial College London, specializing in AI and Machine Learning. He spent three years as a Software Engineer at AWS, working on real-time streaming technology.",
            "founder_1_linkedin": "https://linkedin.com/in/antonio-vespoli-895727121",
            "founder_1_name": "Antonio Vespoli, Founder",
            "founder_2_description": "Luca is the co-founder and CTO of Circlemind. He holds a Master's degree in  Computer Science from the University of Oxford, where he researched alternative biologically-inspired methods to build neural networks for his PhD studies.",
            "founder_2_linkedin": "https://www.linkedin.com/in/luca-pinchetti-414230222/",
            "founder_2_name": "Luca Pinchetti, Founder",
            "founder_3_description": "🥷 Yuhang was awarded J.P. Morgan AI Research Award, first-authored a Nature Neuroscience paper, cofounded Fractile, raised $15M in two years and exited.",
            "founder_3_linkedin": "https://www.linkedin.com/in/yuhang-song/",
            "founder_3_name": "Yuhang Song, Founder",
            "generated_description": "## Circlemind: The Next Generation of AI Memory Systems\n\nFounded in 2024 and backed by Y Combinator's Batch F24, Circlemind is an ambitious startup based in San Francisco, California, focusing on evolving Retrieval Augmented Generation (RAG) methods through open-source innovations. At its core, Circlemind leverages the power of Knowledge Graphs and PageRank to enable efficient, context-aware, and interpretable AI reasoning and retrieval.\n\n### Mission and Vision\n\nCirclemind's mission is simple yet profound: to develop a next-generation memory system for AI that goes beyond the limitations of current RAG methodologies. By adopting a unique approach that combines vector databases with knowledge graphs, Circlemind can create intelligent systems that adapt to user-specific contexts, data, and queries.\n\n### What Makes Circlemind Unique?\n\nThe cornerstone of Circlemind's technology is what's known as **GraphRAG**, a highly adaptable retrieval framework. Unlike traditional static RAG approaches, Circlemind's system continuously learns and evolves based on new data and interactions. This self-improving capability allows it to provide more nuanced and relevant responses to complex queries. Here are some of the standout features:\n\n- **Promptable GraphRAG**: Users can command the AI's graph construction in plain English, ensuring the technology aligns closely with the user's intent and data specifics.\n- **Multi-Hop Retrieval**: The system can reason across a network of memories, retrieving highly relevant information seamlessly.\n- **Whole Dataset Reasoning**: Capable of handling complex queries that require an aggregate understanding of data, unlike naïve RAG systems that may struggle with holistic insights.\n- **Dynamic Data Adaptation**: GraphRAG excels with evolving information, making it ideal for applications that require updated context retrieval.\n\n### Pricing and Accessibility\n\nCirclemind aims to democratize access to advanced AI tools. They offer a **Community Edition** that is free for self-hosting, making it accessible for hobbyists and small projects. For businesses needing advanced features and support, there’s a subscription model priced at **$300 per month**. Custom enterprise solutions are also available, catering to scalable team needs.\n\n### The Team\n\nWith a compact team of three, Circlemind's efforts are supported by a robust partnership with industry expert **Diana Hu**, who brings valuable insights from her experience in cutting-edge technology development. \n\n### Conclusion\n\nCirclemind is positioned to push the boundaries of AI technology by harnessing the strengths of most modern systems while addressing their deficiencies. Their innovative approach could redefine how AI interacts with the vast amounts of information available today, allowing for more sophisticated and intuitive applications. For a closer look or to experiment with their offerings, check out their website at [Circlemind](https://circlemind.co) and don’t hesitate to **book a demo** or start with **100 free credits** to explore their capabilities firsthand. \n\nIn a world that craves smarter AI solutions, Circlemind's advancements could very well chart a new path forward.",
            "headline": "Circlemind is an open-source RAG using knowledge graphs and PageRank.",
            "location": "None",
            "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/635f0f5932fd396198d44fc3799872974bf77b4d.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191049Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=f94b1679b983c46cd063d9b8e055f8da0efc0a1d287d5490a611341f47e87fde",
            "name": "Circlemind",
            "social_links": [],
            "tags": [
                "artificial-intelligence"
            ],
            "team_size": "3.0",
            "website": "https://circlemind.co",
            "ycpage": "https://www.ycombinator.com/companies/circlemind"
        }
    },
    {
        "id": "storia-ai",
        "score": 0.504469,
        "metadata": {
            "batch": "S24",
            "description": "With AI increasingly automating away code generation, software engineers will spend more time reading, judging, and architecting code rather than writing it. Storia is building an open-source copilot that knows a company's codebase and its context.\r\n\nWe are starting with Sage, a Perplexity-like agent for helping developers understand, judge, and generate software. Given an existing codebase, developers can ask Sage questions such as:\r\n1) Given my project’s SLA and latency constraints, what is the appropriate underlying vector database to use? How would I incorporate it into my existing codebase?\r\n2) Why should I pick Redis over Milvus as my underlying vector store?\r\n3) Does this codebase in our organization still work and what steps are required for a complex integration with another library?\r\n\nSage’s answers are directly supported by documentation and external references like GitHub, Stack Overflow, technical design documents, and project management software, preventing hallucinations. Today, Sage has up-to-date knowledge about open-source repositories (indexed daily). Tomorrow it will have a deep understanding of every line of code on the Internet. For teams, Sage will know about your private codebase too.\r\n\nNo group has yet solved how to build an AI system that comprehends a codebase and its context and can empower every developer to architect better code, faster. This requires new research advances because vanilla RAG and out-of-the-box LLMs aren’t going to cut it. \r\n\nWe have 20+ years of software engineering and AI research experience. Julia worked on precursors of Gemini using contextual neural techniques before they were called “RAG” (and applied it to products like Google Keyboard and Pixel phones). Mihail built the earliest LLMs at Amazon Alexa and launched the first contextual deep learning conversational AI system in production at Alexa.",
            "founded_date": "2023.0",
            "founder_1_description": "Cofounder @ Storia & previously at Google Research.\n\n10+ years in NLP. Built the first bidirectional RNN for machine translation at Oxford. At Google, I helped build pivotal technologies like federated learning, the AI layer on top of Android, and RAG for precursors of Gemini. Excited about how NLP is now redefining software engineering.",
            "founder_1_linkedin": "https://www.linkedin.com/in/iulia-raluca-turc/",
            "founder_1_name": "Julia Turc, Founder",
            "generated_description": "**Storia AI: Revolutionizing Code Understanding with an Open-Source AI Copilot**\n\nIn the ever-evolving landscape of software engineering, Storia AI is carving out a unique niche. Founded in 2023 and currently part of Y Combinator Batch S24, Storia AI is on a mission to transform how developers interact with code. Their vision is straightforward yet ambitious: to build an open-source AI copilot that comprehensively understands a company's code and its broader context. \n\nAs the industry moves towards automating code generation, software engineers increasingly find themselves in roles that require deep comprehension of existing code rather than just writing new lines. Storia AI tackles this shift head-on with a tool named Sage. Think of Sage as a smart assistant for developers—an AI that not only generates suggestions but truly understands the nuances of a specific codebase.\n\n### What Can Sage Do?\n\nSage acts as a powerful resource for developers, capable of answering complex questions that go beyond simple coding tasks. Here’s what it offers:\n\n1. **Contextual Recommendations**: Developers can consult Sage on technical choices, like determining the right vector database that meets project constraints.\n2. **Comparative Analysis**: It can clarify why one database option might be more suitable than another—say, Redis versus Milvus.\n3. **Integration Queries**: Sage assesses codebases for compatibility with other libraries and provides actionable steps for integration.\n\nWhat sets Sage apart is its reliance on verified sources. Instead of generating potentially misleading information (a common issue known as \"hallucination\"), Sage provides answers anchored in a wealth of documentation from GitHub, Stack Overflow, and internal technical documents. This places reliable, contextualized knowledge directly in the hands of developers.\n\n### A Strong Foundation\n\nStoria AI was founded by a small but formidable team with deep roots in both AI and software engineering. Julia has extensive experience with contextual neural networks, having worked on foundational technologies at Google, while Mihail was instrumental in developing early LLMs (Large Language Models) at Amazon Alexa. Their 20+ years of combined experience positions them uniquely to tackle the challenges of building an AI that comprehends complex codebases.\n\n### Where They’re Headed\n\nCurrently located in Millbrae, CA, Storia AI operates with a compact team of two talented individuals, backed by David Lieb as their Group Partner. The tagging of their work in areas like ‘artificial intelligence’, ‘developer tools’, and ‘machine learning’ indicates a focused strategy that resonates deeply within the tech community. As they progress, there are ambitious goals to deepen Sage’s understanding of not just private codebases but potentially every line of code available online.\n\nIn a nutshell, Storia AI is not just another tech startup; it's a thoughtful response to the inevitable evolution of software development. By building a bridge between AI and developers, they’re paving the way for more efficient, informed, and high-quality code architecture. If you’re interested in learning more or seeking support for your own codebase, check out their website at [storia.ai](https://storia.ai). \n\nStoria AI is a company to watch, not just for what they are building today but for how they will shape the future of coding.",
            "headline": "Open source AI copilot that knows your company's code and its context",
            "location": "Millbrae, CA",
            "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/47ad1917608216e7f585a19676e7b404c4cd1c5f.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191950Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=e508d1cc6d42e0df016b9ad4d86e91b72bbaed33a75b056e550363ed003bfa1a",
            "name": "Storia AI",
            "social_links": [
                "https://www.linkedin.com/company/storia-ai/",
                "https://x.com/StoriaAI",
                "https://github.com/Storia-AI"
            ],
            "tags": [
                "artificial-intelligence"
            ],
            "team_size": "2.0",
            "website": "https://storia.ai",
            "ycpage": "https://www.ycombinator.com/companies/storia-ai"
        }
    },
    {
        "id": "ai.fashion",
        "score": 0.490343302,
        "metadata": {
            "batch": "S20",
            "description": "AI.Fashion is the AI creative suite for the fashion industry - modernizing the traditional design and go to market fashion processes with our advanced AI platform and design tools.\r\n\nOn the design side - our platform allows brands to create physically accurate digital versions of their unreleased clothing line before even beginning their productions processes, dramatically helping to reduce waste. \r\n\nAnd on the marketing side - we enable them to create photorealistic imagery of the clothing on a multitude of sizes, which creates a better experience for their customers because they have way more information about how the clothing will actually fit before they purchase.",
            "founded_date": "2020.0",
            "founder_1_description": "Daniel is the CEO at AI.Fashion. He is also an award-winning filmmaker (Tribeca Film Festival, SFiFF, LAff) and creative technologist. Previously, Daniel spent time at Google (VR/AR), MIT (Artist in Residence 2019), and Harvard.",
            "founder_1_linkedin": "https://www.linkedin.com/in/dacitron/",
            "founder_1_name": "Daniel Citron, Founder",
            "founder_2_description": "John is cofounder & CTO at AI.Fashion and specializes in creative tools & machines. John previously served as CTO at 3ayez (W18) and spent time at Yale and Microsoft.",
            "founder_2_linkedin": "https://www.linkedin.com/in/jchirik/",
            "founder_2_name": "John Chirikjian, Founder",
            "generated_description": "AI.Fashion is an innovative player in the fashion industry, using AI to reshape the design and marketing processes. Founded in 2020 and part of Y Combinator's Summer 2020 batch, this Los Angeles-based startup offers a robust creative suite specifically tailored for fashion brands.\n\nAt its core, AI.Fashion aims to modernize traditional fashion workflows. On the design side, it lets brands create hyper-realistic digital representations of their unreleased clothing, allowing them to visualize and iterate their designs before production even starts. This proactive approach not only optimizes creativity but significantly reduces waste—a pressing issue in the fashion industry.\n\nOn the marketing front, AI.Fashion takes online shopping to a new level. Their platform generates photorealistic images of apparel that showcase fit and style across various sizes. This means customers can make more informed decisions, reducing return rates and enhancing overall satisfaction.\n\nWith a dedicated team of 11 and a mission to marry technology with creativity, AI.Fashion is tapping into the needs of a modern, eco-conscious market. They promise to cut photography costs by up to 30%, boost conversion rates by 25%, and speed up campaign production by 50%. These capabilities not only make the fashion process more efficient but also serve to elevate the brand's interaction with their audience.\n\nLocated in Los Angeles, AI.Fashion proudly uses a mix of AI technology and real human models, fostering an inclusive approach in an increasingly digital world. Their impact has attracted attention from major media outlets, validating their potential in the evolving landscape of fashion.\n\nIf you’re interested in seeing how they can transform your fashion projects, you can check them out at [AI.Fashion](https://www.ai.fashion).",
            "headline": "AI.Fashion is the AI creative suite for the fashion industry.",
            "location": "Los Angeles, CA",
            "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/2b7f30caed53551163ca80007449c9b4fe770ea3.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T190950Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=87628afe434279461fa5f7331a49e5194d7303aed11a819746954ac9d7b1366d",
            "name": "AI.Fashion",
            "social_links": [
                "https://www.linkedin.com/company/ai-fashion-inc/",
                "https://twitter.com/AIFashionApp"
            ],
            "tags": [
                "artificial-intelligence"
            ],
            "team_size": "11.0",
            "website": "https://www.ai.fashion",
            "ycpage": "https://www.ycombinator.com/companies/ai-fashion"
        }
    },
    {
        "id": "deasy-labs",
        "score": 0.476006329,
        "metadata": {
            "batch": "S23",
            "description": "Deasy Labs provides metadata orchestration for AI workflows. Deasie's platform provides the best way for AI teams to create and embed high-quality, customized metadata into their AI workflows (e.g., RAG, Agentic frameworks).\r\n\nOur three founders (from Amazon, McKinsey/QuantumBlack & MIT) previously built an ML data governance tool from 0 to 1 within McKinsey, which we deployed with 11 Fortune 500 companies. We saw in early 2023 the ability to create high-quality metadata (without reliance on domain experts) would be a key factor in achieving the accuracy & speed in GenAI applications required for production.  \r\n\nOur investors include General Catalyst, Y Combinator, RTP Global and world experts in enterprise data. Website: https://deasylabs.com",
            "founded_date": "2023.0",
            "founder_1_description": "Co-founder of Deasie: Data governance for language models in the enterprise. \n\nPrior experience: QuantumBlack: Product Manager for AI for Data Governance product (1.5 yrs); McKinsey & Company: Management consultant (2 yrs); X26: Founder of X26 (global entrepreneurs community); University of Cambridge: Masters in information engineering. Personal blog: https://reecewgriffiths.com",
            "founder_1_linkedin": "https://linkedin.com/in/reece-william-griffiths",
            "founder_1_name": "Reece Griffiths, Founder",
            "founder_2_description": "Mikko is the co-founder of Deasie. He is a technologist with deep experience (5+ years) in data and machine learning space from McKinsey and QuantumBlack, where he implemented and deployed models at large enterprises. Prior to moving into the world of data governance for language models with Deasie, he was the Lead data scientist building AI data quality tool at QuantumBlack. Mikko holds a graduate degree from MIT.",
            "founder_2_linkedin": "https://linkedin.com/in/mikkopeiponen",
            "founder_2_name": "Mikko Peiponen, Founder",
            "founder_3_description": "Co-founder of Deasie: Data governance for unstructured data. \n\nPrior experience: QuantumBlack: Software Engineer, Machine Learning at AI for Data Quality product; Previous Engineer at Amazon, Mercedes-Benz and ChatBot Startup (E-Bot 7); Bachelor from National University of Singapore and Graduate from UWC Mostar",
            "founder_3_linkedin": "https://linkedin.com/in/leonardplatzer",
            "founder_3_name": "Leonard Platzer, Founder",
            "generated_description": "Deasy Labs is carving out a crucial niche in the burgeoning landscape of generative AI by focusing on metadata orchestration for AI workflows. Founded in 2023 and part of Y Combinator’s Batch S23, the company was birthed from the experiences of three founders who previously built a machine learning data governance tool at McKinsey from the ground up. They deployed this tool with 11 Fortune 500 companies, which provided them keen insights into the importance of high-quality metadata in enhancing AI applications.\n\nThe mission here is straightforward: empower teams to seamlessly create and integrate customized metadata into their workflows—think RAG and Agentic frameworks. By eliminating the need for constant reliance on domain experts, Deasy Labs aims to optimize the accuracy and speed necessary for production in generative AI.\n\nTheir platform offers several standout features:\n\n1. **Direct Connection to Vector Embeddings**: It interfaces with any vector database, allowing metadata generation from embeddings or underlying documents.\n2. **Auto-Suggested Metadata**: Leveraging sophisticated models to derive the most relevant metadata schema from a set of documents.\n3. **Multi-Modal Metadata at Scale**: Extracting metadata from both chunks and entire documents in a way that's both hierarchical and standardized.\n4. **Intelligent Information Retrieval**: Their system utilizes metadata for efficient agent or node selection, ensuring that users access the right information when it matters most.\n\nThe confidence in Deasy Labs is echoed by their clientele. Companies like Octopus Legacy and Decision Science Advisors highlight the transformative impact of the platform on automating processes and accelerating time-to-value.\n\nBacked by credible investors such as General Catalyst, Y Combinator, and RTP Global, Deasy Labs combines expertise from notable institutions like Amazon, McKinsey, and MIT. They emphasize that creating high-quality metadata efficiently is no longer a luxury; it’s an essential part of modern AI deployment strategies.\n\nWith a lean team of three, they already show promise in fundamentally changing how businesses approach data governance and operational intelligence. If you’re looking to dive deeper, check out their [website](https://www.deasylabs.com) and consider requesting a demo to see their solution in action.\n\nOverall, Deasy Labs stands out not just because of its technological offerings, but because it addresses a critical gap in the AI landscape, ensuring teams can focus on what they do best: innovating.",
            "headline": "Metadata for GenAI workflows",
            "location": "None",
            "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/b6bfd3c6d73fad13ff70b406a46c2bd07a39bc9d.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191114Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=217e760fe8755ad9463363b053f43ab91dfbdebbda4fb0b510f7e461b8b748a8",
            "name": "Deasy Labs",
            "social_links": [
                "https://www.linkedin.com/company/deasie"
            ],
            "tags": [
                "artificial-intelligence"
            ],
            "team_size": "3.0",
            "website": "https://www.deasylabs.com/",
            "ycpage": "https://www.ycombinator.com/companies/deasy-labs"
        }
    },
    {
        "id": "assemblyai",
        "score": 0.432291806,
        "metadata": {
            "batch": "S17",
            "description": "AssemblyAI is an applied AI company. We research, train, and deploy State-of-the-Art AI models for developers and product teams to integrate into their products/apps.\r\n\nToday, we offer AI models for audio transcription, content moderation, summarization, topic detection, and many other tasks.\r\n\nWe are working towards building the \"Stripe for AI models\" - where developers and product teams will be able to easily access State-of-the-Art AI through a simple API.\r\n\nWe're a fully remote team of AI researchers and ML engineers, and have raised over $65M in funding from top investors including Accel, Insight Partners, Y Combinator, John/Patrick Collison, Daniel Gross, and Nat Friedman.",
            "founded_date": "2017.0",
            "generated_description": "AssemblyAI is an innovative company dedicated to simplifying access to state-of-the-art AI models for developers and product teams through APIs. Founded in 2017 and part of Y Combinator's S17 cohort, the company has its roots in applied AI, where it initially focused on researching, training, and deploying advanced AI solutions.\n\nThe company's mission resonates with the ambition of becoming the \"Stripe for AI models,\" enabling developers to easily incorporate powerful AI capabilities into their applications. Today, AssemblyAI specializes in a range of functionalities, such as audio transcription, content moderation, summarization, and topic detection.\n\nThe team, fully remote and comprising around 65 AI researchers and machine learning engineers, has successfully raised over $65 million in funding from top-tier investors including Accel, Insight Partners, Y Combinator, and prominent figures like John and Patrick Collison. Based in San Francisco, AssemblyAI is empowering both startups and established enterprises with reliable, high-performance AI models that can solve complex problems and enhance user experiences.\n\nAssemblyAI’s product offerings include:\n\n1. **Speech-to-Text Transcription**: Their models are known for unmatched accuracy, offering multilingual capabilities and speaker diarization.\n2. **Streaming Speech-to-Text**: Ideal for real-time applications, they provide low-latency predictions for live voice interactions.\n3. **Speech Understanding**: Advanced models that allow for deep analysis and insights from audio data, leveraging the latest in large language model capabilities.\n\nThe company emphasizes a developer-first approach, with comprehensive documentation, multiple SDK options, and plans to scale that address diverse customer needs. Noteworthy customers, such as CallRail and Vidyo, testify to the platform’s reliability and integration ease.\n\nAssemblyAI is not just about transcription; it’s about transforming voice data into valuable insights and experiences. With ongoing research and development, including the recent launch of their Universal-2 model, AssemblyAI is poised at the forefront of Speech AI innovation.\n\nFor more insights and ways to get started with their technology, you can visit their website at [AssemblyAI](https://www.assemblyai.com). They invite you to test their API for free, ensuring you can experience the potential of superior speech AI firsthand.",
            "headline": "APIs for AI models",
            "location": "San Francisco",
            "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/7976d2895f57963a1342e8e1faef7da7e168729f.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191007Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=bf4a4b3f1d811d284a02a9ca38848e06a6e773193e7b05446890c0e64f9420ed",
            "name": "AssemblyAI",
            "social_links": [
                "https://www.linkedin.com/company/assemblyai/",
                "https://twitter.com/assemblyai",
                "https://github.com/AssemblyAI"
            ],
            "tags": [
                "artificial-intelligence"
            ],
            "team_size": "65.0",
            "website": "https://www.assemblyai.com",
            "ycpage": "https://www.ycombinator.com/companies/assemblyai"
        }
    },
    {
        "id": "firecrawl",
        "score": 0.387350827,
        "metadata": {
            "batch": "S22",
            "description": "Firecrawl is the easiest way to extract data from the web. Developers use us to reliably convert URLs into LLM-ready markdown or structured data with a single API call. We crossed 17k GitHub stars in just two months and have had paying customers since day one.\r\n\nPreviously, we built Mendable, one of the first commercially available “chat with your data” applications. We sold to companies like MongoDB, Coinbase, Snapchat, and more. To do this, we spent a surprising amount of time building reliable infrastructure for getting clean data from the web. When we started to see our founding friends rebuilding the same thing, we thought we might be on to something.",
            "founded_date": "2022.0",
            "founder_1_description": "CEO at Firecrawl",
            "founder_1_linkedin": "https://www.linkedin.com/in/caleb-peffer/",
            "founder_1_name": "Caleb Peffer, Founder",
            "founder_2_description": "Founder and CMO @ Firecrawl",
            "founder_2_linkedin": "https://www.linkedin.com/in/eric-ciarla/",
            "founder_2_name": "Eric Ciarla, Founder",
            "founder_3_description": "Founder and CTO @ Firecrawl",
            "founder_3_linkedin": "https://www.linkedin.com/in/nicolas-silberstein-camara/",
            "founder_3_name": "Nicolas Silberstein Camara, Founder",
            "generated_description": "Firecrawl is a San Francisco-based startup that emerged from Y Combinator's Summer 2022 batch. Founded by a team with a history of building successful data applications, Firecrawl's core mission is pretty straightforward: to provide the easiest way to extract AI-ready data from the web.\n\nInitially branded to simply extract data from websites, Firecrawl has swiftly evolved into a powerful tool for developers. Its API allows users to take any URL and convert it into LLM (Large Language Model) ready markdown or structured data with just a single API call. The platform gained impressive traction, racking up over 17,000 GitHub stars in a mere two months and managing to secure paying customers from the start.\n\nBefore launching Firecrawl, the founders developed Mendable, a pioneering application for conversing with data, catering to high-profile clients like MongoDB, Coinbase, and Snapchat. Their past experience highlighted a common frustration: the complex and often unreliable processes involved in web data extraction. This insight laid the groundwork for Firecrawl’s streamlined approach.\n\n### Key Features:\n- **Robust Web Scraping**: Firecrawl can crawl and scrape data from all accessible subpages, returning clean markdown without needing a sitemap.\n- **Dynamic Content Handling**: It accommodates sites that render content dynamically using JavaScript.\n- **AI-Ready Data**: The content is structured effectively, enabling LLM applications to leverage it with minimal preprocessing.\n- **Open Source**: True to modern tech ethos, Firecrawl is open-source, encouraging contributions and community involvement.\n\n### User Experience:\nDevelopers can kickstart their journey with Firecrawl for free (up to 500 credits), making it easy to try out the service before committing to a paid plan. Their pricing tiers offer flexible scaling options, which range from basic plans for hobbyists to comprehensive enterprise solutions.\n\nFirecrawl has already attracted attention from notable companies and developers, who praise its reliability and efficiency in data preparation. Feedback suggests it's not just a tool but a valuable partner in ai-powered projects.\n\nYou can check out more or get started over at [Firecrawl's website](https://www.firecrawl.dev).\n\nIn summary, Firecrawl isn’t just joining the data extraction race—it's redefining how developers tap into the vast resources of the web to power their AI initiatives. With a refreshing focus on simplicity and reliability, Firecrawl is a compelling choice for anyone looking to enhance their data-driven applications.",
            "headline": "The easiest way to extract AI ready data from the web",
            "location": "San Francisco",
            "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/4ab40184581e8791028ab734d2290f35ebd290cc.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191337Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=13041082e43f337a9b35e8cdca3e867eba9ce7dcc7de5c4398ddc8c9781696e8",
            "name": "Firecrawl",
            "social_links": [
                "https://www.linkedin.com/company/104100957",
                "https://x.com/firecrawl_dev",
                "https://github.com/mendableai"
            ],
            "tags": [
                "developer-tools"
            ],
            "team_size": "8.0",
            "website": "https://www.firecrawl.dev",
            "ycpage": "https://www.ycombinator.com/companies/firecrawl"
        }
    },
    {
        "id": "sid",
        "score": 3.741588771,
        "metadata": {
            "batch": "S23",
            "description": "We make it easy for developers to connect data to their LLM apps. Instead of spending months on integrations and retrieval pipelines, Reworkd's AgentGPT added our button in an afternoon and let thousands of people connect their Notion, email and Drive instantly.\r\n\nEvery single AI company is building data retrieval. Currently, they're doing this from scratch â we don't think they should have to. Just like OpenAI made working with LLMs as simple as an API call, SID makes it easy for every AI company to access data the same way.",
            "founded_date": "2023.0",
            "founder_1_description": "Max is the CEO of SID.ai. Previously, he was a researcher at ETH ZÃ¼rich, where he worked on AI accelerator design with the professor who developed Google's TPU architecture. In early 2023, he developed MultiGPT, the first multi-agent AI that garnered thousands of users and ~500 Github stars in a single week. Max was awarded a German national excellence scholarship, awarded to 0.5% of German students.",
            "founder_1_linkedin": "https://linkedin.com/in/maximiliandavid",
            "founder_1_name": "Maximilian-David Rumpf, Founder",
            "founder_2_description": "Lukas Ruflair is co-founder and CIO at SID.ai. He studied Computer Science at ETH Zurich, loves hacking and previously built one of the first multi-agent AI simulations, racking up millions of views on Twitter.",
            "founder_2_linkedin": "https://www.linkedin.com/in/ruflair/",
            "founder_2_name": "Lukas Ruflair, Founder",
            "founder_3_description": "Lotte is determined to let people use their data for their own good. She holds a degree in CS from ETH ZÃ¼rich and a degree in Economics from the University of St. Gallen. In early 2023, she developed MultiGPT, the first multi-agent AI that garnered thousands of clones and ~500 Github stars in a single week. Previously, Lotte worked at Europeâs first AI venture studio Merantix and organized the continent's largest student-run startup conference with guests such as Matt Cohler & Esther Wojcicki.",
            "founder_3_linkedin": "https://linkedin.com/in/lotte-seifert",
            "founder_3_name": "Lotte Seifert, Founder",
            "generated_description": "**Company Overview: SID**\n\nFounded in 2023 and part of Y Combinator's Batch S23, SID aims to make the integration of AI with company-specific data seamless and efficient. The mission is straightforward: provide a serverless Retrieval-Augmented Generation (RAG) solution that empowers AI to tap into relevant information tailored to both industries and individual users.\n\nInitially, SID began by easing the path for developers who struggled with setting up data connections to their large language model (LLM) applications. Instead of enduring a lengthy integration process or grappling with cumbersome data retrieval pipelines, developers could simply add SID’s button to their tools—much like Reworkd's AgentGPT did in just a day. This leap has allowed countless users to instantly link their Notion, email, and Google Drive to their AI functionalities.\n\nAs the AI landscape continues to expand, every new player seems to be reinventing the wheel when it comes to data retrieval. SID believes this shouldn’t be the case. In the same vein that OpenAI democratized access to LLMs through a simple API call, SID aspires to do the same for data accessibility. They’re not just another tech solution; they’re fundamentally changing how AI companies interact with data.\n\n**Current Focus and Offerings**\n\nSID is currently working on the following key initiatives:\n- **Developer Accessibility**: They provide resources and documentation to help developers get started quickly. With tools designed to enhance product functionality, SID invites devs to explore their offerings through demos and user-friendly guides.\n- **RAG Solutions**: The focus on Retrieval-Augmented Generation displays SID's intent to be at the forefront of AI technology advancements, ensuring that AI applications are informed and contextually aware based on user, industry, or company-specific data.\n\nWith a compact team of 3, SID is nimble and focused. They are geared toward building out their product and expanding their capabilities, guided under the expertise of their group partner, Dalton Caldwell.\n\n**Concluding Thoughts**\n\nIn a landscape where data retrieval is a crucial enabler of AI's capabilities, SID is positioning itself as a key player to simplify this process. It’s a bold move—just when it seems like AI's evolution might plateau, companies like SID remind us that the race is not just about intelligence but also about how effectively we can connect that intelligence to the real world.\n\nFor more information, you can visit their website at [SID.ai](https://www.sid.ai), or check out their [blog](https://www.sid.ai/blog), [docs](https://www.sid.ai/docs), and [hiring](https://www.sid.ai/hiring) pages to explore opportunities and insights further.",
            "headline": "Serverless RAG to connect AI to company, industry, or person-specificâ¦",
            "location": "None",
            "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/b98b67d53b909a2d222ad3c772fcc856e44351c2.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191925Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=4375cd64436160b204b51b66c6977bc022a1cff3451a4081175b41dcfdf8fe56",
            "name": "SID",
            "social_links": [
                "https://www.linkedin.com/company/sidai/",
                "https://twitter.com/try_sid",
                "https://github.com/sidhq"
            ],
            "tags": [],
            "team_size": "3.0",
            "website": "https://www.sid.ai",
            "ycpage": "https://www.ycombinator.com/companies/sid"
        }
    },
    {
        "id": "roe-ai",
        "score": 1.584940076,
        "metadata": {
            "batch": "W24",
            "description": "Roe AI is the next-generation AI-powered data warehouse to store, process, and query unstructured data like documents, websites, images, videos, and audio. By making the impossible data possible, we help data teams become strategic enablers.\r\n\nData lies at the heart of strategic decision-making, steering enterprises toward their KPIs. Roe AI accelerates these successes by providing intuitive and intelligent multi-modal data extraction, data classification & multi-modal RAG via Roe's SQL engine.\r\n\nBook us a call to discover how Roe AI can take your enterprise's data intelligence to the next level https://cal.com/team/roe-ai/hi-roe\r\n\nThe future of data science is here.",
            "founded_date": "2023.0",
            "founder_1_description": "Cofounder & CEO of Roe AI, democratizing the access of safe, steerable, scalable Gen AI to enterprise\n\nex-tech lead of Gen AI @ Snowflake.\nSnowflake Summit 2023 Speaker.\nex-tech lead of Knowledge Graph & Generative Skill Assessment at LinkedIn\n2014-18 UC Berkeley CS & Stats",
            "founder_1_linkedin": "https://linkedin.com/in/berkeleymeng",
            "founder_1_name": "Richard Meng, Founder",
            "founder_2_description": "Hi, I'm Jason. With a background in both Computer Science and Applied Mathematics from UC Berkeley, I've had the privilege of diving deep into AI, product, and infrastructure roles at leading tech companies including Meta, Robinhood, and most recently, Retool. Excited to shape the future of AI-driven solutions!",
            "founder_2_linkedin": "https://linkedin.com/in/jason-wang-a29851128",
            "founder_2_name": "Jason Wang, Founder",
            "generated_description": "**Roe AI Overview**\n\nFounded in 2023 and hailing from Y Combinator's Batch W24, Roe AI is a rising player in the world of data management. Based in San Mateo, CA, this compact team of three is on a mission to revolutionize how enterprises interact with unstructured data—think documents, websites, images, videos, and audio. Their tagline? Making the impossible data possible.\n\n**What They Do**\n\nRoe AI provides a next-generation AI-powered data warehouse designed to store, process, and query unstructured data. This isn't just about storing data; it's about empowering data teams to become strategic enablers within their organizations. They achieve this using intuitive multi-modal data extraction, classification, and an innovative SQL engine that makes querying straightforward.\n\n**Core Features and Solutions**\n\n- **Agentic Unstructured Data Analytics:** Roe AI excels at extracting insights from complex data, helping businesses navigate the intricate nuances found in documents and online content.\n- **SQL-Powered AI Agents:** Their technology applies AI to unstructured data sources, functioning as \"SQL on steroids\" which brings a level of query power not commonly seen in the industry.\n- **Enterprise-Grade Security:** Built with stringent security measures, Roe AI emphasizes data privacy and compliance, making it a trustworthy partner for enterprises.\n\n**Industries Served**\n\nRoe AI is particularly geared toward financial services, fintech, insurance, e-commerce, and retail. They help companies streamline their operations—whether it's reducing credit risks, improving compliance in insurance pricing, or making lengthy R&D documents queryable.\n\n**Why It Matters**\n\nData is central to strategic decision-making, and Roe AI positions itself as a catalyst for companies striving to leverage their data more effectively. The promise of transforming vast amounts of unstructured data into actionable insights is not just appealing—it's essential in today's fast-paced business environment.\n\n**Get Involved**\n\nFor enterprises looking to enhance their data intelligence, Roe AI invites you to explore their solution further. You can book a demo to see firsthand how they can unlock your organization's data potential.\n\nWebsite: [getroe.ai](https://getroe.ai)  \nBook a Call: [Schedule Here](https://cal.com/team/roe-ai/hi-roe)\n\nIn summary, Roe AI is set to make waves in the data analytics landscape, and if you're any organization dealing with the overwhelming flood of unstructured data, they might just be the partner you need.",
            "headline": "Data warehouse to query unstructured data like docs, webs, imgs & more",
            "location": "San Mateo, CA",
            "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/64d82752b880fd0b119839d5cb73445773446ea4.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191856Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=333d4b2e81b62d499c70672e83cd16c43a7996930669c8342c83480a25264ef9",
            "name": "Roe AI",
            "social_links": [
                "https://www.linkedin.com/company/roe-ai",
                "https://twitter.com/try_roe_ai"
            ],
            "tags": [
                "generative-ai"
            ],
            "team_size": "3.0",
            "website": "https://getroe.ai",
            "ycpage": "https://www.ycombinator.com/companies/roe-ai"
        }
    },
    {
        "id": "downlink",
        "score": 5.790723086,
        "metadata": {
            "batch": "W24",
            "description": "Downlink is the turbo button for AI. We make LLMs 70%+ faster with a few lines of code.\r\n\nDownlink learns which prompts are easy or hard. We train fast models to handle simple prompts, your existing LLM takes the complex ones.",
            "founded_date": "2024.0",
            "founder_1_description": "Downlink. The turbo button for AI.\n\nI build internet-scale data infrastructure.",
            "founder_1_linkedin": "https://linkedin.com/in/tjmurphy",
            "founder_1_name": "TJ Murphy, Founder",
            "generated_description": "### Downlink: Turbocharging AI LLMs\n\nFounded in 2024 and part of Y Combinator Batch W24, Downlink is a young yet ambitious startup based in San Francisco. Imagine being able to make your Language Learning Models (LLMs) run 70% faster with just a few lines of code—that's exactly what Downlink promises. They call themselves the “turbo button for AI,” aiming to streamline AI application development without compromising performance.\n\n#### What's Their Mission?\n\nDownlink's mission is straightforward: to expedite the processing of LLMs significantly while keeping the integration process remarkably simple for developers. They achieve this by intelligently determining which prompts are straightforward and which ones require more computational power. Their solution intelligently routes less complex requests to faster models while your current LLM handles the more intricate queries.\n\n#### Solutions for Developers\n\nDownlink enhances your AI infrastructure by:\n- **Boosting Performance**: Experience a performance increase of 20% or more without sacrificing accuracy, lowering response times, and expanding rate limits.\n- **Simplifying Architecture**: Their drop-in API means less technical debt and complexity, allowing developers to focus on shipping rather than maintenance.\n- **Getting Started Quickly**: Their service works seamlessly with various languages like Python, TypeScript, and Go, meaning you can plug it into your existing stack with ease. \n\nFor example, a simple use case in Python looks like this:\n\n```python\nimport openai\n\nopenai.base_url = \"https://app.downlink.dev/api/v1\"\nopenai.api_key = \"__YOUR_DOWNLINK_API_KEY__\"\n\nresponse = openai.chat.completions.create(\n    model=\"gpt-4o\",\n    messages=[{\"role\": \"user\", \"content\": \"Say 'Hello World'\"}]\n)\n\nprint(response.choices[0].message.content) # Output: \"Hello World\"\n```\n\n#### A Lean Team, Big Ambitions\n\nThough currently there’s just one employee, Downlink is built on a solid vision and aspirations. Led by their Group Partner, Nicolas Dessaigne, they’re poised to redefine how companies leverage AI in their applications. \n\nIf you're an AI engineer tired of wrestling with latency and complex architectures, Downlink offers a much-needed lifeline. Check them out at their website [downlink.dev](https://downlink.dev/) to see how they can optimize your AI models.\n\nWith Downlink, you’re not just keeping pace; you’re setting the pace.",
            "headline": "Downlink makes LLMs 70%+ faster with a few lines of code",
            "location": "San Francisco",
            "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/f2fe30e40c28edb97666095936551f9f557e8938.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191126Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=6241553a05405b21afb5a6a05505354dc47002545a8d715c3e67ba4926191128",
            "name": "Downlink",
            "social_links": [
                "https://www.linkedin.com/company/downlink/",
                "https://github.com/Titan-Systems"
            ],
            "tags": [
                "developer-tools"
            ],
            "team_size": "1.0",
            "website": "https://downlink.dev/",
            "ycpage": "https://www.ycombinator.com/companies/downlink"
        }
    },
    {
        "id": "indexical",
        "score": 5.246731102999999,
        "metadata": {
            "batch": "W23",
            "description": "None",
            "founded_date": "2022.0",
            "founder_1_description": "Shanelle is the cofounder and CEO of Nebula. Shanelle was previously a PM at Google, working on the buying experience for a new $XB line of Google ads. Originally from Minnesota, she graduated from Yale with a degree in Computer Science.",
            "founder_1_linkedin": "https://www.linkedin.com/in/shanelle-roman-37baa6103/",
            "founder_1_name": "Shanelle Roman, Founder",
            "founder_2_description": "Vishnu Menon is the Co-founder & CTO of Nebula, where he builds tools that help engineers be productive in microservice architectures. Previously, he was co-founder at an ML startup (Toucan AI) and lead data & platform projects at a MarTech software provider (AddShoppers). He earned a degree in Computer Science from Duke University.",
            "founder_2_linkedin": "https://www.linkedin.com/in/vishnu-menon/",
            "founder_2_name": "Vishnu Menon, Founder",
            "generated_description": "**Company Summary: Indexical**\n\nFounded in 2022 and based in San Francisco, Indexical is a nimble player in the world of data extraction. As part of Y Combinator’s Winter 2023 batch, they're building an AI-powered data extraction engine tailored for developers. With a team of just two, Indexical aims to serve a broad spectrum of businesses through intelligent, efficient web scraping.\n\n**Mission and Product:**\nThe primary mission of Indexical is to simplify data extraction with an AI-driven approach. They offer a platform that allows users to write and run web scraping pipelines using natural language, eliminating the need for complex coding and maintenance. It's backed by advanced LLMs (Large Language Models) that navigate the web and extract data smartly, so users don’t have to deal with fragile selectors and the headaches of scripting browser interactions.\n\n**Key Features:**\n- **Zero-Maintenance Pipelines:** Users can craft scraping jobs with well-documented, version-controllable JSON pipelines.\n- **Fault-tolerant Scrapers:** Automatic handling of proxying, retries, and rate limits to ensure successful data extraction.\n- **Fully Managed Services:** An accessible API, CLI, and web UI make it easy to create, run, and monitor scraping tasks.\n\n**Pricing Plans:**\nIndexical offers competitive pricing with plans tailored to various needs:\n- **Free:** $0/month, featuring 1,000 monthly credits.\n- **Hobby:** $30/month for 3,000 credits.\n- **Startup:** $100/month grants 20,000 credits and priority support.\n- **Growth:** At $500/month, this plan includes 150,000 credits and exclusive support options.\n\n**Contact and Resources:**\nTo explore their offerings or sign up, you can visit [Indexical's website](https://indexical.dev/). They also provide support through a chat function for those who require additional help or credits.\n\n**Conclusion:**\nWith its innovative approach to data extraction and a focus on developer-friendly solutions, Indexical stands out as a promising startup in the generative AI and SaaS landscape. It’s an exciting venture that aligns well with the growing need for smarter data handling within businesses.",
            "headline": "AI-powered data extraction engine",
            "location": "San Francisco",
            "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/66d2c2e1e2fcc305d67b6197312f6ada5420c3c0.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191429Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=43d2dcd9043b0c9f827105ccbf985203b483df635e25cbfcc23ed4538e48ec9c",
            "name": "Indexical",
            "social_links": [
                "https://www.linkedin.com/company/trynebula/",
                "https://twitter.com/try_nebula"
            ],
            "tags": [
                "developer-tools"
            ],
            "team_size": "2.0",
            "website": "https://indexical.dev/",
            "ycpage": "https://www.ycombinator.com/companies/indexical"
        }
    },
    {
        "id": "trellis",
        "score": 3.771334649,
        "metadata": {
            "batch": "W24",
            "description": "Trellis converts your unstructured data into SQL-compliant tables with a schema you define in natural language. With Trellis, you can now run SQL queries on complex data sources like financial documents, contracts, and emails. Our AI engine guarantees accurate schema and results.\r\n\nLeading enterprises use Trellis to:\r\n\n1. Unlock hidden revenue in their customer data (e.g., Underwriting teams use Trellis to extract key features from transaction data and build better risk models.)\r\n2. Supercharge RAG applications by enabling end-users to ask analytical questions not possible before with traditional Vector DB (e.g., what are the top three features that users are requesting)\r\n3. Enrich their data warehouse with business-critical information (e.g., Retrieving detailed pricing and quantity information of products sold on competitor websites)",
            "founded_date": "2023.0",
            "founder_1_description": "Mac is the co-founder and CEO of Trellis. Previously, he worked at the Stanford AI lab on large multimodal models with the DoD and built ML infrastructure at Cresta, Moveworks, and Amazon. Mac started his first company at 15, building water leak detection systems, and grew it to six figures in ARR.",
            "founder_1_linkedin": "https://linkedin.com/in/sirapop-klinkachorn-stanford",
            "founder_1_name": "Mac Klinkachorn, Founder",
            "founder_2_description": "Jacky is a co-founder of Trellis and has taught hundreds of Stanford graduate students how to build, train, and deploy AI models in the Stanford School of Engineering & Graduate School of Business. Previously, he worked at Meta, the World Bank, and Wayfair.",
            "founder_2_linkedin": "https://linkedin.com/in/jhslin",
            "founder_2_name": "Jacky Lin, Founder",
            "generated_description": "**Trellis: Simplifying Unstructured Data with AI**\n\nFounded in 2023, Trellis is a burgeoning startup that shines a light on the untapped potential of unstructured data through its innovative AI-powered platform. Primarily designed for leading enterprises, Trellis transforms complex data—from financial documents to contracts and emails—into SQL-compliant tables. This is done using schemas defined in natural language, meaning that anyone can utilize it without needing a technical background. The real kicker? Their AI engine ensures that the results are consistently accurate.\n\n### What Trellis Does\n\nTrellis is all about unlocking value from data that is often relegated to a digital graveyard. Here are some of the ways businesses benefit from using Trellis:\n\n1. **Hidden Revenue Unlocked**: Underwriting teams can extract key features from transaction data, allowing them to build enhanced risk models and unlock hidden revenue embedded within their customer data.\n   \n2. **Supercharging Applications**: Traditional Vector databases can pose limitations on analytics. Trellis enables users to ask questions that were previously impossible, such as identifying top user-requested features.\n\n3. **Data Warehouse Enrichment**: Trellis provides vital business intelligence, like retrieving competitor pricing information, enriching data warehouses with actionable insights.\n\n### Built for Speed and Flexibility\n\nTrellis is not just about data conversion; it promises rapid processing. Their advanced OCR (Optical Character Recognition) captures text and handwriting with high precision, converting documents into usable data in mere seconds rather than weeks. Whether through customizable APIs or a no-code interface, users have the flexibility to adapt Trellis to their workflow, allowing for a more efficient and effective data operation.\n\n### Security First\n\nEnterprises can breathe a sigh of relief knowing Trellis is built with robust security protocols, including SOC II Type 2 compliance and HIPAA readiness. Notably, their AI doesn’t train on customer data, ensuring confidentiality and data integrity at all stages.\n\n### Key Details\n\n- **Team Size**: 34 employees\n- **Location**: Not specified\n- **Y Combinator Batch**: W24\n- **Website**: [Trellis](https://runtrellis.com)\n\nTrellis is positioning itself as a game-changer in the realm of data engineering, with a clear mission to empower businesses by making hidden insights accessible and actionable. If you're dealing with unstructured data, it might be worth checking them out to see what treasures you can unearth.",
            "headline": "AI-powered workflows for unstructured data",
            "location": "None",
            "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/a9aa062970cb27a2fb9084b549fe538013596260.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192027Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=60a4f295124cc724999403056b8d2b3aedc068dce51d0ee6ef7f3f50726efbde",
            "name": "Trellis",
            "social_links": [
                "https://www.linkedin.com/company/runtrellis",
                "https://twitter.com/runtrellis"
            ],
            "tags": [
                "artificial-intelligence"
            ],
            "team_size": "34.0",
            "website": "https://runtrellis.com/",
            "ycpage": "https://www.ycombinator.com/companies/trellis"
        }
    },
    {
        "id": "cambioml",
        "score": 4.439566024,
        "metadata": {
            "batch": "S23",
            "description": "CambioML providing ML tools for extracting and reconstruct text and data from PDFs, HTMLs and forms. Join the enterprise data gold mining from your legacy docs.",
            "founded_date": "2023.0",
            "founder_1_description": "Co-founder and CEO of CambioML. Previously Applied Scientist at AWS; Built LLMs and Led open-source ML projects D2L.ai adopted by over 500 universities around the world; AWS senior speaker: talked at AWS re:Invent, Nvidia GTC, KDD, etc..",
            "founder_1_linkedin": "https://linkedin.com/in/rachelsonghu",
            "founder_1_name": "Rachel Hu, Founder",
            "generated_description": "CambioML, a company founded in 2023 and part of the Y Combinator Batch S23, is shaking up the world of data extraction from documents with its innovative tool, AnyParser. Their mission is straightforward but powerful: to retrieve and transform data from PDF files and forms, enabling businesses to mine valuable insights from their legacy documents. If you've ever wrestled with cumbersome data extraction processes, you'll appreciate what CambioML offers.\n\nAt its core, CambioML started with machine learning-powered tools designed to accurately extract and reconstruct text and data from PDFs, HTML documents, and forms. With a small but focused team of three, the startup is poised to make a substantial impact. Their current offering, AnyParser, streamlines the document parsing process, allowing users to drag and drop various document types—PDFs, PPTs, Word files, and images—and pull out structured data in a mere few clicks.\n\nWhat makes AnyParser stand out? Well, it doesn’t just grab text; it handles complex layouts, including tables, charts, and footnotes, with unmatched precision. Unlike many traditional OCR tools that often require tedious post-processing, AnyParser achieves up to 2.5 times more recall and 2 times more precision compared to industry averages. It incorporates privacy features that automatically redact personally identifiable information during extraction, making it suitable for businesses that prioritize data security.\n\nUsers of AnyParser have praised it for its ease of use, speed, and remarkable accuracy. Jobright, a prominent job search platform, reported that AnyParser outperformed more than ten other parsers, establishing itself as the fastest and most reliable solution available.\n\nThe company is led by some savvy leadership, including their Group Partner Michael Seibel, who has a proven track record in helping startups thrive. With a clean and functional website [CambioML.com](https://www.cambioml.com/), they're making it easy for businesses to access their API and try out their sandbox for free—no credit card needed!\n\nIn summary, CambioML is on a mission to transform legacy documents into actionable data with their advanced parsing technology. For anyone dealing with large volumes of unstructured data, it’s a game-changer ready to simplify extraction processes and drive productivity. Keep an eye on this promising startup—they're just getting started!",
            "headline": "Retrieve and transform data from PDFs and forms",
            "location": "None",
            "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/768075bd804a33e6af73d3614b41ccc09b209e2e.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191038Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=ce68f933028cc98e70cdcefd7fbc21423acf983578f963cc9b6349779a431ac5",
            "name": "CambioML",
            "social_links": [
                "https://www.linkedin.com/company/96598226",
                "https://twitter.com/cambioml",
                "https://github.com/CambioML"
            ],
            "tags": [],
            "team_size": "3.0",
            "website": "https://www.cambioml.com/",
            "ycpage": "https://www.ycombinator.com/companies/cambioml"
        }
    },
    {
        "id": "quickchat-ai",
        "score": 7.896028847,
        "metadata": {
            "batch": "S18",
            "description": "Quickchat AI empowers companies to build their own Multilingual AI Assistants powered by generative AI models such as GPT. Thanks to our powerful integrations and API they can add the power of conversational AI to any website, product, app, game or smart device. Backed by Y Combinator and other notable investors.",
            "founded_date": "2018.0",
            "founder_1_description": "Co-Founder & CTO at Quickchat AI. Previously: Applied Scientist at Microsoft, Data Scientist at Featurespace.",
            "founder_1_linkedin": "https://www.linkedin.com/in/piotrgrudzien",
            "founder_1_name": "Piotr Grudzien, Founder/CEO",
            "generated_description": "### Quickchat AI: Revolutionizing Conversational AI\n\n**Overview**  \nQuickchat AI, founded in 2018 and based in Warsaw, Poland, is a cutting-edge platform that allows businesses to create their own multilingual AI assistants powered by advanced generative models like GPT. They enable companies to enhance their customer interactions across websites, applications, games, and other digital ecosystems. Quickchat AI gained their initial momentum by participating in Y Combinator’s Batch S18 and has since attracted notable investors.\n\n**Mission Statement**  \nQuickchat AI aims to simplify and elevate the process of conversation design, empowering companies to create AI assistants that are tailored to specific business needs. \n\n**The Product**  \nThe platform allows users to customize AI assistants that can serve various functions, from customer support to sales optimization. They boast an extensive feature set, including:\n\n- **Multilingual Capabilities:** Supports over 100 languages to cater to a global audience.\n- **Customizable AI Agents:** Businesses can tailor the functionality, personality, and integrations of their AI to reflect their brand and operational needs.\n- **Integration Friendly:** Seamless integration with existing tools like Slack, HubSpot, Zendesk, and others makes it easy for businesses to incorporate AI directly into their workflows.\n\n**Target Use Cases**  \nQuickchat AI focuses on several key areas:\n- **Customer Support:** Automate responses, manage inquiries in various languages, and ensure smooth human handoff when necessary.\n- **Sales and E-Commerce:** Assist customers by providing product recommendations and lead generation through conversational analytics.\n- **Research:** Utilize AI for interviewing and data collection, making research processes more efficient.\n\n**Team and Growth**  \nWith a small but dedicated team of 14 employees, Quickchat AI is growing rapidly and has created over 7,000 AI agents that handle more than 10 million interactions. Their technology is not only battle-tested but is continuously refined through ongoing research on leading AI models.\n\n**Pricing and Accessibility**  \nThey offer a 7-day free trial with no credit card required, allowing businesses to experiment with building their customized AI agents before making a financial commitment. Current promotional offers also provide discounts for the initial months of service.\n\n**Testimonials and Trust**  \nTrusted by over 1,000 companies globally, Quickchat AI has received positive feedback for its user-friendly interface and effective functionality. Customers report significant improvements in user satisfaction and operational efficiency after integrating their AI technologies.\n\nIn summary, Quickchat AI is at the forefront of the conversational AI landscape. If you're looking to leverage the power of AI to enhance your customer interactions and operational efficiency, Quickchat AI provides the tools you need to succeed in a rapidly evolving digital world. \n\nFor more information, check out their website at [quickchat.ai](https://quickchat.ai).",
            "headline": "Conversation Design platform to build Al Assistants tailored to yourâ¦",
            "location": "Warsaw, Poland",
            "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/782aa648581d75e02ba55fd8bd224fa075eae792.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191702Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=1d90eb10520f9dc0fd930d8f9b0443f2148a10bb88476a250f5c0e2fb0112c02",
            "name": "Quickchat AI",
            "social_links": [
                "https://www.linkedin.com/company/quickchatai",
                "https://twitter.com/quickchatai"
            ],
            "tags": [
                "artificial-intelligence"
            ],
            "team_size": "14.0",
            "website": "https://quickchat.ai/",
            "ycpage": "https://www.ycombinator.com/companies/quickchat-ai"
        }
    },
    {
        "id": "stack-ai",
        "score": 6.71240604,
        "metadata": {
            "batch": "W23",
            "description": "With Stack AI, any organization can deploy custom AI agents to automate its back-office operations. Our low-code interface allows teams of all levels of expertise to build internal tools.\r\n\nHundreds of companies use Stack AI to build knowledge-based AI assistants, fill out RFPs and questionnaires, automate content QA, conduct due diligence research, and extract data from documents.",
            "founded_date": "2022.0",
            "founder_1_description": "Co-Founder of Stack AI (W23). MIT PhD. AI for Enterprise.",
            "founder_1_linkedin": "https://www.linkedin.com/in/baceituno/",
            "founder_1_name": "Bernardo Aceituno, Founder",
            "founder_2_description": "Co-Founder of Stack AI (W23). MIT PhD. Bringing us one step closer to AGI.",
            "founder_2_linkedin": "https://www.linkedin.com/in/rosinol/",
            "founder_2_name": "Antoni Rosinol, Co-Founder & Customer Support",
            "generated_description": "**Stack AI: Empowering Enterprises with Custom AI Solutions**\n\nFounded in 2022 and hailing from Y Combinator's W23 batch, Stack AI is a San Francisco-based startup with a mission to democratize the deployment of AI agents in enterprise settings. Their innovative low-code platform empowers organizations—regardless of technical expertise—to effortlessly automate back-office operations. \n\nThink of it as giving every team member the toolkits to create their own knowledge-based AI assistants. This approach has attracted hundreds of companies keen on improving their workflows by automating tasks such as filling RFPs, conducting due diligence research, content quality assurance, and data extraction from various documents.\n\nWith a lean but talented team of 16, Stack AI is making waves in the enterprise automation space. They’re not just about tech; they’re about enabling teams. As Nicolas Dessaigne leads the charge, Stack AI is solidly positioned at the intersection of artificial intelligence and enterprise efficiency—a combination that promises to reshape how businesses operate.\n\nFor more details about their offerings and vision, check out their website: [Stack AI](https://www.stack-ai.com/).",
            "headline": "AI Agents for the Enterprise",
            "location": "San Francisco",
            "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/2300bdabfbe4f7c60014ec33431510a5c6ccfb28.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191946Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=63320a5b5aba16b0463989397e05120fc29239540c823000daa7262be539e231",
            "name": "Stack AI",
            "social_links": [
                "https://www.linkedin.com/company/stackai/",
                "https://twitter.com/StackAI_HQ"
            ],
            "tags": [
                "artificial-intelligence"
            ],
            "team_size": "16.0",
            "website": "https://www.stack-ai.com/",
            "ycpage": "https://www.ycombinator.com/companies/stack-ai"
        }
    },
    {
        "id": "deepgram",
        "score": 4.298777061,
        "metadata": {
            "batch": "W16",
            "description": "Deepgram is a foundational AI company on a mission to understand human language. We give any developer access to the most advanced speech AI transcription and understanding with just an API call.\r\n\nOur models deliver the fastest, most accurate transcription alongside contextual features like summarization, sentiment analysis, and topic detection. Beyond that, developers can:\r\n🔊 Process live-streaming or pre-recorded audio\r\n🌎 Transcribe in dozens of languages\r\n⚙️ Train custom models for unique use cases\r\n🔑 Access deep NLU with a unified API\r\n💻 Build in any programming language with our SDKs\r\n✅ Deploy on-prem or on DG’s managed cloud\r\n📈 Get scalable GPU infra for training and inference\r\n\nDeepgram is a proud NVIDIA partner and Y Combinator company, and we recently completed a $72M Series B to define the future of AI Speech Understanding, making us the most-funded speech AI company at its stage.",
            "founded_date": "2015.0",
            "founder_1_description": "Technical CEO, DL person, particle physicist.",
            "founder_1_linkedin": "https://www.linkedin.com/profile/view?id=AAMAABp1p9YBj-vzJ-6PnwBthOxU-SSancWwG5w",
            "founder_1_name": "Scott Stephenson, Founder/CEO",
            "generated_description": "**Company Overview: Deepgram**\n\n**Mission:** Deepgram aims to build foundational AI for speech transcription and understanding, democratizing access to advanced speech technology for developers worldwide.\n\n**Background:** Founded in 2015 as part of Y Combinator’s Batch W16, Deepgram has rapidly grown to become a leader in the AI-driven speech processing space. Headquartered in San Francisco, the company employs a team of about 115 talented individuals and has secured a notable position in the industry, as evidenced by its recent $72 million Series B funding round.\n\n**What They Offer:**\nDeepgram's platform provides an array of powerful tools and APIs that developers can tap into with just a simple API call. Key features include:\n\n- **Speech-to-Text API:** Exceptional transcription speed and accuracy, allowing for real-time and pre-recorded audio processing.\n- **Text-to-Speech API:** Natural-sounding voices that enhance user interaction.\n- **Voice Agent API:** Facilitates real-time communication between users and AI agents, perfect for customer service automation.\n- **Audio Intelligence API:** Offers capabilities like summarization, sentiment analysis, and topic detection, enriching the way audio data is utilized.\n\n**Technical Highlights:**\n- Supports live-streaming and transcribed audio in multiple languages.\n- Custom model training for unique use cases, enabling tailored solutions.\n- Unified API for deep Natural Language Understanding (NLU).\n- Accessibility across various programming languages through SDKs.\n\n**Scalability:** Deepgram provides scalable GPU infrastructure for training and inference, making it ideal for businesses of all sizes, from startups to enterprises. The company prides itself on being cost-effective—often described as 3-5 times cheaper than its competitors—while delivering superior accuracy and speed, reportedly up to 40 times faster for tasks like transcription.\n\n**Reputation and Partnerships:** Trust and reliability are underscored by partnerships with industry heavyweights, including NVIDIA. Their technology is used by major organizations such as NASA, Twilio, and Citi.\n\n**Community Engagement:** With over 200,000 developers utilizing its platform, Deepgram has built a vibrant community. They offer resources like documentation, tutorials, and an API playground for hands-on experimentation.\n\n**Conclusion:** Deepgram stands out not just as a speech AI company, but as a visionary player in the future of language processing. With a focus on accuracy, scalability, and developer accessibility, they are well-positioned to define the next generation of AI speech technology. Whether you’re looking to enhance customer service solutions, automate transcription, or innovate in the AI space, Deepgram provides the tools and support to make it happen. \n\nFor more information, check out their [website](https://www.deepgram.com).",
            "headline": "Building foundational AI for speech transcription and understanding.",
            "location": "San Francisco",
            "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/2478412f5bb5dd9361e2396ad62e50ef32ae2de7.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191115Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=94bfe94c836877cd4cc89b7bca2d3c66d2a4f5ed51cd9ca8da53fa186a870402",
            "name": "Deepgram",
            "social_links": [
                "https://www.linkedin.com/company/deepgram",
                "https://www.twitter.com/DeepgramAI",
                "https://www.facebook.com/deepgram",
                "https://www.crunchbase.com/organization/deepgram",
                "https://github.com/deepgram"
            ],
            "tags": [
                "ai-enhanced-learning"
            ],
            "team_size": "115.0",
            "website": "https://www.deepgram.com",
            "ycpage": "https://www.ycombinator.com/companies/deepgram"
        }
    },
    {
        "id": "momentic",
        "score": 6.6917460559999995,
        "metadata": {
            "batch": "W24",
            "description": "Momentic is the most advanced AI platform for testing. We're accelerating engineering teams at companies like Retool, Podium, Chegg, Runway, and many more.",
            "founded_date": "2023.0",
            "founder_1_description": "Wei-Wei Wu is a co-founder and CEO of Momentic. Previously, he worked at Assembled, building infrastructure and real-time features. Before that, he was the first employee and founding engineer at Nashi, a startup tackling RTO during Covid, which was acquired by Density in 2021.",
            "founder_1_linkedin": "https://linkedin.com/in/hungweiwu",
            "founder_1_name": "Wei-Wei Wu, Founder",
            "founder_2_description": "I'm a curious and driven technical founder hailing from Toronto, Canada. I love up-leveling others through my work and after graduating from the University of Waterloo, I found my calling in cloud and test infrastructure at companies like Splunk, Google, and Robinhood. Aside from engineering, I love traveling the world (over 100K miles flown in 2023!), playing piano, and hiking.",
            "founder_2_linkedin": "https://linkedin.com/in/jeff-an",
            "founder_2_name": "Jeff An, Founder",
            "generated_description": "**Momentic: Revolutionizing Software Testing with AI**\n\nFounded in 2023 and incubated in Y Combinator Batch W24, Momentic is making waves as a pioneering AI platform aimed at modernizing the software testing landscape. Headquartered in San Francisco, this nimble team of six is already partnering with notable engineering groups at companies like Retool, Podium, Chegg, and Runway. Momentic claims to set the \"modern standard for software testing,\" which is a bold statement, but they back it up with innovative features that resonate particularly well with both developer and non-developer teams.\n\n### What Momentic Offers:\n\n1. **Speed and Efficiency**: With their intuitive low-code editor, Momentic allows teams to create and deploy tests faster than ever. This integration into developer workflows means less friction and more shipping.\n\n2. **AI-Powered Automation**: Their technology intelligently handles the often-frustrating issue of flaky tests, automatically adapting and improving over time. This means engineers can focus on new features rather than maintenance headaches.\n\n3. **Flexibility in Testing**: Whether in the cloud, locally, or even behind private networks, Momentic provides the versatility to run tests anytime and anywhere. Their CI/CD pipeline compatibility further enhances the appeal for modern engineering teams.\n\n4. **User-Centric Design**: Momentic caters to teams held back by the complexities of traditional testing tools. It combines ease of use with powerful capabilities, enabling even junior developers to take part in creating automated tests right from their first day on the job.\n\n### Key Features:\n\n- **AI-Powered Assertions**: Users can create assertions in natural language, making the platform approachable for everyone.\n- **Auto-Healing Locators**: Forget about the maintenance of conventional locators—Momentic locates elements based on descriptions, making test scripts resilient to changes.\n- **Version Control Friendly**: Test files are stored in YAML format, making them easy to edit and sync alongside application features.\n\n### Testimonials:\n\nMomentic’s impact is illustrated through endorsements from various engineering leads who highlight how the platform has dramatically decreased manual QA efforts and boosted productivity. Users have noted the simplicity of getting results—one developer shared they could run extensive evaluations in a fraction of the time it used to take them manually.\n\nIf you’re looking to enhance your testing processes and leverage the benefits of AI, Momentic presents a compelling case. You can explore more about them or even book a demo through their website: [momentic.ai](https://momentic.ai).\n\nIn summary, Momentic seems to understand the modern developer’s challenges and has engineered an AI solution that not only addresses these but does so in a way that feels accessible and powerful. Whether you’re a startup looking to scale fast or an established company aiming to streamline, Momentic might just be the tool you need for your software testing arsenal.",
            "headline": "The modern standard for software testing",
            "location": "San Francisco",
            "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/735a61b597dd6405f559fd19ca3412b6d10d713d.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191546Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=5b1e63c937c2067d2af4826b3bcb06d0c4e45c53d9880bf8ee41802dda6fa179",
            "name": "Momentic",
            "social_links": [
                "https://www.linkedin.com/company/momentic-ai",
                "https://twitter.com/MomenticAI",
                "https://www.crunchbase.com/organization/momentic-0b4b",
                "https://github.com/momentic-ai"
            ],
            "tags": [
                "developer-tools"
            ],
            "team_size": "6.0",
            "website": "https://momentic.ai",
            "ycpage": "https://www.ycombinator.com/companies/momentic"
        }
    },
    {
        "id": "spur",
        "score": 5.966302335,
        "metadata": {
            "batch": "S24",
            "description": "Never code up another test or hire an external QA team. We handle and automate all functional and E2E testing.",
            "founded_date": "2024.0",
            "founder_1_description": "Co-founder and CEO at Spur. Previously, Growth Engineer at Figma and Snap.",
            "founder_1_linkedin": "https://www.linkedin.com/in/TrFrp/",
            "founder_1_name": "Sneha Sivakumar, Founder",
            "founder_2_description": "Co-founder and CTO at Spur. Previously @ Yale CS, Deepmind, and Meta.",
            "founder_2_linkedin": "https://linkedin.com/in/anushka-nijhawan-8380361b1",
            "founder_2_name": "Anushka Nijhawan, Founder",
            "generated_description": "**Company Overview: Spur**\n\nFounded in 2024 and hailing from Y Combinator Batch S24, Spur is transforming how businesses conduct quality assurance (QA) testing. Located in the heart of San Francisco, this ambitious startup operates with a lean team of just four employees. Their mission is simple yet profound: \"Spur is your AI QA Engineer. Test your websites with natural language.\" \n\nThe concept behind Spur is to streamline and automate the testing process, allowing users to generate tests effortlessly—no coding required. In essence, they eliminate the need for manual testing or hiring external QA teams.\n\n**How It Works:**\nSpur stands out because it uses natural language processing to create automated tests. Users can describe what they want to test, and Spur handles the technical intricacies. This AI-driven approach means tests adapt automatically to changes in a website's user interface. Forget about the days of wrestling with brittle CSS selectors! Spur significantly reduces maintenance overhead and truly democratizes testing, making it accessible to team members across all levels—from developers to product managers.\n\n**Notable Achievements:**\nSpur has already demonstrated its capabilities by helping clients like Wander.com increase their release velocity significantly—by up to 20 times! Testimonials from early adopters—including companies like Figma, Stack, and Polymet—indicate that they've achieved impressive efficiencies by integrating Spur into their workflows.\n\n**Partnerships and Backing:**\nBacked by notable investors like Jared Friedman and driven by its innovative tool, Spur has gained traction among tech-forward startups looking to optimize their testing processes. Their tool plays nicely within CI/CD pipelines, making it a go-to option for product teams keen on ensuring high-quality software.\n\n**Why It Matters:**\nWith the tech landscape continuously evolving, manual testing can be an overwhelming bottleneck for startups and scale-ups alike. Spur is tackling this challenge head-on, offering a no-code solution that not only speeds up testing but also enhances reliability. \n\nIn summary, Spur is making waves in the developer tools space by redefining how quality assurance can be conducted—efficiently, intuitively, and without the need for extensive technical skills. If you're in the market for an AI-powered, user-friendly testing solution, checking out their demo may be well worth your time. \n\n**Want to learn more?** Visit their website at [spurtest.com](https://www.spurtest.com/) to explore their offerings and book a demo.",
            "headline": "Spur is your AI QA Engineer. Test your websites with natural language.",
            "location": "San Francisco",
            "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/13c551cbd70019d8168b188587ad5267616d4cd0.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191943Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=9305641da104499157fdf578440af1e982173de8c22a8d7f9fd6ac844b697e73",
            "name": "Spur",
            "social_links": [
                "https://www.linkedin.com/company/spur-test/",
                "https://x.com/spur_dev"
            ],
            "tags": [
                "developer-tools"
            ],
            "team_size": "4.0",
            "website": "https://www.spurtest.com/",
            "ycpage": "https://www.ycombinator.com/companies/spur"
        }
    }
]