{
    "links": "https://www.ycombinator.com/companies/10-by-10",
    "name": "10 By 10",
    "headline": "10by10 is a unique marketplace in the recruiting agency industry forâ\u0080¦",
    "batch": "S17",
    "description": "10by10 is a marketplace to instantly match qualified candidates with companies by pooling candidates across recruitment agencies. Check out the testimonials on our website (www.10by10.io).",
    "activity_status": "Active",
    "website": "https://10by10.io",
    "founded_date": null,
    "team_size": 5.0,
    "location": "San Francisco",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:artificial-intelligence; industry:marketplace; industry:recruiting; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "April Chang, Founder/CEO",
            "description": "What is 10x10? It's our commitment to revolutionizing hiringâ\u0080\u009410x better, 10x faster. Our hard work turned a slogan into reality: connected 80 senior engineers with a startup in only 2 weeks, with 10 in final interviews by week 3!\n\nFlexport, Front, Grammarly, Iterable, Monte Carlo, Niantic, Otter.ai, Plaid, and 200+ trust 10by10 to hire the best talent fast. \n\nApril has an extensive engineering background, serving as the Head of Payments at PayPal and VP of Engineering at both Eventbrite.",
            "linkedin": "https://www.linkedin.com/in/aprilschang/"
        },
        {
            "name": "Robert Bartruff, Founder",
            "description": null,
            "linkedin": "https://www.linkedin.com/in/robertbartruff"
        }
    ],
    "status": true,
    "generated_description": "### 10 By 10: Revolutionizing Recruitment with 10x Efficiency\n\n**Company Overview:**\n10 By 10 is a fresh take on talent acquisition, designed to streamline the hiring process for tech companies. Founded during Y Combinator's Batch S17 and headquartered in San Francisco, it stands out in the crowded recruiting agency landscape by leveraging AI alongside human expertise. With a nimble team of five, they precisely cater to the needs of employers and candidates alike through a unique marketplace model.\n\n**Mission:**\nThe core mission of 10 By 10 is to create an impeccable marketplace that connects companies with qualified candidates faster than ever. By aggregating talent from a wide network of recruiting agencies, they ensure employers find the right fit without the cumbersome wait typically associated with hiring.\n\n**How It Works:**\n10 By 10 offers an innovative fusion of AI technology and personalized recruiter support. Here’s the breakdown:\n- **AI Automation:** Their software quickly analyzes job requirements, uncovering candidates that traditional job boards and social platforms may miss.\n- **Human Touch:** Recruiters extend the network reach by aggregating candidates' data from various agencies, giving employers access to a broader talent pool. \n- **Quality & Speed:** They boast a 70% candidate progression rate—substantially above the industry standard—meaning employers interview a majority of the candidates presented to them.\n\n**User Experience:**\nEngaging with 10 By 10 entails no upfront costs, and clients only pay when a hire is successfully made. The platform promises same-day setup, making it an appealing option for companies needing to ramp up their teams rapidly.\n\n**Client Testimonials:**\nThe effectiveness of 10 By 10 is illustrated through a multitude of client testimonials claiming that the service outperforms traditional recruiting strategies. Users report making rapid, quality placements, significantly easing their hiring burdens. This credibility is earned not just through speed but also through a dedicated follow-up process that emphasizes candidate fit and satisfaction.\n\n**The Bigger Picture:**\nFor startups and tech companies navigating the fierce talent market, 10 By 10 is much more than just a service—it's a partnership aimed at achieving sustainable growth. With a diverse array of talent pools and backed by seasoned industry veterans, 10 By 10 empowers both candidates and companies during the recruitment journey.\n\n**Website & Contact:**\nFor those interested in transforming their hiring approach, more information can be found on their website [10 By 10](https://10by10.io). Whether you're looking to fill a position efficiently or want to learn about becoming a part of their recruiting network, 10 By 10 is poised to reshape your perspective on recruitment.\n\nIn an age where speed and quality are paramount, 10 By 10 is here to redefine how we think about hiring in the tech industry. \n\n### Summary:\nIn a nutshell, 10 By 10 combines cutting-edge technology with human insight, significantly reducing the time and effort involved in recruitment. Their unique approach not only fills open positions more efficiently but also fosters a quality-driven hiring environment that benefits both employers and candidates.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/f050e2f522cc47b9e0f585dee4298977ef60dcd6.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T190937Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=0da7d681a2e2e1e4e00e86dad82dba770a4d1a9f785ccdd92cd947c3858af9b8",
    "social_links": [
        "https://www.crunchbase.com/organization/10-by-10"
    ],
    "logo_path": "data/logos\\10_By_10_logo.png"
}