{
    "links": "https://www.ycombinator.com/companies/1910-genetics",
    "name": "1910 Genetics",
    "headline": "Make undruggable targets a thing of the past",
    "batch": "W19",
    "description": "We are a biotechnology company integrating AI, computation and biological automation to accelerate the design of small molecule and protein therapeutics. Our mission is to decrease the timeline and cost of drug development, while improving the success rate of bring innovative medicines to patients in need.\r\n\nWe have two drug discovery engines - ELVIS™ and ROSALYND™ - that enable the design of both small molecule and protein therapeutics, an unmatched capability in the AI drug discovery space. Our therapeutic area-agnostic, end-to-end technology powers the full length of early drug discovery - from novel hit discovery to hit to lead, and lead optimization. \r\n\nWe are currently applying our technology to drug discovery programs in several areas including, but not limited to, neuroscience, infectious disease, immunology and oncology.",
    "activity_status": "Active",
    "website": "http://1910genetics.com",
    "founded_date": 2018.0,
    "team_size": 14.0,
    "location": "Cambridge, MA",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:ai-powered-drug-discovery",
    "founders": [
        {
            "name": "Jen Asher, Founder & CEO",
            "description": "Founder & CEO @ 1910 Genetics",
            "linkedin": "http://www.linkedin.com/in/jenasherphd"
        }
    ],
    "status": true,
    "generated_description": "### 1910 Genetics: Making Undruggable Targets History\n\nFounded in 2018 and proudly part of Y Combinator’s Batch W19, **1910 Genetics** is shaking up the biotech world. Based in Cambridge, MA, the company is on a mission: to tackle the drug development process by converting “undruggable” targets into viable therapeutic options. They aim to slash both the timelines and costs associated with bringing new drugs to market, all while improving the success rates of these innovative medicines.\n\nAt the core of 1910 Genetics’ approach are two powerful drug discovery engines named **ELVIS™** and **ROSALYND™**. These platforms are unique in that they enable the design of both small molecules and protein therapeutics—a real achievement in the realm of AI-driven drug discovery. This comprehensive, end-to-end technology covers everything from novel hit discovery to lead optimization, capable of powering various drug discovery programs across diverse therapeutic areas including neuroscience, oncology, immunology, and infectious diseases.\n\nWhat sets 1910 Genetics apart is its strategic integration of AI with three proprietary data streams: computational data, wet lab proxy biological data, and wet lab ground truth biological data. This multimodal AI platform, enhanced by laboratory automation, allows them to deliver novel drug candidates and software solutions to both pharmaceutical giants and tech partners, while simultaneously advancing their own pipeline aimed at treating neurological and autoimmune disorders, as well as cancers.\n\nTheir vision? To make the once-unreachable undruggable targets a thing of the past. They believe that through their innovative infrastructure layer for tech-enabled drug discovery, they can reshape the landscape of how drugs are discovered and developed.\n\nWith a lean, dedicated team of 14 and backed by notable investors like Microsoft, Playground Global, Scientia Ventures, and even the likes of Sam Altman from OpenAI, 1910 Genetics is not just witnessing change—it’s driving it. If you’re intrigued, you can explore more about their work and mission on their [website](http://1910genetics.com). \n\nIn a field that often feels stagnant, 1910 Genetics stands out as a beacon of possibility, ready to redefine what we thought was possible in drug discovery.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/ecea530f0eb267cbb6616c803aeb619c222b67cd.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T190937Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=06aa6ac90c8d019c8a698da7edbf125502a5f57dfdf2806f78bbc5b402de695d",
    "social_links": [
        "https://www.linkedin.com/company/1910genetics",
        "https://twitter.com/1910Genetics"
    ],
    "logo_path": "data/logos\\1910_Genetics_logo.png"
}