{
    "links": "https://www.ycombinator.com/companies/8vdx",
    "name": "8vdx",
    "headline": "Scaling credit underwriting & investing with fine-tuned AI models",
    "batch": "W22",
    "description": "8vdx is building fine tuned AI/ML models to massively scale up the capabilities for hedge funds and private credit funds to analyze, underwrite and manage debt securities. 8vdx also manages a venture marketplace, eightcapital.com, which raises funds from accredited investors to invest in venture debt and equity of Y Combinator startups.",
    "activity_status": "Active",
    "website": "http://www.8vdx.com",
    "founded_date": 2021.0,
    "team_size": 11.0,
    "location": "Norwalk, CT",
    "group_partner": "Jared Friedman",
    "group_partner_yc": "https://www.ycombinator.com/people/jared-friedman",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:artificial-intelligence; industry:fintech; industry:saas; industry:workflow-automation; industry:analytics",
    "founders": [
        {
            "name": "Ravi Chachra, Founder",
            "description": "Ravi is a YC founder, 8vdx.ai (W22), and has invested in over 150 YC companies through a demo day fund, Eight Capital. In 1999, he co-founded SNAZ, a venture backed mobile wallet and universal shopping cart. After the Dot.com bust, he set up a distressed fund to acquire busted convertibles bonds of tech cos that could thrive in the future. In 2019, he set up a pvt. credit fund which was sold in 2021 to his JV partner, J.C. Flowers & Co. Ravi holds a Degree in Computer Science and a Wharton MBA.",
            "linkedin": "https://www.linkedin.com/in/rchachra/"
        },
        {
            "name": "Vijay Lavhale, Founder",
            "description": "Vijay is the Co-Founder of 8vdX, where he applies AI/ML to revolutionize credit investing workflows for large-scale, multi-billion-dollar funds. He also invests in early-stage tech startups through Eight Capital, which has backed over 150 Y Combinator companies in recent years. Vijay brings deep analytical and quantitative expertise from his experience at Goldman Sachs. A CFA charterholder and seasoned tech operator, he is dedicated to advancing credit investment practices through technology.",
            "linkedin": "https://www.linkedin.com/in/vijay-lavhale-86b06938/"
        }
    ],
    "status": true,
    "generated_description": "**Company Overview: 8vdx**\n\nFounded in 2021 and nestled in Norwalk, CT, 8vdx is a forward-thinking fintech startup that’s making waves in the credit underwriting and investment space. As part of the prestigious Y Combinator Batch W22, the company has a mission to scale credit analysis and investing through the power of finely-tuned artificial intelligence and machine learning models.\n\n### What They Do\n\n8vdx builds sophisticated AI models that drastically enhance hedge funds and private credit fund capabilities in analyzing, underwriting, and managing debt securities. Their solutions transform traditionally manual workflows into automated, scalable processes that enable investors to act faster and more intelligently in complex markets.\n\nOne of their standout products is a venture marketplace, [eightcapital.com](http://www.eightcapital.com), which connects accredited investors with opportunities in venture debt and equity, particularly in promising Y Combinator startups. \n\n### Team and Leadership\n\nWith a compact, yet mighty team of 11 employees led by Group Partner Jared Friedman, 8vdx combines expertise in finance and technology to fuel its innovative spirit.\n\n### Key Offerings\n\n1. **Automated Analytics**: 8vdx aims to slash data analysis time from days to mere minutes, putting timely insights at investors' fingertips.\n   \n2. **Precision Insights**: Their AI delivers targeted insights tailored to specific investment strategies, ensuring clients stay ahead of market trends.\n\n3. **Enhanced Workflows**: Tools such as automated investment memo generation, accurate data extraction for Excel models, and seamless portfolio monitoring empower clients to focus on sound decision-making rather than on manual data handling.\n\n4. **Smart Bond Screening**: The platform allows users to screen thousands of bonds and generate concise summaries quickly, capitalizing on data-driven AI models tailored to their unique intellectual property.\n\n5. **Compliance and Security**: With SOC 2 compliance under their belt, 8vdx ensures that clients' sensitive data is treated with the utmost care and confidentiality.\n\n### Why Choose 8vdx?\n\nIn a world where speed and accuracy can dictate investment success, 8vdx stands out as a reliable partner. Their AI solutions are custom-built to integrate seamlessly into existing workflows while safeguarding data privacy, making them a uniquely valuable asset for hedge funds and private credit investors.\n\nWhether you're navigating complex debt markets or looking to tap into emerging start-ups, 8vdx is poised to help you unlock new levels of efficiency and insight.\n\nFor more information, visit their website at [www.8vdx.com](http://www.8vdx.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/15c7c763c51994ca8c00863ab5695fb6d4e5b4d9.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T190937Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=0d96d9b5bc0a67e6eae6ab69efbf92734dbd7c5050e7970abbe4998b371a69bd",
    "social_links": [
        "https://www.linkedin.com/company/8vdx/about/",
        "https://twitter.com/8vdxOfficial",
        "https://www.facebook.com/8vdxOfficial",
        "https://www.crunchbase.com/organization/8vdx"
    ],
    "logo_path": "data/logos\\8vdx_logo.png"
}