{
    "links": "https://www.ycombinator.com/companies/9gag",
    "name": "9gag",
    "headline": "Make the world happier.",
    "batch": "S12",
    "description": "9GAG  is the global cross-platform entertainment media network. It is a place for fun, conversation, and engagement. Founded in 2008, 9GAG’s mission is to make the world happier. \r\n\n9GAG has a total of 150 million global audience with 39 million followers on Facebook, 44 million on Instagram and 15 million on Twitter. Being #1 ranked global social media platform in entertainment & gaming, #1 ranked US's cross-platform video creators, we distribute 2.2 billion social video views on a monthly basis (source: tubular labs). 9GAG.com is #6 most followed  brand on Instagram and is a top 200 website globally.\r\n\n9GAG is backed by: Freestyle Capital, True Ventures, First Round Capital, Greycroft Partners, 500 Startups, Y Combinator and a group of great angel investors in the United States. eg Anthony Soohoo, Benjamin Ling, BoxGroup, Gary Vaynerchuk, James Hong, Kevin Rose, Karl Jacob, Lowercase Capital, Maneesh Arora, Naval Ravikant, Othman Laraki, Philip Kaplan, Rich Chen, Rich Lefurgy, Scott and Cyan Banister, Tim Ferriss.",
    "activity_status": "Active",
    "website": "http://9gag.com",
    "founded_date": 2007.0,
    "team_size": 36.0,
    "location": "Hong Kong, Hong Kong",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:social-media; industry:social; industry:social-network",
    "founders": [],
    "status": true,
    "generated_description": "9gag: Bringing Happiness to the Internet\n\nFounded in 2008 and hailing from Hong Kong, 9gag started with a straightforward mission: to make the world happier. This goal is realized through a vibrant and engaging cross-platform entertainment media network that has become a cornerstone of online fun and interaction.\n\nWith a global audience of around 150 million, the numbers are impressive. 9gag boasts 39 million followers on Facebook, 44 million on Instagram, and 15 million on Twitter. No wonder it’s recognized as the #1 global social media platform in entertainment and gaming. On a monthly basis, they achieve 2.2 billion social video views, making them a dominant force in the realm of viral content (source: Tubular Labs). Their website, 9gag.com, is also noteworthy, ranking among the top 200 globally and being the 6th most followed brand on Instagram.\n\nThe company is well-supported financially, with backing from a variety of esteemed investors and venture capital firms—think Freestyle Capital, True Ventures, and Y Combinator. Notable angel investors include names like Gary Vaynerchuk and Naval Ravikant, emphasizing the seriousness of 9gag’s growth and potential.\n\nWith a lean team of just 36 dedicated employees, 9gag maintains the agility needed to engage with its audience effectively. Their offerings include a website and various interactive features like Shuffle and an app available for download. Additionally, they tap into niche content through platforms like Memeland, catering to a diverse array of interests.\n\nFor anyone looking to brighten their day or get lost in the endless scroll of entertaining posts, 9gag remains a go-to destination. To explore more, visit their site at [9gag.com](http://9gag.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/3b631639f88a7df70fb12d6834bbbfa66fbaff7e.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T190937Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=9afa5cdc49b1a975c9061602b32120c9ac07ce2b1249c93f7f694004b72d331a",
    "social_links": [
        "https://linkedin.com/company/9gag",
        "https://twitter.com/9GAG",
        "https://facebook.com/9GAG",
        "https://www.crunchbase.com/organization/9gag",
        "https://github.com/9gag"
    ],
    "logo_path": "data/logos\\9gag_logo.png"
}