{
    "links": "https://www.ycombinator.com/companies/abacum",
    "name": "Abacum",
    "headline": "Helping Finance teams be 10x faster",
    "batch": "W21",
    "description": "Abacum, is a SaaS platform, which makes is it easy for finance teams to use real-time data, generate reports and collaborate. We have been defined as the notion for finance.",
    "activity_status": "Active",
    "website": "https://www.abacum.io/",
    "founded_date": 2020.0,
    "team_size": 110.0,
    "location": "New York",
    "group_partner": "Michael Seibel",
    "group_partner_yc": "https://www.ycombinator.com/people/michael-seibel",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:finops; industry:saas; location:new-york",
    "founders": [
        {
            "name": "Jorge Lluch, Founder",
            "description": "Passionate about technology, startup financing and making things happened.\n\nBefore launching Abacum. I have been really lucky to work on 3 of the most successful internet companies in Spain: Travelperk, Wallapop and Privalia. And work along one of the best serial entrepreneurs in Spain, Martin Varsavsky.\nAnd the most important thing, working hard with my wife to raise three incredible kids.\nFive times Marathon finisher - Barcelona 2015 and 2017, Madrid 2016 and Valencia 2018(sub 3h) and 2019",
            "linkedin": "https://www.linkedin.com/in/jorgelluch/"
        },
        {
            "name": "Julio Martinez, Founder",
            "description": "Julio is the co-founder and CEO of Abacum, the Financial Planning automation platform (W21). Previously, he launched a Fintech Venture Builder, scaling it 10x in 18 months. Prior to that, Investment Banking at Citi in NYC, Sao Paulo and Zurich. MBA from IESE Business School and SEP from Stanford Business School. Husband and father of 3 awesome kids. Constantly working in personal growth. Proficient paella cook.",
            "linkedin": "https://www.linkedin.com/in/juliomartinez1982/"
        }
    ],
    "status": true,
    "generated_description": "**Abacum: Streamlining Finance with Real-Time Insights**\n\nFounded in 2020 and part of Y Combinator's W21 batch, Abacum is a New York-based startup revolutionizing financial planning and analysis (FP&A) for finance teams. With a mission to make these teams \"10x faster,\" Abacum has crafted a SaaS platform that harnesses real-time data, simplifying reporting and enhancing collaboration.\n\n### What They Do\nAbacum's platform is designed for agility and ease of implementation. Unlike many solutions that take months to set up, Abacum can be integrated within weeks. It offers powerful tools for budgeting, forecasting, revenue planning, headcount planning, investor reporting, and comprehensive financial analysis (P&L, BS, CF).\n\nThis isn't just about speed; it's about turning finance teams into strategic drivers within their organizations. With features that allow for collaborative planning, customizable dashboards, and integrations with over 50 data sources, Abacum empowers finance professionals to make data-driven decisions quickly and effectively.\n\n### Team and Culture\nBased in New York with a team of 110 employees, Abacum benefits from strong backing under the mentorship of Michael Seibel, a seasoned partner at Y Combinator. This connection infuses the culture with a startup ethos: fast-paced, innovative, and deeply committed to customer success.\n\n### Customer-Centric Approach\nAbacum stands out with a user satisfaction rating of 4.8 out of 5, demonstrating their dedication to meeting customer needs. They understand that finance is not just about numbers; it’s about narrative and strategy. The platform supports finance teams in surfacing insights that can directly influence business decisions, ensuring that they're not just seen as number-crunchers but as critical players in driving growth.\n\n### Resources and Learning\nThey also provide extensive resources, such as actionable guides like \"Lead the Business as a 10x CFO,\" to empower finance leaders with strategies and tools to thrive in their roles. Their educational content is complemented by case studies that showcase how they've helped various organizations improve efficiencies and drive performance.\n\n### Conclusion\nAbacum is reshaping how finance teams operate in the digital era. By focusing on real-time insights and fostering collaboration, they are not just offering software; they're setting the stage for finance to take on a more strategic role in businesses. If you’re in the finance space and looking to level up your team’s performance, Abacum might just be the game-changer you need. \n\nFor more details, check out their official site: [Abacum.io](https://www.abacum.io).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/4fafd879e1e9068d9450555de32f01fb5df6fc90.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T190937Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=b6045f08ffce6b039b3780cc013b0f0f65bede10a5104391b4eb673f05e0bc2d",
    "social_links": [
        "https://www.linkedin.com/company/abacum-io/about/?viewAsMember=true",
        "https://twitter.com/Abacum_io",
        "https://www.crunchbase.com/organization/abacum",
        "https://github.com/abacum-io"
    ],
    "logo_path": "data/logos\\Abacum_logo.png"
}