{
    "links": "https://www.ycombinator.com/companies/abalone-bio",
    "name": "Abalone Bio",
    "headline": "We discover antibody drugs others can't",
    "batch": "W20",
    "description": "Abalone Bio developed a technology to find antibody drugs that activate and modulate cell surface receptors, the “antennae” on cells that help convert chemical signals into cellular responses, like growth. Antibodies are a growing class of drugs that have tremendous safety and efficacy advantages over small molecules; 7 of the top 10 selling drugs are antibodies, earning an average of $7B in revenue. However, antibodies- especially ones that activate and modulate cell surface receptors- are hard to find. Abalone Bio expands the playing field for antibody therapeutics and enables us to previously access treatments for untreated diseases.\r\n\nWe have already discovered a novel antibody that activates a non-opioid receptor that produces analgesia. We are developing this antibody into a treatment for neuropathic pain – a medical condition that currently is treated with drugs like addictive opiates. The same molecule is also a potential treatment for inflammatory and fibrotic diseases, all 1B+ markets.",
    "activity_status": "Active",
    "website": "https://www.abalonebio.com",
    "founded_date": 2018.0,
    "team_size": 12.0,
    "location": "Emeryville, CA",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:machine-learning; industry:synthetic-biology; industry:drug-discovery; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Richard Yu, Founder",
            "description": "Rich has been in or around biotech startups since 2008, when co-founded GPB, an algae biofuel startup. He was also Scientific and Operations Director at MBC Biolabs, the leading biotech incubator in SF, and Principal at Mission Bay Capital, a life science VC fund. Prior, he was an investigator at The Molecular Sciences Institute studying how cells process information.\nPhD (2000) Molecular Biophysics and Biochemistry, Yale\nBA (1993) Biophysics and Computer Science (AI and Graphics), UC Berkeley",
            "linkedin": "https://www.linkedin.com/in/richard-c-yu/"
        },
        {
            "name": "Gustavo Pesce",
            "description": null,
            "linkedin": "https://www.linkedin.com/in/gustavopesce/"
        }
    ],
    "status": true,
    "generated_description": "### Overview of Abalone Bio\n\n**Mission:** Abalone Bio is on a quest to uncover antibody drugs that others have overlooked. They aim to revolutionize how we treat diseases by focusing on the challenges inherent in accessing hard-to-target biological pathways.\n\n**Founded:** 2018, Abalone Bio emerged from innovative thought, sitting comfortably in the esteemed Y Combinator Batch W20.\n\n**Location:** Based in Emeryville, CA, a hub for biotech and innovation in the San Francisco Bay Area.\n\n**Team:** A nimble team of 12 experts, each bringing deep knowledge from various fields like machine learning, synthetic biology, and drug discovery. They also have support from their Group Partner, Nan.\n\n### The Challenge\n\nAntibodies, the backbone of modern therapeutics, are incredibly specific but can be hard to find, especially those that activate and modulate cell surface receptors—like switches that translate external signals into internal actions. The result? Many promising drug targets remain untreated, leaving millions of patients without effective therapies.\n\n### The Solution\n\nEnter Abalone Bio's **Functional Antibody Selection Technology (FAST)**, a platform designed to quickly generate antibody activators for notoriously difficult targets, specifically focusing on G-protein coupled receptors (GPCRs). The significance of this approach is immense as GPCRs regulate a vast array of biological responses.\n\n1. **Massive Parallelism:** Abalone Bio’s technology allows the examination of 100 million antibodies simultaneously. This scale is about 100 times more than what traditional methods can achieve. In essence, they measure the activity of potential antibodies, not just their ability to bind.\n\n2. **AI Integration:** They've integrated artificial intelligence into the process to predict which antibodies will be effective, a pioneering move within the industry.\n\n3. **Real-World Impact:** They are currently developing a novel antibody designed to treat neuropathic pain, among other conditions that traditional treatments often fail to address. Their discoveries also open up options for tackling inflammatory and fibrotic diseases—each representing billion-dollar markets.\n\n### The Leadership Team\n\n- **Richard Yu, PhD** - CEO and Co-Founder: A veteran in the startup realm with a background in biophysics and computer science.\n- **Toshi Takeuchi, PhD** - CSO: With over 20 years of industry expertise, Toshi drives R&D efforts and academic partnerships.\n- **Monica Schwartz, PhD** - VP of Antibody Discovery: Spearheads early discovery efforts and platform technology development.\n- **Lauren Schwimmer** - VP of Preclinical Development: A seasoned developer responsible for numerous successful antibody drug programs.\n- **Sameer Soi** - VP of Data Science & AI: Focuses on leveraging data and machine learning to optimize the drug discovery process.\n\n### Conclusion\n\nAbalone Bio isn’t just about creating drugs; it's about redefining the possibilities of treatments that could profoundly improve lives. With a focus on cutting-edge technology and an ambitious leadership team, they are positioned to make significant strides in the therapeutic landscape. As they tackle unmet medical needs, the potential for impact is vast—both in terms of revenue and, more importantly, human health.\n\nTo learn more, visit their website: [Abalone Bio](https://www.abalonebio.com)",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/ac513caf58509be03827e2c1e1359b1ef5f2ecc1.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T190937Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=0d7e0bb878de1a858c08eab26786b5543a907ca66c832113895a074ee558f378",
    "social_links": [
        "https://www.linkedin.com/company/18295627",
        "https://www.crunchbase.com/organization/abalone-bio-inc"
    ]
}