{
    "links": "https://www.ycombinator.com/companies/abatable",
    "name": "Abatable",
    "headline": "Carbon markets platform and solutions",
    "batch": "S21",
    "description": "Abatable is a carbon offsetting procurement platform which connects companies with carbon project developers of high quality carbon offsets. Abatable facilitates procurement decisions by offering third party quality assessments of projects and by standardizing multi-year purchase agreements and an automated RFP platform. The team has extensive experience advising institutional investors on nature-based carbon removal and impact investment portfolios and is backed by leading investors like YCombinator, BlueBear Capital and Global Founders Capital.",
    "activity_status": "Active",
    "website": "https://www.abatable.com",
    "founded_date": 2021.0,
    "team_size": 35.0,
    "location": "London, United Kingdom",
    "group_partner": "Gustaf Alstromer",
    "group_partner_yc": "https://www.ycombinator.com/people/gustaf-alstromer",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:carbon-capture-and-removal; industry:b2b; industry:climate",
    "founders": [
        {
            "name": "Maria Eugenia Filmanovic, Founder",
            "description": "Prior to founding Abatable, Maria worked as a Vice President at Goldman Sachs and advised large corporates and institutional investors on nature-based carbon removal and impact investment portfolios, most recently focused on work around carbon offsetting procurement",
            "linkedin": "https://www.linkedin.com/in/mariafilmanovic/"
        },
        {
            "name": "Valerio Magliulo, Founder",
            "description": "Valerio has extensive Product and Operations experience across all stages of tech including Uber, where he launched operations in multiple UK cities, Monzo, where he joined as an early employee and grew the product from 30k to 2m customers, Google, where he worked on machine learning applications for healthcare, and most recently Facebook, where he led their global efforts to fight COVID-19 and vaccine misinformation. He’s also a mentor at Techstars and Seedcamp.",
            "linkedin": "https://www.linkedin.com/in/valerio-magliulo/"
        }
    ],
    "status": true,
    "generated_description": "**Abatable: Bridging the Gap in Carbon Markets**\n\nFounded in 2021, Abatable is a carbon markets solutions company based out of London, UK. At its core, the company seeks to empower organizations to take decisive climate action by facilitating carbon offsetting through a streamlined procurement platform. Abatable's mission is to connect businesses with reputable carbon project developers, ensuring that they can confidently invest in high-quality carbon offsets.\n\nThe platform provides a robust framework for procurement decisions, complete with third-party quality assessments and standardized agreements. Its automated Request for Proposal (RFP) system makes it easier for companies to find and assess projects, which is critical given the evolving landscape of carbon markets.\n\nAbatable was birthed from a keen understanding of the urgent need for effective climate action, addressing a staggering $4 trillion shortfall required to combat climate change. By focusing on voluntary carbon markets, it intends to optimize financial flows to projects that deliver genuine, measurable benefits to the environment.\n\nThe team's strength lies in their extensive expertise in nature-based carbon removal and impact investment, drawing from backgrounds that include advising institutional investors. They are backed by leading investors such as Y Combinator and Global Founders Capital, which adds a layer of credibility and support to their operations.\n\nWith a growing team of 35 and recognition as part of Y Combinator’s Batch S21, Abatable is poised to unlock significant environmental and financial potential while partnering with well-known organizations such as AutoTrader, Nestlé, and L'Oréal. The company has already facilitated transactions that account for over 52 million tonnes of CO2e and restored more than 1.8 million hectares of land.\n\nIn addition to its core services, Abatable continually engages its clients through educational outreach, providing resources like blogs, reports, podcasts, and webinars that help navigate the complexities of the carbon market.\n\nThe climate crisis is pressing, and companies are increasingly recognizing the importance of sustainability in their operations. Abatable meets this need head-on, ensuring that organizations not only set ambitious climate goals but have the necessary tools and insights to realize those objectives. You can explore more about them at [Abatable's website](https://www.abatable.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/05ae0891e452a57bb25c96b100b99e9007255bb8.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T190937Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=8c16356788affb4d5de4587f32c798ff472139f5d45d17ad24ca22603244ac28",
    "social_links": [
        "https://www.linkedin.com/company/abatable",
        "https://twitter.com/abatableuk"
    ],
    "logo_path": "data/logos\\Abatable_logo.png"
}