{
    "links": "https://www.ycombinator.com/companies/abhi",
    "name": "Abhi",
    "headline": "Abhi is Pakistan's 1st financial wellness platform focusing onâ\u0080¦",
    "batch": "S21",
    "description": "An early wage access platform allowing salaried employees to draw down a percentage of their accrued salary before the next payroll cycle. Helping employees to avoid late payment fee on bills, access emergency cash and substitute expensive debt. We work on a B2B2C model allowing companies to extend the product as a benefits program to their employee base.",
    "activity_status": "Active",
    "website": "https://abhi.com.pk/",
    "founded_date": 2021.0,
    "team_size": 10.0,
    "location": "Pakistan",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech",
    "founders": [
        {
            "name": "Omair Ansari, Founder",
            "description": "An investment Banker by background with a \nparticular focus on Emerging/Frontier equity market \nspace, both public and private. Lived on the ground \nin over 8 countries, specifically in places like Lagos, \nDubai, Bombay, Johannesburg, to name a few. He \nwas a PM at Morgan Stanley running 2 funds with a \nfocus on consumer and fintech.",
            "linkedin": "https://linkedin.com/in/omair-ansari-40494329"
        },
        {
            "name": "Ali Ladhubhai, Founder",
            "description": "Ali is an ex-banker who has held managerial roles in retail  banking/ wealth management with HSBC and Samba Bank in Pakistan. Ali co-founded Karlocompare.com.pk, a  financial services aggregator helping some of the largest  financial institutions (banks and insurance companies) in Pakistan distribute their consumer finance products digitally. He subsequently moved to Foreepay (Pvt) Ltd, an accounts aggregator & payments company where he  was leading the Business Development department.",
            "linkedin": "https://pk.linkedin.com â\u0080º ali-ladhubhai-205b0710a"
        }
    ],
    "status": true,
    "generated_description": "**Company Summary: Abhi**\n\n**Overview:**  \nAbhi is pioneering the financial wellness landscape in Pakistan as the country's first fintech platform focused on enhancing employee financial well-being. Founded in 2021 and a proud participant in Y Combinator's S21 batch, Abhi initially launched as an early wage access service. This innovative offering enables salaried employees to withdraw a portion of their earned wages before the end of the payroll cycle, helping them sidestep late fees on bills and avoid costly debt.\n\n**Mission:**  \nAbhi aims to empower employers to bolster the financial health of their teams through accessible financial options. By operating on a B2B2C model, Abhi partners with businesses to integrate its financial wellness programs directly into employee benefits, fostering a culture of financial security at work.\n\n**Products and Services:**  \n- **Abhi Salary:** Employees can access their earned wages instantly via a mobile app or SMS, breaking the traditional monthly pay cycle.\n- **Abhi Payroll:** A user-friendly software solution for businesses that simplifies payroll management, making it more efficient and enjoyable for employees.\n- **Abhi Kaarobar:** A financing service designed for businesses to maintain healthy cash flow, tailored for small enterprises and individual merchants.\n- **Abhi Pay:** This feature facilitates seamless transactions for users, enhancing the overall experience in managing finances.\n\n**Team and Location:**  \nBased in Karachi, Pakistan, Abhi operates with a small but effective team of 10 individuals, dedicated to delivering exceptional service and support to their clients.\n\n**Recognition and Growth:**  \nAbhi has quickly established itself as an essential player in the fintech space, currently serving over 450 companies. The platform not only provides immediate financial solutions but also positions itself to adapt to the ever-evolving needs of businesses and employees alike, significantly impacting their financial wellness.\n\n**Contact Information:**  \nFor more information or to inquire about services, visitors can check out their website at [Abhi](https://abhi.com.pk/) or contact them directly at connect@abhi.com.pk or via phone at 021-111-224-475. Their office is located at 505 A, 5th Floor, Fortune Towers, Shahrah-e-Faisal, Karachi, Pakistan. \n\nAbhi is simply transforming the way financial wellness is approached in Pakistan, making it clear that timely access to wages isn't just a convenience; it's a necessity!",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/b541a615552fc09a0d75b1fab4b958576db21719.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T190937Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=77e1705585cecc63208bcad242631868b06897ed528fc4924446978bccba7489",
    "social_links": [
        "https://www.linkedin.com/company/abhikaropk",
        "https://twitter.com/abhikaropk",
        "https://www.facebook.com/abhikaropk",
        "https://www.crunchbase.com/organization/abhi"
    ],
    "logo_path": "data/logos\\Abhi_logo.png"
}