{
    "links": "https://www.ycombinator.com/companies/accessowl",
    "name": "AccessOwl",
    "headline": "Managing your Employees' Access to SaaS",
    "batch": "S22",
    "description": "AccessOwl automates employee SaaS account provisioning and permissioning for any tool. IT teams from companies like Zeplin and Sary save 30 minutes on every request.\r\n\nAccess management used to be an enterprise problem. With work from home, exploding SaaS usage and the need for SOC2 certifications startups have the same problems as enterprises. \r\n\nMathias and Philip have built several startups and teams before and experienced the same problems around access management over and over again. Philip was the CEO and Co-Founder of blik, an award winning IoT solution that was used by Volkswagen and BMW. Mathias built the leading private payment infrastructure provider in Germany as well as the first digital car insurance as Co-Founder and CTO. Based on these experiences we decided to build a solution we wish we could have used when building our former companies.\r\n\nAccessOwl can be deployed within minutes instead of weeks by simply installing a Slack application. We save companies that use AccessOwl 30 minutes for every access request, on- and offboarding.",
    "activity_status": "Active",
    "website": "https://www.accessowl.io/",
    "founded_date": 2022.0,
    "team_size": 4.0,
    "location": "Berlin, Germany",
    "group_partner": "Dalton Caldwell",
    "group_partner_yc": "https://www.ycombinator.com/people/dalton-caldwell",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:saas; industry:b2b; industry:compliance; industry:security",
    "founders": [
        {
            "name": "Philip Eller, Founder",
            "description": "As CEO and Co-Founder of blik I sold thousands of IoT devices to BMW and Volkswagen before building out new business units for Compado (Ad-Tech). Scaling from 0-1.8M in profits selling within a single year. AccessOwl is solving the problems we had ourselves when scaling business in the past.",
            "linkedin": "https://de.linkedin.com/in/philip-eller-7667238b"
        },
        {
            "name": "Mathias Nestler, Founder",
            "description": "Mathias Nestler is the co-founder and CTO of AccessOwl. He is a Forbes 30 under 30 Entrepreneur and CTO with 10+ years of experience in Technology. Former CTO & Co-Founder of FRIDAY.de (InsurTech). Former CTO of viafintech.com (FinTech). Loves to work on great products.",
            "linkedin": "https://www.linkedin.com/in/mathias-nestler-a8436044/"
        }
    ],
    "status": true,
    "generated_description": "**AccessOwl: Simplifying SaaS Access Management**\n\nFounded in 2022 and part of Y Combinator Batch S22, AccessOwl is a Berlin-based company focused on streamlining the management of employees' access to Software as a Service (SaaS) applications. The brainchild of Mathias and Philip, both seasoned entrepreneurs with prior startup experience, AccessOwl addresses a growing need for effective access management in a world where remote work and SaaS solutions are proliferating.\n\n### Mission\nThe mission of AccessOwl is simple: to manage and automate employee access to various SaaS platforms. Initially designed to streamline the provisioning and permissioning of employee accounts, it helps IT teams reduce the average time spent on access requests by 30 minutes per request. This efficiency is crucial as the lines blur between startups and enterprises regarding access management challenges, particularly for organizations pursuing SOC2 certifications.\n\n### The Founders\nMathias and Philip bring a wealth of experience to AccessOwl. Philip previously served as CEO and Co-Founder of Blik, an IoT solution recognized by major players like Volkswagen and BMW. Mathias has a rich background as the Co-Founder and CTO of a leading private payment infrastructure provider in Germany and launched the country’s first digital car insurance. Their collective experiences highlighted the recurring issues in access management that they sought to resolve with AccessOwl.\n\n### Product Overview\nDeploying AccessOwl is a breeze — IT can get it up and running in minutes simply by adding a Slack application. The platform supports a range of features including automated user provisioning, access request handling via Slack, vendor management, and SaaS spend management. It eliminates the need for complex integrations like SCIM or SAML, cutting down the time and complexity often associated with identity governance. \n\nCore functionalities include:\n- **Shadow IT Discovery**: Identify every application used within the organization.\n- **Access Reviews**: Conduct reviews in minutes instead of weeks.\n- **Automated Provisioning**: Streamline user onboarding and offboarding processes.\n- **Requests & Approvals**: Facilitate direct access requests and approvals via Slack.\n- **Vendor Management**: Centralize all vendor interactions.\n- **SaaS Spend Management**: Monitor and optimize software expenditure.\n\nThe promise here is saving companies considerable amounts of time and reducing the friction often found in access management workflows.\n\n### Team and Partnerships\nWith a lean team of four and backing from Y Combinator, AccessOwl is also under the guidance of Group Partner Dalton Caldwell, a notable name in the startup ecosystem. \n\n### Conclusion\nAccessOwl is positioned to be a game-changer in the SaaS access management space, providing essential tools to manage apps, user access, and compliance efficiently. As the landscape of digital business evolves, companies like AccessOwl will be instrumental in helping organizations navigate the complexities of digital security and user management. \n\nTo learn more or get started, visit [AccessOwl's website](https://www.accessowl.io/).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/f1c7ee9ad553c23f1656a09f18ee65bb300a536c.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T190943Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=789ec7481a5f7e73c5254b1da1d86e96eeb1d24f86c93524783b0b6f3b4d2dc8",
    "social_links": [
        "https://www.linkedin.com/company/accessowl"
    ],
    "logo_path": "data/logos\\AccessOwl_logo.png"
}