{
    "links": "https://www.ycombinator.com/companies/accredible",
    "name": "Accredible",
    "headline": "Digital credentials to recognize achievement",
    "batch": "IK12",
    "description": "Accredible is connecting education with economic value. We want hiring to be about what you can do, your skills and potential and we want education to be better at improving careers.\r\n\nAccredible is the industry-leading digital credentialing platform that securely issues, manages, tracks, and verifies over 80 million career-advancing credentials globally. Accredible integrates with learning software, including Canvas, D2L Brightspace, Kajabi, Kryterion Webassessor, Moodle, Thinkific, and more. Over 2,000 leading universities, associations, and technology companies such as Google, Skillsoft, Slack, Junior Achievement USA, Chartered Banker Institute, University of Cambridge, AMPP, Hootsuite, IEEE, Cengage, MIT, Rutgers, UC Berkeley, AMBA, and The Digital Marketing Institute rely on Accredible to create, deliver, and manage digital certificates and open badges.",
    "activity_status": "Active",
    "website": "http://www.accredible.com",
    "founded_date": 2013.0,
    "team_size": 125.0,
    "location": "Berkeley, CA",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:saas; location:san-francisco-bay-area",
    "founders": [],
    "status": true,
    "generated_description": "Accredible is a prominent digital credentialing platform based in Berkeley, California, founded in 2013 and part of Y Combinator’s Batch IK12. Its mission? To bridge the gap between education and economic opportunity by providing secure, verifiable digital credentials that enhance career prospects. \n\nAt its core, Accredible focuses on enabling learning institutions, associations, and technology companies to issue and manage digital certificates and badges effortlessly. With over 80 million credentials issued globally, it's become a trusted partner for more than 2,000 educational entities, including heavyweights like Google, MIT, and UC Berkeley.\n\nThe platform integrates seamlessly with various learning management systems (LMS) like Canvas, D2L Brightspace, and Moodle, making it a versatile option for organizations looking to innovate their credentialing processes. Accredible provides features such as customizable credential design, real-time tracking, and automated sharing to social media, thus \"boasting program awareness and learner engagement.\"\n\nAccredible thrives on a dual approach — not only does it offer a powerful technological solution, but it also emphasizes customer partnership, offering professional services to ensure that clients achieve their program goals. The company recognizes that in today’s world, credentials need to communicate skills effectively to open opportunities, and they help institutions create meaningful credentials that add real value.\n\nTheir emphasis on microcredentials and digital badges allows for a more granular representation of skills, catering to modern learner expectations. \n\nWith a team of about 125 employees, Accredible is well-positioned in the SaaS market, specifically in the San Francisco Bay Area. It's not just about certificates; it's about unlocking potential. If you're in education or training, it might be worth exploring how digital credentials can elevate your programs. For more information, visit their website at [accredible.com](http://www.accredible.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/c376961e7785fcc81af3ffc54c48e9509af674ac.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T190942Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=a32884f6df4ffa39af1ad5ad7167d4a4bf05c769b5c50a7c1be69f7aed8551b5",
    "social_links": [
        "https://www.linkedin.com/company/accredible",
        "https://twitter.com/Accredible",
        "https://www.facebook.com/Accredible/",
        "https://www.crunchbase.com/organization/accredible",
        "https://github.com/accredible"
    ],
    "logo_path": "data/logos\\Accredible_logo.png"
}