{
    "links": "https://www.ycombinator.com/companies/aclu",
    "name": "ACLU",
    "headline": "Defender of rights and liberties",
    "batch": "W17",
    "description": "The ACLU is our nation's guardian of liberty, working daily in courts, legislatures and communities to defend and preserve the individual rights and liberties that the Constitution and laws of the United States guarantee everyone in this country. The ACLU is a nonprofit and nonpartisan organization that has grown from a roomful of civil liberties activists in 1920 to an organization of more than 500,000 members and supporters today. We handle nearly 6,000 court cases annually from our offices in almost every state.\r\n\nThe ACLU is supported by annual dues and contributions from its members, plus grants from private foundations and individuals. We do not receive any government funding. \r\n\nWe protect:\r\nYour First Amendment rights - freedom of speech, association and assembly; freedom of the press, and freedom of religion. \r\nYour right to equal protection under the law - protection against unlawful discrimination. \r\nYour right to due process - fair treatment by the government whenever the loss of your liberty or property is at stake. \r\nYour right to privacy - freedom from unwarranted government intrusion into your personal and private affairs. \r\nThe ACLU also works to extend rights to segments of our population that have traditionally been denied their rights, including people of color; women; lesbians, gay men, bisexuals and transgender people; prisoners; and people with disabilities.",
    "activity_status": "Active",
    "website": "https://www.aclu.org/",
    "founded_date": null,
    "team_size": 501.0,
    "location": "New York",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:nonprofit; industry:legal; location:new-york",
    "founders": [],
    "status": true,
    "generated_description": "## ACLU: A Snapshot\n\nThe American Civil Liberties Union (ACLU) is a stalwart defender of rights and liberties in the United States. Founded in 1920, it began as a small group of civil liberties activists and has grown into a powerhouse, boasting over 500,000 members and supporters nationwide. With a dedicated team of about 1,700 employees, the ACLU operates from almost every state, tackling approximately 6,000 court cases annually.\n\n### Mission and Purpose\n\nThe ACLU’s mission is straightforward yet profound: to preserve the individual rights and liberties guaranteed to all people by the U.S. Constitution and laws. This nonprofit, nonpartisan organization strives to protect a broad array of rights, including:\n\n- **First Amendment Rights:** Protecting freedoms related to speech, assembly, press, and religion.\n- **Equal Protection:** Fighting against unlawful discrimination.\n- **Due Process:** Ensuring fair treatment in legal proceedings.\n- **Privacy Rights:** Defending individuals from unwarranted government intrusions.\n\nMoreover, the ACLU is dedicated to fighting for marginalized groups who have historically faced rights denials, including people of color, women, and LGBTQ+ individuals.\n\n### Funding and Affiliation\n\nUniquely positioned among organizations of its ilk, the ACLU does not accept government funding. It relies entirely on membership dues, private contributions, and grants from foundations and individuals, which empowers it to advocate independently and vigorously.\n\n### Notable Issues and Initiatives\n\nThe ACLU actively engages in various social justice issues such as:\n\n- **Reproductive Freedom:** Advocating for the right to make personal health decisions.\n- **Racial Justice:** Addressing systemic inequalities and discriminatory practices.\n- **Voting Rights:** Protecting access to the ballot box for all citizens.\n- **Transgender Rights:** Championing the rights and dignity of transgender individuals.\n\nIn the face of ongoing threats to civil liberties, the ACLU's action is more critical than ever. They engage with communities, lobby for legislative changes, and fight in court whenever rights are violated.\n\n### Historical Impact\n\nThe ACLU has a storied history as a pioneer in civil rights advocacy. Over the decades, its legal battles have significantly influenced American law and society. Key milestones include:\n\n- **Defending Japanese Americans** during their internment in WWII.\n- Winning the landmark **Loving v. Virginia** case which overturned bans on interracial marriage.\n- Advocating for **same-sex marriage rights** in the landmark case of Obergefell v. Hodges.\n\n### Get Involved\n\nAnyone looking to support civil liberties can join the ACLU through donations or volunteer opportunities. They encourage grassroots activism through their People Power platform, allowing individuals to partake in various advocacy efforts.\n\nFor more detailed information about their ongoing work and campaigns, you can visit the ACLU’s website at [aclu.org](https://www.aclu.org/).\n\nIn essence, the ACLU embodies a commitment to uphold and extend the liberties and rights that are foundational to American democracy—an endeavor as vital today as it was over a century ago.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/a9a2975aeb08cebe2bf22bfeca1e18ba0140be99.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T190943Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=3843985d73f4a56f0c6a952b0836c87e08f87cf1957c9b2e6908ab57aaf95a37",
    "social_links": [
        "https://www.crunchbase.com/organization/american-civil-liberties-union"
    ],
    "logo_path": "data/logos\\ACLU_logo.png"
}