{
    "links": "https://www.ycombinator.com/companies/actipulse-neuroscience",
    "name": "Actipulse Neuroscience",
    "headline": "Bringing non-invasive brain stimulation from the hospital to the home",
    "batch": "W22",
    "description": "Non-invasive brain stimulation is a widely-utilized, FDA cleared treatment used for patients diagnosed with depression, but is limited to a hospital setting due to the cost of the device, and complexity of treatment application.\r\n\nOur proprietary brain stimulation device allows patients to be treated directly from their home, with the same efficacy, and at a lower cost of treatment.\r\n\nCurrently in FDA pivotal phase for Major Depressive Disorder, and Pilot phase for Alzheimer's and Parkinson diseases.",
    "activity_status": "Active",
    "website": "http://www.actipulseneuroscience.com",
    "founded_date": 2017.0,
    "team_size": 38.0,
    "location": "Cambridge, MA",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:mental-health-tech; industry:neurotechnology; industry:medical-devices",
    "founders": [
        {
            "name": "Adrien Châtillon, Founder",
            "description": "I am a serial entrepreneur (3+ startups), who has lived and worked in more than 8 countries.\nAs the CEO of a medical-tech company, my goal is to democratize access to better and more affordable mental health therapeutics.",
            "linkedin": "https://www.linkedin.com/in/adrienchatillon/"
        },
        {
            "name": "Gabriel Villafuerte, Founder",
            "description": "I am a MD/PhD in neuroscience. Passionate about applying technology to solve nervous system disorders. Frustrated (but self-taught!) engineer, industrial designer, and artist.",
            "linkedin": "https://www.linkedin.com/in/gabriel-villafuertemdphd"
        }
    ],
    "status": true,
    "generated_description": "Actipulse Neuroscience is a pioneering company specializing in non-invasive brain stimulation technologies, particularly aimed at treating psychiatric and neurological disorders. Founded in 2017 and based in Cambridge, MA, Actipulse is part of the Y Combinator W22 batch and employs a dedicated team of 38 people. Their mission is ambitious yet straightforward: to bring non-invasive brain stimulation from a hospital setting into the comfort of patients' homes. \n\nTraditionally, brain stimulation treatments like these have been restricted to clinical environments due to the complexity and high costs associated with the devices. However, Actipulse has developed a proprietary device that allows patients to receive effective treatment at home, significantly reducing the treatment's cost while maintaining efficacy.\n\nCurrently, the company is in a pivotal phase of FDA testing for its technology targeting Major Depressive Disorder and is also conducting pilot studies for Alzheimer's and Parkinson's diseases. The vision is clear—Actipulse aims to become the golden standard for neuromodulation technologies, helping millions suffering from these debilitating conditions within the next five years.\n\nTheir work is backed by the Paris Brain Institute, positioning them as a leader in the neurotechnology space, with a strong commitment to ethical and clinical research standards. Beyond just treating symptoms, Actipulse is also focused on addressing the neglected pathogenic mechanisms in neurodegenerative disorders.\n\nFor more details, check out their website [Actipulse Neuroscience](http://www.actipulseneuroscience.com). The company is geared towards a future where treatment is not only effective but also accessible, transforming the landscape of mental health and neurodegenerative disorder therapies.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/a43dcacbce9eb6cf06828991768e1f3327505d8e.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T190943Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=c1cbef295696dda3aa05a9a6b1debe84e3141bc9bd201d728cff18a4fd1dd704",
    "social_links": [
        "https://www.linkedin.com/company/actipulse-international"
    ],
    "logo_path": "data/logos\\Actipulse_Neuroscience_logo.png"
}