{
    "links": "https://www.ycombinator.com/companies/aden",
    "name": "Aden",
    "headline": "Hire Aden to run your business operations at scale",
    "batch": "W20",
    "description": "Aden is an AI-native, multi-agent ERP platform built for operations leaders to unify their business systems, streamline processes, and efficiently manage objectives. Highly customizable and rapidly deployable, Aden boosts Key Performance Indicators (KPIs) with declarative solutions and intelligent AI agents. \r\n\nCurrently, Aden helps over 100 operationally-focused businesses, including supply chain control towers of major global corporations, IT departments of major financial institutions, and other high-impact companies, elevate their efficiency, automate workflows, and scale beyond manual operations.",
    "activity_status": "Active",
    "website": "https://adenhq.com/",
    "founded_date": 2020.0,
    "team_size": 15.0,
    "location": "San Francisco",
    "group_partner": "Dalton Caldwell",
    "group_partner_yc": "https://www.ycombinator.com/people/dalton-caldwell",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:artificial-intelligence; industry:enterprise; industry:infrastructure; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Vincent Jiang, Founder",
            "description": "- Co-founder and CEO of Aden, an Operation Agent for teams to automate office tasks\n- 10 years+ of building data products and supporting data-driven organizations\n- Serial entrepreneur (1 unicorn, 2 acquired ) \n- Harvard, and UIUC engineering",
            "linkedin": "https://www.linkedin.com/in/vincentjiangx/"
        },
        {
            "name": "Timothy Zhang, Founder",
            "description": "Founding Engineer at Acho",
            "linkedin": "https://www.linkedin.com/in/jianhao-zhang/"
        }
    ],
    "status": true,
    "generated_description": "**Aden: Your AI Partner in Business Operations**\n\nFounded in 2020 and part of Y Combinator's W20 batch, Aden is a San Francisco-based company that specializes in revolutionizing business operations through its multi-agent ERP platform. The mission of Aden is straightforward: \"Hire Aden to run your business operations at scale.\" This reflects their commitment to help organizations streamline processes, unify their business systems, and vastly improve operational efficiency.\n\n### What Aden Offers\nAden's platform is designed for operations leaders aiming to boost their Key Performance Indicators (KPIs) using advanced automation powered by intelligent AI agents. The system is not just flexible; it’s also customizable and can be deployed quickly to meet the unique needs of over 100 operationally-focused businesses. These clients span various sectors, including major supply chain control towers and IT departments of leading financial institutions.\n\n### Key Features\n1. **Seamless Integration**: Bring existing systems together without the heavy cost of new tools.\n2. **Logic Adaptation**: Define and deploy systems tailored specifically to your business's complex needs.\n3. **Process Automation**: Effortlessly close process gaps with built-in service modules.\n4. **Versatility**: Create custom schemas that allow teams to remain agile as business changes.\n\n### Why Choose Aden?\nAden is built for leaders who yearn for operational excellence. By automating repetitive tasks, streamlining critical processes, and improving efficiency, Aden enables teams to concentrate on what truly matters—growing and expanding the business. Their platform has garnered high praise and a 5/5 rating on G2 from organizations that have successfully leveraged it to enhance their services, reduce software costs, and make critical decisions faster.\n\n### The Team Behind Aden\nAden operates with a dedicated team of 15 employees and is backed by Dalton Caldwell as their Group Partner. Their unique approach combines the latest in artificial intelligence with a grounded understanding of enterprise infrastructure needs.\n\n### Join a Growing List of Satisfied Clients\nWith companies like Boston Scientific and Danaher on board, Aden has proven its value across a diverse clientele. Users highlight the intuitive interface, exceptional customer service, and the significant impact Aden has on streamlining operations and enhancing productivity.\n\n### Connect with Aden\nFor those looking to scale their business without the burden of complex operations, Aden provides a one-stop solution where technology meets user-friendliness. Interested businesses can start their journey on Aden’s website: [Aden HQ](https://adenhq.com).\n\nIn short, Aden is changing how organizations think about automation and operational efficiency. Their AI-driven platform offers a compelling reason to rethink your business operations and kick manual processes to the curb.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/c2bf1f6d21ed960a3c97b5ebf8ad395fea8ad678.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T190942Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=80504fc6bb420f95f661ad13e7efe01aeff51108c9140b2daf654a11d702c3a6",
    "social_links": [
        "https://www.linkedin.com/company/teamacho/",
        "https://twitter.com/team_acho",
        "https://www.facebook.com/teamacho",
        "https://www.crunchbase.com/organization/acho",
        "https://github.com/acho-dev/acho-js#readme"
    ],
    "logo_path": "data/logos\\Aden_logo.png"
}