{
    "links": "https://www.ycombinator.com/companies/admitsee",
    "name": "AdmitSee",
    "headline": "AdmitSee is the largest searchable database of crowdsourced collegeâ\u0080¦",
    "batch": "IK12",
    "description": "The peer-to-peer platform features the largest searchable database of college and graduate school application files â\u0080\u0093 including essays, extracurriculars, test scores, and advice. The files are all uploaded by college students themselves and displayed in LinkedIn-style profiles. Prospective college students get to read real application examples and connect with the college students behind them.\r\n\nOur revenue-share model offers college students an easy way to make money by passing down their personal application journeys and insights to younger students. For every view their profiles get, they earn a commission. Not only does it bring transparency to the black box of admissions, AdmitSee believes it pays to pay it forward.\r\n\nOur mission is to level the admissions playing field so college is accessible to any student no matter their background. While the platform runs on a subscription service, we offer free access to students who qualify for aid under college readiness programs or those who attend Title I schools.\r\n\nAdmitSee has amassed millions of data points that allow the team to surface admissions insights. Both quantitative and qualitative information can be analyzed to provide big picture admissions trends or personalized recommendations for individual users. The data is applicable not just for students but also for educators and institutional players to better serve applicants.\r\n\nBy providing cost-effective, direct access to data-driven peer insights, AdmitSee empowers applicants to improve their application strategies, find trusted peer mentors, and plan for their futures.",
    "activity_status": "Active",
    "website": "https://www.admitsee.com",
    "founded_date": null,
    "team_size": 4.0,
    "location": "San Francisco",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "location:san-francisco-bay-area",
    "founders": [],
    "status": true,
    "generated_description": "AdmitSee is like a bridge between aspiration and reality in college admissions. Founded as part of Y Combinator's Batch IK12 and based in San Francisco, this startup has carved out a niche as the largest searchable database of crowdsourced college and graduate school application files. Its mission? To democratize the college admissions process by providing students access to real application examples, including essays, extracurriculars, and test scores—all shared by their peers. \n\nThe platform operates on a peer-to-peer model where college students share their successful application experiences and earn money for each view their profiles receive. This creates a win-win situation: younger students gain invaluable insights into the admissions process, while contributors can profit by helping others navigate what can often seem like a maze.\n\nAdmitSee stands out not only for its transparency but also for its commitment to accessibility. They offer free access to students from Title I schools or those qualifying for aid under college readiness programs. Whether you’re a high school student, a parent, or an educator, AdmitSee is set up to provide personalized insights through millions of data points, allowing users to identify trends and enhance their application strategies.\n\nWith a small team of four and and a community of users that includes successful college graduates from top schools, AdmitSee transforms the intimidating world of college applications into a more transparent and manageable process. If you're aiming for that dream school, check out their platform at [AdmitSee.com](https://www.admitsee.com)—it just might be what you need to get where you're going.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/b3a19df4e7a1dd1a24997df69c878b50079762b0.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T190942Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=c3cc78595f11427ad9e29309c405484730128a55a720b412608f725570cd7a46",
    "social_links": [
        "http://twitter.com/admitsee",
        "http://facebook.com/admitsee",
        "https://www.crunchbase.com/organization/admitsee"
    ],
    "logo_path": "data/logos\\AdmitSee_logo.png"
}