{
    "links": "https://www.ycombinator.com/companies/x3-builders",
    "name": "Aecore",
    "headline": "Vertically integrated commercial construction",
    "batch": "S17",
    "description": "Aecore is a technology-enabled commercial contractor focused on vertical integration and agile project delivery through automation. Our in-house design team, project managers and software engineers guide clients through the process from conceptual design to completion. We will ensure you are getting the best possible pricing by leveraging our network of contractors and material suppliers.",
    "activity_status": "Active",
    "website": "https://www.aecore.com",
    "founded_date": 2018.0,
    "team_size": 6.0,
    "location": "San Jose, CA",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:construction; location:san-francisco-bay-area",
    "founders": [],
    "status": true,
    "generated_description": "**Aecore: Building the Future of Commercial Construction in the Bay Area**\n\nAecore is a San Jose-based commercial construction company founded in 2018, and it stands out for its focus on vertical integration and technology-driven project delivery. As a Y Combinator Batch S17 graduate, Aecore has positioned itself at the cutting edge of the construction landscape. The company leverages a mix of in-house design, project management, and software engineering to guide clients seamlessly from conceptual design to project completion.\n\nThe mission? To deliver exceptional construction services while ensuring clients benefit from competitive pricing through a well-established network of contractors and material suppliers. With a compact team of 6 passionate employees, Aecore emphasizes collaboration, transparency, and innovation in every project, aiming to disrupt the status quo of traditional construction methods.\n\nAecore is not just about building structures; it's about crafting strong relationships too. They engage clients as partners in the building process, valuing their input and ensuring that every detail aligns with their vision. Their services extend across various phases of construction, covering everything from conceptual budgeting, design-build services, to comprehensive project management.\n\nTheir project portfolio is diverse and displays a commitment to various sectors, including biomedical labs, corporate offices, retail spaces, and life sciences. Aecore's distinctive approach integrates technology throughout its processes, which not only streamlines operations but also provides project stakeholders with real-time updates and insights.\n\nClients like Swift, Irvine Company, and Brookfield have praised Aecore for its responsiveness and dedication, speaking volumes of their growing reputation in the industry. \n\nIf you're considering a construction project in the San Francisco Bay Area or Nashville, TN, Aecore is ready to discuss how they can help bring your vision to life. Ready to build something exceptional? Visit their website [aecore.com](https://www.aecore.com) to learn more and schedule a call.\n\nIn a construction landscape often seen as cumbersome and traditional, Aecore is a breath of fresh air—agile, tech-savvy, and committed to excellence. It’s about time we see construction done right—and Aecore is here to make that happen.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/98e99a34f2420c4b37dd9692d5090e2d050d60c9.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T190945Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=066ac9571903077d8f2f12dc04b7c00e643423456af47fd29352ad55eb8c0b65",
    "social_links": [
        "https://www.linkedin.com/company/aecoreinc"
    ],
    "logo_path": "data/logos\\Aecore_logo.png"
}