{
    "links": "https://www.ycombinator.com/companies/aesculatech",
    "name": "AesculaTech",
    "headline": "Responsive materials, better lives.",
    "batch": "W18",
    "description": "AesculaTech believes in building better lives through smart chemistry. We design custom smart materials for a range of biomedical, commercial, and industrial applications. Our platform technology, AesculaGel offers adaptive response to a wide range of stimuli and can be tailor-made for biocompatibility, material strength, and a range of other attributes. \r\n\nFounded by one of MIT's 35 under 35 Innovators, AesculaTech is the shared vision of scientists, engineers, and medical experts. Our cornerstone product, Humidifeye, is an ophthalmic platform to treat dry eye disease. Dry eye affects more than 25 million Americans and the global treatment market is projected higher than $6 Billion within the next decade. Our thermally responsive, form-fitting materials are suitable for sustained yet reversible occlusion across a range of treatment times. In contrast to existing technologies, our product will not extrude, or cause discomfort as it adapts to patients. Though Humidifeye is not yet FDA approved, expect to hear about it soon!\r\n\nIn coordination with partners across several sectors, we have a variety of groundbreaking technologies in the works that live up to our vision. This work has already been recognized. AesculaTech was named a Rosenman Innovator, received a National Science Foundation I-Corps grant, was a finalist in the 2019 Octane High Tech Awards, and is a graduate of both the Y Combinator and TMCx accelerator programs. In short, Y-Combinator was only the beginning.",
    "activity_status": "Active",
    "website": "https://www.aesculatech.com/",
    "founded_date": 2016.0,
    "team_size": 6.0,
    "location": "Los Angeles, CA",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:medical-devices; industry:consumer-products; location:los-angeles",
    "founders": [
        {
            "name": "Niki Bayat, Founder/CEO",
            "description": "I am co-founder and CEO of AesculaTech, a biotechnology company designing innovative smart materials to change the way health and consumer products interact with the human body. I am also a chemical engineer with 10+ years of experience in organic chemistry with a PhD from the University of Southern California. \n\nI was included in MIT's 2018 35 Innovators Under 35. My company participated in YCombinator 2018.",
            "linkedin": "https://www.linkedin.com/in/niki-bayat-1ba52b4b/"
        }
    ],
    "status": true,
    "generated_description": "### AesculaTech: Innovating Lives with Smart Chemistry\n\n**Mission Statement:**\nAt AesculaTech, we believe in *Responsive materials, better lives.* \n\n**Overview:**\nFounded in 2016 by one of MIT's \"35 Innovators Under 35,\" AesculaTech is reshaping the landscape of smart materials aimed at biomedical, commercial, and industrial applications. Nestled in the vibrant tech hub of Los Angeles, California, our company comprises a small yet formidable team of six dedicated employees committed to pushing the boundaries of innovation.\n\n**What We Do:**\nOur flagship technology, *AesculaGel,* is a prime example of our mission in action. This platform is designed for adaptive response to various stimuli, allowing customization for unique applications, particularly in terms of biocompatibility and material strength. Our cornerstone product, *Humidifeye,* is a revolutionary smart gel punctal plug aimed at addressing dry eye disease—a condition that affects over 25 million Americans. With a global treatment market projected to exceed $6 billion in the next decade, our product promises to enhance patient comfort without the discomfort typically associated with existing technologies.\n\nThough currently under investigation and awaiting FDA approval, we are optimistic about *Humidifeye's* upcoming launch. Our adaptive, thermally responsive materials ensure that while treating dry eyes, patients experience sustained, comfortable relief.\n\n**Recognition and Accolades:**\nAesculaTech hasn’t just entered the market quietly; our innovations have garnered significant attention. We’ve been recognized as a Rosenman Innovator, received a National Science Foundation I-Corps grant, and were finalists in the 2019 Octane High Tech Awards. Impressively, we’ve also graduated from esteemed accelerator programs, including Y Combinator and TMCx. \n\n**Current Innovations and Future Directions:**\nOur pursuits extend beyond just ophthalmology. Currently, we are researching adaptable medical hydrogels, durable high-strength films, and next-gen composites across various sectors, including cosmetics and general consumer products. With a focus on improving health outcomes and environmental sustainability, our work aligns with a wider goal of fostering a healthier planet.\n\n**Visit Us:**\nTo learn more about AesculaTech’s groundbreaking technologies and our approach to building better lives through chemistry, explore our website at [AesculaTech.com](https://www.aesculatech.com/).\n\nIn essence, AesculaTech represents not just a company but a vision—an endeavor to intertwine smart chemistry with daily health and comfort, changing lives one innovation at a time. Catch us on the rise; we’re only getting started.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/d6b14583fb5764ce8c8cfcf212274bf50c465ada.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T190945Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=74c8920f7f48f0daad95f187b700edbdd32a1cf10e6530f73850178b43a3d3b5",
    "social_links": [
        "https://www.crunchbase.com/organization/aesculatech"
    ],
    "logo_path": "data/logos\\AesculaTech_logo.png"
}