{
    "links": "https://www.ycombinator.com/companies/affinity",
    "name": "Affinity",
    "headline": "A compliance training platform built for regulated industries.",
    "batch": "S23",
    "description": "Affinity is a compliance training platform designed specifically for regulated industries. We’ve previously built a fintech from inception to a successful exit and are leveraging that experience to solve the learning management needs of regulated tech companies from growth stage to large enterprise banks.",
    "activity_status": "Active",
    "website": "https://itsaffinity.com",
    "founded_date": 2023.0,
    "team_size": 2.0,
    "location": "New York",
    "group_partner": "Nicolas Dessaigne",
    "group_partner_yc": "https://www.ycombinator.com/people/nicolas-dessaigne",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:workflow-automation; industry:team-collaboration; industry:compliance; industry:hr-tech; location:new-york",
    "founders": [
        {
            "name": "Faraz Rana, Founder",
            "description": "Faraz has over 15 of experience as a start-up operator and a legal and compliance professional. Faraz was part of the founding employee team at Bread, a BNPL fintech, where helped build the company from inception to a $450M exit. Previous to Bread, Faraz had been an M&A lawyer, dabbling with start-up ideas in his spare time. \n\nFaraz is based in Brooklyn, NY and enjoys running and playing tennis.",
            "linkedin": "https://linkedin.com/in/faraz-rana-502874a"
        },
        {
            "name": "Peter Greczner, Founder",
            "description": "Peter is CTO of Affinity. He's been building and working with NYC start-ups for almost 15 years, including companies in AdTech, FinTech, and Crypto. As a founding team member of Bread, a pay-over-time FinTech, he led and built the engineering team to a successful $500M exit. In addition to having fun building startup's, Peter also loves to play basketball, run, try new board games and play outside with his 2 kids.",
            "linkedin": "https://linkedin.com/in/peter-greczner-0067086"
        }
    ],
    "status": true,
    "generated_description": "### Company Overview: Affinity\n\n**Name:** Affinity  \n**Founded:** 2023  \n**Location:** New York  \n**Website:** [itsaffinity.com](https://itsaffinity.com)  \n**Y Combinator Batch:** S23  \n**Team Size:** 2 employees  \n\n**Mission:**  \nAffinity is on a mission to create a modern compliance training platform tailored specifically for regulated industries. The company was born out of the founders' prior success in building fintech solutions and is now focused on addressing the learning management needs of tech companies, from growth stage startups to large enterprise banks.\n\n### Key Features\nAffinity builds its platform around three pillars:\n\n1. **Power:**  \n   Their scalable compliance management systems facilitate effortless growth. This means companies can expand their training endeavors without unnecessary complications.\n\n2. **Flexibility:**  \n   Affinity allows seamless integration with existing workflows, enabling organizations to customize training to meet their unique needs and maintain their brand’s look and feel.\n\n3. **Insight:**  \n   Users gain access to advanced compliance reporting and analytics tools, allowing them to derive actionable insights from their training data, which can significantly enhance decision-making.\n\n### Market Focus\nAffinity focuses on serving regulated industries, primarily in the **fintech** sector, which is reflected in its tags like 'workflow-automation', 'compliance', and 'hr-tech'. Their services cater to businesses looking to manage compliance training effectively and effortlessly. High-profile clients that have adopted Affinity include Unit, Cherry, and Atlas, among others.\n\n### Customer Testimonials\nUsers of Affinity rave about its ease of use and effectiveness:\n- Rick Bachman, Founder & Managing Member of Scale Consulting, praises its assignment tracking and content clarity.\n- M. Azam Fazer from Atlas appreciates how the platform simplifies compliance through a tech-forward approach.\n- Francesca Di Leo, Senior Compliance Officer at Cherry, highlights its concise and digestible training content.\n\n### Pricing\nAffinity offers a tiered pricing structure that starts with plans designed for professional teams at **$12 per seat per month**, ideal for growing teams needing to train on compliance topics. They also offer enterprise solutions with custom pricing for larger organizations that require robust compliance management systems.\n\n### Conclusion\nAffinity is carving out a strong niche in the compliance training landscape, directly addressing the needs of regulated industries with a modern approach. Backed by experience in fintech and backed by Y Combinator, the company stands poised to become a leader in compliance and learning management, making it easier for teams to meet their regulatory obligations.\n\nIf you're looking for a futuristic compliance training solution, consider [Affinity](https://itsaffinity.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/4e9e7cf0314a59452f8a82af172915d1687ccc6b.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T190946Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=2c7eb545409e0e4f6c4a616d87100e88ea3b353c9f1a921a15c0b83f2efd9478",
    "social_links": [
        "https://www.linkedin.com/company/affinity-training"
    ],
    "logo_path": "data/logos\\Affinity_logo.png"
}