{
    "links": "https://www.ycombinator.com/companies/afternoon-co",
    "name": "Afternoon.co",
    "headline": "AI Bookkeeping and tax platform for ecommerce & startup founders",
    "batch": "F24",
    "description": "Afternoon.co empowers founders to make better business decisions with real time financial metrics. We pair managed AI bookkeeping and tax services, to reduce administrative burden on founders. \r\n\nAccountants struggle serving 4 million+ of ecommerce brands & startups in the US, because of complexity in sales tax, multiple sales channels and inventory management. We automate a large portion of bookkeeping by integrating with their sales and inventory systems, so founders can spend less time doing admin work.",
    "activity_status": "Active",
    "website": "https://afternoon.co",
    "founded_date": 2024.0,
    "team_size": 2.0,
    "location": "New York",
    "group_partner": "David Lieb",
    "group_partner_yc": "https://www.ycombinator.com/people/david-lieb",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:saas; location:new-york",
    "founders": [
        {
            "name": "Roman Zubenko, Founder",
            "description": "Roman is the CEO of Afternoon.co. Previously he was a Growth PM at Notion, and PM & engineer at Gusto. At Gusto he led the launch of personal finance products, and was an engineer for accounting products.",
            "linkedin": "https://www.linkedin.com/in/romanzubenko/"
        },
        {
            "name": "Benjamin Paik, Founder",
            "description": "Ben is a co-founder of Afternoon.co. Previously, he was at Brex, where he launched an FP&A product line. Prior to that, he spent eight years at Gusto, where he introduced an embedded payroll product, launched international payroll capabilities, and led the payments team managing billions of dollars.",
            "linkedin": "https://www.linkedin.com/in/benjaminpaik"
        }
    ],
    "status": true,
    "generated_description": "**Afternoon.co: Making Bookkeeping Effortless for Founders**\n\nFounded in 2024 and part of Y Combinator's Batch F24, **Afternoon.co** is on a mission to transform how ecommerce and startup founders handle their finances. Based in New York, this lean startup — currently a team of just two — provides an AI-powered bookkeeping and tax platform designed specifically for the unique needs of online business leaders.\n\n### The Problem\nMany founders face a daunting landscape of financial administration, often overwhelmed by complexities like sales tax, multiple sales channels, and inventory management. Traditional accountants struggle to keep up with the over four million ecommerce brands and startups in the U.S., leaving founders bogged down in tedious paperwork.\n\n### The Solution\nAfternoon.co cuts through this complexity with a focus on automation. By integrating seamlessly with sales and inventory systems, the platform allows founders to focus on growing their businesses instead of getting lost in administrative tasks.\n\nTheir offerings include:\n- **Bookkeeping Services**: Monthly financial statements, expense tracking, and invoicing.\n- **Tax Support**: Assistance with year-end and quarterly taxes, tax deduction optimization, and audit support.\n- **Sales Tax Automation**: Automating the calculation, filing, and remittance of sales taxes across all 50 states.\n- **Government Compliance**: Helping manage communication and filings, ensuring no deadlines are missed.\n\n### Why It Matters\nThe combination of automated bookkeeping and tax services is designed to eliminate the burdensome aspects of financial management, so founders can spend their time where it truly counts — on their businesses. By monitoring tax exposure in real time and facilitating smooth sales tax compliance, Afternoon.co positions itself as an essential partner for tech startups and ecommerce brands.\n\n### Join the Movement\nAfternoon.co is actively welcoming early adopters ready to simplify their financial lives. With the backing of Y Combinator and a forward-thinking approach, this startup is buzzing with potential, poised to change how founders engage with their bookkeeping and tax processes.\n\nFor more information, you can visit their [website](https://afternoon.co) and explore the advantages of their automated solutions.\n\nAs with many great ideas, it’s about seeing a clear need and addressing it head-on — that's exactly what Afternoon.co is doing for ecommerce and startup founders. If you’re in that world, this could be the tool that lights up your financial path.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/59f323ae92b82cc5e5d2ac1c695048ee7b180679.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T190946Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=fb2410384402a58c4d25949d1952e092a3523d496799f9365bb5c12dd4cc003c",
    "social_links": [
        "https://www.linkedin.com/company/afternoon-co",
        "https://x.com/afternoonHQ"
    ],
    "logo_path": "data/logos\\Afternoon.co_logo.png"
}