{
    "links": "https://www.ycombinator.com/companies/agentive",
    "name": "Agentive",
    "headline": "AI Workspace for Audit & Advisory Firms",
    "batch": "S23",
    "description": "Agentive is an AI workspace for financial and technology audit firms that leverages context-aware AI agents to perform testing procedures from natural language instructions—just like an audit associate.\r\n\nBy combining critical workflows such as audit planning, client document requests, and evidence testing into one seamless platform, Agentive streamlines audit processes, reduces inefficiencies, and frees teams to focus on high-impact areas.\r\n\nWe're backed by Y Combinator, Foundation Capital, Dell Technologies Capital, Liquid 2 Ventures, Ritual Capital, UpHonest Capital, and other fantastic investors from the public accounting profession.",
    "activity_status": "Active",
    "website": "https://www.goagentive.com",
    "founded_date": 2023.0,
    "team_size": 6.0,
    "location": "Provo, UT",
    "group_partner": "Dalton Caldwell",
    "group_partner_yc": "https://www.ycombinator.com/people/dalton-caldwell",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:saas; industry:b2b; industry:ai",
    "founders": [
        {
            "name": "Daniel Alberson, Founder & CEO",
            "description": "Daniel Alberson is the co-founder and CEO of Agentive. Daniel started his career as an auditor and product manager at Ernst & Young after graduating with a Bachelor in Accounting from BYU. He then dropped out of Northwestern's Master in Product Design to join Facebook as a product manager for augmented reality glasses.\n\nHe's leveraging his unique experience as an auditor and product manager to transform the auditing profession.",
            "linkedin": "https://linkedin.com/in/alberson"
        }
    ],
    "status": true,
    "generated_description": "**Agentive** is an innovative company founded in 2023, based in Provo, Utah. It began its journey as part of Y Combinator's Summer 2023 batch and has quickly emerged as a formidable player in the **SaaS** (Software as a Service) landscape, particularly targeting the needs of **audit and advisory firms** through the ingenious integration of AI technology.\n\n### Mission and Services\nAgentive's mission is straightforward: to create an **AI workspace specifically designed for audit and advisory firms**. It harnesses the power of context-aware AI agents to simplify and enhance the audit process. Think of it as having a proficient audit associate at your fingertips, capable of performing testing procedures based on natural language instructions. This approach not only streamlines essential workflows—like audit planning and client document management—but also cuts down inefficiencies, allowing teams to focus on high-impact tasks that truly matter.\n\n### Product Highlights\nThe centerpiece of Agentive's offering is the **AI-powered PBC (Prepared by Client) tool**, which automates the process of requesting and testing client documents. By facilitating document matching and detail testing, Agentive modernizes client audits, responding to the unique needs of small to mid-sized audit firms serving private companies. \n\n### Team and Support\nAgentive is supported by a team of six dedicated employees and enjoys backing from prominent investors including **Y Combinator**, **Foundation Capital**, and **Dell Technologies Capital**. This solid foundation not only validates its business model but also positions Agentive for growth and innovation in the industry.\n\n### Call to Action\nFor audit firms looking to elevate their processes and bring efficiency into their workflows, Agentive offers customizable demos tailored to specific needs. They encourage potential users to engage directly with the founders to explore how Agentive can transform their audit practices.\n\n### Get Connected\nFor more information, visit [Agentive's website](https://www.goagentive.com), where you can also log in or request a demo. If you're intrigued by the intersection of AI and auditing, this is definitely a company to keep an eye on as they continue to evolve and make waves in the sector.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/85ac164229350ef8e1176fa9dac8a4f97c511d31.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T190948Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=8e8cb7c5ff0eb10184d6f970fe86b9ee7e3c47d4a92ed536290382a1335077c1",
    "social_links": [
        "https://www.linkedin.com/company/goagentive",
        "https://www.twitter.com/goagentive"
    ],
    "logo_path": "data/logos\\Agentive_logo.png"
}