{
    "links": "https://www.ycombinator.com/companies/agency",
    "name": "Agency",
    "headline": "Solving Complex Security and Compliance",
    "batch": "W22",
    "description": "Agency specializes in multi-party security and compliance scenarios; we are the Palantir of compliance. We serve the most innovative companies and their teams working on critical challenges and transformative technologies by helping them achieve standards like SOC2, ISO 27001, CMMC, NIST, HIPAA, and GDPR that meet the highest levels of scrutiny from third parties.\r\n\nOur patented platform, Verse, integrates with GRC software like Vanta, cloud infrastructure, and your endpoints to securely handle complex multi-layered configurations, such as remote contractor use, BYODs, and federated client-hosted application deployments. \r\n\nOur managed security and compliance team helps high-growth software companies meet rigorous standards as quickly as possible by doing it for them. \r\n\nOur ETDR program enables organizations to prevent threats directly targeting their employees' personal devices, data, and online accounts while respecting their privacy. We provide customized solutions to prevent insider threats, data loss prevention, and threat intelligence while safeguarding personal privacy.",
    "activity_status": "Active",
    "website": "https://GetAgency.com",
    "founded_date": 2020.0,
    "team_size": null,
    "location": "New York",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:saas; industry:b2b; industry:compliance; industry:security; industry:enterprise; location:new-york",
    "founders": [
        {
            "name": "Amir Tarighat, Founder",
            "description": "Amir Tarighat is the cofounder and CEO of Agency. He's a developer, cybersecurity expert, and digital privacy advocate. Amir graduated from Harvard University, and studied Advanced Computer Security at Stanford. He lives in NYC.",
            "linkedin": "https://www.linkedin.com/in/atarighat/"
        },
        {
            "name": "Tyler Carbone, Founder",
            "description": "Co-Founder at Agency, where we provide personal cybersecurity + coverage. Previous founder Terbium Labs (sold to Deloitte), Evenspring (sold to Timmons Group) and SRRN Games.",
            "linkedin": "https://www.linkedin.com/in/tylercarbone/"
        }
    ],
    "status": true,
    "generated_description": "**Agency: Simplifying Security and Compliance for Innovative Businesses**\n\n**Overview**\nFounded in 2020 and part of Y Combinator's Batch W22, Agency is transforming the way innovative companies tackle complex security and compliance challenges. Located in New York, Agency has positioned itself as the “Palantir of compliance,” primarily serving high-growth software companies. With a foundation built on providing standardized solutions like SOC2, ISO 27001, CMMC, NIST, HIPAA, and GDPR, Agency operates at the intersection of technology, privacy, and regulatory demand.\n\n**Mission**\nAgency is on a mission to solve intricate security and compliance issues for the world's most innovative businesses. They aim to help their customers achieve compliance while reducing friction, especially when facing the scrutiny of third-party audits.\n\n**Key Product: Verse**\nAt the heart of Agency's offering is Verse, a patented platform that integrates seamlessly with Governance, Risk, and Compliance (GRC) software like Vanta, cloud infrastructures, and endpoints. This allows businesses to manage complicated configurations such as remote contractor setups and Bring Your Own Device (BYOD) policies. This tailored approach eliminates much of the guesswork and manual effort that often bogs down compliance efforts.\n\n**Services Offered**\nAgency excels in managed security and compliance solutions. Their offerings span a range of capabilities, addressing:\n- **BYOD Security**\n- **Executive Cybersecurity**\n- **Insider Threats**\n- **Remote Work Security**\n- **Social Media Threats**\n\nAdditionally, Agency is equipped to support a wide variety of industries, including:\n- Aerospace & Aviation\n- Critical Infrastructure\n- Energy\n- Financial Services\n- Government\n- Technology & Software\n\nTheir team works around the clock to ensure that their clients not only meet but exceed the rigorous security standards needed to protect sensitive data while preserving personal privacy.\n\n**ETDR Program**\nThe Enhanced Threat Detection and Response (ETDR) program is a noteworthy feature that focuses on safeguarding employees' personal devices and online accounts. This initiative highlights Agency's commitment to respecting privacy while simultaneously enhancing security protocols tailored to detect insider threats and data loss.\n\n**Customer Trust**\nAgency has made strides in earning the trust of leading companies, boasting a client roster that spans over 200 industry leaders. This trust is not achieved overnight; it comes from delivering results-driven solutions and being a reliable partner in the complexities of digital security.\n\n**Recognition**\nWith an impressive 4.9 out of 5 stars on G2, Agency is recognized not just as a solution provider but as a leader in proactive digital risk management. They are known for their high performance and ease of doing business, making them a go-to partner for organizations navigating the intricate landscape of cybersecurity and compliance.\n\n**Conclusion**\nAgency embodies the ideal of combining intelligence with a service-oriented mindset, making them a formidable player in the cybersecurity landscape. If you’re looking to navigate the complexities of modern security and compliance challenges, Agency is well-prepped to help steer your company toward achieving its highest standards. You can explore more about their offerings and request a demo at [GetAgency.com](https://GetAgency.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/8eef63a89074a8ac84cd4c242e4e2c81d25c13ce.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T190947Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=daa4a20eda34b37c8bef06f611884595ab64f858c75d15267db0bc4497666ef8",
    "social_links": [
        "https://www.linkedin.com/company/getagency22",
        "https://x.com/AgencyMDR"
    ],
    "logo_path": "data/logos\\Agency_logo.png"
}