{
    "links": "https://www.ycombinator.com/companies/agilemd",
    "name": "AgileMD",
    "headline": "Predictive analytics and clinical pathways for hospitals",
    "batch": "S11",
    "description": "At AgileMD, we are building the most advanced real-time predictive analytics and clinical algorithms platform for hospitals. Our cloud-based engine helps thousands of doctors and nurses around the country make medical decisions, so that every patient receives the highest quality and value of care based on the latest medical knowledge and data.",
    "activity_status": "Active",
    "website": "https://agilemd.com",
    "founded_date": 2011.0,
    "team_size": 15.0,
    "location": "San Francisco",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:machine-learning; industry:healthcare; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Borna Safabakhsh, Founder/CEO",
            "description": "Borna is the co-founder and CEO of AgileMD, a digital health startup reinventing how clinical predictive analytics and decision support help physicians at the bedside.  Borna has an MBA from Chicago Booth, where he was recognized as Most Promising Entrepreneur by the University of Chicago and 50 for the Future by the Illinois Technology Foundation.\n\nAgileMD’s clinical tools are used at over 81 hospitals and individually in use by over 65,000 healthcare providers to deliver high-quality care.",
            "linkedin": "https://www.linkedin.com/in/bornas/"
        }
    ],
    "status": true,
    "generated_description": "**AgileMD: Revolutionizing Hospital Care with Predictive Analytics**\n\nAgileMD, founded in 2011 and a proud member of Y Combinator Batch S11, is spearheading a transformation in healthcare. Based in the bustling heart of San Francisco, AgileMD has built a sophisticated cloud-based platform that leverages predictive analytics and clinical algorithms to support healthcare professionals across the United States. Their mission is clear: to enhance hospital care by ensuring patients receive optimal and timely treatment, grounded in the latest medical knowledge.\n\nWhat does AgileMD actually do? Think of it as a safety net for clinical teams. Their flagship product, **eCART™**, serves as a clinical deterioration early warning system. It harnesses FDA-cleared AI to flag high-risk patients, thereby helping healthcare workers prioritize and escalate care when it matters most. This isn’t just theoretical; the system has been developed through a decade of research, analyzing over 3 million patient encounters across numerous health systems. The result? Reduced mortality rates and shorter hospital stays.\n\nBut it's not just about prevention. AgileMD also provides **Clinical Pathways**, which seamlessly integrate with existing Electronic Health Records (EHR). This feature enables clinicians to access updated protocols directly within their workflows, thus minimizing clinical variation and ensuring consistent, high-quality care. With more than 4,000 clinical pathways live across 250 hospitals, AgileMD is making evidence-based practices not just a goal but a reality.\n\nWith a dedicated team of 15 employees, AgileMD operates with a nimbleness that allows for rapid deployment of solutions, often within days to weeks rather than months. Their commitment to combining clinical decision support with EHR systems means that healthcare professionals can spend less time wrestling with technology and more time caring for patients. They've earned their credibility too, with over 80 peer-reviewed publications backing their clinical data and methodologies.\n\nAs you think about healthcare innovation, AgileMD exemplifies how technology can make an impactful change in patient care. If you’re hungry for better outcomes and less clinical burden, their approach might just be the solution you've been looking for. \n\nFor more insights, you can explore their offerings at [AgileMD.com](https://agilemd.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/631308e89ceea87795e92486bc1dea7a887790f1.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T190949Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=1746f4a59da1b09e84138027903c768bf43a940b8308153cbf934e6926d05822",
    "social_links": [
        "https://www.linkedin.com/company/agilemd/",
        "https://twitter.com/agilemd",
        "https://www.crunchbase.com/organization/agilemd",
        "https://github.com/agilemd"
    ],
    "logo_path": "data/logos\\AgileMD_logo.png"
}