{
    "links": "https://www.ycombinator.com/companies/aidy",
    "name": "Aidy",
    "headline": "Persistent research on the issues that drive key company decisions",
    "batch": "W24",
    "description": "Aidy delivers persistent, in-depth research for organizations that rely on accurate and timely insights to make critical decisions. New cycles move fast and and information is scattered—especially on topics that rarely make headlines—but Aidy cuts through the noise. Our AI analysts combine real-time monitoring with rigorous analysis to help market research firms, asset managers, trade associations, and public affairs agencies sharpen their information edge. By transforming complex information into actionable intelligence, Aidy empowers organizations to identify emerging trends, reduce risk, and make better decisions faster.\r\n\nIn our previous research-centric roles at The Rockefeller Foundation, U.S. Senate, and biotech startups, we saw how difficult it is to stay on top of new developments in niche areas. We found ourselves researching the same topics again and again to write memos or briefings that would steer significant organizational resources. Pretty quickly, we realized AI can now handle most of this process end-to-end. From there, Aidy was born!",
    "activity_status": "Active",
    "website": "https://www.aidyhq.com/",
    "founded_date": 2024.0,
    "team_size": 2.0,
    "location": "San Francisco",
    "group_partner": "Tom Blomfield",
    "group_partner_yc": "https://www.ycombinator.com/people/tom-blomfield",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Max Williamson, Founder",
            "description": "I'm currently building Aidy, which delivers persistent research on the issues that drive key company decisions.\n\nPreviously I worked on AI and global health at The Rockefeller Foundation, served as a foreign policy fellow in the U.S. Senate, worked as the data director for a victorious Senate campaign, and helped launch a COVID testing lab in Delaware during the pandemic.\n\nI studied CS and policy at MIT, where I was named a Truman Scholar and a finalist for the Rhodes Scholarship.",
            "linkedin": "https://linkedin.com/in/max-williamson-3a969a17a"
        },
        {
            "name": "Peter Crocker, Founder",
            "description": "I'm building Aidy to deliver persistent research on the key issues driving company decisions. My background is in machine learning, where I specialized in graph neural networks and causal inference. I hold a BA (2020) and MEng (2021) from MIT, where I studied Electrical Engineering and Computer Science with a focus on Artificial Intelligence.",
            "linkedin": "https://linkedin.com/in/pcrocker2021"
        },
        {
            "name": "Greg Miller, Founder",
            "description": "Building...",
            "linkedin": "https://linkedin.com/in/gmmiller00"
        }
    ],
    "status": true,
    "generated_description": "**Company Overview: Aidy**\n\nFounded in 2024 and part of the Y Combinator Batch W24, Aidy is based in San Francisco and operates with a lean team of just two people. The company was born from the founders' experiences in research-heavy roles at prestigious institutions like The Rockefeller Foundation and the U.S. Senate, where the challenge of sourcing timely and relevant information became apparent. \n\n**Mission and Vision**\n\nAidy's mission is straightforward yet impactful: to conduct persistent, in-depth research that informs key organizational decisions. In a world where news cycles are rapid and information is often scattered, Aidy serves as a beacon of clarity. They utilize AI-driven analysis to sift through enormous volumes of data, transforming intricate details into actionable intelligence. This empowers clients—ranging from market research firms to political campaigns—to strike while the iron is hot, identify emerging trends, and make informed decisions swiftly.\n\n**Service Offerings**\n\n- **Targeted Research**: Aidy specializes in delivering tailored research across policy, politics, and market trends.\n- **Real-Time Monitoring**: Their AI analysts work around the clock to ensure that clients receive up-to-date insights on issues that matter.\n- **Customized Solutions**: Aidy provides levels of granularity in how sources are selected and how deep the analysis goes, allowing teams of all sizes, from solo consultants to large enterprises, to enhance their competitive edge.\n\n**Use Cases**\n\nAidy’s services cater to a diverse clientele:\n- **Investment Managers** can stay ahead of market fluctuations.\n- **Communications Teams** gain insights into public sentiment and media trends.\n- **Market Researchers** receive key industry insights to outperform competitors.\n- **Consultants** and **Political Campaigns** can track trends and gauge public opinion effectively.\n\n**Why Aidy?**\n\nIn a research landscape where details matter, Aidy assures that no crucial document or action goes unnoticed. Their focus on persistent research enables organizations to navigate complex information effortlessly, ultimately leading to better decision-making. \n\nFor those interested in diving deeper into Aidy's offerings, a free trial and further information can be found on their [website](https://www.aidyhq.com/). If you're navigating the noise of modern information, Aidy might just be the ally you need.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/7a8302a735014bb7a06e9b77820440b79553738f.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T190948Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=153c164d1862abbca54bff79c416001b8c96ce4c34e90de4383db6ad82b64843",
    "social_links": [
        "https://www.linkedin.com/company/aidyhq/about/",
        "https://twitter.com/AidyHQ"
    ],
    "logo_path": "data/logos\\Aidy_logo.png"
}