{
    "links": "https://www.ycombinator.com/companies/airhelp",
    "name": "AirHelp",
    "headline": "AirHelp helps air passengers get compensation for delayed, cancelledâ\u0080¦",
    "batch": "W14",
    "description": "We help get compensation for air passengers that have experienced delayed, cancelled, and overbooked flights. We make the claim process much faster, easier and less painfull because the airlines won't.\r\n\nWe love new challenges! As a start-up, weâ\u0080\u0099ve been through it all and thanks to this our AirHelpers have developed the skills to deal with it all, and more, all while remaining passionate about what we do â\u0080\u0093 helping ordinary people â\u0080\u0093 as flight delays can happen to anyone.\r\n\nWhat helps us continuously develop, is our combination of talent, passion and persistance.\r\n\nWhat makes us different?\r\nEvery single one of our employees can make an impact on the future of AirHelp â\u0080\u0093 come up with an innovative idea â\u0080\u0093 and weâ\u0080\u0099ll help you implement it at AirHelp. This is an experience you can gain in very few places! \r\nIf youâ\u0080\u0099re looking to develop new skills, make an impact on not only global business, but ordinary, everyday travellers, and take risks developing and implementing new projects â\u0080\u0093 what are you waiting for? Come join us today!\r\n\nWith a variety of departments to choose from: tech, product, legal, finance, human resources, customer service (and the list goes on!) - you donâ\u0080\u0099t have to narrow your horizons, just take your pick. Pick what youâ\u0080\u0099ve got a knack for, and most importantly, what you enjoy!\r\n\nAirHelp. We're here to help!",
    "activity_status": "Active",
    "website": "http://www.airhelp.com",
    "founded_date": 2013.0,
    "team_size": 350.0,
    "location": null,
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": null,
    "founders": [
        {
            "name": "Henrik Zillmer, Founder",
            "description": "Henrik Zillmer is a serial entrepreneur, former Rocket Internet executive and founder of AirHelp and ROOM to mention a few. Henrik has founded more than ten startupsâ\u0080\u0099 within insurance, travel, software and e-commerce. At Rocket Internet Henrik launched one of Asiaâ\u0080\u0099s largest e-commerce businesses Zalora in eight different countries and took the company from 5 to 2,000 employees in less than one year. Henrik is currently chairman of AirHelp and continues to be active in Y Combinator as an advisor.",
            "linkedin": "https://www.linkedin.com/in/zillmer"
        },
        {
            "name": "Nicolas Michaelsen",
            "description": null,
            "linkedin": "https://www.linkedin.com/in/nicolasbranasmichaelsen/"
        },
        {
            "name": "Greg Roodt",
            "description": null,
            "linkedin": "https://www.linkedin.com/in/groodt/"
        }
    ],
    "status": true,
    "generated_description": "AirHelp, founded in 2013 and a proud member of the Y Combinator W14 batch, has emerged as the go-to solution for air passengers seeking compensation for delayed, canceled, or overbooked flights. What sets AirHelp apart? Simple: they make the compensation process faster, easier, and less painful for travelers—something most airlines often neglect.\n\nTheir mission is straightforward: to help ordinary people reclaim what they deserve when things go wrong with their flights. With flight delays an everyday reality for many, AirHelp thrives on tackling these challenges head-on, utilizing a potent mix of talent, passion, and persistence. In fact, every AirHelper is empowered to propose and implement innovative ideas that could shape the company’s future—a unique opportunity in the startup realm.\n\nWith a team of around 350 employees and expertise spanning various departments like tech, product, legal, and customer service, AirHelp is not just another company; it’s a learning ground. Whether your skills lie in coding or customer outreach, there’s a niche for you here.\n\nNow, let’s talk numbers. AirHelp has facilitated compensation for over 2.7 million passengers, checked more than 180 million flights, and accumulated a stellar 167,000+ five-star reviews from satisfied customers. They operate under regulations such as the EU Regulation EC 261 and the Montreal Convention, ensuring travelers know their rights.\n\nThe process is simple: passengers can claim up to $650 without any upfront fees—AirHelp only takes a percentage from the compensation when successful. This no-win, no-fee model means there’s essentially nothing to lose for travelers.\n\nIf you’re looking for a place where you can make an impact on a global scale while helping everyday people navigate the complexities of air travel, look no further. AirHelp is here to revolutionize air passenger rights, one claim at a time. Interested? Check them out at [AirHelp.com](http://www.airhelp.com) and seize that opportunity to change the travel experience for the better.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/346cd3e87d37882a75b5434fce4ff980ba4408b4.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T190950Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=c940a16079104dcb4a3117deb123e1a14cbe7e76a7efc45fe04a0b24775c4fe9",
    "social_links": [
        "https://www.linkedin.com/company/airhelp/",
        "https://twitter.com/theairhelper",
        "https://facebook.com/airhelp",
        "https://www.crunchbase.com/organization/airhelp"
    ],
    "logo_path": "data/logos\\AirHelp_logo.png"
}