{
    "links": "https://www.ycombinator.com/companies/akute-health",
    "name": "Akute Health",
    "headline": "The medical record & infrastructure stack for digital health companies",
    "batch": "S21",
    "description": "Akute Health makes an electronic medical record (EMR) system & digital infrastructure tools used by digital health companies to track patients. Our EMR is a web app used daily by clinical teams at digital health companies similar to Ro, Hims, and One Medical.\r\n\nIn 2015, I was diagnosed with cancer and spent 9 months in the hospital. While in the hospital, I built an app to track my own records. I needed something that was simple to use and allowed me to easily track & trend different types of data.\r\n\nI later turned that app into a full medical record system. We now have hundreds of customers and over 50k active patient records.\r\n\nWe are building the de facto EMR for digital health companies.",
    "activity_status": "Active",
    "website": "https://www.akutehealth.com",
    "founded_date": 2018.0,
    "team_size": 4.0,
    "location": "Austin, TX",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:saas; industry:b2b; industry:telemedicine; location:austin",
    "founders": [
        {
            "name": "Sharud Agarwal, Founder",
            "description": "Cancer survivor. Started Akute Health as an app for myself while I was in the hospital receiving chemotherapy. \nPassionate about helping companies provide amazing patient and doctor experiences through technology.\nThe most important piece of healthcare that no one talks about is a patient's relationship with a doctor they trust. Technology can augment this, but cannot create it.\nGreen Bay Packers owner. Go Pack Go!",
            "linkedin": "https://www.linkedin.com/in/sharud-agarwal-2441093b/"
        }
    ],
    "status": true,
    "generated_description": "**Akute Health: Your Digital Health Companion**\n\nFounded in 2018 and part of Y Combinator's Batch S21, Akute Health is disrupting the healthcare landscape from its base in Austin, Texas. The company’s mission? To create the best electronic medical record (EMR) system tailored for digital health companies.\n\nThe inspiration behind Akute Health is personal. In 2015, during a harrowing cancer battle that saw the founder in the hospital for nine months, the need for a robust yet simple way to track medical records became painfully clear. Out of this necessity, Akute Health was born, evolving from a simple tracking app into a comprehensive EMR system used by clinical teams at companies akin to Ro and Hims.\n\nToday, Akute Health serves hundreds of clients and manages over 50,000 active patient records. And it’s not just another EMR; it’s designed to reduce screen time and enable more patient interaction, seamlessly integrating features like telemedicine, e-prescribing, and self-scheduling right into its mobile-friendly platform.\n\nWith a lean team of four and a vision for efficiency, Akute Health is saving healthcare professionals an hour a day through automation and task management tools. They cater to a variety of sectors within the healthcare ecosystem, including Direct Primary Care (DPC) and aesthetic practices.\n\nTheir commitment to data security is also noteworthy: all operations are HIPAA compliant, ensuring patient information is encrypted both at rest and in transit. \n\nIf you’re looking for a modern and intuitive EMR that enhances patient care rather than complicating it, Akute Health could very well be the answer. Interested in learning more? They offer demos, and you can explore further on their website: [Akute Health](https://www.akutehealth.com).\n\nIn today’s rapidly evolving healthcare environment, Akute Health stands out as a beacon for digital health innovation, rooted in personal experience and driven by a desire to make healthcare simpler and more effective.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/cd19fcdc4e86bc6ffa38ad8fc77dd753786ae239.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T190951Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=1d6b5d92553797826cf880c186a5ed43b4f43887077a2699b7f749923d90e0f7",
    "social_links": [
        "https://www.linkedin.com/company/akute-health",
        "https://twitter.com/AkuteHealth",
        "https://www.facebook.com/AkuteHealth",
        "https://www.crunchbase.com/organization/akute-health",
        "https://github.com/akute-health-inc"
    ],
    "logo_path": "data/logos\\Akute_Health_logo.png"
}