{
    "links": "https://www.ycombinator.com/companies/alaan",
    "name": "Alaan",
    "headline": "AI-powered expense management platform for businesses in the Middleâ\u0080¦",
    "batch": "W23",
    "description": "Alaan is an AI-powered expense management platform for businesses in the Middle East. We help businesses instantly issue corporate cards for employees, control their spending, and automate receipts. \r\n\nOur mission is to simplify finance for businesses in the Middle East and help them prosper. We have grown rapidly and now work with over 500 startups, mid-market, and enterprise customers across various industries, doing tens of millions of dollars in payment volume. We've been default alive since our launch in August 2022 (9x net revenue growth in 2023, 6x in 2024).\r\n\nCheck out alaan.com/careers if you want to join us!",
    "activity_status": "Active",
    "website": "https://www.alaan.com/",
    "founded_date": 2021.0,
    "team_size": 72.0,
    "location": "Dubai, United Arab Emirates",
    "group_partner": "Michael Seibel",
    "group_partner_yc": "https://www.ycombinator.com/people/michael-seibel",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:payments; industry:b2b; industry:enterprise-software",
    "founders": [
        {
            "name": "Parthi Duraisamy, Founder",
            "description": "Parthi is an Electrical Engineer but has worn many hats â\u0080\u0093 a farmer, an engineer, tech @ investment banking, and a McKinsey consultant. He graduated from the National University of Singapore and has an MBA from the Tuck School of Business at Dartmouth College. Loves skiing!",
            "linkedin": "https://www.linkedin.com/in/parthiduraisamy"
        },
        {
            "name": "Karun Kurien, Founder",
            "description": "Karun started his career as a software engineer and then spent a few years consulting with McKinsey Digital. Most recently, he has focussed on building products for startups. He now leads product and tech. at Alaan.",
            "linkedin": "https://www.linkedin.com/in/karun-kurien-3020504b"
        }
    ],
    "status": true,
    "generated_description": "**Alaan: Simplifying Business Finance in the Middle East**\n\nAlaan is an innovative fintech company that launched in August 2022, founded in 2021 as part of Y Combinator's Batch W23. Based in Dubai, UAE, it has rapidly gained traction, servicing over 500 startups, mid-market, and enterprise customers. With a mission to simplify finance for businesses across the Middle East, Alaan offers an AI-powered expense management platform that allows companies to issue corporate cards, control spending, and automate receipt management. In just a short time, they’ve achieved remarkable growth, boasting a 9x net revenue increase in 2023 alone. \n\n### What They Do\n\nAlaan’s core offerings include:\n- **Smart Corporate Cards:** Businesses can instantly issue corporate cards with customizable spending limits, making it easier for employees to manage expenses without straying off-track.\n- **Expense Management:** Alaan provides real-time visibility and control over spending, ensuring that every dirham is accounted for. \n- **Accounting Automation:** The platform seamlessly integrates with major ERP systems, facilitating quicker reconciliations and reducing manual bookkeeping.\n\n### Customer Success Stories\n\nAlaan’s solutions are already making waves. For example, **Washmen** reported saving over 80 hours per week since utilizing Alaan’s spend management, allowing their team to focus on core activities without worry over spending policies. Similarly, **Al Barari** and **HelloChef** highlighted significant improvements in transparency and reduced reimbursement times, proving the efficacy of Alaan's platform.\n\n### Team and Vision\n\nWith a passionate team of around 72 employees, led by Group Partner Michael Seibel, Alaan is on a growth trajectory. Their vision aligns with the broader trends in fintech, aiming for a cashless future. By providing streamlined financial management tools, they cater to various industries including healthcare, logistics, and real estate.\n\n### Join the Movement\n\nAlaan is currently looking for talent to join their dynamic team. If you’re interested in being part of a company that’s reshaping financial processes in the Middle East, check their careers page at [alaan.com/careers](https://www.alaan.com/).\n\nIn a market dominated by traditional finance, Alaan's innovative approach and impressive growth showcase the significant potential for change in how businesses manage their expenses, saving both time and resources. \n\n**Website:** [Alaan](https://www.alaan.com/) \n\nThis is fintech evolution for the Middle East—are you ready to harness it?",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/2c17672f342b758325df593cf4b95614f0db41c7.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T190952Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=e15a399ecfbbc4d86fb315bd4f462a5834d3550cdf01cea42464034abac024ca",
    "social_links": [
        "https://www.linkedin.com/company/alaanpay",
        "https://twitter.com/alaan_pay",
        "https://www.facebook.com/alaanpay/",
        "https://www.crunchbase.com/organization/alaan"
    ],
    "logo_path": "data/logos\\Alaan_logo.png"
}