{
    "links": "https://www.ycombinator.com/companies/albiware-inc",
    "name": "Albiware Inc.",
    "headline": "B2B SaaS for insurance damage repair contractors.",
    "batch": "S22",
    "description": "Albiware (Albi) is a B2B SaaS solution for the $100B+ insurance damage repair industry. Albi provides an all-in-one platform for damage repair contractors to manage all aspects of their business including: CRM, project management, field documentation, scheduling, BI, marketing automation, communication, HR management, and much more. Albi is built by contractors who felt the pain that lack of technology brought and set out on a mission to build a SaaS that all insurance damage repair contractors want. Albi helps their customers reduce claims friction between them and the insurance company by providing tools to seamlessly document the work that was performed at projects. Albi helps users sync their communication company-wide through email, text, and phone directly in the platform. Albi helps contractors get paid faster by streamlining the process of a project from first call to completion. Albi also helps their customers make better business decisions through their BI tool with customizable reporting.",
    "activity_status": "Active",
    "website": "https://www.albiware.com",
    "founded_date": 2020.0,
    "team_size": 12.0,
    "location": "Downers Grove, IL",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:saas; industry:insurance",
    "founders": [
        {
            "name": "Alex Duta, Founder",
            "description": "Alex Duta is a serial entrepreneur and second time founder. He scaled a fire and water restoration company from his dad's garage to over 8 figures. Now he's working on a software startup (Albiware) that makes innovative technology simple and accessible to the home service market.",
            "linkedin": "https://www.linkedin.com/in/alex-duta-xct-9a883b4b/"
        },
        {
            "name": "Shamoil Soni, Founder",
            "description": null,
            "linkedin": "https://www.linkedin.com/in/shamoilsoni/"
        }
    ],
    "status": true,
    "generated_description": "### Albiware Inc.: Streamlining the Insurance Damage Repair Industry\n\n**Overview**\n\nAlbiware Inc., founded in 2020 and based in Downers Grove, IL, is disrupting the insurance damage repair sector with its B2B SaaS platform, Albi. As a part of Y Combinator’s Batch S22, this emerging company is tackling the technological gaps in a massive $100 billion industry, primarily serving insurance damage repair contractors.\n\n**Mission and Products**\n\nAlbi is designed for restoration contractors who often find themselves bogged down by inefficient processes. The all-in-one solution brings together crucial tools for:\n\n- **Customer Relationship Management (CRM)**\n- **Project Management**\n- **Field Documentation**\n- **Scheduling**\n- **Business Intelligence (BI)**\n- **Marketing Automation**\n- **Human Resources Management**\n\nThe goal? To cut down on claims friction, enabling contractors to document their work seamlessly and communicate effectively across the organization. This means not only getting jobs done faster but also getting paid quicker, significantly improving cash flow.\n\n**How It Works**\n\nEvery feature in Albi was crafted by contractors who directly experienced the operational hurdles within the industry. The platform supports communication through email, text, and calls, integrating them into a unified experience that enhances overall productivity. Businesses using Albi can expect more organized operations, elevated decision-making through customizable reports, and reduced administrative burdens.\n\n**Pricing Plans**\n\nAlbi offers straightforward, tiered subscription plans:\n\n1. **Base**: Essential tools, including mobile scheduling and photo documentation.\n2. **Pro**: Expands on Base with advanced tracking and analytics.\n3. **Enterprise**: Tailored for larger operations needing hands-on support and dedicated account management.\n\n**Team and Culture**\n\nWith a lean team of 12 employees, Albiware prides itself on being agile and responsive. Their commitment to customer service is evident in their supportive onboarding process and fast response times.\n\n**Recognition and Future**\n\nAs an award-winning platform, Albi has successfully attracted a growing user base, with several customers noting significant improvements in their productivity since adopting the software. Their strong feedback indicates that Albi is not just another tool; it’s a game changer for contractors needing to navigate the complexities of insurance repairs.\n\nAs they expand their reach and improve features based on user feedback, Albiware is on a promising trajectory to reshape the landscape for insurance damage repair contractors.\n\nFor more information, check out their website: [Albiware.com](https://www.albiware.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/40210a69e01771b26b09cea0073f5b8558a8b9e8.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T190951Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=a5d3f768187276cbe23da4bd22ddd0e3b9b42c8a90ee21576aaada3a7db96e18",
    "social_links": [
        "https://www.linkedin.com/company/76449728",
        "https://www.facebook.com/albicrm",
        "https://www.crunchbase.com/organization/albiware"
    ],
    "logo_path": "data/logos\\Albiware_Inc._logo.png"
}