{
    "links": "https://www.ycombinator.com/companies/alchemy",
    "name": "Alchemy",
    "headline": "Nanotechnology-enabled coatings for automotive and defence sectors",
    "batch": "S14",
    "description": "Alchemy is a nanotechnology company based in Kitchener, Ontario with core operations in the automotive and defense sectors. \r\n\nAutomotive - With the widespread adoption of ADAS systems in new vehicles, the cost of replacing a windshield in new vehicles has tripled to $1500+. We have developed a windshield protection film product line called ExoShield to help vehicle owners protect their windshields. Our ExoShield GT3 film is sold through 400+ aftermarket installers and car dealerships in 56 countries that carry and install it for vehicle owners. For Jeep Wrangler and Ford Bronco owners (google: broken windshield club), our ExoShield ULTRA DIY kits are available via our website and dropshipping partners. \r\n\nDefense - Over the last 3 years, we have been working with the Canadian Armed Forces to develop an infrared camouflage technology. We have received two contracts from CAF to develop our technology. Our solution has the ability to be integrated into the uniform directly (adding just 5-10g of weight vs. 600-18,000 kg of weight for other alternatives), has outperformed all existing NATO alternatives in multiple CAF field trials, and is receiving support from major elements of CAF for our next contract. This technology can also be adapted for other individual camouflage integrations (face paint and individual nettings) and for mobile camouflage applications (vehicle nettings and vehicle paints).",
    "activity_status": "Active",
    "website": "http://www.alchemynano.com",
    "founded_date": 2013.0,
    "team_size": 25.0,
    "location": "Waterloo, Canada",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:advanced-materials; industry:automotive",
    "founders": [
        {
            "name": "Khanjan Desai, Founder",
            "description": "CEO & Founder of Alchemy. 2013 Nanotechnology Engineering graduate from the University of Waterloo. 2020 Forbes 30 Under 30 - Manufacturing & Industry. \n\nPreviously at Harvard Med doing cryopreservation and microfluidics research, and at Facebook doing growth analytics and internet marketing.",
            "linkedin": "https://www.linkedin.com/in/khanjandesai/"
        },
        {
            "name": "Chong Shen, Founder",
            "description": null,
            "linkedin": "https://www.linkedin.com/in/chongshen/"
        }
    ],
    "status": true,
    "generated_description": "**Alchemy: Revolutionizing Coatings with Nanotechnology**\n\nFounded in 2013 and hailing from Kitchener, Ontario, Alchemy is at the forefront of nanotechnology, developing advanced coatings tailored for the automotive and defense sectors. They emerged from the esteemed Y Combinator Batch S14 and currently operate with a dedicated team of 25 employees in Waterloo, Canada.\n\n### Mission and Products\nAlchemy’s mission is clear: to harness the power of nanotechnology to create coatings that not only perform exceptionally but also protect crucial systems in vehicles and military applications.\n\n**In the Automotive Sector:**\nAs vehicles incorporate more Advanced Driver-Assistance Systems (ADAS), the costs associated with repairs—like replacing a windshield—have surged significantly. Alchemy addresses this issue with their ExoShield product line, especially the ExoShield GT3 film, which has gained traction in over 400 aftermarket installers and dealerships across 56 countries. For those taking matters into their own hands, Jeep Wrangler and Ford Bronco enthusiasts can purchase ExoShield ULTRA DIY kits directly from their website.\n\n**In the Defense Sector:**\nAlchemy is making waves by developing cutting-edge infrared camouflage technology in collaboration with the Canadian Armed Forces. They’ve been awarded contracts to enhance military uniforms, adding minimal weight while outperforming existing NATO solutions during field trials. This technology can also be adapted for various applications, including face paint and vehicle camouflage.\n\n### Innovative Approach\nAlchemy distinguishes itself with a vertically integrated model. Their coatings are engineered with specific end applications in mind, ensuring optimal performance throughout their development cycle. This includes cutting-edge science that not only delivers high-functioning products but also keeps users—whether civilians or soldiers—safer.\n\n### Looking Ahead\nWith a focus on solving complex technical problems, Alchemy stands poised to transform industries that rely on sensitive technologies. Their innovative approach to coating solutions, combined with their strategic partnerships, fosters an environment ripe for continued growth and impact.\n\nIf you want to learn more about their groundbreaking products or become a part of their journey, check out their website at [AlchemyNano](http://www.alchemynano.com). Whether you’re in automotive care or looking to make strides in military technology, Alchemy is a name to watch in the realm of advanced materials.",
    "logo": "/logos/medium/missing.png",
    "social_links": [
        "https://www.linkedin.com/company/alchemynano/",
        "http://facebook.com/exoshield"
    ]
}