{
    "links": "https://www.ycombinator.com/companies/aleph-solutions-alephee",
    "name": "Aleph Solutions (Alephee)",
    "headline": "We help automotive aftermarket brands to supply and sell parts online",
    "batch": "S21",
    "description": "Aleph helps companies with thousands of products like General Motors and Bosch increase their revenue in Latin America by listing their inventory on large e-commerce sites like Mercado Libre and Amazon. Our customers sell over U$D 4M dollars’ worth of product every month using our software.\r\n\nMany brands struggle with the shift to sell on marketplaces. They want resellers to be involved in their online sales strategies, but both still need to maintain 10,000 products, prices and inventory up-to-date across digital channels and Marketplaces do not provide tools to help brands and resellers on the journey.\r\n\nAleph is the best way for brands and wholesalers to replicate their offline network of resellers online. With Aleph, Brands create high-quality product catalogs to share with their resellers. Now, any seller can access their product catalogue and sell on marketplaces.",
    "activity_status": "Active",
    "website": "https://www.alephee.com",
    "founded_date": 2018.0,
    "team_size": 35.0,
    "location": "Buenos Aires, Argentina",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:marketplace; industry:b2b; industry:e-commerce",
    "founders": [
        {
            "name": "Gaston Zelerteins, Founder",
            "description": "Gaston is a technology entrepreneur.\nIn 2005 co-founded Perception Group, a Microsoft Gold Partner to develop software solutions across LATAM.\nNow, he is building Aleph in partnership with Mercado Libre and Amazon, in charge of the commercial strategy, new businesses and the future of the company.\nGaston is married with Gabriela, is a proud father of three girls: Nina, Amelie and Ambar; and is always dreaming of changing the world making software to contribute to the evolution of societies.",
            "linkedin": "https://www.linkedin.com/in/gzelerteins"
        },
        {
            "name": "Javier Neumann, Founder",
            "description": "Javier is an Electronic engineer graduated w/honors at Buenos Aires University and an MBA at Saint Andrews University in Argentina.\nBefore founding Aleph, led the Microsoft Dynamics Division for Latin America and earlier was a regional sr executive at Accenture.\nHe is married w/Carolina and has 3 children (Agustina, Candela and Santiago). Loves sports and currently practices biking, swimming and golf.\nAt Aleph Javier leads strategic and finance planning and manages investors relationship.",
            "linkedin": "https://www.linkedin.com/in/javierneumann/"
        },
        {
            "name": "Jonathan Saiegh, Founder",
            "description": "Founder - COO & CPO at AlephCRM E-commerce & Software Lover\nInformation systems engineer with over 20 years experience in the software industry and e-commerce. Corporate market interacting with technologies areas and directors.\nMy main areas of expertise are: entrepreneurships, e-commerce, technologies business evaluation, projects investment, management, consulting for business technology strategies, product development, software engineering, sales specialist.",
            "linkedin": "https://www.linkedin.com/in/jonathansaiegh/"
        }
    ],
    "status": true,
    "generated_description": "**Aleph Solutions (Alephee): An Overview**\n\nFounded in 2018 and part of Y Combinator's Batch S21, Aleph Solutions—often called Alephee—is a Buenos Aires-based platform dedicated to revolutionizing the automotive aftermarket. Its mission? To help automotive brands sell parts effectively online. \n\nInitially designed to assist major companies like General Motors and Bosch, Alephee has carved a niche by significantly boosting revenue for these brands across Latin America. They achieve this by listing extensive product inventories on popular marketplaces such as Mercado Libre and Amazon. Remarkably, their software supports sales surpassing $4 million monthly for their customers.\n\n**The Challenge and Solution**\n\nAs the marketplace world evolves, many brands struggle to adapt. A crucial hurdle is the need to manage thousands of products across various digital channels while also engaging resellers. Alephee recognizes this gap and offers a compelling solution. The platform enables brands to create high-quality product catalogs that resellers can access easily, essentially replicating their offline sales networks online.\n\nAlephee isn’t just another software; it empowers brands, wholesalers, and retailers to navigate the complexities of online sales—and do so efficiently. With a team of 35 dedicated employees, Alephee connects all players in the automotive ecosystem—creating a seamless environment to thrive.\n\n**What Alephee Offers**\n\n- **B2B Social Network:** By fostering organic connections among manufacturers, wholesalers, and retailers, Alephee creates a vibrant community. It’s more than transactions; it’s about building partnerships.\n\n- **Advanced Platforms for Growth:** Alephee streamlines goal-setting with comprehensive metrics, enabling businesses to have a clear view of their performance. Their platform integrates secure payments, shipping solutions, and business social networking all in one place.\n\n- **Impactful Results:** Alephee reports impressive growth metrics, including the potential for small businesses to see an 80% increase in sales during their first year of partnership.\n\n- **Global Reach:** While rooted in Latin America—operating in countries such as Brazil, Mexico, and Argentina—Alephee aims to scale and expand further in the automotive aftermarket sector.\n\n- **Support and Solutions:** Beyond just a platform, Alephee prides itself on exceptional customer support, ensuring each client receives the guidance they need to succeed.\n\nIn short, Alephee is reimagining how the automotive aftermarket interacts with the digital marketplace. If you’re a brand or a wholesaler looking to enhance your online presence and bolster sales, Aleph Solutions is worth a look. For more information, check out their [website](https://www.alephee.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/6c8fade4bb98c5f009eb9656cc8dd36a6fb916a5.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T190952Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=ebc073292c972661a8e15579629cba553c3907f15ac9a4a1e2d39f6b67022535",
    "social_links": [
        "https://www.linkedin.com/company/alephee",
        "https://twitter.com/somos_alephee",
        "https://www.facebook.com/somosalephee",
        "https://www.crunchbase.com/organization/alephcrm"
    ],
    "logo_path": "data/logos\\Aleph_Solutions_(Alephee)_logo.png"
}