{
    "links": "https://www.ycombinator.com/companies/alga-biosciences",
    "name": "Alga Biosciences",
    "headline": "We stop cows from burping methane.",
    "batch": "W22",
    "description": "Alga Biosciences is a fast-moving startup focused on transforming the agricultural industry. Our mission is to make an immediate, dramatic impact on global methane emissions produced by enteric fermentation in partnership with the cattle industry. We believe in leveraging biology to tackle the world’s biggest problems.",
    "activity_status": "Active",
    "website": "https://www.alga.bio/",
    "founded_date": 2021.0,
    "team_size": 6.0,
    "location": "Berkeley, CA",
    "group_partner": "Gustaf Alstromer",
    "group_partner_yc": "https://www.ycombinator.com/people/gustaf-alstromer",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:biotech; industry:climate; industry:agriculture; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Alexander Brown, Founder",
            "description": "Alex studied life sciences and economics in undergrad, but worked as a Chief of Staff at a software company until he couldn’t stop thinking about how annoying it was that nobody had solved the problem of cow burps yet.",
            "linkedin": "https://www.linkedin.com/in/alex-brown-5ba620113/"
        },
        {
            "name": "Daria Balatsky, Founder",
            "description": "Daria is a physical chemist who has worked on various topics from synthesizing drugs for kidney disease to studying quantum materials as a PhD candidate. Now she applies herself as a co-founder and chemist for Alga Biosciences.",
            "linkedin": "https://www.linkedin.com/in/daria-balatsky-842356121"
        },
        {
            "name": "Caroline McKeon, Founder",
            "description": "Physical chemist training and trained in quantum mechanical electronic structure theory at the University of California, Berkeley (CA) and Haverford College (PA). Creating cattle feed additives to reduce methane emissions by ruminants. Bring kelp to cows, bring science to application!",
            "linkedin": "https://www.linkedin.com/in/carolineamckeon/"
        }
    ],
    "status": true,
    "generated_description": "**Alga Biosciences: Tackling Methane Emissions from Cattle**\n\nFounded in 2021 and part of Y Combinator's W22 batch, Alga Biosciences is a Berkeley, CA-based startup on a mission to revolutionize agriculture by reducing methane emissions from cattle. Their bold claim? \"We stop cows from burping methane.\" \n\nAlga's innovative approach uses algae-based feed supplements that can reduce methane emissions from cattle by up to *97%*. Given that ruminants like cows account for a significant chunk of annual methane emissions in the U.S. (27%), this is not just a minor improvement; it’s a considerable step toward addressing climate change.\n\n### The Science Behind It\n\nMethane is a short-lived greenhouse gas that is 104 times more potent than CO2 over a decade. By curbing these emissions, Alga aims to slow down global warming significantly. Their feed additive is claimed to be safe, effective, and inexpensive, making it not only an eco-friendly solution but also a cost-effective option for cattle owners. \n\nBy incorporating just 0.5% of this supplement into the cattle's diet, each cow's methane output can be cut dramatically—equivalent to emissions from driving a car for 12,000 miles! With over 100 million cows in the U.S. alone, the potential impact is staggering.\n\n### Financial Incentives\n\nLess methane also means more efficient growth for cattle. When cows expend less energy on methane production, they require less feed to reach their optimal weight, creating financial savings for ranchers. This dual benefit of financial gain and environmental impact makes Alga's solution particularly attractive.\n\n### Team and Backing\n\nAlga is led by a compact team of 6 and is backed by significant venture capital, including partnerships with funds like Collab Fund and Y Combinator. This robust backing enables them to focus on scientific research and innovation in the agri-tech sector.\n\n### Conclusion\n\nAlga Biosciences stands at an exciting intersection of biotechnology and climate action. By addressing a major source of greenhouse gases, they’re not just feeding cattle—they’re feeding hope for a sustainable future. If you’re interested in their solutions or simply want to learn more, check their website at [Alga Biosciences](https://www.alga.bio/).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/14765000cfe803052ca2b40d6f12bd96063a589c.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T190952Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=be01afeabc70eab5f96bab7da03eef78d4437341663b5028801419dbaef93db4",
    "social_links": [
        "https://www.linkedin.com/company/alga-biosciences",
        "https://twitter.com/algabiosciences",
        "https://www.crunchbase.com/organization/alga-biosciences"
    ],
    "logo_path": "data/logos\\Alga_Biosciences_logo.png"
}