{
    "links": "https://www.ycombinator.com/companies/algouniversity",
    "name": "AlgoUniversity",
    "headline": "Building Job driven Virtual Tech University for India ð\u009f\u0087®ð\u009f\u0087³",
    "batch": "S21",
    "description": "We are building live teaching infrastructure that enables handful of top educators (from Google, Facebook, etc) to coach a large number of students.\r\nWe train college students in a year-long live cohorts and they pay us a portion of their salary as fees once they get a tech job (Income Sharing Agreement)",
    "activity_status": "Active",
    "website": "http://algouniversity.com/",
    "founded_date": 2020.0,
    "team_size": 10.0,
    "location": "Hyderabad, India",
    "group_partner": "Diana Hu",
    "group_partner_yc": "https://www.ycombinator.com/people/diana-hu",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:education; industry:income-share-agreements; industry:elearning",
    "founders": [
        {
            "name": "Manas Kumar Verma, Founder",
            "description": null,
            "linkedin": "https://www.linkedin.com/in/thenextmkv/"
        },
        {
            "name": "Swapnil Daga, Founder",
            "description": "Co-Founder at AlgoUniversity (S21)\n\nI previously worked as an SRE intern at Google, and as an SWE at Apple after graduating from university. I have an extensive teaching experience and have previously taught in other edtech startups as lead instructor for over 2 years, with my students bagging offers from Google, Microsoft, Bytedance etc. I look after scaling the teaching infrastructure at AlgoUniversity.",
            "linkedin": "https://www.linkedin.com/in/swapnil-daga-b42762130/"
        }
    ],
    "status": true,
    "generated_description": "**AlgoUniversity - A Fresh Take on Tech Education in India**\n\nFounded in 2020 and part of Y Combinator's Batch S21, AlgoUniversity is on a mission to build a job-driven virtual tech university dedicated to the aspirations of Indian students. With a base in Hyderabad, this innovative edtech startup aims to address the skills gap in the tech industry through a unique model of education and mentorship.\n\n### **The Model**\n\nAt its core, AlgoUniversity combines rigorous live instruction from top-tier educators—many of whom hail from giants like Google and Facebook—with a real-world approach to learning. Students engage in year-long cohorts, and they only begin to pay for their education once they secure a job in the tech field, a model known as the Income Sharing Agreement (ISA). \n\n### **What They Offer**\n\n- **Hands-On Learning:** The curriculum focuses heavily on Data Structures and Algorithms (DSA), which are crucial for tech interviews, making up about 60-70% of the interview process. Students also undertake industry-oriented projects under the guidance of experienced mentors.\n  \n- **Placement Success:** The results speak volumes—over 1,380 students have been trained and placed, with the highest CTC reaching ₹41 LPA and an average hike of about 110% on their previous salaries.\n\n- **Special Programs:** Their weekend-oriented \"Leap Batch\" is catered to working professionals, designed by alumni of IIIT-Hyderabad and IIT-Bombay. This program emphasizes quick doubt resolution, externship certificates, and job placements that can begin just three months after starting.\n\n### **The Team**\n\nAlgoUniversity boasts a small, agile team of just 10 employees—many of whom are ACM ICPC finalists and engineers from leading tech companies. The founders and mentors are not only educators but also seasoned professionals who understand the demands of the tech industry inside out.\n\n### **Proven Impact**\n\nStudents like Mayank Verma and Pallavi Sahu have shared their transformative experiences, highlighting how the curriculum and mentorship at AlgoUniversity enabled them to transition from non-tech jobs to lucrative software engineering positions. The testimonials are filled with stories of impressive salary hikes, international offers, and successful career switches.\n\n### **Financing Your Education**\n\nTheir fee structure is straightforward: an initial ₹5,000 enrollment fee (refundable within 21 days) and subsequent payments of ₹5,000 per month for six months. Once employed, students pay an additional ₹40,000 in easy installments—making it a low-risk investment for those eager to enter the tech workforce.\n\n### **Join the Movement**\n\nWith a clear focus on meeting the staffing needs of the thriving tech industry in India, AlgoUniversity is not just a place for lectures but a stepping stone to a successful career in technology. As they say, if you can dream it, they can help you achieve it. Check out their website at [algouniversity.com](http://algouniversity.com) and take the first step toward transforming your career in tech.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/fe1b78b019afa60ae0edc9b89291b3d039da7926.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T190953Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=4fa7a5379400d986eae4fd38d16527e4f8246a15d402398e63723edbe380bde0",
    "social_links": [
        "https://www.linkedin.com/company/algouniversity"
    ],
    "logo_path": "data/logos\\AlgoUniversity_logo.png"
}