{
    "links": "https://www.ycombinator.com/companies/alice-tech",
    "name": "Alice.tech",
    "headline": "Alice.tech turns course materials into personalized exam prep using AI",
    "batch": "W25",
    "description": "Alice turns generic course materials into personalized learning and exam prep using AI. \r\n\nStudents simply upload what they want to study and instantly get access to:\r\n(1) Better understanding: Key topic overviews and explanations with personalized support through an AI chat that knows their context.\r\n(2) Effective practicing: Exercises tailored to their needs (level, format, curriculum, etc.), including flashcards, multiple-choice questions, and full exam simulations.\r\n(3) Targeted improvement: Identification of weaknesses across topics to enable more targeted and complete learning.\r\n\nPlus, learning becomes more engaging with Alice—students can study with friends and challenge each other, making the experience both fun and effective.\r\n\nOver 2,000 students have already used Alice, and we are growing MRR +30% MoM for B2C alone, while gaining first traction in B2B on top.",
    "activity_status": "Active",
    "website": "https://www.alice.tech/",
    "founded_date": 2024.0,
    "team_size": 6.0,
    "location": "Copenhagen, Denmark",
    "group_partner": "Tom Blomfield",
    "group_partner_yc": "https://www.ycombinator.com/people/tom-blomfield",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:ai-enhanced-learning; industry:artificial-intelligence; industry:education; industry:generative-ai; industry:saas",
    "founders": [
        {
            "name": "Patrick Gadd, CTO and co-founder",
            "description": "Patrick is the CTO and Co-founder of Alice.\n\nBefore Alice, he worked as Senior Data Scientist at LiveIntent (US AdTech firm), leading the internal MLOps framework, and invented a patented machine learning solution for audiences driving significant incremental revenue. He has worked with ML and software engineering his entire career.\n\nMSc in Comp. Sci. from the University of Oxford. National and international finalist in the Geography and Physics Olympiads in high school.",
            "linkedin": "https://www.linkedin.com/in/patrick-gadd/"
        },
        {
            "name": "Kim Rants, CEO and co-founder",
            "description": "Kim is the CEO and Co-founder of Alice. \n\nBefore Alice, Kim worked as an Associate Partner at McKinsey, where he specialized in AI. He was the fastest in Europe to make Engagement Manager. He also worked in LEGO as Head of Global Business Development. \n\nKim has taught university students for 10+ years and holds two MSc. degrees: one in Finance and one in Computer Science, with specialization in AI.",
            "linkedin": "https://www.linkedin.com/in/kimrants/"
        }
    ],
    "status": true,
    "generated_description": "**Alice.tech: Revolutionizing Exam Preparation with AI**\n\nFounded in 2024 and hailing from Copenhagen, Denmark, Alice.tech is a promising startup that’s quickly making a name for itself in the ed-tech space. It’s part of Y Combinator Batch W25, and its mission is straightforward yet ambitious: to transform generic course materials into personalized exam preparation tools using cutting-edge artificial intelligence.\n\n### The Product\n\nAlice.tech offers a simple yet powerful solution. Students can upload their study materials and receive immediate, tailored support that covers three main pillars:\n\n1. **Better Understanding**: The platform provides clear overviews and explanations for key topics, supplemented by an AI chat that understands the student’s specific context.\n  \n2. **Effective Practicing**: Alice creates custom exercises based on the student's needs—think flashcards, multiple-choice questions, and full exam simulations crafted to suit individual learning styles and curricular requirements.\n\n3. **Targeted Improvement**: The platform identifies areas where the student struggles, helping them focus their efforts more efficiently and effectively.\n\nBut it’s more than just a study tool; Alice allows students to engage socially by studying with friends and competing in challenges, making learning not just productive but also enjoyable.\n\n### Traction and Growth\n\nAlice.tech has already attracted over 2,000 students, an impressive feat for a new company, and it boasts a monthly revenue growth rate (MRR) of 30% in its B2C segment, with emerging interest in B2B. \n\n### Team and Leadership\n\nWith a lean team of six, the company benefits from the mentorship of Tom Blomfield as their Group Partner, which lends a competitive edge to their strategy and growth.\n\n### Why Alice.tech Stands Out\n\nThe ability to support multiple languages (currently ten) sets Alice apart, catering to a diverse student population. The platform also prides itself on fostering a more engaging study experience that doesn’t just promise better grades but delivers active, interactive learning.\n\nIn terms of accessibility, Alice offers various pricing plans, including a free \"Hustler Plan\" that provides basic functionality alongside more comprehensive paid tiers.\n\n### User Experience and Reviews\n\nStudent testimonials are positive, highlighting the efficiency of the tool in simplifying study processes and enhancing exam readiness. From generating practice questions post-lecture to providing instant feedback on performance, users find Alice.tech to be an invaluable study companion.\n\n### Conclusion\n\nAlice.tech is not just another education tool; it’s a responsive, intelligent platform designed to redefine the way students prepare for exams. With its growing user base and expanding features, it's a prime example of how AI can improve personal learning experiences. If you're a student looking to streamline your study process and boost your exam confidence, Alice might just be the AI study buddy you've been waiting for.\n\nFor more information, check out their website at [alice.tech](https://www.alice.tech/).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/d446868848e42d4666699859b3075f883bbd3355.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T190954Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=67b16ee585a1ae41f77c5ea49b51ceb34bccd6438d8d98663ee64c57f8e7edab",
    "social_links": [
        "https://www.linkedin.com/company/alice-tech/"
    ],
    "logo_path": "data/logos\\Alice.tech_logo.png"
}