{
    "links": "https://www.ycombinator.com/companies/alinea",
    "name": "Alinea",
    "headline": "Automated investing for the next generation ð\u009f\u0092¸",
    "batch": "W21",
    "description": "Alinea is an app for new investors where we do the hard work for you. With Alinea you have a team of investment experts in your pocket.",
    "activity_status": "Active",
    "website": "https://alinea-invest.com/",
    "founded_date": 2021.0,
    "team_size": 8.0,
    "location": "New York",
    "group_partner": "Michael Seibel",
    "group_partner_yc": "https://www.ycombinator.com/people/michael-seibel",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:artificial-intelligence; industry:education; industry:fintech; industry:social; location:new-york",
    "founders": [
        {
            "name": "Eve Halimi, Founder",
            "description": "Co-Founder and Co-CEO of Alinea Invest.",
            "linkedin": "https://www.linkedin.com/in/eve-halimi-95b695b4/"
        },
        {
            "name": "Anam Lakhani, Founder",
            "description": "Co-founder / Co-Ceo of Alinea Invest",
            "linkedin": "https://www.linkedin.com/in/anam-lakhani-443032134/"
        }
    ],
    "status": true,
    "generated_description": "### Alinea: Automated Investing for the Next Generation\n\n**Overview**  \nAlinea, founded in 2021 and part of Y Combinator's W21 cohort, is a fintech startup based in New York. Their mission is straightforward yet ambitious: to automate investing for the next generation. What Alinea offers is not just another investing app—it's a digital companion for new investors where a team of investment experts and AI takes on the heavy lifting of investment management.\n\n**The Product**  \nAt its core, Alinea aims to demystify investing for beginners. The app actively engages users by automating investments, guiding them through the process, and providing smart recommendations tailored to their financial goals. Alinea also emphasizes a social aspect, allowing friends to share investment playlists and learn together, turning investing into a communal activity rather than a solitary one.\n\n**Key Features**  \n- **Automated Investments**: Using cutting-edge technology, Alinea automates stock and cryptocurrency investments, making it incredibly easy for users to get their feet wet in the market without the usual hassle.\n- **Educational Resources**: The platform provides educational support through weekly Investing 101 workshops, designed to empower users with knowledge and confidence in their investing journey.\n- **Transparency**: They pride themselves on being transparent about fees, boasting $0 commission on trades for stocks and ETFs and competitive pricing for automated investments, all while ensuring compliance as an SEC registered investment advisor.\n\n**The Alinea App**  \nAlinea’s app features over 20 cryptocurrencies, allowing users to diversify their portfolios with ease. It offers seamless access to market updates customized to individual portfolios and supports a hands-off approach to personal finance, where users can rely on expert advice without needing to constantly monitor the market.\n\n**Team and Backing**  \nOperating with a small but passionate team of eight, Alinea is led by experienced founders who understand the barriers many face when entering the investment landscape. The company has garnered attention not just for its innovative approach but also for the valued support from esteemed partners like Michael Seibel from Y Combinator.\n\n**Why Alinea?**  \nInvesting should be accessible, especially for the new, desirous cohort of Gen Z investors who might feel overwhelmed by traditional platforms. Alinea acknowledges this gap, and their user testimonials highlight a significant pivot away from anxiety-inducing productivity towards a supportive, enjoyable investing experience. Students and young professionals express confidence and excitement about investing, an attitude Alinea fosters through its friendly and educational interface.\n\n### Conclusion  \nIn a world where the stock market can feel like an exclusive club, Alinea is shaking things up. They’re not just developing an investment app; they’re crafting a community around investing where new investors feel empowered and supported. For those ready to dip their toes into the world of investing without the risk of complications, Alinea stands as an inviting option. \n\nFor more information or to get started, check out their website: [Alinea](https://alinea-invest.com/).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/c0ac91d9a88be9866dbdfe70df0af2bad5b09351.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T190953Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=56910218a7f4d77e2b1031846c71268dc7ef559b65b54e12e7f5ee726372c7e1",
    "social_links": [
        "https://www.linkedin.com/company/alineainvest/",
        "https://twitter.com/alineainvest_",
        "https://www.facebook.com/alineainvest/",
        "https://www.crunchbase.com/organization/alinea-34ff"
    ],
    "logo_path": "data/logos\\Alinea_logo.png"
}