{
    "links": "https://www.ycombinator.com/companies/almond",
    "name": "Almond",
    "headline": "We make it easy to get great ObGyn care  in-person and over telehealth",
    "batch": "S22",
    "description": "Almond is like One Medical but for women’s health: we make it easy to get great ObGyn care fast, both at our in-person offices and over telehealth.\r\n\nThe problem with traditional ObGyn practices is that physician time is misused, so patients get slow care. We're rebuilding back-office tech that saves physicians time, and we're hiring a wider range of care providers roles, which let us deliver better outcomes to patients and reduce the amount of time it takes to get their issue resolved.",
    "activity_status": "Active",
    "website": "https://www.almondobgyn.com/",
    "founded_date": 2021.0,
    "team_size": 8.0,
    "location": "Los Angeles, CA",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:consumer-health-services; industry:telehealth; industry:consumer; industry:healthcare; industry:femtech; location:los-angeles",
    "founders": [
        {
            "name": "Tara Raffi, Founder",
            "description": "- McKinsey consultant; served large US hospital systems\n- Early Ops and Marketing team member at Factual, a location-data tech company\n- Built McKinsey’s internal tech incubator; grew fund to $50M invested globally and hired team of 5, focused on user-centered design and healthcare",
            "linkedin": "https://www.linkedin.com/in/tararaffi/"
        },
        {
            "name": "Carly Allen, Founder",
            "description": "Carly Allen (Co-Founder & Chief Brand Officer of Almond) built her career in CAA's marketing division. Her background is in marketing and entertainment. She was Head of Production for global campaigns for brands like Coca-Cola, Nike, Marriott, Chipotle, and Bonobos, among others. Her focus has been in building purpose driven brands, which is desperately needed in the ObGyn space. Her late father was an ObGyn so she is deeply connected to this space.",
            "linkedin": "https://www.linkedin.com/in/carly-allen-90a403130/"
        }
    ],
    "status": true,
    "generated_description": "**Company Overview: Almond**\n\nFounded in 2021 and situated in Los Angeles, CA, Almond is shaking up the traditional landscape of ObGyn care. Their mission is straightforward: to simplify access to quality ObGyn services both in-person and through telehealth. Think of Almond as \"One Medical for women's health,\" aiming to deliver rapid, effective care.\n\n### The Problem\n\nConventional ObGyn practices often fall short; physician time tends to be poorly utilized, leading to frustratingly slow patient care. Almond is tackling this head-on by revamping back-office technology and expanding the types of care providers they employ. This approach not only enables faster service but also improves patient outcomes.\n\n### Team and Structure\n\nAlmond is part of Y Combinator’s Batch S22 and boasts a small but dedicated team of eight employees, all working toward a common goal of enhancing women's healthcare. Led by their Group Partner, Nan, the team focuses on creating an environment where all women are heard and valued.\n\n### Services Offered\n\nAlmond's offerings include:\n\n- **Classic and Virtual Memberships:** Tailored care options that cater to women's specific health needs.\n- **Group Pregnancy Care:** A unique community-based program that enhances the pregnancy experience.\n- **Specialized Programs:** Including PCOS management, menopause support, and personalized health coaching. \n\nAll services are designed to provide comprehensive care that moves beyond just treating symptoms. Almond believes in holistic and empowering healthcare, emphasizing a deep understanding of individual needs.\n\n### Unique Approach\n\nWhat sets Almond apart? Not only do they provide unlimited texting with care team members and same-day video visits, but their model also integrates traditional and alternative medicine approaches. Their goal is to minimize obstacles to healthcare and make it as accessible as possible.\n\n### Customer Sentiment\n\nThe feedback from their patients has been overwhelmingly positive. Almond enjoys a stellar reputation, with many testimonials praising their attentive service and welcoming environment. \n\n### Conclusion\n\nOverall, Almond represents a refreshing take on ObGyn care. By harnessing technology, fostering community, and prioritizing patient satisfaction, they are transforming how women access and experience healthcare. If you're looking for compassionate care that puts your health first, Almond is worth considering.\n\nVisit their website for more information: [Almond ObGyn](https://www.almondobgyn.com/).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/bbb40cbf80c04b3ef17197961a6a09c2423e37f8.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T190954Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=802a2bb12ff231b95cf75fc3f1a7abe7cdf6ae92ebde004fa1c008cf1c1ee856",
    "social_links": [
        "https://www.linkedin.com/company/almond-obgyn/",
        "https://twitter.com/AlmondObGyn",
        "https://www.facebook.com/almondobgyn/"
    ],
    "logo_path": "data/logos\\Almond_logo.png"
}