{
    "links": "https://www.ycombinator.com/companies/alt-tex",
    "name": "ALT TEX",
    "headline": "Biodegradable and carbon neutral textiles, engineered from food waste.",
    "batch": "S22",
    "description": "ALT TEX is a Toronto-based biomaterials startup that has developed the world’s first biodegradable and carbon neutral fabric, engineered from the world’s largest landfill contributor - food waste. Polyester alone makes up 60% of the $2.5 trillion fashion industry and is the biggest blocker preventing brands from meeting sustainability mandates. The patent-pending ALT TEX fermentation technology creates a polyester alternative that works with the existing infrastructure to supply a sustainable, high performance and cost competitive polyester replacement to fashion brands, at scale. \r\n\nThe product solves key problems for fashion brands, consumers, and the environment:\r\n\n(1) Fashion brands: ALT TEX sells fabric to fashion brands, allowing them to differentiate via sustainable options (sustainable fashion growing 11% CAGR) and hit sustainability targets, without sacrificing performance or changing their current supply chain.\r\n\n(2) Consumer: The ALT TEX fabric is projected to be half the price vs. other specialized sustainable alternatives (due to low-cost input and scalability), meaning greater accessibility.\r\n\n(3) Environment: A single shirt produced with ALT TEX fabric can divert 1 kg of food waste from landfills, 9 kg of carbon emissions from the air, and 4 g of micro-plastics from our waterways.\r\n\nCo-founders Myra and Avneet have worked together managing teams and projects for six years, with backgrounds in serial entrepreneurship, corporate sales at Fortune 500 companies, textile manufacturing and biochemistry. To date, ALT TEX has created their first fabric prototype that’s 70% stronger than cotton, secured $1M in LOIs and raised $2.3M.",
    "activity_status": "Active",
    "website": "https://thealttex.com/",
    "founded_date": 2020.0,
    "team_size": 10.0,
    "location": "Toronto, Canada",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:carbon-capture-and-removal; industry:bioplastic; industry:biotech; industry:climate; industry:food-tech",
    "founders": [
        {
            "name": "Myra Arshad, Founder",
            "description": "Hey, I'm Myra - Co-founder and CEO of ALT TEX.  Coming from a family background in textile manufacturing, I'm disrupting the $2.5 trillion fashion industry with better and more sustainable materials.\n\nPrior to ALT TEX, I held corporate roles in sales and marketing at Fortune 500 companies, before founding fluidic – a direct to consumer lifestyle brand. Prior to fluidic, I built FarmBox, a Hult Prize backed, AI micro-farming technology that enabled food sustainability in refugee camps.",
            "linkedin": "https://www.linkedin.com/in/myra4/"
        },
        {
            "name": "Avneet Ghotra, Founder",
            "description": "Hi, I'm Avneet - Co-founder and CTO of ALT TEX. I left medical school to build ALT TEX. With education and research background in biochemistry & environmental science, I lead the R&D behind ALT TEX’s food waste to fabric mission. Prior to medical school & ALT TEX, I founded Approaching Zero, a non-profit dedicated to reducing plastic pollution through production of reusable cotton produce bags.  Continuing that vision, I am now building a global solution for fashion's polyester pollution.",
            "linkedin": "https://www.linkedin.com/in/avneet-ghotra-51284728/"
        }
    ],
    "status": true,
    "generated_description": "**ALT TEX: Crafting the Future of Sustainable Fashion**\n\n**Overview:**  \nFounded in 2020 and located in Toronto, ALT TEX is a forward-thinking biomaterials startup on a mission to revolutionize the fashion industry with biodegradable and carbon-neutral textiles made from food waste. They're not just another fabric manufacturer; they are addressing one of the biggest environmental challenges posed by the fashion sector's reliance on synthetic materials, particularly polyester, which accounts for a staggering 60% of the $2.5 trillion industry.\n\n**The Problem:**  \nTraditional polyester production is a major pollutant, consuming oil and contributing significantly to greenhouse gas emissions. With sustainability mandates becoming a priority for brands, there is a pressing need for alternatives that don’t compromise on performance.\n\n**The Solution:**  \nALT TEX is pioneering a unique fermentation technology that transforms food waste—a substantial landfill contributor—into a strong, cost-competitive polyester alternative. Their product offers three standout benefits:\n\n1. **For Fashion Brands:** ALT TEX enables companies to adopt sustainable fabrics without overhauling their supply chains, tapping into the growing trend of sustainable fashion, which is skyrocketing at an 11% annual growth rate.\n   \n2. **For Consumers:** Their fabric is projected to be half the price of other sustainable options, dramatically increasing accessibility and encouraging broader adoption.\n\n3. **For the Environment:** By producing a single shirt from ALT TEX fabric, we can potentially divert 1 kg of food waste from landfills, reduce carbon emissions by 9 kg, and prevent 4 g of microplastics from leaching into our waterways.\n\n**The Founders:**  \nCo-founders Myra and Avneet bring a rich tapestry of experience across entrepreneurship, corporate sales, textile manufacturing, and biochemistry. Together, they've developed a product that's 70% stronger than cotton, secured $1 million in letters of intent, and raised $2.3 million in funding. \n\n**Achievements & Future Goals:**  \nAs part of Y Combinator's Batch S22, ALT TEX is already making waves in the sustainability space. Their patented technology and commitment to performance reflect a growing understanding that eco-friendly solutions can also deliver quality. Looking ahead, they aim to expand production capabilities and enhance collaboration with fashion brands seeking sustainable methodologies.\n\nIf you’re curious about a company that’s providing a pathway to a more sustainable fashion future while using one of the world’s largest waste sources to do it, ALT TEX is leading the way. You can follow their journey and explore more on [their website](https://thealttex.com/).\n\n**Tags:** carbon-capture-and-removal, bioplastic, biotech, climate, food-tech\n\nIn a world where environmental concerns are paramount, ALT TEX isn’t just making fabric; they’re shaping a movement toward responsible fashion.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/2ce109e270b403c98b7d3261d03db55d900c07bf.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T190955Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=322055ce137d0745cae3dc3cb364691c0adb3a21fb65e472bd67d6bc16d53e0c",
    "social_links": [
        "https://www.linkedin.com/company/alt-tex/",
        "https://twitter.com/thealttex"
    ],
    "logo_path": "data/logos\\ALT_TEX_logo.png"
}