{
    "links": "https://www.ycombinator.com/companies/amal-invest",
    "name": "Amal Invest",
    "headline": "Investing app for Muslims",
    "batch": "W22",
    "description": "Amal's an investing app for Muslims. Muslims only invest in Shariah-compliant business, but it's hard to know which businesses are compliant. That's because it's based on complex financial metrics that change over time. We take that burden away entirely.\r\n\nAmal can filter stocks but also, remarkably, funds. Set your filters up once, and you'll have access to a universe of investments that cater to your specific requirements. Sign up today at https://amalinvest.com",
    "activity_status": "Active",
    "website": "https://amalinvest.com",
    "founded_date": 2021.0,
    "team_size": 3.0,
    "location": "Manama, Bahrain",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:investing; industry:retail",
    "founders": [
        {
            "name": "Yazin Alirhayim, Founder",
            "description": "I've spent the past 8 years in fintech, having previously founded White (a \"Stripe for the Middle East\"; acq '15) and Verify (a \"Plaid for the Mi..\" you get the drift). Before that, I spent several years working at GE — including a couple of years as a field engineer installing monitoring equipment on turbines in the desert!",
            "linkedin": "https://bh.linkedin.com/in/yazin/"
        }
    ],
    "status": true,
    "generated_description": "### Amal Invest: A Smart Route to Shariah-Compliant Investing\n\n**What is Amal Invest?**\nFounded in 2021 and part of Y Combinator’s Batch W22, Amal Invest is a savvy fintech venture based in Manama, Bahrain. At its core, it's an investment app designed to cater to Muslims who want to ensure their investments are Shariah-compliant. Given the complexity involved in identifying suitable investment options, Amal has simplified this uphill task by filtering through extensive data to help users make informed decisions effortlessly.\n\n**The Problem it Addresses**\nInvesting in stocks typically comes with a multitude of questions regarding compliance with Shariah law. Traditional financial metrics can be convoluted and frequently changing, making it hard for Muslims to know where their money is going. Amal Invest removes that uncertainty by providing a platform where users can set their investment preferences just once and access a tailored universe of compliant investment options.\n\n**How It Works**\n1. **Pick Funds**: Users can choose from over 100,000 ETFs and mutual funds, including renowned names like Fidelity and Vanguard.\n2. **Filter**: The app automatically filters out non-compliant stocks, leaving only Shariah-compliant ones.\n3. **Invest**: With a single click, users can invest in this newly curated fund. Amal takes care of rebalancing and synchronization, making the process seamless.\n\n**Investment Performance**\nStudies show that Shariah-compliant companies often perform better due to their adherence to sound financial practices. Users can expect to see returns that exceed market averages—an appealing prospect for anyone looking to grow their wealth.\n\n**Pricing**\nAmal Invest operates on a straightforward subscription model at just $25 per month, billed annually. This package includes:\n- Unlimited investing\n- No fund management fees\n- Access to over 100,000 filtered funds\n- Priority support\n- Shariah compliance monitoring\n\n**Ideal Users**\nAmal Invest is perfect for:\n- Individuals new to investing who seek simplicity.\n- Those looking to ensure their investments align with Islamic principles.\n- Anyone wanting control and transparency in their financial decisions.\n\nHowever, it’s not for everyone. If you’re looking for guaranteed returns, focus solely on day trading, or require phone-based support, you might want to consider other options.\n\n**Final Thoughts**\nAmal Invest represents a pioneering approach to investment for the Muslim community, addressing a significant gap in the market. By combining cutting-edge technology with robust compliance procedures, they not only empower users to invest confidently but also contribute positively to the ethics of investing. \n\nFor more information or to start investing today, check out their website: [Amal Invest](https://amalinvest.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/d47a8d1c34384c4239230f93828617765cc8e982.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T190955Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=83ae7bc6f0969417195ee77209283ea7ed9b6c8b5f5af9ac021b0c31ec125ae3",
    "social_links": [
        "https://twitter.com/amalinvest",
        "https://github.com/amalinvest"
    ],
    "logo_path": "data/logos\\Amal_Invest_logo.png"
}