{
    "links": "https://www.ycombinator.com/companies/ananya-health",
    "name": "Ananya Health",
    "headline": "Portable cryoablation to prevent cervical cancer",
    "batch": "S21",
    "description": "Building a standard-of-care medical device to freeze abnormal cells before they become cervical cancer, in any clinic, anywhere in the world, at 1/10 the cost.\r\n--\r\nAnanya Health is building a portable cryoablation unit designed for every primary care clinic in the world. Our beachhead application is cervical cancer prevention -- even though cervical cancer is easy to screen for, 80% of clinics worldwide lack the infrastructure and specialized staff to treat at the earliest stages. Our platform technology allows nurses and lower level health workers to treat at the point of care for 1/10 the cost of traditional ablation, and is the only cryo device that will help us achieve the WHO target to eliminate cervical cancer in our lifetime.",
    "activity_status": "Active",
    "website": "https://www.ananya.health/",
    "founded_date": 2020.0,
    "team_size": 6.0,
    "location": "San Francisco",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:hardware; industry:health-tech; industry:medical-devices; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Anu Parvatiyar, Founder",
            "description": "Cofounder & CEO at Ananya Health. I’m a medical device engineer turned public health technologist. I love building products that expand access to healthcare in emerging markets — from better data tools to improve childhood vaccination rates in Nigeria, to medical devices that allow nurses and midwives to deliver the same high-quality standard of medicine as specialized Ob/Gyns.",
            "linkedin": "https://www.linkedin.com/in/anuparvatiyar/"
        }
    ],
    "status": true,
    "generated_description": "Ananya Health is on a mission to tackle one of the most preventable yet devastating forms of cancer: cervical cancer. Founded in 2020 and thriving in the San Francisco area, this innovative health tech startup is revolutionizing how we approach early treatment of pre-cancerous cervical lesions with its portable cryoablation unit, making it accessible to clinics worldwide.\n\nHere's the kicker: while cervical cancer is more than 90% preventable, a staggering 40 million people with a cervix miss out on crucial prevention technologies each year. They set out to change that by creating a system that costs just 1/10 of what traditional cryoablation systems do, which often rely on bulky gas canisters and specialized staff. Ananya's device allows nurses and other lower-level health care workers to provide treatment right where it's needed—at the point of care—significantly reducing barriers to access.\n\nAs a Y Combinator Batch S21 company, Ananya Health has been making waves, evidenced by their recent achievement of securing a $2.3 million grant from the National Cancer Institute. This funding will help expedite the development and optimization of their flagship product, the CRCL™ system, designed to freeze abnormal cells effectively and painlessly.\n\nThe company’s team of six is led by co-founder and CEO Anu Parvatiyar, who, along with co-founder Julie Yip and CTO Allen Chang, brings diverse backgrounds in engineering, innovation, and health care to the table. They understand that the future of women’s health relies on overcoming existing treatment access barriers through innovative technology.\n\nIn the bigger picture, Ananya Health is aligned with global health efforts, seeking to contribute to the World Health Organization's goal of eliminating cervical cancer in our lifetime. Their vision is clear: to prevent cervical cancer in every clinic, everywhere, ensuring that no woman misses out on life-saving treatment.\n\nIn summary, if you want to know a company that’s harnessing cutting-edge technology to save lives, look no further than Ananya Health. They’re not just changing the narrative around cervical cancer; they’re rewriting it. For more details, check them out at [Ananya Health](https://www.ananya.health).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/a0425499ee2e16edf14d7fdd3bee9cdda8dc20e3.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T190956Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=aafcbc58496b3a93fcdf1c182b7b0587847dce5cee3172b9e128839f37295194",
    "social_links": [
        "https://www.linkedin.com/company/ananya-health"
    ],
    "logo_path": "data/logos\\Ananya_Health_logo.png"
}