{
    "links": "https://www.ycombinator.com/companies/ancana",
    "name": "Ancana",
    "headline": "Marketplace to buy managed vacation homes through fractional ownership",
    "batch": "S21",
    "description": "With Ancana, you can own a 1/4 or 1/8 share of the home and split expenses with the other co-owners. If you buy a 1/4 share of a home, you have access to it for 3 months of the year. For each property we set up the investment trust, find qualified co-owners, and handle the entire real estate purchase transaction. Costs are split amongst the co-owners, and we take care of the furnishing and ongoing property management.\r\n\nWe accomplish this by creating an investment trust for each property and dividing it into individual, purchasable shares that represent ownership in the property. We furnish each home and find and vet the co-owners. Once all of the shares of the property are sold, we retain no ownership stake in the property and transition into the role of property manager, ensuring the home is well maintained and handling any issues that arise. Unlike a timeshare, Ancana owners own a real asset (the property) versus a block of time. If you decide you want to sell your share, you are free to do so at any time, either through us or on the open market, and capture any appreciation the property has accrued.",
    "activity_status": "Active",
    "website": "https://www.ancana.co",
    "founded_date": 2019.0,
    "team_size": 7.0,
    "location": "Mérida, Mexico",
    "group_partner": "Aaron Epstein",
    "group_partner_yc": "https://www.ycombinator.com/people/aaron-epstein",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:marketplace; industry:travel; industry:proptech",
    "founders": [
        {
            "name": "Andres Barrios, Founder",
            "description": "Andres is a serial entrepreneur passionate about creating efficient real estate solutions to our ever growing population. He is an experienced founder that has demonstrated history of launching succesful tech startups in different industries and a real estate junky with more than 16 years of experience in acquisitions, property management, development and divestments.\n\nHas an MBA from UT at Austin",
            "linkedin": "https://www.linkedin.com/in/anbarrios/"
        },
        {
            "name": "Ryan Black, Founder",
            "description": null,
            "linkedin": "https://www.linkedin.com/in/ryanablack/"
        }
    ],
    "status": true,
    "generated_description": "**Company Overview: Ancana**\n\nFounded in 2019 and part of Y Combinator’s Batch S21, Ancana is transforming the way we think about vacation ownership. Based in Mérida, Mexico, this innovative company offers a marketplace for fractional ownership of managed vacation homes. With a small but dedicated team of seven, Ancana is spearheaded by Aaron Epstein as their Group Partner.\n\n**Mission and Business Model**\n\nThe mission of Ancana is straightforward yet impactful: to make vacation home ownership accessible and hassle-free. Unlike traditional models like timeshares, where you buy the right to use a property, Ancana allows individuals to purchase 1/4 or 1/8 shares of a luxury vacation home. This means if you own a 1/4 share, you can enjoy the home for three months of the year.\n\nHere's how it works:\n\n1. **Investment Trust Creation**: For each property, Ancana sets up an investment trust, dividing the home into shares that can be purchased by qualified co-owners.\n2. **Co-Owner Management**: They facilitate the entire purchasing process, connect like-minded co-owners, and handle the furnishing and ongoing management of the property.\n3. **Ownership and Flexibility**: Once all shares are sold, Ancana transitions to a property management role, leaving co-owners with actual asset ownership. Owners can sell their shares whenever they want, reaping any appreciation the property may have gained.\n\n**Key Benefits**\n\n- **Real Asset Ownership**: Owners are investing in a tangible asset rather than just a block of time.\n- **Effective Management**: Ancana manages all upkeep and cleaning, allowing owners to focus on relaxation and creating memories.\n- **Flexible Usage**: Owners can use their home on their terms and even rent out unused weeks to earn income.\n\n**Current Offerings**\n\nAncana provides access to luxury homes across various stunning destinations in Mexico, catering to different tastes—be it historical cities, tropical beaches, or serene mountains. They also offer a rental program and opportunities for global property exchanges through partnerships, further enhancing the experience for their co-owners.\n\n**Looking Ahead**\n\nAs Ancana continues to grow, they are focused on expanding their offerings and helping more people embrace the joys of ownership without the complexities typically associated with second homes. With a clear vision and an innovative model, Ancana is poised to redefine vacation home ownership for the modern traveler.\n\nFor anyone interested in exploring these unique opportunities, feel free to check out their website at [Ancana.co](https://www.ancana.co).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/413c0c9bd9d2428a1d164529dced70a7f5c02495.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T190957Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=37072534eaad7d10536c6ef95a8d578a8290aea4349cb2c286f22cf0ca27c874",
    "social_links": [
        "https://www.linkedin.com/company/ancana/",
        "https://twitter.com/ancanahomes",
        "https://www.facebook.com/ancanaliving",
        "https://www.crunchbase.com/organization/ancana"
    ],
    "logo_path": "data/logos\\Ancana_logo.png"
}