{
    "links": "https://www.ycombinator.com/companies/andi",
    "name": "Andi",
    "headline": "Search for the next generation using generative AI",
    "batch": "W22",
    "description": "Instead of just links, Andi gives you answers - like chatting with a smart friend. \r\n\nAndi is a new type of search engine that uses generative AI and language models combined with live data to generate factually correct answers to questions, and to explain and summarize information combined from the best sources. \r\n\nAndi works as a search chatbot that's ad-free and privacy-focused. Ask Andi to...\r\n\n✅  Answer questions\r\n🧠  Find, summarize and explain information\r\n🔍  Navigate and search the web\r\n\nSearch is broken because of SEO spam, ads, and surveillance capitalism. Andi cuts through the clutter to get you straight to the knowledge you need. It presents results visually in a way that's easy to understand with a simple chat interface, and protects you from ad tech and distraction.",
    "activity_status": "Active",
    "website": "https://andisearch.com",
    "founded_date": 2021.0,
    "team_size": 2.0,
    "location": "San Francisco",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Angela Hoover, Founder",
            "description": "Angela (CEO) is from a totally non-traditional founder background. She's a community college dropout who went from construction laborer to working with Microsoft on Azure, before launching Angie's Travels, a travel influencer startup. She started Andi after going through YC Startup School as a 23-year-old non-technical female founder with the idea for a \"not searching\" engine for Gen-Z.",
            "linkedin": "https://www.linkedin.com/in/angela-hoover/"
        },
        {
            "name": "Jed White, Founder",
            "description": "Jed (CTO) has been programming since he was 8, and sold his first software aged 12. He studied computer science (USyd-part/USFCA), and was editor-in-chief of Australia's top computer magazine at 23, before making a popular start page with 3m users, and building a media search and personalization startup. He has 20+ years experience in search and AI.",
            "linkedin": "http://linkedin.com/in/jedwhite"
        }
    ],
    "status": true,
    "generated_description": "### Andi: The Future of Search\n\n**Overview**  \nAndi is a search engine reimagined. Founded in 2021 and initially backed by Y Combinator's W22 batch, Andi leverages the latest advancements in generative AI to transform how we find information online. Based in San Francisco, it operates with a small, focused team of two, including a group partner named Nan.\n\n**Mission**  \nAndi's mission is straightforward: \"Search for the next generation using generative AI.\" This reflects its commitment to providing a user-friendly, intelligent search experience—like having a conversation with a knowledgeable friend rather than sifting through links and ads.\n\n**What Makes Andi Unique?**  \nTraditional search engines often drown users in SEO-optimized spam, intrusive ads, and endless tracking. Andi cuts through this clutter. Here’s how:\n- **Chat-Based Interface**: Andi operates as a chatbot, allowing users to ask questions naturally and receive concise, accurate answers.\n- **Privacy-Focused**: There are no ads or tracking. Your queries remain your own.\n- **Visual Results**: Information is presented in a visually appealing and digestible format, making it easier to understand complex topics.\n\n**Core Features**  \n- ✅ **Instant Answers**: Ask Andi anything, from \"how to lose belly fat\" to \"best places for digital nomads,\" and get reliable, succinct responses.\n- 🧠 **Information Summarization**: Andi can find, summarize, and explain information from the best sources available, enhancing your understanding of any subject.\n- 🔍 **Web Navigation**: With Andi, you can navigate the web more efficiently, sidestepping the usual distractions found in traditional search engines.\n\n**The Verdict**  \nAndi is a refreshing take on search, aiming to enhance the user experience with cutting-edge AI while prioritizing privacy and simplicity. If you're fed up with endless scrolling and irrelevant ads, Andi might just be the smarter, more efficient solution you've been looking for. \n\nCheck it out at [Andi's Website](https://andisearch.com) and experience search like never before.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/dfd2443343f5af1e6a45fe931fa45b73ad024966.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T190957Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=cebba8f0631176d045106c6b816a715e86254e26b6685685574d73136f0d1697",
    "social_links": [
        "https://www.linkedin.com/company/andisearch/",
        "https://twitter.com/andi_search",
        "https://www.facebook.com/andisearch",
        "https://www.crunchbase.com/organization/andi",
        "https://github.com/andisearch/"
    ],
    "logo_path": "data/logos\\Andi_logo.png"
}