{
    "links": "https://www.ycombinator.com/companies/andson-biotech",
    "name": "Andson Biotech",
    "headline": "Empowering Mass Spec for Biotech and Beyond",
    "batch": "W22",
    "description": "Andson Biotech helps pharmaceutical companies measure difficult to detect chemicals that they need to measure while developing and manufacturing drugs like cell-therapies or biologics. Drug companies want to use our technologies to get fast and accurate chemical measurements they do thousands of times per day for drug development and quality control.",
    "activity_status": "Active",
    "website": "http://www.andsonbiotech.com",
    "founded_date": 2021.0,
    "team_size": 4.0,
    "location": "Atlanta, GA",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:gene-therapy; industry:hard-tech; industry:biotech; industry:healthcare; industry:therapeutics",
    "founders": [
        {
            "name": "Mason Chilmonczyk, Founder",
            "description": "Mason is the co-founder and CEO of Andson Biotech, an academic spinout based on Mason's research at the Georgia Institute of Technology. At Andson, Mason is driving the company's mission to develop novel methodologies for advanced biomanufacturing discovery and monitoring. Mason is formally trained as a mechanical engineer with a BS from the University of South Florida ('14) and an MS and PhD from Georgia Tech ('17, '20).",
            "linkedin": "https://www.linkedin.com/in/mason-chil/"
        }
    ],
    "status": true,
    "generated_description": "### Andson Biotech: Revolutionizing Drug Development Through Advanced Mass Spectrometry\n\n**Mission:** Empowering Mass Spec for Biotech and Beyond.\n\n**Founded:** 2021  \n**Location:** Atlanta, GA  \n**Team Size:** 4 employees  \n**Y Combinator Batch:** W22\n\n---\n\nAndson Biotech emerged with a clear purpose: to empower pharmaceutical companies in their quest for precision by making mass spectrometry faster and more efficient. Their core technology helps drug developers measure challenging chemicals essential in creating innovative therapies, including cell therapies and biologics. This is crucial for quality control and drug development, where accuracy and speed are paramount.\n\n### The Challenge\n\nModern biotherapeutics—think cutting-edge treatments for diseases like cancer and genetic disorders—demand sophisticated analytical tools. As it stands, mass spectrometry (mass spec) has long been the gold standard for characterizing complex biological samples, thanks to its unique combination of accuracy, sensitivity, and resolution. However, existing workflows often fall short due to low-throughput sample preparation and limited analytical insights, creating a bottleneck in the drug development process.\n\n### Andson's Solution: DynaCHIP\n\nEnter **DynaCHIP**, Andson Biotech's innovative system designed to streamline mass spectrometry workflows. By incorporating advanced microfluidics, DynaCHIP reduces sample preparation to a mere second, drastically accelerating the entire mass spec process. This allows drug developers to obtain rapid results that were previously unattainable—cutting down on both time and costs while enhancing the reliability of drug metrics.\n\n### Simplifying Biotherapeutic Development\n\nAndson Biotech focuses on three key areas: \n\n1. **Accelerate and Simplify Measurements:** By optimizing conventional mass spec workflows, they help researchers get the insights they need more efficiently.\n   \n2. **Improve Assays for Drug Discovery:** DynaCHIP facilitates the creation of better, faster assays, helping bring advanced therapies to market quickly.\n   \n3. **High-Throughput Bioanalytics:** Their technology not only reduces costs and timelines but also allows for dynamic feedback control throughout the bioprocess.\n\n### Conclusion\n\nWith a forward-thinking approach and a commitment to supporting modern biotherapeutics, Andson Biotech is set to redefine the analytical landscape for drug development. By simplifying processes that traditionally have been cumbersome, they’re enabling pharmaceutical companies to focus on what truly matters—the development of life-changing therapies.\n\nFor more information on how Andson Biotech can streamline your mass spec workflows, visit their website: [Andson Biotech](http://www.andsonbiotech.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/b51c2468f2db4e381a6b837fa56754b84522b9d2.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T190957Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=fc483fd25951a634b2707e2344018e2bbf7b703dc7b9df90772d425c8fba7830",
    "social_links": [
        "https://www.linkedin.com/company/andson-biotech/"
    ],
    "logo_path": "data/logos\\Andson_Biotech_logo.png"
}