{
    "links": "https://www.ycombinator.com/companies/anfin",
    "name": "Anfin",
    "headline": "A multi-asset trading platform dedicated to retail investors",
    "batch": "W22",
    "description": "Anfin is a modern trading platform that aims to democratize access to financial services and wealth management for Vietnam’s retail investors.\r\n\nOur mission is to help the underserved retail investor navigate the complexities of investments in Vietnam, from stock market to the underutilized commodity trading.\r\n\nWe are backed by international renowned investors such as YC, Goodwater Capital, Global Founders Capital, and many more.",
    "activity_status": "Active",
    "website": "https://anfin.vn/",
    "founded_date": 2021.0,
    "team_size": 40.0,
    "location": "Ho Chi Minh City, Vietnam",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:consumer; industry:investing",
    "founders": [
        {
            "name": "Phuoc Tran, Founder",
            "description": "Phuoc Tran is the co-founder & CEO of Anfin, a modern trading and wealth management products for Vietnam's investors. Previously, he co-founded VRED. VRED onboarded sales agents in rural Vietnam to distribute e-commerce and financial products. VRED boasted 500,000+ sales agent, and it distributes $36M GTV monthly. Moreover, Phuoc co-founded Ahamove, one of the leading on-demand delivery platforms in Vietnam. During his tenure, Ahamove was conducting 20,000+ deliveries/day",
            "linkedin": "https://www.linkedin.com/in/phuoc-tran-b9979611/"
        }
    ],
    "status": true,
    "generated_description": "### Anfin: Empowering Retail Investors in Vietnam\n\n**Overview**  \nAnfin is a multi-asset trading platform, launched in 2021, that aims to democratize access to financial services and wealth management for retail investors in Vietnam. Located in Ho Chi Minh City, the company is operating with a 40-member team and has been recognized by esteemed investors such as Y Combinator, Goodwater Capital, and Global Founders Capital.\n\n**Mission**  \nAnfin's mission is crystal clear: to empower underserved retail investors by simplifying the complexities of investment, whether in the stock market or in less common commodities. Essentially, it's about making investing accessible and user-friendly—especially for those who might feel intimidated by traditional investment avenues.\n\n**Features**  \n1. **Intuitive Trading Platform**: Anfin provides a user-friendly interface that makes it easy for users to manage their finances and make investment decisions.\n2. **Flexible Investment Options**: With the ability to trade over 500 stocks and ETFs, alongside futures trading, it caters to a diverse range of investment preferences.\n3. **Community Engagement**: An important aspect of Anfin is fostering a community of investors that can connect, share ideas, and learn together.\n4. **Smart Tools**: Using innovative tools and content like Anfin GPT, the platform offers automated investment strategies and personalized advice, helping users make informed choices.\n5. **Rapid Transactions**: Users can deposit and withdraw funds quickly, making the investment process seamless.\n\n**Recognition and Growth**  \nBeing part of the Y Combinator Batch W22 has positioned Anfin strategically within the fintech space, which has attracted attention from both local and international investors. This backing not only adds credibility but also paves the way for continuous development and innovative features.\n\n**Conclusion**  \nFor retail investors in Vietnam, Anfin represents a significant advancement in the financial services landscape. With its commitment to education, transparency, and user empowerment, it's aiming not just to participate in the fintech revolution, but to lead it with a community-oriented approach to investing. \n\nWant to learn more? Check out their [website](https://anfin.vn/) for additional details and tools to kickstart your investing journey.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/561bc29fb50816fea450c8445bdbe5bb3b7bfe8f.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T190957Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=c842927a8fa637630f9ae058d7fa1c0a788d83b588c9b79bdfc6be047a873b22",
    "social_links": [
        "https://www.linkedin.com/company/anfin-vn/mycompany/",
        "https://www.facebook.com/anfin.vn/",
        "https://www.crunchbase.com/organization/anfin"
    ],
    "logo_path": "data/logos\\Anfin_logo.png"
}