{
    "links": "https://www.ycombinator.com/companies/anja-health",
    "name": "Anja Health",
    "headline": "Cord Blood Banking Reimagined",
    "batch": "W22",
    "description": "Helping pregnant parents save the most personal source of stem cells - from their umbilical cord and placenta - to unlock future disease treatments. Offering cord blood banking, cord tissue banking, and placenta stem cell banking.",
    "activity_status": "Active",
    "website": "https://anjahealth.com",
    "founded_date": 2021.0,
    "team_size": 2.0,
    "location": "Los Angeles, CA",
    "group_partner": "Jared Friedman",
    "group_partner_yc": "https://www.ycombinator.com/people/jared-friedman",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:consumer-health-services; industry:consumer; industry:healthcare; location:los-angeles",
    "founders": [
        {
            "name": "Kathryn Cross, Founder",
            "description": "Kathryn Cross is the founder of Anja Health, which she founded in memory of her brother, Andrew, who had cerebral palsy. Kathryn has cultivated a pregnancy and cord blood banking community on TikTok as @kathrynanja, where she raises awareness about the importance of cord blood banking and other issues related to pregnancy.  Originally from Los Angeles, Kathryn graduated from Wellesley, where she received a B.A. in Media Arts & Sciences and Economics.",
            "linkedin": "https://www.linkedin.com/in/kathryn-cross/"
        }
    ],
    "status": true,
    "generated_description": "**Anja Health: Cord Blood Banking Reimagined**\n\nFounded in 2021 and located in Los Angeles, California, Anja Health is a dynamic startup that aims to transform the realm of cord blood banking. Opening its doors as part of Y Combinator's Batch W22, the company is dedicated to empowering parents to save a vital source of stem cells from their baby’s umbilical cord and placenta—a decision that could pave the way for future medical breakthroughs.\n\n**What They Do:**\nAnja Health offers several services:\n- **Cord Blood Banking**: Storing blood from the umbilical cord that is rich in hematopoietic stem cells.\n- **Cord Tissue Banking**: Preserving tissue that can potentially lead to innovative therapies.\n- **Placenta Stem Cell Banking**: An option that few competitors provide, positioning Anja ahead in this niche field.\n\nTheir mission revolves around making cord blood stem cell banking accessible and affordable for everyone—regardless of race, income, or socioeconomic status. Every option is streamlined and focuses on simplifying the experience for new parents while ensuring maximum potential medical benefits.\n\n**The Team:**\nWith a compact team of just two staff members, Anja Health is spearheaded by CEO Kathryn, who is deeply motivated by personal experiences, having founded the company in memory of her younger brother, Andrew.\n\nThey proudly boast a partnership with Jared Friedman from Y Combinator and significant backing from notable investors, including Alexis Ohanian. Their credibility is further affirmed by using an AABB-accredited lab with over four decades of blood processing experience.\n\n**Customer-Centric Approach:**\nAnja Health has quickly built a reputation for excellent customer service and transparent pricing. Their approach eliminates surging upfront costs and credit checks, offering plans as low as $49.99/month after an initial payment of $199. They provide 24/7 support and a unique personalized processing method that can yield up to 25% more stem cells than conventional services.\n\n**Why Choose Anja?**\nHere’s what sets them apart:\n- **Access to Placenta Banking**: A rare and valuable option.\n- **Affordable Payment Plans**: An upfront cost significantly lower than most competitors.\n- **Community Engagement**: A robust and growing social media presence of over 200,000 followers, creating a familial brand experience.\n- **Responsive Customer Care**: Anecdotal evidence from customers highlights swift assistance, even in urgent situations, such as early births.\n\n**Real-Life Impact:**\nThe importance of banking cord blood and tissue can’t be overstated; numerous success stories illustrate how these stem cells have made a difference in treating genetic conditions and serious illnesses. From aiding cerebral palsy symptoms to providing life-saving transplants for cancer patients, the potential of stem cells is enormous.\n\nTo encapsulate, Anja Health stands at the intersection of health technology and compassionate service, revolutionizing how challenging decisions at birth are navigated. By bridging the gap between powerful medical options and families, they're not just banking cells; they’re safeguarding futures. \n\n**Website**: For more details, parents can visit [Anja Health](https://anjahealth.com) and even get a 10% discount on their first order.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/8dfac18cd8b9f26bc8cda9f1ea5b35da8be61eab.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T190958Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=749c15dc4ca96b3d2c6b82541eec23b3d4343e65e268ec70d2af3e4a99baa8b0",
    "social_links": [
        "https://linkedin.com/company/anjahealth",
        "https://twitter.com/anjahealth",
        "https://facebook.com/anjahealth"
    ],
    "logo_path": "data/logos\\Anja_Health_logo.png"
}