{
    "links": "https://www.ycombinator.com/companies/anylist",
    "name": "AnyList",
    "headline": "One app for stress-free shopping, cooking, and meal planning.",
    "batch": "S10",
    "description": "AnyList is the best way to create and share grocery shopping lists. Easily share a list with your spouse or roommates. List changes show up instantly on everyone’s iOS or Android device.",
    "activity_status": "Active",
    "website": "https://www.anylist.com",
    "founded_date": 2010.0,
    "team_size": 2.0,
    "location": "Missoula, MT",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:e-commerce; industry:food-&-beverage",
    "founders": [],
    "status": true,
    "generated_description": "### AnyList: Streamlining Your Shopping and Cooking Experience\n\n**Company Overview:**\nFounded in 2010 and based in Missoula, MT, AnyList is a small yet impactful startup that's a proud member of Y Combinator's Summer 2010 batch. With a dedicated team of just two employees, it strives to simplify the often chaotic tasks of grocery shopping, cooking, and meal planning through its intuitive app.\n\n**Mission Statement:**\nAnyList’s mission is straightforward: to provide one comprehensive app that enables stress-free shopping, cooking, and meal planning.\n\n**What They Offer:**\nInitially, AnyList was heralded as the best way to create and share grocery shopping lists. It allows users to easily share lists with family or friends, ensuring updates are instantly visible on both iOS and Android devices. Over the years, AnyList has expanded its functionality to encompass more than just grocery lists. Users can now also:\n\n- Create **organized shopping lists** that remember common items and automatically categorize them for efficiency.\n- **Share lists** in real-time, so you never miss out on what someone has added or removed.\n- **Organize recipes** and create a personal digital cookbook, allowing for seamless meal planning.\n- Use Siri to add items by voice, keeping your hands free and your mind focused.\n\nWith its premium features, users can unlock additional functionalities such as meal planning calendars, item photos for clarity, and themed list appearances.\n\n**Market Position and Tags:**\nAnyList operates in the intersection of e-commerce and food & beverage, carving out a niche in the realm of grocery list and meal planning apps. \n\n**Current Status:**\nWith a lean team and an emphasis on versatile features, AnyList continues to evolve and cater to the needs of modern shoppers. Their commitment is evident not only in user-friendly design but also in enhancing the cooking experience, reducing the cognitive load that comes with meal planning and groceries.\n\nTo dive deeper into their offerings or to download the app, you can visit their website: [AnyList](https://www.anylist.com). \n\nWhether you're looking to streamline your shopping trips or organize your culinary adventures, AnyList is here to help keep things organized and stress-free.",
    "logo": "/logos/medium/missing.png",
    "social_links": [
        "https://twitter.com/AnyListApp",
        "https://www.crunchbase.com/organization/anylist"
    ]
}