{
    "links": "https://www.ycombinator.com/companies/apero-health",
    "name": "Apero Health",
    "headline": "Modern medical billing",
    "batch": "S19",
    "description": "We help healthcare companies run their practices.  Eligibility, BI, claims, patient payments?  Shoot us an email at founders@aperohealth.com\r\n\nApero is a Y-Combinator-backed startup based in San Francisco bringing transparency and ease to medical billing.  As one of the top startups from the Summer 2019 Y Combinator batch, we have raised from well-known investors including the creator of Gmail Paul Buchheit and the founders of Doctor on Demand, Gusto and Reddit, and serve startups that have raised over $1B in Venture Capital.\r\n\nThe founding team are Stanford CS and Berkeley grads and include the CTO of Doctor on Demand having helped raised $240m and process millions of video calls.  We are also hiring  for engineers and product-minded operations people interested in giving price transparency to patients and providers.\r\n\nWe serve practices nationwide, and integrate with leading EHRs as well.",
    "activity_status": "Active",
    "website": "https://www.aperohealth.com",
    "founded_date": 2019.0,
    "team_size": 24.0,
    "location": "San Francisco",
    "group_partner": "Garry Tan",
    "group_partner_yc": "https://www.ycombinator.com/people/garry-tan",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:health-tech; industry:finance; industry:digital-health; industry:enterprise-software; location:san-francisco-bay-area",
    "founders": [],
    "status": true,
    "generated_description": "**Apero Health: Simplifying Medical Billing for Health Innovators**\n\nApero Health, founded in 2019 and proudly backed by Y Combinator (Batch S19), is a San Francisco-based startup that’s aiming to rewire how medical billing is done. With the mission of bringing “modern medical billing” to healthcare practices, Apero promises a future where transparency and simplicity reign supreme in the often convoluted world of healthcare finance.\n\n### Who They Are\n\nApero began with a straightforward idea: to help healthcare companies run their practices more efficiently. Now, they've expanded to integrate critical services like eligibility checks, business intelligence insights, claims processing, and managing patient payments. The founding team consists of graduates from elite institutions like Stanford and Berkeley, including the former CTO of Doctor on Demand, bringing invaluable experience in scaling health tech platforms.\n\nTheir credibility is backed by an impressive roster of investors, including Paul Buchheit, creator of Gmail, and founders from notable tech companies like Gusto and Reddit. Today, Apero has grown to a nimble team of 24 industriously pursuing their vision across practices nationwide.\n\n### What They Do\n\nApero offers a **comprehensive platform** that packs everything care providers need to manage and grow their practices into a modular and intuitive interface. Think of it as your all-in-one toolkit for healthcare operations, featuring:\n\n- Scheduling and visit notes\n- Revenue cycle management (RCM)\n- Patient billing systems\n- E-prescriptions\n- Financial reporting \n\nThe essence of Apero’s offering is its ability to reduce the hassle of insurance management. They're not just about convenience; by incorporating cutting-edge technology, Apero claims to slash billing time by up to 80%, allowing providers to refocus their energies on what truly matters: patient care.\n\n### Integration and Trust\n\nApero seamlessly integrates with leading Electronic Health Records (EHR) systems, ensuring that practices can hook up their operations without a hitch. And rest assured, they haven’t skimped on security – their architecture is fully HIPAA compliant, encrypted, and carries SOC I and SOC II Type 2 certifications. \n\nTheir approach to security has stemmed from founders with extensive backgrounds, including the National Security Agency, ensuring that your data is safeguarded against the rising backdrop of cyber threats.\n\n### Why It Matters\n\nApero is more than just software; they’re equipped to empower healthcare providers with the tools they need for transparent billing practices, drastically improving operational efficiency. From startups in the health space to established public companies, Apero is on a mission to redefine how healthcare billing is perceived and executed.\n\nIf you’re a health innovator looking to alleviate the burdensome intricacies of healthcare billing, Apero may just be the partner you need to drive both patient satisfaction and business growth.\n\nFor more details, or to get in touch, visit their website at [Apero Health](https://www.aperohealth.com) or reach out directly at founders@aperohealth.com.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/f0a88a768d1f6182ce0d933c5344e5413d9ea52c.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T190959Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=84a688a4cf257c678e69bf6f88d41fabe524eb6e338c2d698a13857811b18caa",
    "social_links": [
        "https://www.linkedin.com/company/apero-health/",
        "https://twitter.com/AperoHealth",
        "https://www.facebook.com/aperohealth/"
    ],
    "logo_path": "data/logos\\Apero_Health_logo.png"
}