{
    "links": "https://www.ycombinator.com/companies/apriora",
    "name": "Apriora",
    "headline": "Your AI recruiter for interviewing and identifying the best talent",
    "batch": "W24",
    "description": "Apriora conducts live interviews with an AI recruiter. Companies use us to get the best hiring signal on their applicant pool and hire in a fraction of the time.\r\nOur AI recruiter has a live conversation over a video call with each of your candidates based on the interview questions you choose or that are recommended based on the job description. During the interview, our AI asks personalized follow-up questions in real-time based on the candidate's responses.\r\nOur AI recruiter can be customized to your roles in minutes and has already conducted thousands of interviews across engineering, IT, retail, hospitality, and more.",
    "activity_status": "Active",
    "website": "https://www.apriora.ai",
    "founded_date": 2023.0,
    "team_size": 5.0,
    "location": "San Francisco",
    "group_partner": "Nicolas Dessaigne",
    "group_partner_yc": "https://www.ycombinator.com/people/nicolas-dessaigne",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:artificial-intelligence; industry:saas; industry:b2b; industry:recruiting; industry:hr-tech; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Aaron Wang, Founder",
            "description": "Before Apriora, Aaron worked in quant finance and at Facebook AI. He studied computer science, applied math, and economics at Brown.",
            "linkedin": "https://linkedin.com/in/aaronjwang"
        },
        {
            "name": "John Rytel, Founder",
            "description": "Technical co-founder with a software engineering background, and experience working throughout the entire stack.",
            "linkedin": "https://linkedin.com/in/john-rytel-955436221"
        }
    ],
    "status": true,
    "generated_description": "**Apriora Overview**\n\nFounded in 2023 and based in San Francisco, Apriora is an innovative company that integrates artificial intelligence into the hiring process. Positioned within Y Combinator's Batch W24, Apriora's mission is clear: it aims to serve as your AI recruiter for interviewing and identifying the best talent quickly and efficiently.\n\n**How Apriora Works**\n\nThe heart of Apriora's offering is Alex, an AI-driven interview platform that conducts live video interviews with candidates. It allows companies to customize interview questions tailored to specific roles, or leverage AI-recommended questions based on job descriptions. During these interactive sessions, Alex can engage with candidates in real time, prompting personalized follow-up questions based on their responses. This adaptability has allowed Alex to conduct thousands of interviews across diverse sectors, including engineering, IT, retail, and hospitality, all in a fraction of the time traditional methods require.\n\n**Key Features**\n\n1. **Live Interviews & Automated Scheduling**: Alex can conduct real-time interviews and set up schedules, significantly improving recruiter efficiency.\n  \n2. **Cheat Detection**: The platform identifies candidates attempting to use external resources, like ChatGPT, during interviews.\n\n3. **In-depth Candidate Reports**: After each interview, Alex generates detailed reports summarizing candidates' fit and qualifications, thus enabling data-driven hiring decisions.\n\n4. **ATS Integration**: The system syncs seamlessly with existing applicant tracking systems (ATS), ensuring that all candidate data is centralized and actionable.\n\n**Team & Leadership**\n\nApriora operates a compact but dedicated team of five employees, under the guidance of Group Partner Nicolas Dessaigne. \n\n**Market Positioning and Impact**\n\nAs a B2B SaaS provider, Apriora’s focus is on revolutionizing HR-tech and recruiting processes. By enhancing candidate engagement through live, two-way conversations, it ensures that companies don’t miss out on promising talent, transforming the traditionally labor-intensive recruitment landscape.\n\n**Client & Candidate Testimonials**\n\nAccording to users, candidates appreciate being able to engage in detailed, personal conversations during their interviews with Alex. Recruiters report that this system has redefined their capacity to evaluate candidates, eliminating traditional limitations on the number of interviews conducted daily.\n\n**Final Thoughts**\n\nIn an era where time is money, Apriora's blend of AI and human-like interaction in recruitment represents a promising shift in how businesses identify and interact with potential hires. Their adept AI not only enhances recruiter productivity but also enriches the candidate experience, paving the way for a new standard in hiring practices.\n\nFor more information, visit: [Apriora's Website](https://www.apriora.ai).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/2323f4e63b16cfca3019bacb141953ca0e3c2873.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191001Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=8ed906fe4369cc49687078051efc6c6621f3715303d4e101fe0fe28172369d7e",
    "social_links": [
        "https://www.linkedin.com/company/apriora/"
    ],
    "logo_path": "data/logos\\Apriora_logo.png"
}