{
    "links": "https://www.ycombinator.com/companies/aptdeco",
    "name": "AptDeco",
    "headline": "AptDeco is the easiest way to buy and sell used furniture",
    "batch": "W14",
    "description": "AptDeco is a peer-to-peer managed marketplace dedicated for buying and selling quality used furniture. We offer a complete end-to-end process to bring back the joy of discovering amazing furniture finds for the home again. Our customers benefit from a trusted and verified community of buyers and sellers, pre-arranged pick up and delivery and a secure electronic payment process.",
    "activity_status": "Active",
    "website": "https://www.aptdeco.com/",
    "founded_date": 2014.0,
    "team_size": null,
    "location": "New York",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:marketplace; industry:logistics; industry:furniture; location:new-york",
    "founders": [],
    "status": true,
    "generated_description": "AptDeco is revolutionizing how we buy and sell used furniture. Founded in 2014 and part of Y Combinator's W14 batch, AptDeco is a peer-to-peer marketplace that's based in New York, focusing on the growing desire for quality, pre-loved furniture. Their mission is simple: to make the process of buying and selling used furniture easy and enjoyable.\n\nAt its core, AptDeco provides a full-service platform that connects buyers and sellers, ensuring a secure, trusted community. Users can browse a vast catalog of furniture ranging from sofas to rugs, and everything in between. Notably, they manage the logistics with pre-arranged pick-up and delivery services, which takes a lot of the hassle out of moving items. And let's not forget the importance of secure electronics—AptDeco ensures that transactions are safe and reliable.\n\nSustainability is a vital part of AptDeco’s ethos. The company recognizes the environmental impact of furniture waste, with an alarming 12 million tons of used furniture ending up in landfills each year. AptDeco works to combat this by extending the lifecycle of furniture, making it circular instead of linear. This not only prevents waste but also contributes to a greener planet; they've proudly reported significant CO2 offsets, cars removed from the road, and trees planted through their initiatives.\n\nAptDeco has a strong partnerships approach, collaborating with major brands like West Elm, IKEA, and CB2, alongside other respected names in the industry, offering customers amazing finds. If you want to dive into a treasure hunt of furniture, you can navigate through various categories and brands directly on their website: [AptDeco](https://www.aptdeco.com/).\n\nIn summary, AptDeco isn’t just a marketplace; it’s a thriving community committed to sustainability and quality living. Whether you're looking to refresh your home or clear out some space with pre-owned treasures, AptDeco is designed to make that experience seamless and enjoyable. Plus, by choosing used furniture, you're not just saving money; you’re also doing your part for the environment. It's a win-win.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/7f8bd44435928d5290427ec2737c7a7040872ea9.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191002Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=5ee187fbd35624d63b8d8caed70b0226ded14983287bcf8268d6b2ebbca34382",
    "social_links": [
        "https://www.linkedin.com/company/aptdeco",
        "https://twitter.com/aptdeco",
        "https://www.facebook.com/AptDeco",
        "https://www.crunchbase.com/organization/aptdeco",
        "https://github.com/aptdeco"
    ],
    "logo_path": "data/logos\\AptDeco_logo.png"
}