{
    "links": "https://www.ycombinator.com/companies/aqua",
    "name": "Aqua",
    "headline": "The Modern Way for Financial Advisors to Put Their Clients into Alts",
    "batch": "S21",
    "description": "An end-to-end platform that allows financial advisors to put their clients into curated alternative assets without additional operational lift.",
    "activity_status": "Active",
    "website": "https://www.investwithaqua.com",
    "founded_date": 2020.0,
    "team_size": 6.0,
    "location": "New York",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:finance; industry:investing; industry:investments; location:new-york",
    "founders": [
        {
            "name": "Rohan Marwaha, Founder",
            "description": "Previously at Blackstone.",
            "linkedin": "https://www.linkedin.com/in/rohanmarwahanj/"
        },
        {
            "name": "Dev Patel, Founder",
            "description": "Previously at Bank of America",
            "linkedin": "https://www.linkedin.com/in/devpatel9/"
        }
    ],
    "status": true,
    "generated_description": "**Aqua: The Modern Alternative Investing Experience**\n\nFounded in 2020 and hailing from the bustling financial hub of New York, Aqua is an innovative fintech startup that aims to streamline how financial advisors access alternative assets for their clients. It initially emerged from Y Combinator’s S21 batch, and its mission is straightforward: to empower financial advisors to seamlessly invest in alternative asset classes—something typically reserved for large institutions and ultra-high-net-worth individuals.\n\n### What Aqua Does\n\nAqua is an end-to-end platform tailored for financial advisors, designed to facilitate investments in curated alternative assets without the cumbersome operational overhead. This platform connects advisors to a handpicked selection of top-tier private equity, venture capital, and real estate funds, effectively democratizing access to wealth-building opportunities that have historically been out of reach.\n\n**Investment Opportunities**: Alternative investments can include private equity, hedge funds, venture capital, and real estate, all of which Aqua provides personalized access to. Their approach not only increases exposure to higher-performing investments but also allows for better portfolio diversification.\n\n### The Team\n\nWith a compact team of six employees, Aqua is spearheaded by co-founders Rohan Marwaha and Dev Patel, both of whom bring rich backgrounds in the finance and technology sectors. Rohan's past experience at Blackstone enlightened him to the demand for alternative asset access, while Dev complements this vision with robust technological expertise garnered from Bank of America.\n\n### Product Offerings\n\n**1. Access Funds**: Aqua handles all operational details, simplifying the investment process for financial advisors.\n   \n**2. Aqua Connect**: This feature enables wealth managers to access a curated selection of top-performing funds, further enhancing their ability to provide bespoke investment options for clients.\n   \n**3. Feeder Funds**: Designed for fund managers, this service aggregates smaller investments, ideal for unlocking a wider investor base without adding administrative burdens.\n\n### Market Position and Validation\n\nAqua has already managed to secure a total investment amounting to $2.45 million, showcasing strong engagement and confidence from its customers. The company is backed by notable investors, emphasizing its credibility and potential in the alternative investment space.\n\n### The Bigger Picture\n\nIn today's investing landscape, diversification is not just smart; it's essential. While professional investors typically allocate about 50% of their assets into alternatives, everyday investors often find themselves limited to a mere 5%. Aqua aims to bridge this gap, ensuring that a wider audience can partake in the substantial returns that alternative investments can provide.\n\n### Closing Thoughts\n\nAqua stands at the intersection of technology and finance, poised to change the way advisors and their clients approach investments. With a strong backing, a deliberate service model, and an accessible platform, they are set to redefine what it means to invest in alternatives. For financial advisors keen on modernizing their investment strategies, Aqua might just be the partner they’ve been looking for.\n\nTo learn more about what Aqua offers and how they can help you or your clients, visit [Aqua's website](https://www.investwithaqua.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/7dd6d9be8f09ae49a76b42df8328ef221f0ee442.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191002Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=b7813d5d42bdef4faf5b13d51bc2fe9ea276bf9e6793d5a863e894c8c8fbadfa",
    "social_links": [
        "https://www.linkedin.com/company/investwithaqua/",
        "https://twitter.com/investwithaqua",
        "https://www.facebook.com/investwithaqua"
    ],
    "logo_path": "data/logos\\Aqua_logo.png"
}