{
    "links": "https://www.ycombinator.com/companies/archbee",
    "name": "Archbee",
    "headline": "Answer user and dev questions with documentation (using Generative AI)",
    "batch": "S21",
    "description": "We help your team build documentation portals. We provide the CMS, publishing and hosting infrastructure. All that's left for you is to focus on the content. Then your users actually get questions answered by LLM tech.",
    "activity_status": "Active",
    "website": "https://www.archbee.com",
    "founded_date": 2019.0,
    "team_size": 10.0,
    "location": "Bucharest, Romania",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:developer-tools; industry:b2b",
    "founders": [
        {
            "name": "Dragos Bulugean, Founder",
            "description": "Software Craftsman",
            "linkedin": "https://www.linkedin.com/in/dragos-bulugean/"
        }
    ],
    "status": true,
    "generated_description": "### Archbee: Innovating Documentation with Generative AI\n\nFounded in 2019 and part of Y Combinator Batch S21, Archbee is a Romanian startup located in Bucharest, putting a fresh spin on how teams handle documentation. Initially aimed at providing a comprehensive content management system (CMS) for documentation portals, Archbee has evolved. Now, it leverages generative AI to not just host documentation but to answer user and developer questions effectively.\n\n**Mission and Offerings**  \nArchbee's mission is straightforward yet ambitious: to answer user inquiries and developer questions through dynamic documentation powered by cutting-edge AI. This platform provides a full-featured environment where teams can build documentation portals without fussing over the technical backend. Users can focus solely on creating valuable content while Archbee handles publication and hosting. The AI component ensures that your users get immediate responses to their queries—an efficient way to bridge the gap between documentation and user support.\n\n### Key Features\nThe platform is built to meet diverse documentation needs—with capabilities for:\n- **User Guides and Developer/API Documentations**: Catering not only to technical teams but also to non-technical users.\n- **Knowledge Bases and Support Documentation**: Ensuring that users and staff have access to essential information at their fingertips.\n- **Customizable Templates and Visuals**: Crafting an engaging user experience using custom blocks, images, videos, and API references.\n\nArchbee emphasizes effortless collaboration between team members with features like:\n- Real-time document editing and review processes.\n- Integration capabilities with various tools like GitHub, Slack, and Zendesk.\n- AI-driven tools to assist with documentation generation and ensure that content remains engaging and relevant.\n\n### Who's It For?\nTargeted primarily at B2B companies and development teams, Archbee is ideal for any organization that needs to streamline their documentation processes. Many businesses have shifted to using Archbee to enhance their support dynamics, training programs, and internal documentation strategies, significantly reducing overheads while increasing efficiency.\n\n**Clients in Numbers**  \nWith over 3,000 organizations already enjoying Archbee's services, it’s clear that teams of all sizes are leveraging this platform to enhance their documentation efforts. Some notable clients include substantial enterprises like Cisco and Adobe.  \n\n### The Team\nArchbee operates with a lean team of just 10 employees, showcasing how strategic focus and smart technology can deliver powerful outcomes without requiring vast resources.\n\n### Conclusion\nArchbee isn’t just another documentation tool; it’s a comprehensive platform that melds state-of-the-art AI technology with user-friendly interface design. If you’re wrestling with documentation challenges, Archbee might just be the intelligent solution to empower your team and address your users' questions in real-time. \n\nFor more information, you can explore their offerings at [archbee.com](https://www.archbee.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/2d1725f2aeea86549ae630e85b28e8afe4496a86.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191002Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=53a28c3e81ea27d3f642faff8de118981ae8a396b92fd7513ef926ce42e46dd5",
    "social_links": [
        "https://www.linkedin.com/company/archbee",
        "https://twitter.com/archbeehq"
    ],
    "logo_path": "data/logos\\Archbee_logo.png"
}