{
    "links": "https://www.ycombinator.com/companies/ariglad",
    "name": "Ariglad",
    "headline": "Knowledge base maintenance on auto-pilot",
    "batch": "W23",
    "description": "Founded in Vancouver, British Columbia, Ariglad The first AI platform that integrates with support channels and release notes to auto-maintain your knowledge base. Ariglad suggests new articles, updates existing ones, detects duplicates, and merges them. Basically, it puts your knowledge base maintenance on auto-pilot.\r\n\nThis is led by Co-Founders Sophie and Ali. They are both completely obsessed with this problem and their customers, who have partnered with Ariglad to become immensely more efficient.",
    "activity_status": "Active",
    "website": "https://www.ariglad.com/",
    "founded_date": null,
    "team_size": 4.0,
    "location": "Vancouver, Canada",
    "group_partner": "Aaron Epstein",
    "group_partner_yc": "https://www.ycombinator.com/people/aaron-epstein",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:ai-enhanced-learning; industry:b2b; industry:customer-success; industry:customer-service; industry:customer-support",
    "founders": [
        {
            "name": "Sophie Wyne, Founder",
            "description": "Worked in a few different industries before falling for tech (such as the US Department of State, Big Pharma, etc.) and worked as a CSM in cybersecurity, primarily with Fortune 1000 CIOs.",
            "linkedin": "https://www.linkedin.com/in/sophie-wyne-0539aaa3/"
        },
        {
            "name": "Ali Avci, Founder",
            "description": "Computer Systems Engineer specializing in Computer Vision then went onto Mobile, Web, and enterprise applications. Developed award-winning biometric camera scanning app, then progressed to HR and healthcare software. Founded Ariglad with minimal funding, implementing enterprise-level security and privacy measures. Successfully scaled the company to $150K Annual Recurring Revenue.",
            "linkedin": "https://www.linkedin.com/in/aiavci"
        }
    ],
    "status": true,
    "generated_description": "### Ariglad: A Game-Changer for Knowledge Base Management\n\n**Company Overview**  \nFounded in Vancouver, British Columbia, Ariglad is the first AI platform designed to integrate seamlessly with support channels and release notes, effectively putting your knowledge base maintenance on auto-pilot. The company is co-founded by Sophie and Ali, both of whom are passionately dedicated to solving knowledge management challenges for their clients. Notably, Ariglad is part of the Y Combinator Batch W23, further underscoring its innovative approach to technology.\n\n**Mission**  \nAriglad’s mission is clear: *Knowledge base maintenance on auto-pilot.* The platform analyzes support tickets and release notes to identify gaps and suggest new articles, ensuring that your knowledge base remains accurate and up-to-date without taxing your team.\n\n**Key Features**  \n- **Automatic Article Suggestions:** Ariglad generates over **30,000 suggestions** for new articles based on customer inquiries, ensuring your content evolves with user needs.\n- **Duplicate Detection and Merging:** The platform identifies and merges duplicate articles, allowing for a cleaner, easier-to-navigate knowledge base.\n- **Comprehensive Gap Analysis:** By reviewing over **500,000 support tickets**, Ariglad pinpoints areas needing enhancement, driving continuous improvement.\n\n**Who It Serves**  \nWhether you're managing a massive knowledge base or starting from scratch, Ariglad has you covered. For large organizations, it keeps content fresh as products evolve. For those without an established system, Ariglad creates a personalized knowledge base from scratch, interpreting customer queries and existing documentation.\n\n**Testimonials and Community Feedback**  \nThe feedback from clients has been overwhelmingly positive. Many users highlight how Ariglad integrates harmoniously with their systems and the minimal supervision required to keep the knowledge base updated, positioning it as a vital tool for efficiency in customer support.\n\n**Team and Location**  \nAriglad operates with a lean team of four in the vibrant tech ecosystem of Vancouver. They are backed by Aaron Epstein as their Group Partner within the prestigious Y Combinator network, further solidifying their innovative credentials.\n\n**Why Choose Ariglad?**\n1. **Time-Saving:** Let AI do the heavy lifting in managing your knowledge base, freeing up your team to focus on more critical tasks.\n2. **Security:** Ariglad's platform is built on compliance with SOC2 and GDPR standards, ensuring your data remains safe.\n3. **100% Satisfaction Guarantee:** They offer a full refund for the first month if your expectations aren't met—though they haven't had to issue one yet.\n\n**Closing Thoughts**\nIn the fast-paced world of customer service, keeping your knowledge base current is non-negotiable. Ariglad not only automates this process but does so with accuracy and finesse, making it an invaluable partner for businesses aiming to enhance operational efficiency.\n\nTo learn more or schedule a demo, visit [Ariglad's website](https://www.ariglad.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/fd1afe72fc5da475a99d06a66097b646aa31c68b.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191003Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=f223e983d40bcf4008bdc6ae1cff620c86de4f8866f1ad24da16bec3d4405cf8",
    "social_links": [
        "https://www.linkedin.com/company/ariglad/?viewAsMember=true",
        "https://twitter.com/arigladapp"
    ],
    "logo_path": "data/logos\\Ariglad_logo.png"
}