{
    "links": "https://www.ycombinator.com/companies/arrow",
    "name": "Arrow",
    "headline": "Modern Checkout Platform for D2C brands in Southeast Asia",
    "batch": "S21",
    "description": "Arrow makes it easier and faster for sellers and shoppers to safely sell and buy online in Southeast Asia. It is  first in Southeast Asia to provide brands a better, more profitable checkout experience for their shoppers. Arrow was created to partner with merchants to build consistent and seamless hyperlocal checkout experiences wherever their shoppers come across their brands. \r\n\nShoppers checkout securely with their preferred payment methods. They no longer have to set up new passwords, face multiple redirects or set up a new account every time they shop. Built specifically for Southeast Asia, Arrow works anywhere that shoppers prefer to shop from. Southeast Asian shoppers love the simple and hassle-free solution since almost everyone in this region shops on their mobile devices.\r\n\nWith Arrow, merchants sell more of what they are selling; and shoppers conveniently and easily checkout wherever they shop.",
    "activity_status": "Active",
    "website": "https://www.arrowcheckout.com/",
    "founded_date": 2020.0,
    "team_size": 18.0,
    "location": "Singapore, Singapore",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:e-commerce",
    "founders": [
        {
            "name": "Liat Beng Neo, Founder",
            "description": "I've been in the Fintech and payments space for the last few years; Previously based in Hong Kong / Shenzhen to build out Tencent's Global Fintech initiatives, launched Grabpay in SEA markets, covered Vietnam during my time at Alipay and was part of the amazing team at helloPay before the acquisition by Ant Financial.",
            "linkedin": "https://www.linkedin.com/in/liatbeng/"
        },
        {
            "name": "Sudhan Raj, Founder",
            "description": "Computer Engineering graduate from NTU, Singapore. Has been actively coding for almost 2 decades across a dozen programming languages. Built Popcorn (#1 Movie Showtime app) together with the founder from scratch and scaled it across 6 countries in SEA. Co-founded Cornflix.TV, an online television network with over 600 channels, and raised 6 figures in investment from 500 Startups.\n\nBelieves in one mantra \"Make technology work for you!\"",
            "linkedin": "https://www.linkedin.com/in/sudhan-raj/"
        },
        {
            "name": "Sebastian Roervig, Founder",
            "description": "Sebastian is from Denmark, but currently living in Singapore. Spend the last +three years at Grab Financial building out its different payment use cases. Worked for for Daraz (Alibaba) in Pakistan looking at e-commerce payments, and before that, living in Philippines and Silicon Valley working for Abra (a crypto currency company).",
            "linkedin": "https://www.linkedin.com/in/sebastianroervig/"
        }
    ],
    "status": true,
    "generated_description": "Arrow is rethinking the checkout experience for direct-to-consumer (D2C) brands in Southeast Asia. Founded in 2020, this innovative startup is based in Singapore and emerged from Y Combinator's S21 batch. With a dedicated team of 18, Arrow is on a mission to streamline online transactions for both sellers and shoppers.\n\nWhat sets Arrow apart? It's the first platform in Southeast Asia designed specifically to enhance the checkout process for brands. By creating a seamless and consistent hyperlocal experience, Arrow allows shoppers to pay securely using their preferred methods without the hassle of creating new accounts or remembering multiple passwords. They’ve designed the platform with the region's mobile shoppers in mind, ensuring that the checkout process is quick and user-friendly, whether customers are buying through social media, websites, or apps.\n\nFor merchants, this means a more profitable and efficient way to process sales, leading to increased conversion rates and customer satisfaction. Arrow is geared toward building partnerships with brands, enhancing their ability to engage with shoppers more effectively, and ultimately driving more sales.\n\nAs a fintech and e-commerce player, Arrow is poised to make a significant impact in a rapidly evolving landscape in Southeast Asia. If you’re interested in learning more about their approach to modernizing checkout experiences, you can visit their website at [arrowcheckout.com](https://www.arrowcheckout.com/).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/f3cfb591a19df8c3a7f3dfa64c29dcc19815b279.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191005Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=9fc9c0ea21a4eef4d3d367661b0670c0523604b8f44a528383f0c1fe1c4ba591",
    "social_links": [
        "https://www.linkedin.com/company/arrowcheckout",
        "https://www.facebook.com/CheckoutwithArrow"
    ],
    "logo_path": "data/logos\\Arrow_logo.png"
}