{
    "links": "https://www.ycombinator.com/companies/artos",
    "name": "Artos",
    "headline": "Turning science into regulatory submissions in minutes, not months.",
    "batch": "W24",
    "description": "Artos is an AI-based document-drafting platform that helps life sciences companies turn their data into regulatory submissions in minutes. These submissions currently take months and are the final hurdle before life sciences companies are allowed to sell their product.",
    "activity_status": "Active",
    "website": "https://www.artosai.com/",
    "founded_date": 2023.0,
    "team_size": 2.0,
    "location": null,
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": null,
    "founders": [
        {
            "name": "Josh Kim, Founder",
            "description": "Josh is co-founder and CEO of Artos. Josh previously led translational AI initiatives at the University of Chicago Medicine, where he developed best-in-class AI tools for use cases ranging from clinical trial endpoint analysis to medical devices for real-time symptom management. Prior to that, Josh worked on commercial and regulatory strategy at several biotech companies. Josh has a degree in Economics from the University of Chicago.",
            "linkedin": "https://linkedin.com/in/joshua-kim-57239519b"
        },
        {
            "name": "Varun Patel, Founder",
            "description": "Varun is a co-founder and CTO at Artos. He studied Molecular Engineering at the University of Chicago and has a Masters in Translational Medicine from UCSF/UC Berkeley. \n\nHe previously worked as a Software Engineer in the healthcare/medtech space, where he developed ML enabled mobile applications for dementia caregivers and improved insurance infrastructure at the largest healthcare company in the world. \n\nIn his free time, you can find him biking, hiking, or climbing something.",
            "linkedin": "https://linkedin.com/in/varun-patel-091715156"
        }
    ],
    "status": true,
    "generated_description": "**Company Overview: Artos**\n\nFounded in 2023, Artos is a pioneering company leveraging AI technology to transform the regulatory submission process for life sciences companies. Positioned within the esteemed Y Combinator Batch W24, Artos aims to drastically reduce the time it takes to create essential regulatory documents from months to mere minutes. \n\n**Mission Statement**\n\nArtos' mission is straightforward yet impactful: **\"Turning science into regulatory submissions in minutes, not months.\"** This vision speaks to the company’s commitment to improving efficiency in a field where every day counts.\n\n**What They Do**\n\nAt its core, Artos offers an AI-based document-drafting platform tailored for the life sciences sector. This platform assists biopharma companies in swiftly converting complex data into regulatory submissions—like INDs (Investigational New Drugs), NDAs (New Drug Applications), and BLAs (Biologics License Applications). By simplifying the document lifecycle, Artos helps organizations bring their products to market faster and at a lower cost. Their end-to-end solution encompasses everything from raw data to polished drafts, eliminating the need for disparate tools and workflows.\n\n**The Team**\n\nThe company, currently located in an undisclosed location, operates with a small but agile team of two dedicated employees. Their compact size allows for nimble decision-making and focused development efforts.\n\n**Key Features and Offerings**\n\nArtos emphasizes features that cater to the unique demands of life sciences documentation. These include:\n\n- **Document Drafting**: AI-driven templates ensure that submissions are not only expedient but also compliant with regulatory standards.\n- **Downstream Visualization**: This allows users to track data and content across all documents seamlessly.\n- **Source Traceability**: Facilitates efficient data syncing across platforms, enhancing collaboration.\n- **Custom Templates** and **Section Regeneration**, allowing teams to streamline and standardize their processes further.\n\nArtos is built for collaboration, understanding that every life sciences team has its own setup and workflow. Consequently, they offer tailored workflows and features designed to meet the distinct needs of various organizations within the industry.\n\n**Community Engagement and Resources**\n\nArtos provides a library of free resources, including eCTD templates and policy research tools. Their goal is to empower not just their users but the wider life sciences community with high-quality, accessible information and tools.\n\n**Conclusion**\n\nArtos stands at the intersection of AI and regulatory documentation, poised to transform how life sciences companies manage their submissions. By cutting down the timelines and improving the overall efficiency of the process, Artos not only helps biopharma companies save time and resources but also accelerates the journey from science to patient. \n\nFor those interested in learning more or experiencing a demonstration, Artos welcomes you to explore their offerings on their [website](https://www.artosai.com/).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/0d359b828d2d7f5be5153c38d644175af29754b3.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191005Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=4ddbcdb47c0b2788e02f1233d5e3c0e5c2aeaec643202826debc687c3525ee43",
    "social_links": [
        "https://www.linkedin.com/company/99344183/admin/feed/posts/"
    ],
    "logo_path": "data/logos\\Artos_logo.png"
}