{
    "links": "https://www.ycombinator.com/companies/ashby",
    "name": "Ashby",
    "headline": "All-in-one recruiting software for high growth companies",
    "batch": "W19",
    "description": "At Ashby, we're improving the productivity of working professionals with intelligent and powerful software. We put a lot of effort into designing products that are approachable to beginners but mastered & extended by power users. In many ways, spreadsheets set the bar here.\r\n\nOur first products provide talent teams with clever automation, powerful analytics tools, and customizable workflows packaged in great UX. We have many paying customers who love us and use us every day like Opendoor, Airtable, Duolingo, and Notion. Notion's Head of Talent said Ashby is \"probably the tool we are in the most and rely on the most, as a recruiting team.\"\r\n\nOur culture is motivated by Abhik's (my co-founder and Head of Engineering) and my belief that a small talented team, given the right environment, can build a great product and service fast (and work regular hours!). We hire exceptional, kind, thoughtful people and provide an environment where we can be happy, feel challenged, and do our best work.\r\n\nWe are well funded and backed by great investors, including Y Combinator, Elad Gil, and Lachy Groom. We'll share more once we meet!",
    "activity_status": "Active",
    "website": "https://www.ashbyhq.com",
    "founded_date": 2018.0,
    "team_size": 110.0,
    "location": "San Francisco",
    "group_partner": "Michael Seibel",
    "group_partner_yc": "https://www.ycombinator.com/people/michael-seibel",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:human-resources; industry:b2b; industry:recruiting; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Benjamin Encz, Founder",
            "description": "Co-Founder & CEO of Ashby. Prior Director of Engineering at PlanGrid.",
            "linkedin": "https://www.linkedin.com/in/benjaminencz"
        },
        {
            "name": "Abhik Pramanik, Founder",
            "description": "Co-Founder & Head of Engineering at Ashby. Prior Senior Product Manager at PlanGrid, Lob. In a previous life, built physics engines at Industrial Light & Magic and Dreamworks Animation.",
            "linkedin": "https://www.linkedin.com/in/abhikpramanik/"
        }
    ],
    "status": true,
    "generated_description": "**Company Overview: Ashby**\n\nFounded in 2018 and based in San Francisco, Ashby is a dynamic player in the recruiting software space, particularly for high-growth companies. Its mission is straightforward but powerful: to provide an all-in-one recruiting platform that enhances productivity for talent acquisition teams.\n\n**The Product**\n\nAt its core, Ashby combines clever automation, robust analytics, and versatile workflows, all wrapped in user-friendly design. It caters to everyone—from startups to large enterprises—ensuring that both beginners and power users can navigate the tools seamlessly. Notable clients like Opendoor, Airtable, Duolingo, and Notion swear by its effectiveness, with Notion's Head of Talent stating it’s their most relied-upon tool for recruitment.\n\nAshby's suite includes features such as Applicant Tracking System (ATS), scheduling tools, CRM capabilities, and advanced analytics. This integration positions Ashby as an ideal solution for companies looking to streamline their hiring processes.\n\n**Company Culture**\n\nAshby’s culture is defined by a belief that small, talented teams can build exceptional products when given the right environment. Co-founders aim to create a workplace filled with exceptional, kind, and thoughtful individuals, fostering happiness and challenge in their roles. It’s clear that Ashby values both the wellbeing of its employees and the quality of its output.\n\n**Funding and Growth**\n\nBacked by prestigious investors including Y Combinator, Elad Gil, and Lachy Groom, Ashby is well-funded and on a trajectory of growth. With a team of 110 employees, they have significant support to continue innovating in the recruitment space.\n\n**Conclusion**\n\nIn essence, Ashby is not just another ATS; it’s a comprehensive tool tailored to meet the needs of modern hiring teams. It aims to disrupt the status quo, making hiring faster, fairer, and more efficient. If you’re part of a team looking to improve your recruitment process and leverage cutting-edge technology, Ashby could be exactly what you need.\n\nFor more information, check out their website [here](https://www.ashbyhq.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/77239082dd6ac0e4a734cb059463633e7045ff1f.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191006Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=0020c88319580b5c488e647029f82ef5c5023238f4a5680864aa6cdbf6efcd0f",
    "social_links": [
        "https://www.linkedin.com/company/ashbyhq/",
        "https://twitter.com/ashbyhq",
        "https://github.com/ashbyhq"
    ],
    "logo_path": "data/logos\\Ashby_logo.png"
}