{
    "links": "https://www.ycombinator.com/companies/asher-bio",
    "name": "Asher Bio",
    "headline": "We build better immunotherapies",
    "batch": "S19",
    "description": "Asher Bio is a biotechnology company developing precisely targeted immunotherapies for cancer and other diseases. Our cis-targeting platform aims to enable selective activation of specific immune cell types, addressing the inherent limitations of otherwise pleiotropic immunotherapies that act on multiple cell types. Our approach has the potential to precisely direct different immune mediators against a range of target immune cell-types and create best-in-class immunotherapies in cancer, autoimmune and infectious diseases. \r\n\nAsher Bio is backed by Third Rock Ventures and is located in South San Francisco.",
    "activity_status": "Active",
    "website": "https://www.asherbio.com/",
    "founded_date": null,
    "team_size": 3.0,
    "location": "San Carlos, CA",
    "group_partner": "Jared Friedman",
    "group_partner_yc": "https://www.ycombinator.com/people/jared-friedman",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:biotech",
    "founders": [],
    "status": true,
    "generated_description": "Asher Bio is a cutting-edge biotechnology company based in South San Francisco, dedicated to revolutionizing the field of immunotherapy. Their mission? To build better immunotherapies that precisely target immune responses, particularly in cancer and other diseases. What sets Asher Bio apart is its innovative cis-targeting platform designed to selectively activate specific immune cell types. This method addresses the limitations of traditional immunotherapies that often act on multiple cell types, leading to inefficient treatments and unwanted side effects.\n\nFounded as part of Y Combinator's Batch S19, Asher Bio has a lean but effective team based in San Carlos, California. The company is backed by Third Rock Ventures, which signifies strong investor confidence in its potential. At its core, Asher Bio believes that every therapeutic innovation should prioritize patient well-being by maximizing efficacy while minimizing toxicity.\n\nTheir flagship product is etakafusp alfa, a cis-targeted IL-2 that has shown promising initial results in its clinical trials, selectively activating CD8+ effector T cells for powerful anti-tumor responses. Asher Bio is on the cutting edge, not just in its research and product pipeline—which includes potential treatments for various cancers and autoimmune diseases—but also in how it approaches the entire landscape of immunotherapy.\n\nFor those interested in joining a team that is determined to redefine immunotherapy, Asher Bio is hiring. With a strong commitment to progress, they're actively seeking individuals who share their vision of impactful medicine.\n\nTo dive deeper into their work and explore career opportunities, check out their [website](https://www.asherbio.com/) or follow their news updates. Asher Bio is truly carving out a new path in the realm of immunotherapy, making significant strides for patients worldwide.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/1aa364ec4cbe60db60f958bd044dd9194f1661da.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191006Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=c991a142393e406b1380273c9c0e0203692bc3e05313f52c89feefaf72d62b2f",
    "social_links": [
        "https://www.linkedin.com/company/asher-biotherapeutics/",
        "https://twitter.com/AsherBio"
    ],
    "logo_path": "data/logos\\Asher_Bio_logo.png"
}