{
    "links": "https://www.ycombinator.com/companies/asklio",
    "name": "askLio",
    "headline": "AI-Copilot for procurement teams at large enterprises",
    "batch": "S23",
    "description": "askLio builds AI Copilots to help procurement teams at enterprises.\r\n\nWhen an employee wants to procure something, the process used to take weeks. askLio turns it into hours. \r\nThe company is founded by AI engineers and procurement experts that have built an AI Startup together before. \r\n\nThink of Lio as an additional assistant for every procurement manager - saving enterprises on average millions per year and reducing manual work of procurement managers by 80%.\r\n\nSome of the most renowned companies in the world are already using our AI-Copilot.",
    "activity_status": "Active",
    "website": "https://www.asklio.ai",
    "founded_date": 2023.0,
    "team_size": 3.0,
    "location": "San Francisco",
    "group_partner": "Tom Blomfield",
    "group_partner_yc": "https://www.ycombinator.com/people/tom-blomfield",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:generative-ai; industry:b2b; industry:procurement; industry:enterprise-software; industry:ai; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Vladi Keil, Founder",
            "description": "Vladi is the co-founder and CEO of askLio (S23).\n\nHe had a profitable startup by the age of 22. Vladi also co-founded the AI startup \"Gabriel\" back in 2021, that ended up partnering with the German FBI. In his last position he consulted enterprises on procurement.\n\nHe's now on a mission to make procurement managers superhuman.",
            "linkedin": "https://de.linkedin.com/in/vladimir-keil"
        },
        {
            "name": "Lukas Heinzmann, Founder",
            "description": "Lukas is an AI Engineer with a Master's from TUM in AI/ML. He joined as one of the first employees of a startup acquired by Audi to bring AI/ML into mobile Apps. As the technical lead for the myAudi app, he tripled its user base and improved its star rating. Following his entrepreneurial he left this job. He co-founded Gabriel AI to prevent telephone fraud using advanced AI algorithms and is now starting his second venture \"askLio\".",
            "linkedin": "https://linkedin.com/in/lukas-heinzmann-b96434102"
        },
        {
            "name": "Till Wagner, Founder",
            "description": "Till is co-founder and COO of askLio. Gained experiences in web & app design and product-building at various based AI-startups, one based in SF. Operational & analytic experiences from projects at Deloitte's biggest German client. Academic excellence: Best in class Bachelor, Master, Scholarships. While working at SAP he failed with buying equipment for his successor with their software, which inspired him to create solutions that people can actually comprehend.",
            "linkedin": "https://linkedin.com/in/till-wagner-182ab119a"
        }
    ],
    "status": true,
    "generated_description": "### Company Summary: askLio\n\n**Overview**:  \naskLio is an innovative startup founded in 2023, located in San Francisco and currently part of Y Combinator's Batch S23. The company's mission is to revolutionize procurement processes within large enterprises by providing an AI-Copilot specifically for procurement teams. This tool dramatically reduces procurement cycle times from weeks to mere hours, enabling significant savings and efficiency gains across the board.\n\n**Team and Expertise**:  \nThe founding team is composed of AI engineers and procurement experts with prior experience in building AI startups. With a lean structure of just three employees, this startup is agile and focused, driving change in a traditionally cumbersome area.\n\n**How It Works**:  \naskLio's AI assists procurement managers by automating routine tasks, thereby cutting down manual workload by up to 80%. In practice, this means procurement requests that typically consume considerable time can now be processed quickly and efficiently, allowing teams to focus on strategic decision-making. The AI operates independently to handle orders, answer employee inquiries, and direct them to the appropriate procurement channels.\n\n**Market Presence**:  \naskLio has already gained traction among reputable enterprises, with notable endorsements stating that it saves companies millions annually. The platform supports around 175 languages and is available 24/7, making it an invaluable resource for global companies.\n\n**Integration and Security**:  \naskLio seamlessly integrates into existing procurement systems, working transparently alongside platforms like SAP and Microsoft Teams. Data security is paramount, with all operations compliant with GDPR and hosted on certified European servers.\n\n**Recognition and Awards**:  \nThe company has already garnered recognition in the industry, winning the BME Procurement Excellence Award in 2024 and being highlighted among Germany’s most innovative procurement startups.\n\n**Conclusion**:  \nIf your organization is looking to streamline procurement processes, save costs, and utilize AI efficiently, askLio is worth a look. This tech-savvy pilot project has the potential to change how procurement is managed, transforming it into a more strategic function rather than a transactional one.\n\nFor more information, visit their website at [askLio.ai](https://www.asklio.ai).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/12db4b3e06490b02d97bd66f1535ec39310d9229.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191006Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=63dadda7bc190663ce6d620d07cd7b6763f91eeb62511f561600bffc1239a302",
    "social_links": [
        "https://www.linkedin.com/company/lio-ai/",
        "https://www.crunchbase.com/organization/ask-lio-ai"
    ],
    "logo_path": "data/logos\\askLio_logo.png"
}