{
    "links": "https://www.ycombinator.com/companies/assembly-hoa",
    "name": "Assembly HOA",
    "headline": "AI-enabled HOA Management Company",
    "batch": "S24",
    "description": "We help HOAs manage their communities in a modern and transparent way. HOA boards choose Assembly to replace their existing management company, ensuring excellent service and clear visibility into their HOA’s finances and operations. With Assembly, community priorities are always addressed, and homeowners can easily understand what their HOA is doing and how their monthly dues are being used.\r\n\nOur mission is to create turnkey communities and protect property values through transparent, efficient, and proactive management. By combining top industry expertise with the latest in AI and fintech, we provide real-time financial insights, strategic community planning, and automated operations.\r\n\nLike many homeowners, Shreyas and Allen experienced frustrations with HOAs. Our investigation revealed that most HOA management companies are outdated mom-and-pop operations nearing retirement, resistant to adopting new technology. Furthermore, these companies often prioritize relationships with vendors and banks over the interests of the communities they serve, leading to misaligned incentives. Realizing this, we knew that to achieve our mission of fixing HOAs, Assembly HOA had to be vertically integrated.\r\n\nWe are live with over 39 communities in Greater Los Angeles and SF Bay Area.",
    "activity_status": "Active",
    "website": "https://assemblyhoa.com",
    "founded_date": 2022.0,
    "team_size": 6.0,
    "location": "Los Angeles, CA",
    "group_partner": "Brad Flora",
    "group_partner_yc": "https://www.ycombinator.com/people/brad-flora",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:artificial-intelligence; industry:fintech; industry:real-estate; industry:housing; industry:proptech; location:los-angeles",
    "founders": [
        {
            "name": "Allen Liou, Founder",
            "description": "Allen has a background in real estate and startups. He worked as a real estate agent for several years, managing client relationships and transactions. In startups, he specialized in customer success and implementation, focusing on improving client experiences and efficiency.\n\nGrowing up in a townhome community, Allen has firsthand insight into HOA governance challenges and opportunities. This perspective, combined with his expertise, drives his passion for creating innovative HOA management.",
            "linkedin": "https://linkedin.com/in/allenliou1"
        },
        {
            "name": "Shreyas Bharadwaj, Founder",
            "description": "Shreyas has a strong background in AI/ML, having worked as a data scientist at startups and most recently at the RAND Corporation, where he developed experimental ML products for the DoD.\n\nHis journey with HOAs began with his own condo ownership, where encountering massive inefficiencies in community operations led him to join the HOA board. At Assembly, Shreyas leverages his technical expertise and passion for safeguarding homeowners' investments to build the next-generation of HOA management.",
            "linkedin": "https://linkedin.com/in/shreyas-b-732b11252"
        }
    ],
    "status": true,
    "generated_description": "**Assembly HOA: Modern Management for Communities**\n\nFounded in 2022 and part of the Y Combinator Batch S24, Assembly HOA is poised to redefine how homeowners associations (HOAs) are managed. Located in Los Angeles, CA, with a lean team of six, the company merges artificial intelligence with fintech to create a transparent and efficient management model for communities.\n\n**Mission and Approach**\n\nAssembly HOA's mission is clear: to enhance property values and foster vibrant community living through efficient, proactive management. They aim to replace the outdated \"mom-and-pop\" HOA management firms, which often resist new technologies and prioritize vendor relationships over community needs. This transition not only aims to provide excellent service but also to ensure that homeowners gain visibility into their HOA's operations and financials.\n\nBy leveraging AI, Assembly HOA offers real-time financial insights and streamlined community planning, ensuring that each dollar of homeowners' dues is used effectively. The company’s approach is both data-driven and community-centric, empowering boards and homeowners alike to address issues transparently.\n\n**Current Footprint**\n\nToday, Assembly HOA has successfully launched its services in over 39 communities across Greater Los Angeles and the San Francisco Bay Area. This operational footprint underscores their commitment to modernizing HOA management and highlights their growth potential in a market ripe for innovation.\n\n**Vision for the Future**\n\nThe founders, Shreyas and Allen, deeply understand the common frustrations homeowners face with traditional HOA management. With their vertical integration strategy, they aim to fix these inefficiencies, making communities run more smoothly while keeping the needs of residents at the forefront.\n\nTheir innovative work in the intersection of artificial intelligence, fintech, and real estate highlights Assembly HOA’s potential to revolutionize the HOA landscape. Homeowners looking for a more modern and accountable approach to community management might just find their answer with Assembly.\n\nFor more information or to explore their services, you can visit their website at [assemblyhoa.com](https://assemblyhoa.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/a83f4355b8d6fafda11bf3b541a40c0d5d3210fa.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191007Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=df478d2fc9e8ca51ac58323b6c7da282b8414bdfe21c7509766bc8b597b57629",
    "social_links": [
        "https://www.linkedin.com/company/assemblyhoa/",
        "https://twitter.com/AssemblyHOA",
        "https://www.facebook.com/people/Assembly-HOA-Management/100090034425034/",
        "https://www.crunchbase.com/organization/assembly-ad9b"
    ],
    "logo_path": "data/logos\\Assembly_HOA_logo.png"
}