{
    "links": "https://www.ycombinator.com/companies/assembly",
    "name": "Assembly",
    "headline": "Advanced manufacturing and distribution solutions (for China-basedâ\u0080¦",
    "batch": "S15",
    "description": "Crowdfunding has fueled an increase in innovative product companies turning to Chinese factories for production.\r\n\nYet, Chinese factories seem undifferentiated because they all make the same, unverifiable claims of excellence. \r\n\nThis results in competition centered on price. Factories are forced to under-bid contracts to win business, but often, they later surprise the customer with quality problems and delays.\r\n\nThis process is broken. We install cameras and remote monitoring software on the assembly line, and this ensures compliance with test protocol, improves quality, reduces liability, and helps fight warranty fraud.\r\n\nWe charge a nominal per-unit fee to the OEM and revenue share with the factory when they demonstrate compliance with quality standards (whether units pass or fail).\r\n\nIt encourages better behavior from factories and rewards those who perform with an audit trail of good performance that helps them win new foreign business.\r\n\nOn average, defect rate will fall 75% within 5 months of deploying Assembly at a factory.",
    "activity_status": "Active",
    "website": "https://asm.co/",
    "founded_date": 2014.0,
    "team_size": 12.0,
    "location": "Redwood City, CA",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:logistics; industry:manufacturing; industry:china; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Jonathan Friedman, Founder/CEO",
            "description": "Ph.D. in electrical engineering with a background in biomedical and industrial systems engineering. 2x YC Founder. Lives part time in China. Happy to help with supply chain, manufacturing, distribution, or design problems. If you move/sell physical products, I can probably find you more margin or more market share. Free consults for founders. Don't be afraid to ask. We'll learn new things together! Cheers.",
            "linkedin": "https://linkedin.com/in/friedparts"
        }
    ],
    "status": true,
    "generated_description": "Assembly is a forward-thinking company based in Redwood City, California, founded in 2014 as part of the Y Combinator Batch S15. They specialize in advanced manufacturing and distribution solutions, particularly focusing on transforming how product companies leverage Chinese factories for production. \n\nThe problem in this sector is pretty straightforward: many Chinese factories make lofty claims about excellence, yet the reality is that they often undercut prices to snag contracts. This race to the bottom leads to quality issues and unexpected delays, which is frustrating for everyone involved. Assembly tackles this broken system head-on by equipping factories with cameras and remote monitoring software. This technology ensures compliance with quality standards, reduces liability, and even combats warranty fraud.\n\nTheir business model is innovative and aligned with better factory practices. They charge a nominal per-unit fee to original equipment manufacturers (OEMs) and share revenue with factories that can prove their compliance with established quality metrics. Essentially, they’re incentivizing good behavior and creating a clear audit trail that helps these factories attract more foreign business.\n\nOne impressive statistic—defect rates typically drop by 75% within just five months after Assembly implements its systems. That’s transformative.\n\nAssembly doesn't just stop at monitoring; they provide a range of services. Their model includes helping businesses source, verify, inspect, and optimize their supply chains while managing factories more efficiently with tech. They even offer warehousing and shipping solutions to ensure products safely reach consumers—decreasing returns and costs.\n\nOn top of this, when the COVID-19 pandemic hit, Assembly stepped up by supplying personal protective equipment (PPE), showcasing their adaptability and commitment to public health.\n\nWith a small but efficient team of 12, led by their Group Partner, Nan, Assembly is making waves in logistics and manufacturing across the San Francisco Bay Area and beyond. Their focus on quality and compliance could very well redefine how we think about manufacturing in China—and that’s exciting.\n\nIf you're interested, check out their website at [asm.co](https://asm.co/) or give them a call at 888.610.7809.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/7359891c954f5c184416ae51a510ae1b774e4030.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191008Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=8e684d4794de74dfd3626c8eb292469086204923ed02ade8c9317f2d697848b8",
    "social_links": [
        "https://www.linkedin.com/company/assembly-inc./about/",
        "https://twitter.com/assembly_inc",
        "https://github.com/asm-co"
    ],
    "logo_path": "data/logos\\Assembly_logo.png"
}