{
    "links": "https://www.ycombinator.com/companies/astek-diagnostics-inc",
    "name": "Astek Diagnostics",
    "headline": "One-hour antibiotic sensitivity testing",
    "batch": "S21",
    "description": "Astek Diagnostics is building a platform (Eugris) that guides physicians in prescribing appropriate antibiotics for patients with bacterial sepsis in one hour. It is done by detecting the oxygen consumption of the bacteria",
    "activity_status": "Active",
    "website": "http://astekdx.com",
    "founded_date": 2020.0,
    "team_size": 5.0,
    "location": "Baltimore, MD",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:microfluidics; industry:medical-devices",
    "founders": [
        {
            "name": "Mustafa Al-Adhami, Founder",
            "description": "Mustafa Al-Adhami Ph.D., CEO, Astek Diagnostics. He has long experience in customer discovery and diagnostics. He envisioned the technology behind Eugris while completing his PhD. As a doctoral student, he won the national Three Minute Thesis (3mt) competition, Baylor Business Plan, elevator pitch competition, and VentureWell’s BMEidea competition. Mustafa has raised over $5M for Astek to date to revolutionize antibiotic prescription.",
            "linkedin": null
        }
    ],
    "status": true,
    "generated_description": "Astek Diagnostics is an innovative health tech company established in 2020, based in Baltimore, Maryland. It's a fresh participant in the Y Combinator Batch S21 — so you know they’re not your average startup. With a tight-knit team of five, they're laser-focused on revolutionizing how we diagnose and treat bacterial infections, especially urinary tract infections (UTIs) which often lead to severe complications, including sepsis.\n\nTheir flagship product, the JIDDU system, provides a one-hour antibiotic sensitivity test, a massive improvement over traditional testing methods that can take days. The technology behind this system tracks oxygen consumption of bacteria, allowing healthcare providers to pinpoint effective treatment options almost instantly. This is not just a convenience but a potentially life-saving breakthrough—25% of sepsis cases stem from UTIs, and women are affected far more frequently than men.\n\nAstek's mission revolves around \"better diagnostics, better treatment.\" The goal is clear: save lives by removing the guesswork from antibiotic prescribing. They’ve partnered with esteemed healthcare institutions, including The University of Maryland Medical Center and MedStar Health, to ensure that they’re grounding their technology in real-world clinical needs. The potential for their platform extends beyond UTIs; Astek envisions a universal diagnostic system that could analyze other sample types like blood and cerebrospinal fluid.\n\nWhat’s even more interesting is the personal story behind the company’s inception. CEO Mustafa Al Adhami was inspired to start Astek after witnessing his grandfather suffer through a prolonged misdiagnosis of a UTI. This wasn’t just a business venture for him; it was about addressing a clear and urgent need in healthcare.\n\nWith a strong footing in critical medical tech domains like microfluidics and medical devices, Astek Diagnostics is not just participating in the healthcare conversation. They are leading it, pushing for precision diagnostics that can reduce unnecessary treatments, lower healthcare costs, and ultimately mitigate the global threat of antimicrobial resistance. Expect to hear more from them as they gear up for a market entry in 2025.\n\nFor more information, or if you want to see how they’re changing the game in antibiotic treatment, check out their website at [astekdx.com](http://astekdx.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/f5ffaa0c8996d02fb2884d3c5d73c614d91f5ff8.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191007Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=0d405e1ed18071a6651720e0c9f7924cfa44e1054c3264f0ddb5685a4df98d30",
    "social_links": [],
    "logo_path": "data/logos\\Astek_Diagnostics_logo.png"
}