{
    "links": "https://www.ycombinator.com/companies/astroforge",
    "name": "AstroForge",
    "headline": "We Mine Asteroids",
    "batch": "W22",
    "description": "AstroForge is an asteroid mining company. Instead of bringing back the entire asteroid, we break it up, refine, and return only what’s valuable.",
    "activity_status": "Active",
    "website": "https://www.astroforge.io/",
    "founded_date": 2021.0,
    "team_size": 10.0,
    "location": "Huntington Beach, CA",
    "group_partner": "Garry Tan",
    "group_partner_yc": "https://www.ycombinator.com/people/garry-tan",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:hard-tech; industry:robotics; industry:space-exploration; industry:satellites",
    "founders": [
        {
            "name": "Matt Gialich, Founder/CEO",
            "description": "Matt is an experienced engineering leader with over a decade of leading high-performing engineering teams. At Virgin Orbit, he was responsible for building and hiring all aspects of Avionics and led the flight software and GNC teams during his tenure. After Virgin, he joined Bird scooters as their Director of Vehicle Software and led that team through the development of the Bird 2 and 3 vehicles.",
            "linkedin": "https://www.linkedin.com/in/matthew-gialich/"
        }
    ],
    "status": true,
    "generated_description": "### About AstroForge\n\n**Company Overview**: \nAstroForge is an ambitious startup that took flight in 2021, proudly part of Y Combinator’s Batch W22. Based in Huntington Beach, CA, this ten-person team is dedicated to a singular, audacious mission: we mine asteroids. They’ve recognized that the jewels of the cosmos hold immense potential for extracting precious metals while minimizing the environmental costs of traditional mining practices.\n\n**Mission and Vision**:\nThe core mission of AstroForge is concise yet profound: to extract valuable minerals from asteroids, specifically Platinum Group Metals (PGMs), in a cost-effective manner that leaves no carbon footprint on Earth. Current terrestrial mining operations are destructive, consuming vast swathes of land and producing toxic waste. In contrast, AstroForge’s asteroid mining approach promises a cleaner, greener solution—less impact on our planet, and more resources to fuel technological advancements.\n\n**Current Projects**:\nAstroForge's second mission, aptly named \"Odin,\" is scheduled to launch within this year aboard Intuitive Machines’ IM-2 lunar mission. Odin will gather crucial imagery of its target asteroid, paving the way for the subsequent mission, \"Vestri,\" which will land on the asteroid and commence extraction operations.\n\n**Key Technologies**: \nAstroForge operates at the intersection of hard tech, robotics, and space exploration. They aim to innovate and refine processes that break down celestial bodies to harvest only the valuable components, a clever pivot from attempting to haul back entire asteroids.\n\n**The Team and Support**:\nUnder the guidance of Group Partner Garry Tan, the small but agile team at AstroForge is prepared for the challenges of space resources. They are backed by notable investors and have grown into a tight-knit organization passionate about reshaping mining for a sustainable future.\n\n**In Summary**:\nAstroForge is more than just a company—it represents a monumental leap towards harnessing outer space resources for the betterment of Earth. With their innovative model and dedicated team, they’re positioned not just to transform industries on the ground but to set the stage for a new era of interplanetary resource management.\n\nFor more on their mission, updates, or to join their journey, visit [AstroForge's website](https://www.astroforge.io/).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/957a77c34a860c3310ed77a3f213f43e29407fe3.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191008Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=21a09ecd3a1877d696feeafce0a7fdd9f53310d18506c7a082b5b495ecf69b92",
    "social_links": [],
    "logo_path": "data/logos\\AstroForge_logo.png"
}