{
    "links": "https://www.ycombinator.com/companies/astranis",
    "name": "Astranis",
    "headline": "Advanced satellites for high orbits.",
    "batch": "W16",
    "description": "Astranis builds the world's most advanced satellites for high orbits. Their first product, MicroGEO, offers dedicated satellite broadband. But small, radiation-tolerant satellites can do far more than comms. With contracts in place with Space Force, NASA, and other government partners, Astranis is working across all higher orbits to support government science, PNT, and communications missions.",
    "activity_status": "Active",
    "website": "http://www.astranis.com",
    "founded_date": null,
    "team_size": 400.0,
    "location": "San Francisco",
    "group_partner": "Jared Friedman",
    "group_partner_yc": "https://www.ycombinator.com/people/jared-friedman",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:space-exploration; industry:satellites; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "John Gedmark, Founder/CEO",
            "description": "Cofounder & CEO, Astranis",
            "linkedin": "https://www.linkedin.com/in/johngedmark"
        },
        {
            "name": "Ryan McLinko, Founder/CTO",
            "description": "Cofounder & CTO of Astranis",
            "linkedin": "https://www.linkedin.com/in/mclinkor"
        }
    ],
    "status": true,
    "generated_description": "**Astranis: Building the Future of High-Orbit Satellites**\n\nIn the realm of space technology, Astranis is making waves by redefining what’s possible with satellites. Founded in 2016 and part of Y Combinator's W16 program, this San Francisco-based company has a mission: to develop advanced satellites for high orbits. Their debut product, MicroGEO, is a game-changer, providing dedicated satellite broadband that goes beyond simple communication.\n\n**What Sets Astranis Apart?**\n\nAstranis stands out by creating small, radiation-tolerant satellites designed for high orbits, representing a crucial middle ground between traditional large satellites (which are costly and complex) and smaller, ephemeral options intended mainly for low Earth orbit. This innovative approach allows them to tap into more than $1 billion in satellite services already contracted with a range of clients, including the Space Force and NASA. \n\nTheir satellites aren’t just about communications; they support pivotal government missions in science, positioning, navigation, and timing (PNT). In an age where GPS is critical for both personal and military uses, Astranis is ensuring that these vital services remain resilient even in challenging circumstances.\n\n**The Astranis Team and Operations**\n\nWith a workforce of around 400 passionate employees, Astranis has positioned itself as a leader in the space industry. Located at Historic Pier 70 in California, their facility is steeped in history, previously manufacturing warships, now transformed into a hub for building advanced spacecraft.\n\n**Facing Challenges Head-On**\n\nBuilding satellites for high orbits isn't without its hurdles. The radiation environment at these altitudes can damage conventional hardware in mere hours. However, Astranis has managed to overcome these engineering challenges, resulting in the creation of spacecraft that many deemed impossible until now.\n\nThe company prioritizes in-house testing, manufacturing, and machining to maintain tight controls over quality and innovation. This hands-on approach ensures that every satellite built meets the rigorous demands of space.\n\n**Looking to the Future**\n\nAstranis isn't just sitting on its initial success. With a slew of upcoming launches and partnerships, they are poised to expand their reach. Their vision is ambitious and aligns with a growing need for more efficient, reliable satellite services in a space where high orbits are increasingly viewed as the \"ultimate high ground.\"\n\nIn summary, Astranis exemplifies what it means to pioneer in the aerospace sector. By focusing on high-orbit satellites, they are not only meeting critical communication and navigation needs but are also setting the stage for future advancements in space technology. The sky isn’t the limit; it’s just the beginning for Astranis.\n\nIf you want to learn more or join their journey, check them out at [Astranis](http://www.astranis.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/93399dab68d217ac5b9441b15ee765674eced13b.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191007Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=c63bd29f4755c66105ce0716ec8ab30e242b93e403c2a6365d8cf5a4f38e04b3",
    "social_links": [
        "https://www.linkedin.com/company/astranis/",
        "https://twitter.com/Astranis",
        "https://www.crunchbase.com/organization/astranis"
    ],
    "logo_path": "data/logos\\Astranis_logo.png"
}