{
    "links": "https://www.ycombinator.com/companies/athelas",
    "name": "Athelas",
    "headline": "Digital tools for healthcare providers",
    "batch": "S16",
    "description": "At Athelas, we're bringing simple, life-changing health care products to people around the globe.\r\n\nThe future of healthcare is at the home - we are a team of technologists building the next generation of medical products at the intersection of hardware and software. We won’t stop until we’ve brought the world class tools of a hospital to your home. \r\n\nAthelas Remote Patient Monitoring (RPM) allows healthcare providers to monitor patient vitals like blood pressure, weight, and blood glucose without the patient ever having to enter a clinic, improving patient health and engagement, and reducing hospitalizations. We do this all through a beautifully integrated suite of devices and software tools that provides access to state-of-the-art technologies and groundbreaking AI powered analysis.",
    "activity_status": "Active",
    "website": "http://athelas.com",
    "founded_date": 2016.0,
    "team_size": 160.0,
    "location": "Mountain View",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:health-tech; industry:medical-devices; industry:biotech; industry:healthcare; location:san-francisco-bay-area",
    "founders": [],
    "status": true,
    "generated_description": "Athelas is a healthcare technology company founded in 2016, part of Y Combinator’s S16 batch, and headquartered in Mountain View, California. With a team of 160 dedicated professionals, Athelas is on a mission to revolutionize the healthcare experience by bringing hospital-grade medical tools directly into patients' homes. They believe that the future of healthcare lies in remote, home-based care, a vision they are actively pursuing with cutting-edge technology at the intersection of hardware and software.\n\nTheir primary product, Athelas Remote Patient Monitoring (RPM), enables healthcare providers to track essential patient vitals—like blood pressure, weight, and blood glucose levels—remotely, negating the need for frequent clinic visits. This not only improves patient health outcomes but also boosts engagement and minimizes hospitalizations. Athelas achieves this through an elegantly integrated suite of devices and software tools, leveraging advanced AI for real-time analysis and insights.\n\nIn addition to RPM, Athelas is carving out a niche in Revenue Cycle Management (RCM) and Ambient AI, foreseeing a healthcare landscape where administrative tasks are simplified through intelligent automation. Their RCM platform aims to optimize financial workflows for healthcare organizations, while Ambient AI serves as an advanced transcription service, allowing medical providers to focus more on patient interactions rather than on documentation.\n\nAthelas is positioned within the health-tech, medical devices, and biotech spaces, and their strategic partnerships, such as with HCA Healthcare, aim to extend their offerings further into the healthcare ecosystem. Their customer testimonials speak volumes about the efficiency and effectiveness of their solutions, with users highlighting the substantial impact on patient care and administrative burdens.\n\nIf you’re in the healthcare sector looking to enhance care delivery and operational efficiency, Athelas is worth exploring further. You can learn more about their offerings on their website: [Athelas.com](http://athelas.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/f0477a37ef05d83d7f2a5b09e70da9963e3f1499.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191008Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=55ba1d92228702b63736b9e37e4ba2ed6907bec842760cc2596df0e537320f09",
    "social_links": [
        "https://www.linkedin.com/company/athelas/",
        "https://www.crunchbase.com/organization/athelas",
        "https://github.com/getathelas"
    ],
    "logo_path": "data/logos\\Athelas_logo.png"
}