{
    "links": "https://www.ycombinator.com/companies/atlas",
    "name": "Atlas",
    "headline": "Operating system for restaurants, focusing on Southeast Asia",
    "batch": "S21",
    "description": "Atlas is building the operating system for restaurants. Atlas is the easiest way to start, run and grow any restaurant online and offline. We are the team that previously built Grain, a venture-backed online restaurant, to millions in revenue. Team and investors are from Grain, Accenture, Microsoft, Udacity, McKinsey, Salesforce, Y Combinator and others. https://atlas.kitchen",
    "activity_status": "Active",
    "website": "https://atlas.kitchen",
    "founded_date": 2021.0,
    "team_size": 11.0,
    "location": "Singapore, Singapore",
    "group_partner": "Gustaf Alstromer",
    "group_partner_yc": "https://www.ycombinator.com/people/gustaf-alstromer",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:restaurant-tech",
    "founders": [
        {
            "name": "Yi Sung (Sung) Yong, Founder",
            "description": "Co-creator of Grain and Atlas. When I was young, my aspiration was to be a clown with a medical degree. Currently distracted by my obsession to build great products that can change people’s lives for the better.",
            "linkedin": "https://www.linkedin.com/in/yongyisung/"
        },
        {
            "name": "Shawn Liam, Founder",
            "description": "Co-founder of Atlas. Lives and breathes in the intersection of tech and design. Oversees the product strategy and direction at Atlas. In a previous life led UX and Design at Malaysian satellite TV and content conglomerate Astro. Mexican cuisine lover, beer nerd,  loves adventure, rock climbing and the outdoors.",
            "linkedin": "https://www.linkedin.com/in/shawnliam/"
        },
        {
            "name": "Ernest Sim, Founder",
            "description": "Co-founder of Atlas. Also the co-founder of Grain, a venture-backed (Series B) online restaurant in Singapore. I'm passionate about F&B tech and believe that the future of food is inevitable, and it will come whether we like it or not. The real question is, will we watch it happen? Or make it happen?\n\nIn my free time, I love to sing and play music. I am creative by heart, and I have a knack for figuring computers out. I enjoy brainstorming and ideation.",
            "linkedin": "https://www.linkedin.com/in/ernestsim/"
        }
    ],
    "status": true,
    "generated_description": "Atlas is a Singapore-based company founded in 2021, part of Y Combinator Batch S21, that has set out to revolutionize the restaurant industry in Southeast Asia with its integrated operating system. Its mission is straightforward: to be the easiest way to start, run, and grow any restaurant, whether online or offline.\n\nThe brains behind Atlas come with serious credentials—they previously built Grain, a successful online restaurant that saw millions in revenue. This experience has equipped them with the insights to tackle the challenges restaurants face today, especially in a fast-evolving market that increasingly relies on digital solutions. The team boasts backgrounds from major players like Accenture, Microsoft, McKinsey, and Salesforce, which adds layers of depth to their expertise.\n\nAt its core, Atlas’ tech simplifies multiple restaurant operations—serving as a unified platform where restaurant owners can manage online storefronts, point-of-sale systems, third-party logistics, menu syncs, and customer insights, all while leveraging AI to enhance services. Their offerings are designed to streamline processes across multiple channels, ensuring that restaurants can effectively cater to their customers regardless of the delivery mechanism—be it dine-in, takeout, or third-party delivery platforms like Grab and Deliveroo.\n\nFor those restaurants just getting started, Atlas offers a basic package starting at $79/month with no hidden fees or long-term contracts. This allows restaurant operators to focus on what they do best—serve great food—while Atlas handles the heavy lifting in terms of technology. \n\nCurrently, Atlas has a lean team of 11 individuals, but they're making waves by delighting hundreds of restaurants across sunny Singapore. Their growth suggests not just strong demand but also validation of their product's effectiveness in navigating the complex landscape of restaurant management. They also offer a noteworthy, risk-free incentive: a 100-day money-back guarantee for users who aren’t satisfied with their systems.\n\nIn summary, if you're looking for a robust operating system tailored for the modern restaurant environment, look no further than Atlas. They are committed to helping restaurateurs not just survive, but thrive amidst the changing tides of the F&B industry. For more information, check out their website at [atlas.kitchen](https://atlas.kitchen).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/71c7202c757d2f81d1853365f219e6c74be17043.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191008Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=c8716c85dc80998b533b7a385f2088e156dfae990c6d9f7902d468ddc149515c",
    "social_links": [],
    "logo_path": "data/logos\\Atlas_logo.png"
}