{
    "links": "https://www.ycombinator.com/companies/atmana",
    "name": "Atmana",
    "headline": "Apps to control technology addictions/ helping startups hire engineers",
    "batch": "S21",
    "description": "At Atmana, we help millennials cut down on technology addictions like gaming, pornography and social media. We have our solution consisting of blocking and techniques used in treating in alcohol and drug addiction like peer support groups, buddy program and psycho education. \r\n\nWe also have a 2nd line of business: helping startups hire engineers from India. Hiring engineers from India can help you save cost while ensuring you have the same quality of talent in your team like you have in the US.",
    "activity_status": "Active",
    "website": "https://blockerx.net/",
    "founded_date": 2020.0,
    "team_size": 8.0,
    "location": "Dubai, United Arab Emirates",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:mental-health-tech",
    "founders": [
        {
            "name": "Tejas Bala, Founder",
            "description": "Tejas is an entrepreneuer with over 12 years of experience working in startups in product & growth roles. He founded Atmana in 2020 to help youngsters overcome compulsive technology use.",
            "linkedin": "https://www.linkedin.com/in/tejaspm/"
        }
    ],
    "status": true,
    "generated_description": "Atmana is a dynamic company founded in 2020 and part of Y Combinator's S21 batch. Based in Dubai, United Arab Emirates, it's made up of a compact team of eight employees, all focused on tackling two critical issues of modern life: technology addiction and hiring challenges for startups.\n\n### Mission and Offerings \n\nAtmana operates primarily through two avenues:\n\n1. **Combating Technology Addiction**: Initially launched with the aim of helping millennials, Atmana has developed solutions that aid individuals in managing their technology habits—especially gaming, pornography, and social media. Their service includes effective tools like blocking software and methods inspired by addiction treatment approaches. This includes support mechanisms such as peer groups and psychoeducation, which cater to those finding it hard to disconnect from their digital dependencies. One of their flagship products is **BlockerX**, a powerful app designed to restrict access to explicit content and distractions on devices.\n\n2. **Talent Acquisition for Startups**: Recognizing the global talent landscape, Atmana also helps startups in the U.S. hire engineers from India. This dual focus allows companies to access high-quality tech talent at a more sustainable cost. It's a win-win, enabling startups to grow while easing financial pressures.\n\n### Core Products\n\n- **BlockerX**: This app helps users reduce screen time significantly—promising up to a 90% reduction and an extra four hours daily. Its functionalities include:\n  - A **Porn Blocker** available across platforms (Chrome, iOS, Android)\n  - Dedicated blockers for social media, gaming, and dating apps.\n  - Tools designed to enhance productivity and mental clarity by limiting distractions.\n\nThe outcomes? Users report better sleep, increased productivity, improved relationships, and an overall enhancement in their mental health.\n\n### Noteworthy Stats and Features\n\n- 92% of premium subscribers have seen a reduction in harmful porn consumption within three months of using BlockerX.\n- The app offers customized accountability solutions, detailed stats on usage, and a supportive community that encourages a transformative journey.\n\n### Final Thoughts\n\nAtmana isn't just another tech company; it embodies a thoughtful approach to pressing societal issues. By merging mental health solutions with innovative hiring practices, they're attempting to create an ecosystem that enriches both personal well-being and professional growth. Ideal for anyone swamped in the digital age, Atmana provides not just tools and services but also a pathway toward healthier technology interactions. If you're navigating these modern challenges, giving Atmana a look could be worthwhile.\n\nFor more information, check out their website at [blockerx.net](https://blockerx.net/).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/1db0eae1a92f0f7ecacf9dbe9d9fc3aa1a201060.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191009Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=34491f763460797dd56c9eb1d6796847d3e6b167dba00ca2401dd3b7e342a5ba",
    "social_links": [],
    "logo_path": "data/logos\\Atmana_logo.png"
}