{
    "links": "https://www.ycombinator.com/companies/atomic-alchemy",
    "name": "Atomic Alchemy",
    "headline": "We produce cancer-curing materials used in nuclear medicine.",
    "batch": "W19",
    "description": "Atomic Alchemy is building a bank of reactors to produce the nuclear material that goes into nuclear medicine. Radiopharmaceuticals are vitally important in biological tracers, diagnostic imaging, and cancer treatments.\r\n\nCurrently, the world's supply of Molybdenum-99, the cornerstone of 80% of all nuclear medicine procedures, is sourced from just six government-run, scientific research reactors abroad. Five of these reactors are 45-65 years old and are quickly coming to the end of their operational life. This has cultivated a fragile and lengthy supply chain, at odds with the nature of radioactive material.\r\n\nThis issue and its implications do not just effect molybdenum, but any other reactor-based isotope. Many promising cancer therapies are stuck in clinical trials, unable to secure enough material in a timely manner. Research doesn’t even happen because of the difficulty of sourcing any new isotopes.\r\n\nIt doesn't have to be this way. Atomic Alchemy is working to solve this by building the world's first scalable radioisotope production facility. This facility will contain the world’s first privately-owned nuclear reactors dedicated to radioisotope production.",
    "activity_status": "Active",
    "website": "https://atomicalchemy.us",
    "founded_date": 2018.0,
    "team_size": 5.0,
    "location": "Idaho Falls, ID",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:hard-tech; industry:small-modular-reactors; industry:medical-devices",
    "founders": [
        {
            "name": "Thomas Eiden, Founder",
            "description": "Former reactor engineer/core designer at the Advanced Test Reactor at Idaho National Laboratory. Performed next-generation nuclear fuels research at the University of Wisconsin-Madison.",
            "linkedin": "https://www.linkedin.com/in/thomaseiden"
        }
    ],
    "status": true,
    "generated_description": "Atomic Alchemy is on a mission to transform nuclear medicine, specifically by producing vital cancer-curing materials. Founded in 2018 and part of Y Combinator Batch W19, this innovative company is based in Idaho Falls, ID, and is tackling a significant issue in the world of radioisotope supply.\n\nCurrently, the backbone of nuclear medicine, Molybdenum-99—essential for 80% of procedures—comes from a few aging, government-run reactors abroad. Many of these reactors are nearing the end of their operational life, creating a precarious and inefficient supply chain. This isn’t just a problem for Molybdenum; it extends to other reactor-based isotopes, stalling promising cancer treatments and hindering research efforts.\n\nBut it doesn't have to be this way. Atomic Alchemy is building the world’s first scalable radioisotope production facility, featuring privately-owned nuclear reactors specifically designed for this purpose. Their Versatile Isotope Production Reactor (VIPR®) will set new standards, ensuring reliable and high-quality isotopes for healthcare, industry, and research.\n\nIn addition to innovative production methods, Atomic Alchemy focuses on sustainability by recycling isotopes from used nuclear fuel, thereby creating a consistent and eco-friendly source of essential isotopes. Collaborating with industry leaders, they aim to enhance the reach and capability of their isotope production.\n\nWith a dedicated team of five and ambitious goals, Atomic Alchemy is positioning itself as a pivotal player in the nuclear medicine field. If you're interested in how a dependable supply of high-quality isotopes can benefit you or your business, check them out at [Atomic Alchemy](https://atomicalchemy.us).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/4a8ecf20041c67b154c5698c683fe9008e738387.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191010Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=373936cc85aee088d29a961e69d4b986820987f50b4ecb3b00916e035efa7b0e",
    "social_links": [
        "https://www.linkedin.com/company/atomic-alchemy-inc/",
        "https://twitter.com/isotopefactory",
        "https://www.facebook.com/AtomicAlchemyInc/",
        "https://www.crunchbase.com/organization/atomic-alchemy"
    ],
    "logo_path": "data/logos\\Atomic_Alchemy_logo.png"
}