{
    "links": "https://www.ycombinator.com/companies/aurabeat",
    "name": "Aurabeat",
    "headline": "Providing clean, safe, virus free air for homes, buildings and cars",
    "batch": "W21",
    "description": "We make Air Purifier and filters that is certified to eliminate COVID-19 and most other viruses and bacteria.  Our technology is independently lab tested, EPA certified and FDA registered.  Our air purifiers are already found in homes, businesses and government facilities around the world to help protect their customers and employees from airborne pathogens.",
    "activity_status": "Active",
    "website": "https://www.aurabeattech.com/",
    "founded_date": 2017.0,
    "team_size": 12.0,
    "location": "Hong Kong, Hong Kong",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:hardware; industry:energy",
    "founders": [
        {
            "name": "Phil Yuen, Founder",
            "description": "Phil is part of the YC 06 batch, TextPayMe founder, a mobile payment system which was eventually acquired by Amazon and became Amazon Payments. Now working on an anti COVID-19 Air Filtration device.",
            "linkedin": "https://www.linkedin.com/in/philipyuen/"
        },
        {
            "name": "Roger Sze To, Founder",
            "description": "15+ years of research experience in building energy and indoor environmental quality, inventor of 3 technologies related to energy saving and air disinfection.",
            "linkedin": "https://www.linkedin.com/in/rogerszeto/"
        }
    ],
    "status": true,
    "generated_description": "### Aurabeat: Bringing Clean Air to the World\n\nFounded in 2017 and part of Y Combinator Batch W21, Aurabeat is a Hong Kong-based tech company focused on a mission that has never been more relevant: providing clean, safe, virus-free air for homes, buildings, and vehicles. With a lean team of just 12 employees, they are making significant strides in a market where air quality has become a key concern.\n\n#### What They Do\n\nAurabeat specializes in air purification technologies that are independently lab-tested, EPA-certified, and FDA-registered. Their flagship products include air purifiers and filters designed to eliminate COVID-19, alongside other viruses and bacteria. This technology has been deployed globally across homes, businesses, and government facilities, allowing them to ensure the safety of their customers and employees from airborne pathogens.\n\n### Key Technologies\n\n1. **EcoSonic Air Filtration**: An advanced filtration system that improves airflow and energy efficiency, reducing energy costs without compromising air quality.\n   \n2. **Silver-ion Disinfection**: Utilizing the natural antimicrobial properties of silver, this technology further combats the spread of contaminants in the air.\n\n3. **Aurabeat AG+ Air Purifiers**: These devices integrate seamlessly into various environments—ranging from vehicles to smart IoT systems—targeting airborne pathogens and enhancing indoor air quality.\n\n### Achievements and Impact\n\nAurabeat’s products have already made a difference in over 5 million square feet of managed space, demonstrating impressive effectiveness in lowering energy usage and carbon emissions. They have notably secured awards such as the Energy Globe National Award and the Asia Pacific Innovation Award, showcasing their commitment to innovation in sustainability.\n\n### Market Position and Future Directions\n\nPositioned at the intersection of hardware and energy management, Aurabeat is not just about pumping out air purifiers; they’re about transforming how we think about air treatment in the context of building management systems. Their solutions lead to immediate cost savings and significant improvements in building energy efficiency.\n\nFor more information, you can explore their website at [Aurabeat](https://www.aurabeattech.com). Among their partners is nan, further hinting at their collaborative approach to expanding their technological footprint.\n\n### Conclusion\n\nIn a world where clean air is paramount, Aurabeat stands out for leveraging cutting-edge technology to make environments safer. The team’s dedication to combating airborne threats complements the growing global emphasis on health and sustainability. Simply put, they’re not just cleaning the air; they’re innovating the very way we think about it.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/0ccae25f3c6141b5ffef1518b3e44539569b0cb8.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191010Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=e70dc2ac73e19d74b745e5b8d8eac65bc4fe96144802243f44f3cf5028552f20",
    "social_links": [
        "https://www.linkedin.com/company/aurabeat-technology-limited/"
    ],
    "logo_path": "data/logos\\Aurabeat_logo.png"
}