{
    "links": "https://www.ycombinator.com/companies/auricle",
    "name": "Auricle",
    "headline": "Neurostimulation implant to restore hearing & speech understanding",
    "batch": "W21",
    "description": "Auricle is a medical device company building a breakthrough neurostimulation implant to restore hearing in millions of patients who no longer benefit from hearing aids, get less than 60% on a word recognition test, but aren't prepared to make the jump to a cochlear implant. \r\n\nOur approach preserves remaining natural hearing through a reversible and less invasive surgery, addressing the key concerns that hold most patients back from getting a cochlear implant (currently the only treatment option for these patients).\r\n\nThe company spun out of Stanford Biodesign having completed two acute human clinical studies demonstrating the approach will work. The team is now focused on developing their full implant system for their first clinical trial. \r\n\nAuricle addresses a currently unserved profile of hearing loss that affects a growing population of 3.5 million patients in the US and represents an immediately accessible $1.2B market opportunity with existing reimbursement.",
    "activity_status": "Active",
    "website": "https://auricle.com",
    "founded_date": 2020.0,
    "team_size": 2.0,
    "location": "Mountain View",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:hard-tech; industry:neurotechnology; industry:health-tech; industry:medical-devices; industry:healthcare; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Francis Wong, Founder",
            "description": "I'm Francis, a UK-trained surgeon who worked in the National Health Service as a surgeon for 5 years. In 2012 I moved to the Bay Area to get my MBA/MPH at UC Berkeley. I've worked in several product management roles at startups including 23andMe and Castlight Health. I also founded Outcomes, Inc., a digital health startup enabling the routine use of patient-reported outcomes. Prior to Stanford, I worked at Haven in Boston and co-founded Auricle out of the Stanford Biodesign Fellowship.",
            "linkedin": "https://linkedin.com/in/loaded"
        },
        {
            "name": "Jay Dhuldhoya, Founder",
            "description": "I am a medical device engineer and entrepreneur with a BA from Columbia and an MS from Rice in biomedical engineering. I have led R&D, quality, and manufacturing projects at Element Science, an SF-based Class 3 medical device start-up. I recently completed the Stanford Biodesign Innovation Fellowship where I co-founded Auricle.",
            "linkedin": "https://www.linkedin.com/in/jaydhuldhoya/"
        }
    ],
    "status": true,
    "generated_description": "### Auricle: A New Era in Hearing Restoration\n\n#### Overview\nFounded in 2020 and hailing from Stanford Biodesign, Auricle is carving out a niche in the medical device landscape with its innovative neurostimulation implant. The company's mission is straightforward yet profound: to restore hearing and speech understanding for millions of patients who find themselves stuck between ineffective hearing aids and the more invasive cochlear implants.\n\n#### The Problem\nApproximately 3.5 million people in the U.S. fall into this gap—those with hearing loss who score less than 60% on word recognition tests and can't benefit from traditional solutions. Current options leave them underserved, leading to a significant market opportunity valued at $1.2 billion.\n\n#### The Approach\nAuricle's technology takes a different route. It offers a reversible and less invasive surgical solution that preserves the patient's remaining natural hearing. This approach effectively addresses the common hesitations individuals have about getting cochlear implants, which prominently include concerns around irreversibility and surgical invasiveness.\n\n#### Current Status\nThe company has already made strides by completing two acute human clinical studies that demonstrate the efficacy of its approach. The team, small but ambitious with just two employees, is gearing up to further develop their full implant system and prepare for their first clinical trial.\n\n#### Support and Environment\nAuricle resides in the dynamic San Francisco Bay Area, benefiting from the backing of prominent innovation hubs like Y Combinator, StartX, and Fogarty Innovation. Their focus on hard-tech and neurotechnology positions them at the forefront of health-tech and medical devices.\n\nFor those interested, you can dive deeper into Auricle's journey and offerings at [auricle.com](https://auricle.com).\n\n---\n\nIn a world where hearing aids often fall short, Auricle is emerging as a beacon of hope for those left in silence. Their commitment to restoring communication bridges the gap for millions, positioning them not just as a company, but as a vital player in the future of auditory health.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/c3770ad2d64049875e341de6d1221d3cf4e62036.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191011Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=ec985b04e1d00d869573c985c3670f0b98847507867538fa0938d688a22ca55f",
    "social_links": [
        "https://linkedin.com/company/auriclehealth",
        "https://twitter.com/auricleneuro"
    ],
    "logo_path": "data/logos\\Auricle_logo.png"
}