{
    "links": "https://www.ycombinator.com/companies/autone",
    "name": "autone",
    "headline": "Inventory management SaaS for Retail & Consumer brands",
    "batch": "S22",
    "description": "Today, Retailers have to make 1000s of complex operational decisions every day, all impacting their bottom line.This problem is being currently tackled with excel or legacy systems, both no longer fit for purpose.\r\n\nWe make a platform that lets retailers make optimal decisions, easily and quickly. We ingest a retailer's data, generate recommendations and then allow users to approve a given action. Our platform covers topics including product pricing, inventory replenishment and re-ordering with the goal of covering all operational processes.",
    "activity_status": "Active",
    "website": "https://autone.io",
    "founded_date": 2021.0,
    "team_size": 20.0,
    "location": "London, United Kingdom",
    "group_partner": "Aaron Epstein",
    "group_partner_yc": "https://www.ycombinator.com/people/aaron-epstein",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:sustainable-fashion; industry:consumer; industry:supply-chain; industry:retail",
    "founders": [
        {
            "name": "Adil Bouhdadi, Founder",
            "description": "Over his career, Adil has worked within the retail industry across leading luxury fashion companies in Paris, New York, and London. In 2020, he co-founded Autone to help retail & consumer goods businesses scale their performances by accurately understanding, planning and forecasting their sales & operation flows.\nIn his free time, Adil enjoys exploring Italy on the weekend, visiting family in Marrakech,\nor traveling around Europe.",
            "linkedin": "https://www.linkedin.com/in/adilbouhdadi/"
        },
        {
            "name": "Harry Cheslaw, Founder",
            "description": "I am a london based technical / product founder focusing currently on the retail space. \n\nIn 2020, I co-founded Autone to help retail & consumer goods businesses scale their performances by accurately understanding, planning and forecasting their sales & operation flows.\n\nI am always happy to chat and help others so do not hesitate to reach out!",
            "linkedin": "https://www.linkedin.com/in/harry-glucksmann-cheslaw-87811177/"
        }
    ],
    "status": true,
    "generated_description": "**Company Overview: autone**\n\nFounded in 2021 and hailing from London, UK, autone addresses a pervasive issue in retail: the complexity of inventory management. With thousands of critical operational decisions to make daily, retailers often find themselves grappling with outdated tools like Excel or legacy software that simply can’t handle the modern demands of their business. Enter autone—an innovative SaaS platform designed specifically for Retail and Consumer brands to streamline inventory management.\n\n**Mission and Product Offering**\n\nautone’s mission is clear: to simplify inventory management while maximizing efficiency and profit margins. The platform ingests a retailer's data, generates actionable insights about product pricing, inventory replenishment, and reordering, and seamlessly integrates these recommendations into daily operations. This is not just about tackling inventory; it’s about transforming how decisions are made within the retail space—fast, simple, and data-driven.\n\nBy empowering retailers to make optimal decisions, autone not only helps avoid stockouts but also boosts sales. With an emphasis on clarity and intuition, their software becomes a trusted ally for merchants aiming to navigate the complexities of product management.\n\n**Growth and Achievements**\n\nAs part of the prestigious Y Combinator Batch S22, autone has managed to attract attention and secure a solid footing in the industry. Recently, they raised $17 million in a Series A funding round, enabling further development and outreach of their platform, which already boasts a user-friendly interface customized for various sectors including fashion, cosmetics, and accessories.\n\n**Team and Company Culture**\n\nThe company operates with a team of 20 dedicated employees, guided by industry insights and collaborative effort. Working under the stewardship of Group Partner Aaron Epstein, autone is committed to blending AI-driven recommendations with the nuanced understanding of human experts—essentially, a combination of machine learning and human intuition.\n\n**Impact Statement**\n\nWith features designed to optimize inventory decisions, autone reports notable metrics: a 35% growth in sales, an 80% reduction in stockouts, and a remarkable 95% decrease in manual tasks. These statistics speak to their ability to significantly reduce operational hassles while enhancing profitability for their clients.\n\nautone stands at the intersection of technology and strategic retail management, poised to reshape how businesses manage inventory. Retailers looking for clarity in decisions and empowerment in operations can book a demo through their website [autone.io](https://autone.io) and step into a new era of inventory management.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/a5ebb4d66021f3278467b30edfb979fa97cb8c37.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191012Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=de3d8c33e6c3058592496d99966577904c37fd69c6bfa19dbbe1a3015b074b07",
    "social_links": [
        "https://www.linkedin.com/company/hello-autone/"
    ],
    "logo_path": "data/logos\\autone_logo.png"
}