{
    "links": "https://www.ycombinator.com/companies/aviaryai",
    "name": "AviaryAI",
    "headline": "Outbound AI voice agents for the financial services industry",
    "batch": "S22",
    "description": "AviaryAI is the industry's first outbound AI service team for banks, credit unions, and insurance companies. In a landscape where only 18% of financial service providers make proactive outbound calls and rely heavily on emails, AviaryAI offers a groundbreaking solution. Powered by a private LLM, our suite of products helps institutions leverage Generative AI while adhering to stringent regulatory and compliance standards.",
    "activity_status": "Active",
    "website": "http://www.helloaviary.ai",
    "founded_date": 2022.0,
    "team_size": 8.0,
    "location": "Chicago, IL",
    "group_partner": "Brad Flora",
    "group_partner_yc": "https://www.ycombinator.com/people/brad-flora",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:b2b; industry:ai; industry:ai-assistant",
    "founders": [
        {
            "name": "Blesson Abraham, Founder",
            "description": "Blesson Abraham is a two-time founder and is the CEO of Cambio. He started his career at a retail bank as a leadership development associate and went on to lead marketing, sales and helped start their analytics team.  In 2014, he co-founded SavvyIntel, a SaaS analytics solution for banks and credit unions. In 2017, SavvyIntel was acquired by CUNA Mutual Group.",
            "linkedin": "https://www.linkedin.com/in/blessonjabraham"
        },
        {
            "name": "Jay Patel, Founder",
            "description": "Jay Patel is a two-time founder and is the CTO of Cambio. In 2020 he started the non-profit social-justice app FireWatch. He leads the development and engineering efforts at Cambio.",
            "linkedin": "https://www.linkedin.com/in/jay-patel-2017/"
        }
    ],
    "status": true,
    "generated_description": "### AviaryAI: Revolutionizing Outbound Communication in Financial Services\n\n**Overview**:  \nFounded in 2022 and based in Chicago, AviaryAI is a fresh player in the fintech scene, specifically targeting the financial services industry. Powered by a proprietary Large Language Model (LLM), it aims to change the game for banks, credit unions, and insurance companies by introducing outbound AI voice agents that promise more engaging and efficient communication.\n\n**The Problem**:  \nIn a surprising statistic, only 18% of financial service providers make proactive outbound calls—many still rely heavily on emails. This disconnect presents a significant opportunity. AviaryAI steps in to fill that gap, equipping financial institutions with tools to engage customers more effectively and personally.\n\n**The Solution**:  \nAviaryAI's primary offerings include:\n- **Outbound Voice Agents**: These generate conversational interactions that feel human while adhering to strict regulatory compliance.\n- **AI Knowledge Base**: A repository of information that provides instant responses, helping institutions serve their clients faster and more efficiently.\n\nTheir products leverage generative AI technology to help financial businesses not only stay compliant but also engage and retain customers with newfound strategies. \n\n**Market Position and Backing**:  \nAviaryAI is part of Y Combinator's Batch S22, a renowned startup accelerator, which signifies validation and support from one of the industry's most prestigious platforms. Their current team comprises just eight dedicated individuals, but they are on a mission to amplify the outreach capabilities of their clients.\n\n**Why It Matters**:  \nThe need for enhanced communication in an age where customer interactions have become largely digital cannot be overstated. With AviaryAI's solution, financial institutions can achieve:\n- **Higher Engagement Rates**: Their voice agents provide a human touch, which can drive customer satisfaction.\n- **Faster Implementation**: Most institutions can get started with AviaryAI's tools in under two weeks—minimal technical resources are required.\n- **Regulatory Compliance**: They are actively pursuing SOC 2 Type 2 Certification, ensuring their practices align with industry standards.\n\n**Case Studies**:  \nAviaryAI already boasts impressive results from its early implementations:\n- A hurricane relief campaign partnership resulted in a **174% success rate** compared to the national average for outreach.\n- They reported a **34% reduction in call hold times**, streamlining costs and improving service speed.\n- One collaboration led to a **70% conversion rate** for personalized offers—driving non-interest income like never before.\n\n**Conclusion**:  \nIn a landscape where financial institutions are increasingly recognizing the need for more outreach, AviaryAI stands as a beacon of innovation. They combine deep industry expertise with cutting-edge AI technology to serve a pressing need. If you’re in financial services and looking to transform your customer interactions, it's worth checking out what AviaryAI has to offer on their [website](http://www.helloaviary.ai).\n\n**Key Tags**: fintech, B2B, AI, AI assistant.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/7579f868ea62392951761c2125a1d52bc2510024.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191013Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=b77a237be25f3188be85b111ec6c8bc259efa3c1b6e905a3bef1ae8eb832f977",
    "social_links": [
        "https://www.linkedin.com/showcase/aviaryai",
        "https://www.crunchbase.com/organization/aviaryai"
    ],
    "logo_path": "data/logos\\AviaryAI_logo.png"
}