{
    "links": "https://www.ycombinator.com/companies/avina",
    "name": "Avina",
    "headline": "X-Ray Vision for Your Sales Team",
    "batch": "S22",
    "description": "Avina is an AI sales companion that alerts sales reps in real-time which accounts they should take action on, provides comprehensive briefs for every account before calls and wherever they work, and helps sellers draft the perfect communication - ensuring you don’t miss out on golden opportunities.\r\n\nAvina is the only assistant with the full context of every account - it combines your marketing and sales touchpoints (including a new way to track exactly what a prospect has read on your site), call recordings, internal documentation, and external buying signals from across the web. Sellers no longer have to cobble together information buried in dozens of places.",
    "activity_status": "Active",
    "website": "https://avina.io",
    "founded_date": 2022.0,
    "team_size": 5.0,
    "location": "New York",
    "group_partner": "Tom Blomfield",
    "group_partner_yc": "https://www.ycombinator.com/people/tom-blomfield",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:artificial-intelligence; industry:b2b; industry:sales; industry:marketing; location:new-york",
    "founders": [
        {
            "name": "Ron Fisher, Founder",
            "description": "Ron Fisher is the CEO & Co-Founder of Mesh. Previously, he was the CEO & co-founder of Bowtie, the first AI receptionist for Beauty, Wellness & Fitness businesses, which was acquired by MINDBODY in 2019. In his spare time, Ron founded and leads Illumination.NYC, an annual outdoor public art festival that celebrates light as an artistic medium showcasing artists from all over the world.",
            "linkedin": "https://www.linkedin.com/in/rondovfisher/"
        },
        {
            "name": "Vivek Sudarsan, Founder",
            "description": "I'm the CPO and co-founder of Avina. Previously I was the CPO of Bowtie which was acquired by Mindbody, and helped scale the product to thousands of customers after our acquisition.",
            "linkedin": "https://www.linkedin.com/in/viveksudars/"
        },
        {
            "name": "Mike Wang, Founder",
            "description": "Hi! I'm the CTO & Co-founder of Avina. Previously I was CTO & Co-founder of Bowtie, a B2B SaaS product that we sold to Mindbody, where I continued to manage our engineering team. Would love to chat about new tech, startup life, AI, web3, social impact, sci-fi, philosophy, or the latest Netflix show :)",
            "linkedin": "https://www.linkedin.com/in/michaelzw/"
        }
    ],
    "status": true,
    "generated_description": "**Avina: X-Ray Vision for Your Sales Team**\n\nFounded in 2022 and emerging from Y Combinator’s Batch S22, Avina is reshaping how B2B sales teams engage with prospects. Headquartered in New York and powered by a dedicated team of five, Avina aims to give sellers an unparalleled advantage with its innovative AI sales companion.\n\n### Mission-Driven Approach\n\nAvina’s mission succinctly puts it: \"X-Ray Vision for Your Sales Team.\" In a rapidly evolving market post-pandemic, sales cycles are longer, teams face increased competition, and expectations have risen. Amidst these challenges, Avina provides a lifeline by transforming how sales representatives access and act on vital account information.\n\n### How Does Avina Work?\n\nAvina operates at the crossroads of marketing and sales, unearthing critical insights that often get buried in the noise. Think of it as a comprehensive resource that allows sales professionals to:\n\n1. **Connect**: Seamlessly interfaces with existing marketing and sales platforms, gathering data from CRMs, ad tools, call records, and more.\n   \n2. **Collect**: It unifies internal and external data points, helping teams to zero in on what matters most – the intent and behavior of prospects, including real-time updates on what they engage with on your website.\n\n3. **Convert**: Armed with actionable insights, Avina alerts sales teams when to engage and how to personalize their outreach based on individual account histories. \n\nThis systematic approach ensures no opportunity slips through the cracks, converting potential leads into revenue with remarkable precision.\n\n### Why Avina Stands Out\n\nIn a sea of generic AI tools promising to supercharge sales pipelines, Avina differentiates itself by adding depth to data. It’s not just about getting more leads; it’s about converting those leads into long-term customers. Many sales tools give superficial insights that don't translate into real-world success. Avina takes on the heavy lifting, ensuring that sales teams have timely, relevant information ready at their fingertips.\n\n### Benefits of Avina\n\n- **Real-Time Intelligence**: Sales reps get instant alerts on critical account activities, such as prospect engagement, so they can act swiftly.\n- **Streamlined Communication**: Helps draft emails, LinkedIn messages, or texts tailored to individual prospects based on their activity.\n- **Automated Briefs**: Compiles key insights into concise briefs for sales calls, saving hours of preparation time each week.\n- **Rapid Onboarding**: Setup takes just 30 minutes, enabling teams to start utilizing the power of Avina swiftly.\n\n### Recent Developments\n\nRecently, Avina raised $3.2 million to further enhance its capabilities. This funding not only solidifies its position in the market but also forecasts future innovations to keep sellers equipped and informed.\n\n### Conclusion\n\nIf you’re looking to boost the efficiency of your sales team, Avina offers a transformative solution that harmonizes data and human execution. Unlocking the hidden potential within your leads could be the game-changer your sales strategy needs.\n\nFor more insights or to see Avina in action, check out their [website](https://avina.io) or book a demo to explore how they can elevate your sales game.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/6273854cebf578a2de823ace337d27c866584f4b.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191013Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=32af044e11ea4427857ff4b6a4672a869e460919751d8901cc3370fac329c150",
    "social_links": [
        "https://www.linkedin.com/company/avinaio/"
    ],
    "logo_path": "data/logos\\Avina_logo.png"
}