{
    "links": "https://www.ycombinator.com/companies/avion",
    "name": "Avion",
    "headline": "Avion builds and operates autonomous eVTOL drones that deliver vitalâ\u0080¦",
    "batch": "W20",
    "description": "Avion is a drone-based digital health platform, designed to bridge the gap between remote clinics and urban healthcare infrastructures. By connecting these isolated clinics with sophisticated labs and well-stocked pharmacies in cities, Avion brings a new era of remote diagnostics and prescription fulfilment.\r\n\nAvion ensures the rapid, safe, and efficient delivery of vital medical supplies and clinical samples, even to the most hard-to-reach locations. \r\n\nAvion's operation uniquely combines cutting-edge autonomous drone technology with digital health platforms. Our drones, built with advanced eVTOL capabilities, ensure seamless take-off and landing capabilities, even in challenging terrains.\r\n\nAvion's digital health platform serves as the connective tissue between urban health centers and remote clinics. The platform features an intuitive interface, making it easy for healthcare providers to order necessary supplies, track shipments, and even communicate with laboratory and pharmacy staff.",
    "activity_status": "Active",
    "website": "http://www.avion.health",
    "founded_date": 2018.0,
    "team_size": null,
    "location": "San Francisco",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:autonomous-delivery; industry:drones; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Brook Ayalneh, Founder",
            "description": "Co-founder & CEO at Avion UAV",
            "linkedin": "https://www.linkedin.com/in/brook-a-4002701a4/"
        },
        {
            "name": "Mohammed Ismail, Founder",
            "description": "co-founder",
            "linkedin": null
        },
        {
            "name": "Bitiya Samuel, Founder",
            "description": null,
            "linkedin": null
        }
    ],
    "status": true,
    "generated_description": "**Company Summary: Avion**\n\nFounded in 2018 and hailing from the innovative environment of Y Combinator’s W20 batch, Avion is not your typical drone company. They’ve taken an ambitious approach to healthcare logistics by merging autonomous eVTOL (electric Vertical Take-Off and Landing) technology with digital health services. \n\n**Mission:**\nAvion’s mission is clear: to create a seamless healthcare delivery system that connects remote clinics to urban pharmacies and labs. This intend to bridge the gap in health services, ensuring that vital medical supplies and clinical samples can be sent quickly and safely to areas that might otherwise struggle to receive them.\n\n**What They Do:**\nAvion operates state-of-the-art drones designed specifically for medical deliveries, tackling the challenges of geography with advanced technology. These drones can take off and land in tough terrains, ensuring that no clinic is too remote to access the resources they need.\n\nTheir digital health platform acts as the connective tissue, making it simple for healthcare providers to order supplies, track shipments, and communicate effectively with pharmacy and lab personnel. \n\n**Key Features:**\n1. **Rapid Deliveries:** Avion’s drones allow for fast deliveries over challenging terrains, addressing the pressing needs of underserved communities.\n2. **User-Friendly Digital Platform:** This intuitive interface helps clinics bridge their needs with urban health resources effectively.\n3. **Autonomous Technology:** Their autonomous drones navigate obstacles and adapt to changing weather, ensuring reliable deliveries every time.\n\n**Vision:**\nAt its core, Avion aims to democratize healthcare access—making it universal regardless of location. They envision a world where healthcare resources flow as freely as information in our digital age.\n\n**Current Operations:**\n- Over 5,000 deliveries completed.\n- Service spanning more than 200 miles.\n- Connecting over 200 clinics, which signifies meaningful outreach in community health support.\n\nDespite being a relatively young company located in San Francisco with a small team, Avion is carving out a significant impact in the healthcare logistic space. It stands as a testament to how modern technology can solve persistent problems in our healthcare system. \n\nTo learn more, visit them at [Avion's Website](http://www.avion.health). ",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/295af80e638294f2806be648b5387ac9ed3ad53e.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191013Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=97ea8ccd8666f7142b389910d334e19f4e234db3e296fdf8a0159b10fbec591e",
    "social_links": [],
    "logo_path": "data/logos\\Avion_logo.png"
}