{
    "links": "https://www.ycombinator.com/companies/avocado",
    "name": "Avocado",
    "headline": "Fully Integrated Restaurant Point-of-Sale",
    "batch": "W21",
    "description": "Our mission is to support entrepreneurs in the food industry by offering a seamlessly integrated restaurant tech platform. We handle all forms of customer payments, both in person and online, including kiosk and invoicing. Additionally, we manage critical back-office tasks, including order management, payroll, bookkeeping, and sales tax remittance, so that restaurants and their teams can prioritize delivering exceptional dining experiences.",
    "activity_status": "Active",
    "website": "https://avocadopos.com",
    "founded_date": 2020.0,
    "team_size": 4.0,
    "location": "Austin, TX",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:marketplace; industry:food-tech; location:austin",
    "founders": [
        {
            "name": "Nick Evans, Founder",
            "description": "Co-Founder and CEO of Avocado\nCo-Founder and first CEO of Tile\nFormer hardware and software engineer\nLove products and people\nAustin, TX -> SF, CA",
            "linkedin": "https://www.linkedin.com/in/thenickevans/"
        },
        {
            "name": "Shayan Guha, Founder",
            "description": "San Francisco, CA",
            "linkedin": "https://www.linkedin.com/in/shayan-guha/"
        }
    ],
    "status": true,
    "generated_description": "### Avocado: A Fresh Take on Restaurant Point-of-Sale Systems\n\n**Overview**\nFounded in 2020 and hailing from Austin, TX, Avocado is revolutionizing the way restaurants manage their operations. As part of Y Combinator's W21 batch, this lean team of four is on a mission to create a fully integrated restaurant point-of-sale (POS) system that effortlessly handles every aspect of a dining establishment's needs, from customer payments to back-office management.\n\n**Mission**\nAvocado’s mission is simple yet powerful: to support food industry entrepreneurs by providing a seamless tech platform. This encompasses managing in-person and online payments, including kiosks and invoicing, while simplifying tasks like order management, payroll, bookkeeping, and sales tax remittance. The goal? Allow restaurant teams to focus on what really matters—delivering great dining experiences.\n\n**Key Features**\n1. **Cost Savings**: Avocado stands out by offering free hardware, setup, and service, along with no merchant fees. This is a game-changer, especially for smaller food trucks and independently-owned eateries.\n  \n2. **Exceptional Customer Support**: With a promise of immediate response times, Avocado prides itself on making customer support a top priority. Forget being put on hold; their team is always available to assist.\n\n3. **AI Superpowers**: Their integrated AI capabilities bring advanced features for order taking, reporting, team management, loyalty programs, and marketing, pushing the envelope on what restaurant tech can do. \n\n4. **User-Friendly Design**: The platform is intuitive to the point that training is no longer necessary, allowing for quick adoption by staff.\n\n5. **Financial Model**: Avocado employs a unique pricing structure that charges customers a 2.5% fee at checkout, taking away the burden of merchant fees from restaurant owners.\n\n**Why Choose Avocado?**\nAvocado's innovative approach allows small to mid-sized restaurants to eliminate hidden charges and upsells that often plague traditional POS systems. You get everything included for free or at heavily discounted rates. Customers report that Avocado’s system is not only functional and financially prudent but also fun to use.\n\n**Customer Testimonials**\nRestaurant owners have shared glowing reviews about Avocado’s platform, highlighting things like ease of operation, the quality of customer service, and the absence of hefty fees that typically accompany other POS systems. From food trucks to established restaurants, users appreciate the streamlined processes Avocado promotes.\n\nIn essence, Avocado is more than just a POS system; it’s a partner for any restaurant looking to harness technology for better service and smoother operations. If you’re in the food business and want a solution that really caters to your needs, Avocado is worth a good look.\n\n**Find Out More**\nTo dive deeper or schedule a demo, visit Avocado's website: [Avocado POS](https://avocadopos.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/880a657774ad96a2cc7fe25acc0950d7cab9a9a4.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191014Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=eab0cbd6969f95e0204775e82e776948658d1470da156f03010ee2c0c9e16668",
    "social_links": [],
    "logo_path": "data/logos\\Avocado_logo.png"
}