{
    "links": "https://www.ycombinator.com/companies/avro-life-science",
    "name": "Avro Life Science",
    "headline": "Skin patches for generic drug delivery.",
    "batch": "W18",
    "description": null,
    "activity_status": "Active",
    "website": "http://avrolifesci.com",
    "founded_date": null,
    "team_size": 8.0,
    "location": "Waterloo, Canada",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:biotech; industry:drug-delivery",
    "founders": [],
    "status": true,
    "generated_description": "**Avro Life Science: A Snapshot**\n\nAvro Life Science is a Canadian biotech company dedicated to innovating drug delivery through skin patches for generic medications. Founded in the wake of Y Combinator's Batch W18, this small team of eight is positioned in Waterloo, Canada, ready to make a significant impact in the pharmaceutical landscape.\n\nThe essence of Avro’s mission revolves around creating advanced delivery systems that facilitate more effective and accessible medication through transdermal patches. This approach not only simplifies the administration of drugs but also holds the potential to improve patient compliance and overall healthcare outcomes.\n\nWhile details on their partnerships or collaborations are sparse, the company has a focus on integrating cutting-edge technology with real-world healthcare applications. They have tagged themselves with keywords like 'biotech' and 'drug-delivery', underscoring their commitment to these pivotal areas in the health sector.\n\nIf you’re interested in their projects or developments, you might want to keep an eye on their website—though currently it seems there are some technical hiccups. Nonetheless, Avro Life Science is one to watch as they continue to navigate the complexities of drug delivery innovation.",
    "logo": "/logos/medium/missing.png",
    "social_links": [
        "https://www.crunchbase.com/organization/avro-life-science"
    ]
}