{
    "Links": "https://www.ycombinator.com/companies/awen",
    "Name": "awen",
    "Headline": "We are rebuilding photoshop with an AI-voice interface.",
    "Batch": "W25",
    "Description": "Instead of navigating complex menus or learning new tools, creatives can simply describe their vision in natural language—“Draw me a Swiss mountain lake. Now make it sunset. Add a boat. Now animate it.”\r\n\nAwen leverages AI reasoning to understand creative intent through voice. Our goal is to redefine how creatives engage with AI technology, balancing power and ease of use for both professionals and newcomers.",
    "Activity_Status": "Active",
    "Website": "https://www.awen.ai/",
    "Founded_Date": "2023",
    "Team_Size": "3",
    "Location": "",
    "Group_Partner_YC": "https://www.ycombinator.com/people/tom-blomfield",
    "Group_Partner": "Tom Blomfield",
    "Company_Linkedin": "https://www.linkedin.com/company/awen-ai",
    "Company_Twitter": "",
    "Tags": "industry:generative-ai; industry:saas; industry:creator-economy",
    "social_links": [
        "https://www.linkedin.com/company/awen-ai",
        "https://x.com/awen_ai"
    ],
    "logo_path": "data\\logos\\awen.png",
    "Active_Founders": [
        {
            "Name": "Thibault Henriet, Founder",
            "Description": "Founder at awen. Previously served as Head of Operations France at Moda Operandi, a fashion tech scale-up, overseeing creative operations. Prior, worked as an assistant for contemporary artists, supporting artwork production and managing commissions across advertising, cinema, design, fashion, music, and publishing industries. At 21, received the prestigious O1 visa in visual arts. Alumnus of Sciences Po Paris.",
            "LinkedIn": "https://linkedin.com/in/thibault-henriet-595a5860"
        }
    ],
    "crawl_status": true,
    "generated_description": "**Company Overview: Awen**\n\nAwen is on a quest to redefine creativity in the digital space. Founded in 2023 as part of Y Combinator's Batch W25, Awen is essentially rebuilding Photoshop—but with a twist: an AI-powered voice interface. Imagine sketching your creative visions not through clicks and complicated menus, but simply by speaking. You could say, “Draw me a Swiss mountain lake. Now make it sunset. Add a boat. Now animate it,” and voilà, your ideas come to life. \n\nWith a lean team of three, Awen seeks to democratize creativity, making complex design accessible to everyone—from seasoned professionals to newcomers. Their approach balances power with simplicity, letting users express their creative intent without the steep learning curve typically associated with graphic design tools.\n\n**Key Information:**\n- **Website:** [awen.ai](https://www.awen.ai/)\n- **Founded:** 2023\n- **Location:** (Not specified, but it’s part of Y Combinator)\n- **Team Size:** 3 Employees\n- **Backed by:** Y Combinator\n- **Focus Areas:** Generative AI, SaaS, Creator Economy\n- **Group Partner:** Tom Blomfield\n\n**Mission Statement:**  \nAwen is committed to redefining how creatives engage with AI technology through a natural, intuitive voice interface.\n\nThe future of creative design may be in your voice, and Awen is poised to lead the charge. With a mantra that encourages you to just say what you want to see, they're making the creative process as simple as conversation itself. \n\nInterested? You can connect with Awen on [LinkedIn](https://www.awen.ai/<https:/www.linkedin.com/company/awen-ai/>) or [Twitter](https://www.awen.ai/<https:/twitter.com/awen_ai>), or even drop them a line at thibault@awen.ai. Join a community that is revolutionizing the way we bring our ideas to life!"
}