{
    "links": "https://www.ycombinator.com/companies/backpack",
    "name": "Backpack",
    "headline": "Marketplace to get stuff from overseas",
    "batch": "S14",
    "description": "Shopping? Buy overseas. \nTraveling? Earn some extra cash.\nLet backpack help you save that high shipping cost or earn a little extra.\n\nBackpack is a peer-to-peer platform that connects travelers and shoppers to give people access to products across markets in all continents. \nEach backpacker, regardless of their role as a carrier or a shopper, follows a simple four-step process to either earn or save money from their backpacking experience.\nTravelers share their travel information and specify what kind of items they want to carry. Then they wait to get a \"backpack request\" and ask their price. Finally, they confirm the deal, buy the items, deliver them and earn money. Shoppers on the other hand, search items from their favorite websites and fill out the item description. Then they give their location and find a traveler coming to their city. Finally they \"request backpack\" and confirm the deal. Within days they can get the product and save money.  \n\nbackpack is founded with a vision to provide every citizen of the world with a choice; the choice of buying organic, authentic, and cost effective products with minimum friction.\nWhether the product is state-of-the-art consumer electronics, exotic pashmina from the south-east, or even medication that are rare in some parts of the world and not so rare in others - we promise ourselves to get those products to your doorsteps. We would like to reject the counterfeits, we would like to reject the almost-originals, most importantly, we would like to not pay the heavy expense incurred, most of which we deem to be superfluous. Help us make a better, more original globalized world.",
    "activity_status": "Active",
    "website": "http://backpackbang.com",
    "founded_date": null,
    "team_size": 2.0,
    "location": "San Francisco",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:marketplace; industry:international; location:san-francisco-bay-area",
    "founders": [],
    "status": true,
    "generated_description": "**Backpack: Simplifying Global Shopping**\n\nBackpack is a fresh concept in the realm of e-commerce, designed to connect shoppers and travelers globally. Founded during the Y Combinator Batch S14 and based out of San Francisco, Backpack embarks on a mission to make international shopping more accessible and cost-effective. \n\n### What's the Idea?\n\nIf you've ever found yourself longing for a product available overseas but deterred by steep shipping costs, here's where Backpack comes in as a game changer. The platform facilitates a peer-to-peer marketplace where travelers earn by carrying items from one locale to another. It transforms the age-old notion of shipping into a community-driven model.\n\n### How It Works\n\nFor **travelers**: You share your travel itinerary, indicate what items you'd be willing to carry, wait for a shopper's request, negotiate the price, and deliver the goods—all while earning some extra cash along the way.\n\nFor **shoppers**: You browse your favorite sites, submit item requests by filling out details, and then find a traveler headed your way. It’s a straightforward process designed to make cross-border shopping not just possible, but efficient. With just a few clicks, you save on shipping and gain access to products that might be scarce or overpriced in your own country.\n\n### The Goals\n\nBackpack aspires to empower everyone across the globe by giving them the choice to buy authentic and affordable products without the hassle of counterfeit goods and exorbitant shipping fees. It caters to diverse markets—from unique electronics to rare pashminas and even specialized medications—ensuring that everyone has a fair shot at the best the world has to offer.\n\n### Why Choose Backpack?\n\n- **100% Original Products**: Say goodbye to knock-offs—Backpack promises genuineness.\n- **Easy Returns**: The user experience is seamless, including returns.\n- **Global Reach**: Connect with travelers and shoppers worldwide, creating a bustling marketplace across continents.\n\nIn a nutshell, Backpack is about making the world a smaller place, enabling a better globalized market where high quality doesn’t have to come with high costs. Check them out at [backpackbang.com](http://backpackbang.com) and explore the possibilities of your next internationally-sourced purchase! \n\nWith just two employees on the ground, the ambition is already global. If you have a wanderlust spirit and a knack for products that travel well, or if you're just keen to snag a deal internationally, Backpack is poised to revolutionize how we think about shopping across borders.",
    "logo": "/logos/medium/missing.png",
    "social_links": [
        "https://www.crunchbase.com/organization/backpack"
    ]
}