{
    "links": "https://www.ycombinator.com/companies/balance",
    "name": "Balance",
    "headline": "The first digital payment experience company, built for B2B.",
    "batch": "S20",
    "description": "Balance is the easiest way for B2B marketplaces, merchants, and service providers to process payments online. We raised our last funding round from Lightspeed, Stripe, and Max Levchin to build 'Stripe for B2B'. Balance offers the first business checkout, enabling business customers to pay How they want (check, card, bank) and When they want (net terms, payment plans, invoice payments). this is achieved while the seller receives the funds instantly and easily like card payment.",
    "activity_status": "Active",
    "website": "https://www.getbalance.com",
    "founded_date": 2020.0,
    "team_size": 70.0,
    "location": "San Francisco",
    "group_partner": "Dalton Caldwell",
    "group_partner_yc": "https://www.ycombinator.com/people/dalton-caldwell",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:payments; industry:b2b; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Bar Geron, Founder",
            "description": "Part philosopher part industrial engineer.\nFintech&Healthcare IT founder.",
            "linkedin": "https://www.linkedin.com/in/bar-geron-76b87270"
        },
        {
            "name": "Yoni Shuster, Founder",
            "description": "Scientist at heart and a father of two. Founder of Balance, where I'm reinventing the B2B online purchase journey.",
            "linkedin": "https://www.linkedin.com/in/yoni-shuster/"
        }
    ],
    "status": true,
    "generated_description": "**Company Overview: Balance**\n\nFounded in 2020 and based in San Francisco, Balance has quickly positioned itself as a leading player in the digital payment space for B2B transactions. The company is part of Y Combinator's Summer 2020 batch, and since then, it has successfully captured attention and capital, raising significant funding from well-respected investors, including Lightspeed, Stripe, and Max Levchin. The vision is bold: to create the \"Stripe for B2B\".\n\n**Mission and Offerings**\n\nBalance’s mission is clear: to provide the easiest digital payment experience specifically tailored for B2B marketplaces, merchants, and service providers. They have developed a comprehensive suite of tools that allows businesses to accept payments in various forms (checks, cards, bank transfers) and on flexible terms (net terms, payment plans, and invoicing). This flexibility is revolutionary because it allows sellers to receive funds instantly, replicating the quick turnaround of card payments.\n\nTheir offerings include:\n- **B2B Payments**: A robust platform for processing business transactions.\n- **Digital Trade Credit**: Innovations in financing that enable businesses to extend credit terms comfortably.\n- **Marketplace OS**: A solution designed to support marketplaces in facilitating transactions.\n- **AR Management**: Tools to streamline accounts receivable processes and enhance cash flow.\n- **Integrations**: APIs that ensure seamless connectivity with existing systems.\n\n**Target Audience and Use Cases**\n\nBalance serves a diverse range of customers in the B2B space. Their solutions are particularly beneficial for:\n- **Distributors** looking to enhance their transaction workflows.\n- **Platforms and Marketplaces** that require tailored payment solutions.\n- Specific teams within organizations like Finance, E-commerce, Business Leadership, and Tech get specialized tools to drive growth and improve efficiency.\n\n**Results and Impact**\n\nThe impact of using Balance's platform is quantifiable. Customers report average revenue growth of 120% after implementation. The approval process for credit limits is impressively quick, usually taking less than 30 seconds. Furthermore, businesses can reduce their processing costs by up to 200 basis points.\n\n**Reputation and Trust**\n\nBalance is trusted by high-profile brands and distributors across various industries, such as CDW, Office Depot, and Vallourec. These partnerships affirm Balance's capability to scale businesses' sales channels effectively and underscore the product’s flexibility in adapting to diverse business processes.\n\n**Resources and Community**\n\nBalance is more than just a payment provider; they actively support the B2B community with insightful guides, webinars, and case studies designed to educate and empower businesses in optimizing their payment strategies. Their resources delve into essential topics, such as the strategic roles of payments in digital transformation and essential checklists for net terms.\n\n**Conclusion**\n\nTo wrap it up, Balance is not merely a payment processor; it’s a catalyst for digital transformation in the B2B space. By empowering businesses with the tools they need to transact seamlessly, Balance is reshaping how companies interact, complete sales, and grow their operations, making them one to watch in the evolving financial technology landscape. Want to learn more? Check out their [website](https://www.getbalance.com)!",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/11f90a202cf3b12cc3348b1ac65b60e7795c2a07.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191017Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=b3804239cc0e959438599bbce4e5b00f357091201f1b20f1d45fc6431a1f64dd",
    "social_links": [
        "https://www.linkedin.com/company/getbalance",
        "https://twitter.com/GetBalanceHQ",
        "https://www.crunchbase.com/organization/balance-98c2"
    ],
    "logo_path": "data/logos\\Balance_logo.png"
}