{
    "links": "https://www.ycombinator.com/companies/bayes-impact",
    "name": "Bayes Impact",
    "headline": "Tech nonprofit building the future of public services.",
    "batch": "S14",
    "description": "Bayes Impact's mission is to change the world through algorithms. We solve pressing public interest problems by building technology solutions that leverage data to improve outcomes on a large scale.\r\n\nMore information at www.bayesimpact.org",
    "activity_status": "Active",
    "website": "http://bayesimpact.org",
    "founded_date": null,
    "team_size": 11.0,
    "location": "San Francisco",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:nonprofit; location:san-francisco-bay-area",
    "founders": [],
    "status": true,
    "generated_description": "**Bayes Impact: Using Tech for Good in Public Services**\n\nBayes Impact is a nonprofit organization based in San Francisco that emerged from the desire to transform public services through the power of technology. Founded in 2014 and part of Y Combinator's S14 batch, Bayes Impact’s mission is straightforward yet profound: to change the world for the better using data-driven solutions. \n\nAt the core of their approach is the idea of \"Citizen-Led Public Services.\" They harness cutting-edge technology to tackle pressing social issues, directly empowering citizens in the process. Their flagship tool, **CaseAI**, exemplifies this mission. It’s an AI-driven platform designed to revolutionize how social services are delivered. By generating care plans, streamlining workflows, and suggesting critical resources, CaseAI allows social service providers to focus more on their beneficiaries and less on administrative tasks.\n\nNumbers don’t lie: Bayes Impact has helped over **5 million beneficiaries** and saved social workers more than **100,000 hours** of work. Feedback from users has been overwhelmingly positive; they report significant time savings and improved effectiveness in their roles.\n\nBayes Impact partners with an array of organizations, leveraging collective resources to amplify their impact. They work closely with entities like Google Org, France Travail, and the Direction Interministérielle du Numérique, among others, to enhance their offerings and reach.\n\nWith a small but dedicated team of 11 employees, Bayes Impact is a testament to how technology can be harnessed for social good in meaningful ways. They invite anyone interested in learning more or getting involved to visit their [website](http://bayesimpact.org).\n\nIn a world where data can often feel misaligned with humanity, Bayes Impact is sculpting a future where technology serves the needs of people. It’s a vision worth supporting.",
    "logo": "/logos/medium/missing.png",
    "social_links": [
        "https://twitter.com/bayesimpact",
        "https://www.crunchbase.com/organization/bayes-impact",
        "https://github.com/bayesimpact"
    ]
}