{
    "links": "https://www.ycombinator.com/companies/bby",
    "name": "BBy",
    "headline": "BBy powders breast milk that's immunologically active & lasts 6 months",
    "batch": "W22",
    "description": "BBy's condensing device turns milk into a fine powder that spares the biome leaving it biologically and immunologically active. This allows  hospitals to stop wasting precious nursing time defrosting milk for hours and milk wastage from discarding rules. Simply weigh the powder, add water, shake and serve. No more freezing, no more defrosting, only patient care. NICUs are time sensitive wards in the hospital, time is everything and yet nurses today continue to prepare frozen milk for infants in what's known as the milk shift. A shift where the nurse spends the day defrosting milk for the next shift of nurses. Our tech is now fully peer reviewed and published, yielding safe and reliable results in over 20 hospitals in the New York Tri-State. The company is headed by Vansh Langer MD, a physician (Windsor University, University of Chicago) and Blanca Aguilar Uscanga PhD, a Bioengineering/Food Science PhD (University of Guadalajara /Centro Universitario de Ciencias Exactas e Ingenierías (CUCEI)) team that has over 50 published works in the field between them and are experts in the science of infant nutrition. Vansh saw the immense need for a time critical solution in the NICU and helped solve the puzzle with Dra. Blanca and her team and decided to work together to: Nurture the Future.",
    "activity_status": "Active",
    "website": "http://www.bbymilk.com",
    "founded_date": 2017.0,
    "team_size": 7.0,
    "location": "New York",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:health-tech; industry:medical-devices; industry:healthcare; location:new-york",
    "founders": [
        {
            "name": "Vansh Langer, Founder",
            "description": "Hi! I'm Vee, a physician from Albany, NY with a passion for helping infants and the next generation of world changers. I started BBy when I was still at the University of Chicago and saw the horrifically sad image of sick infants. This lead me to learn about what was wrong with modern NICUs and a desire to fix them. Looking forward to meeting and connecting!",
            "linkedin": "https://www.linkedin.com/in/vansh-langer-md/"
        }
    ],
    "status": true,
    "generated_description": "**Company Overview: BBy**\n\nBBy is a forward-thinking health-tech startup based in New York, focused on revolutionizing the way hospitals manage breast milk for the most vulnerable patients—newborns in neonatal intensive care units (NICUs). Founded in 2017 and part of Y Combinator’s Batch W22, BBy introduces an innovative condensing technology that transforms breast milk into a fine powder, preserving its immunological properties and extending its shelf life to six months.\n\n**Mission and Vision**\n\nThe mission of BBy is straightforward yet critical: to improve infant nutrition by providing hospitals with an easy solution to store, manage, and administer breast milk without the hassle of freezing and defrosting, which can consume valuable nursing time. The goal is to \"Nurture the Future\" of infant care. \n\n**The Technology**\n\nAt the heart of BBy’s innovation is a condensing device that efficiently removes unbound water from breast milk, allowing it to be reconstituted simply by adding water. This means hospitals no longer need large freezers, which not only saves energy but also gives nurses more time to focus on patient care. The process is safe, fully peer-reviewed, and already yielding positive results across over 20 hospitals in the New York Tri-State area.\n\n**Team and Expertise**\n\nBBy is spearheaded by Dr. Vansh Langer, a physician with a rich academic background, coupled with Dr. Blanca Aguilar Uscanga, a bioengineering and food science PhD. Together, they bring a wealth of expertise in infant nutrition, with more than 50 published works in their respective fields.\n\n**Current Offerings and Impact**\n\nBBy’s technology addresses longstanding inefficiencies in NICUs. Here's how:\n1. **Condensed Milk**: The milk remains nutritionally equivalent to its liquid counterpart but is easier to store and administer.\n2. **Efficient Storage**: Milk is batched and sorted for quick access during nursing shifts, significantly reducing the risk of errors.\n3. **Cost Savings**: By eliminating the need to defrost, hospitals save time and reduce electricity costs.\n\n**Future Directions**\n\nAs the company looks forward, it continues to enhance its safety protocols, including measures for COVID-19. Their approach isn’t just about survival; it’s about thriving, fostering healthier outcomes for infants, which is the crux of BBy’s commitment to health care innovation.\n\nIn summary, BBy is transforming health care in the NICU with a focus on simplicity, efficiency, and improved patient outcomes. If you're interested in learning more about their journey and technology, visit [BBy's website](http://www.bbymilk.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/2a6b542ef83ecbc7a29879fff15d9b471d17741e.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191018Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=9ef4d0337eec316f44433a52f2166902cfed3c1741928d711b0b4bb8459781c1",
    "social_links": [
        "http://www.linkedin.com/bby",
        "http://www.twitter.com/bbycares",
        "http://www.facebook.com/bbycares"
    ],
    "logo_path": "data/logos\\BBy_logo.png"
}