{
    "links": "https://www.ycombinator.com/companies/beanstalk",
    "name": "Beanstalk",
    "headline": "Great tasting produce, farmed around the corner",
    "batch": "W18",
    "description": "Brothers, Michael and Jack, started Beanstalk as a solution to solve a local restaurant’s need for consistent, high-quality salad. In doing so, they created a vertical farming technology capable of growing lettuces, spinach, basil, carrots, lavender, and more.\r\n\nBeanstalk is at the nexus of industrial robotics, plant science, and the culinary arts. Our technology enables us to develop new products quickly, automate traditionally labor-intensive work, and connect consumers to fresh produce in ways not before seen.",
    "activity_status": "Active",
    "website": "http://beanstalk.farm",
    "founded_date": null,
    "team_size": 15.0,
    "location": "Washington, DC",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:food-service-robots-&-machines; industry:grocery; industry:vertical-farming",
    "founders": [
        {
            "name": "Jack Ross, Founder",
            "description": "Jack is a co-founder and the CTO of Beanstalk, a vertical farming start-up whose mission is to grow the world's consumption of fresh produce. He is a computer engineer from UVA. He loves building machines, writing software, and eating new foods. In 2018, Jack was awarded the STEM Catalyst Award by the Virginia Governor.",
            "linkedin": "https://www.linkedin.com/in/jacklross/"
        },
        {
            "name": "Mike Ross, Founder/CEO",
            "description": "Mike is Co-Founder and CEO of Beanstalk, a vertical farming start-up whose mission is to grow the world's consumption of fresh produce. Before starting Beanstalk with his brother, Mike worked as a consultant for Fortune 100s and federal agencies where he architected, developed, and sold enterprise software, ranging from e-commerce platforms to AI-based recommendation systems. Mike holds a bachelor's degree in Aerospace Engineering from Georgia Tech specializing in advanced rotorcraft propulsion.",
            "linkedin": "https://www.linkedin.com/in/mross9/"
        }
    ],
    "status": true,
    "generated_description": "**Beanstalk: Fresh Solutions for a Healthier Plate**\n\nAt Beanstalk, the mission is clear: to provide great-tasting produce that's farmed right around the corner. This innovative venture started with brothers Michael and Jack, who identified a need for consistent, high-quality salad ingredients for local restaurants. In response, they developed a groundbreaking vertical farming technology. This technology doesn’t just produce lettuces, spinach, and basil—it promises fresh carrots and lavender too, all cultivated indoors. \n\nNestled in Washington, DC, Beanstalk thrives at the intersection of industrial robotics, plant science, and culinary arts. Their unique approach allows rapid development of new products while automating labor-intensive tasks. This means they can deliver fresh produce to consumers like never before. Thanks to heirloom seeds sourced from around the globe and a focus on taste and nutrition, Beanstalk aims to redefine the local food landscape.\n\n**Why They Do It:**\nEating fresh produce is vital for a healthier lifestyle. It enhances exercise, improves sleep, boosts brain function, and contributes to emotional well-being. Recognizing the challenges of the modern food system, Beanstalk was born out of a desire to create a reliable and sustainable source of fresh food. By combining engineering with agriculture, they’ve given consumers an alternative that not only tastes great but is also good for their health.\n\n**Products and Partners:**\nCurrently, Beanstalk offers a range of products like baby spinach, Italian arugula, and their unique “Super Mix”—a flavorful blend that's tough to find elsewhere. They’ve partnered with notable names such as Harris Teeter and Millie's DC, pushing to get their fresh greens onto more plates throughout the Mid-Atlantic region.\n\nWith a compact team of 15 and as a proud member of Y Combinator's Batch W18, Beanstalk is quickly scaling up its operations, aiming to produce a million pounds of fresh produce annually. They’re expanding their footprint, with plans to take orders for 2025 already in the pipeline. \n\nIf you’re interested in fresh, local produce that balances taste with sustainability, Beanstalk is paving the way. Check them out at [beanstalk.farm](http://beanstalk.farm) and see how fresh flavor can come from the farm. \n\nIn essence, Beanstalk isn’t just about growing food; it's about nurturing a healthier community and creating a new food system based on freshness and sustainability.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/b5d358516788dd9a32a932cb81d2398ef78cfca4.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191019Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=1c2cb22ba2ad0ccd254abdbc9bc0ab47078c8605e520e7b1c02eca030e08da4d",
    "social_links": [
        "https://www.linkedin.com/company/beanstalk-inc/about/",
        "https://www.crunchbase.com/organization/beanstalk-16c1"
    ],
    "logo_path": "data/logos\\Beanstalk_logo.png"
}