{
    "links": "https://www.ycombinator.com/companies/beebettor",
    "name": "BeeBettor",
    "headline": "Robinhood for sports betting",
    "batch": "S24",
    "description": "BeeBettor makes sports betting simple. Currently, sports bettors download more than 40 sports betting apps to get the full experience. At each one, they must go through a long KYC process. Then once their 40 accounts are active and funded, finding the best price is a painstaking process involving third-party tools to search available offers. BeeBettor aggregates all these accounts into one app and automatically gives sports bettors the best price.",
    "activity_status": "Active",
    "website": "https://beebettor.com",
    "founded_date": 2024.0,
    "team_size": 2.0,
    "location": null,
    "group_partner": "Brad Flora",
    "group_partner_yc": "https://www.ycombinator.com/people/brad-flora",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": null,
    "founders": [
        {
            "name": "Jordan Murphy, Founder",
            "description": "Jordan is the founder and CEO of BeeBettor. He’s been studying and playing sports his whole life. Putting his math degree from University of Waterloo to good use, he developed sports betting strategies that got him banned from betting. He was then able to automate these strategies and turn them into the first version of BeeBettor.",
            "linkedin": "https://linkedin.com/in/jordan-murphy-645319178"
        },
        {
            "name": "Matthew Wolfe, Founder",
            "description": "Matthew is the founder and CTO of BeeBettor. He has experience working as a software engineer at Uber and Meta. Matthew has been betting on sports for years, using his skills as a software engineer to automate his strategies, which eventually evolved into BeeBettor.",
            "linkedin": "https://www.linkedin.com/in/mathyou-wolfe"
        }
    ],
    "status": true,
    "generated_description": "### BeeBettor: Simplifying Sports Betting \n\n**Overview**  \nFounded in 2024 and part of Y Combinator Batch S24, BeeBettor aims to democratize sports betting—essentially, it’s the Robinhood for bettors. The company’s mission centers around making sports betting simpler and more efficient for users. Instead of downloading and juggling over 40 different sports betting apps, which is the current norm, BeeBettor aggregates these into a single app. This means no more frustrating KYC (Know Your Customer) processes for every account and significantly less hassle in finding the best odds.\n\n**What They Do**  \nThe BeeBettor platform allows users to connect various betting accounts and automatically finds the best prices for the wagers they want to place. This functionality saves users time and effort by eliminating the painstaking need to check multiple apps individually. It’s a blend of convenience and savvy—offering features like custom sportsbook weightings, tracking of sports betting strategies, and notifications for optimal betting opportunities.\n\n**Current Status**  \nWith just a small team of two, including Group Partner Brad Flora, BeeBettor is a lean startup making big plans. The company’s offerings include tools for tracking bets, monitoring odds across 20+ different sportsbooks, and access to line movement charts. They’re keen on helping bettors make informed decisions without unnecessary clutter.\n\n**How to Get Involved**  \nBeeBettor is positioned not just as a tool, but as part of a community. Users can join their Discord for discussions and updates, enhancing the sense of community around sports betting strategies.\n\nTo explore more about BeeBettor, visit their [website](https://beebettor.com). They are set to make waves in the betting space; if you’ve ever felt overwhelmed by the options, this is a solution worth keeping an eye on. \n\nBeeBettor’s promise is not just about fun and games—it’s about empowering sports bettors with better tools and opportunities, aiming for a smarter way to play.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/0697cababeda1d1081cc42249e933ff01a9f6d9d.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191019Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=1cc3517c853b4a539be1052d6995c3872119fbd935186d176ef4257d8922bf51",
    "social_links": [
        "https://www.linkedin.com/company/beebettor",
        "https://x.com/BeeBettor"
    ],
    "logo_path": "data/logos\\BeeBettor_logo.png"
}