{
    "links": "https://www.ycombinator.com/companies/bensen",
    "name": "Bensen",
    "headline": "Online and phone ordering for restaurant takeout and delivery",
    "batch": "W19",
    "description": null,
    "activity_status": "Active",
    "website": "http://www.bensen.ai",
    "founded_date": null,
    "team_size": 2.0,
    "location": "Boston",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:marketplace; industry:delivery; industry:food-&-beverage; location:boston",
    "founders": [],
    "status": true,
    "generated_description": "**Company Overview: Bensen**\n\nBensen is a Boston-based startup that was born out of necessity in the food delivery and takeout sector. Operating under the name \"Texthood,\" the company provides online and text ordering solutions for restaurants, allowing them to streamline the takeout and delivery process without relying on costly third-party apps. Founded as part of the Y Combinator Batch W19, Bensen is on a mission to help restaurants maintain direct relationships with their customers, especially during challenging times when in-person dining isn't an option.\n\n**What They Do**\n\nBensen's innovative platform lets restaurant owners embed an order system directly into their own websites. This gives them full control over customer interactions and significantly cuts down on commission fees—up to ten times less expensive compared to traditional ordering apps. The simplicity of Bensen’s service means that customers can place orders through text messages, eliminating the need for a dedicated app. This approach not only reduces friction for customers, who can simply text their orders, but also frees up time for restaurant staff by automating responses.\n\n**Why It Matters**\n\nRestaurants have faced mounting pressure from commission-heavy delivery services, which have threatened their profitability. Bensen's solutions are geared towards empowering restaurant owners, allowing them to convert app users into direct customers. Quotes from restaurant owners, such as Chris from The Bucket and Alex from Coreanos, highlight the platform’s user-friendliness and how it has streamlined operations, proving beneficial for both staff and clientele.\n\n**The Team**\n\nWith a small but dedicated team of two, Bensen operates with an agile philosophy, focusing on delivering high-quality service to its restaurant partners.\n\n**Getting Involved**\n\nIf you own a restaurant and want to take back control of your ordering process, Bensen offers demos through their website. They encourage businesses to join their network to leverage the benefits of direct online and text ordering, thus paving the way for a more resilient business model. \n\n**In Summary**\n\nBensen is not just another tech startup; it's a lifeline for local restaurants navigating the modern marketplace. By prioritizing direct customer relationships and reducing operating costs, Bensen positions itself as an essential tool for food and beverage businesses in Boston and beyond. If you're in the restaurant industry, it might just be time to rethink how you handle takeout and delivery—and Bensen could be your answer. \n\nFor more information, visit [Bensen's website](http://www.bensen.ai).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/cdeffec02cb5dabb3e7568387dcc08b61cb7b0d2.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191020Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=38b560a602d0e366d246b8c4e1d274e11bd2bb82fef4e21b9b4535ad499f348e",
    "social_links": [
        "https://www.crunchbase.com/organization/bensen-ai"
    ],
    "logo_path": "data/logos\\Bensen_logo.png"
}