{
    "links": "https://www.ycombinator.com/companies/berry",
    "name": "Berry",
    "headline": "Scale customer success and onboarding with AI",
    "batch": "W23",
    "description": "Berry offers an AI CSM that scales customer success for SaaS companies.\r\n\nEvery post-sales organization faces the challenge of scaling customer success without having to hire more. Berry combines the best of the two worlds - taking the white-glove onboarding experience and offering it at scale. \r\n\nOur AI CSM onboards, trains and grows accounts for you non-stop. It’s a 10x hire to your team - at a fraction of the cost.",
    "activity_status": "Active",
    "website": "https://berryai.com/",
    "founded_date": 2023.0,
    "team_size": 8.0,
    "location": "San Francisco",
    "group_partner": "Michael Seibel",
    "group_partner_yc": "https://www.ycombinator.com/people/michael-seibel",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:artificial-intelligence; industry:generative-ai; industry:customer-success; industry:ai; industry:conversational-ai; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Yan Fu, Founder",
            "description": "15 years of experience in engineering leadership; a 3-time startup CTO; shipped Sony’s cloud products to hundreds of millions.",
            "linkedin": "https://www.linkedin.com/in/yanfu/"
        },
        {
            "name": "Ann Chan, Founder",
            "description": "Ann Chan is the Co-founder & CPO of Berry. Prior to Berry, Ann drove Facebook’s user growth  and was one of the first PMs that helped launched Meta's first smart AR glasses. She previously co-founded a grocery e-commerce startup and started her career as a UX designer. \n\nOriginally from Hong Kong, Ann studied Economics at University College London, before moving to the bay area.",
            "linkedin": "https://www.linkedin.com/in/annchanyt"
        }
    ],
    "status": true,
    "generated_description": "**Company Overview: Berry**\n\nFounded in 2023 and part of Y Combinator’s W23 Batch, Berry is a San Francisco-based startup that's tackling a common hiccup in the SaaS world—the challenge of scaling customer success and onboarding. With a lean team of eight and guidance from notable partner Michael Seibel, Berry is carving out its niche in the bustling landscape of artificial intelligence.\n\n**Mission Statement**\n\nBerry's mission is clear: to scale customer success and onboarding through AI. The core offer revolves around its AI Customer Success Manager (CSM), which effectively acts as an additional team member—one that’s always available, continuously learning, and capable of handling multiple onboarding processes simultaneously.\n\n**The Problem It Solves**\n\nIn the realm of post-sales organizations, growing customer success endeavors typically means hiring more staff. Berry shifts that paradigm by integrating a white-glove onboarding experience on a much larger scale. Their AI CSM automates the onboarding, training, and account growth processes, acting as a 10× hire without the hefty price tag that comes with human capital.\n\n**Features & Capabilities**\n- **Infinite Memory**: Retains extensive product knowledge, updating itself in seconds, ensuring it’s always at the top of its game.\n- **Human-Like Thinking**: Navigates customer inquiries and problem-solving sessions seamlessly, even when customers can’t clearly articulate their needs.\n- **Instant Strategy Implementation**: Quickly adopts new customer success strategies, pinpointing features to promote for higher user engagement.\n- **24/7 Availability**: Unlike a human employee, Berry never sleeps, always available to assist customers when they need it.\n- **Co-Pilot for Customer Success Managers**: Enhances human efforts by streamlining workflows and helping in customer interactions.\n\n**Customer Journey Transformation**\n\nBerry proposes a vision where a fleet of AI assistants, equipped with top-tier onboarding and training capabilities, can serve any customer—large or small. This allows human CSMs to focus on what they do best: building meaningful relationships, rather than getting bogged down by routine operational tasks.\n\n**Integrations and Security**\n\nBerry ensures compatibility with existing GTM tech stacks, including platforms like Salesforce, HubSpot, and Zendesk, allowing for seamless enrichment of the customer journey. Furthermore, with enterprise-ready features and a commitment to security and data privacy, it’s designed to align with the standards set by larger organizations.\n\n**In Conclusion**\n\nBerry is not just another AI tool; it’s a pivotal player aiming to revolutionize the way SaaS companies approach customer success and onboarding. Their approach marries cutting-edge technology with an empathetic understanding of what customer success means—helping companies do more, with less fuss. If you’re looking to level up your post-sales team, Berry might just be the AI partner you need. To explore more, check out their [website](https://berryai.com/).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/604cbd2f934ec861340b0dd15c572f592b0b8977.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191020Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=7c8d380bf58ae5b3fd512d988f749300032668152b3d15a5e9a11ca482089d7b",
    "social_links": [
        "https://www.linkedin.com/company/berryhq/",
        "https://twitter.com/berryapphq"
    ],
    "logo_path": "data/logos\\Berry_logo.png"
}