{
    "links": "https://www.ycombinator.com/companies/betterhalf",
    "name": "Betterhalf",
    "headline": "Indiaâ\u0080\u0099s first and only marriage super app",
    "batch": "W21",
    "description": "Betterhalf is India's first and only matrimony app without parents.\r\n\nWe are the first and only marriage super app in India offering end-to-end matrimony and wedding products to urban Indians, who are the primary decision makers for their marriage and wedding decisions, unlike their parents who were in the driver's seat a decade ago.\r\n\nOur ecosystem of products on marriage - matchmaking, courtship and wedding in one super app - and focused on the correct audience - high income, higher age urban working professionals of India who are located in 30 tier-1 cities of India makes Betterhalf product a winning combination. \r\n\nOur flagship product - matrimonial matchmaking - offers these users the world's fastest matching in a single click (US Patent No. 16/777,773). This matching technology is faster than Tinder and more accurate than eHarmony / Shaadi.com.",
    "activity_status": "Active",
    "website": "https://betterhalf.ai",
    "founded_date": 2016.0,
    "team_size": 25.0,
    "location": "Bengaluru, India",
    "group_partner": "Brad Flora",
    "group_partner_yc": "https://www.ycombinator.com/people/brad-flora",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:dating; industry:india",
    "founders": [
        {
            "name": "Pawan Gupta, Founder",
            "description": "Co-founder and CEO of Betterhalf.ai. MIT Sloan Alumni, graduated in 2015\n\nHe graduated from MIT Sloan School of Management and earlier co-founded/ led an ed-tech software company to profitability. \n\nInvented the worldâ\u0080\u0099s fastest single matching (US Patent Application No. 16/777,773) along with his Co-founder, Rahul.\n\nWinner of 40 under 40 Data Scientists in India by Analytics India Magazine for the year 2019.",
            "linkedin": "https://www.linkedin.com/in/pguptasloan/"
        },
        {
            "name": "Rahul Kumar Namdev, Founder",
            "description": "Cofounder and CTO at Betterhalf.ai. MIT EECS Alumni, graduated in 2015.\n\nWinner of \"Touch of Genius Prize for Innovation April-2015\" for excellent contribution in the area of Braille literacy by building a STEM Learning platform for blind people.\n\nWinner of most innovative research work in PETRA 2015 conference in the area of blind literacy.\n\nGold Medalist from graduating Electronics and Communication dual degree (B.Tech+MS) batch in 2011.",
            "linkedin": "https://www.linkedin.com/in/rahulnamdev/"
        }
    ],
    "status": true,
    "generated_description": "**Betterhalf: Redefining Matrimony in India**\n\nBetterhalf is a pioneering force in the Indian wedding and matrimony space, known as India's \"first and only marriage super app.\" Founded in 2016 and based in Bengaluru, it emerged from the need for modern matchmaking tailored to the urban Indian demographic, especially those who wish to take control of their marriage decisions and don’t want their parents to be the primary decision-makers.\n\n**The Evolution of Matrimony** \n\nBetterhalf flips the traditional approach to matchmaking on its head. While past generations might have relied heavily on parental supervision and input during the marriage process, Betterhalf caters directly to urban professionals aged 21-35 who are active players in their marriage planning. This shift is reflected in their tagline, emphasizing a platform designed for the new age.\n\n**Core Offerings**\n\nThe standout feature of Betterhalf is its advanced matchmaking service, which boasts the fastest pairing technology in the world—patented and quicker than even Tinder. This assures users that they are not just getting unmatched speed but also accuracy that surpasses other platforms like eHarmony and Shaadi.com. \n\nApart from matchmaking, Betterhalf organizes its extensive offerings into an ecosystem that includes:\n- **Wedding Planning Services**: Personalized proposals for venues, decor, catering, and photography.\n- **Vendor Booking**: Partnered with over 28,000 venue options across 30 tier-1 cities in India.\n- **Curated Wedding Ideas**: With over 10,000 ideas available for brides and grooms to enhance their wedding experience.\n\n**User Experience**\n\nEngagement with the Betterhalf app is straightforward, leading users through a three-step process to book their wedding services seamlessly. This includes sharing specific requirements, receiving personalized proposals, and finally securing deals efficiently, all while enjoying a stress-free wedding planning experience.\n\n**Trust and Excellence**\n\nSince its inception, Betterhalf has organized over 1,043 weddings and boasts a commendable rating of 4.8 out of 5 on Google. Customer testimonials remark on the ease and joy of using their services, highlighting their professionalism and attention to detail.\n\n**Team and Growth**\n\nBetterhalf is a compact team of just 25 employees, led by experienced professionals including Group Partner, Brad Flora. It operates efficiently while extending a vast network of services, allowing them to cater effectively to the growing Indian wedding market.\n\n**The Future**\n\nAs the need for modern and sophisticated wedding solutions continues to grow among urban professionals, Betterhalf's position as India's marquee marriage app looks solid. By combining cutting-edge technology with a deep understanding of user needs, Betterhalf is poised to lead the matrimony revolution in India.\n\nTo learn more, visit [Betterhalf](https://betterhalf.ai).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/04fb332e4e909893f0f7678e28c43e8c9ff1481d.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191021Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=4c3009206f4ddd8a73b14aa7d90500d93240d8dd0e47ad4eb7bca51aa9588c76",
    "social_links": [
        "https://www.linkedin.com/company/betterhalf",
        "https://twitter.com/betterhalfai",
        "https://www.facebook.com/BetterHalfai",
        "https://www.crunchbase.com/organization/betterhalf"
    ],
    "logo_path": "data/logos\\Betterhalf_logo.png"
}