{
    "links": "https://www.ycombinator.com/companies/billiontoone",
    "name": "BillionToOne",
    "headline": "The genetic testing platform detecting and measuring disease.",
    "batch": "S17",
    "description": "BillionToOne has developed a DNA molecular counter that increases the cell-free DNA diagnostics resolution by over 1,000 fold, which unlocks transformative improvements in prenatal screening and liquid biopsy for cancers. Unity Screen, BillionToOne's commercially available non-invasive prenatal test (NIPT), is the only NIPT that can assess fetal risk for both recessive conditions and aneuploidies from maternal blood. UNITY Screen continues to grow exponentially and is on its path to becoming the next standard-of-care, with an increasing number of publications showing its accuracy and advantages over other screening methods. We have also recently used our molecular counting technology to develop liquid biopsy tests, which have the potential to completely transform oncology care.",
    "activity_status": "Active",
    "website": "https://www.billiontoone.com",
    "founded_date": 2016.0,
    "team_size": 300.0,
    "location": "Menlo Park, CA",
    "group_partner": "Jared Friedman",
    "group_partner_yc": "https://www.ycombinator.com/people/jared-friedman",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:diagnostics; industry:genomics; location:san-francisco-bay-area",
    "founders": [],
    "status": true,
    "generated_description": "**BillionToOne: A Transformative Force in Genetic Diagnostics**\n\nFounded in 2016 as part of Y Combinator’s Batch S17, BillionToOne is based in Menlo Park, California, and has grown into a powerhouse in genetic testing, boasting a skilled team of 300. Its mission? To leverage the power of molecular diagnostics to detect and measure diseases—one molecule at a time.\n\nAt the core of BillionToOne's innovation is its groundbreaking DNA molecular counter, which amplifies the resolution of cell-free DNA diagnostics by over 1,000 times. This leap in technology is not just impressive engineering; it unlocks new potential in areas like prenatal screening and oncology, promising more accurate and detailed insights for critical medical decisions. \n\nTheir flagship product, the **UNITY Screen**, is a non-invasive prenatal test (NIPT) that uniquely assesses fetal risks for both recessive conditions and aneuploidies using merely a maternal blood sample—no paternal sample required. This is a game-changer in prenatal care, and the growing number of studies endorsing its accuracy suggests it's well on its way to becoming the new standard of care.\n\nBillionToOne isn’t stopping there. They’re applying their molecular counting technology to develop innovative liquid biopsy tests aimed at revolutionizing cancer care. Their oncology tests, like **Northstar Select™** and **Northstar Response™**, are already being used commercially to tailor treatment options and monitor their effectiveness.\n\nLed by co-founders Oguzhan Atay, Ph.D., and David Tsao, Ph.D., BillionToOne thrives on a culture of teamwork and innovation. Employees report a strong sense of community and purpose, which is crucial when you consider the life-altering impact of their work on patients and families.\n\nIn a rapidly expanding sector focused on diagnostics and genomics, BillionToOne stands out not just for its technology but also for a robust growth trajectory, reporting over 100% revenue growth year-over-year. They’re recognized as a leader in the field, even earning the title of \"Diagnostics Company of the Year\" by BioTech Breakthrough Awards.\n\nUltimately, BillionToOne is pushing the boundaries of what’s possible in genetic diagnostics. With a clear mission and an innovative spirit, they’re not just detecting diseases—they're reshaping how we approach health care from the molecular level. If you're intrigued by the intersection of technology, healthcare, and impact, BillionToOne is a name to watch. \n\nFor more info, check out their website: [BillionToOne](https://www.billiontoone.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/411e7177e45d759e26421ddbdce656266edf14e6.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191023Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=237f1e99d5ec7712e8809cdac0e32d6cc2fc008fdc149d7459c831cfd8bc86d6",
    "social_links": [
        "https://www.linkedin.com/company/billiontoone/",
        "https://twitter.com/billiontooneinc?lang=en",
        "https://www.crunchbase.com/organization/billiontoone"
    ],
    "logo_path": "data/logos\\BillionToOne_logo.png"
}