{
    "links": "https://www.ycombinator.com/companies/bimaplan",
    "name": "Bimaplan",
    "headline": "Affordable insurance for the next billion Indians",
    "batch": "W21",
    "description": "Bimaplan is an affordable insurance platform for the next billion Indians.\r\n\nOur vision is to provide financial security to 150 million vulnerable households through contextual life and health insurance products. The growth in mobile penetration and the evolution of digital infrastructure in India has now made it possible to reach this vulnerable population. This is an $8 billion addressable market.\r\n\nWe launched in February 2021, and went live with one insurance underwriting partner. We are on track to sell 1,000 policies in March 2021. We are backed by some of the best early stage technology investors, successful fintech founders, and insurance industry veterans.\r\n\nThe company is founded by Vikul Goyal, a second-time founder with a successful exit track record. His previous venture, Carcrew, was acquired by TVS Group, a large automotive conglomerate in India.",
    "activity_status": "Active",
    "website": "https://www.bimaplan.co",
    "founded_date": 2020.0,
    "team_size": 30.0,
    "location": "Bengaluru, India",
    "group_partner": "Brad Flora",
    "group_partner_yc": "https://www.ycombinator.com/people/brad-flora",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:microinsurance",
    "founders": [
        {
            "name": "Vikul Goyal, Founder",
            "description": "Vikul is the founder of Bimaplan which is building an affordable insurance platform for the next billion Indians. His previous startup, Carcrew, an online marketplace for automobile spares and services, was recently acquired by TVS, a large auto conglomerate based in India. Previously, he worked as an Investment Professional at Bessemer Venture Partners and GSF Accelerator. Vikul has an MBA from Harvard Business School and has completed his undergrad in Mechanical Engineering from IIT Guwahati.",
            "linkedin": "https://www.linkedin.com/in/vikulgoyal/"
        }
    ],
    "status": true,
    "generated_description": "**Bimaplan: Affordable Insurance for the Next Billion Indians**\n\nFounded in 2020 and part of Y Combinator’s Winter 2021 batch, Bimaplan is on a mission to provide affordable insurance solutions tailored for India's underserved population. With the vision to deliver financial security to 150 million vulnerable households, Bimaplan focuses on contextual life and health insurance products. Given India's rapidly growing mobile penetration and digital infrastructure, the company sees a significant opportunity in an $8 billion market.\n\nLaunched in February 2021, Bimaplan quickly gained traction, aiming to sell 1,000 policies by March of the same year. They partnered with an insurance underwriting partner from the outset and are supported by a strong network of early-stage tech investors, successful fintech founders, and insurance veterans. \n\nBimaplan’s founder, Vikul Goyal, is a second-time entrepreneur whose prior venture, Carcrew, was acquired by the TVS Group, a notable automotive conglomerate in India. The company's base is in Bengaluru, where a dynamic team of 30 employees is helping to reshape the insurance landscape. With a talented group partner like Brad Flora guiding them, Bimaplan is well-positioned.\n\nAsserting its presence in the fintech and microinsurance sectors, Bimaplan is all about driving insurance adoption through technology. Their embedded insurance platform, UNO, allows partners to integrate insurance products seamlessly into their existing systems, enhancing customer experience and enabling better service engagement.\n\n**What They Offer:**\n1. **Customized Insurance Solutions:** Bimaplan enables partners to create tailored insurance products that cater to specific customer needs.\n2. **End-to-End Digital Process:** Clients can manage the entire customer lifecycle digitally, from policy issuance to payments, thereby increasing efficiency and reducing costs.\n3. **API Integration:** Their straightforward API kit facilitates easy insurance integration into partners’ platforms, allowing for instant policy issuance and digital payments.\n\nBimaplan isn’t just about making insurance more accessible; it’s about revolutionizing how people think about insurance by embedding it into daily life and making it understandable. With a clear focus on underserved populations, they are paving the way for financial inclusion in India.\n\nTo learn more about Bimaplan and the solutions they provide, visit their website: [Bimaplan](https://www.bimaplan.co).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/959c94c8958b60a96057ad6710cddb6b1e021c2e.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191023Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=2e5445a0ec1611516cf6c5bd83927ea28189e33293727b85cefeab34f867117a",
    "social_links": [
        "https://www.linkedin.com/company/bimaplan",
        "https://twitter.com/bima_insurance",
        "https://www.facebook.com/bimaplan",
        "https://github.com/bimaplan"
    ],
    "logo_path": "data/logos\\Bimaplan_logo.png"
}