{
    "links": "https://www.ycombinator.com/companies/biocogniv",
    "name": "Biocogniv",
    "headline": null,
    "batch": "S20",
    "description": null,
    "activity_status": "Active",
    "website": "http://biocogniv.com",
    "founded_date": 2019.0,
    "team_size": 6.0,
    "location": "Burlington, VT",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": null,
    "founders": [
        {
            "name": "Artur Adib, Founder",
            "description": "Former faculty at the National Institutes of Health (PhD in computational physics, 20+ peer-reviewed publications). Was VP Software Engineering at Beta Technologies (electric 'flying cars'), Twitter engineer (pre-IPO), and principal engineer at Magic Leap.",
            "linkedin": "https://www.linkedin.com/in/arturadib/"
        }
    ],
    "status": true,
    "generated_description": "**Biocogniv: Pioneering AI Diagnostics in Acute Care**\n\nFounded in 2019 and hailing from Burlington, Vermont, Biocogniv is an emerging player in the healthcare technology space. The company advanced through Y Combinator's Summer 2020 batch, and it operates with a lean, dedicated team of six employees.\n\n**Mission and Vision**\n\nBiocogniv's mission revolves around utilizing advanced artificial intelligence to enhance diagnostic capabilities, particularly in acute conditions. Each year, late diagnoses account for a staggering 700,000 patient deaths in U.S. hospitals; Biocogniv is tackling this issue head-on. Their innovative approach aims to help frontline healthcare providers recognize critical conditions before they escalate, thereby saving lives.\n\n**AI-Driven Solutions**\n\nAt the core of Biocogniv's offerings is their flagship product, Sepsis aiMarker™. This groundbreaking tool employs AI to predict sepsis up to 72 hours in advance using routine lab tests conducted in emergency settings. Recently, Biocogniv earned the FDA's Breakthrough Device designation for this product, underscoring its potential to transform acute care.\n\n**Proven Impact**\n\nBiocogniv is leveraging vast clinical databases and sophisticated AI algorithms to develop unprecedented real-world evidence. With over 16 million patient encounters and more than a billion lab results analyzed, the company is positioned to lead the next evolution in medical diagnostics, reducing reliance on costly clinical trials.\n\n**Accolades and Partnerships**\n\nThe company has achieved notable milestones, including maintaining ISO 13485:2016 certification, which is pivotal for companies involved in medical device manufacturing. Moreover, Biocogniv's efforts have been validated by leading figures in emergency medicine, evidencing their credibility in the industry. Testimonials highlight how the AI-based biomarkers developed by Biocogniv are on track to become integral to standard care in emergency departments.\n\n**Contact and Further Information**\n\nFor those interested in learning more about Biocogniv and its innovative solutions in AI diagnostics, you can visit [Biocogniv's website](http://biocogniv.com). The company is located at 50 Lakeside Ave., Suite 851, Burlington, VT 05401, and can be reached at +1 (802) 222-6973 or via email at contact@biocogniv.com.\n\nIn summary, Biocogniv is poised to revolutionize the acute care landscape by harnessing the power of AI to improve early diagnosis and treatment. Their commitment to innovation reflects a promising shift in how healthcare meets urgent patient needs.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/05f8f91fdb82bf191fc333b86d3237d7fb4eb7ab.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191023Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=d12a7cff5740c63964b522a3c65044edcdb066d5c29b6bbfafe24219de9159f4",
    "social_links": [
        "https://www.linkedin.com/company/biocogniv",
        "https://twitter.com/biocogniv"
    ],
    "logo_path": "data/logos\\Biocogniv_logo.png"
}