{
    "links": "https://www.ycombinator.com/companies/birch-biosciences",
    "name": "Birch Biosciences",
    "headline": "We recycle plastic using engineered enzymes",
    "batch": "S22",
    "description": "Birch Biosciences engineers enzymes for plastic recycling using synthetic biology and machine learning.  Our enzymes function as high performance “molecular scissors” that efficiently break down plastic polymers into chemical building blocks that can be used to manufacture high quality recycled plastic products.   Today, plastic manufacturing  is unsustainable and a major driver of climate change.   Birch Biosciences is developing an economical end-to-end plastic recycling process that reduces carbon emissions by 70% and enables a circular plastic economy.",
    "activity_status": "Active",
    "website": "http://www.birchbiosciences.com",
    "founded_date": 2021.0,
    "team_size": 10.0,
    "location": "Portland, OR",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:machine-learning; industry:synthetic-biology; industry:biotech; industry:climate; industry:climatetech",
    "founders": [
        {
            "name": "Johan Kers, Founder",
            "description": "Johan is co-founder and Chief Executive Officer of Birch Biosciences.  He has spent the last 15 years programming bacteria and genetic circuits to produce novel therapeutic proteins and other natural products at leading companies including Absci and Ginkgo Bioworks.  Johan is especially interested in solving major sustainability problems using biotechnology.   He holds a PhD from Cornell University and completed a postdoctoral fellowship at Stanford University School of Medicine.",
            "linkedin": "http://linkedin.com/in/johankers"
        }
    ],
    "status": true,
    "generated_description": "### Birch Biosciences Overview\n\n**Mission**: Birch Biosciences is on a mission to revolutionize plastic recycling through innovative enzyme technology. By harnessing the power of engineered enzymes, they recycle plastics into valuable raw materials, fostering a circular economy.\n\n**What They Do**: The company, founded in 2021 and part of Y Combinator's Batch S22, leverages synthetic biology and machine learning to create specialized enzymes that act like \"molecular scissors.\" These enzymes effectively break down plastic polymers into chemical building blocks, which can then be used to produce high-quality recycled plastic products. This not only enhances the quality of recycled materials but also significantly reduces carbon emissions—by approximately 70%—compared to traditional plastic manufacturing methods.\n\n**Location and Team**: Based in Portland, Oregon, Birch Biosciences operates with a dedicated team of ten employees, partnering with organizations like Nan in their journey towards sustainability.\n\n**The Problem They're Solving**: In an age where only 9% of plastics are recycled, Birch targets the inefficiencies of existing recycling methods. Currently, most recycled plastics are of inferior quality and cost more than virgin materials derived from fossil fuels. By developing a reliable, cost-effective recycling process, Birch aims to create a sustainable solution to the plastic crisis and combat climate change.\n\n**Technology**: Birch's recycling approach utilizes generative AI to enhance the performance of their enzymes, allowing for the transformation of plastic waste into new resources without the need for fossil fuels. This process not only matches the quality of newly manufactured plastics but also makes recycling economically viable.\n\n**Recent Achievements**: Birch Biosciences has garnered attention for its innovative work, recently securing a $1 million NSF SBIR Phase II award to further advance its enzymatic recycling technology. They also received recognition from DARPA for their efforts in AI-driven enzyme engineering.\n\n**Tags**: The company's focus areas include machine learning, synthetic biology, biotech, climate solutions, and climate technology.\n\n**Website**: For more information, you can visit their official site at [www.birchbiosciences.com](http://www.birchbiosciences.com).\n\nIn essence, Birch Biosciences is not just innovating in the biotech space; it is charting a path towards a more sustainable future by redefining how we think about and manage plastic waste.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/a7d511a00ff50ccfa221c08c225e1feae2ca39cb.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191023Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=f982a581a86ec0ac7af7f4c9312cef6be7f27d44716a2bccdf0321a7c1aeec48",
    "social_links": [
        "https://www.linkedin.com/company/birch-biosciences-llc",
        "https://twitter.com/BirchBiosci",
        "https://www.crunchbase.com/organization/birch-biosciences"
    ],
    "logo_path": "data/logos\\Birch_Biosciences_logo.png"
}