{
    "links": "https://www.ycombinator.com/companies/bitesight",
    "name": "BiteSight",
    "headline": "The video-first food delivery app. Imagine TikTok meets DoorDash.",
    "batch": "W24",
    "description": "BiteSight shows users videos of food we think they will love from nearby restaurants and delivers it right to their door. \r\n\nZac and Lucious studied together at UT Austin. Zac did CS and AI Research, and Lucious built his first $1M ARR product while moonlighting at a YC startup at age 19.\r\n\nSince launching the beta in February, BiteSight has onboarded 274 restaurants in SF, handled 211 orders, and users are growing more than 50% each week, all organically.\r\n\nUberEats and DoorDash have become cluttered and impersonal super apps. They've created a $30B opportunity for a delivery app that puts the customer experience first by combining high-quality videos, recommendations, and social proof from your most trusted food critics - your friends.",
    "activity_status": "Active",
    "website": "http://bitesight.com",
    "founded_date": 2023.0,
    "team_size": 2.0,
    "location": null,
    "group_partner": "Pete Koomen",
    "group_partner_yc": "https://www.ycombinator.com/people/pete-koomen",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": null,
    "founders": [
        {
            "name": "Lucious McDaniel IV, Founder",
            "description": "Lucious is the Co-founder & Chief Eating Officer of BiteSight.\n\nBefore BiteSight, Lucious built his first $1M ARR product while moonlighting at a YC company at 19 years old. Lucious also built a treasury management company focused on nonprofits and was an analyst at General Atlantic covering restaurant tech.",
            "linkedin": "https://linkedin.com/in/luciousiv"
        },
        {
            "name": "Zac Schulwolf, Founder",
            "description": "Chief Tasting Officer at BiteSight, UT Austin Turing Scholar '22, previously built random projects and conducted time-series transformer research during his masters, is probably wearing a restaurant t-shirt",
            "linkedin": "https://linkedin.com/in/zacschulwolf"
        }
    ],
    "status": true,
    "generated_description": "### BiteSight: Where Food Meets Fun\n\n**Concept Overview:**\nBiteSight is revolutionizing the food delivery experience by merging the visual delight of TikTok with the convenience of DoorDash. Imagine browsing through mouth-watering video snippets of your favorite dishes and ordering with just a tap – that’s what BiteSight offers. It’s not just about food; it's about making the dining experience more enjoyable and relatable.\n\n**Founders:**\nThe brains behind BiteSight are Zac and Lucious, who forged a strong partnership at the University of Texas at Austin. Zac comes with a background in Computer Science and AI, while Lucious has a proven track record, having built a million-dollar product at just 19. Their combined expertise is driving BiteSight's innovative approach to food delivery.\n\n**Growth Metrics:**\nLaunched in beta in February 2023, BiteSight has quickly gained traction. With 274 restaurants onboard in San Francisco and more than 211 orders processed so far, the app is growing organically at over 50% each week. This kind of growth, particularly in a competitive space, is a clear indicator of its potential.\n\n**Market Opportunity:**\nThe food delivery landscape is dominated by a few big players like UberEats and DoorDash, but these super apps often feel impersonal and chaotic. BiteSight sees a $30B opportunity to carve out a niche by prioritizing customer experience. By leveraging high-quality food videos, personalized recommendations, and social proof from friends and trusted critics, BiteSight aims to make food delivery feel more curated and personal.\n\n**Current Status:**\nBiteSight is part of Y Combinator's Batch W24 and currently operates with a lean team of two. Their ambition to create a video-first experience in the delivery app space is clear, and with backing from experienced investors like Pete Koomen, they're on a promising trajectory.\n\n**For More Information:**\nCurious to try it? Head over to their website at [BiteSight](http://bitesight.com) and explore the future of food delivery where your next meal is just a video away.\n\nIn essence, BiteSight isn't just delivering food; it's delivering an experience, and that’s where its true value lies.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/79da8529382477de445f7f858442853a29ae10be.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191024Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=49b39835c097a9f900decc62107f314cfc481a12788d39dfc57aaa6750bf605b",
    "social_links": [
        "https://www.linkedin.com/company/bitesight-food-delivery/about/",
        "https://twitter.com/TryBiteSight"
    ],
    "logo_path": "data/logos\\BiteSight_logo.png"
}