{
    "links": "https://www.ycombinator.com/companies/blacksmith",
    "name": "Blacksmith",
    "headline": "Serverless cloud infra for CI",
    "batch": "W24",
    "description": "Blacksmith helps companies run their continuous integration (CI) up to twice as fast, at half the cost. We do this by running their CI on high performance gaming CPUs.\r\n\n- Engineering productivity is often marred by slow CI that grows quadratically with the size of the engineering organization.\r\n- On top of this, companies pay high markups to run CI on the hyperscalers.\r\n- Consequently, companies have to run their CI on spot instances to keep costs in check. Since spot instances can get pre-empted at any point, running CI reliably on them requires [significant engineering investment](https://www.rippling.com/blog/how-rippling-used-spot-instances-to-save-and-scale-ci-cd).\r\n\nBlacksmith offers CI compute that is more performant, cheaper, and reliable. With Blacksmith, companies do not have to think about CI as they scale.\r\n\nWe are starting with GitHub Actions - today's most popular and fastest-growing CI system. With a one-line change, companies can run their CI up to twice as fast on our high-performance hardware. In addition to this, Blacksmith provides colocated warm caches along with optimizations for common CI workloads (like building and pushing Docker images).\r\n\nAayush, JP and Aditya have gained deep systems and product knowledge from their time at Cockroach Labs and Faire respectively. Both these companies, with several hundred engineers, were spending in the order of millions of dollars on their CI. Yet they were riddled with slow CI and actively seeking out cheaper and faster alternatives. Blacksmith offers exactly this alternative, at a time where being lean is table-stakes for most companies.",
    "activity_status": "Active",
    "website": "https://blacksmith.sh/",
    "founded_date": 2024.0,
    "team_size": 3.0,
    "location": null,
    "group_partner": "Jared Friedman",
    "group_partner_yc": "https://www.ycombinator.com/people/jared-friedman",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": null,
    "founders": [
        {
            "name": "Aditya (JP) Jayaprakash, Founder",
            "description": "Co-founder and CEO of Blacksmith. Aditya was previously an engineer at Faire (YC W17) where he worked on search infra and ads. As a founding member of the ads team, he led retrieval and targeting and helped grow ads from 0 -> $X M. Aditya graduated from the University of Waterloo with a degree in Computer Science and a Master's degree from the University of Alberta, where he did research in Theoretical Computer Science.",
            "linkedin": "https://linkedin.com/in/adijp"
        },
        {
            "name": "Aditya Maru, Founder",
            "description": "Aditya Maru is the co-founder & co-CTO of Blacksmith. Before starting Blacksmith, Aditya worked at Cockroach Labs. At Cockroach he was a senior engineer on a core database team responsible for implementing disaster recovery solutions. This was where he gained his deep systems knowledge. Aditya graduated from the University of Waterloo with a degree in Computer Science.",
            "linkedin": "https://linkedin.com/in/maruaditya"
        },
        {
            "name": "Aayush Shah, Founder",
            "description": "Aayush is a cofounder and co-CTO of Blacksmith. Prior to this, Aayush was a software engineer at Superblocks, and worked as a systems engineer on the replication team at CockroachDB before that. Aayush was awarded the Spartan Award at Cockroach Labs for being critical in bringing home the biggest deal in the company's history. \n\nAayush graduated from the University of Waterloo with a degree in Computer Science, which is where he met his co-founders.",
            "linkedin": "https://linkedin.com/in/aayushshah15"
        }
    ],
    "status": true,
    "generated_description": "**Blacksmith: Supercharging Continuous Integration**\n\nFounded in 2024 and backed by Y Combinator's W24 batch, Blacksmith is a company on a mission to transform how organizations handle Continuous Integration (CI). Their clever solution? Leveraging high-performance gaming CPUs to run CI workloads up to twice as fast—and at half the cost—compared to traditional hyperscaler options.\n\n### The Problem with Current CI Solutions\n\nFor many engineering teams, the speed of CI processes can lag significantly as team sizes grow, leading to higher operational costs, especially when they rely on pricey hyperscalers. A common workaround is to use spot instances. While cost-effective, these can be unreliable—getting preempted at any time often requires extensive engineering efforts to manage.\n\n### How Blacksmith Stands Out\n\nBlacksmith swoops in as the antidote to sluggish, cumbersome CI systems. The company offers a seamless experience, allowing teams to run GitHub Actions—the leading CI platform—simply by making a one-line change in their codebase. The result? Access to lightning-fast CI without having to worry about scaling challenges.\n\nKey features include:\n- **High-Performance Gaming CPUs**: Blacksmith utilizes the latest gaming technology specifically optimized for CI workloads.\n- **Effortless Setup**: With just one line of code, companies can significantly enhance their CI's speed and reliability.\n- **Built-in Caching and Optimizations**: Blacksmith provides colocated warm caches and smarter handling of common CI tasks, such as building Docker images, making processes even faster.\n- **Data-Driven Insights**: Their platform includes powerful analytics to help users spot bottlenecks and improve CI performance.\n\n### The Team Behind Blacksmith\n\nThe founders, Aayush, JP, and Aditya, are seasoned veterans from Cockroach Labs and Faire, where they witnessed first-hand the intensive resources that CI can consume. Armed with this experience, they set out to build a faster, cost-effective alternative that benefits companies aiming for lean operations.\n\n### Why Choose Blacksmith?\n\n- **Cost-Effective**: Their services are over 50% cheaper than conventional hosted runners.\n- **Unlimited Concurrency**: Designed for teams of all sizes, there are no limits on concurrent runs.\n- **Security**: Blacksmith ensures jobs run in isolated, ephemeral VMs, safeguarding sensitive data.\n\nBlacksmith isn't just another CI tool; it's a strategic partner for engineering teams looking to maximize their efficiency without breaking the bank. You can learn more about them at [blacksmith.sh](https://blacksmith.sh/).\n\nIf your team is using GitHub Actions and feels the pull of sluggish builds, a transition to Blacksmith is not just advisable; it’s a no-brainer that could offer significant upside, all with minimal hassle. As the tech landscape grows increasingly competitive, solutions like Blacksmith will be crucial in keeping organizations agile and innovative.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/6fb04758df8b73b7d946f6a1c192ffa7bdb69eec.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191025Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=a0998cd6e08fb1812c075f6e1a2b0c9b157435809d8778b546945c439eba2658",
    "social_links": [
        "https://www.linkedin.com/company/blacksmithrun/",
        "https://twitter.com/useblacksmith",
        "https://github.com/useblacksmith"
    ],
    "logo_path": "data/logos\\Blacksmith_logo.png"
}