{
    "links": "https://www.ycombinator.com/companies/blacktop-hoops-by-vinci-games",
    "name": "Blacktop Hoops by Vinci Games",
    "headline": "Take Two Interactive for VR games.",
    "batch": "S22",
    "description": "Vinci Games is building Take Two Interactive for AAA VR games. We're building the next-generation ATT games for AR/VR. \r\n\nBlacktop Hoops is the ultimate VR basketball game and sports experience. Embark on a hoops journey in career mode, ball against bots, hang out with friends in online courts, or climb the rankings in competitive pickup games. Design your perfect avatar with millions of unique combinations. Do you have what it takes to become the GOAT? 🐐\r\n\nThe company is led by CEO Nathan Ventura who led world-class developer programs at Oculus, Google, and Unity and CTO Maciej Szcześnik who was the lead gameplay designer at CD Projekt Red for the award-winning Witcher series.",
    "activity_status": "Active",
    "website": "https://blacktophoopsvr.com/",
    "founded_date": 2021.0,
    "team_size": 7.0,
    "location": "Berkeley, CA",
    "group_partner": "Brad Flora",
    "group_partner_yc": "https://www.ycombinator.com/people/brad-flora",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:virtual-reality; industry:consumer; industry:gaming; industry:metaverse; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Nathaniel Ventura, Founder",
            "description": "Nathan Ventura is the co-founder and CEO of Vinci Games, which he started with Maciej Szcześnik in 2021. Nathan oversees product, marketing, and business development for the company. He spent his career leading world-class developer programs at Facebook, Google, and Unity. Currently he is focused on building the next generation of AAA competitive sports for virtual reality with Blacktop Hoops.",
            "linkedin": "https://linkedin.com/in/nathanielventura"
        },
        {
            "name": "Maciej Szcześnik, Founder",
            "description": "Maciej Szcześnik is the co-founder and CTO of Vinci Games. He is responsible for game design and development. He studied physics (BSc) and computer science (MSc) and started his game dev career in 2004. Former lead gameplay designer on The Witcher 1, 2, and 3 at CD Projekt Red and Lead Designer at 11 Bit Studios. Former Vice-Rector and author of Video Game Development course at Warsaw Film School. Maciej started working on VR games and apps in 2015. Won Unity Neon Challenge in 2018.",
            "linkedin": "https://www.linkedin.com/in/mszczesnik/"
        }
    ],
    "status": true,
    "generated_description": "**Blacktop Hoops by Vinci Games: Your Gateway to the Ultimate VR Basketball Experience**\n\nFounded in 2021, Blacktop Hoops is revolutionizing the virtual reality gaming scene with its engaging and immersive basketball experience. Hailing from Berkeley, CA, the company is packed with industry talent, led by CEO Nathan Ventura—who has an impressive background with Oculus, Google, and Unity—and CTO Maciej Szcześnik, known for his work on the critically acclaimed Witcher series at CD Projekt Red. \n\nAt its core, Blacktop Hoops aims to provide players with a next-generation basketball experience that merges the excitement of sports with the limitless possibilities of AR/VR technology. Their mission aligns seamlessly with the vision of Take Two Interactive, making their mark in the AAA VR gaming space.\n\nWhat can you expect from Blacktop Hoops? Picture this: a vibrant virtual basketball court where you can embark on a career mode, challenge bots, connect with friends in online courts, or dive into competitive pickup games. Create your unique avatar with millions of customization options and see if you have what it takes to become the Greatest of All Time (GOAT). 🐐\n\nThe gameplay mechanics are designed to provide a realistic and dynamic experience. Whether you’re executing buttery smooth crossovers, sinking threes, or pulling off high-flying dunks, every movement is crafted for natural feel and responsiveness. The AI opponents you face are no pushovers; they adapt to your play style, offering a challenging experience.\n\nWith a passionate team of seven and strong backing from Y Combinator's Batch S22, Blacktop Hoops is carving its niche in the gaming landscape. They're tagged under categories like 'virtual-reality', 'consumer', 'gaming', and 'metaverse', reflecting their innovative spirit and commitment to capturing the essence of basketball.\n\nTo stay updated on their latest features or to sign up for playtesting, you can find them at [blacktophoopsvr.com](https://blacktophoopsvr.com/). If you're a basketball fan and love VR, Blacktop Hoops might just be the game you've been waiting for.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/9d7992b0898faaf3150da8f25eccceeff7180de5.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191025Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=cdb0c7cde4b5887ea571ec01a92e4f38fc55bb1032afcaa54098c6d067738d17",
    "social_links": [
        "https://www.linkedin.com/company/76188044",
        "https://twitter.com/blacktophoopsvr",
        "https://www.facebook.com/BlacktopHoops/"
    ],
    "logo_path": "data/logos\\Blacktop_Hoops_by_Vinci_Games_logo.png"
}