{
    "links": "https://www.ycombinator.com/companies/blackoaktv",
    "name": "BlackOakTV",
    "headline": "A video subscription platform serving black viewers and creators.",
    "batch": "S21",
    "description": "BlackOakTV is a subscription video platform hyper-serving black viewers and creators. We make it easy for black viewers to find, watch and engage with the content and creators that most reflect their lives and experiences.",
    "activity_status": "Active",
    "website": "https://blackoak.tv",
    "founded_date": 2020.0,
    "team_size": 2.0,
    "location": "New York",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:entertainment; industry:community; industry:subscriptions; location:new-york",
    "founders": [
        {
            "name": "Uzo Ometu, Founder",
            "description": "Uzo is a lover of all things media and hopes to bring more underrepresented voices into the content the world sees by leveraging his experience in journalism, entertainment, and technology. Currently, he's doing just that through his new venture, BlackOakTV, which is a subscription video service superserving black audiences.",
            "linkedin": "https://www.linkedin.com/in/ometu/"
        },
        {
            "name": "Iyanu Obidele, Founder",
            "description": "Iyanu - an entrepreneur at heart - is a product generalist with experience at companies like Intel and FB where he built custom cloud orchestration systems and products that enable over 120m+ small businesses respectively. He's deeply passionate about building impactful products for underrepresented communities and currently he's working alongside Uzo Ometu on BlackOakTV where they are building a unique black streaming experience.",
            "linkedin": "https://www.linkedin.com/in/iyanu-obidele-8513a879"
        }
    ],
    "status": true,
    "generated_description": "### BlackOakTV: A Fresh Perspective in Streaming\n\n**Overview**\n\nFounded in 2020 as part of Y Combinator's Batch S21, BlackOakTV is carving out a unique niche in the crowded world of video streaming. Based in New York, this small but mighty platform, supported by a dedicated team of just two, focuses exclusively on serving Black audiences and creators. This isn’t just another subscription service—it's a cultural hub that reflects the experiences, stories, and creativity of Black individuals.\n\n**Mission**\n\nBlackOakTV's mission is clear: to be the go-to video subscription platform for Black viewers and creators. They aim to make it easy for users to discover, watch, and engage with content that resonates with their lives and experiences. The platform offers a mix of movies, series, and shows that feature familiar faces from popular platforms like YouTube, Instagram, and TikTok, including creators like Bigg Jah and Kinigra.\n\n**What They Offer**\n\n1. **Free Access**: You can start watching shows for free, making it accessible to a wider audience right from the get-go.\n   \n2. **Exclusive Content**: BlackOakTV prides itself on a rich catalog of films and series that aren’t typically found on mainstream platforms. This selective focus allows Black viewers to experience stories that truly reflect their narratives.\n\n3. **User-Friendly Features**: The ability to download shows for offline viewing is a great perk, allowing users to enjoy their favorites anywhere—whether on a commute or traveling.\n\n4. **Interactive Community**: Viewers are encouraged to give feedback and share their thoughts, fostering a sense of community among users who are passionate about the same content.\n\n5. **Engagement with Creators**: The platform prominently features Black creators who are building their own brands, providing them with a stage to showcase their work.\n\n**User Satisfaction**\n\nFeedback from users has been overwhelmingly positive, with viewers appreciating the selection of Black movies and the variety of original programming. Comments like “This platform has the best selection of Black movies and shows” highlight the sense of belonging that BlackOakTV strives to provide.\n\n**In Summary**\n\nBlackOakTV is not just another entertainment platform; it's a space that elevates Black voices through tailored content that speaks to their experiences. With a seamless browsing experience and the promise of more exclusive content on the way, it stands out in a marketplace often criticized for its lack of diversity. If you’re looking for a service that acknowledges and celebrates Black culture, BlackOakTV is definitely worth a visit—free trial and all. \n\nYou can dive into their offerings at [BlackOakTV](https://blackoak.tv).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/38966c9493ecdfe2700448ba3ac8776252bbd14b.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191025Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=8f3dccca76a6f2db9042365850a09b50674e2a0b1f8a109d62665aef9cb9d674",
    "social_links": [
        "https://twitter.com/blackoaktv",
        "https://facebook.com/blackoaktv"
    ],
    "logo_path": "data/logos\\BlackOakTV_logo.png"
}