{
    "links": "https://www.ycombinator.com/companies/blaze-2",
    "name": "Blaze",
    "headline": "Global Venmo for cross border payments",
    "batch": "S24",
    "description": "Blaze (YC S24) is global Venmo for cross border payments. It's a peer to peer payments app that uses USDC to make payments fast and cheap between any two people anywhere in the world. The founders scaled their last startup to $1M in ARR, studied mathematics and engineering at Duke, NYU, and Cornell, and have led teams at Spotify, Artsy, and Bitpanda. They're live in the US and Mexico, available for download on iOS and Android: https://blaze.money",
    "activity_status": "Active",
    "website": "https://blaze.money",
    "founded_date": 2023.0,
    "team_size": 5.0,
    "location": "Mexico City, Mexico",
    "group_partner": "Brad Flora",
    "group_partner_yc": "https://www.ycombinator.com/people/brad-flora",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:crypto-web3; industry:payments; industry:finance; industry:travel",
    "founders": [
        {
            "name": "Faiyam Rahman, Founder",
            "description": "Faiyam is a full-stack engineer with a bachelors in mathematics from Duke and a masters of engineering from Cornell Tech. He is now the cofounder and CEO of Blaze Payments. \n\nHe is an avid traveler, most recently having completed a 6 month tour of India, Bangladesh, Nepal, Bali and Portugal. He is also an avid practitioner of yoga and meditation, and he enjoys long walks, the spoken word, and celebrating the joy of being alive.",
            "linkedin": "https://linkedin.com/in/faiyam-rahman"
        },
        {
            "name": "Luc Succès, Founder",
            "description": "Luc is a 2 time VC backed founder. His first startup, Often, launched a keyboard app that enabled you to text your friends with Drake lyrics. Upon launch, Often blew up to #1 on the App Store and got over 400k downloads. He scaled his second startup Seasons, a rental service for high end menswear to $1mm in ARR.\n\nLuc is a seasoned tech leader, having led teams at Artsy & Spotify. He is also an avid traveler, having lived and worked in over 50 countries worldwide.",
            "linkedin": "https://www.linkedin.com/in/lucsucces"
        },
        {
            "name": "Igor Zagnienski, Founder",
            "description": "Igor holds a bachelor's degree in marketing from the School of Economics and Law in Kielce. Prior to Blaze, he co-founded Space Individuals, a top-tier job site dedicated to the space industry. Adding to his diverse experience, he was a Senior Designer at Bitpanda, Austria's first billion dollar tech success.",
            "linkedin": "https://linkedin.com/in/zagnienski"
        }
    ],
    "status": true,
    "generated_description": "Blaze is aiming to redefine cross-border payments with its mission to be the \"global Venmo.\" Founded in 2023 and part of Y Combinator Batch S24, this peer-to-peer payment app utilizes USDC to enable fast and low-cost transactions between individuals worldwide. The team is based in Mexico City and consists of five members, many of whom have an impressive pedigree—with previous startups scaled to $1M in annual recurring revenue and educational backgrounds in mathematics and engineering from notable institutions like Duke, NYU, and Cornell. \n\nAs of now, Blaze is operational in the United States and Mexico and is available for download on both iOS and Android devices. Their app allows users to send, receive, and manage money across borders seamlessly, making it almost free to transfer money globally. Users can execute transactions in various currencies, providing a local feel to payments—whether at a restaurant or online shopping.\n\nBlaze also emphasizes a social aspect. Its network feed allows users to see real-time updates of transactions and discover events or restaurants, enhancing the community feel. \n\nIn addition, Blaze supports extended functionalities such as payment links for freelancers and vendors, eliminating the hassle of exchanging bank details. They currently support payments across 34 countries, making it a versatile choice for users needing to send money internationally.\n\nIf you're looking for a modern solution to cross-border transactions without the usual high fees and delays, Blaze might be worth checking out. You can learn more and download the app through their website: [Blaze](https://blaze.money).\n\nOverall, Blaze is at the intersection of fintech and crypto, bringing a fresh, user-centric approach to an often cumbersome process.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/052bc2e2a09c898237e40b2e50a9b471dc81330b.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191025Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=fab479324d8c25bd87c481b609c7515aa34b85c5d6a20cad240ba8aa357665fd",
    "social_links": [
        "https://www.linkedin.com/company/useblazeapp",
        "https://x.com/blaze_payments",
        "https://www.crunchbase.com/organization/blaze-payments",
        "https://github.com/blaze-xyz"
    ],
    "logo_path": "data/logos\\Blaze_logo.png"
}