{
    "links": "https://www.ycombinator.com/companies/blixo",
    "name": "Blixo",
    "headline": "B2B BNPL for SEA",
    "batch": "S21",
    "description": "Blixo offers fast, scalable, and more accessible short-term (3 months) supply chain financing in Southeast Asia (SEA). Blixo specializes in providing smaller loans (<$50k) with an AI-driven underwriting process (approval in <1 week). These loans have higher repayment rates and lower per customer risk. Blixo uses AI credit scoring based on real-time data such as cash flow and inventory, further reducing risk and streamlining repayment. Unlike traditional banks and recent FinTech entrants, Blixo can profitably finance the 74% of suppliers and retailers in SEA that otherwise would be overlooked by traditional lenders because they either lack a traditional credit score or need a loan under $100k.",
    "activity_status": "Active",
    "website": "https://blixo.com",
    "founded_date": 2020.0,
    "team_size": 2.0,
    "location": "Miami, FL",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:saas; industry:payments",
    "founders": [
        {
            "name": "Danilo Stern-Sapad, Founder",
            "description": "Launched several multimillion dollar businesses—one made hundreds of millions in revenue, one made millions in the first year alone and grew to tens of millions in revenue after two years, and another was acquired in less than one year. Was also part of the founding team of the most popular legal website on the Internet and created one of the most played online games in the world while still in high school, garnering over 40 million visitors per month.",
            "linkedin": "https://www.linkedin.com/in/danilosapad/"
        }
    ],
    "status": true,
    "generated_description": "### Blixo: The Future of B2B Financing in Southeast Asia\n\n**Overview**  \nBlixo is a fintech startup founded in 2020 and is part of the Y Combinator Batch S21. With a team of two and based in Miami, Florida, Blixo is revolutionizing the way businesses in Southeast Asia (SEA) access short-term financing through its innovative Buy Now, Pay Later (BNPL) model.\n\n**Mission**  \nThe mission at Blixo is clear: to provide accessible B2B BNPL solutions tailored for the unique landscape of SEA. The platform addresses a significant gap in the market by offering smaller loans (under $50k) that are often overlooked by traditional banks.\n\n**Key Aspects of Blixo's Offering**  \n- **Fast and Scalable Financing**: Blixo's loan approval process leverages artificial intelligence for underwriting, ensuring decisions are made in less than a week. Their model not only allows for quick access to funds but does so with a focus on lower customer risk and higher repayment rates.\n  \n- **AI-Driven Credit Scoring**: By utilizing real-time data such as cash flow and inventory levels, Blixo minimizes risk. This approach is particularly beneficial for the 74% of suppliers and retailers in SEA who either lack formal credit scores or require loans less than $100k.\n\n- **Comprehensive Solutions**: Blixo's platform goes beyond financing. It also automates accounts receivable, collections, billing, and cash applications, ensuring businesses can manage their cash flow efficiently. Key features include:\n  - BNPL solutions for flexible customer payments\n  - Subscription billing\n  - Automated collections for delinquent accounts\n  - A customizable customer portal\n  \n**Customer Feedback**  \nBlixo’s users have lauded its simplicity and effectiveness:\n- Users appreciate the intuitive setup, allowing for streamlined management of subscriptions and payments.\n- The platform is particularly advantageous for service-based businesses, aiding in the seamless collection of payments.\n  \n**Industry Position**  \nBlixo is strategically positioned as a solution for various industries, including SaaS, E-commerce, and professional services. Its integrations with popular accounting software like QuickBooks and Xero further enhance its value proposition.\n\n**Looking Forward**  \nAs it continues to evolve, Blixo is poised to play a significant role in democratizing financing for businesses in Southeast Asia, making essential capital accessible to those who need it most, without the burdensome requirements of traditional lenders.\n\nFor more insights and to explore how Blixo can benefit your business, visit their [website](https://blixo.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/0b3a1a96140e2bca8593dd7cb444491d024b44d7.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191026Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=1c96b37c11a5337eb8503faf7433dbec07b3f3daed2b0afb30cbcf471ea95a7f",
    "social_links": [
        "https://www.linkedin.com/company/blixo/"
    ],
    "logo_path": "data/logos\\Blixo_logo.png"
}