{
    "links": "https://www.ycombinator.com/companies/bloop",
    "name": "bloop",
    "headline": "Modernising legacy code with AI",
    "batch": "S21",
    "description": "Most of the Fortune 500 still use mainframes for some of their compute, but innovation, skills and cost pressure means that most are looking to reduce their mainframe workloads.\r\n\nWe build tools that help teams modernise, write and understand legacy codebases, with the help of generative AI.",
    "activity_status": "Active",
    "website": "https://bloop.ai",
    "founded_date": 2021.0,
    "team_size": 10.0,
    "location": "London, United Kingdom",
    "group_partner": "Jared Friedman",
    "group_partner_yc": "https://www.ycombinator.com/people/jared-friedman",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:machine-learning; industry:open-source; industry:ai",
    "founders": [],
    "status": true,
    "generated_description": "**Bloop: Modernizing Legacy Code with AI**\n\nFounded in 2021 and hailing from the bustling tech scene of London, Bloop is on a mission to revolutionize how companies handle legacy code, particularly from the old guard of programming languages like COBOL. With many Fortune 500 companies still reliant on mainframes, Bloop recognizes that the need for innovation, alongside cost and skills pressures, makes modernization not just a preference but a necessity.\n\nBloop's approach leverages the power of generative AI to create tools that help teams not only modernize legacy codebases but also understand and write them. The focus is on converting COBOL into readable Java—code that's not just functional but human-friendly. Forget about the infamous results of traditional conversion methods; Bloop prides itself on producing clear, maintainable code, ready for teams to innovate upon. \n\nWith its roots in Y Combinator's Batch S21, Bloop operates with a lean team of ten talented employees, including notable backing from Jared Friedman as the Group Partner. They are deeply engaged in AI, machine learning, and open-source technologies, with a strong emphasis on making modernization safe and straightforward.\n\n### What Do They Offer?\n\n1. **Functionally Equivalent Conversion**: Bloop ensures that converted Java programs exhibit identical behavior to their COBOL predecessors, validated through extensive AI-powered testing.\n   \n2. **Readable Code**: The goal is clarity. Bloop’s code conversions aim for readability that aligns with human writing, steering clear of confusing mix-ups like \"Jobol\" or \"Cava.\"\n\n3. **Open Source Solutions**: They favor using open-source libraries and cloud services, which lowers costs and enhances flexibility.\n\n4. **Easy Modifications**: Post-conversion, the new code is designed to be modified without necessitating extensive refactoring, allowing for agile responses to deadline-driven demands.\n\n5. **Safety in Conversion**: Their automatic translations come with built-in correctness checks to safeguard against errors, which often plague manual rewrites.\n\n### The Process\n\nBloop's modernizations unfold in a few clear steps:\n- **Initial Survey**: They assess the existing environment and identify potential risks.\n- **Proof-of-Concept**: A short sprint converts a segment of the codebase to showcase the value of their solution.\n- **Full Modernization**: Finally, they onboard the client's team for a complete transformation, setting them up to leapfrog into innovation.\n\n### Why Partner with Bloop?\n\nIn an age where the speed of innovation can determine a company’s survival, Bloop’s vision is about liberating teams from the constraints of legacy systems. By automating tedious engineering tasks, they help businesses sharpen their focus on what truly matters: creating value and driving forward with new ideas.\n\nReady to break free from the shackles of old code? Visit [Bloop's website](https://bloop.ai) to reach out and see how they can help you navigate the future of software development.\n\n---\nEngaging, straightforward, and directly addressing the challenges many companies face today, Bloop embodies a fresh approach to an important but often daunting task. The intersection of AI and code conversion is not just a trend—it's an opportunity for a more streamlined, innovative future in the tech world.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/40f47208a5bbbd20c9a8f866f167153b7a6b00aa.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191027Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=693d9430bf49145ae738eda7beb6048abc720c3443a7b1465fbabe3f208cfd4e",
    "social_links": [
        "https://www.linkedin.com/company/bloopai",
        "https://twitter.com/bloopdotai",
        "https://github.com/bloopai"
    ],
    "logo_path": "data/logos\\bloop_logo.png"
}