{
    "links": "https://www.ycombinator.com/companies/bloom-3",
    "name": "Bloom",
    "headline": "Investing app that teaches you how to invest",
    "batch": "W21",
    "description": "Bloom's mission is to improve the financial outcomes of all Americans by giving them the knowledge and tools they need to achieve prosperity. \r\n\nOur first product is an investing app that teaches users how to build wealth through interactive financial lessons, a gamified rewards economy as well as an investing account designed for building long-term wealth.\r\n\nSince launching in April 2022, over 1 million users have joined Bloom and we have crossed $3MM in annual recurring revenue.",
    "activity_status": "Active",
    "website": "https://bloomapp.com",
    "founded_date": 2021.0,
    "team_size": 8.0,
    "location": "New York",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:education; industry:fintech; industry:edtech; location:new-york",
    "founders": [
        {
            "name": "Sam Yang, Founder",
            "description": "I built an AI doppelganger app w/ 250k+ users & Thryft (W21). Now working on Bloom (W21).",
            "linkedin": "https://www.linkedin.com/in/samuel-q-yang/"
        }
    ],
    "status": true,
    "generated_description": "**Bloom: Empowering Financial Literacy Among Teens**\n\nFounded in 2021 and nurtured in Y Combinator’s W21 batch, Bloom is an innovative investing app designed with one core mission: to enhance the financial futures of young Americans by equipping them with the knowledge and tools to invest wisely. Based in New York with a compact team of 8, Bloom has made impressive strides since its inception.\n\n### What It Does\n\nBloom's flagship product is not just your standard investing app; it’s an educational platform that gamifies the learning process. With over 1 million users as of October 2023 and a solid annual recurring revenue of $3 million, Bloom teaches users how to build wealth through interactive lessons and a rewards system that incentivizes financial learning. The app offers fractional shares, custodial accounts for users aged 13-17, and access to over 5,000 stocks and ETFs.\n\n### Learning By Doing\n\nThe app features **350+ interactive lessons** crafted by Ivy League professors, covering essential topics from investing basics to advanced strategies. Users earn rewards—namely stocks—while they learn, making the educational experience both engaging and rewarding. The average user reports earning around $6 per month in rewards, which have collectively surpassed the $1 million mark.\n\n### Parental Involvement\n\nParents play an active role in their teens’ financial education through Bloom. The app includes various safety features, allowing parents to approve trades and manage investment risk levels, ensuring a controlled and educational investing experience.\n\n### A Growing Community\n\nBloom has garnered attention from major media outlets, including Forbes and Fast Company, affirming its position as a leader in fintech education aimed at younger audiences. The app's community is vibrant, fostering a sense of achievement as users collectively navigate their investing journeys.\n\n### The Financial Future\n\nFor $15 a month, Bloom provides users with a comprehensive investing account, education, and rewards, making it accessible for families eager to instill financial literacy from a young age. So if you're looking to empower the next generation in financial matters, Bloom stands out as a promising option to consider. \n\n**Website:** [Join Bloom](https://bloomapp.com) \n\nIn an age where financial literacy can feel daunting, Bloom transforms the experience into an engaging adventure, making investing approachable, fun, and educational for the next generation. As Bloom continues to grow, it undoubtedly has the potential to foster a more financially savvy populace.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/4406d561d8091596d0159f420e763ab66fbda117.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191027Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=db160f6083026bf3545650f96e3aca8fd9f223355cde2c325ef6fe55b36cae86",
    "social_links": [
        "https://www.linkedin.com/company/bloominvest/"
    ],
    "logo_path": "data/logos\\Bloom_logo.png"
}