{
    "links": "https://www.ycombinator.com/companies/bluebirds",
    "name": "Bluebirds",
    "headline": "Automate outbound with signals",
    "batch": "W23",
    "description": "Bluebirds helps GTM teams automate outbound targeting with signals. Save your reps 2 hours a day from list building and prospect research. \r\n\nCreate custom intent signals from trusted data sources in 3 minutes. Bluebirds continuously scans your market and delivers ready-to-prospect Leads to your CRM.",
    "activity_status": "Active",
    "website": "https://www.bluebirds.ai",
    "founded_date": 2022.0,
    "team_size": 6.0,
    "location": "San Francisco",
    "group_partner": "Jared Friedman",
    "group_partner_yc": "https://www.ycombinator.com/people/jared-friedman",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:b2b; industry:sales; industry:enterprise; industry:ai; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Rohan Punamia, Founder",
            "description": "Rohan started his career at LinkedIn in Sales Operations, where he built an automated quota setting engine for a $1B+ business and 500 reps using Machine Learning and LinkedIn’s Knowledge Graph. He later became a zero-to-one Product Manager, where he built enterprise products for LinkedIn's Talent business -- once again using Machine Learning and the Knowledge Graph.",
            "linkedin": "https://www.linkedin.com/in/rohanpunamia/"
        },
        {
            "name": "Kunal Punera, Founder",
            "description": "Kunal has held leadership positions at LinkedIn and Google; most recently he was a Director of AI at LinkedIn where he ran AI teams for the Recruiter, Premium, and Learning products, accounting for many billions in revenue. In 2014, Kunal co-founded Bento Labs, and prior to that he was a founding engineer at RelateIQ (sold to Salesforce for ~$400M) where he built their entire ML stack. Kunal has a PhD in ML from Univ of Texas at Austin, and worked at Yahoo! Research on NLP and Generative Models.",
            "linkedin": "https://www.linkedin.com/in/kpunera/"
        }
    ],
    "status": true,
    "generated_description": "**Company Overview: Bluebirds**\n\nFounded in 2022 as part of Y Combinator's Batch W23, **Bluebirds** hails from the heart of San Francisco. With a small yet mighty team of six, the company is on a mission to redefine the outbound sales process through automation.\n\n**Mission and Value Proposition**\n\nThe primary aim of Bluebirds is to automate outbound targeting for go-to-market (GTM) teams through actionable signals. They help sales representatives reclaim valuable time—specifically about two hours a day—by streamlining list building and prospect research. With Bluebirds, teams can create custom intent signals from trusted data sources within minutes, effectively minimizing the mundane tasks that often bog down sales processes. \n\nBluebirds continuously monitors the market landscape and pushes ready-to-prospect leads directly to your CRM, ensuring that your sales team is always equipped with the freshest opportunities. As they state, their AI agents sequence the best leads for sales representatives, allowing them to focus on conversations rather than searching for prospects.\n\n**Product Features**\n\nBluebirds boasts several standout features:\n\n1. **Account Research:** They help sift through millions of accounts using rich firmographics and technographics, identifying the best potential fits.\n   \n2. **Prioritization:** The platform ranks accounts based on buying signals, suggesting ones that are statistically more likely to convert.\n\n3. **Data Enrichment:** With access to over 15 data vendors, Bluebirds augments profiles with essential contact information to improve targeting.\n\n4. **Personalized Messaging:** The tool crafts personalized sequences based on real-time buying signals, allowing sales reps to engage better without sounding robotic.\n\n5. **Learning Intelligence:** Bluebirds incorporates machine learning to adapt its approach, mimicking the most effective prospecting styles of your top sales reps.\n\n**Funding and Growth**\n\nRecently, Bluebirds raised $5 million in seed funding, headed by Lightspeed Venture Partners, a testament to confidence in their innovative approach to B2B sales automation.\n\n**Focus Areas and Clientele**\n\nThe company is particularly focused on the B2B and enterprise sectors, with ambitions to revolutionize sales processes across various industries. Their client base includes notable companies like Redpanda, Workato, and TravelPerk, showcasing their appeal to thriving businesses looking to enhance their outbound efforts.\n\nFor more details on their offerings or to dive deeper into their insights, visit their website at [Bluebirds](https://www.bluebirds.ai).\n\n---\n\nIn essence, Bluebirds isn’t just about leads; it’s about smart, effective engagement that empowers sales teams to do what they do best—close deals.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/12da9d2e2afbe5a2ca6c8612a14b11c2334398b6.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191027Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=55eb194502d4a3b9e1d9f42564f59e875c044bc7637f3ae1eabd0e52a82db36d",
    "social_links": [],
    "logo_path": "data/logos\\Bluebirds_logo.png"
}