{
    "links": "https://www.ycombinator.com/companies/bluecargo",
    "name": "BlueCargo",
    "headline": "BlueCargo builds software for trucking companies to optimize theirâ\u0080¦",
    "batch": "S18",
    "description": "BlueCargo provides real-time information for trucking companies that move cargo from marine ports to first warehouses. We are building a platform that will be a one-stop shop for truckers to dispatch, schedule their workload and move containers efficiently\r\n\nOur startup was founded by two female entrepreneurs, graduated from Y Combinator (2018 batch), and has raised a 4 million seed round. We are at the beginning of an exciting growth phase where we have already developed product-market fit, a working platform, and hundreds of daily active users. We are looking for a Senior Software Engineer to grow the team and deliver a product to bring us to the next level.\r\n\nIf working to bring technology to the logistics industry sounds exciting, then weâ\u0080\u0099d like to connect with you! We are looking for a highly experienced professional who has created several full stack web applications and has experience with AWS.",
    "activity_status": "Active",
    "website": "http://www.bluecargo.io/",
    "founded_date": 2018.0,
    "team_size": 35.0,
    "location": "Los Angeles, CA",
    "group_partner": "Gustaf Alstromer",
    "group_partner_yc": "https://www.ycombinator.com/people/gustaf-alstromer",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:logistics; industry:supply-chain; location:los-angeles",
    "founders": [
        {
            "name": "Alexandra Griffon, Founder",
            "description": "After graduating from ESSEC Business School and UC Berkeley, Alexandra started to work as a merger and acquisitions analyst (Lazard, Paris) and in the retail industry as a sales & stock analyst (Guerlain, NYC). She then followed her entrepreneurial spirit to take the plunge and co-founded BlueCargo - aiming at disrupting an industry that fuel our global economy.",
            "linkedin": "https://www.linkedin.com/in/alexandra-griffon-a6416b8b/"
        },
        {
            "name": "Laura Theveniau, Founder",
            "description": null,
            "linkedin": "https://www.linkedin.com/in/laura-theveniau-baa878b5/"
        }
    ],
    "status": true,
    "generated_description": "### BlueCargo: Streamlining the Trucking Industry\n\n**Overview:**\nFounded in 2018 and a graduate of Y Combinator's S18 batch, BlueCargo is a logistics software company based in Los Angeles, CA. This innovative startup was co-founded by two female entrepreneurs who saw an opportunity to transform the trucking industry.\n\n**Mission:**\nBlueCargo aims to be the one-stop platform for trucking companies, providing real-time information that optimizes the movement of cargo from marine ports to warehouses. The platform facilitates scheduling, dispatching, and streamlining container movements, ultimately enhancing efficiency and reducing operational hurdles.\n\n**Current Status:**\nHaving raised a $4 million seed round, BlueCargo is experiencing an exciting phase of growth. They’ve achieved product-market fit with a working platform that boasts hundreds of daily active users. The team has grown to 35 employees, and they are actively looking for skilled talent to join their ranks, especially a Senior Software Engineer familiar with full-stack development and AWS.\n\n**Key Features:**\n1. **AI-Powered Freight Audit**: The platform automates nearly all invoicing, boasting a 99% automation rate, thus eliminating manual invoice validation.\n2. **Real-Time Insights**: Users get predictive analytics and cost benchmarking integrated with extensive port and carrier data to mitigate unexpected costs.\n3. **Seamless Vendor Payments**: Automated workflows simplify invoice approvals and payment processing, reducing cash flow friction for logistics service providers.\n4. **Dispute Resolution**: They offer a transparent audit process, leveraging industry-specific data to validate and dispute invoices effectively with evidence-backed documentation.\n\n**Customer Impact:**\nBlueCargo has demonstrated its value through significant cost savings for its users. For instance, GE Appliances saved $1.6 million annually in unverified accessorial fees using BlueCargo’s platform. Similarly, logistics providers have reported remarkable recovery rates on disputed charges.\n\n**Why Choose BlueCargo?**\nTheir cutting-edge technology not only helps automate freight operations but also offers a comprehensive audit system that improves accuracy and reduces costly errors. Their mission is to shift the focus of logistics companies from tedious back-office tasks to scaling their operations.\n\nFor more information, visit [BlueCargo's Website](http://www.bluecargo.io/) or reach out via email at [contact@bluecargo.io](mailto:contact@bluecargo.io). \n\nIn short, BlueCargo isn't just improving logistics; they’re redefining it, making the trucking industry faster, smarter, and more efficient. If you’re passionate about technology and logistics, this could be the next step in your career to contribute to a monumental shift in an integral industry.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/a5ccca0fbbf03aa5c5a97b018f2bb9fa4f2ee161.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191028Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=028e3472a8a7fae4d1e4f3ef9544b3c0b54e610eeeb19cb02a480ec28a79c77e",
    "social_links": [
        "https://www.linkedin.com/company/18812939/admin/",
        "https://www.crunchbase.com/organization/bluecargo"
    ],
    "logo_path": "data/logos\\BlueCargo_logo.png"
}