{
    "links": "https://www.ycombinator.com/companies/blue-frog-gaming",
    "name": "Blue Frog Gaming",
    "headline": null,
    "batch": "S07",
    "description": "Blue Frog Gaming",
    "activity_status": "Active",
    "website": "http://bluefroggaming.com",
    "founded_date": null,
    "team_size": 11.0,
    "location": "Akron, OH",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": null,
    "founders": [],
    "status": true,
    "generated_description": "Blue Frog Gaming is a small but enthusiastic game development studio based in Akron, Ohio, operating with a tight-knit team of 11 dedicated employees. Founded during the Y Combinator Batch S07, Blue Frog specializes in creating rich gaming experiences that capture the imaginations of players.\n\nTheir flagship game, **ShadowRift**, invites players to explore a vast sci-fi universe, blending classic MMO gameplay with stunning graphics. In addition to ShadowRift, they offer a range of other engaging titles, including **Stardrift Empires**, developed in collaboration with Syfy Games, and **Starfleet Commander**, a classic strategy game that has garnered a loyal following. Each game is designed with an emphasis on user-friendly interfaces and captivating game mechanics, making them accessible and enjoyable for a wide range of players.\n\nThe company’s portfolio also includes a variety of archived games, ensuring that they have a rich history of diverse gaming experiences. Although details about their mission and market partnerships are not highlighted, their commitment to quality and innovation in game design is evident.\n\nFor more about their games and latest updates, you can visit their official website at [Blue Frog Gaming](http://bluefroggaming.com). They actively engage with the gaming community on social media platforms like Twitter, keeping players informed about their latest developments.\n\nIn essence, Blue Frog Gaming represents a blend of passionate craftsmanship and creative enthusiasm, working hard to create memorable gaming experiences in a competitive landscape. If you’re into engaging games filled with strategy and adventure, it’s worth checking out what this small but mighty team has to offer.",
    "logo": "/logos/medium/missing.png",
    "social_links": [
        "https://www.crunchbase.com/organization/draftmix",
        "https://github.com/BlueFrogGaming"
    ]
}