{
    "links": "https://www.ycombinator.com/companies/bluumbio",
    "name": "BLUUMBIO",
    "headline": "We make bacteria and plants that clean up pollution.",
    "batch": "S21",
    "description": "Our mission\r\n\n-To ensure current and future generations have access to clean soil, water & air.\r\n\n-To protect and restore earth's beautiful and diverse ecosystems.\r\n\n-To undo the harm of industrial activity on the planet and ensure future industrial activities are more sustainable.\r\n\nOur research\r\n\n-We develop new bio-based solutions that break down and remove toxic chemicals from the environment.  We also develop bioreactor based solutions which remove toxins from industrial production pipelines, ensuring contaminants are never released into the environment.\r\n\n-To do this, we've partnered with Nature. Specifically, we have harnessed the power of one of Nature's smallest but most powerful technologies: enzymes. Enzymes are everywhere. They break down the food in your stomach, remove dirt from your clothes, and make our beer. At BluumBio, we look for enzymes found in bacteria, algae, plants and other living organisms that naturally degrade toxic chemicals. We then make these enzymes work better in the lab and come up with develop new applications for these technologies.",
    "activity_status": "Active",
    "website": "http://www.bluumbio.com",
    "founded_date": 2021.0,
    "team_size": 4.0,
    "location": "Berkeley, CA",
    "group_partner": "Jared Friedman",
    "group_partner_yc": "https://www.ycombinator.com/people/jared-friedman",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:biotech; industry:sustainability; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Katherine French, Founder",
            "description": "I am a biologist dedicated to developing new technologies that harness nature to clean up the environment. I completed my PhD in the Department of Plant Sciences at Oxford University in 2016. Since then, I have worked at UC Berkeley and Lawrence Berkeley National Lab to engineer organisms for bioremediation and to understand the environmental effects of genetically engineered bacteria and plants. BluumBio combines my passion for sustainability with my commitment to bioinovation.",
            "linkedin": "https://www.linkedin.com/in/katherine-french-a8452b1b4/"
        }
    ],
    "status": true,
    "generated_description": "### BluumBio: Nature’s Ally in Fighting Pollution\n\n**Overview:**  \nFounded in 2021 and hailing from Berkeley, CA, BluumBio is a biotech startup on a mission to tackle one of our planet's pressing challenges: pollution. As part of the Y Combinator Batch S21, they’re a compact team of four, driven by big ambitions—to ensure clean soil, water, and air for current and future generations.\n\n**Mission:**  \nAt its core, BluumBio aims to restore and protect the diverse ecosystems of the Earth while addressing the damaging effects of industrial activities. Their guiding principles focus on developing sustainable solutions that allow us to clean up existing pollution, prevent future harm, and enhance the resilience of our natural environments.\n\n**What They Do:**  \nBluumBio works by innovating bio-based solutions that remove toxic chemicals from the environment. They specialize in a process known as bio-remediation, utilizing enzymes—an often-overlooked technology found in nature. These little powerhouses are derived from organisms like bacteria, algae, and plants. Not only do they break down harmful substances, but BluumBio’s expertise lies in optimizing these enzymes to make them even more effective.\n\n**Research and Development:**  \nThe company is exploring the molecular biology behind enzyme functionality and developing applications that can be integrated into industrial processes to prevent contaminants from being released into the environment. Essentially, they are partnering with nature to deploy its own mechanisms in the fight against pollution. In just 6-12 months, they can take an idea from concept to a solution ready for field testing.\n\n**Vision for the Future:**  \nBluumBio is not just about cleaning up after industrialization; they're redefining the relationship between industry and nature. They envision a future where industrial activities are conducted sustainably from the outset, allowing natural ecosystems to thrive alongside industrial progress.\n\n**Key People:**\n- **Team Size:** 4 dedicated employees\n- **Group Partner:** Jared Friedman (Y Combinator)\n\n**Tags:**  \nThis innovative company is categorized under biotech, sustainability, and is located in the San Francisco Bay Area, emphasizing its alignment with California’s environmental ethos.\n\n**Get In Touch:**  \nWant to learn more about BluumBio or explore collaboration opportunities? You can visit their website at [bluumbio.com](http://www.bluumbio.com) or reach out directly via email at hello@bluumbio.com.\n\nBluumBio is a prime example of how the fusion of science, technology, and respect for nature can lead to transformative solutions for some of our most stubborn environmental challenges. With their focus on sustainability, they’re not only cleaning up but also giving nature a fair chance at survival.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/1e74b7cd82527d16940149fec8570b5da2c5f978.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191028Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=91a6ba85888cbf7277b15eca84ab17f9935caf8eb5557ac2503e94013740cd89",
    "social_links": [
        "https://www.linkedin.com/company/bluumbio/?viewAsMember=true"
    ],
    "logo_path": "data/logos\\BLUUMBIO_logo.png"
}