{
    "links": "https://www.ycombinator.com/companies/boardcave",
    "name": "Boardcave",
    "headline": "Building the worldâ\u0080\u0099s largest online surf gear store.",
    "batch": "W22",
    "description": "The one stop shop for surfers. Boardcave provides surfers with online surf knowledge and gear to accelerate their surfing. The company is reimagining how surfers progress and partake in ocean activities.",
    "activity_status": "Active",
    "website": "http://www.boardcave.com",
    "founded_date": 2012.0,
    "team_size": 6.0,
    "location": "Gold Coast, Australia",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:marketplace; industry:media; industry:e-commerce",
    "founders": [
        {
            "name": "Ryan Mets, Founder",
            "description": "Founder & CEO at Boardcave. Growing up in South Africa and living between the Gold Coast, Australia and California, Ryan has always been an ocean enthusiast in sailing, fishing and surfing. Previously Ryan helped grow Wotif.com, the leading travel marketplace (now acquired by Expedia). Ryan founded his first company at age 17, setting up operations out of Indonesia to be able to work and surf.",
            "linkedin": "https://au.linkedin.com/in/ryanmets"
        },
        {
            "name": "Chris Greben, Founder",
            "description": "I was fortunate to have found my passion early in life, starting in Primary School when the first computer was introduced to the classroom, I was fascinated with the endless possibilities it offered. Fast forward, my adult education has evolved into architecting and building computer code to improve the lives of people by automating as much as physically possible, to ensure a good work life balance. Work Smarter, not Harder.",
            "linkedin": "https://www.linkedin.com/in/chrisgreben/"
        }
    ],
    "status": true,
    "generated_description": "**Boardcave: Your One-Stop Surfing Shop**\n\nFounded in 2012 and hailing from the vibrant Gold Coast, Australia, Boardcave is on a mission to become the world’s largest online surf gear store. It’s not just about selling surfboards and accessories; it’s about enhancing the surfing experience. Boardcave aims to revolutionize how surfers learn and progress in their ocean pursuits by combining e-commerce with educational media.\n\nAs part of Y Combinator’s W22 batch, this small but mighty team of six is dedicated to creating a robust platform where surfers can find everything they need, from surfboards to technical knowledge. Whether you’re a seasoned pro or just getting your feet wet, Boardcave offers a plethora of products and resources tailored to your surfing needs.\n\n**What Does Boardcave Offer?**  \n\nTheir extensive product line features various types of surfboards—including longboards, shortboards, retro boards, and even specialized options for beginners and those tackling big waves. But it doesn’t end there; Boardcave also sports a wide range of surf accessories, apparel, and gear from popular brands in the industry.\n\nHere are just a few highlights of their offerings:\n\n- **Surfboards**: From performance to retro models, down to beginner-friendly options.\n- **Fins**: A detailed guide on fin types and layouts to optimize your board's performance.\n- **Surf Accessories**: Everything from board bags to traction pads and leashes.\n- **Wetsuits & Clothing**: Stylish and functional gear for surfers of all shapes and sizes.\n\n**A Unique Surfing Hub**  \n\nWhat sets Boardcave apart is not just their product range, but their commitment to fostering a surfing community. Their website includes a blog and various guides that aim to educate surfers about selecting the right equipment, understanding board dynamics, and improving skills. They're also backing their mission with a **Best Price Guarantee** and a robust shipping strategy—ensuring that your gear arrives in perfect condition.\n\n**Why Choose Boardcave?**  \n\nSimply put, if you're passionate about surfing, Boardcave wants to be your go-to resource. They combine a market-driven approach with a community-driven philosophy. On top of that, their group partner is a well-connected name in the industry, ensuring you have access to quality products and advice.\n\nFor more information—and to explore their vast selection—visit [Boardcave](http://www.boardcave.com). Whether you’re gearing up for your next surf trip or just need advice on board selection, this marketplace is turning surfing aspirations into reality.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/a10778642cd9cc484fc9b94384b5912e7f5c1ce4.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191028Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=a710b0e451a28396883f069f7ffa49d5103668e119a57f85169b3ac2f1afd638",
    "social_links": [
        "https://www.linkedin.com/company/boardcave/",
        "https://twitter.com/boardcave",
        "https://www.facebook.com/BoardcaveAustralia/",
        "https://www.crunchbase.com/organization/boardcave-com"
    ],
    "logo_path": "data/logos\\Boardcave_logo.png"
}