{
    "links": "https://www.ycombinator.com/companies/boostly",
    "name": "Boostly",
    "headline": "Gamified marketing for restaurants",
    "batch": "S22",
    "description": "Boostly uses behavioral-based marketing and gamified SMS-based experiences to get 10x greater consumer engagement for restaurants than traditional means leading to significant revenue boosts. Critically, Boostly also builds the audiences to engage with from scratch (bigger and faster than anyone else) by connecting all sources of consumer data available to the restaurant. Notably, this is all done while requiring as little as possible from busy restaurant operators, enabling this critical function of their business to remain hands-off via Boostly's dedicated experts.",
    "activity_status": "Active",
    "website": "https://boostly.com",
    "founded_date": 2017.0,
    "team_size": 50.0,
    "location": "Lehi, UT",
    "group_partner": "Brad Flora",
    "group_partner_yc": "https://www.ycombinator.com/people/brad-flora",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:saas; industry:b2b; industry:messaging; industry:food-tech",
    "founders": [
        {
            "name": "Shane Murphy, Founder",
            "description": "Shane is the Co-founder and CEO of Boostly. He previously ran sales for Jolt, a restaurant operations software company, and was a sales leader, early team member, and investor in American HealthCare Lending (acquired by Prosper Marketplace). He previously founded an online ordering company which was acquired by StrideQ.",
            "linkedin": "https://www.linkedin.com/in/shanelmurphy/"
        },
        {
            "name": "Mikey Murphy, Founder",
            "description": "Consummate generalist w/ a focus on product; BYU CS, Techstars '16, 3x CTO.",
            "linkedin": "https://www.linkedin.com/in/mikeymurphy/"
        }
    ],
    "status": true,
    "generated_description": "**Boostly: Gamified Marketing for Restaurants**\n\nFounded in 2017 and hailing from Lehi, UT, Boostly is a fresh and innovative player in the restaurant marketing space. As part of Y Combinator’s Batch S22, Boostly has made a name for itself by leveraging gamified marketing techniques that dramatically increase consumer engagement—up to ten times more than traditional methods. This isn't just marketing fluff; it's a real way to drive significant revenue boosts for restaurants.\n\nThe essence of Boostly's mission lies in its ability to cultivate customer audiences from scratch by tapping into various consumer data sources and merging them into a cohesive database. This ensures that restaurant operators can engage their customers meaningfully without the need for extensive time commitments on their part. Instead, they can rely on Boostly's dedicated team of experts to manage the heavy lifting.\n\nThe platform primarily operates through behavioral-based marketing and SMS campaigns, designed to engage customers in fun and instinctive ways. This translates to higher turnover, increased reviews, and ultimately, enhanced loyalty. Notably, restaurants that use Boostly report impressive metrics, including an average return on investment soaring over 600%.\n\nWith Boostly, the operational load on restaurant owners is minimized. The service works seamlessly in the background, allowing restaurant operators to focus on what they do best—delivering great food and service—while still seeing results in real-time through easy-to-understand analytics and reports.\n\nAs of now, Boostly employs a team of 50 passionate individuals and is recognized across the food-tech and SaaS sectors. Their offerings include a robust text marketing platform that requires virtually no input from the busy restaurant leadership, allowing them to improve orders, reviews, and customer loyalty. \n\nIt's fascinating how the right technology can transform challenges into opportunities, especially in a sector where attention spans are short and competition is fierce. Interested restaurants can explore Boostly's services further on their [website](https://boostly.com) and even sign up for a free demo to see how they can start maximizing their marketing efforts without any hassle.\n\nIn short, if you're running a restaurant and looking to enhance your marketing efforts without adding to your workload, Boostly is definitely worth checking out. They’re redefining what it means to engage customers in the restaurant industry.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/5b079835bfae4b64c70cd07bc6dfcdb29ef14d53.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191029Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=b2846c17e4ab54116f6eab5225a84f9adecf7dc5d4335a7353e691f820111806",
    "social_links": [
        "https://www.linkedin.com/company/goboostly",
        "https://www.facebook.com/GoBoostly",
        "https://www.crunchbase.com/organization/boostly"
    ],
    "logo_path": "data/logos\\Boostly_logo.png"
}