{
    "links": "https://www.ycombinator.com/companies/borong",
    "name": "borong",
    "headline": "borong is a SaaS-enabled marketplace that connects brands likeâ\u0080¦",
    "batch": "W20",
    "description": "Our mission is to help local independent retailers find their best-sellers investors by matching them with the right supplier and brands.\r\n\nWe believe that today's evolution of the wholesale industry has stifled the growth of many SME businesses. The supply-chain in Malaysia and across Southeast Asia lacks meaningful real-time connectivity between suppliers and retailers. Hence we are determined to transform this industry by providing businesses the right tools to grow.\r\n\nOur modern, digital approach to the wholesale industry allows retailers to discover, purchase, and manage inventories for their store - all on a single marketplace platform. And our software tool for suppliers helps businesses to deal with all the pain points of growing customer database, from ordering to payments.\r\n\nWith our data-driven approach, we connects local, independent retailers with the right brands, distributors, and wholesalers to stock their store with the best products. This saves retailers and suppliers time and money, allowing them to focus on what's most important: building and running their business.\r\n\nborong is headquartered in Kuala Lumpur, Malaysia.",
    "activity_status": "Active",
    "website": "https://www.borong.com/",
    "founded_date": 2017.0,
    "team_size": 80.0,
    "location": "Kuala Lumpur, Malaysia",
    "group_partner": "Gustaf Alstromer",
    "group_partner_yc": "https://www.ycombinator.com/people/gustaf-alstromer",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:marketplace; industry:saas; industry:b2b",
    "founders": [
        {
            "name": "Lennise Ng, Founder",
            "description": "CEO and Co-Founder of Dropee - a B2B eCommerce marketplace that simplifies wholesale. We help mom-and-pop stores find the right products from the right suppliers.",
            "linkedin": "https://www.linkedin.com/in/lenniseng"
        },
        {
            "name": "Aizat Rahim, Founder",
            "description": "Co-founder of Dropee.",
            "linkedin": "https://www.linkedin.com/in/aizatrahim/"
        },
        {
            "name": "Haslinda Rasip, Founder",
            "description": null,
            "linkedin": "https://www.linkedin.com/in/lindarasip/"
        }
    ],
    "status": true,
    "generated_description": "### Borong: Connecting Brands and Retailers in Southeast Asia\n\n**Overview**\nBorong is a rapidly growing SaaS-enabled marketplace based in Kuala Lumpur, Malaysia. Founded in 2017 and part of the Y Combinator Batch W20, Borong addresses a critical gap in the wholesale industry of Southeast Asia, particularly in Malaysia. With a team of around 80 employees, the company's primary mission is to help local independent retailers find the best products by connecting them with suitable suppliers and brands.\n\n**The Problem**\nThe wholesale sector often stymies the growth of small and medium enterprises (SMEs) due to a lack of real-time connectivity between retailers and suppliers. Borong is tackling this issue head-on, recognizing the need for modern solutions in a market that has lagged behind in terms of digital integration.\n\n**The Solution**\nBorong provides a single platform where retailers can discover, purchase, and manage their inventory efficiently. By leveraging a data-driven approach, the platform connects retailers with the right distributors and wholesalers, saving them valuable time and resources. This alleviates many operational headaches, allowing businesses to focus on their core activities—namely, building and running their ventures.\n\nOn the supplier side, Borong offers tools to simplify processes from ordering to payments, empowering them to grow their customer databases with ease.\n\n**Key Features**\n- **Marketplace for Buyers**: Retailers can browse a wide range of products tailored to their needs.\n- **Supplier Tools**: Essential resources that help suppliers manage orders and payments.\n- **Data-Driven Matching**: Connects retailers with the most suitable brands for optimal stock selection.\n\n**Company Details**\n- **Founded**: 2017\n- **Location**: Kuala Lumpur, Malaysia\n- **Headcount**: 80 employees\n- **Key Partner**: Gustaf Alstromer\n\n**Tags**: Marketplace, SaaS, B2B\n\nFor more information, you can visit their website at [Borong](https://www.borong.com/). \n\nIn a nutshell, Borong embodies the promise of modern commerce—streamlining the wholesale process and empowering local businesses to thrive in an interconnected world. They’re doing important work, and their approach could be a game-changer for the region’s retail landscape.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/d0010565ea85054fbac5b5fb6c0b4f5b613829d1.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191029Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=c135f7a493093b374034b8c8711ee4b6eb9e95e2d27f8f24008b871d0eb83a77",
    "social_links": [
        "https://www.linkedin.com/company/borong-malaysia/",
        "https://twitter.com/dropeeofficial/",
        "https://www.facebook.com/dropeeofficial/",
        "https://www.crunchbase.com/organization/dropee-com"
    ],
    "logo_path": "data/logos\\borong_logo.png"
}