{
    "links": "https://www.ycombinator.com/companies/botbuilt",
    "name": "BotBuilt",
    "headline": "We use robots to build houses.",
    "batch": "W21",
    "description": "BotBuilt is creating flexible robotic systems to solve the housing crisis. Our cutting-edge software and cost-efficient hardware allow us to improve the world by providing beautiful construction, safer job sites, and sustainable building techniques. The $600 billion residential construction industry is facing a massive labor shortage. Our robotic systems leverage the latest in rapid prototyping, artificial intelligence, and computer vision. By taking on some of the hardest technical challenges on earth, BotBuilt is ready to help solve one of society’s biggest problems.",
    "activity_status": "Active",
    "website": "https://www.botbuilt.com",
    "founded_date": 2020.0,
    "team_size": 8.0,
    "location": "Durham, NC",
    "group_partner": "Aaron Epstein",
    "group_partner_yc": "https://www.ycombinator.com/people/aaron-epstein",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:robotic-process-automation; industry:robotics; industry:construction; industry:housing",
    "founders": [
        {
            "name": "Brent Wadas, Founder",
            "description": "From Scottsdale, AZ. Always hungry. Always creating. Grew up in music and business. Started an RIA and a SaaS company while in college, sold out, became an Army officer. Worked in Special Operations, had a blast. Civilian again, grad school at Georgetown for technology and business, consulting for the Sensitive Activities community. Developed BotBuilt with my co-founders. We're here to change the world.",
            "linkedin": "https://www.linkedin.com/in/brentwadas/"
        },
        {
            "name": "Barrett Ames, Founder",
            "description": "I build robots. I've logged time and software on NASA's valkyrie, robonaut 2, robosimian, Baxter, ATLAS, Kinova Jaco, Fetch, and Denso. \n\nTech co-founder at BotBuilt. We're going to build a brighter future by bringing robotics to construction. \n\nWhen I'm not busy building robots, I'm playing with my kids or cooking.  \n\nLocation: Durham, NC",
            "linkedin": "https://www.linkedin.com/in/cbames/"
        },
        {
            "name": "Colin Devine, Founder",
            "description": "I grew up in beautiful northwest Arkansas, under the shadow of gigantic companies like Walmart, JB Hunt, and Tyson Foods. I learned from some of the best entrepreneurial mentors in the world, so finding the right idea for a startup was always on my mind while I earned my BA and MA from the University of Notre Dame and Yale University. While pursuing a Ph.D. at Duke University in political science focused on housing policy, I co-founded BotBuilt with Brent and Barrett.",
            "linkedin": "https://www.linkedin.com/in/colin-devine-2b500b1aa/"
        }
    ],
    "status": true,
    "generated_description": "### BotBuilt: Revolutionizing Construction with Robotics\n\n**Overview**  \nFounded in 2020 and hailing from Durham, NC, BotBuilt is tackling the housing crisis through innovative robotics. As part of Y Combinator's W21 batch, the company is leveraging cutting-edge technology to reshape how homes are built. With a small but dedicated team of just 8 employees, they are set on making significant waves in the $600 billion residential construction industry that currently faces a severe labor shortage.\n\n**Mission**  \nBotBuilt's mission is simple yet profound: \"We use robots to build houses.\" They're committed to providing a solution that yields beautiful, reliable construction while ensuring job sites are safer and techniques sustainable.\n\n**What They Do**  \nAt its core, BotBuilt has created flexible robotic systems that integrate advanced software, artificial intelligence, and computer vision. This technology allows them to take on some of construction's toughest challenges, from improving project timelines to minimizing waste and risk on-site. Here’s how it works in three steps:\n1. **Digitization**: Their software takes your plan and digitizes it.\n2. **Precision Construction**: Homes are constructed to exact specifications, ensuring high quality.\n3. **Ready to Assemble**: Components arrive on-site, making assembly quick and efficient.\n\n**Benefits**  \nBotBuilt’s approach transforms construction into a process that is:\n- **Better**: Robotics ensure exceptional quality control with repeatable precision.\n- **Faster**: With robot-built components, framing is completed in hours, not weeks.\n- **Safer**: Robots mitigate the dangers associated with traditional framing work.\n- **Sustainable**: Advanced software optimizes material use, significantly reducing waste.\n- **Affordable**: Eliminating weather delays and inefficiencies allows for consistent productivity.\n\n**Testimonials**  \nCustomers are impressed with BotBuilt’s impact. Industry experts highlight the company's role in pushing for necessary innovation to solve housing shortages. From builders who appreciate the speed and precision to industry leaders recognizing the urgent need for such transformative technology, the feedback is overwhelmingly positive.\n\n**Vision**  \nBotBuilt doesn’t just aim to build houses; they aspire to create homes that people can afford. Their vision includes a future where every individual has access to safe and beautiful living spaces.\n\n**Want to Learn More?**  \nFor further exploration of BotBuilt’s innovative solutions and to keep abreast of their latest developments, check out their official [website](https://www.botbuilt.com).\n\nIn summary, BotBuilt is transforming the construction landscape. By employing robots to build homes, they are addressing a critical issue head-on while redefining what efficient, safe, and sustainable construction can look like. In a world increasingly reliant on technology, BotBuilt stands out as a beacon of what’s possible when innovation meets necessity.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/bb98d2f4ec8f74d104fcb36084dbd671a5b8b064.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191029Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=7aebc4d570ce9762faa22f78006fccc7658cd21e8e45daefb8f40bbed4689abf",
    "social_links": [
        "https://www.linkedin.com/company/botbuilt"
    ],
    "logo_path": "data/logos\\BotBuilt_logo.png"
}