{
    "links": "https://www.ycombinator.com/companies/boundary-layer-technologies",
    "name": "Boundary Layer Technologies",
    "headline": "Zero emissions foiling boats and ships",
    "batch": "W19",
    "description": "Boundary Layer Technologies is building the next generation of water mobility, starting with a ultra-performances electric foiling water craft called Valo. \r\n\nValo flies 2ft above the water at 58mph, in silence, with no waves or emissions, and will be the most exhilarating thing on the water.",
    "activity_status": "Active",
    "website": "https://ridevalo.com",
    "founded_date": 2018.0,
    "team_size": 5.0,
    "location": "Alameda, CA",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:transportation; industry:climatetech; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Jeremy Osborne, Founder",
            "description": "Jeremy is the co-founder and CEO of Electric Air, on a mission to lower the cost of heat pumps for a brighter future. He is a renewable energy engineer with over a decade of experience working on heat pump systems. He's a two-time Y Combinator founder, having started Boundary Layer Technologies (W19).",
            "linkedin": "https://linkedin.com/in/jezosborne"
        },
        {
            "name": "Ed Kearney, Founder/CEO",
            "description": null,
            "linkedin": "https://au.linkedin.com/in/ed-kearney"
        }
    ],
    "status": true,
    "generated_description": "**Boundary Layer Technologies: A New Wave in Water Mobility**\n\nFounded in 2018 and part of Y Combinator Batch W19, Boundary Layer Technologies is on a mission to reinvent marine transportation with a strong commitment to zero-emission solutions. Located in Alameda, CA, and operating with a small, dedicated team of just five, the company is set to change the way we think about watercraft.\n\nAt the heart of their innovation is the **Valo**, an ultra-performance electric foiling watercraft that flies two feet above the water at an impressive 58 mph. But it's not just about speed; the Valo operates in near silence, producing no waves and crucially, no emissions. This makes it not only exhilarating to ride but also environmentally friendly—ideal in today's climate-conscious world.\n\nThe technology behind the Valo is not just some fancy gimmick. It integrates advanced electric propulsion with hydrofoil wings, struts, control surfaces, and self-stabilization software. Together, these elements enable vessels to achieve **90% less energy consumption** and a **fourfold increase in range** compared to traditional electric boats. This means more adventure on the water without the guilt of pollution or the jarring experience of rough waves.\n\nBoundary Layer Technologies is not just about crafting exceptional vehicles—it's about revolutionizing the entire industry. Their hydrofoil systems are designed to be adaptable, with the potential to enhance a range of commercial and recreational boats from 14 to 45 feet, making it accessible to various manufacturers without significant modifications.\n\nAs they prepare to launch the Valo Hyperfoil in 2025, the company is backed by over 40 years of hydrofoil experience within its team. This expertise is what ensures that their systems not only perform remarkably but are also reliable, promising an unmatched experience for users.\n\nWith a reality of dwindling natural resources and increasing environmental concerns, Boundary Layer Technologies stands at the forefront of a significant shift in transportation. As Ed Kearney, the CEO, aptly puts it, “The last time there was such a step change in transport technology was the turbofan jet engine.” Hydrofoils are poised to be the next monumental leap.\n\nFor more information or to dive into the future of watercraft, visit [RideValo](https://ridevalo.com). \n\n### Tags: \n- Transportation\n- Climate Tech\n- San Francisco Bay Area \n\nIn conclusion, if you're looking to embrace a thrilling and sustainable way to navigate the waters, keep an eye on Boundary Layer Technologies and the Valo. This is innovation that not only excites but also aligns with a healthier planet.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/4f127a8765447c020325d9cbb9b4c702674bc82b.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191030Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=89cc0fe25039483f84181f93ef646ea1884cc659439b927bcb2ace601093bcec",
    "social_links": [
        "https://www.linkedin.com/company/ridevalo",
        "https://twitter.com/ridevalo",
        "https://www.crunchbase.com/organization/boundary-layer-technologies"
    ],
    "logo_path": "data/logos\\Boundary_Layer_Technologies_logo.png"
}