{
    "links": "https://www.ycombinator.com/companies/boundary",
    "name": "Boundary",
    "headline": "Function calling that's cheaper, faster, and better, on every model",
    "batch": "W23",
    "description": "Boundary makes tools to build the most reliable AI pipelines. We take a code first approach and everything lives in your code, and runs locally (completely open-source!).\r\n\nInstead of function-calling on openai and JSON.parse, our approach allows you to write shorter prompts that lead to more accurate results. No fine-tuning. No modifying the model.\r\nThat means less time prompt engineering to get the same quality results.\r\n\nRecently, we showed that our method makes GPT-3.5, GPT-4o-mini, and Claude-Haiku perform at the same level as GPT-4o without (of course GPT-4o gets better with us as well). Read more here: https://www.boundaryml.com/blog/sota-function-calling\r\n\nBoundary is composed of three main components:\r\n\n1. BAML - a simple programming language to get structured outputs from LLMs.\r\n2. BAML Playground - The first-ever VSCode playground for LLMs, that helps developers test and iterate on their AI functions.\r\n3. Boundary Studio - An analytics dashboard to trace, label, and measure performance.\r\n\nBoundary's mission is to make AI app development seamless, and supports the entire development journey, from initial prompt iteration to measuring performance post-deployment.",
    "activity_status": "Active",
    "website": "https://www.boundaryml.com",
    "founded_date": 2023.0,
    "team_size": 3.0,
    "location": "Seattle, WA",
    "group_partner": "Dalton Caldwell",
    "group_partner_yc": "https://www.ycombinator.com/people/dalton-caldwell",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:artificial-intelligence; industry:developer-tools; industry:generative-ai; industry:machine-learning; industry:ai; location:seattle",
    "founders": [
        {
            "name": "Vaibhav Gupta, Founder",
            "description": "Vaibhav is a software engineer with over 7 years of experience building innovative products. At Microsoft, he worked on realtime 3D reconstruction for HoloLens, gaining expertise in computer vision and 3D graphics. At Google, he led performance optimization on ARCore and Face ID, significantly improving latency and quality. Now he's bringing that same experience to help bring better quality and speed to Generative AI technology. For talking anything Computer Vision/AI/Performance, reach out!",
            "linkedin": "https://www.linkedin.com/in/vaigup/"
        },
        {
            "name": "Aaron Villalpando Gonzalez, Founder",
            "description": "Aaron has worked for the better part of a decade scaling out distributed systems at AWS and launching full-stack consumer facing products at Prime Video. He is now passionate about building scalable ML infrastructure and the best developer experience at Gloo.",
            "linkedin": "https://www.linkedin.com/in/aaron-villalpando-99284576/"
        }
    ],
    "status": true,
    "generated_description": "**Boundary: Revolutionizing AI Development**\n\nFounded in 2023 and hailing from the vibrant tech hub of Seattle, Boundary is a startup making waves in the artificial intelligence space. They’re on a mission to make function calling in AI models **cheaper, faster, and better**—an ambitious goal that reflects a deeper understanding of what developers need in an increasingly competitive landscape.\n\n**What’s Boundary’s Big Idea?**\n\nInitially, Boundary focused on crafting tools for building reliable AI pipelines, adopting a code-first approach. This means your AI functions reside in your code and run locally—no server-side dependencies. And here’s the kicker: it’s completely open-source. By moving away from traditional function calling methods like JSON.parse, Boundary allows developers to write shorter, more effective prompts that yield more precise results—without the hassle of fine-tuning or altering the model.\n\nTheir remarkable technique has shown that models like GPT-3.5 and GPT-4o-mini can perform at par with GPT-4o, showcasing the transformative potential of their approach. For the technical aficionados, this isn’t just a promise; it’s been validated through **state-of-the-art performance metrics**. \n\n**Core Offerings**\n\nBoundary is built around three main components:\n\n1. **BAML:** A user-friendly programming language for generating structured outputs from large language models (LLMs).\n2. **BAML Playground:** The first VSCode playground tailored for developers to test and iterate on their AI functions—think of it as an interactive workshop for coders.\n3. **Boundary Studio:** An analytics dashboard that helps you trace, label, and measure your AI's performance post-deployment.\n\nTogether, these tools simplify the entire AI app development journey—from the initial prompt iteration phase to monitoring results after launch.\n\n**Backed by Experience**\n\nBoundary is part of the Y Combinator Batch W23 and may be fresh on the scene, but it boasts a talented team of three, including prominent Group Partner Dalton Caldwell guiding the way. This small but mighty team is passionate about eliminating the complexity traditionally associated with AI development.\n\n**The Community and Future Vision**\n\nBoundary is not just about technology; they’re building a community. They encourage developers to share their experiences on Discord and participate in ongoing conversations around AI innovation. Interested developers can try out their offerings, join the community, or even connect directly with a founder to discuss future prospects.\n\nExplore more at [Boundary's website](https://www.boundaryml.com), where you’ll find demos, documentation, and resources tailored for developers eager to advance their AI skills. With Boundary, coding AI doesn't just become easier—it becomes an exciting playground for innovation.\n\n**Key takeaways:**\n- **Location**: Seattle, WA\n- **Founded**: 2023\n- **Team Size**: 3 employees\n- **YC Batch**: W23\n- **Focus Areas**: Artificial Intelligence, Developer Tools, Generative AI\n- **Components**: BAML, BAML Playground, Boundary Studio\n\nBoundary is not just a new tool in the developer toolbox; it’s a paradigm shift in how we build and interact with AI models. Get ready to redefine what’s possible in your AI applications.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/2332d905a21861e60543eb9148bae7341c27a58d.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191030Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=5394778fce405a422e4acd280f8425bfe73f241f04dffb155dc4a4dfe2956661",
    "social_links": [
        "https://www.linkedin.com/company/boundaryml",
        "https://twitter.com/boundaryml",
        "https://github.com/boundaryml/baml"
    ],
    "logo_path": "data/logos\\Boundary_logo.png"
}