{
    "links": "https://www.ycombinator.com/companies/breathe-well-being",
    "name": "Breathe Well-being",
    "headline": "A digital well-being program to help people prevent or manage chronicâ\u0080¦",
    "batch": "W20",
    "description": "Breathe Well-being helps people prevent or manage chronic lifestyle diseases by losing weight through its digital therapeutics program (weight-loss clinic in a cloud, think Noom for India). The program is delivered remotely over the phone and through the mobile app, therefore users are able to follow the lifestyle program from the convenience of their home. Our online program is 3X more effective at 1/4th the cost.\r\n\nThe user receives bi-weekly 1-1 coaching focused on behavioral changes, online community for support and motivation, and a mobile app that provides educational lessons, lifestyle tracking tools and weekly challenges (gamification). The content and behavioral change techniques are centred around healthy diet, fitness, lifestyle and stress reduction.\r\n\nOur unique coaching methodology employs cognitive behavioral therapy (CBT), goal-oriented treatment and self-efficacy enhancement. The coach helps the user bust negative emotions of past failures in weight-loss and increase motivation by linking short-term achievable goals with the user's personal values. Through the program, the user is able to self-identify triggers of unhealthy habit adoption and make better decisions.\r\n\nBreathe Well-being has demonstrated success in helping people lose weight, build long-term healthy habits and reduce/eliminate medication for lifestyle diseases (example - Type 2 Diabetes). We are looking for ideas to improve our sales processes so that we can get users to enrol at a higher conversion rate post our 1-week free trial. We need to identify triggers when users are most likely to pay and provide them with a seamless process for paying on-the-spot.",
    "activity_status": "Active",
    "website": "http://www.breathewellbeing.in",
    "founded_date": null,
    "team_size": 15.0,
    "location": "New Delhi, India",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:health-tech; industry:health-&-wellness",
    "founders": [],
    "status": true,
    "generated_description": "**Breathe Well-being Summary**\n\nBreathe Well-being is an innovative digital health startup based in New Delhi, India, focused on helping people prevent and manage chronic lifestyle diseases, particularly through weight loss and diabetes reversal. Founded as part of Y Combinator's Winter 2020 batch, the company operates like a weight-loss clinic in the cloud—imagine Noom, but tailored to the Indian market.\n\n### Mission\nThe core mission of Breathe Well-being is straightforward: to provide a comprehensive digital well-being program that empowers individuals to take control of their health, primarily by focusing on behaviors that lead to sustainable weight loss and management of chronic conditions like Type 2 Diabetes.\n\n### Program Overview\nBreathe Well-being's program is delivered remotely via a mobile app and phone-based coaching, making it super accessible. Users can partake in bi-weekly one-on-one coaching sessions focusing on behavioral changes, supplemented by a supportive online community and a variety of tracking tools and educational resources. The gamification aspect—like weekly challenges—keeps users motivated and engaged.\n\nBy utilizing cognitive behavioral therapy (CBT), Breathe Well-being's coaching methodology encourages users to dismantle negative thought patterns associated with past health failures, linking achievable short-term goals to their personal values. The result? Users learn to identify their own triggers for unhealthy habits and make better lifestyle choices.\n\n### Effectiveness\nTheir approach has proven effective: users have reported significant weight loss and reduced or eliminated reliance on medications for chronic conditions. For instance, statistics indicate that 84% of participants have reduced their dependency on medication, and 90% of participants experience a decrease in HbA1c levels, a key marker in diabetes management.\n\n### Business Needs\nCurrently, Breathe Well-being is grappling with improving their sales processes—specifically, they want to increase the conversion rates of users who complete their one-week free trial. They aim to identify triggers that prompt users to enroll and streamline the payment process to make it as seamless as possible.\n\n### Team and Expertise\nBreathe Well-being operates with a small, dedicated team of 15, leveraging the expertise of over 100 health coaches, dietitians, and diabetologists. Their professional backgrounds are diverse, with each team member bringing significant experience in areas like endocrinology, nutrition, and fitness to support users on their health journeys.\n\n### Summary\nBreathe Well-being is on a mission—specifically, they aspire to reverse diabetes in one million Indians by 2025. They blend technology with human compassion to offer users not just a program, but a transformational journey towards better health. Check out their offerings at their website: [Breathe Well-being](http://www.breathewellbeing.in).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/2baf0b0d631795ab334ce0ae171e90067777447f.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191032Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=bdcfad17b5763135e877d30e6ffbbec50ec4328d97ebacb14d23f9159ccafaff",
    "social_links": [],
    "logo_path": "data/logos\\Breathe_Well-being_logo.png"
}