{
    "links": "https://www.ycombinator.com/companies/bright",
    "name": "Bright",
    "headline": "Sunrun for the developing world",
    "batch": "W15",
    "description": "Bright is Mexico’s #1 residential solar provider (think Sunrun for the developing world, starting first in Mexico). We provide the financing and software that enable thousands of student ambassadors and retail promoters to offer cheaper electricity to homes at no upfront cost, and we work with our network of hundreds of local installers and distributors to satisfy the resulting demand. Our first market is Mexico, which has more sun, higher electricity rates, and lower labor costs than the US. Bright's investors include First Round Capital, Y Combinator, and other top Silicon Valley firms.",
    "activity_status": "Active",
    "website": "https://www.thinkbright.mx",
    "founded_date": 2014.0,
    "team_size": 100.0,
    "location": "Mexico City, Mexico",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:solar-power; industry:climate",
    "founders": [
        {
            "name": "Jonah Greenberger, Founder",
            "description": "Jonah Greenberger is a co-founder of Bright, a Y-Combinator and First Round Capital company delivering solar subscriptions to homes in developing countries, first Mexico. He was most recently a Director at Chevron, where he helped build a renewable energy investment and construction group. Jonah received his MS in Thermodynamics and BS in Mechanical Engineering from Stanford University, where he was a Mayfield Fellow.",
            "linkedin": "http://www.linkedin.com/in/jonahgreenberger/"
        }
    ],
    "status": true,
    "generated_description": "**Bright: Bringing Solar Solutions to Mexico and Beyond**\n\nFounded in 2014 and hailing from Mexico City, Bright operates with a vision reminiscent of Sunrun but aimed at transforming the energy landscape for the developing world. They are Mexico’s leading residential solar provider, effectively harnessing the country's abundant sunlight and comparatively high electricity rates to deliver substantial savings to households.\n\n**What Does Bright Do?**  \nBright specializes in providing solar energy solutions without requiring any upfront investment. They empower a network of student ambassadors and retail promoters, enabling them to offer cheaper electricity options to local households. Their approach hinges on innovative financing and sophisticated software that streamlines the solar installation process.\n\nThe company collaborates with hundreds of local installers to address demand, focusing initially on the Mexican market, where they see a unique opportunity due to the region's favorable solar conditions and labor costs.\n\n**Impressive Footprint and Support**  \nBright is backed by notable investors including First Round Capital and Y Combinator, who helped launch them in the Winter 2015 batch. With a dedicated team of around 100 employees, they have successfully installed over **40,000 kW** of solar power for more than **6,000 customers** across **20 states** in Mexico.\n\n**Offering Versatile Solutions**  \nTheir services cater to various sectors, including residential, commercial, and industrial clients. Bright’s Premium Service includes comprehensive support—from installation to navigating the bureaucratic red tape associated with integrating solar energy systems, ensuring transparency with no hidden fees.\n\n**Commitment to Sustainability**  \nBright's mission transcends mere profit; it’s rooted in fostering sustainable energy practices and making solar accessible to all. The company prioritizes partnerships with esteemed institutions like the Inter-American Development Bank, drawing insights from industry leaders to refine its offerings continuously.\n\n**User Experience and Testimonials**  \nClients appreciate Bright for their professionalism and the tangible savings noted in their electricity bills. One user remarked on the immediate impact of solar installation on reducing energy costs, while another praised the service's transparency and reliability in an unpredictable market. \n\n**Conclusion**  \nAs Bright continues to illuminate homes and businesses in Mexico, they pave the way for future innovations in solar energy access, inspired by a vision that can ultimately expand to other developing markets. With a strong foothold and robust support systems in place, Bright is well-positioned to lead the solar revolution in the region. \n\nFor more information, check out their website at [Think Bright](https://www.thinkbright.mx).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/23e528ef298c1a03c0a08f84e259e719c17b5977.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191033Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=32d591d48c86027401b1b8d21014fb2ebd00c7471ecd50ae0adecb0d5c86897e",
    "social_links": [
        "https://www.linkedin.com/company/9506733/",
        "https://www.crunchbase.com/organization/bright-3"
    ],
    "logo_path": "data/logos\\Bright_logo.png"
}