{
    "links": "https://www.ycombinator.com/companies/brown-foods",
    "name": "Brown Foods",
    "headline": "Making 'REAL' Milk without any Cows!",
    "batch": "W22",
    "description": "Brown Foods is a Stanford, Rice University and IIT Delhi alumni venture building the next-generation of food products. They are creating UnReal Milk- lab based, clean milk - extremely sustainable 'real milk' but made without any cows. Unlike any other option in the USD 22 billion dairy alternatives market today, it will be exactly similar to cow’s milk in terms of nutritional profile, taste, texture and could also be processed into butter, cheese and ice creams. They envision to disrupt the USD 700 billion conventional dairy market by giving the world its 1st 'cow free' real milk option, reducing the carbon footprint of milk by over 90% while being completely cruelty-free.",
    "activity_status": "Active",
    "website": "https://unrealmilk.com/",
    "founded_date": 2021.0,
    "team_size": 5.0,
    "location": "Boston",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:cellular-agriculture; industry:biotech; industry:climate; industry:food-tech; location:boston",
    "founders": [
        {
            "name": "Sohail Gupta, Founder",
            "description": "A Stanford alumnus and Indian Institute of Technology (IIT) Delhi graduate; Patent holder;  9+ years of work exp. in food and healthcare across India, USA and Middle East (with global brands like Starbucks) and was building the world's 1st personalised food brand recently. His experience as a vegetarian and his spouse's struggle with milk during pregnancy led him to UnReal Milk - leveraging his synthetic biology education, Bio-design training at Stanford and several years of business experience.",
            "linkedin": "https://www.linkedin.com/in/sohail-gupta-b4226412/"
        },
        {
            "name": "Avhijeet Kapoor, Founder",
            "description": "A passionate bioengineer, always eager to tackle tech hurdles and challenge dogma! \nTrained in Biotechnology with minors in Computer Science at IIT Delhi; worked at Harvard and CEA Paris; and experienced with control systems and reactor design for robust bioprocess systems.\nHas additional experience in business consulting for food and healthcare companies such as Epigamia, Novartis, Milkbasket etc., along with a rich perspective on understanding end consumers.",
            "linkedin": "https://www.linkedin.com/mwlite/in/avhijeet-kapoor-b68b2210"
        },
        {
            "name": "Bhavna Tandon, Founder",
            "description": "A graduate of Rice University and Indian Institute of Technology (IIT), Delhi; molecular biology and biochemistry PhD with 3+ years experience working as a scientist on cell culture and model organisms; 6 published papers in internationally recognized journals; passionate about leveraging technology to combat climate change",
            "linkedin": "https://www.linkedin.com/mwlite/in/bhavna-tandon"
        }
    ],
    "status": true,
    "generated_description": "**Brown Foods: Revolutionizing Dairy with UnReal Milk**\n\nBrown Foods, the brainchild of a group of ambitious alumni from Stanford, Rice University, and IIT Delhi, launched in 2021 with a lofty mission: to make 'REAL' milk without any cows. Nestled in Boston and part of Y Combinator's Batch W22, this innovative startup is on a trajectory to disrupt the $700 billion conventional dairy market by introducing UnReal Milk — a lab-based, clean milk alternative that mirrors cow's milk in taste and nutritional benefits, but without the environmental and ethical concerns associated with animal agriculture.\n\nTheir vision is compelling. By using biotechnology to produce milk directly from cells rather than requiring cows, Brown Foods aims to cut the carbon footprint of traditional dairy by over 90%. This is not just a win for the planet; it’s a leap towards cruelty-free consumption for dairy lovers.\n\nWhether you’re a fan of butter, cheese, or ice cream, the potential applications of UnReal Milk are vast, positioning it uniquely in the $22 billion dairy alternatives space. Imagine enjoying your favorite dairy products without the associated guilt — that’s the promise Brown Foods is bringing to consumers.\n\nThe company is currently a lean operation, consisting of a five-member team guided by their group partner, Nan. This small yet ambitious team has partnered with advisors from renowned institutions like MIT and Harvard, further enhancing their credibility and expertise in molecular biology and food technology. \n\nAs they continue to innovate in fields like cellular agriculture and food tech, Brown Foods is not only pushing the boundaries of how we think about milk but also inviting consumers to rethink their choices. If you’re curious to join this milk revolution, visit their website at [UnReal Milk](https://unrealmilk.com/), and keep an eye on this emerging player in the food-tech sector. \n\nIn the witty words shared by the Brown Foods team, they’re truly “moo-ving” us towards a sustainable future—one glass at a time.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/279b6a35739623d6a8a7fbd8de134d5ce825a79c.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191033Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=9e7a893366a326d9200f11c9d1ed4dac3321253486f6298d697cd375fe347d7c",
    "social_links": [
        "https://www.linkedin.com/company/brownfoods/",
        "https://twitter.com/BrownFoods1",
        "https://www.facebook.com/Brown-Foods-104185258844761"
    ],
    "logo_path": "data/logos\\Brown_Foods_logo.png"
}