{
    "links": "https://www.ycombinator.com/companies/bucket-robotics",
    "name": "Bucket Robotics",
    "headline": "Defect detection for manufacturing built from CAD and synthetic data.",
    "batch": "S24",
    "description": "250M lbs of plastic is wasted annually in US manufacturing. Bucket Robotics is making defect detection faster and easier to deploy to prevent that.\r\n\nOur products are designed to be easy to integrate into existing automation and technology stacks, flexible enough to bring retooling costs down, and reliable enough to make you forget that it's a robot.\r\n\nMatt and Steph are leveraging their experience from the self-driving industry, where we've integrated high-performance computing and quality sensing into complex, noise-filled environments. We focus on robust hardware and user-friendly software for a new generation of end-users, ensuring ease of use and rapid deployment.\r\n\nSecure and efficient handling of user data can make customers in the manufacturing space nervous to invest in sensing — our team's extensive experience handling self-driving car data in these regulated environments positions us uniquely to tackle these challenges. Companies like Keyence, National Instruments, and FLIR offer either outdated hardware or prohibitively expensive systems, along with software that hasn’t evolved to meet modern user needs.\r\n\nUS manufacturing is undergoing a significant transformation, with construction spending hitting a record annualized pace of over $200 billion. The need for a more reliable supply chain has seen over $700 billion in manufacturing megaprojects across North America since 2021, and this growth requires heavy automation. Bucket Robotics is at the forefront of this shift, offering a scalable, cost-effective solution that enhances automation and positions manufacturers closer to their end customers.",
    "activity_status": "Active",
    "website": "https://bucket.bot",
    "founded_date": 2024.0,
    "team_size": 2.0,
    "location": null,
    "group_partner": "Diana Hu",
    "group_partner_yc": "https://www.ycombinator.com/people/diana-hu",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": null,
    "founders": [
        {
            "name": "Matt Puchalski, Founder/CEO",
            "description": "Matt is co-founder and CEO of Bucket Robotics. \n\nBefore co-founding Bucket Robotics, Matt distinguished himself in the autonomous vehicle industry through pivotal roles at Stack AV, Latitude AI, and Argo AI. His work at these companies brought the deployment of autonomous vehicles to public roads across the United States and Germany. With deep expertise in integrating and operationalizing AVs, Matt brings a unique vision to revolutionize the robotics industry.",
            "linkedin": "https://www.linkedin.com/in/matt-puchalski/"
        },
        {
            "name": "Steph Wolski, Founder/CTO",
            "description": "Steph is co-founder and CTO of Bucket Robotics.\n\nSteph began college at the age of 13 and started working in robotics at 18. He was the Remote Guidance Tech Lead at Argo AI where he met Matt. Later, Steph was an early engineer at Stack AV, working on the Autonomy Integration team where he stood up core infrastructure for their self-driving trucks.",
            "linkedin": "https://www.linkedin.com/in/stephan-wolski/"
        }
    ],
    "status": true,
    "generated_description": "**Bucket Robotics**: Redefining Defect Detection for Manufacturing\n\nFounded in 2024 and part of Y Combinator's Batch S24, Bucket Robotics is tackling a pressing issue: the staggering 250 million pounds of plastic wasted annually in U.S. manufacturing. Their mission? To make defect detection in manufacturing both faster and easier to deploy, helping manufacturers minimize waste and enhance sustainability.\n\nAt its core, Bucket Robotics specializes in AI-powered vision systems for defect detection in processes like injection molding and casting. They offer a diverse range of products that integrate seamlessly into existing automation setups, adapting to the needs of each customer with minimal retooling costs—it's designed to be so reliable that you might just forget it's a robot.\n\n**The Team**: A Unique Background\n\nLed by co-founders Matt and Steph, the team brings invaluable experience from the self-driving car industry, focusing on high-performance computing and quality sensing in complex environments. Their approach marries robust hardware with user-friendly software, aiming to empower a new generation of end-users while enabling rapid deployment.\n\n**Tackling Data Security Concerns**\n\nData handling is a major concern in manufacturing, especially regarding sensing technologies. Bucket Robotics stands apart with its extensive experience in handling sensitive data from regulated environments. This gives them a unique edge over competitors like Keyence and FLIR, which might offer outdated or prohibitively expensive solutions.\n\n**Market Opportunity and Growth**\n\nThe U.S. manufacturing landscape is evolving, with construction spending soaring past $200 billion annually. The rise of megaprojects necessitates heavy automation—an area where Bucket Robotics excels. By providing scalable, cost-effective solutions, they enhance automation and help manufacturers stay closer to their end customers.\n\n**Product Features and Capabilities**\n\n- **Pre-Manufacturing Deployment**: Implement defect detection before production begins to optimize quality from the get-go.\n- **Automated Model Refinement**: Continuously adapt and improve detection capabilities using real-world data.\n- **CAD-to-Model Conversion**: Quickly convert CAD files into detection models, keeping production lines efficient and active.\n- **Detailed Classification**: Accurately identify defects, aiding in optimizing tooling and maintenance strategies.\n\nWith a two-person team based in Pittsburgh and under the guidance of their Group Partner, Diana Hu, Bucket Robotics is poised for significant impact in the manufacturing sector. They aren't just offering a product; they're reshaping the future of manufacturing through innovative technology.\n\nFor more insights, explore their website at [Bucket Robotics](https://bucket.bot) and see how they are transforming the landscape of defect detection and automation.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/1659df5872ca6375614aeb343cc362bee1a4cb0b.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191033Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=ae80bad56af53b941e012c31eed6505f0ae60ad4c6da8848ce600a443ae74b48",
    "social_links": [
        "https://www.linkedin.com/company/bucketrobotics/",
        "https://x.com/BucketRobotics",
        "https://github.com/bucket-robotics"
    ],
    "logo_path": "data/logos\\Bucket_Robotics_logo.png"
}