{
    "links": "https://www.ycombinator.com/companies/buildzoom",
    "name": "BuildZoom",
    "headline": "BuildZoom is a better way to remodel. We connect homeowners to theâ\u0080¦",
    "batch": "W13",
    "description": "BuildZoom is a better way to remodel. We connect homeowners to the most reliable general contractors in their area and make remodeling simpler, cheaper and more predictable.  \r\n\nOur technology harvests public data on every licensed contractor in the United States, including license information, building permits, bond and insurance information and other government records. We use this public data along with private data gleaned from past BuildZoom marketplace interactions to evaluate contractor quality, availability, and fit for each construction project. Our goal is to help project owners arrive at several competitive bids from highly qualified and experienced construction companies to ensure a fair price and a successful project.\r\n\nWe build tools to help contractors look their best online, manage their lead pipeline, seamlessly interact with project owners, and compose professional bid proposals.",
    "activity_status": "Active",
    "website": "https://www.buildzoom.com",
    "founded_date": 2013.0,
    "team_size": 100.0,
    "location": "San Francisco",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:real-estate; industry:construction; location:san-francisco-bay-area",
    "founders": [],
    "status": true,
    "generated_description": "**BuildZoom: A Smarter Way to Remodel**\n\nFounded in 2013 and part of Y Combinator's W13 batch, BuildZoom is revolutionizing the way homeowners approach remodeling projects. Located in the heart of San Francisco, the company has swiftly grown a dedicated team of around 100 employees, all focused on one mission: making remodeling simpler, cheaper, and more predictable.\n\nSo, how does BuildZoom accomplish this? The company leverages cutting-edge technology to sift through public data on every licensed contractor across the United States. This includes everything from license and insurance information to building permits and past project records. By combining this public data with insights gained from previous interactions in their marketplace, BuildZoom can effectively evaluate contractor quality, availability, and the best fit for specific construction projects. \n\nThe process aims to connect homeowners with reliable general contractors in their local areas, ensuring they receive several competitive bids from experienced professionals. This not only helps in getting fair prices but also increases the odds of a successful remodeling project.\n\nBut BuildZoom doesn’t stop there. They also equip contractors with essential tools to bolster their online presence, manage leads, interact seamlessly with clients, and create professional bid proposals. This commitment to supporting contractors enhances the overall quality of the service they provide to homeowners.\n\nIn essence, BuildZoom is more than just a platform; it's a comprehensive resource for both homeowners and contractors. By leveraging data and technology, they are paving a better path for remodeling—one that prioritizes transparency and efficiency.\n\nFor more details, you can check out their website: [BuildZoom](https://www.buildzoom.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/c874ad19cc9ac1575e585178c32f2ab583347f8b.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191034Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=eed936c9319c7e730b49f2f41f9cab4ebacb6c3038f41a3a4e3949865802feb1",
    "social_links": [
        "https://www.linkedin.com/company/buildzoom/",
        "https://www.facebook.com/buildzoom",
        "https://www.crunchbase.com/organization/buildzoom"
    ],
    "logo_path": "data/logos\\BuildZoom_logo.png"
}