{
    "links": "https://www.ycombinator.com/companies/buildscience",
    "name": "BuildScience",
    "headline": "The operating system for commercial buildings.",
    "batch": "W15",
    "description": "Revolutionizing building management.\r\n\nOur platform allows building owners to deliver better customer service via custom software. We have deployed this in a 1M sq.ft. Class A office building, where we were able to lower operational expenses while improving tenant satisfaction.",
    "activity_status": "Active",
    "website": "http://www.buildscience.com/",
    "founded_date": 2015.0,
    "team_size": 1.0,
    "location": "Niagara Falls, NY",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:sustainability; industry:proptech; industry:energy",
    "founders": [],
    "status": true,
    "generated_description": "### BuildScience: Revolutionizing Building Management\n\n**Overview**\nFounded in 2015 and a proud participant in Y Combinator’s Winter 2015 batch, BuildScience is on a mission to become the go-to operating system for commercial buildings. Nestled in Niagara Falls, NY, the company has a small but ambitious team, eager to tackle the complexities of building management through technology.\n\n**What They Do**\nBuildScience has taken a fresh approach to building management by developing a platform that enables building owners to enhance customer service with tailored software solutions. Their flagship product, the Strata operating system, makes buildings smarter by seamlessly interfacing with existing hardware to collect real-time data, presenting it in a user-friendly dashboard. \n\nFor instance, at a 1 million square foot Class A office building, they successfully lowered operational expenses while boosting tenant satisfaction—quite an accomplishment in the field.  \n\n**Key Features of Strata**\n- **Single System Monitoring**: Control HVAC, lighting, and security from one platform.\n- **Easy Data Access**: Get insights without the hassle—data is integrated from a myriad of sources.\n- **Streamlined Management**: Simplified reporting and analytics help both tenants and operators manage resources effectively.\n- **Custom Development**: Create bespoke applications that meet specific needs.\n\n**Case Study Highlight**\nOne notable implementation of their system was with a Fortune 500 bank in Toronto. Not only did they achieve over a 40% increase in workforce productivity, but they also supported the building's LEED Platinum certification with a tailored monitoring solution for its intelligent spaces.\n\n**Core Values**\nBuildScience focuses heavily on sustainability and energy efficiency, reflecting their commitment to building environments where occupants feel comfortable and productive. By improving operational transparency and accountability, they create systems that not only support building needs but also contribute to broader environmental goals.\n\n**The BuildScience Team**\nThe company boasts a diverse group of engineering alumni from the University of Waterloo, bringing together experiences from Fortune 500 companies and startups alike. Their confidence stems from hands-on expertise in hardware, software, and power systems—tools they use to tackle real-world building challenges.\n\n**Getting In Touch**\nIf you’re interested in harnessing the power of smarter building management, you can request a demo or contact them directly through their website at [BuildScience.com](http://www.buildscience.com/). They’re ready to showcase how their innovative solutions can transform your building into a model of efficiency and tenant satisfaction.\n\nIn a nutshell, BuildScience is setting out to simplify the complexities of commercial building management, proving that modern challenges require modern solutions. As we look to the future, their emphasis on straightforward, effective technology could very well represent the next wave in proptech evolution.",
    "logo": "/logos/medium/missing.png",
    "social_links": [
        "https://www.crunchbase.com/organization/buildscience"
    ]
}