{
    "links": "https://www.ycombinator.com/companies/bulk-mro-industrial-supply",
    "name": "Bulk MRO Industrial Supply",
    "headline": "Full Stack Fintech and Supply Chain Platform for Global Trade",
    "batch": "W17",
    "description": "Bulk MRO is a Full Stack Fintech and Supply Chain Platform for Global Trade. \r\n\nWe provide our customers and suppliers turnkey solutions for procurement, sales and financing of long-tail industrial products (MRO items) as well as high value bulk commodities like agriculture, petroleum, and chemical products. \r\n\nWe work with hundreds of Large Corporations and Government customers across North America, Europe, India, Middle East, and Africa as a one-stop shop for millions of products from thousands of manufacturers.\r\n\nWe are backed by the world’s best investors like Y Combinator, Bain Capital Ventures, Ace & Co., Rebright Partners, Dream Incubator, Refactor Capital, AAF, and FJ Labs.",
    "activity_status": "Active",
    "website": "http://www.bulkmro.com",
    "founded_date": 2015.0,
    "team_size": 170.0,
    "location": "New York",
    "group_partner": "Dalton Caldwell",
    "group_partner_yc": "https://www.ycombinator.com/people/dalton-caldwell",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:b2b; location:new-york",
    "founders": [],
    "status": true,
    "generated_description": "**Bulk MRO Industrial Supply: A Quick Overview**\n\nFounded in 2015, Bulk MRO Industrial Supply is a New York-based fintech and supply chain platform that has quickly carved out a niche in the realm of global trade. The mission? To be the one-stop solution for the procurement, sales, and financing of long-tail industrial products (think MRO items) and bulk commodities like agricultural goods, petroleum, and chemicals.\n\nAt its core, Bulk MRO provides a full-stack service: they take care of everything from sourcing products to financing and logistics, making it easier for large corporations and government clients to get what they need. Their clientele spreads across North America, Europe, India, the Middle East, and Africa, and their product offerings cover a staggering array of categories—over 1.5 million products sourced from thousands of manufacturers.\n\nThe company is backed by an impressive roster of investors, including heavyweights like Y Combinator and Bain Capital Ventures. With a passionate team of about 170 employees, Bulk MRO combines technology with industry expertise to enhance procurement efficiency.\n\n### What They Offer\n\n1. **Procurement**: Streamlined processes that link customers with reliable suppliers globally.\n2. **Fulfillment**: Tech-driven solutions for order processing and inventory management.\n3. **Financing**: Flexible credit options to enhance cash flow for buyers.\n4. **Cross-Border Trade**: Solutions that facilitate international transactions and logistics.\n5. **Turnkey Project Execution**: Comprehensive services that cover every phase of a project.\n\n### Areas of Focus\n\nBulk MRO operates in diverse industries, covering everything from agriculture to pharmaceuticals, and they are dedicated to innovative solutions that simplify global trade—one procurement at a time.\n\n### Recognition and Growth\n\nSince its inception, Bulk MRO has rapidly expanded its operations, building a presence across 42 countries and executing trades on numerous international routes. Their commitment to excellence hasn’t gone unnoticed—numerous awards and accolades highlight their impact on the supply chain and procurement sectors.\n\nIn conclusion, Bulk MRO is not just a supply platform; it’s transforming how businesses approach procurement, making it smoother, faster, and more efficient in an increasingly globalized market. For enterprises looking to consolidate their supply chains and streamline processes, partnering with Bulk MRO could be a strategic move. Interested in learning more? Visit their website: [Bulk MRO](http://www.bulkmro.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/dfa1c224c384ad6b0ce12a529d007315621c7478.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191035Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=7a9a262a24f4aee398ae5ec694f8ecbfc5397767fc9e222584cb7924fcbe13ea",
    "social_links": [
        "https://www.linkedin.com/company/bulkmro/",
        "https://www.crunchbase.com/organization/bulk-mro"
    ],
    "logo_path": "data/logos\\Bulk_MRO_Industrial_Supply_logo.png"
}