{
    "links": "https://www.ycombinator.com/companies/bunkerhill-health",
    "name": "Bunkerhill Health",
    "headline": "We bring AI algorithms, built by researchers everywhere, to the clinic",
    "batch": "W19",
    "description": "Bunkerhill is a Sequoia/Felicis/YC-backed company whose goal is to increase the adoption of AI in healthcare, in order to help doctors catch deadly diseases earlier.\r\n\nBunkerhill Health has built a consortium of research institutions (Stanford, Johns Hopkins, Harvard, etc.), who develop and validate AI algorithms seamlessly under our legal umbrella (less than one week of setup time for a new project when using the Bunkerhill consortium, versus a year or more for projects outside the consortium). Bunkerhill then manages the FDA clearance and commercial sales process for the algorithms that these institutions develop and validate with us.\r\n\nWe’ve signed commercial contracts and deployed algorithms with the world’s leading health systems—UCSF, Mayo Clinic, Georgetown/MedStar, and several others. These algorithms help doctors identify patients earlier than has otherwise been possible, leading to better treatment outcomes (early clinical screening for heart disease, pancreatic cancer, etc.)\r\n\nWe’re backed by world class investors: Sequoia, Felicis, SVAngel, Optum Ventures, Max Levchin (co-founder of PayPal and Affirm), YC, DCVC, and Pacific8.",
    "activity_status": "Active",
    "website": "http://bunkerhillhealth.com",
    "founded_date": 2021.0,
    "team_size": 30.0,
    "location": "San Francisco",
    "group_partner": "Dalton Caldwell",
    "group_partner_yc": "https://www.ycombinator.com/people/dalton-caldwell",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:marketplace; industry:healthcare-it; industry:ai; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Nishith Khandwala, Founder",
            "description": "I am a co-founder of Bunkerhill Health (W19). Previously, I was a researcher at the AIMI center at Stanford, working on validation and translation of medical imaging AI algorithms into clinical practice.",
            "linkedin": "https://www.linkedin.com/in/nishith-khandwala-16b27227"
        },
        {
            "name": "David Eng, Founder",
            "description": null,
            "linkedin": "http://linkedin.com/in/gnedivad"
        }
    ],
    "status": true,
    "generated_description": "Bunkerhill Health is a forward-thinking startup founded in 2021, backed by prestigious investors like Sequoia Capital and Y Combinator. Their mission is clear: to boost the adoption of AI in healthcare, enabling earlier detection of life-threatening diseases for better patient outcomes.\n\nAt the core of Bunkerhill’s innovation is a unique consortium that includes top-tier research institutions such as Stanford, Johns Hopkins, and Harvard. This consortium allows Bunkerhill to rapidly develop and validate cutting-edge AI algorithms—cutting the typical setup time for projects from over a year to less than a week. The company expertly navigates the complex FDA clearance process and manages the commercial rollout of the algorithms created by their partner institutions.\n\nBunkerhill has already made significant strides, signing contracts with leading health systems such as UCSF and Mayo Clinic. Their algorithms are helping healthcare professionals identify critical conditions like heart disease and pancreatic cancer much earlier than traditional methods allow.\n\nBased in San Francisco, Bunkerhill operates with a team of 30 dedicated employees. Dalton Caldwell serves as a Group Partner, guiding the company's strategic direction. Their approach elegantly bridges the gap between academic research and practical healthcare applications, demonstrating how technology can directly enhance patient care.\n\nWith a strategy built on collaboration and rapid deployment, Bunkerhill Health is poised to reshape the landscape of healthcare through AI. For more information, you can visit their website at [Bunkerhill Health](http://bunkerhillhealth.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/2b2c1344635b3fc81bb8ada6df6e14626a2ea0cf.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191035Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=4e9c9f5351b51fb11feb4f0bd075ddea6902bdc02e12f96da6efd27121da6c10",
    "social_links": [
        "https://www.linkedin.com/company/bunkerhill-health/",
        "https://twitter.com/joinBunkerhill",
        "https://www.crunchbase.com/organization/bunkerhill-health",
        "https://github.com/bunkerhillhealth"
    ],
    "logo_path": "data/logos\\Bunkerhill_Health_logo.png"
}