{
    "links": "https://www.ycombinator.com/companies/buoyant-aero",
    "name": "Buoyant Aero",
    "headline": "Using drone blimps to move middle mile air freight at half the cost.",
    "batch": "S21",
    "description": "Buoyant Aero builds unmanned blimps that move middle-mile air freight at half the cost of a small plane. We're two MIT hardware engineers who've been friends for almost a decade, and we've built satellites and antennas at Astranis, Wafer, and OneWeb. So far, we’ve built and flown four airships - our most recent is 20 feet long and capable of speeds up to 35 miles per hour. We’ve also closed $5 million in LOIs and have two pilot programs planned. We're starting by improving air cargo in remote regions like Alaska and northern Canada, and will expand to move less-than-truckload shipments in low density parts of the world.",
    "activity_status": "Active",
    "website": "https://www.buoyant.aero",
    "founded_date": 2020.0,
    "team_size": 2.0,
    "location": "San Francisco",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:autonomous-delivery; industry:robotics; industry:drones; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Benjamin Claman, Founder",
            "description": "Ben has built distributed sensing systems for the military, patented  electronically steered antennas for next-gen satellite connectivity, and designed + built GPS data-loggers for motorcycle racers. Originally from Alaska, he's familiar with the challenges of rural delivery, and excited about the prospects of blimps changing the future of air transport!",
            "linkedin": "https://www.linkedin.com/in/benjaminclaman/"
        }
    ],
    "status": true,
    "generated_description": "**Buoyant Aero: A Fresh Perspective on Middle-Mile Air Freight**\n\nBuoyant Aero is on a mission to revolutionize the middle-mile air freight industry using drone blimps. This innovative approach aims to deliver goods at half the cost of traditional small aircraft. Founded in 2020 by two MIT hardware engineers with a solid background in satellite technology, Buoyant Aero is gearing up to tackle air cargo challenges, particularly in remote areas like Alaska and northern Canada.\n\nThe company has made impressive strides since its inception. They've developed and successfully flown four blimps, the latest being a 20-foot long model capable of reaching speeds of up to 35 miles per hour. With a growing interest reflected in $5 million in Letters of Intent (LOIs) and upcoming pilot programs, Buoyant Aero is poised to disrupt the logistics landscape.\n\nWhile initially focused on enhancing air cargo efficiencies in sparsely populated regions, their vision includes scaling operations to handle less-than-truckload (LTL) shipments worldwide. The company is headquartered in San Francisco and is part of the renowned Y Combinator Batch S21, which underscores its potential for growth and innovation in the autonomous delivery sector.\n\nWith a lean team of just two employees and backing from notable partners, including Nan—their group partner—Buoyant Aero is an exciting name to watch. Their technology not only paves the way for cost-effective shipping but also hints at broader applications, including wildlife protection through aerial monitoring.\n\nCurious to learn more or get involved? You can visit their website at [Buoyant Aero](https://www.buoyant.aero). Keep an eye on this venture; they’re set to change the way we think about air freight.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/9ff0b132e4fcd4058153f2fd3acaab2a83c51e14.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191035Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=e23d54f21b97ec3ba7771422b69c0722aab3da5f9a886c84d2e0ea0b17252b45",
    "social_links": [],
    "logo_path": "data/logos\\Buoyant_Aero_logo.png"
}