{
    "links": "https://www.ycombinator.com/companies/cambio-2",
    "name": "Cambio",
    "headline": "Real estate capital planning and compliance made simple",
    "batch": "S22",
    "description": "Cambio is the AI-powered commercial real estate operations platform, built by real estate investors for real estate investors. Cambio automatically collects building data via LLMs to empower mission critical workflows like capital planning and compliance. For instance, Cambio's AI models ingest building data (age, asset class, size, location, etc.) to generate retrofit recommendations and predict ROI. We're working with the largest commercial real estate private equity firms globally like Beacon Capital Partners and Madison International Realty, with a 100% RFP win rate. Our founding team collectively has two decades of commercial real estate experience across KKR, Oxford Properties Group, JPMorgan and Goldman Sachs. We are building the solution we wished we had while working at these funds.",
    "activity_status": "Active",
    "website": "https://www.cambio.ai/",
    "founded_date": 2022.0,
    "team_size": 16.0,
    "location": "San Francisco",
    "group_partner": "Gustaf Alstromer",
    "group_partner_yc": "https://www.ycombinator.com/people/gustaf-alstromer",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:real-estate; industry:b2b; industry:ai; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Leia de Guzman, Founder",
            "description": "Leia is co-founder of Cambio, the AI-powered commercial real estate operations platform. Prior to Cambio, Leia was Investments Director across Europe & Asia for Oxford Properties / OMERS. Across her seven years there, she deployed $8 billion in real estate investments globally. Leia studied environmental science and business at Queen’s University and earned an MBA at Stanford University, where she met her co-founder, Steph.",
            "linkedin": "https://www.linkedin.com/in/leia-de-guzman/"
        },
        {
            "name": "Stephanie Grayson, Founder",
            "description": "Stephanie is co-founder of Cambio, the AI-powered commercial real estate operations platform. Prior to Cambio, Stephanie was commercial real estate investor at KKR and Goldman Sachs, where she deployed $2 billion of capital. Stephanie earned a degree in Government and Economics with Advanced Standing at Harvard University as well as an MBA and Masters in the Sustainable Built Environment from Stanford University, where she met her co-founder, Leia.",
            "linkedin": "https://www.linkedin.com/in/stephaniegrayson/"
        }
    ],
    "status": true,
    "generated_description": "**Company Overview: Cambio**\n\nFounded in 2022 and hailing from the famed Y Combinator Batch S22, Cambio is revolutionizing commercial real estate operations. With headquarters in San Francisco, this nimble team of 16 is on a mission to simplify real estate capital planning and compliance using cutting-edge AI technology. \n\n**Vision & Mission**\n\nCambio aims to make real estate capital planning and compliance straightforward. They built an AI-driven platform that collects and processes extensive building data automatically—think age, asset class, size, and location—to streamline critical tasks like retrofitting and ROI predictions. Whether you're managing sustainability goals or investment strategies, Cambio provides actionable insights to enhance your operations.\n\n**Product & Features**\n\nCambio's platform is designed for real estate investors, by real estate investors. This means it meets the real needs of the industry. Some key features include:\n\n- **Automated Data Collection:** Leveraging large language models (LLMs), Cambio automatically ingests building data and presents retrofitting recommendations.\n- **Portfolio Management Tools:** Users can manage compliance and report performance metrics seamlessly across their real estate portfolios.\n- **ROI Predictive Analytics:** The platform aids in forecasting financial returns on capital upgrades and carbon reduction strategies.\n\nWith a strikingly high 100% win rate on RFPs, Cambio serves major players like Beacon Capital Partners and Madison International Realty. This strong traction demonstrates the value and demand for their solution.\n\n**Team & Background**\n\nThe founding team brings over two decades of collective experience from prestigious firms like KKR, JPMorgan, and Goldman Sachs. They are crafting the solution they'd have wanted in their previous roles—making their insights deeply rooted in user experience.\n\n**Impact & Commitment**\n\nCambio isn't just about profits; they are also committed to sustainability. Their platform helps property owners track energy use and emissions, assisting in the journey toward net-zero buildings. They’ve even partnered with the Biden-Harris Administration to help decarbonize federal buildings—an ambitious goal showing their dedication to larger societal impacts.\n\n**Learn More**\n\nIf you're involved in commercial real estate and tired of the old ways of doing things—like manual data entry—Cambio's platform might just be what you need. You can learn more and request a demo at [Cambio's website](https://www.cambio.ai/).\n\nIn summary, Cambio is a shining example of how technology can simplify complex processes in the real estate sector, all while pushing towards a sustainable future. Keep an eye on them; they’re on the rise!",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/5520417734e1f41833c7a019804c80d07cc54128.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191038Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=54954765634f64e26dd7505d262ef28706fa0e1cdbd4ac20a886ca3ec02529ec",
    "social_links": [
        "https://www.linkedin.com/company/cambioai/"
    ],
    "logo_path": "data/logos\\Cambio_logo.png"
}