{
    "links": "https://www.ycombinator.com/companies/campfire-2",
    "name": "Campfire",
    "headline": "A modern version of NetSuite",
    "batch": "S23",
    "description": "Campfire is the modern accounting platform for startups and mid-size tech companies. Our product includes an accounting general ledger that has multi-entity support and advanced financial reporting such as P&L by department and contribution margin by customer. Migrate from legacy accounting software to Campfire for your accounting and financial reporting to automate manual tasks and streamline workflows to unlock financial insights and accelerate the monthly close process.",
    "activity_status": "Active",
    "website": "https://meetcampfire.com/",
    "founded_date": 2023.0,
    "team_size": 4.0,
    "location": "San Francisco",
    "group_partner": "Dalton Caldwell",
    "group_partner_yc": "https://www.ycombinator.com/people/dalton-caldwell",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:saas; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "John Glasgow, Founder",
            "description": "CEO / Co-founder of Campfire, the modern accounting platform for startups and mid-size tech companies. Previously, I was VP, Business Development and Partnerships at Bill.com where I reported to the CFO after joining via the acquisition of Invoice2go for $625 million. At Invoice2go, I led corporate development and partnerships as an executive reporting to the CEO. Prior experience includes corporate strategy at Adobe and tech M&A.",
            "linkedin": "https://linkedin.com/in/johnglasgow"
        }
    ],
    "status": true,
    "generated_description": "**Company Overview: Campfire**\n\nFounded in 2023 and based in San Francisco, Campfire is a cutting-edge accounting platform that positions itself as a modern alternative to legacy systems like NetSuite. The company emerged from the Y Combinator Batch S23 program, and currently operates with a lean team of four employees, under the guidance of Group Partner Dalton Caldwell.\n\n**Mission and Products**\n\nCampfire's mission is to streamline financial management for startups and mid-sized tech companies by automating tedious tasks and unveiling deep financial insights. Their key offerings include:\n\n1. **Core Accounting**: This modern general ledger supports multi-entity operations and advanced financial reporting features, like Profit and Loss statements by department and contribution margins by customer. It’s designed for companies looking to transition away from outdated accounting software.\n   \n2. **Revenue Automation**: This tool automates end-to-end revenue processes, providing unity in revenue and customer data across various business models—from enterprise software to consumer-focused fintech.\n\nBy facilitating migration from clunky legacy software, Campfire aims to accelerate the monthly close process for firms, allowing finance teams to focus on analysis rather than data entry.\n\n**Solutions for Different Segments**\n\nCampfire tailors solutions for three primary customer segments:\n\n- **Startups**: Providing a flexible accounting framework that grows with the business, optimizing key functions like invoicing and financial reporting.\n- **Mid-Market Companies**: Offering an ERP-like experience with an intuitive interface, maintaining GAAP compliance and simplifying financial consolidation across entities.\n- **Accounting Firms**: Helping firms enhance operations from traditional bookkeeping to client advisory services, supported by comprehensive reporting and dashboards.\n\n**Customer Impact and Trust**\n\nWith a growing client base, Campfire is trusted by various industry leaders who have successfully migrated to its platform. Key testimonials underline the efficiency improvements and financial clarity gained through Campfire.\n\n**Conclusion**\n\nCampfire represents a fresh take on accounting software, tailored explicitly for the demands of tech-driven companies. Their commitment to simplifying and enhancing financial management processes makes them a compelling option for those looking to optimize their accounting practices without the headaches often associated with legacy systems.\n\nFor more details, visit their official website: [meetcampfire.com](https://meetcampfire.com/).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/c832ab8f6c45332b2934a9fd053ddf7111692c08.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191039Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=dd55c7072e12434b16796744a83670b8bc5585f45cfca27a4273b56436bd1ad0",
    "social_links": [
        "https://www.linkedin.com/company/95696443"
    ],
    "logo_path": "data/logos\\Campfire_logo.png"
}