{
    "links": "https://www.ycombinator.com/companies/capi-money",
    "name": "Capi Money",
    "headline": "Helping businesses in Africa pay their international suppliers",
    "batch": "S23",
    "description": "Capi Money helps businesses in Africa pay their international suppliers. Goods importers in Africa pay up to 10% to settle invoices and wait weeks for payments to arrive. We’re on a mission to give businesses in Africa the same price and speed as we expect in the US and Europe.",
    "activity_status": "Active",
    "website": "https://www.capimoney.com",
    "founded_date": 2023.0,
    "team_size": 5.0,
    "location": null,
    "group_partner": "Dalton Caldwell",
    "group_partner_yc": "https://www.ycombinator.com/people/dalton-caldwell",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": null,
    "founders": [
        {
            "name": "Mitch Riley, Founder",
            "description": "Co-founder and CEO of Capi Money (S23).  Ex COO/CFO/GC of Taptap Send, a unicorn remittance company sending billions of dollars a year into Africa. Spent 4.5 years setting up new markets in Africa and LatAm for GiveDirectly and managing field operations.  Recovering lawyer (ex Cravath)",
            "linkedin": "https://www.linkedin.com/in/mitchriley/"
        },
        {
            "name": "Scott Liddle, Founder",
            "description": "Cofounder leading expansion at Capi Money. Previously CRO/CMO at Taptap Send, a unicorn remittance app: launched 25 markets across Africa, Asia and LatAm. Founded SpareHand volunteer platform in the UK: 1M meals delivered in Covid. Special Advisor to Rory Stewart, UK Secretary of State for International Development. Regional Director at Turquoise Mountain managing ~200 ppl across Middle East and Afghanistan. Speaks half a dozen languages.",
            "linkedin": "https://linkedin.com/in/scott-liddle-890678195"
        },
        {
            "name": "Tom Watson, Founder",
            "description": "Co-Founder and CTO at Capi Money (S23). CTO and Founder for the last 10 years; first startup was an office space marketplace in London called Hubble, raised over $10m and grew to more than $1m ARR. In 2021 I started a web3 company called P4SD, which sold out a 10k NFT collection, raising ~3000 ETH.",
            "linkedin": "https://linkedin.com/in/tmwbuidls"
        }
    ],
    "status": true,
    "generated_description": "### Capi Money: Revolutionizing Payments for African Businesses\n\n**Website:** [Capi Money](https://www.capimoney.com)\n\nFounded in 2023 and proudly part of Y Combinator's Batch S23, Capi Money is on a mission to level the playing field for businesses in Africa, particularly in their dealings with international suppliers. \n\n#### The Problem:\nAnyone involved in importing goods into Africa knows the challenges: local banks can take weeks to process international invoices, and businesses can get hit with hefty fees—often up to 10%—to settle these payments. In today's fast-paced world, this wait isn’t just inconvenient; it can severely hinder growth.\n\n#### The Solution:\nCapi Money aims to eliminate these pain points. Their platform allows businesses to make seamless international payments in USD, EUR, or GBP, ensuring that suppliers are paid on time, every time. Capi Money promises competitive exchange rates, instantly available foreign currency, and payment settlements within 24 hours. Imagine being able to track your payments in real-time—no more guessing games or endless waiting.\n\n#### Key Features:\n- **Reliability:** Constant access to foreign currency at favorable rates.\n- **Speed:** Instant payment settlements.\n- **Control:** Real-time tracking of payment progress on a user-friendly dashboard.\n- **Security:** A regulated service with partnerships with banks in top-tier jurisdictions.\n\n#### A Focus on Growth:\nBy simplifying and streamlining the payment process, Capi Money frees businesses to focus on what truly counts—growing their operations without the constant hassle of managing overseas invoices.\n\nTheir team of five, led by Group Partner Dalton Caldwell, has equipped Capi Money with the expertise needed to navigate this challenging landscape. \n\nIf you’re a business in Africa looking to enhance your operational efficacy, Capi Money might just be the partner you need. Sign up today and unlock the potential for hassle-free international payments. \n\nIn a nutshell, Capi Money is refreshing the payment ecosystem for African importers by bringing them the reliability, speed, and efficiency that businesses expect in the U.S. and Europe. This isn’t just innovation; it’s a necessity for growth in a global economy.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/3ecd626b8c743e5b0a916a83ee6d158358e22712.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191040Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=566f4208b3658871d98b9be09300c5f6990bc835eb04b12f7302d092c1321a06",
    "social_links": [
        "https://linkedin.com/company/capimoney/"
    ],
    "logo_path": "data/logos\\Capi_Money_logo.png"
}