{
    "links": "https://www.ycombinator.com/companies/carbon-crusher",
    "name": "Carbon Crusher",
    "headline": "We make carbon negative roads",
    "batch": "W22",
    "description": "We are crushing roads in need of maintenance, reusing the old road materials, replacing heavy oil with carbon binding lignin. This is both a cheaper, more durable and net carbon negative method, removing ~1.5 tonnes CO2 from the atmosphere from every 100 feet of road. \r\n\nWe offer Crushing As A Service (CRAAS) to public and private road owners and refurbishers, and are already gaining international traction. Using satellite imagery, we will monitor road status and potential, and will offer additional tech and bio enhancements to make all roads green and a solution to the climate crisis.  \r\n\nWe are building the road to a carbon negative future.",
    "activity_status": "Active",
    "website": "https://www.carboncrusher.io/",
    "founded_date": 2021.0,
    "team_size": 21.0,
    "location": "Oslo, Norway",
    "group_partner": "Gustaf Alstromer",
    "group_partner_yc": "https://www.ycombinator.com/people/gustaf-alstromer",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:carbon-capture-and-removal; industry:construction; industry:climate",
    "founders": [
        {
            "name": "Haakon Brunell, Founder",
            "description": "Serial impact-tech entrepreneur and investor. A firm believer in using tech and human resources for universal good. Co-founder & CEO of Carbon Crusher. Co-founder and former CEO in Katapult, a globally leading impact/SDG-tech accelerator, seed investor and impact-unicorn builder. Angel investor in 20+ impact-tech companies. Former asc. Partner in McKinsey & Company.",
            "linkedin": "https://www.linkedin.com/in/haakonbrunell/"
        },
        {
            "name": "Hans Arne Flåto, Founder",
            "description": "Hans Arne Flaato. Serial Grunder who has founded and co-founded more than 20 different companies. Broad Industrial experience within Defence, energy and electronics. \n2 times awarded with Sam Eydes Innovation Price (2010 & 2021)",
            "linkedin": "https://www.linkedin.com/in/hans-arne-fl%C3%A5to-0931764"
        },
        {
            "name": "Kristoffer Roil, Founder",
            "description": "Passionate tech entrepreneur with several successful startups and exits since 2005. \nAngel investor in 30+ companies including Prometheus, Nurx, Embark, Katapult, Mercury, Wright Electric, Zapata Computing and more.\n\nI believe that the best way to make the world better is through businesses dedicated to solve the big problems and provide value to humans and the planet.",
            "linkedin": "https://no.linkedin.com/in/kroil"
        }
    ],
    "status": true,
    "generated_description": "**Company Overview: Carbon Crusher**\n\nFounded in 2021 and nestled in Oslo, Norway, Carbon Crusher is blazing a trail in sustainable road construction with a bold mission: to create carbon-negative roads. It’s not just a catchy tagline; they’re redefining how we think about infrastructure and environmental responsibility.\n\n**The Breakdown**\n\nThe company’s journey began with a straightforward yet impactful premise: refurbishing roads that desperately need maintenance. By reusing old road materials and employing carbon-binding lignin instead of heavy oil, Carbon Crusher not only reduces costs but also builds roads that actively sequester around 1.5 tonnes of CO2 for every 100 feet paved. Think about that—every mile paved could potentially store between 50 and 150 tonnes of CO2, making a significant impact in the fight against climate change.\n\n**Innovative Services**\n\nCarbon Crusher operates under a unique model dubbed “Crushing As A Service (CRAAS).” This innovative approach targets both public and private road owners, offering a sustainable solution that integrates advanced satellite imagery to monitor road conditions and performance. The use of AI-enabled maintenance insights, through their SkyRoads platform, rounds off a robust service that addresses the long-term needs of road infrastructure while prioritizing environmental sustainability.\n\n**Team and Recognition**\n\nWith a dedicated team of 21 and backing from Y Combinator's Batch W22, Carbon Crusher isn’t just a startup; it’s a growing movement in construction and climate action. Led by Gustaf Alstromer, they are gaining international traction and drawing attention from various media outlets for their groundbreaking approach.\n\n**Key Offerings:**\n\n1. **Sustainable Road Construction:** Utilizing on-site materials through full-depth reclamation, they create stronger and longer-lasting roads that require less maintenance.\n   \n2. **Cost Efficiency:** Their innovative methods drive down costs, making eco-friendly road construction both viable and financially sound.\n   \n3. **Climate Impact:** They don’t just build roads; they contribute actively to carbon capture, making infrastructure a part of the solution to the climate crisis.\n\n**The Bigger Picture**\n\nWith over 64 million kilometers of roads around the world, the potential for transformation is immense. Carbon Crusher isn’t just about building roads; they’re about building a future where our infrastructure heals the planet. Their seamless integration of technology and environmentalism positions them as not just a company, but a pioneer in the paradigm shift toward sustainable construction.\n\nFor those curious to learn more or partner with Carbon Crusher, their website is a treasure trove of information: [Carbon Crusher](https://www.carboncrusher.io/).\n\nIn short, Carbon Crusher is not only paving the way for stronger roads but is also crafting a narrative of hope against climate change—one carbon-negative road at a time.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/3ba58f98266ef045d0e5fb905861ae02cd5189a5.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191041Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=825cac1470bb7436b48efa671321882687a6def783919642dbdba9e9c176e9b4",
    "social_links": [
        "https://www.linkedin.com/company/carboncrusher",
        "https://twitter.com/carbon_crusher"
    ],
    "logo_path": "data/logos\\Carbon_Crusher_logo.png"
}