{
    "links": "https://www.ycombinator.com/companies/carbonchain",
    "name": "CarbonChain",
    "headline": "We help companies automate the accounting of their carbon emissions",
    "batch": "S20",
    "description": "We’re building a SaaS tool that enables companies in highly polluting industries to track their supply chain carbon emissions so they can mitigate risks from incoming carbon taxes and government penalties.",
    "activity_status": "Active",
    "website": "https://carbonchain.com",
    "founded_date": 2020.0,
    "team_size": 16.0,
    "location": "London, United Kingdom",
    "group_partner": "Gustaf Alstromer",
    "group_partner_yc": "https://www.ycombinator.com/people/gustaf-alstromer",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:climate",
    "founders": [
        {
            "name": "Adam Hearne, Founder",
            "description": "Adam worked in mining for 12 years, and saw first hand how the world's resources are extracted from the earth to go into products that make daily life possible. He then worked at Amazon for 3 years managing the world's most complex supply chains. It wasn't until the Australian bushfire crisis in October 2019 threatened his childhood home that Adam realized that he could use his experience to help tackle the climate crisis and bring transparency to carbon reporting of the world’s supply chains",
            "linkedin": "https://www.linkedin.com/in/adamhearne/"
        },
        {
            "name": "ROHEET SHAH, Founder",
            "description": "Roheet began his career launching a housing fund in Damascus, Syria until the civil war forced his evacuation. Later, after years working on oil & gas projects as a consultant for the Boston Consulting Group and managing Amazon UK's smart home business, Roheet realized that he wanted to return to a career with impact at its focus, and thought that there was no better challenge than to tackle the climate crisis.",
            "linkedin": "https://www.linkedin.com/in/roheetshah/"
        }
    ],
    "status": true,
    "generated_description": "**CarbonChain: Simplifying Carbon Accounting for a Greener Future**\n\nCarbonChain is a UK-based tech company founded in 2020, nestled in the heart of London and proudly part of Y Combinator’s Batch S20. Their mission is straightforward yet vital: to help companies automate the accounting of their carbon emissions, particularly those in industries that have a significant environmental footprint.\n\nInitially, CarbonChain carved out a niche by developing a Software as a Service (SaaS) tool that enables businesses—especially those operating within highly polluting sectors—to track their supply chain carbon emissions. This not only helps these companies mitigate risks but also prepares them for looming carbon taxes and regulatory penalties that are becoming more prevalent worldwide. \n\nThe CarbonChain team currently consists of 16 passionate individuals, spearheaded by Group Partner Gustaf Alstromer. Their work is pivotal for industries facing increasing scrutiny regarding their carbon footprints, particularly as consumers and regulators alike push for transparency and accountability. \n\n### What They Offer\n\nThe platform provides three core functionalities:\n\n1. **Measure**: Users can confidently track and quantify their emissions.\n2. **Report**: Businesses can generate reports quickly and efficiently, easing the burden of compliance.\n3. **Transition**: The tool assists in setting targets, ultimately guiding companies on their journey to a sustainable future.\n\n### Market Focus\n\nTheir services cater specifically to manufacturers, commodity traders, and banks, making it clear that their technology is tailored for industries with complex supply chains that need precise emissions tracking. By offering a solution that can manage up to 80% of global emissions coverage across more than 135,000 tracked assets, CarbonChain sets itself apart by catering to the unique challenges these sectors face.\n\n### Why It Matters\n\nNot only does CarbonChain's solution help businesses reduce risks associated with carbon regulations, but it also empowers them to lead in the low-carbon economy. They are seeking to position their customers as champions of sustainability, enabling them to seize market opportunities arising from the growing demand for low-carbon products.\n\nIn an age where climate action is paramount, the importance of tools like those offered by CarbonChain is not merely useful—it’s essential for businesses looking to thrive in a carbon-constrained world. \n\nFor more about their offerings or to explore potential collaboration, check out their website: [CarbonChain.com](https://carbonchain.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/59e0ad4b8c4e88031d1bb6860f5bd3acc2d87e09.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191041Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=e7e302c36bf8baf7affa8f07984b3f73f577c4659fde2161809547cb80430ebf",
    "social_links": [
        "https://www.linkedin.com/company/carbonchain-io/"
    ],
    "logo_path": "data/logos\\CarbonChain_logo.png"
}