{
    "links": "https://www.ycombinator.com/companies/careerist",
    "name": "Careerist",
    "headline": "Learning platform for job seekers with job applications automation",
    "batch": "S21",
    "description": "Careerist is an ed-fintech platform that trains job seekers for tech careers (in QA, Sales, Support & more), finances them and automates their job hunting. Our B2B2C platform aggregates job seekers, tutors and employers – streamlining training and placement.\r\n\nTechcrunch: \"Edtech meets SaaS in Careerist’s job placement learning platform. The startup trains job seekers through live and self-paced training taught by third-party tutors. The adaptive learning software is meant to help candidates prep for tech interviews. Once a candidate is well equipped, Careerist uses automation to help them apply for jobs.\"",
    "activity_status": "Active",
    "website": "http://careerist.com/",
    "founded_date": 2019.0,
    "team_size": 100.0,
    "location": "Sunnyvale, CA",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:education; industry:fintech; industry:recruiting; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Ivan Tsybaev, Founder",
            "description": "Founded by serial entrepreneurs, that previously built and later sold Trucker Path, America's most popular mobile app for truck drivers. Ivan has over 10 years of entrepreneurial experience and expertise in fast product-led growth.",
            "linkedin": "https://www.linkedin.com/in/ivantsybaev/"
        },
        {
            "name": "Max Glubochansky, Founder",
            "description": "Max is Careerist's co-founder and Chief Business Officer. Prior to launching Careerist in 2019 Max worked in Engineering and Biz dev for major Silicon Valley companies like Apple and Intel. \nMax’s mission is to help as many people as possible to better their lives by working in tech!",
            "linkedin": "https://www.linkedin.com/in/maxqa/"
        },
        {
            "name": "Max Gusakov, Founder",
            "description": "Max Gusakov has participated in several startups in both Russia and the US, including Trucker Path (acquired by RenRen in 2017). In 2019, Max became the technical co-founder of Careerist (JobEasy) and is currently the CTO. Max’s interests include classic coaching and meditation, and he focuses on product thinking, automation, and communication best practices in his role at Careerist.",
            "linkedin": "https://www.linkedin.com/in/gusakovm/"
        }
    ],
    "status": true,
    "generated_description": "**Careerist: Transforming Job Seekers into Tech Professionals**\n\nFounded in 2019 and part of Y Combinator's S21 batch, Careerist is an innovative ed-fintech platform based in Sunnyvale, CA, dedicated to equipping job seekers with the skills they need to succeed in the tech industry. With a growing team of 100 professionals, Careerist blends education and recruiting to streamline tech career training and job placement.\n\n**Mission and Approach**\n\nCareerist's mission revolves around empowering job seekers. It uniquely combines live and self-paced training for various tech roles—such as Quality Assurance (QA), Sales Engineering, and Data Analytics—with job application automation. The platform serves as a B2B2C hub, connecting job seekers, trainers, and employers to facilitate efficient training and hiring processes.\n\nAs noted by TechCrunch, \"Edtech meets SaaS\" in Careerist's model, allowing candidates to prepare for tech interviews through adaptive learning software while automating their job applications once they are ready. This dual approach enhances the effectiveness of their training programs, making job hunting less of a struggle.\n\n**Programs Offered**\n\nCareerist offers several focused programs designed to target high-demand tech roles, including:\n\n1. [QA Engineering](http://careerist.com/</qa>)\n2. [QA Automation](http://careerist.com/</automation>)\n3. [QA Bundle](http://careerist.com/</bundle-qa>)\n4. [UX/UI Design](http://careerist.com/</ux>)\n5. [Sales Engineering](http://careerist.com/</saleseng>)\n6. [Data Analytics](http://careerist.com/</analytics>)\n\nEach program is tailored to equip participants with the necessary skills and industry insights to land their first tech job.\n\n**Support and Resources**\n\nCareerist doesn't just stop at education; they offer a variety of free tools and resources:\n\n- [Free CV Builder](http://careerist.com/</free-tools/resumebuilder>)\n- [Future Salary Calculator](http://careerist.com/</free-tools/future-salary-calculator>)\n- [Job Description Generator](http://careerist.com/</free-tools/free-ai-for-writing-job-descriptions-for-resume>)\n- [IT Interview Questions](http://careerist.com/</free-tools/it-interview-questions>)\n- [Cover Letter Generator](http://careerist.com/</free-tools/best-ai-cover-letter-writer>)\n\nThese tools not only provide added value to users but also enhance their employability by helping them better prepare their applications.\n\n**Community and Impact**\n\nWith a strong emphasis on community, Careerist fosters connections among students, mentors, and industry professionals, ensuring support throughout their journey. Graduates have found success at leading tech companies, reflecting the platform’s effectiveness in transforming careers.\n\nFor job seekers aspiring to break into the tech field, Careerist stands out as a comprehensive solution. They combine training, career coaching, and job application automation, streamlining the path from novice to employed in a demanding market.\n\n**Get Started**\n\nTo learn more about Careerist and explore their offerings, visit their website at [careerist.com](http://careerist.com) or reach out at (415) 319-9099. Whether you're looking for flexible payment options or ready to dive into a tech career, Careerist can help you navigate your next steps effectively.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/c4553010e224e445aae7d77aba356eade8fc72d1.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191041Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=99751056a7b4c940bd40d4b9616361560123c99a1118c335b6412c99a3d2110b",
    "social_links": [
        "https://www.crunchbase.com/organization/jobeasy",
        "https://github.com/careeristinc"
    ],
    "logo_path": "data/logos\\Careerist_logo.png"
}