{
    "links": "https://www.ycombinator.com/companies/carma",
    "name": "Carma",
    "headline": "Same-Day Auto Repair for Commercial Fleets.",
    "batch": "W24",
    "description": "Carma is a B2B managed marketplace for commercial fleet owners to get same-day automotive repair for any vehicle with instant transparent offers and guaranteed pricing. Every year, fleet owners spend $573B on auto repairs globally.\r\n\nFleet owners request any service through our mobile app, which we send to our network of highly-vetted partner service centers. Our partner service centers give users real-time offers on their requested services. \r\n\nOur fleet customers save upwards of 50% when they use Carma vs. the median price for the same service in their zip code, while our partner service centers increase their revenues and obtain new customers.\r\n\nWe are currently accepting commercial fleet customers:\r\n\nIf you own multiple commercial vehicles for your business and are interested in trusted same-day turnaround for your fleet, call or text Muhammad (Carma CEO) at 636-293-5254 or email fleets@joincarma.com.\r\n\nIf you are an owner of a highly-rated automotive service center and are interested in increasing revenue with more profitable high-ticket work, call or text Muhammad (Carma CEO) at 636-293-5254 or email shops@joincarma.com.",
    "activity_status": "Active",
    "website": "https://www.joincarma.com/",
    "founded_date": 2023.0,
    "team_size": 11.0,
    "location": "San Francisco",
    "group_partner": "Tom Blomfield",
    "group_partner_yc": "https://www.ycombinator.com/people/tom-blomfield",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:auto-commerce; industry:marketplace; industry:b2b; industry:trust-&-safety; industry:automotive; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Muhammad Alasgarli, Founder",
            "description": "Founder & CEO @ Carma. Previously, Muhammad worked in investment banking (M&A/Restructuring) in NYC where he executed mega-cap mergers & acquisitions for publicly traded auto-tech companies, automotive OEMs, Tier 1 suppliers, and related auto service providers. He has worked on over $60B of cumulative transactions for notable corporate clients such as Carvana, Honeywell Transportation Systems, and various stakeholder affiliates of Hertz Rent-A-Car. Graduate of Washington University in St. Louis.",
            "linkedin": "https://linkedin.com/in/muhammadalasgarli"
        },
        {
            "name": "Brandt Lawson, Founder",
            "description": "CTO & Co-Founder @ Carma. Previously Software Engineering @ Gelber Group (high-frequency trading firm). U.S. Army Veteran and WashU grad.",
            "linkedin": "https://linkedin.com/in/brandtlawson"
        }
    ],
    "status": true,
    "generated_description": "**Carma: Your Go-To for Same-Day Auto Repair Solutions**\n\nFounded in 2023 and nestled in the heart of San Francisco, Carma is revolutionizing the automotive repair landscape for commercial fleet owners. The company's mission? To provide same-day auto repair with transparent pricing and instant offers—because waiting around for repairs is so last decade.\n\nThe backbone of Carma's operation is a B2B managed marketplace designed especially for fleet management. It taps into a massive market; globally, fleet owners shell out a staggering $573 billion annually on auto repairs. With Carma, they can significantly cut costs—saving up to 50% compared to regional median prices for similar services.\n\nHere’s how it works: fleet owners can submit service requests through the Carma mobile app. Once submitted, these requests are dispatched to a carefully vetted network of partner service centers. These centers deliver real-time offers on auto services, allowing customers to choose the best deal. It’s a win-win: fleet customers get expedited, cost-effective service, while partner centers boost their revenue streams and attract new clientele.\n\nIf you manage a commercial fleet, reaching out to Carma is as simple as calling or texting Muhammad, the CEO, at 636-293-5254, or emailing fleets@joincarma.com. For automotive service center owners looking to increase profitability, there's a similar invitation—contact Muhammad or email shops@joincarma.com. \n\nCarma is backed by Y Combinator and features a nimble team of 11 talented individuals. With the guidance of Group Partner Tom Blomfield, they’re well-positioned to disrupt the automotive service industry.\n\nWhat can you expect from Carma? \n\n1. **Competitive Offers:** Request service and get multiple real-time offers.\n2. **Transparent Pricing:** No hidden fees—what you see is what you pay.\n3. **Speedy Turnaround:** Get your vehicles serviced with guaranteed same-day service.\n4. **Diagnostics:** Unsure what’s wrong? Initiate a diagnostic request without burning hours.\n\nFor fleet management made easy and cost-effective, Carma is setting the standard. Their website, https://www.joincarma.com/, is the starting point for demo bookings and more information about their offerings.\n\nCarma is living proof that innovation thrives at the intersection of technology and industry needs. If you’ve got a fleet, it’s time to get onboard.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/a8e703e0ede2f472f5a429d5bc97c2e6ddd159e0.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191042Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=b179fcb14162511daaa74275e5961ff52ca87a93ca9563af61e0bcd4db0a0e9f",
    "social_links": [
        "https://www.linkedin.com/company/carma-com",
        "https://twitter.com/joincarma",
        "https://www.facebook.com/joincarmacom",
        "https://www.crunchbase.com/organization/carma-aa85"
    ],
    "logo_path": "data/logos\\Carma_logo.png"
}