{
    "links": "https://www.ycombinator.com/companies/carousel-technologies",
    "name": "Carousel Technologies",
    "headline": "Professional AI toolkit for PowerPoint",
    "batch": "W24",
    "description": "We help investment bankers & consultants prepare materials faster & with fewer errors.\r\n\nCarousel is a PowerPoint plugin carrying a suite of tools designed to help junior professionals save time while putting together decks. \r\n\nOur first tool brought a supercharged version of Word's \"Track Changes\" to PowerPoint so deal teams could quickly review each other's work, speeding up the feedback loop of giving and turning comments by 10x.\r\n\nOur second tool uses computer vision to populate charts and tables in PowerPoint based on Excel data, as well as extract table data from PDFs into Excel with two clicks.\r\n\nWe've got many more features on the way that build out a complete toolbelt, including an AI copilot for PowerPoint that can handle complex, multi-step tasks, outperforming Microsoft's native copilot.",
    "activity_status": "Active",
    "website": "https://usecarousel.com",
    "founded_date": 2023.0,
    "team_size": 3.0,
    "location": "New York",
    "group_partner": "Jared Friedman",
    "group_partner_yc": "https://www.ycombinator.com/people/jared-friedman",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:finance; industry:b2b; industry:enterprise-software; location:new-york",
    "founders": [
        {
            "name": "Daniel Wolf, Founder",
            "description": "Working on making Microsoft PowerPoint less painful. If you have a friend in banking or consulting, message/email me!",
            "linkedin": "https://linkedin.com/in/daniel-wolf-6242431b1"
        },
        {
            "name": "Jude Rizzo, Founder",
            "description": "Founder @ Carousel, former math/physics student",
            "linkedin": "https://linkedin.com/in/jude-rizzo-aa71aa207"
        }
    ],
    "status": true,
    "generated_description": "**Carousel Technologies: Revolutionizing PowerPoint with AI**\n\nFounded in 2023 and part of Y Combinator's Batch W24, Carousel Technologies is headquartered in the bustling hub of New York City. The company's mission? To streamline the deck-building process for professionals, particularly investment bankers and consultants, through an intelligent AI toolkit integrated with PowerPoint.\n\n### What They Do\n\nCarousel Technologies offers a suite of PowerPoint plugins that empower junior professionals to create presentations more efficiently—think of it as a turbocharger for your deck-building. Their flagship tool enhances the \"Track Changes\" feature from Word, allowing teams to review edits and feedback at lightning speed—10 times faster to be exact. \n\nNext is their innovative application of computer vision technology, which effortlessly pulls data from Excel to populate PowerPoint charts and tables and even extracts table data from PDFs with just a few clicks. This is just the beginning; they have a treasure trove of features on the horizon, including an AI copilot for PowerPoint designed to tackle complex tasks even better than Microsoft's native offering.\n\n### Key Features\n\n- **Enhanced Version Control**: Stay updated on document revisions without missing a beat.\n- **Logobox**: Access the latest logos without diving into an endless Google search.\n- **Advanced Formatting Tools**: Hotkeys make formatting and aligning slides a breeze.\n\nAs for enterprise solutions, Carousel crafts custom software tailored for the high-paced world of finance, ensuring teams can handle a greater volume of deals without sacrificing quality or speed. They offer bank-level security, ensure support around the clock, and even provide a money-back guarantee if clients don't see noticeable results in 60 days.\n\n### Growth and Momentum\n\nCarousel has witnessed impressive growth, with a 15% revenue increase quarter-over-quarter and a successful product launch that boosted sales by 25%. They also expanded into two new international markets, outmaneuvering their initial targets.\n\n### The Team\n\nWith a team of just three, Carousel is a lean startup that’s making significant waves in the B2B and enterprise software space. Their Group Partner, Jared Friedman, is instrumental in guiding the company through its nascent stages.\n\n### Conclusion\n\nIf you spend hours crafting presentations, Carousel Technologies is here to change the game. By leveraging AI to reduce the grunt work, they're liberating professionals to focus more on what truly matters—engaging with clients and closing deals. Want to see it in action? Check out their [website](https://usecarousel.com) to schedule a demo or request features that could elevate your workflow.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/e7c5f9390485a78ec9d86e3045bc1114fdf0f700.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191042Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=02477d7b6a350849b8e2ff68b7c2798a8acdce6995c7a60f518a0928400cb66f",
    "social_links": [
        "https://www.linkedin.com/company/carousel-tech/"
    ],
    "logo_path": "data/logos\\Carousel_Technologies_logo.png"
}