{
    "links": "https://www.ycombinator.com/companies/casca",
    "name": "Casca",
    "headline": "AI Agents for Banking",
    "batch": "S23",
    "description": "Casca is building AGI for banking.\r\n\nWe are replacing 30+ year-old legacy technology with AI-native systems of record that automate 90% of the manual work humans used to have to do. \r\n\nOur first product is an AI-native Loan Origination System - with a built-in AI Agent, called Sarah. Sarah communicates with small business loan applicants via email or sms, guides them through the application process and prepares the loan file for a human underwriter.\r\n\nWhy? Small businesses are the heart of the American economy and a lot of banks shy away from providing funding because of the manual effort in pursuing those deals. With us, that changes and unlocks affordable, quick bank funding for the 30M+ small businesses in the US as opposed to the high interest rates from online lenders.",
    "activity_status": "Active",
    "website": "https://www.cascading.ai/",
    "founded_date": 2023.0,
    "team_size": 6.0,
    "location": "San Francisco",
    "group_partner": "Jared Friedman",
    "group_partner_yc": "https://www.ycombinator.com/people/jared-friedman",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:artificial-intelligence; industry:conversational-banking; industry:fintech; industry:machine-learning; industry:finance; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Lukas Haffer, CEO & Co-Founder",
            "description": "Lukas is the CEO & Co-founder of Cascading AI. He previously served as Chief of Staff for the European Market at Avaloq (a globally leading provider of core banking software with $4 Trillion in Assets managed on the platform. Lukas holds an MBA from Stanford University, where he graduated as an Arjay-Miller Scholar (top 10%).",
            "linkedin": "https://linkedin.com/in/lukashaffer"
        },
        {
            "name": "Isaiah Williams, Founder",
            "description": null,
            "linkedin": "https://linkedin.com/in/isaiahml"
        }
    ],
    "status": true,
    "generated_description": "**Company Overview: Casca**\n\nFounded in 2023 and based in San Francisco, Casca is an innovative fintech startup emerging from Y Combinator's Batch S23. Its mission? To revolutionize banking through the application of AI agents, creating modern alternatives to the outdated technology that has plagued the sector for over three decades.\n\n**What Casca Does**\n\nAt the heart of Casca’s offerings is an AI-native Loan Origination System, powered by an intelligent assistant named Sarah. This system automates up to 90% of routine loan processing tasks, allowing small business loan applicants to navigate their applications seamlessly via email or SMS. By removing the cumbersome manual workload, Casca aims to unlock swift, affordable lending options for the 30 million small businesses across the U.S., thereby ensuring they don’t have to resort to high-interest online lenders.\n\n**The Problem Solved**\n\nTraditionally, banks have been hesitant to lend to small businesses due to the labor-intensive nature of the loan application process. Casca addresses this issue directly by streamlining operations, significantly enhancing the speed and efficiency of loan origination. As a result, banks can process loans at rates that previously seemed infinitely unattainable.\n\n**Current Status and Impact**\n\nWith a compact team of six, Casca is already making waves in the financial industry, proving successful for FDIC-insured banks and non-bank lenders alike. The results speak for themselves: some institutions have reported tripled lead conversion rates and drastically reduced loan cycle times thanks to Casca’s technology. Noteworthy is Ryan Hildebrand, CIO at Bankwell Bank, who noted tremendous success with Casca's implementation even in the early months.\n\n**Looking Ahead**\n\nCasca is already being recognized as a key player in the fintech space, earning accolades and attention from various financial institutions and industry leaders. As they begin to lead the charge against aging bank systems and help small businesses thrive, their visibility and impact are only expected to grow.\n\nFor anyone involved in banking or small business lending—or honestly any interested party—watching Casca’s journey will be both illuminating and perhaps even transformative.\n\nFor more information, check out their website: [Casca](https://www.cascading.ai/).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/4ffe985dae89c5e5bb28216226a4e6e5bdd62dea.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191043Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=1b6d0ddf4dff46e55d11c3ffa5908c7369344c60ebef0acfff7a67714fddc564",
    "social_links": [
        "https://www.linkedin.com/company/cascading-ai/?viewAsMember=true"
    ],
    "logo_path": "data/logos\\Casca_logo.png"
}