{
    "links": "https://www.ycombinator.com/companies/catx",
    "name": "CatX",
    "headline": "The digital marketplace for insurance risk",
    "batch": "S23",
    "description": "CatX is a digital marketplace connecting insurance carriers with institutional investors to trade and transfer insurance risk efficiently. We help to make insurance risk models understandable and accessible for asset managers so they can unlock new sources of returns. In addition, we streamline and digitalize the entire risk transfer process, so insurers can get faster, cheaper access to capital from our partner funds.",
    "activity_status": "Active",
    "website": "https://catx.re",
    "founded_date": 2023.0,
    "team_size": 2.0,
    "location": null,
    "group_partner": "Tom Blomfield",
    "group_partner_yc": "https://www.ycombinator.com/people/tom-blomfield",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:machine-learning; industry:finance; industry:analytics; industry:insurance; industry:investing",
    "founders": [
        {
            "name": "Benedict Altier, Founder",
            "description": "Benedict has advised more than 10 leading insurers and asset managers working across insurance, reinsurance, and risk modeling. He is also a front-end developer with a decade's worth of experience designing and building web applications. He graduated with a 1st class degree in Chinese Studies from the University of Oxford. As a visiting student at Peking University, he advised leading Chinese technology companies including a spin-out from Baidu.",
            "linkedin": "https://uk.linkedin.com/in/benedict-altier-0041748b"
        },
        {
            "name": "Lucas Schneider, Co-Founder and CTO",
            "description": "Building CatX to revolutionize risk transfer for insurers. Bringing my expertise in financial markets and investing to the insurance world. \n\nStarted my career in Credit Securitisation at Barclays in London where I structured and executed multiple transactions in excess of $10bn+ in value. Oxford PhD Candidate in Machine Learning for Gene Editing. Previously, leading the research team at a web3 hedge fund, focusing on infrastructure and decentralized finance investments.",
            "linkedin": "https://linkedin.com/in/lucas-sch"
        }
    ],
    "status": true,
    "generated_description": "**Company Overview: CatX**\n\nFounded in 2023 and currently a standout member of Y Combinator’s Batch S23, CatX is on a simple yet ambitious mission: to establish a digital marketplace for insurance risk. Located in Dover, DE, it operates with a lean team of just two employees and is backed by notable figures like Tom Blomfield, serving as a Group Partner.\n\n**What CatX Does**\n\nAt its core, CatX connects insurance carriers with institutional investors, enabling them to trade and transfer insurance risk in an efficient manner. The platform not only demystifies complex insurance risk models for asset managers but also streamlines the risk transfer process, providing insurers faster, cheaper access to capital through partnerships with various funds.\n\nRecent developments include the launch of Catamaran Parametric, a suite of tools for parametric insurance transactions, aimed at enhancing the capabilities of both insurers and brokers. Here, you can access state-of-the-art technology tailored for better risk analysis, underwriting, and investor opportunities.\n\n**Tagging the Trends**\n\nThe company is affiliated with a range of cutting-edge fields: machine learning, finance, analytics, insurance, and investing. It brings together over 40,000 projects and more than 20 capital providers, creating an ecosystem where ideas flourish and yield high returns.\n\n**Unique Selling Proposition**\n\n1. **Digital Access**: Offers world-class tools for modeling and managing insurance risk transactions.\n2. **Transparency**: Employs special purpose vehicles and segregated accounts, providing independent management oversight.\n3. **Regulation**: Operates under the guidance of the Bermuda Monetary Authority as an innovative marketplace provider.\n\n**What’s Happening Now**\n\nCatX is not just resting on its laurels. It is active in developing its marketplace, infusing AI and machine learning into its processes. This includes advanced pricing mechanisms and the integration of reliable risk models, ensuring clients can transact securely and effectively.\n\nWith **$700 million+** in listed opportunities, **50+ funds**, and **$650 billion+** in total fund AUM, CatX is opening doors to investment opportunities previously viewed as inaccessible.\n\n**Future Directions**\n\nAs CatX continues to innovate, it aims to position insurance-linked securities (ILS) as a reliable and uncorrelated asset class. The focus is on flexible risk transfer structures, including catastrophe bonds and parametric insurance, to attract diverse investments.\n\nIn a world where understanding and trust are paramount, CatX stands to revolutionize the insurance landscape, marrying technology with risk management in ways that make sense to investors, insurers, and brokers alike.\n\nFor those willing to explore more, CatX invites inquiry through its website [CatX.re](https://catx.re). With such an ambitious agenda and a solid foundation, it's not just a company to watch—it's one to join in this evolving narrative of risk and investment.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/7d6c55659c99478604e50477bde66bbcb83ef827.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191044Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=dd43255dcec6c3c3c2e9ab242e9d1664788c8029302d47660d78fc2341eac38b",
    "social_links": [
        "https://www.linkedin.com/company/catx/"
    ],
    "logo_path": "data/logos\\CatX_logo.png"
}