{
    "links": "https://www.ycombinator.com/companies/cero",
    "name": "Cero",
    "headline": "Automated communication between hospitals and patients in Latam",
    "batch": "S21",
    "description": "At Cero, we solve specific coordination tasks between hospitals and patients, such as appointment confirmations and last minute cancellations, by automatically communicating with patients over WhatsApp. For example, a patient can confirm and reschedule their appointment without needing to call anyone.\r\n\nAlmost half of the medical appointments in Latin America are missed because patients simply do not show up. This ranges from missing a regular dentist check to missing an expensive MRI scan. With increasing pressure to improve access to care in developing countries, optimizing communication and coordination with patients is a key task to achieve. This is a massive problem especially in places where most people don't know how to effectively use self-service mediums (or are too busy to use them).\r\n\nWe bootstrapped the company and we are profitable. As of August 2021 we have $97K in monthly revenue from 15 clients with a CMRG of 20% in the last year. We have 100% logo retention and we grow with our clients. We are currently coordinating over 600,000 medical appointments every month, just in Chile.\r\n\nThis problem represents a $3.5B market opportunity in Latin America only. Latin America has 650M people, each one having an average of 3 medical consultations per year. We charge for every time we effectively communicate with a patient. We plan to handle several coordination interactions with every patient for each consultation, which considers a roadmap of scheduling, confirming, booking, reimbursements, payments, among others.\r\n\nWe are a team mixing strong knowledge about the healthcare industry with deep technical skills. Felipe (CEO) is a former dentist that has led deep changes in healthcare payments in Chile. Mauricio (CTO) and Jorge (R&D), both PhD in Computer Science, led the creation of the most advanced Spanish Language Neural Network used daily by scientists and practitioners in LatAm (BETO: Spanish BERT).\r\n\nIn a weekend project, Mauricio and Jorge automated the communication with students attending a summer school obtaining impressive engagement. Felipe was struggling with contacting his patients to coordinate appointments, and saw a big opportunity in this technology. The three together have designed and run a solution that as of 2021 is coordinating over 600,000 patients per month in their home country, Chile.",
    "activity_status": "Active",
    "website": "https://cero.ai",
    "founded_date": 2017.0,
    "team_size": 10.0,
    "location": "Santiago, Chile",
    "group_partner": "Brad Flora",
    "group_partner_yc": "https://www.ycombinator.com/people/brad-flora",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:machine-learning; industry:consumer-health-services; industry:b2b; industry:nlp",
    "founders": [
        {
            "name": "Felipe Rodríguez, Founder",
            "description": "Entrepreneur and creative innovator. Currently co founder & CEO at CERO.\nPreviously, I founded Excedent, a solution for eligibility and payment through API's for medical services connecting over 500 health providers with the top 3 health insurances in Chile. In 2013 I founded Deenty where we worked to improve access to oral care in Chile, being recognized as one of Chile's 100 young leaders of the year. Founder of Rompientes, NGO focused on preserve coastal environments and surfbreaks",
            "linkedin": "https://cl.linkedin.com/in/luis-felipe-rodríguez-besa-31ba772a"
        },
        {
            "name": "Jorge Pérez, Founder",
            "description": "Jorge has a PhD in Computer Science and more than 10 years of experience in research with a focus on Web Data, Natural Language Processing and Deep Learning. He is a Microsoft Research PhD Fellow and he has published his research in top Data Science and AI conferences such as NeurIPS, ICLR, IJCAI, WWW, SIGIR and VLDB. He has developed open scientific NLP tools for the Spanish language that are used in a daily basis by the industry and academia all across Latam.",
            "linkedin": "https://www.linkedin.com/NA"
        },
        {
            "name": "Mauricio Quezada, Founder",
            "description": "PhD in CS from Universidad de Chile, Engineer and Software Developer. Member of the winning local ICPC team of 2011 and organizer of several training camps of Chile and other Latam countries for programming contests. I've published research articles in known Data Science venues such as SIGIR, EPJ Data Science, and PloS One.",
            "linkedin": "https://www.linkedin.com/in/mauricio-quezada-317100199/"
        }
    ],
    "status": true,
    "generated_description": "Cero is shaking up the healthcare communication landscape in Latin America. Founded in 2017 and part of Y Combinator's Batch S21, Cero aims to streamline the often-inefficient communication between hospitals and patients via automated messaging—primarily using WhatsApp. It's a simple yet powerful solution to a massive problem: nearly half of all medical appointments in Latin America are missed. That’s everything from routine dentist visits to expensive MRI scans, wasting time and resources.\n\nThe company jumped into action to tackle this issue. By automating appointment confirmations and cancellations, patients can swiftly manage their appointments without having to call anyone—a huge advantage in a region where many people might struggle with technology or simply be too busy. As of August 2021, Cero was already coordinating over 600,000 medical appointments monthly in Chile alone.\n\nTheir financials paint an impressive picture: Cero has bootstrapped its way to profitability, currently pulling in $97K in monthly revenue across 15 clients, boasting a remarkable 100% logo retention and a consistent customer growth rate (20% CMRG in the past year). The Latin American healthcare market, with its 650 million people averaging three medical consultations a year, presents a staggering $3.5 billion opportunity for companies like Cero.\n\nThe team behind Cero combines deep healthcare expertise with strong technical skills. Felipe, the CEO, is a former dentist who has driven significant changes in healthcare payment systems in Chile. Co-founders Mauricio and Jorge bring advanced technical prowess to the table, having developed BETO, the most advanced Spanish Language Neural Network utilized across the region.\n\nWhat’s more, their technology doesn't just confirm appointments; it captures responses in natural language, making the interaction seamless and engaging. Whether it's confirming a patient’s attendance, managing cancellations, or even facilitating rescheduling, Cero provides a human touch through AI, proving that efficiency and empathy can coexist.\n\nWith a lean team of just 10 employees, and a commitment to adapt to existing healthcare institution processes, Cero is carving a lane in the B2B consumer health services market, integrating effortlessly into existing systems to maximize efficiency. As they grow their footprint in Latin America, their approach to solving healthcare communication barriers could lead to transformative improvements in patient care accessibility across the region. \n\nCheck them out at [Cero.ai](https://cero.ai) for more details on their innovative solutions.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/58e681635c3e2cc212b53790c8b60b2603e1c7ad.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191046Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=3ae6f9fb969a7951f7e1114cd4405aac76ba57a477cb0c5870a4219e4674fe3e",
    "social_links": [
        "https://www.linkedin.com/company/ceroai/"
    ],
    "logo_path": "data/logos\\Cero_logo.png"
}