{
    "links": "https://www.ycombinator.com/companies/chequpi",
    "name": "CheqUPI",
    "headline": "India's first UPI wallet for foreign nationals and NRIs",
    "batch": "S23",
    "description": "Cheq is a modern UPI payments app for NRIs and international citizens visiting India. \r\nUsing Cheq, you can pay digitally at over 55mn+ merchants across India. \r\nWe help tourists avoid ATMs and minimize their foreign exchange costs while in India.",
    "activity_status": "Active",
    "website": "https://www.cheq.money",
    "founded_date": 2021.0,
    "team_size": 15.0,
    "location": "Bengaluru, India",
    "group_partner": "Harj Taggar",
    "group_partner_yc": "https://www.ycombinator.com/people/harj-taggar",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:payments; industry:india; industry:consumer-finance",
    "founders": [
        {
            "name": "Sudhanshu Shekhar, Founder",
            "description": "Building Cheq UPI - A better payments app for foreign nationals and NRIs visiting India.\n\nPrevious work experience: Ispirt, Zeta, Headout, Walmart",
            "linkedin": "https://linkedin.com/in/sudshekhar02"
        },
        {
            "name": "Manish Shukla, Founder",
            "description": "Building Cheq UPI to enhance the digital payment experience of foreign nationals and NRIs\n\nPrevious experience: Zeta, Ispirt",
            "linkedin": "https://linkedin.com/in/mkshukla"
        }
    ],
    "status": true,
    "generated_description": "**CheqUPI: Revolutionizing Payments for Foreign Nationals in India**\n\n**Overview:**\nCheqUPI, founded in 2021, is India's first UPI wallet tailored specifically for foreign nationals and NRIs. Based in Bengaluru and part of Y Combinator's Batch S23, this fintech startup aims to transform the way international visitors transact while in India. With a compact team of 15, CheqUPI is paving the way for seamless digital payments across the subcontinent.\n\n**Mission:**\nCheqUPI's mission is straightforward: enable foreign tourists to navigate India's vibrant market without the hassle of ATM withdrawals or exorbitant foreign exchange fees. With CheqUPI, users can pay at over 55 million merchants throughout India using just their phones.\n\n**Key Features:**\n- **UPI Payments:** Users can leverage the Unified Payments Interface (UPI) to make transactions effortlessly at a wide array of vendors, including hotels, restaurants, shops, and more.\n- **Tourist Wallet:** For a one-time fee of ₹999 (around $12), users can set up a tourist wallet that allows them to manage their payments digitally, avoiding the pitfalls of cash and currency exchanges.\n- **Security and Support:** Every transaction is secured with data encryption and two-factor authentication, ensuring users’ safety. CheqUPI also offers proactive support to assist users as they navigate their payment journeys.\n\n**How It Works:**\nTo start using CheqUPI, foreign nationals must undergo a physical verification process and provide necessary documentation, such as a passport and Indian visa. Once set up, users can load funds onto their wallets via international debit or credit cards, making it a breeze to transact in a cashless manner at millions of points of sale across the country.\n\n**Why Choose CheqUPI?**\n1. **Cost-Efficiency:** By minimizing fees associated with cash withdrawals and offering competitive exchange rates, CheqUPI saves money for travelers.\n2. **Convenience:** No more hunting for ATMs or worrying about carrying large amounts of cash. Users can pay directly through their mobile phones at places they visit.\n3. **Wide Acceptance:** With access to millions of merchants, users can conveniently shop, dine, and explore without barriers.\n\n**Current Progress:**\nCheqUPI has gained momentum by participating in significant partnerships, like the one with Transcorp, and has attracted investment funding, including $500k from Y Combinator. This positions CheqUPI not just as a payment solution, but also as a vital player in India’s rapidly evolving fintech landscape.\n\n**Final Thoughts:**\nIn an age where cashless transactions are becoming the norm, CheqUPI stands out by focusing on a niche audience—the foreign travelers arriving in India. By simplifying payments through a single innovative wallet, it makes saying \"goodbye\" to bulky cash a reality. If you're planning a trip to India, outfitting yourself with CheqUPI might just make your experience a whole lot smoother.\n\nFor more information or to get started, visit their website: [CheqUPI](https://www.cheq.money).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/d14086875cfc9b44639afa26368a5c6e511e4f0f.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191048Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=d8c3ad73265c405c0ef7283842e1287166f85a632019aac1a98b8baeb7919910",
    "social_links": [
        "https://www.linkedin.com/company/cheq-it/",
        "https://twitter.com/cheqit_",
        "https://instagram.com/cheqit_",
        "https://www.crunchbase.com/organization/cheq-money"
    ],
    "logo_path": "data/logos\\CheqUPI_logo.png"
}