{
    "links": "https://www.ycombinator.com/companies/chorus-sleep",
    "name": "Chorus Sleep",
    "headline": "Mobile app and coaching program that helps employees sleep better",
    "batch": "W21",
    "description": "Chorus is a mobile app and coaching program that helps employees sleep better. We do this by combining sleep coaching, short lessons, and relaxing audio sessions that help employees, and their families, fall asleep faster and get better quality sleep through the night.",
    "activity_status": "Active",
    "website": "https://www.chorussleep.com/",
    "founded_date": 2019.0,
    "team_size": 4.0,
    "location": "San Francisco",
    "group_partner": "Gustaf Alstromer",
    "group_partner_yc": "https://www.ycombinator.com/people/gustaf-alstromer",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:mental-health-tech; industry:sleep-tech; industry:health-tech; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Ali Abramovitz, Founder",
            "description": "Ali is the CEO of Chorus Sleep, which is a mobile app and coaching program that helps employees sleep better. Before Chorus, Ali did a mix of business and product at Twilio, and prior to that, she was an analyst at a hedge fund.",
            "linkedin": "https://www.linkedin.com/in/ali-abramovitz-cook-69458459/"
        },
        {
            "name": "MK Hurlbutt, Founder",
            "description": "MK is the co-founder and Chief of Experience & Community at Chorus. Prior to Chorus, she spent 6 years as a SoulCycle Instructor in the Bay Area, helping to open the downtown SOMA location in 2014 and was promoted to Master Instructor in 2019. She has a passion for building communities around health and wellness and is committed to making these resources diverse, inclusive, and accessible to all.",
            "linkedin": "https://www.linkedin.com/in/mkhurlbutt/"
        },
        {
            "name": "Warren Runk, Founder",
            "description": "Co-founder and CTO of Chorus Meditation: https://chorusmeditation.com. Long time software engineer, technical leader, meditator, and passionate entrepreneur. Hopefully more amazing characters and symbols will be added to this box soon!",
            "linkedin": "https://www.linkedin.com/in/warrenrunk"
        }
    ],
    "status": true,
    "generated_description": "**Chorus Sleep: A New Approach to Rest**\n\nFounded in 2019 and hailing from the prestigious Y Combinator's Batch W21, Chorus Sleep is a San Francisco-based startup on a mission to tackle the increasingly prevalent issue of sleep deprivation—especially among employees. Their approach isn’t just about counting sheep; it’s about providing comprehensive solutions for better sleep.\n\n**What is Chorus Sleep?**\n\nChorus Sleep offers a mobile app and coaching program designed to help individuals, particularly employees, improve their sleep quality. The service combines sleep coaching, brief educational lessons, and soothing audio sessions to help users fall asleep faster and improve the quality of sleep overnight. This isn’t merely an app for tracking your sleep; it’s a holistic, evidence-based platform that addresses issues ranging from insomnia and sleep apnea to challenges related to menopause.\n\n**How Does It Work?**\n\nChorus Sleep follows a straightforward process:\n1. **Track Your Sleep:** Users can measure their sleep patterns and assess their progress.\n2. **Relax and Sleep:** Expert-led sessions and calming sounds, like white noise, help users nod off quickly.\n3. **Learn Effectively:** Users access interactive content and diagnostics to better understand their sleep issues.\n4. **Human Assistance:** Real, human coaches are on hand to guide users through personalized programs.\n\nThe impact is significant. Users have reported a 37% improvement in the time taken to fall asleep, a 30% reduction in nighttime awakenings, and a remarkable 55% improvement in workplace collaboration.\n\n**Why Sleep is Critical?**\n\nChorus Sleep's ethos rests on the understanding that sleep is foundational to health. It’s not just another health barometer to tick off; rather, it's the cornerstone upon which our physical and mental well-being is built. If we're not well-rested, everything else—whether it's diet management or stress control—becomes futile.\n\n**The Team Behind Chorus**\n\nCurrently operating with a lean team of four and guided by Group Partner Gustaf Alstromer, Chorus Sleep is perfectly positioned in the bustling San Francisco Bay Area—a hub for health tech innovation. \n\n**The Backing**\n\nThe startup has caught the eye of notable investors in the Bay Area, showcasing its strong potential in the market. They are not just backed financially—teams at companies like LinkedIn, Asana, and Modern Health are already leveraging Chorus Sleep to boost employee well-being, proving it’s a sought-after benefit.\n\n**Privacy Matters**\n\nChorus Sleep emphasizes robust data security. They adhere to strict privacy regulations, ensuring that no personal data is shared outside their system. Customers can focus on their sleep improvement without anxiety over data breaches.\n\n**Final Thoughts**\n\nChorus Sleep is redefining how we view sleep in the context of wellness at work. In this fast-paced world where burnout is a growing concern, thinking about sleep health isn’t just smart—it’s essential. If you're an individual struggling to catch those Z’s or an employer eager to support your workforce, Chorus Sleep might just be the answer you’ve been searching for. \n\nFor more details, you can explore their offerings at [Chorus Sleep](https://www.chorussleep.com/).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/866cddbd40637d4864fb591d7a3f6156b0d5783f.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191048Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=1da151ef99aeeda0380f87b358e37f07d423f1aafe47b6d3f856f0d10e4f8a45",
    "social_links": [
        "https://www.linkedin.com/company/19139992",
        "https://twitter.com/ChorusSleep"
    ],
    "logo_path": "data/logos\\Chorus_Sleep_logo.png"
}