{
    "links": "https://www.ycombinator.com/companies/cinder-2",
    "name": "Cinder",
    "headline": "Cinder | Responsible AI, Trust & Safety, and Data Labeling At Scale",
    "batch": "W22",
    "description": "From content moderation to responsible AI, Cinder empowers businesses to orchestrate and automate digital safety at scale. Cinder was founded to help organizations foster safe online spaces for everyone. Our platform empowers companies from start-ups to enterprises with end-to-end capabilities to mitigate harm, investigate abuse, and produce trustworthy and reliable AI outcomes. Building your world-class company means keeping your users and community safe—Cinder unlocks faster growth by making safety easy. We work with customers in every industry from frontier AI labs to e-commerce and social media.",
    "activity_status": "Active",
    "website": "http://www.cinder.co",
    "founded_date": 2021.0,
    "team_size": 20.0,
    "location": "Washington, DC",
    "group_partner": "Michael Seibel",
    "group_partner_yc": "https://www.ycombinator.com/people/michael-seibel",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:artificial-intelligence; industry:saas; industry:b2b; industry:compliance; industry:trust-&-safety",
    "founders": [
        {
            "name": "Glen Wise, Founder",
            "description": "After graduating from Carnegie Mellon, Glen joined Facebook as a security engineer to lead the build out of their community threat intelligence platform, working directly with Phil Brennan for over 3 years. Glen started Cinder in 2021 to help other companies solve similar trust and safety problems.",
            "linkedin": "https://www.linkedin.com/in/glenwise/"
        },
        {
            "name": "Phil Brennan, Founder",
            "description": "Phil joined Facebook in 2017 to build out their community threat intelligence team, after running counterterrorism units for the US government. Phil worked with Glen Wise for several years at Facebook before joining him to co-found Cinder.",
            "linkedin": "https://www.linkedin.com/in/philip-brennan-33598610a/"
        }
    ],
    "status": true,
    "generated_description": "Cinder is a company that's tackling one of the most pressing issues in the digital age: online safety and responsible AI. Founded in 2021 and a proud member of Y Combinator's Batch W22, this Washington, DC-based startup has quickly carved out its niche in the world of SaaS, providing a comprehensive platform for content moderation, trust and safety, and data labeling.\n\nTheir mission? To empower organizations of all sizes—from scrappy startups to established enterprises—to create safer online spaces. In a landscape where the stakes are getting higher daily, Cinder acts as a sort of operating system for digital safety. By automating processes and providing end-to-end capabilities, Cinder helps businesses mitigate harm, investigate abuses, and achieve reliable AI outcomes with confidence.\n\nAt the core of Cinder's offering is an integrated platform that eliminates the chaos often associated with managing safety protocols. Gone are the days of switching between multiple apps and dealing with spreadsheets—Cinder seeks to pull everything into a unified workflow where companies can track policies, enforce compliance, and harness valuable data seamlessly.\n\nThe company is already seeing traction across diverse sectors, serving clients that range from frontier AI labs to e-commerce giants and social media platforms. Notable users include OpenAI and Patreon, which reflects Cinder's growing reputation in the trust and safety arena.\n\nWith a team of about 20 talented individuals and backed by a notable figure like Michael Seibel as Group Partner at Y Combinator, Cinder is equipped to push forward in an ever-evolving market. Their capabilities span from real-time data compliance to AI-enhanced workflows, ensuring that businesses remain adaptable in the face of emerging risks.\n\nFor anyone interested in responsible AI, data compliance, or just ensuring a safer digital environment, Cinder is a company worth keeping your eye on. You can learn more about them on their website: [Cinder](http://www.cinder.co).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/bfd817d5203922404bf9e7479f1e8ce4c875b00c.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191049Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=ff71bbc131d5ace316101b8a0e1dd552cbbb593a5116eb947e0dda5cd30c8324",
    "social_links": [
        "https://www.linkedin.com/company/cinder-intelligence"
    ],
    "logo_path": "data/logos\\Cinder_logo.png"
}