{
    "links": "https://www.ycombinator.com/companies/circular",
    "name": "Circular",
    "headline": "Subscription consumer electronics for Asia",
    "batch": "W22",
    "description": "Circular is accelerating the adoption of the circular economy by making subscriptions the best way to access and experience tech: from smartphones, laptops, and headphones to gaming, VR and wearables.\r\n\nOur customers get their hands on the best tech through low-cost, convenient subscriptions. They can pay monthly, keep it as long as they want, and if they love it, buy it. If they return it, we carefully refurbish it and pass it on to the next loving owner - radically extending its useful life.",
    "activity_status": "Active",
    "website": "https://www.nowcircular.com",
    "founded_date": 2021.0,
    "team_size": 25.0,
    "location": "Singapore, Singapore",
    "group_partner": "Dalton Caldwell",
    "group_partner_yc": "https://www.ycombinator.com/people/dalton-caldwell",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:marketplace; industry:consumer; industry:e-commerce",
    "founders": [
        {
            "name": "Nicolas Ramsay, Founder",
            "description": "Nick Ramsay is the co-founder and CEO of Circular. Nick drives Circular's mission to accelerate the adoption of the circular economy by making subscriptions the best way to access and experience tech. Nick is a proven business leader with hands-on experience across product management, new venture building and business development and has been successfully scaling Fintech and marketplaces across SE-Asia for 10+ years.",
            "linkedin": "https://www.linkedin.com/in/nicolasramsay/"
        },
        {
            "name": "Yaniv Bernstein, Founder",
            "description": "Yaniv Bernstein is the co-founder and COO of Circular. Yaniv is building a scalable and high-performing organisation in pursuit of Circular's mission to accelerate the adoption of the circular economy by making subscriptions the best way to access and experience tech. Yaniv is a proven organisational leader and technologist, working in Engineering at Google for 10 years, and then acting at VP Engineering and COO at Airtasker, Australia's leading local services marketplace.",
            "linkedin": "https://linkedin.com/in/ybernstein"
        },
        {
            "name": "George Oliver, Founder",
            "description": "10+ years experience, including 7+ years experience in logistics in SE-Asia across large and small scale Log Tech Start-ups. \n\nPrior to co-founding Circular, George has held senior leadership positions at NinjaVan a new SG Unicorn (Head of Sea Freight) and Janio, a Sequoia-backed company (Head of B2B). Prior to that George co-founded Karzo, a logistics company in Myanmar.",
            "linkedin": "https://www.linkedin.com/in/george-oliver-81139754/"
        },
        {
            "name": "Pantha Roy, Founder",
            "description": "Pantha is a co-founder and the CPO of Circular. He drives the product strategy and development that is core to our mission of making subscriptions the best way to access and experience tech. \n\nPantha has built product teams and products in a range of tech companies from early-stage to mature ones. Pantha started his career as a quant/trader at an investment bank in Europe. Pantha has engineering degrees from Imperial College, Cambridge University and an MBA from INSEAD.\n\nhttps://www.pantha.io/",
            "linkedin": "https://sg.linkedin.com/in/pantharoy"
        }
    ],
    "status": true,
    "generated_description": "**Company Overview: Circular**\n\n**Founding and Background**\nCircular was founded in 2021 and quickly became a part of Y Combinator’s Winter 2022 batch. Operating out of Singapore, it employs a dedicated team of 25 individuals. The company is primarily focused on revolutionizing how consumers access technology through a subscription model, making it a central player in the Asian market for consumer electronics.\n\n**Mission**\nThe mission of Circular is straightforward yet impactful: to promote the circular economy by providing convenient, affordable subscriptions for consumer electronics throughout Asia. By transitioning from ownership to rental, Circular aims to redefine our relationship with technology.\n\n**What They Offer**\nCircular has designed its services to cater to the tech-savvy consumer who wants access to the latest gadgets—think smartphones, laptops, VR equipment, and gaming gear—without the hefty price tag associated with outright purchases. Here’s how it works:\n\n1. **Choose**: Customers select the device they want and determine their subscription length.\n2. **Order**: After creating an account, they’ll receive confirmation of their spending power.\n3. **Delivery**: Devices are delivered for free right to the customer’s doorstep.\n4. **Options**: At the end of the subscription, users can choose to upgrade, extend, or return the device.\n\nIf a customer decides to return a device, Circular refurbishes and rents it out again, extending its lifecycle and reducing waste—a win-win for consumers and the planet.\n\n**Business Model**\nBy promoting a subscription model, Circular encourages users to experience ownership without the commitment. This approach not only aligns with sustainability but also reflects changing consumer preferences, where renting is becoming as accepted as owning.\n\n**Target Market**\nCircular primarily operates in Singapore and Australia, two regions with high technology adoption rates. By tapping into these markets, Circular caters to a tech-savvy, environmentally-conscious demographic looking for budget-friendly options.\n\n**Industry Positioning**\nCircular positions itself at the intersection of several industries, tagged under fintech, marketplace, consumer electronics, and e-commerce. This broad positioning enables it to be flexible and innovative in how it addresses consumer needs.\n\n**Team and Support**\nBacking and mentorship from seasoned partners, including Dalton Caldwell from Y Combinator, provide Circular with the resources needed to thrive and innovate in this space.\n\n**Conclusion**\nIn a world where tech gadgets cycle in and out of trend at breakneck speed, Circular offers a refreshing approach—subscription over ownership. Their commitment to sustainability and customer satisfaction places them on a promising trajectory, aligned with modern consumption behaviors and environmental needs.\n\nFor more information, visit [Circular's website](https://www.nowcircular.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/0176e0a0d2ba721728d63df445dc747454809810.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191051Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=08ef4f509a871485db2d98d6439202e0436f1a7a66e99b8270b4b4a16d23cd09",
    "social_links": [
        "https://www.linkedin.com/company/nowcircular/",
        "https://www.crunchbase.com/organization/circular-0280"
    ],
    "logo_path": "data/logos\\Circular_logo.png"
}