{
    "links": "https://www.ycombinator.com/companies/circleback",
    "name": "Circleback",
    "headline": "AI-powered meeting notes and automations",
    "batch": "W24",
    "description": "Circleback helps teams get the most out of every meeting–whether it's on Zoom, Google Meet, Slack huddles, in-person, or any other meeting platform–by writing notes and automatically taking action on details that matter most.\r\n\nFor example, Circleback can automatically identify feature requests that come up in product demo calls and create Linear tasks for each of them, or update your CRM with customer details after a sales call.\r\n\nBefore Circleback, Ali led the first integration of LLMs into the Stripe support product and Kevin worked on predictive analytics at Tableau as a senior software engineer.",
    "activity_status": "Active",
    "website": "https://circleback.ai",
    "founded_date": 2023.0,
    "team_size": 4.0,
    "location": null,
    "group_partner": "Gustaf Alstromer",
    "group_partner_yc": "https://www.ycombinator.com/people/gustaf-alstromer",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": null,
    "founders": [
        {
            "name": "Ali Haghani, Founder",
            "description": "Ali is the co-founder and CEO of Circleback.\n\nPrior to Circleback, Ali was an engineer at Stripe where he led the first integration of LLMs into support experiences, reducing operating costs by over $2M annually. Before that, he worked on ads and experimentation at Twitter, building a system that enabled A/B testing ads campaigns on the platform.",
            "linkedin": "https://linkedin.com/in/alihaghani"
        },
        {
            "name": "Kevin Jacyna, Founder",
            "description": "Kevin is a co-founder of Circleback. Before Circleback, Kevin was a senior software engineer at Tableau, where he worked on bringing predictive analytics into Tableau, as well as improving compatibility between the desktop and web products. He formerly played Junior A hockey in Canada.",
            "linkedin": "https://linkedin.com/in/kevinjacyna"
        }
    ],
    "status": true,
    "generated_description": "**Circleback Overview**\n\nCircleback is a promising startup launched in 2023, and it's part of Y Combinator's Batch W24. The company’s primary mission is to enhance productivity through AI-powered meeting notes and automations. With a small but capable team of four, Circleback is focused on making meeting management easier, whether you're meeting virtually through platforms like Zoom and Google Meet or in person.\n\n**How It Works**\n\nImagine you're in a meeting—Circleback takes meticulous notes for you. It automatically identifies key action items and insights, ensuring you’re not just passively taking notes but actively leveraging them. For example, if a feature request comes up during a product demo, Circleback can generate tasks in tools like Linear or update your CRM with rich customer insights post-sales call. This level of integration means that no detail goes unnoticed and no follow-up task slips through the cracks.\n\n**Founders' Background**\n\nThe brain behind Circleback consists of Ali and Kevin, who come from impressive backgrounds. Ali previously led the integration of large language models at Stripe, while Kevin brought his expertise in predictive analytics from his time at Tableau. This strong technical foundation is part of what drives Circleback's innovative approach to meeting notes.\n\n**Recognition and Accessibility**\n\nCircleback has already garnered attention, being recognized by TIME as a top pick for AI note-taking tools, and has earned over 150 testimonials from satisfied users. The service is straightforward to set up and has an intuitive interface that allows users to get started within minutes. Plus, it offers integrations with popular tools such as HubSpot, Salesforce, and Slack.\n\n**The Future**\n\nWith their focus on automating the tedious aspects of meeting management and ensuring no important detail is overlooked, Circleback is positioning itself as an essential tool for teams aiming to enhance their productivity. If you're looking to reclaim your time and energy, their AI-powered solution could be exactly what you need.\n\nFor more information, you can check out their website: [Circleback](https://circleback.ai).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/d7cace116b63deacb2584dae53ec11385f963c93.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191049Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=34e95025596d32f040dcacfc3546345bf8472bf0c2cf09582671b30f725f3b21",
    "social_links": [
        "https://linkedin.com/company/circlebackai",
        "https://twitter.com/circlebackai",
        "https://github.com/circlebackai"
    ],
    "logo_path": "data/logos\\Circleback_logo.png"
}