{
    "links": "https://www.ycombinator.com/companies/ciro",
    "name": "Ciro",
    "headline": "10x your prospecting on LinkedIn",
    "batch": "S22",
    "description": "LinkedIn has the best data for B2B sales but **zero automation**. Founders and sales reps waste 20-30% of their time manually searching, qualifying, and engaging leads on the platform. \r\n\nCiro makes prospecting on LinkedIn 10x easier:\r\n- Ciro Autopilot scans profiles, qualifies them against your ideal customer profile, and builds a ready-to-contact list in minutes\r\n- Ciro Enrich instantly reveals phone numbers and emails on profiles — whether you’re on a free or paid LinkedIn account (also works in Hubspot, Salesforce, and Apollo)\r\n\nCiro is built by a tight-knit team of engineers, sales execs, and product managers with experience from Stanford, Google, Meta, Flexport, and Bain & Co. We are backed by some of the best investors in the world, including Y Combinator, SV Angel, CRV, and the founders of Tegus, BuildZoom, and Flexport.",
    "activity_status": "Active",
    "website": "https://www.ciro.io/",
    "founded_date": 2022.0,
    "team_size": 5.0,
    "location": "San Francisco",
    "group_partner": "Brad Flora",
    "group_partner_yc": "https://www.ycombinator.com/people/brad-flora",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:artificial-intelligence; industry:saas; industry:b2b; industry:sales; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Ross Geiger, Founder",
            "description": "Ross is a Co-Founder and President at Ciro. Before starting Ciro with two of his best friends from Brown University, he built the sales function as VP of Sales at a dental software company (YAPI) and implemented S&M technologies while an operating partner at a software investment firm (M33 Growth). Ross holds a BA in Economics and East Asian Studies from Brown University.",
            "linkedin": "https://www.linkedin.com/in/rossgeiger1"
        },
        {
            "name": "Richard Lee, Founder",
            "description": "Richard is CEO at Ciro. Previously, he was COO at BuildZoom (W13), one of the world's largest marketplaces for remodeling and construction, and a consultant at Bain & Company. He graduated with a degree in Applied Mathematics & Economics from Brown University, and currently is on leave from Stanford's Graduate School of Business.",
            "linkedin": "https://www.linkedin.com/in/zrlee"
        },
        {
            "name": "David Winer, Founder",
            "description": "David is CTO at Ciro. Before starting Ciro, he was a product manager for the Kotlin programming language at Google. Before that, he worked as a software engineer and product manager at various startups and as a management consultant at Bain & Co. He has a bachelor's degree in Applied Math from Brown University, a Master's in Electrical Engineering & Computer Science from Berkeley, and an MBA from Stanford.",
            "linkedin": "https://www.linkedin.com/in/david-winer"
        }
    ],
    "status": true,
    "generated_description": "Ciro is a tech startup based in San Francisco, founded in 2022 and part of Y Combinator's Batch S22. Their mission? To transform LinkedIn prospecting, making it 10 times easier for sales professionals. With many founders and sales reps currently spending 20-30% of their time on manual tasks—searching for and qualifying leads—Ciro seeks to automate this process dramatically.\n\n**What Does Ciro Offer?**\n\n1. **Ciro Autopilot**: This tool automates the lead qualification process. It scans LinkedIn profiles to compile a list of prospects that fit your ideal customer profile in mere minutes. Imagine replacing those tedious hours of searching with a few quick clicks.\n\n2. **Ciro Enrich**: This feature enhances your lead lists by providing essential contact information, such as phone numbers and emails, for prospects identified on LinkedIn. The best part? This functionality works whether you're using a free or paid LinkedIn account, and it integrates smoothly with popular CRMs like HubSpot, Salesforce, and Apollo.\n\nCiro's team is compact yet formidable, consisting of five skilled engineers, sales executives, and product managers with backgrounds from illustrious companies such as Stanford, Google, and Bain & Co. Their investor lineup includes giants like Y Combinator and SV Angel, lending credibility and support.\n\n**Why Use Ciro?**\n\n- **Significant Time Savings**: By leveraging AI technology, Ciro allows users to reduce labor-intensive prospecting to a fraction of the time it typically takes.\n- **Integrations**: Ciro plays nicely with the tools teams already use, meaning there's no heavy lifting required when it comes to setup.\n- **Proven Results**: Early adopters have reported returns of up to 14 times their investment within their first month, showcasing the efficacy of Ciro's tools.\n\nIn a B2B landscape where making connections is crucial yet time-consuming, Ciro positions itself as a game-changer. With its promise of speed, efficiency, and usability, it’s creating new pathways for sales teams to thrive.\n\nFor more information or to start using their solutions, you can visit [Ciro's website](https://www.ciro.io/).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/bbaec0b2ea34e1865753ccee2390c00c516e36f9.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191050Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=0002e9161ca949f6673aadab4ddc9316f01f70b5f34c18d23b643580798f9b46",
    "social_links": [
        "https://www.linkedin.com/company/ciro-io/",
        "https://www.twitter.com/GetCiro"
    ],
    "logo_path": "data/logos\\Ciro_logo.png"
}