{
    "links": "https://www.ycombinator.com/companies/cisterna-biologics",
    "name": "Cisterna Biologics",
    "headline": "High quality mRNA for therapeutic application",
    "batch": "S22",
    "description": "Founded in 2022 and based in San Diego, California, Cisterna Biologics is a technology company. It aims to solve some of the challenges currently facing the biotech industry to develop mRNA-based therapeutics – quality, quantity, longevity and cost of mRNA. As mRNA technology matures, it becomes imperative that these issues are solved so we can fully explore mRNA's endless possibilities as a therapeutic.\r\n\nCisterna uses proprietary technologies to either remove a contaminant at its source or replace the source itself. For example, to remove double-stranded RNA (dsRNA), we use ribozymes - molecular scissors - to precisely cut the mRNA at its 3’ end. This assures not only 3’ homogeneity, but also eliminates dsRNA, which are primarily produced due to self-templated additions at the 3’ end. Utilizing a PCR-like system to amplify the DNA template in large quantities eliminates the requirement for plasmid enrichment in bacteria, the prime source of endotoxin contamination. These are just a few examples of Cisterna’s powerful technologies being used to achieve our goal of 10x higher quality mRNA for therapeutic application.",
    "activity_status": "Active",
    "website": "http://www.cisternabx.com",
    "founded_date": 2022.0,
    "team_size": 2.0,
    "location": "San Diego, CA",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:synthetic-biology; industry:biotech; industry:therapeutics",
    "founders": [
        {
            "name": "Hari Bhaskaran, Founder",
            "description": "Hari Bhaskaran's journey with RNAs started with ribozymes (catalytic RNAs) almost 20 years ago in the labs of Rick Russell at UT Austin. His PhD work was focused on mechanistic understanding of RNA folding, culminating in a seminal publication in Nature (see Bhaskaran and Russell, 2007). Since then, he has held positions of increasing responsibilities in both academia and industry. He is the author of several publications and industry patents.",
            "linkedin": "https://www.linkedin.com/in/hari-bhaskaran-7697a795/"
        }
    ],
    "status": true,
    "generated_description": "Cisterna Biologics, founded in 2022 and headquartered in San Diego, California, is tackling the pressing challenges in the biotech field, particularly in developing high-quality mRNA for therapeutic applications. As part of Y Combinator's Summer 2022 batch, this innovative technology company is set on a mission: to enhance the quality, quantity, longevity, and affordability of mRNA-based therapeutics.\n\nSo, what exactly does Cisterna bring to the table? The company leverages proprietary technologies that either eliminate contaminants at their source or replace the problematic elements entirely. For instance, to cut out double-stranded RNA (dsRNA), they employ ribozymes—these are like molecular scissors that trim the mRNA to ensure its purity and efficacy. They also use a PCR-like system to amplify DNA templates without the bacterial enrichment that usually introduces endotoxin contamination. This approach allows them to ensure mRNA that’s ten times higher in quality for therapeutic use.\n\nWith the mRNA technology landscape rapidly evolving, Cisterna is all about ensuring these advancements translate into real-world impact. They have a compact team of just two employees and are currently working on a pilot program, providing dT-purified and their SPEcific Capture and Cleavage (SPECC) purified mRNA to select research customers.\n\nTo summarize, Cisterna Biologics stands at the cutting edge of mRNA technology, with a clear mission to overcome the hurdles in producing high-quality mRNA that can usher in a new era of therapeutics. For more information, you can visit their website [here](http://www.cisternabx.com). Their tags—synthetic biology, biotech, and therapeutics—say it all about the exciting journey they’re embarking on. It’s worth keeping an eye on them!",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/55feb56cd2a50fd05bb58b88c5c42caf3e9cbb22.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191050Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=385e302474f6e7873f13c7692ef6d97406586599035fe3a1a363ba0a6be2c5b6",
    "social_links": [
        "https://www.linkedin.com/company/cisterna-biologics/",
        "https://twitter.com/CisternaBXhttps://www.linkedin.com/company/cisterna-biologics/"
    ],
    "logo_path": "data/logos\\Cisterna_Biologics_logo.png"
}