{
    "links": "https://www.ycombinator.com/companies/clad",
    "name": "Clad",
    "headline": "Software to build the internet faster.",
    "batch": "W23",
    "description": "Clad is construction management software for telecom companies.\r\n\nWe help telcos like Comcast or Sonic find, manage, and pay their construction subcontractors when doing things like laying fiber or building a cell tower.\r\n\nTelco construction is a massive, $86B per year industry that still runs on spreadsheets and phone calls. Clad's wedge product will modernize contractor management, but we're not stopping there. We'll build a data moat that will power the industry’s spend, an over $3B opportunity.\r\n\nClad's ultimate goal - expand beyond internet to power all infrastructure construction, so the backbone of our world gets built faster.",
    "activity_status": "Active",
    "website": "https://withclad.com/",
    "founded_date": 2022.0,
    "team_size": 4.0,
    "location": "New York",
    "group_partner": "Jared Friedman",
    "group_partner_yc": "https://www.ycombinator.com/people/jared-friedman",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:marketplace; industry:saas; industry:construction; industry:b2b; industry:collaboration; location:new-york",
    "founders": [
        {
            "name": "Jason Rudin, Founder",
            "description": "Jason is the founder and CEO of Clad, building software to speed up internet construction. Prior to Clad, Jason was a Product Manager at Instagram and consultant at McKinsey. A New York - San Francisco boomerang, Jason loves a Broadway show just as much as a weekend in the woods.",
            "linkedin": "https://www.linkedin.com/in/jasonrudin/"
        }
    ],
    "status": true,
    "generated_description": "**Company Overview: Clad**\n\nFounded in 2022 and based in New York, Clad is a promising startup focused on transforming how telecom companies manage their construction projects. Initially developed as a construction management software for telecom operators, Clad aims to streamline the process of finding, managing, and paying subcontractors involved in tasks like laying fiber optic cables or erecting cell towers. \n\n**The Problem Addressed**\n\nThe telecommunications construction industry is enormous—worth approximately $86 billion annually—yet it remains surprisingly antiquated, primarily relying on spreadsheets and phone calls for operations. This inefficiency is ripe for disruption, and that’s where Clad steps in. Their initial focus is on modernizing contractor management, addressing the pain points that slow down project timelines.\n\n**Vision for the Future**\n\nClad's ambition goes beyond telecommunications. The founders envision creating a data moat that supports not only telecom but the broader infrastructure construction realm, which represents over a $3 billion opportunity. The ultimate goal is to build software that helps speed up the construction of the global infrastructure backbone, making it more efficient and less reliant on outdated practices.\n\n**Key Features and Offerings**\n\nClad is designed to optimize the entire lifecycle of construction management, from procurement and bidding to project tracking and financial controls. Here are some of the core functionalities:\n\n1. **Bidding:** Automates the collection and evaluation of bids, allowing for smoother negotiations for rates.\n2. **Vendor Management:** Streamlines the onboarding process for subcontractors, ensuring they meet compliance standards effortlessly.\n3. **Project Management:** Offers robust tools for tracking project progress, scheduling, and budget management.\n4. **Financial Management:** Enables real-time spending oversight, reducing manual input errors and improving invoice handling.\n\nBy integrating these features, Clad helps companies build faster, control spend, and mitigate risks associated with contractor compliance.\n\n**Team and Support**\n\nCurrently, Clad operates with a lean team of four and has secured mentorship and backing from Jared Friedman, a partner from Y Combinator, under which Clad is part of the W23 batch. \n\n**Tags and Final Thoughts**\n\nWith its focus on marketplace solutions, SaaS offerings, and construction tech, Clad is positioned uniquely within a niche that has massive growth potential. If you're involved in any construction projects within the telecom sector, you might want to check out their services. They aim to spearhead a pivotal shift in how infrastructure is built, ensuring that everything gets completed not just faster but smarter.\n\nFor more information, take a look at their [website](https://withclad.com/).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/08d5b9b45e341a88355d6e57e51367d448965ae5.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191050Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=f562bfc693ee1b085a306b8a8dbd586adb9647cff336dd2b4fc5a18044077a0f",
    "social_links": [
        "https://www.linkedin.com/company/withclad/"
    ],
    "logo_path": "data/logos\\Clad_logo.png"
}