{
    "links": "https://www.ycombinator.com/companies/clarion",
    "name": "Clarion",
    "headline": "Elevate patient communications with conversational AI",
    "batch": "W24",
    "description": "We're on a mission to make healthcare more accessible and human with voice AI technology. Our platform enables healthcare organizations and their staff to automate phone-based workflows typically handled by humans. We partner with health care organizations to reduce their operational expense and eliminate administrative burden.\r\n\nOur founders bring a blend of clinical experience and technical expertise. Ryan is a Stanford/Harvard trained physician formerly on the founding team of Two Chairs and Ophelia (W20). Jeff formerly worked on voice AI at Amazon Alexa and ML projects at Citi/Salesforce.\r\n\nWe have incredible traction and a healthy pipeline of health systems to grow into. We are well funded and backed by top investors, including Y Combinator.",
    "activity_status": "Active",
    "website": "https://clarionhealth.com",
    "founded_date": 2024.0,
    "team_size": 2.0,
    "location": "New York",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:artificial-intelligence; industry:health-tech; industry:digital-health; industry:healthcare; location:new-york",
    "founders": [
        {
            "name": "Ryan Gallagher, Founder",
            "description": "I am Stanford/Harvard-trained medical doctor. I was previously on the founding team of Two Chairs and Ophelia (YC W20).",
            "linkedin": "https://linkedin.com/in/ryangallaghermd"
        },
        {
            "name": "Jeffrey Lamothe, Founder",
            "description": "Co-Founder and CTO @ Clarion. Previously worked on voice AI at Amazon Alexa and as Lead Software Engineer at Salesforce.",
            "linkedin": "https://www.linkedin.com/in/jeffreylamothe/"
        }
    ],
    "status": true,
    "generated_description": "**Company Overview: Clarion**\n\nFounded in 2024 and hailing from Y Combinator's W24 batch, Clarion is revolutionizing patient communications in healthcare through the power of conversational AI. With a mission to make healthcare more accessible and human, their platform automates phone-based workflows, alleviating the administrative burden on medical staff. This empowers healthcare organizations to cut down on operational costs and streamline their processes.\n\n### Founders and Team\nClarion’s co-founders, Ryan and Jeff, bring an impressive mix of clinical insight and technical prowess to the table. Ryan is a physician trained at Stanford and Harvard, with a background at Two Chairs and Ophelia, while Jeff has honed his skills at Amazon Alexa and worked on machine learning projects at Citi and Salesforce. Together, they form a dynamic duo poised to tackle the challenges in healthcare communications.\n\n### What Clarion Offers\nClarion provides healthcare providers with an autonomous AI that handles patient interactions round the clock. Some key features include:\n\n- **Appointment Management:** Patients can book, reschedule, or cancel appointments anytime.\n- **Administrative Efficiency:** Automates routine tasks like billing inquiries, prescription refills, and follow-ups.\n- **Patient Engagement:** The AI engages patients via calls and texts, creating a personalized experience.\n- **Data Security:** The platform ensures patient data is protected and compliant with healthcare regulations.\n\n### Impact and Traction\nClarion has garnered significant traction in the market with a healthy pipeline of health systems looking to integrate their technology. Early adopters have reported impressive outcomes, such as:\n\n- A **92% average patient satisfaction** with the AI agent.\n- A **71% reduction** in no-shows and cancellations.\n- Decreasing average hold times by **59%** during calls.\n- Cutting administrative staff costs by **50%**.\n\n### Funding and Future Growth\nBacked by top-tier investors, including Y Combinator, Clarion is well-funded and prepared for scaling. With a lean team based in New York (just 2 employees), they are agile enough to focus on rapid implementation while continuously expanding their capabilities.\n\n### In Summary\nClarion stands at the intersection of healthcare and technology, aiming to elevate patient communications through AI innovation. By freeing healthcare teams from repetitive tasks, they not only enhance the patient experience but also empower staff to provide better in-person care. As the need for efficient communication in healthcare continues to grow, Clarion is positioned to lead the charge in transforming how healthcare organizations interact with their patients.\n\nFor more information or to schedule a demo, visit their website at [Clarion Health](https://clarionhealth.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/ad620855cf5b1a903ed1acb829e8d6687d479297.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191051Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=344a2158254fb008d80d8276c916d2b9b4f21ea1bb67a2d551f71abbcbe9f800",
    "social_links": [
        "https://www.linkedin.com/company/clarionhealthai/",
        "https://x.com/clarionhealthai"
    ],
    "logo_path": "data/logos\\Clarion_logo.png"
}