{
    "links": "https://www.ycombinator.com/companies/classkick",
    "name": "Classkick",
    "headline": "More Tries For Kids",
    "batch": "IK12",
    "description": "Every day, teachers struggle to answer all of their students’ questions. Even worse, they’re often unaware of who needs help because some students are too shy to raise hands. Classkick is a free app that eliminates those roadblocks, showing teachers exactly what their students are doing and who has pressed “I need help” on a specific part of their assignment. \r\n\nRather than reinvent how students learn or how teachers teach, Classkick facilitates current classroom learning. In Classkick, every student's’ handwriting, whether it’s a 2nd grader drawing a picture or an 11th grader doing physics, appears live to the teacher in a mosaic of working students. The teacher can zoom into any student’s sheet to help them and ask a probing question to redirect their thinking. By the time the student has read and thought through the feedback, the teacher has already swept off and helped 5 others.\r\n\nWe are hyper focused on one goal: increase student learning. To achieve this, we listen to educators to truly understand how technology can assist in the learning process.",
    "activity_status": "Active",
    "website": "http://www.classkick.com/",
    "founded_date": null,
    "team_size": 11.0,
    "location": "Chicago, IL",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:artificial-intelligence; industry:education; industry:feedback",
    "founders": [],
    "status": true,
    "generated_description": "Classkick is an innovative educational platform, embodying the mission of \"More Tries For Kids.\" It tackles a significant challenge in classrooms: teachers often struggle to address all their students' questions and may not even know who needs help, especially when some students are too shy to raise their hands.\n\nClasskick, a free app, offers a solution by making student work visible to teachers in real-time. Imagine a vibrant collage where every student's handwriting—whether a 2nd grader sketching a picture or an 11th grader solving physics problems—comes to life on the teacher's screen. This instantaneous access enables teachers to zoom into individual assignments, providing targeted assistance and prompts to encourage deeper thinking. The beauty of Classkick is that while the teacher engages with one student, they can simultaneously assist multiple others, fostering a more interactive and productive learning environment.\n\nFounded as part of Y Combinator’s Batch IK12 and based in Chicago, IL, Classkick operates with a small, dedicated team of 11 employees. They are hyper-focused on increasing student learning and actively listen to educators to understand how technology can enhance the classroom experience. \n\nWith tags like 'artificial-intelligence,' 'education,' and 'feedback,' Classkick positions itself at the intersection of tech and learning, aiming to facilitate rather than revolutionize educational methods. \n\nFor more information, you can visit their website at [classkick.com](http://www.classkick.com/). \n\nIn a world where educational technology can often feel overcomplicated, Classkick cuts through the noise, insisting on the simple but powerful idea that every student deserves the chance to try again and learn effectively.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/4b3a4d105868b234dc8a48daad2019fd9c6c87f9.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191051Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=5bcc56776b4f2a8fe0cb16bc766d0b6f3951eaf17a66b253ead199321b00766e",
    "social_links": [
        "https://www.linkedin.com/company/classkick",
        "https://twitter.com/Classkick/",
        "https://www.facebook.com/classkick/",
        "https://github.com/classkick"
    ],
    "logo_path": "data/logos\\Classkick_logo.png"
}