{
    "links": "https://www.ycombinator.com/companies/clearest-health",
    "name": "Clearest Health",
    "headline": "Rebuilding trust in American health insurance.",
    "batch": "S23",
    "description": "We are rebuilding the core infrastructure behind corporate health insurance, everything from care navigation, analytics, claims, and more. Fully cloud-native and AI-first. We are eager to directly impact the health and savings of 60% of the American population.",
    "activity_status": "Active",
    "website": "https://clearesthealth.com/",
    "founded_date": 2023.0,
    "team_size": 3.0,
    "location": "New York",
    "group_partner": "Dalton Caldwell",
    "group_partner_yc": "https://www.ycombinator.com/people/dalton-caldwell",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:artificial-intelligence; industry:saas; industry:health-tech; industry:b2b; industry:healthcare-it; location:new-york",
    "founders": [
        {
            "name": "Nicolas Raga, Founder",
            "description": "I'm the CEO and co-founder of Clearest Health. Before starting Clearest, I worked on the distributed training infrastructure for Amazon's LLM models. I also spent some time building core features for AWS's real-time data streaming service called Kinesis Data Analytics. When I'm not working, I'm all about espresso, adrenaline, fitness, and Venezuelan rap 🇻🇪",
            "linkedin": "https://linkedin.com/in/nraga"
        }
    ],
    "status": true,
    "generated_description": "Clearest Health is a New York-based startup launched in 2023, with a mission to \"Rebuild trust in American health insurance.\" It's part of Y Combinator's Summer 2023 batch, which speaks volumes about its potential. With a small but focused team of three and collaboration from Group Partner Dalton Caldwell, Clearest Health aims to revolutionize the corporate health insurance landscape.\n\nThe company is taking on some hefty challenges: it’s rebuilding core infrastructure that encompasses care navigation, analytics, claims processing, and more. What's interesting is their approach—it's fully cloud-native and, crucially, AI-first. They’re not just looking to patch up existing systems; they're rethinking and reshaping them to directly benefit roughly 60% of the American population.\n\n### What They Offer\n\nClearest Health focuses on two main products:\n\n1. **Plan Intelligence**: This tool provides data-driven insights aimed at controlling costs and enhancing decision-making. They’ve built world-class analytics that streamline operations by offering automated dashboards and insightful reporting.\n\n2. **AI Claims Guidance**: This unique offering incorporates medically trained AI to optimize claims processes. It aims to improve case management with AI-generated medical summaries and suggested care pathways, effectively making the entire claims experience smoother.\n\n### Why It Matters\n\nIn a world where many feel the complexities of health insurance can shatter trust, Clearest Health is stepping up to offer both clarity and efficiency. Their solutions promise not only better operational margins but also a more human touch in the experience. Recognizing that healthcare technology needs to work for people, not just corporations, they position themselves as a vital technology partner for third-party administrators (TPAs).\n\nGiven the ambitious goals and the innovative tech-first approach, Clearest Health is definitely one to watch in the health-tech space. Whether you're looking to navigate the murky waters of health insurance or eager for insight on cutting-edge tech applications in healthcare, their proposition is a refreshing breeze in an often stale market.\n\nFor more information, you can check out their website: [Clearest Health](https://clearesthealth.com/).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/6159c1a96e273832e5016953efd8b3b662ed7428.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191052Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=4c9e6ad66d125a4949ed78651995ed3543677cad13fa82d632c15ab3541dd08a",
    "social_links": [],
    "logo_path": "data/logos\\Clearest_Health_logo.png"
}