{
    "links": "https://www.ycombinator.com/companies/clerky",
    "name": "Clerky",
    "headline": "Makes legal paperwork easy for startups and their attorneys.",
    "batch": "S11",
    "description": "Clerky builds software to make legal paperwork easier for startups and their attorneys.  From formation to fundraising to hiring - everything a startup needs.  Thousands of top startups use Clerky to get legal paperwork done safely and efficiently.",
    "activity_status": "Active",
    "website": "https://www.clerky.com",
    "founded_date": 2011.0,
    "team_size": 15.0,
    "location": "Palo Alto",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:documents; industry:legal; industry:legaltech; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Chris Field, Founder",
            "description": "I'm a co-founder of Clerky. I was a startup attorney at Orrick, Herrington & Sutcliffe LLP. Before becoming an attorney, I worked in various management and operations roles at TippingPoint Technologies and Micron Electronics. I studied electrical engineering and history at Stanford University and I studied law at the University of Pennsylvania.",
            "linkedin": "https://www.linkedin.com/in/fieldchris"
        },
        {
            "name": "Darby Wong, Founder/CEO",
            "description": "I'm a co-founder and the CEO of Clerky. I was a startup attorney at Orrick Herrington & Sutcliffe LLP and have a law degree from Harvard Law School. Prior to law school, I majored in computer science at the University of Washington, where I worked on machine learning research.",
            "linkedin": "https://www.linkedin.com/in/darbywong/"
        }
    ],
    "status": true,
    "generated_description": "### Clerky: Simplifying Legal Paperwork for Startups\n\n**Mission**: Clerky exists to make legal paperwork shockingly simple for startups and their attorneys. This means taking the often tedious and complex tasks associated with legal documentation—from incorporation to fundraising and hiring— and streamlining them into user-friendly software. \n\n**Overview**:\nFounded in 2011 as part of Y Combinator’s S11 batch, Clerky operates out of Palo Alto with a compact team of 15. The focus is not just on paperwork; it aims to ensure that legal processes are handled safely and efficiently, earning the trust of thousands of leading startups in the process. \n\n**What They Do**:\nClerky offers a suite of services tailored specifically for startups, which includes:\n- **Formation**: Simplifying the process of incorporating, especially as a Delaware C corporation, which is the standard for high-growth startups.\n- **Fundraising**: Tools like board consents, SAFEs (Simple Agreements for Future Equity), and more for effective fundraising.\n- **Hiring**: Templates and guidance for new hire paperwork, including offer letters and NDAs.\n- **Commercial Agreements**: Easy-to-use templates for one-way and mutual NDAs.\n- **Maintenance**: Ongoing support for things like company name changes and increased authorized shares.\n\n**The Unique Edge**: \nUnlike traditional legal services, Clerky is designed by startup attorneys who understand firsthand the legal pitfalls that can disrupt early-stage ventures. This insider knowledge enables them to craft tools that help founders navigate their companies' legal needs without the headache. \n\n**Noteworthy Features**:\n- **Customizable Legal Documentation**: Startups can tailor key terms in their paperwork to suit their unique needs.\n- **Collaborative Interface**: Founders can include lawyers in the process for review and input, ensuring accuracy and compliance.\n- **Expert Support**: They combine automated ease with real legal expertise, providing reassurance that documents are not only fast to produce but also legally sound.\n\n**Client Testimonials**:\nClerky is trusted by notable experts and countless successful startups. Partners from prominent law firms praise them for their accuracy and efficiency, often noting how the distinction between using Clerky versus generic services can make or break a startup's legal standing. \n\n**Pricing**: \nClerky offers flexible pricing options, including a \"pay per use\" model starting at $427, and a lifetime package for $819, including incorporation and necessary filings.\n\n**Conclusion**: \nIf you're a startup founder wrestling with legal paperwork, Clerky could be your best ally, turning a complex necessity into a seamless experience. Their unique combination of simplicity, expertise, and collaboration can not only save you time and money, but also help you avoid future legal headaches.\n\n**Website**: [Clerky](https://www.clerky.com)\n\nIn the end, Clerky is a testament to how technology can transform old industries, making essential processes more accessible and efficient for creators focused on building their futures.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/7c6e19052a25f219196aaadbc33ee2ec32275810.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191053Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=fe490a02d66d5952de7d75cbf3059093cf2005fa2deffa7ed6cbcea71b6830aa",
    "social_links": [
        "https://www.linkedin.com/company/clerky-inc-/",
        "https://twitter.com/clerkyinc",
        "https://www.facebook.com/clerkyinc",
        "https://www.crunchbase.com/organization/clerky",
        "https://github.com/clerky"
    ],
    "logo_path": "data/logos\\Clerky_logo.png"
}