{
    "links": "https://www.ycombinator.com/companies/cleva",
    "name": "Cleva",
    "headline": "USD banking platform for Africa",
    "batch": "W24",
    "description": "Cleva enables African freelancers and businesses to receive international payment for their service, while protecting themselves from local currency volatility. With a Cleva USD account, one can easily receive USD payment from anywhere in the world, spend via a card, pay bills, convert to local currency, and save in USD to hedge against local currency volatility.",
    "activity_status": "Active",
    "website": "https://www.getcleva.com",
    "founded_date": 2023.0,
    "team_size": 13.0,
    "location": "Lagos, Nigeria",
    "group_partner": "Tom Blomfield",
    "group_partner_yc": "https://www.ycombinator.com/people/tom-blomfield",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:b2b; industry:remote-work; industry:emerging-markets",
    "founders": [
        {
            "name": "Tolu Alabi, Founder/CEO",
            "description": "Tolu brings relevant experience from her time as a Lead Product Manager building Issuing and Banking products at Stripe. Prior to Stripe, she was a Senior PM at Amazon working on multiple products from Logistics to Augmented Reality. In addition, she has an MBA from Stanford GSB and a B.A in Computer Science and Mathematics from Grinnell College.\n\nOutside of work, she loves to play multiple sports (for now tennis and basketball). She's also a huge Lebron fan.",
            "linkedin": "https://linkedin.com/in/tolu-alabi-08697525"
        },
        {
            "name": "Philip Abel, Founder/CTO",
            "description": "Philip has built multi-region infrastructure and services for years at industry giants such as AWS, Twilio, and Akamai Technologies. Originally from Nigeria, Philip's journey took him from Kano to MIT and Georgia Tech, where he studied computer science and engineering. His background is marked by resilience, and a commitment to making a positive impact in the world. He’s an FC Barcelona fan (soccer) and a big Lionel Messi fan.",
            "linkedin": "https://linkedin.com/in/abelphilip"
        }
    ],
    "status": true,
    "generated_description": "**Cleva: Simplifying USD Banking for Africa**\n\nFounded in 2023 and based in Lagos, Nigeria, Cleva is a fintech startup on a mission to enhance the banking experience for African freelancers and businesses by providing a USD banking platform. As a recent participant in Y Combinator’s W24 batch, Cleva is already making waves in the financial technology landscape.\n\nAt its core, Cleva offers an innovative solution to the persistent problem of currency volatility faced by African businesses. With a Cleva USD account, users can seamlessly receive payments in USD from anywhere in the world, spend using a virtual card, pay bills, convert funds to local currency, and even save in USD. This gives users both flexibility and an effective hedge against local currency fluctuations. \n\nThe offerings include:\n- **USD Account**: Open a USD account even as a non-U.S. resident.\n- **Virtual Card**: Ideal for online shopping and international transactions.\n- **Currency Conversion**: Users can instantly convert USD to local currency to access their funds locally.\n\nCleva has a compact but effective team of 13 employees, all dedicated to serving anyone with global financial needs, including startups, freelancers, and contractors. The startup has also made headlines, securing $1.5 million in pre-seed funding to further enhance its service offerings.\n\nWith the backing of well-respected names in the tech industry, Cleva is poised to empower African entrepreneurs and freelancers by simplifying how they manage their finances and receive payments. \n\nIf you’re looking to shield yourself from currency volatility and tap into USD transactions, Cleva might just be the platform you need. To learn more or to create an account, visit their [website](https://www.getcleva.com). \n\n### What Sets Cleva Apart?\nIn a market ripe with opportunities, Cleva not only focuses on eliminating the pains of currency management but also promotes financial security. Users can rest assured as their funds are processed by licensed U.S.-based financial partners. Adding another layer of safety, Cleva implements two-factor authentication and continuous security audits.\n\n**Get Started Today!**\nInterested in a more robust banking solution? Try Cleva. It provides an accessible way for Africans to manage international transactions without the hassle. Join the revolution in banking and enjoy the perks of being part of a connected financial ecosystem.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/82282cdcdf95f1a8b380b3b55364f1d22e9769a3.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191053Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=e280541d1e525209a23cd2ef1df1c07d726e6050f9ec21b50687e8c61346f029",
    "social_links": [
        "https://www.linkedin.com/company/cleva-banking/",
        "https://twitter.com/clevabanking",
        "https://www.facebook.com/profile.php?id=61551351002083"
    ],
    "logo_path": "data/logos\\Cleva_logo.png"
}