{
    "links": "https://www.ycombinator.com/companies/cleverdeck",
    "name": "CleverDeck",
    "headline": "Collaborate with an artist to commission original artwork you'll liveâ\u0080¦",
    "batch": "W12",
    "description": "CleverDeck is a customizable-spaced repetition flashcard application for learning foreign language vocabulary.\n\nIt contains more than three thousand useful words along with images, native speaker audio, and example sentences.",
    "activity_status": "Active",
    "website": "http://cleverdeck.com",
    "founded_date": null,
    "team_size": 1.0,
    "location": "Istanbul, Turkey",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:marketplace",
    "founders": [],
    "status": true,
    "generated_description": "# CleverDeck: Your Language Learning Companion\n\n**Website**: [CleverDeck.com](http://cleverdeck.com)  \n**Location**: Istanbul, Turkey  \n**Founded**: Y Combinator Batch W12  \n\n### Mission\nAt its core, CleverDeck is about collaboration and creativity, aiming to commission original artwork from artists to enrich your learning experience. \n\n### What is CleverDeck?\nOriginally launched as a customizable spaced repetition flashcard app, CleverDeck is designed to help users learn foreign language vocabulary effectively. With a user-friendly interface and robust features, it now hosts over 3,000 common words across various languages, complemented by images, native speaker audio, and contextual example sentences.\n\n### Key Features\n- **Extensive Content**: Access a range of decks for popular languages like Spanish, French, German, Chinese, and more.\n- **Adaptive Learning**: CleverDeck employs the SM-2 algorithm for spaced repetition, meaning you'll focus more on words you struggle with and less on those you have mastered.\n- **Device Syncing**: Your learning progress is automatically synced between devices.\n- **Customization**: Tailor your learning experience by adjusting algorithms, notifications, and scheduling based on your preferences.\n- **Offline Functionality**: Download content for use without an internet connection, ideal for trips.\n- **Competitive Pricing**: Free access to your own content creation, and a premium for $3/month grants access to all premium decks—enough to see if it’s worth your investment.\n\n### Future Plans\nCleverDeck currently has a small team of one—presumably the founder Justin—who openly acknowledges the limitations of resources for developing an Android version. However, there is hope that an Android app will blossom down the line.\n\n### Why Choose CleverDeck?\nBy marrying innovative technology with expert-sourced content, CleverDeck not only streamlines language acquisition but does so in a way that respects the user's time and investment. Their functional design fosters a unique learning environment where creativity and practicality coexist.\n\nWhether you’re a traveler prepping for your next adventure or someone wanting to enhance your language skills, CleverDeck offers a pathway to effective and enjoyable learning. Go on, check it out—you might just find your new favorite tool!",
    "logo": "/logos/medium/missing.png",
    "social_links": [
        "https://www.crunchbase.com/organization/cleverdeck"
    ]
}