{
    "links": "https://www.ycombinator.com/companies/clickpe",
    "name": "ClickPe",
    "headline": "Finance on a Click",
    "batch": "W23",
    "description": "Small shop owners earn daily unlike salaried people but when it comes to loan repayment both are asked to pay monthly. For these shop owners it is difficult to calculate how much to save daily so that they will have the required installment amount at the end of the month and also at the time of repayment they have a big hole in their working capital.\r\n\nTherefore, when you earn daily why not pay daily and get away from the stress of huge one-time installments. \r\n\nEvery day a small amount of $X is deducted from your digital wallet which is on the auto-debit mandate and you don't need to worry about keeping your balance of $XXXX. You never default and also good credit scores are created.",
    "activity_status": "Active",
    "website": "https://clickpe.ai/",
    "founded_date": 2022.0,
    "team_size": 2.0,
    "location": "Surat, India",
    "group_partner": "Dalton Caldwell",
    "group_partner_yc": "https://www.ycombinator.com/people/dalton-caldwell",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:marketplace; industry:b2b",
    "founders": [
        {
            "name": "Shashwat Shrikhande, Founder",
            "description": "I enjoy working on problems related to the lending tech industry and want to help reduce the credit gap in the Indian economy.\n\nI graduated from IIT Kharagpur in 2021 and then worked at ICICI bank & Lenskart.com before starting up DailyPe.\n\nI am an ardent Chelsea football club fan, DM me anytime to discuss football 😁😎",
            "linkedin": "https://www.linkedin.com/in/shashwat-shrikhande"
        },
        {
            "name": "Saurabh Gupta, Founder",
            "description": "Co-Founder of DailyPe. I have 2 years of experience building products in the lending tech domain at FinBox. I have created products such as Device Connect and Bank statement analyzer to evaluate New to Credit customers. During my college, I opened a glass bottle recycling factory.",
            "linkedin": "https://www.linkedin.com/in/saurabh-gupta2104"
        }
    ],
    "status": true,
    "generated_description": "**ClickPe: Revolutionizing Loan Repayments for Small Business Owners**\n\nClickPe is a fintech startup that originated in 2022 and hails from Surat, India. Co-founded by Neofirst Technologies Pvt Ltd, this Y Combinator Batch W23 venture is on a mission to make finance easier and more accessible for small business owners and shopkeepers by introducing a daily loan repayment model.\n\n**The Problem: Traditional Loan Repayment Challenges**\n\nSmall shop owners often earn their income on a daily basis, yet they face the same monthly loan repayment schedule as salaried employees. This creates a disconnect: how do you save up for a big, lump-sum repayment when your income flows in daily? For many, it results in stress and financial strain, especially when working capital is stretched thin.\n\n**The Solution: DailyPe and MonthlyPe**\n\nClickPe’s innovative solution is simple yet effective: why not allow small business owners to pay their loans daily? With ClickPe, a small, manageable amount (let’s call it $X) is automatically deducted from your digital wallet every day. This way, you never have to worry about failing to make a big monthly payment; instead, you build a good credit score without the anxiety of looming deadlines.\n\nClickPe offers two flexible repayment options:\n1. **DailyPe**: Pay installments daily until the loan is fully repaid.\n2. **MonthlyPe**: Still an option for those who prefer traditional monthly payments.\n\n**What Makes ClickPe Stand Out?**\n\n- **Ease of Use**: The application process is streamlined. You can check your eligibility within two minutes, upload necessary documents, and receive your loan directly in your account.\n- **Transparency**: Borrowers can calculate their EMI (Equated Monthly Installments) right on the platform to see how convenient their repayment plan will be. \n- **Support**: They provide round-the-clock customer service, ensuring that help is always available.\n\n**Customer Feedback**\n\nClickPe has received positive feedback, boasting a 4.7-star rating on the Play Store. Users appreciate its user-friendly features and the low interest rates—currently set at a competitive 15%. Testimonials highlight how ClickPe has eased the financial burden for many small vendors, making it easier for them to access the funds they need without the stress of conventional repayment schedules.\n\n**Final Thoughts**\n\nClickPe is changing the landscape of microfinance for small and medium enterprises (SMEs). By tailoring financial solutions to how these businesses operate, ClickPe is not just offering loans; it’s fostering growth and empowerment within the small business community. So whether you’re a small shop owner looking to ease your financial strains or simply curious about innovative fintech solutions, ClickPe might just be the answer you’ve been looking for.\n\nFor more information, check their website [here](https://clickpe.ai/).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/e3ecf18774e5f86dbc973ab61cd667f5d6d22f43.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191053Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=97d2b1723900e5365abf3bf9d1c6d2f9de965c5fb462a9d63458ddc38ba27d6e",
    "social_links": [
        "https://www.linkedin.com/company/dailype",
        "https://twitter.com/Team_DailyPe"
    ],
    "logo_path": "data/logos\\ClickPe_logo.png"
}