{
    "links": "https://www.ycombinator.com/companies/clipboard-health",
    "name": "Clipboard Health",
    "headline": "Connects healthcare facilities with nurses nearby.",
    "batch": "W17",
    "description": "Clipboard Health exists to lift as many people up the socioeconomic ladder as possible. We dramatically improve lives by letting healthcare professionals turn extra time and ambition into career growth and financial opportunity. We achieve this with our app-based marketplace that connects healthcare facilities and healthcare professionals, allowing healthcare professionals to book on-demand shifts and healthcare facilities to access on-demand talent. Our mission is to enable healthcare professionals to work when and where they want and to enable healthcare facilities to meet their talent needs.\r\n\nClipboard Health is a fast-growing Series C startup with classic two-sided network effects. We have product-market fit, generate substantial revenue, and we are helping nurses fix healthcare one shift at a time.\r\n\nClipboard Health is a diverse and inclusive company with a global, remote-first team of hundreds of people. We’ve been featured on YC’s Top Companies and grown our revenue 25x in the last 18 months. We need your help to keep growing so we can serve more healthcare professionals, healthcare facilities, and patients.",
    "activity_status": "Active",
    "website": "https://www.clipboardhealth.com/careers",
    "founded_date": null,
    "team_size": 600.0,
    "location": null,
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:marketplace; industry:consumer-health-services; industry:health-tech; industry:digital-health; industry:healthcare",
    "founders": [
        {
            "name": "Wei Deng, Founder/CEO",
            "description": "I'm a graduate of Yale and Yale Law School. Have done law, finance, product and operations, and am currently running a company that matches healthcare facilities with available nurses nearby.",
            "linkedin": "https://www.linkedin.com/in/dengwei"
        }
    ],
    "status": true,
    "generated_description": "**Clipboard Health: A Direct Connection Between Nurses and Healthcare Facilities**\n\n**Mission and Vision**\nClipboard Health is a dynamic company with a clear mission: to connect healthcare facilities with nearby nurses. The core philosophy behind this is simple yet profound: lift people up the socioeconomic ladder by providing healthcare professionals with the tools they need to turn their extra time and ambition into tangible career growth and financial opportunities.\n\nFounded in 2017 and proudly part of Y Combinator's W17 batch, Clipboard Health has made significant strides in the healthcare labor marketplace. Its app-driven marketplace allows healthcare professionals to book on-demand shifts while healthcare facilities gain access to a pool of talent that meets their immediate needs.\n\n**Business Model and Growth**\nThis model operates on classic two-sided network effects, where both nurses and facilities benefit from increased participation. The company has achieved impressive metrics—growing its revenue by 25 times in just 18 months and boasting over 4 million shifts filled since inception. Clipboard Health’s simplicity and utility have solidified its product-market fit, already generating substantial revenue and serving to tackle critical staffing shortages across the healthcare industry.\n\nAs a Series C startup valued at $1.3 billion, Clipboard Health is backed by highly regarded investors, including Sequoia Capital and IVP. This financial foundation provides the necessary resources to scale and innovate.\n\n**Culture and Work Environment**\nThe culture at Clipboard Health is defined by values like ownership, curiosity, and an uncomfortably high standard of performance. The company prides itself on not just solving problems but doing so with speed and effectiveness. Employees enjoy the flexibility of a remote-first work environment with competitive benefits including unlimited paid time off, competitive family leave options, and a commitment to personal and professional growth.\n\nThe company, which has expanded to a diverse team of over 600 employees across more than 40 countries, emphasizes collaboration and mutual support within its ranks. Employee testimonials highlight a nurturing atmosphere where creativity is encouraged, and professional aspirations are supported.\n\n**Innovative Features**\nClipboard Health's success is also linked to its innovative features, such as:\n\n- **InstantPay**: A service allowing healthcare professionals to receive immediate payment after completing their shifts, addressing cash flow needs in real-time.\n- **License Manager**: A streamlined process for nurses to upload and verify multiple professional licenses, making it easier for them to pick up shifts that match their qualifications.\n- **Urgent Shifts**: A response mechanism for last-minute staffing needs that incentivizes healthcare professionals to fill shifts that require immediate attention.\n\n**Looking Forward**\nClipboard Health is not just a marketplace; it's a movement toward reshaping the future of work in the healthcare sector. They aim to expand into new verticals beyond long-term care—venturing into hospitals, dental practices, and pharmacies—adapting to the evolving needs of the healthcare landscape. \n\nBy continuously innovating and listening to its users, Clipboard Health is positioned to not only facilitate shift filling but to transform the entire staffing workforce dynamic in healthcare.\n\nIn summary, Clipboard Health embodies the intersection of technology and human need, seeking to enhance lives through opportunity, connection, and empowerment. **[Join their team](https://www.clipboardhealth.com/careers) and be part of the change!**",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/99c869bcf4c12e958eeff9ee88f48aca5ed6a1a1.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191054Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=1729cf10518d6d25705c1231b7b0ed82a3769aebc054f23a9c8621ef15e9dd55",
    "social_links": [
        "https://www.linkedin.com/company/clipboard-health/",
        "https://x.com/clipboardhealth",
        "https://www.facebook.com/ClipboardHealth/",
        "https://www.crunchbase.com/organization/clipboard-health",
        "https://github.com/ClipboardHealth"
    ],
    "logo_path": "data/logos\\Clipboard_Health_logo.png"
}