{
    "links": "https://www.ycombinator.com/companies/clueso",
    "name": "Clueso",
    "headline": "Create beautiful videos & docs for any product or process in minutes",
    "batch": "W23",
    "description": "Clueso is the fastest and easiest way for companies to generate high-quality instructional videos and documentation, ideal for customer education/onboarding and employee training. Our AI transforms simple screen-recordings into studio-quality videos and step-by-step documentation in minutes.",
    "activity_status": "Active",
    "website": "https://clueso.io",
    "founded_date": 2023.0,
    "team_size": 3.0,
    "location": "Bengaluru, India",
    "group_partner": "Brad Flora",
    "group_partner_yc": "https://www.ycombinator.com/people/brad-flora",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:generative-ai; industry:saas; industry:b2b; industry:customer-success; industry:enterprise",
    "founders": [
        {
            "name": "Akash Anand, Founder",
            "description": "Hey! I'm Akash, CEO at Clueso. Before Clueso, I built and scaled a consumer note-taking app to 12k+ users while in college. I studied Engineering Design and Data Science at IIT Madras. In my free time, I'm a force to be reckoned with on the tennis court.",
            "linkedin": "https://www.linkedin.com/in/theakashanand/"
        },
        {
            "name": "Neel Balar, Founder",
            "description": "I'm Neel, CBO at Clueso. Prior to Clueso, I built and scaled a consumer note-taking app to 20K+ users while in college. I studied Engineering Design and Data Science at IIT Madras. I previously led Asia's most advanced student Hyperloop team, where we raised $1.1M from the Indian govt. I also represented India at the SpaceX Hyperloop Pod Competition organized by Elon Musk.",
            "linkedin": "https://www.linkedin.com/in/neelbalar7/"
        },
        {
            "name": "Prajwal Prakash, Founder",
            "description": "I'm Prajwal, co-founder at CTO at Clueso. I'm a Bangalorean and a recent (2022) CS grad from IIT Madras where I graduated top of my batch. I've always loved building products (previously made Desklamp, a consumer notetaking app) and working with nascent technologies (interned at Adobe AI, co-founded a quantum machine learning group in college). When I'm not thinking about tech, I write stand up sets.",
            "linkedin": "https://www.linkedin.com/in/prajwalprakash2000/"
        }
    ],
    "status": true,
    "generated_description": "**Clueso: The AI-Powered Video Creation Solution**\n\nFounded in 2023 and based in Bengaluru, India, Clueso is reshaping how companies create instructional videos and documentation. The startup, which is part of Y Combinator's W23 batch, set out with a clear mission: to enable teams to produce beautiful videos and docs in mere minutes—without the need for professional videography skills.\n\n### What Does Clueso Do?\n\nClueso's platform leverages AI to transform basic screen recordings into studio-quality videos and detailed documentation. This automation is perfect for both customer education and internal training, making onboarding processes more efficient and engaging.\n\n**Key Features:**\n- **Studio-Quality Videos:** Generate polished videos for any product in record time.\n- **Step-by-Step Documentation:** Create detailed help articles with easy-to-follow screenshots.\n- **AI Voiceovers:** Replace your voice with professional AI-generated voices in a variety of accents.\n- **One-Click Translation:** Localize your content effortlessly, supporting over 37 languages.\n- **Smart Zoom Effects and Visual Effects:** Enhance your videos with automatic features that draw attention to key points.\n\n### Why Clueso?\n\nAmidst a crowded landscape of solutions, Clueso stands out because it simplifies high-quality video production. Users report drastic cuts in their video creation time—from hours to mere minutes. The emphasis here is on producing content that not only looks good but also provides real value.\n\n### The Team and Support\n\nClueso comprises a small but dynamic team of three employees, each committed to enhancing the user experience. Backed by Y Combinator and mentored by Brad Flora, the team is responsive and continuously incorporates user feedback to scale their offering.\n\n### User-Centric Design\n\nClueso's platform is designed for ease of use. Even if you’re not tech-savvy, you can create engaging content with minimal effort. This is evidenced by user testimonials stating that previously cumbersome tasks have turned into quick and enjoyable experiences.\n\n### The Market\n\nClueso primarily targets B2B sectors that require effective customer success tools, employee onboarding, and product education. By focusing on generative AI, they tap into a rapidly growing market eager for innovative solutions.\n\n### Get Started\n\nIf you're tired of the traditional, cumbersome methods for creating instructional content, Clueso offers a refreshing alternative that promises not just speed and efficiency, but also quality. \n\nExplore further at [Clueso.io](https://clueso.io) and see how easy it can be to transform your video creation process.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/2fe9037a9175424367e9d06447c81e94e568c372.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191054Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=db03121be9bf71ff2487fa41a5102f9538b1136f4302a286b79570ae275f5d65",
    "social_links": [
        "https://www.linkedin.com/company/clueso",
        "https://twitter.com/_Clueso"
    ],
    "logo_path": "data/logos\\Clueso_logo.png"
}