{
    "links": "https://www.ycombinator.com/companies/coblocks",
    "name": "Coblocks",
    "headline": "Build data pipelines in minutes with AI",
    "batch": "F24",
    "description": "Coblocks is a thoughtfully-designed data platform that helps teams write queries and automate workflows faster. \r\n\nWe understand the columns, tables, and relationships in your data and use them to help anyone on your team build pipelines with AI, SQL and Python. Think of us like Zapier plus Cursor for data engineering.\r\n\nHere’s how we’re different:\r\n\n• All-in-one: You can get started in 2 minutes – no setup or configuration required. We have one-click integrations, warehousing, transformation, and schedules all built in.\r\n• Seamless integrations: Plug in your Postgres database, Stripe transactions, Hubspot leads, or any other data source, without writing code to keep things in sync.\r\n• Thoughtful AI: We love Cursor and we love data – we combined the two to help you write accurate queries. We use existing metadata to help you create new datasets, connect sources, fix errors, or edit in place.\r\n• Collaborative: Easily share data and discover what others in your org have built as a starting place for your analysis. Wrap common blocks of logic with templates so your team never has to start from zero.\r\n• Resilient and Scalable: Our compute engine is lightning-fast for queries and builds. Git and branching are built-in for both code and data, so you can time-travel backwards when things break. You can start with GBs and grow to TBs.",
    "activity_status": "Active",
    "website": "https://coblocks.ai",
    "founded_date": 2024.0,
    "team_size": 2.0,
    "location": "New York",
    "group_partner": "Dalton Caldwell",
    "group_partner_yc": "https://www.ycombinator.com/people/dalton-caldwell",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:artificial-intelligence; industry:analytics; industry:data-science; industry:big-data; industry:data-engineering; location:new-york",
    "founders": [
        {
            "name": "Kevin Schaich, CEO & Co-Founder",
            "description": "I've spent the last decade helping people make sense out of their data.\n\nI've worked with Fortune 100 companies at Palantir to build their data engineering, modeling, and analytics capabilities. I've also helped several startups spin up data infrastructure and machine learning models from zero to one as a founding data engineer.\n\nI'm pouring everything I've learned into Coblocks.",
            "linkedin": "https://www.linkedin.com/in/kevinschaich/"
        },
        {
            "name": "Nisola Shobayo, CTO & Co-Founder",
            "description": "CTO @ Coblocks\n\nNisola previously built investing, payment and developer platforms at Cash App and Square. He helped rebuild Square's card storage infrastructure from the ground up and led engineering teams that built some of the fastest growing 0 to1 products ever at Cash App -- P2P Stocks & Teen Investing.\n\nNisola is now taking his experience scaling platforms to build the easiest way to work data @ Coblocks.",
            "linkedin": "https://www.linkedin.com/in/nisola-shobayo-581552111/"
        }
    ],
    "status": true,
    "generated_description": "Coblocks, founded in 2024 and hailing from New York as part of Y Combinator's Batch F24, is an innovative data platform designed to simplify the way teams build data pipelines. Their mission is straightforward: to empower users to construct data pipelines in minutes, leveraging AI technologies.\n\nAt its core, Coblocks merges the functionality of data engineering tools like SQL and Python with AI assistance, offering an intuitive platform that lets users understand and manipulate their data effortlessly. Imagine Zapier, but tailored for data—this is Coblocks.\n\n### What Makes Coblocks Stand Out:\n\n1. **All-in-One Solution**: You can dive in without any complicated setup. In just two minutes, you have access to one-click integrations, built-in warehousing, transformations, and automated scheduling.\n\n2. **Integration Made Easy**: Whether it’s syncing your Postgres database, Stripe transactions, or HubSpot leads, Coblocks allows you to integrate various data sources without writing a single line of code.\n\n3. **AI-Powered Assistance**: The platform employs clever AI features that help users draft accurate queries and fix errors using existing metadata. It's about facilitating data interaction rather than complicating it.\n\n4. **Collaboration Friendly**: Coblocks encourages sharing and collective problem-solving within teams. Users can share their work and utilize templates to avoid reinventing the wheel.\n\n5. **Resilience and Scalability**: With a powerful compute engine capable of handling massive data, Coblocks ensures your queries run quickly. Plus, it features Git-like branching for your data, allowing users to easily revert to previous versions if needed.\n\n### Current Operations:\n\nCoblocks aims to provide user-friendly tools that promote efficient data management and transformation. They focus on creating reusable workflows, monitoring data in real-time, collaborating in teams, and integrating seamlessly with popular apps like Stripe and HubSpot.\n\n### Why It Matters:\nIn a world where data is king, Coblocks opens up data engineering to a broader audience, making it more accessible and efficient. With only two employees at present, the company is small but mighty, backed by prominent investors like Dalton Caldwell.\n\nIf you work with data and crave a straightforward, powerful tool to build and manage your pipelines, Coblocks is worth a look. You can start for free and see how it can transform your data workflow. Check them out at [coblocks.ai](https://coblocks.ai) to join the waitlist or book a demo!",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/e19ce937647736fc09e377949581efad43e9f2af.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191055Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=7193663c936fee69943686aecfed9b98c8716c0b04713814772713d20e1a82dc",
    "social_links": [
        "https://www.linkedin.com/company/coblocks",
        "https://github.com/coblocks"
    ],
    "logo_path": "data/logos\\Coblocks_logo.png"
}