{
    "links": "https://www.ycombinator.com/companies/cocrafter",
    "name": "CoCrafter",
    "headline": "B2B construction marketplace to match contractors and subcontractors.",
    "batch": "W24",
    "description": "CoCrafter is a construction marketplace to match contractors and subcontractors. Already used by over 3000 companies in the strong German SMB sector, CoCrafter helps contractors to find and manage local as well as foreign subcontractors.",
    "activity_status": "Active",
    "website": "https://cocrafter.com/",
    "founded_date": 2023.0,
    "team_size": 9.0,
    "location": "Munich, Germany",
    "group_partner": "Nicolas Dessaigne",
    "group_partner_yc": "https://www.ycombinator.com/people/nicolas-dessaigne",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:marketplace; industry:construction",
    "founders": [
        {
            "name": "Johannes Lutz, Founder",
            "description": "Revolutionizing European construction. Previously built Innovis VC, Europe's largest VC student association. Passionate about tennis & piano.",
            "linkedin": "https://linkedin.com/in/johanneslutz"
        },
        {
            "name": "Philipp Rollwage, Founder",
            "description": "Building CoCrafter to empower the long-tail construction industry in Europe. Previously built Innovis VC, Europe's largest student VC initiative. In Love with easy-to-use software products. Hobby barista and ambitious triathlete.",
            "linkedin": "https://linkedin.com/in/philipp-rollwage"
        },
        {
            "name": "Annabell V., Founder",
            "description": "Building CoCrafter - a construction marketplace matching contractors with subcontractors across Europe. Passionate about building products that create value & users love.",
            "linkedin": "https://www.linkedin.com/in/annabell-v-86a73b227"
        }
    ],
    "status": true,
    "generated_description": "CoCrafter is a promising startup that aims to shake up the construction industry by connecting contractors and subcontractors in a streamlined, B2B marketplace. Founded in 2023 and currently a part of Y Combinator's Batch W24, CoCrafter is already making waves, being utilized by over 3,000 companies primarily in Germany's robust SMB sector. Based in Munich, this nimble team of 9, led with strategic vision by Group Partner Nicolas Dessaigne, is on a mission to alleviate the complexities of subcontractor management.\n\nThe problem CoCrafter addresses is a familiar one in the construction world: finding and managing subcontractors efficiently. Their platform simplifies this process, allowing general contractors to discover local and international subcontractors while ensuring that all necessary compliance measures are fulfilled. CoCrafter distinguishes itself by focusing solely on verified tradespeople, thereby fostering a professional environment free from the noise of private bidding wars.\n\nThe platform boasts a solid reputation, as evidenced by the trust of major players in the industry, including notable names like Lindner Group and Elomech Elektroanlagen. Their approach is straightforward: contractors can share project details directly, enabling subcontractors to assess their interest promptly and make connections with minimal hassle.\n\nCoCrafter's marketplace supports various sectors within construction, notably in fields like electrical, drywall, infrastructure, and HVAC. The ease of registration—designed to take less than two minutes—encourages collaboration and reduces administrative burdens, making it an attractive option for many businesses.\n\nIf you want to check out their innovative marketplace, you can find more information on their [website](https://cocrafter.com/). As construction evolves, CoCrafter appears poised to play a pivotal role in how projects get done—effortlessly linking the right people to the right jobs with a focus on efficiency and professionalism.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/e33f220e0dae6ba0f8f1be8513420f29817911e2.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191056Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=d9daa58e0595bb100274e96889bcee626779257f348077eb33301f7cf40d54a9",
    "social_links": [
        "https://www.linkedin.com/company/cocrafter/",
        "https://www.crunchbase.com/organization/cocrafter"
    ],
    "logo_path": "data/logos\\CoCrafter_logo.png"
}