{
    "links": "https://www.ycombinator.com/companies/codecombat",
    "name": "CodeCombat",
    "headline": "Game that teaches computer science to middle and high school kids.",
    "batch": "W14",
    "description": "CodeCombat is a multiplayer programming game for learning how to code. With thousands of schools and millions of students, we are bringing K12 computer science education to everyone, regardless of gender, race, or background. Everyone should have the opportunity to learn.\r\n\nThe ultimate goal of CodeCombat is to bring more users into the field of computer programming by making the logic and syntax more accessible and enjoyable to learn. The end game is to educate a whole new generation of computer programmers that started their journey by slaying ogres and defending their castles from oncoming enemy hordes.\r\n\nWe teach Python, JavaScript, and other languages directly in the browser. Teachers with no computer science background can get started in five minutes. In a world where all programmers have had to be second-language learners, do you want your students to become native speakers of code? Let's chat about bringing CodeCombat to your school!\r\n\nFind us on Twitter at https://twitter.com/CodeCombat",
    "activity_status": "Active",
    "website": "https://codecombat.com",
    "founded_date": 2013.0,
    "team_size": 45.0,
    "location": "San Francisco",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:education; industry:elearning; industry:gaming; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Nick Winter, Founder/CEO",
            "description": "Current: CodeCombat (YC W14), a multiplayer programming game for learning to code.\n\nPreviously: founded Skritter, the power user's app for learning to write Chinese/Japanese characters.\n\nAlso: wrote The Motivation Hacker, a guide to getting yourself to want to do what you've always wanted to want to do.\n\nI'm in the Seattle area and have three kids (2015, 2017, and 2021).\n\nSee more: https://www.nickwinter.net/",
            "linkedin": "http://linkedin.com/in/nwinter"
        }
    ],
    "status": true,
    "generated_description": "### CodeCombat: Empowering Future Coders Through Play\n\n**Mission & Background**  \nFounded in 2013 and based in San Francisco, CodeCombat believes in making computer science education accessible to all, especially middle and high school students. The mission is clear: to teach coding through engaging gaming experiences, effectively opening the doors to the world of programming for diverse students across the globe. CodeCombat started as a multiplayer game where players learn to code while battling ogres and defending kingdoms—pretty epic, right?\n\n**Educational Philosophy**  \nTheir approach centers around making the fundamentals of programming not just understandable, but enjoyable. With a focus on creating a new generation of “native speakers” in the language of code, CodeCombat serves over 20 million students from various backgrounds. They’re committed to inclusivity, ensuring everyone has the opportunity to dive into the world of coding, regardless of gender, race, or socioeconomic status.\n\n**Curriculum & Tools**  \nCodeCombat offers a robust curriculum that teaches widely-used programming languages like Python, JavaScript, and even C++. Their platform enables teachers—who may not have a background in computer science themselves—to start teaching in just five minutes. You can think of CodeCombat as a playground for coders, where students can level up their skills through interactive challenges and projects that feel more like games than lessons.\n\n### Current Offerings\n- **CodeCombat Classroom**: A comprehensive curriculum from core coding concepts to advanced topics like web and game development.\n- **CodeCombat Junior**: Tailored for younger learners (K-5), focusing on foundational coding skills.\n- **AI League Esports**: This platform fosters competitive programming in a game-based environment.\n- **Ozaria**: A narrative-driven adventure that reinforces computer science principles.\n- **AI HackStack & AI Junior**: Tools designed to introduce students to generative AI in a way that prioritizes safety and learning.\n\n### Key Statistics & Impact\n- Over **1 billion lines of code** written by students.\n- Support for **320,000 teachers** and **75,000 schools** in **190+ countries**.\n- Focus on **student empowerment** through project-based assessments and live online classes that blend gameplay with structured learning.\n\n### Community & Support\nCodeCombat isn't just about coding; they also offer resources for educators, from professional development to grants and funding resources. They run campaigns like \"Hour of Code,\" helping educators integrate coding into their classrooms effectively.\n\n### Get Involved\nInterested in bringing CodeCombat to your school? They welcome conversations about integrating their solutions into your curriculum.\n\n**Connect**: Follow them on [Twitter](https://twitter.com/CodeCombat) and visit their [website](https://codecombat.com) for more details on how CodeCombat can transform coding education in your community.\n\nSo, if you're looking to make coding skills not only accessible but also thrilling for the new generation, CodeCombat is a solid bet. They’re making coding feel like a quest, and who wouldn't want to embark on that journey?",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/2487f351c7c40e79254e6354d00b21541fffd91f.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191057Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=38bbd23c4cdc2e61aec02615bfffeab3d780f3af90c0297532d744167dfd761c",
    "social_links": [
        "https://www.linkedin.com/company/codecombat",
        "https://twitter.com/codecombat",
        "https://www.facebook.com/codecombat",
        "https://www.crunchbase.com/organization/codecombat",
        "https://github.com/codecombat"
    ],
    "logo_path": "data/logos\\CodeCombat_logo.png"
}