{
    "links": "https://www.ycombinator.com/companies/codehs",
    "name": "CodeHS",
    "headline": "CodeHS is a comprehensive platform helping schools teach computerâ\u0080¦",
    "batch": "IK12",
    "description": "CodeHS is a comprehensive teaching platform for helping schools teach computer science. We provide web-based curriculum, teacher tools and resources, and professional development.",
    "activity_status": "Active",
    "website": "https://codehs.com",
    "founded_date": 2012.0,
    "team_size": 83.0,
    "location": "Chicago, IL",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:education",
    "founders": [
        {
            "name": "Zach Galant, Co-Founder & CTO",
            "description": "YC Badge: 0xdcd8a1cde90617d109200e6928fb8e1ba59ae92a",
            "linkedin": "https://www.linkedin.com/in/zgalant/"
        },
        {
            "name": "Jeremy Keeshin, Founder/CEO",
            "description": "Jeremy Keeshin is the CEO and co-founder of CodeHS, a comprehensive online platform to teach computer science to high schools and middle schools. He is a leading expert in computer science education and education technology.",
            "linkedin": "https://www.linkedin.com/in/jkeesh/"
        }
    ],
    "status": true,
    "generated_description": "**Company Overview: CodeHS**\n\nFounded in 2012 and based in Chicago, IL, CodeHS is a dynamic educational platform designed to empower schools in teaching computer science. As part of Y Combinator's Batch IK12, the company has made significant strides in the educational landscape, striving to make coding and computer science accessible to all students.\n\n### Mission\nCodeHS aims to provide a comprehensive solution for schools to teach computer science effectively. They focus on delivering web-based curricula, teacher tools, and professional development resources, ensuring educators and students have what they need to succeed.\n\n### The Team\nWith a dedicated workforce of 83 employees, CodeHS is committed to advancing computer science education. Their partnerships and collaborations are instrumental in expanding their reach and improving their offerings.\n\n### Product Offering\nCodeHS features an array of products tailored for districts, schools, and teachers:\n- **Coding LMS**: A Learning Management System for managing rosters, assignments, and student data seamlessly.\n- **Online IDE**: A powerful integrated development environment where students can write, run, and debug code across multiple languages without the hassle of downloads.\n- **Curriculum**: A customizable K-12 curriculum that includes over 100 courses and hands-on lessons, ranging from introductory coding to advanced computer science topics.\n- **Certifications**: These help high school students gain industry-relevant skills, giving them a competitive edge.\n- **CodeHS Pro**: This package provides schools with all necessary tools, resources, and support for a successful computer science program.\n- **Professional Development**: CodeHS offers both online and in-person training for teachers, empowering them with the knowledge to effectively teach computer science.\n\n### Use Cases\nCodeHS is designed with various educational stakeholders in mind:\n- **Districts** benefit from streamlined processes and comprehensive curriculum resources.\n- **Schools** find it easier to implement and manage computer science programs that engage students.\n- **Teachers** gain access to resources, training, and communities that support successful teaching methodologies.\n\n### Why CodeHS?\nCodeHS has garnered attention and trust from teachers and educators worldwide, boasting testimonials that highlight its effectiveness in reducing administrative burdens and enhancing student learning experiences. \n\nIn an increasingly digital world, CodeHS strives to create pathways for every student to learn coding and computer science, ensuring they are prepared for future opportunities. Interested parties can explore more about CodeHS at [codehs.com](https://codehs.com).\n\n---\n\nThis summary encapsulates CodeHS's core mission, offerings, and impact, emphasizing its role in educating the next generation in computer science.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/af315b03616914c4c4380b7136ce47710dfbf64c.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191057Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=18c42c39eb637b57e71c8ab7232d596eff76c8a0413b2a7ae26a74b4a6d30638",
    "social_links": [
        "https://www.linkedin.com/company/codehs/?viewAsMember=true",
        "https://twitter.com/codehs",
        "https://www.facebook.com/codehs/",
        "https://www.crunchbase.com/organization/codehs"
    ],
    "logo_path": "data/logos\\CodeHS_logo.png"
}