{
    "links": "https://www.ycombinator.com/companies/codingal",
    "name": "Codingal",
    "headline": "Leading online after-school where kids & teens learn coding",
    "batch": "W21",
    "description": "Codingal (www.codingal.com) is a leading online after-school where kids & teens learn coding from expert instructors through live, interactive classes. Our mission is to build the world’s largest & most loved programming school for kids & teens, powered by human & AI tutors.\r\n\nMany countries have great technical universities but literally zero programming education at the K-12 level. Parents want their kids to get started with programming earlier, and that's why they use Codingal.\r\n\nAll our instructors come from Computer Science background, and they are rigorously vetted and trained. Every student gets a personalized learning path and individual attention in 1:1 private classes or small group classes with expert instructors. Students learn by building apps, games, animations, and websites in a fun & engaging way.\r\n\nKids find it so fun & engaging that NPS is just outstanding - 86. They have rated teachers at 4.9 out of 5. Curriculum content is rated at 4.8 out of 5.\r\n\nCodingal is on a mission to inspire kids to fall in love with coding, and provide the right education to them who will be able to create anything they can imagine and build the future when they grow up to become entrepreneurs, engineers, and scientists.",
    "activity_status": "Active",
    "website": "https://www.codingal.com",
    "founded_date": 2020.0,
    "team_size": 70.0,
    "location": "Bengaluru, India",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:education; industry:elearning",
    "founders": [
        {
            "name": "Vivek Prakash, Founder",
            "description": "Vivek completed his B.Tech. and M.Tech. in Computer Science from IIT Roorkee (India) in 2013. After that, he co-founded HackerEarth - India’s largest platform for 5M+ Computer Science students in universities to become a better programmer via competitions and hackathons, with $6M+ in annual revenue. He is a hacker at heart. 8 years later, he co-founded Codingal to continue on the mission and journey to inspire school kids to fall in love with coding.",
            "linkedin": "https://www.linkedin.com/in/prakashvivek/"
        },
        {
            "name": "Satyam Baranwal, Founder",
            "description": "Satyam has a professional exp. of over 11 yrs. He is an IIT, Dhanbad alumnus, and has helped to start one of the largest private-sector coal mines of India belonging to Reliance Power.\n\nHe has been teaching school kids since his school days and even during college days he focused on providing quality education as well as computer literacy programs to school kids via various NGOs.\n\nHe is in Edtech since last 5 years and successfully built a coding company for kids called Skillovate Learning",
            "linkedin": "https://www.linkedin.com/in/satyam-baranwal/"
        }
    ],
    "status": true,
    "generated_description": "**Codingal - Where Coding Meets Imagination for Kids and Teens**\n\nFounded in 2020 and based in Bengaluru, India, Codingal is on a mission to pave the way for the next generation of innovators by offering the largest and most engaging online programming school for kids and teens. Unlike many countries where formal programming education is scarce in K-12, Codingal is filling that gap with live, interactive classes led by expert instructors with a strong computer science background.\n\n**Tailored Learning Experience**\nWith a personalized approach, Codingal ensures that every student receives individual attention through 1:1 private lessons or small group classes. The curriculum emphasizes hands-on learning and consists of fun projects like building apps, games, animations, and websites, keeping students engaged and excited. With an impressive Net Promoter Score (NPS) of 86 and a teacher rating of 4.9 out of 5, it’s clear that students not only enjoy but thrive in Codingal’s nurturing environment.\n\n**Courses Offered**\nCodingal provides a diverse range of courses tailored for different age groups, from 5 to 17 years old. Some of the highlighted courses include:\n- AI and Machine Learning\n- Scratch Programming\n- Python for Kids\n- Game Development\n- Web Development\n- Data Science\n- App Development\n- And more specialized courses like AP Computer Science and IOI Algorithms.\n\nIn addition to regular courses, Codingal organizes seasonal coding camps and competitions, fostering a vibrant coding community among students from over 70 countries.\n\n**Empowering Future Leaders**\nThe vision of Codingal is not just to teach programming, but to inspire students to harness their creativity and problem-solving skills to build a better future as tomorrow's entrepreneurs and leaders in STEM fields. \n\nTheir commitment to quality education is evident from their rigorous vetting and training of instructors, many of whom come from prestigious institutions and industry backgrounds including Google and Amazon. Parents can also enjoy peace of mind with their 100% money-back guarantee—a testament to their confidence in the value provided.\n\n**Join the Movement**\nWith over 500,000 students already enrolled, Codingal truly embodies the belief that learning to code is not just an educational opportunity; it’s a superpower that can open doors in the ever-evolving tech landscape. Ready to inspire your child’s coding journey? You can explore a free lesson at [Codingal](https://www.codingal.com). \n\nCoding, after all, is where the magic happens—a philosophy expertly captured in Codingal's name itself. If you're a parent looking to equip your child with vital future skills, look no further.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/0fac8810f9836778820bc905328caaee9bf94e14.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191057Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=2a0d91471cfd497a0d1293d86fdd5b2283cb5f365f0606fe9d43261522f50e7b",
    "social_links": [
        "https://www.linkedin.com/company/codingal",
        "https://twitter.com/codingal",
        "https://www.facebook.com/codingal.education",
        "https://www.crunchbase.com/organization/codingal",
        "https://github.com/Codingal"
    ],
    "logo_path": "data/logos\\Codingal_logo.png"
}