{
    "links": "https://www.ycombinator.com/companies/cofactor-genomics",
    "name": "Cofactor Genomics",
    "headline": "Cofactor closes the precision medicine gap with predictive diagnostics",
    "batch": "S15",
    "description": "Cofactor uses RNA and Predictive Immune Modeling to build better biomarkers and improve patient outcomes.\r\n\nLed by Jarret Glasscock and a group of expert human genome scientists,Cofactor has built a new category of diagnostic technology powered by unique and powerful RNA data models built on terabytes of data. \r\n\nThe team recently had their technology validation peer-reviewed by the organizations that set standards for diagnostic technology (CAP, AMP) and is publishing in the Journal of Molecular Diagnostics. In addition, the team made news when Cancer Physicians who sit on the committee for patient treatment guidelines (NCCN) presented a clinical study using Cofactor’s technology showing superiority in predicting the patients who will respond to immunotherapy. This initial application is an acute problem recognized widely in the rapidly developing immunotherapy industry and represents north of a billion dollar TAM. \r\n\nAfter a number of recent key milestones, the team is taking the technology more broadly to 50% of cancers diagnosed in the US. \r\n\nCurrent investors include Menlo Ventures, DCVC, and Ascension Ventures (this last investor representing the funding arm for 13 National U.S. Healthcare Systems).",
    "activity_status": "Active",
    "website": "http://cofactorgenomics.com",
    "founded_date": 2015.0,
    "team_size": 13.0,
    "location": "St. Louis, MO",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:medical-devices; industry:biotech; industry:diagnostics",
    "founders": [
        {
            "name": "Dave Messina, Founder/COO",
            "description": "Dave Messina has spent the last 20 years in computational biology and human genetics. He contributed to the Human Genome Project at Washington University in Saint Louis, mapped disease genes at the University of Chicago, and co-developed the first comprehensive atlas of human transcription factor genes. As COO of Cofactor Genomics, Dave leads regulatory and reimbursement efforts for the company, driving the implementation of RNA-based diagnostics and their clinical application.",
            "linkedin": "http://linkedin.com/in/davemessina"
        },
        {
            "name": "Jarret Glasscock, Founder/CTO",
            "description": null,
            "linkedin": "https://www.linkedin.com/in/jarretglasscock"
        }
    ],
    "status": true,
    "generated_description": "**Cofactor Genomics: Bridging the Precision Medicine Gap**\n\nFounded in 2015 and based in St. Louis, MO, Cofactor Genomics is on a mission to revolutionize precision medicine with its innovative approach to predictive diagnostics. The company focuses on using RNA data and Predictive Immune Modeling to develop superior biomarkers, thus improving patient outcomes, particularly in the sphere of cancer treatments.\n\nLed by CEO Jarret Glasscock and a talented team of genome scientists, Cofactor has carved out a unique niche in diagnostic technology. Their platform is powered by extensive RNA data models built from terabytes of information, a feat that places them at the frontier of modern biomedical research. Notably, their technology has recently been validated by prominent industry bodies like CAP and AMP, and they are slated for publication in the Journal of Molecular Diagnostics. Such validations not only underscore the effectiveness of their models but also their adherence to the highest standards in diagnostic development.\n\nOne of the standout achievements of Cofactor's technology is its application in immunotherapy. During a clinical study presented by members of the NCCN—who shape patient treatment guidelines—Cofactor's assessments demonstrated a marked proficiency in predicting how patients will respond to immunotherapeutics. Given the escalating demand for effective immunotherapy solutions, this could tap into a market worth over $1 billion.\n\nCofactor isn't just about innovations in the lab; they’re taking their insights to a broader spectrum, targeting 50% of cancer diagnoses in the U.S. This is no small ambition and showcases their commitment to affecting real change in oncology.\n\nThe company's successes have attracted investment from renowned firms such as Menlo Ventures, DCVC, and Ascension Ventures, with the latter representing the funding arms for 13 National U.S. Healthcare Systems.\n\nTheir ongoing projects, including the **PREDAPT Trial**, aim to leverage their OncoPrism assay to assess immunotherapy responses for 11 different solid tumors. With partnerships across more than 24 healthcare systems, Cofactor is vital in generating data that pushes the boundaries of what's achievable in personalized cancer care.\n\nWith a core team of 13 creative minds, Cofactor Genomics is pushing forward the envelope of what precision diagnostics can do. As they venture into new partnerships and expand their technology reach—tapping into various cancer types—they could very well redefine how we understand treatment responses in the evolving world of oncology.\n\nFor more information about their technology and to keep up with their latest developments, visit [Cofactor Genomics](http://cofactorgenomics.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/648c452d743bf9b90773f96bdad25799be5fce95.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191057Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=16b4659f0bbb9643b37568b6e6ed75a913f7361083694fe7b7fa2f4474efc7e2",
    "social_links": [
        "https://www.linkedin.com/company/cofactorgenomics/",
        "https://twitter.com/cofactorgenomic",
        "https://www.crunchbase.com/organization/cofactor-genomics"
    ],
    "logo_path": "data/logos\\Cofactor_Genomics_logo.png"
}