{
    "links": "https://www.ycombinator.com/companies/coinrule",
    "name": "Coinrule",
    "headline": "Coinrule Automates Your Crypto and Stock Investments",
    "batch": "S21",
    "description": "Coinrule Catches the Next Market Opportunity on Your Behalf by Automating Your Investments.\r\n\nCoinrule's previous Crowdfunding Video: https://www.youtube.com/watch?v=nnYJ4PnSvnU",
    "activity_status": "Active",
    "website": "https://coinrule.com/",
    "founded_date": 2018.0,
    "team_size": 17.0,
    "location": "London, United Kingdom",
    "group_partner": "Harj Taggar",
    "group_partner_yc": "https://www.ycombinator.com/people/harj-taggar",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:crypto-web3",
    "founders": [
        {
            "name": "Gabriele Musella, CEO, Founder",
            "description": "Design-Driven Entrepreneur. Prior to Coinrule, I worked at UBS Bank, Nokia, NHS, Vodafone, British Government, WPP, Lloyds Bank, etc. I hold a BS/MS from the Polytechnic of Milan, was a Visiting Scholar at MIT, and took part in business programs at LSE and Harvard University. \n\nCurrently, I am a Mentor at the Google Accelerator, Angel Investor and since 2018 the CEO & Co-founder of Coinrule.",
            "linkedin": "http://www.linkedin.com/in/gabrielemusella"
        },
        {
            "name": "Oleg Giberstein, Founder",
            "description": "I am Cofounder & COO of Coinrule, a platform that helps retail investors catch market opportunities through automated trading. I have previously worked in Banking and Risk roles at Citigroup and helped develop a Startup Ecosystem in Palestine for the Portland Trust. When I am not building Coinrule, you can find me exploring the latest DeFi protocols and on Twitter.",
            "linkedin": "https://www.linkedin.com/in/giberstein"
        },
        {
            "name": "Zdenek Hofler, Founder",
            "description": "I am a passionate entrepreneur, infrastructure & software architect and a fullstack web developer with strong GDPR knowledge. A project-oriented person who loves challenges and building of interesting projects.\n\nMy life story is long and funny, ask me when we meet over a glass of wine or beer.",
            "linkedin": "https://www.linkedin.com/in/zdenekhofler/"
        }
    ],
    "status": true,
    "generated_description": "Coinrule is a fintech company based in London that was founded in 2018, emerging from Y Combinator’s Batch S21. The core mission of Coinrule is simple yet powerful: “Coinrule Automates Your Crypto and Stock Investments.” The platform provides an intuitive way for users to automate their trading strategies, making it easier to seize market opportunities without constantly monitoring the charts.\n\nInitially conceived to take on the challenges of fast-paced trading, Coinrule enables users to set up automated trading rules that execute based on specific market conditions. This means users can participate in the trading scene effectively without needing extensive technical know-how. You could think of it as your personal trading assistant, working around the clock to catch that next market rally or protect you from downturns.\n\nThe team here is small but mighty, with 17 employees led by co-founders Gabriele Musella (CEO), Oleg Giberstein (COO), and Zdeněk Höfler (CTO). They emphasize a product that is user-friendly and secure—no need for users to divulge their private keys or withdrawal rights, which is a significant concern in the crypto space.\n\nThe platform supports trading across multiple popular exchanges like Binance, Coinbase Pro, and Kraken, allowing users to deploy automated strategies seamlessly. With over 250 pre-built trading rules and the ability to create custom ones, users can tailor their investment strategies to fit personal preferences and market dynamics.\n\nCoinrule offers various pricing tiers catering to different levels of trading frequency and volume, starting from a free option for hobbyists to a business plan for professional users. This tiered system allows flexibility for users as their trading needs grow.\n\nIn terms of recognition, Coinrule has attracted attention from notable media outlets like Forbes and TechCrunch, affirming its position in the growing landscape of automated trading solutions. \n\nIf you're interested in automating your trading on crypto and stock markets, Coinrule makes it easy to get started. You can sign up and create automated trading rules tailored to your investment strategy for free. Check them out at [Coinrule.com](https://coinrule.com) and begin your journey into automated trading today!",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/6f8ed646940e5c63414bbca123b55737ad54e8c4.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191058Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=6c00ef22a443b92920f6df08287466f4be93b3a23e93bd3caa33216dbf69a02d",
    "social_links": [
        "https://www.linkedin.com/company/coinrule",
        "https://twitter.com/coinrulehq",
        "https://facebook.com/coinrulehq",
        "https://www.crunchbase.com/organization/coinrule"
    ],
    "logo_path": "data/logos\\Coinrule_logo.png"
}