{
    "links": "https://www.ycombinator.com/companies/colab",
    "name": "CoLab",
    "headline": "Build better hardware products, faster.",
    "batch": "S19",
    "description": "CoLab is on a mission to accelerate the pace of innovation by helping engineering teams deliver better products faster. CoLab’s Design Engagement System (DES) enables engineering teams to have more effective design conversations, and ultimately make better engineering decisions. CoLab is trusted by Fortune 500 organizations like Komatsu, Polaris, Johnson Controls, Hyundai Mobis, Schneider Electric and Lockheed Martin.",
    "activity_status": "Active",
    "website": "http://colabsoftware.com",
    "founded_date": 2017.0,
    "team_size": 120.0,
    "location": "St. John's, Canada",
    "group_partner": "Brad Flora",
    "group_partner_yc": "https://www.ycombinator.com/people/brad-flora",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:hardware; industry:saas; industry:collaboration",
    "founders": [
        {
            "name": "Jeremy Andrews, Founder",
            "description": "Mechanical engineer from Newfoundland and Labrador, Canada. Identified a need for better collaboration tools for mechanical engineers while working at Tesla, designing components for the Model 3 battery pack. Co-founded CoLab Software in 2017 to develop a modern, collaborative design review solution.",
            "linkedin": "https://www.linkedin.com/in/jeremyandrewsmun"
        },
        {
            "name": "Adam Keating, Founder",
            "description": "Mechanical Engineer building collaboration software to give other mechanical engineers and their teams the tools they need for efficient agile hardware development.\n\nPreviously worked on one the world's first hyperloop vehicles, a patent-pending electric propulsion system for large-scale aircraft, the world's first biology-guided radiotherapy system and several multi-billion dollar energy projects.",
            "linkedin": "https://www.linkedin.com/in/adammichaelkeating/"
        }
    ],
    "status": true,
    "generated_description": "**CoLab: Rapidly Building Better Hardware Products**\n\nFounded in 2017 and part of Y Combinator's Batch S19, CoLab operates out of St. John’s, Canada. With a team of 120 employees, their mission is clear: to catalyze innovation by enabling engineering teams to create better hardware products, and to do so more quickly.\n\n**What They Do:**\n\nCoLab offers a Design Engagement System (DES), a software that transforms how engineering teams communicate. By streamlining design discussions—often bogged down by endless email threads and scheduling challenges—CoLab makes it easier for teams to surface critical feedback, make informed decisions, and ultimately enhance product quality. Their platform automates issue tracking and facilitates real-time collaboration, meaning less time is spent on administrative tasks and more on actual engineering.\n\n**Trusted by Industry Leaders:**\n\nCoLab is recognized by major Fortune 500 companies, including Komatsu, Polaris, Johnson Controls, and Lockheed Martin. These trusts speak volumes about the reliability of their solutions in highly competitive industries.\n\n**Key Features:**\n\n- **Collaboration:** Twofold speed in design reviews and secure, straightforward file sharing.\n- **Feedback Management:** Directly comment on 2D or 3D models and transform design insights into actionable issues without complicated spreadsheets.\n- **Automation:** Their ReviewAI feature not only tracks feedback but also helps prevent recurring issues by leveraging machine learning to surface lessons learned.\n\n**Impact and Benefits:**\n\nAmong the statistics shared, CoLab boasts:\n- Significant reductions in lead times by 30% \n- Cost savings of up to eight figures for major clients\n- 4x faster supplier review processes\n\nThis measurable impact provides tangible proof of their capability to drive results.\n\n**Next Steps:**\n\nIf you’re part of an engineering team looking to enhance collaboration and improve product quality, CoLab might just be the partner you need. Their platform seamlessly connects with major Product Lifecycle Management (PLM) systems, making integration straightforward.\n\nFor more information and to see how CoLab can foster better design conversations, visit their website at [CoLab Software](http://colabsoftware.com). Whether you want to understand more about their features, explore case studies, or schedule a demo, CoLab is set up to help fast-track your design process.\n\nIn a world where the speed of development is often the difference between success and failure, CoLab stands out as a game-changer in hardware product development.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/9b6323483981edb5c66c6fec03f56924a555f077.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191058Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=ad777cd1b3d7c0a210e0c600c365e40c9d3c0247fc4d0190ee993067fc70ee88",
    "social_links": [
        "https://www.linkedin.com/company/colabsoftware",
        "https://twitter.com/colab_software",
        "https://www.facebook.com/colabsoftware",
        "https://www.crunchbase.com/organization/colab-software"
    ],
    "logo_path": "data/logos\\CoLab_logo.png"
}