{
    "links": "https://www.ycombinator.com/companies/coldreach",
    "name": "Coldreach",
    "headline": "Find the best leads with custom intent signals",
    "batch": "W23",
    "description": "Coldreach helps sales teams find ready-to-buy leads, by monitoring public signals *custom* to your product. \r\n\nFor example, it can find who's hiring their first accountant, so an accounting automation product can hit them with a targeted message at the right time. \r\n\nPublic data sources (job postings, news articles, 10-k reports, etc.) tell a lot about a company’s priorities and the problems it faces. We train AI sales agents to monitor them and find who needs your help and why. Sales teams know who'd thank them for a cold email/call now, and can sound relevant without hrs of manual research. \r\n\nTypically, targeted outreach yields 2-8x higher booking rate compared to random outreach.\r\n\n**Example intent signals we track**:\r\n- Bookkeeping automation product: Monitor who starts to hire human to manually enter invoices\r\n- Compliance product: Monitor who recently onboarded a new Compliance Analyst\r\n- CRM integrations: Monitor who starts to hire engineers experienced in Salesforce API.",
    "activity_status": "Active",
    "website": "https://coldreach.ai/",
    "founded_date": 2023.0,
    "team_size": 3.0,
    "location": "San Francisco",
    "group_partner": "Harj Taggar",
    "group_partner_yc": "https://www.ycombinator.com/people/harj-taggar",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:artificial-intelligence; industry:generative-ai; industry:saas; industry:b2b; industry:sales; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Xiaohan Shen, Founder",
            "description": "Shen is the CEO of Coldreach and ex-CPO of EasyJobs. He is excited about sales, growth hacking, and turning problems into opportunities. \n\nShen led the growth and product team at EasyJobs from 0 to 20K MAU, and he has extensive experience with outbound sales and marketing. Before that, Shen had years of technical experience and worked as a software engineer, but discovered that his passion lies at the intersection of tech and business.",
            "linkedin": "https://www.linkedin.com/in/xiaohan-shen1/"
        },
        {
            "name": "Hankel Bao, Founder",
            "description": "Hankel is the CTO of Coldreach and ex-CTO of EasyJobs. He has extensive experiences in NLP and abstractions.\n\nHankel is enthusiastic in beautiful solution to hard problems. He started coding at 9, and developed an operating system in middle school. With that passion, he led the dev team to create the most intelligent solution to job applications at EasyJobs.",
            "linkedin": "https://www.linkedin.com/in/hankelbao/"
        }
    ],
    "status": true,
    "generated_description": "**Coldreach**\n\nFounded in 2023 and proudly backed by Y Combinator’s W23 batch, Coldreach is a San Francisco-based startup on a simple yet essential mission: **to help sales teams identify and engage with the best leads using custom intent signals.** \n\nWhat sets Coldreach apart is its ability to monitor public signals tailored specifically to your product. This means, for example, if you offer an accounting automation tool, Coldreach can detect when a company is hiring its first accountant and allow you to reach out with a perfectly timed message. It taps into various public data sources—think job postings, news articles, and financial reports—to uncover insights about a company's current priorities and challenges. \n\nHarnessing the power of AI, Coldreach automates the painstaking process of lead generation, allowing sales teams to focus their energies on offers that are not just cold but likely to resonate. The results speak for themselves; targeted outreach through Coldreach can yield **2 to 8 times higher booking rates** compared to the scattergun approach of random outreach.\n\n### Features and Functionality:\n\n- **Custom Intent Signals**: Forget generic intent scores. Coldreach enables you to define what buying signals are important to you in plain language. The AI sifts through **74 million+ accounts** and finds leads that show signs of being ready to buy your product.\n  \n- **Tailored Monitoring**: Whether you're tracking human hires for bookkeeping tasks or looking for companies that onboard a new compliance analyst, Coldreach allows users to customize which signals to monitor so that every outreach feels crafted and timely.\n\n- **Integrations**: Coldreach seamlessly blends with existing tools such as Salesforce, Slack, and email platforms, ensuring that you can keep your current workflow without unnecessary hurdles.\n\n- **Automated Insights**: The platform not only finds leads but also summarizes key insights, delivering messages that pierce through the noise of overly generic outreach.\n\n- **Notification System**: Want to stay updated on potential leads? Coldreach offers alerts through preferred channels like Slack or email, keeping you in the loop without the clutter.\n\nWith a small yet nimble team of three, led by experienced Group Partner Harj Taggar, Coldreach is poised to transform how sales teams capture intent signals and convert leads. \n\nAs more than just a sales tool, Coldreach represents a forward-thinking solution at the intersection of technology and sales, pushing boundaries to reshape how businesses engage with their potential markets. To dig deeper, check out their website [here](https://coldreach.ai/). \n\nIn a nutshell, if you're looking to supercharge your sales outreach by leveraging data in smarter ways, Coldreach might be just the tool you need.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/31d04c3c076b7ad7376080e5b9150640d54ff664.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191059Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=8faa5fd998eb86e961e44bb5f03a84bdcddae242ef0018cae7ca40cd1fe2be64",
    "social_links": [
        "https://www.linkedin.com/company/coldreach/"
    ],
    "logo_path": "data/logos\\Coldreach_logo.png"
}