{
    "links": "https://www.ycombinator.com/companies/conduit",
    "name": "Conduit",
    "headline": "Air Traffic Control for Warehouses",
    "batch": "W23",
    "description": "Dock Scheduling, Yard Management, Driver Sign In, and more. \r\n\nWe make software for warehouses and logistics teams to save time and money managing docks, gates, and yards. With dock, gate, and yard management modules, each module can easily be added on or used on its own. This makes Conduit the perfect fit for all types of operations. Best of all, if you have multiple facilities then Conduit can be configured differently at each facility, but provide you with a comprehensive view of your entire network.\r\n\nWe are proud to be able to help supply chains of all sizes optimize their labor, increase throughput, and prepare for the work ahead.",
    "activity_status": "Active",
    "website": "http://helloconduit.com",
    "founded_date": 2023.0,
    "team_size": 5.0,
    "location": "San Francisco",
    "group_partner": "Michael Seibel",
    "group_partner_yc": "https://www.ycombinator.com/people/michael-seibel",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:saas; industry:b2b; industry:logistics; industry:transportation; industry:enterprise-software; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Conrad Lilleness, Founder",
            "description": "Conrad Lilleness is the co-founder and CEO of Conduit, which was started in 2022. Conrad leads sales, customer support, and product. He received a bachelor of science in finance from Westminster College in Salt Lake City, Utah and is originally from Seattle, Washington.",
            "linkedin": "https://www.linkedin.com/in/conradlilleness/"
        }
    ],
    "status": true,
    "generated_description": "Conduit is a fresh tech venture launched in 2023, nestled in the heart of San Francisco and currently part of Y Combinator Batch W23. Their mission? To act as an \"Air Traffic Control\" system for warehouses, enhancing efficiency in logistics operations.\n\nInitially focused on dock scheduling, Conduit has expanded its offerings to include yard management, driver sign-in, and beyond. Their modular software allows warehouses and logistics teams to tailor solutions that fit their unique needs—whether they want to use a single module or integrate multiple ones across various facilities. This flexibility is particularly useful for operations juggling multiple sites.\n\nConduit's technology is designed to streamline dock, gate, and yard management, promising to cut down both time and costs. The software empowers logistics teams to optimize labor, boost throughput, and prepare for future demands. With a team of five and backed by Group Partner Michael Seibel, the company is young but ambitious.\n\nThe platform is steeped in user-friendliness, featuring intuitive designs for easy implementation. Customers rave about how it's transformed their operations—from reducing scheduling chaos to automating check-ins. Users have reported saving up to 20 minutes per shipment through Conduit's online dock scheduling system. The digital driver sign-in feature helps minimize manual work, allowing drivers to check in from their cabs, cutting down wait times significantly.\n\nLooking ahead, Conduit is all about visibility. Their software provides comprehensive insights across networks, allowing management teams to track performance metrics and make informed adjustments quickly. Integration is a breeze—Conduit offers APIs that smoothly connect with existing warehouse management systems (WMS), transportation management systems (TMS), or yard management systems (YMS).\n\nSo if you're in logistics and tired of the inefficiencies plaguing your warehouse operations, Conduit could be the partner you need to take control and streamline your workflow.\n\nCheck them out at [helloconduit.com](http://helloconduit.com) to learn more.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/fc5f74d1c2038f1f75a1cc687663f7d3d0d20d41.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191100Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=48bf38480ca29603f705f388de092d9ba215a49ab8b53767ff160967035d66fa",
    "social_links": [
        "https://www.linkedin.com/company/getconduit/"
    ],
    "logo_path": "data/logos\\Conduit_logo.png"
}