{
    "links": "https://www.ycombinator.com/companies/cone",
    "name": "Cone",
    "headline": "Modern finance and accounting platform for business",
    "batch": "S22",
    "description": "Cone is a platform for all finance and accounting needs for SMBs. We help these businesses with bookkeeping, tax filing, compliance, vendor payments and financial reporting",
    "activity_status": "Active",
    "website": "https://www.getcone.io",
    "founded_date": 2022.0,
    "team_size": 8.0,
    "location": "Hyderabad, India",
    "group_partner": "Michael Seibel",
    "group_partner_yc": "https://www.ycombinator.com/people/michael-seibel",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:saas; industry:b2b",
    "founders": [
        {
            "name": "Jahangir Mohammed, Founder",
            "description": "Jahangir is the co-founder of Cone.\nBefore Cone, Jahangir was the co-founder of Joveo - the leading platform that finds companies worldwide the most qualified hires in the least amount of time. From 4 to 300 employees, he helped the company scale and find product-market fit. He worked across all functions of the company.\nHe has held several technical and product leadership roles. He also advises early-stage startups. \nHe has a MS degree in Computer Science from Stony Brook University.",
            "linkedin": "https://www.linkedin.com/in/jahangir27/"
        },
        {
            "name": "Bharath Kumar Reddy, Founder",
            "description": "Bharath is the co-founder of Cone.\nBefore Cone, he was a founding engineer at Rialtic. He led the engineering team to build a scalable and extensible platform for healthcare claims (raising $45 million in series A). Before that, he co-founded adaptive.team, which allowed businesses to manage OKRs through conversational bots.\nHe has a Bachelor's and Master's degree in Electrical Engineering from IIT Madras.",
            "linkedin": "https://www.linkedin.com/in/bharath-k-r"
        }
    ],
    "status": true,
    "generated_description": "**Cone: Simplifying Financial Management for SMBs**\n\nFounded in 2022 and hailing from the vibrant tech hub of Hyderabad, India, Cone is a compelling player in the fintech space. This Y Combinator Batch S22 participant is on a mission: to create a modern finance and accounting platform specifically tailored for small and medium-sized businesses (SMBs). \n\nCone started as a comprehensive solution for bookkeeping, tax filing, compliance, vendor payments, and financial reporting—all in one place. Its ambitious goal is to streamline these complex processes that often bog down businesses, allowing them to focus on growth instead of paperwork.\n\nWith a small but dedicated team of 8 employees, Cone leverages cutting-edge technology to automate processes that have traditionally been manual and time-consuming. For instance, the \"Cone Propose\" feature automates proposals, billing, and payments, while \"Cone Practice\" unifies proposal and practice management for accounting firms. This dual approach helps businesses manage their financial workflows more efficiently. \n\nTheir product offerings are clearly aimed at enhancing productivity: users can create professional proposals, manage billing, track payments, and even oversee project management—all tailored for professional services firms. Cone’s tools come with features such as a flexible editor for proposals, integrated emails, document management, and time tracking—all designed to reduce the overhead of finance management.\n\nMichael Seibel, a prominent figure in the startup world, serves as their Group Partner, further lending credibility to their cause and vision. \n\nWhat stands out is their commitment to customer satisfaction. Testimonials from users highlight how Cone has transformed their financial workflows, making the process easier and more efficient. This is not just lip service; real businesses are finding true value in fewer headaches and faster payments.\n\nCone is more than just a tool; it's a partner for businesses looking to navigate the complexities of finance while honing in on what they do best—serving their customers. With a strong endorsement from its users and a clear vision, Cone is poised to carve out a significant niche in the ever-evolving world of fintech.\n\nFor more details, check out their website at [getcone.io](https://www.getcone.io).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/c7f5db4bf134b215837e148267f1899e4bff2a2e.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191101Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=c36bacc391fca20303a6dedc190b462af82bfe6ef2e27b1bc0fb87d379567928",
    "social_links": [
        "https://www.linkedin.com/company/getcone/"
    ],
    "logo_path": "data/logos\\Cone_logo.png"
}