{
    "links": "https://www.ycombinator.com/companies/conntour",
    "name": "Conntour",
    "headline": "Monitor & search security camera footage with natural language.",
    "batch": "W25",
    "description": "Conntour lets governments and corporates query their security cameras. Users can search past footage (“Find a man with a blue backpack”), set alerts (“Alert me if someone climbs over the wall”), and extract data (“How many vehicles entered yesterday?”).\r\n\nWe recently secured our first paying customer - the Singapore government - paying $80K for a 3-month trial. If successful, this trial will lead to a contract worth ~$2M/year.\r\n\nMatan (CEO) led a military video surveillance unit, leveraging security cameras to save lives. Tomer (CTO) is a second-time founder and former director of engineering.\r\n\nThe problem with existing solutions is that they offer low customization, as they’re limited to pre-defined parameters (like shirt color or license plate number). This lack of flexibility causes missed critical events, too many false alarms, and countless hours wasted on manual footage review. Conntour solves this by offering unlimited flexibility through natural language queries - just ask anything.",
    "activity_status": "Active",
    "website": "https://www.conntour.com/",
    "founded_date": 2024.0,
    "team_size": 4.0,
    "location": "Tel Aviv-Yafo, Israel",
    "group_partner": "Tom Blomfield",
    "group_partner_yc": "https://www.ycombinator.com/people/tom-blomfield",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:govtech; industry:computer-vision; industry:b2b; industry:security; industry:ai",
    "founders": [
        {
            "name": "Matan Goldner, Co-Founder & CEO",
            "description": "I’m the co-founder and CEO of Conntour.\n\nI led a military video surveillance unit - leveraging security cameras to save lives. Later I managed surveillance at a private security company, working with most of the existing video analytics solutions.\n\nIn those roles, I used many of the solutions that are now our competitors and experienced a major need that had no real solution. That experience also helped me build strong connections with global leaders in the physical security industry.",
            "linkedin": "https://linkedin.com/in/matan-goldner"
        },
        {
            "name": "Tomer Kulla, Co-Founder & CTO",
            "description": "Co-Founder and CTO at Conntour, with a BSc in Computer Science focused on computer vision. \nPreviously, I founded and sold Nilus, where I worked on eCommerce ad-tech and recommendation engines (ML). \nMy career spans both hands-on experience—particularly in web, MLOps, and big data—and leadership roles, including managing teams and as a Director of Engineering manging goup of 3 teams.",
            "linkedin": "https://www.linkedin.com/in/tomer-kulla/"
        }
    ],
    "status": true,
    "generated_description": "**Company Overview: Conntour**\n\nFounded in 2024 and based in Tel Aviv-Yafo, Israel, Conntour is on a mission to revolutionize video surveillance. What sets them apart? They allow users to **monitor and search security camera footage using natural language**. Imagine asking your security system, “Find a man with a blue backpack,” or “Alert me if someone climbs over the wall.” That’s the flexibility and power that Conntour brings to the table.\n\n### The Problem\n\nTraditional video analytics solutions tend to be rigid, relying on pre-defined parameters like shirt colors or license plate numbers. This rigidity leads to missed critical events, an overload of false alarms, and the merciless drudgery of manual footage review. In a world that is complex and dynamic, these limitations are simply not enough.\n\n### The Solution\n\nConntour's innovative approach leverages advanced AI to offer **unlimited flexibility through natural language queries**. They allow users to engage with their surveillance data in a more intuitive and efficient way. The AI operates around the clock, scanning live video streams based on user-defined queries, ensuring no critical moment slips through the cracks. \n\n### Recent Milestone\n\nExciting news for the company: they recently secured their first paying customer—the Singapore government—who has signed on for a trial worth **$80,000 for three months**. If this trial goes well, it could lead to a substantial contract valued at around **$2 million per year**. \n\n### The Team\n\nConntour's team is led by **Matan**, the CEO who has military experience in video surveillance, and **Tomer**, the CTO, a second-time founder and former director of engineering. Their combined expertise in security and technology clearly informs Conntour's innovative model.\n\n### Future Prospects\n\nWith a growing roster of features designed to improve security operations and reduce the time spent on manual footage reviews, Conntour is well-positioned to lead the charge in a market begging for disruption. They integrate seamlessly with existing systems so organizations don’t need to overhaul their hardware or software to benefit from their technology.\n\n### Tags and Affiliations\n\nConntour identifies within the segments of **govtech**, **computer vision**, **B2B**, **security**, and **AI**—showing a broad applicability of their platform. Additionally, they are part of Y Combinator's **W25** batch, which speaks volumes about their potential and credibility.\n\nFor more information, you can explore their website at [Conntour.com](https://www.conntour.com/) where you can also book a demo to see their solution in action. \n\n**Conclusion**\n\nIn a world where security is paramount, Conntour stands out by merging cutting-edge technology with usability, redefining how organizations can interact with their surveillance systems. Expect them to be a key player in the evolution of security solutions as they continue to capture attention and grow their footprint in the industry.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/e6ab39c9b9e062f7ee28a2c092551defba3e243e.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191102Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=31692f2cf71d1ec48fab95d879ee3d7db0b14597b831a171bbb393670dc0af7a",
    "social_links": [
        "https://www.linkedin.com/company/conntour/"
    ],
    "logo_path": "data/logos\\Conntour_logo.png"
}