{
    "links": "https://www.ycombinator.com/companies/constant",
    "name": "Constant",
    "headline": "Private credit investment platform",
    "batch": "W23",
    "description": "Constant provides access to high-quality private credit funds. Our software helps users discover relevant private credit funds, guides them through the investment process, and offers low investment minimums. See additional information, terms and disclosures at useconstant.com",
    "activity_status": "Active",
    "website": "https://useconstant.com",
    "founded_date": 2023.0,
    "team_size": 2.0,
    "location": null,
    "group_partner": "Dalton Caldwell",
    "group_partner_yc": "https://www.ycombinator.com/people/dalton-caldwell",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": null,
    "founders": [
        {
            "name": "Ben Sender, Founder",
            "description": "Ben previously worked at Silver Point, a hedge fund run by the former heads of Goldman Sachs Special Situations, Goldman High Yield Credit and Goldman Bank Loans. Before Silver Point, Ben worked at J.P. Morgan, Blackstone and T. Rowe Price. He graduated Summa Cum Laude from Princeton, where he studied economics, computer science and philosophy.",
            "linkedin": "https://www.linkedin.com/in/ben-sender-272813a4"
        }
    ],
    "status": true,
    "generated_description": "### Company Overview: Constant\n\n**Name:** Constant  \n**Founded:** 2023  \n**Location:** New York (exact address not specified)  \n**Team Size:** 2 employees  \n**Batch:** Y Combinator W23  \n**Group Partner:** Dalton Caldwell  \n\n**Mission:** Constant aims to democratize access to high-quality private credit investment opportunities, making these traditionally exclusive asset classes available to a broader audience.\n\n---\n\n### What Does Constant Do?\n\nConstant operates as a private credit investment platform that simplifies the process of investing in curated, high-quality private credit funds. Here's how they bridge the gap for investors:\n\n1. **Curated Fund Access:** Users can discover and invest in a selection of private credit funds tailored for varying investment needs.\n2. **Guided Investment Process:** The platform guides users through the intricate steps of making these investments, ensuring a smoother experience for even the inexperienced investor.\n3. **Low Investment Minimums:** One of Constant’s standout features is its low minimum investment requirements, making it feasible for more people to enter the private credit space.\n\n### Why Private Credit?\n\nPrivate credit is an emerging asset class that has shown strong returns over the past two decades, averaging approximately 10% annually. Here are a few compelling reasons to consider private credit:\n\n- **Robust Risk Profile:** Historically, private credit presents a lower risk than public credit options.\n- **Diversification Potential:** Private credit often has a low correlation with other asset classes, which can enhance a portfolio’s overall stability.\n- **Regular Income:** Investors often receive regular distributions, making this an attractive option for those seeking consistent income.\n- **Return Premium:** Higher returns typically accompany longer investment horizons and potential liquidity trade-offs, appealing to those who are willing to navigate the less liquid market.\n\n### Growth and Future Directions\n\nSince its inception, the private credit industry has grown over 400% since 2010. Traditionally, this market has been dominated by institutional and ultra-wealthy investors. Constant's mission is to shift that paradigm, allowing more investors to partake in this burgeoning space.\n\n### Call to Action\n\nFor those interested in exploring private credit as part of their investment strategy, Constant invites potential users to join their waitlist. The platform is currently available on an invite-only basis, emphasizing its exclusive nature.\n\n### Closing Thoughts\n\nConstant positions itself as a powerful gateway to the private credit world, leveraging technology to make it more accessible for a wide range of investors. With industry expertise and a straightforward approach, it’s poised to help redefine how private credit can fit into broader investment portfolios.\n\nFor more information, check out their website: [Constant](https://useconstant.com) and be sure to join the waitlist to stay updated!\n\n---\n\nThis overview encapsulates Constant’s mission and offerings, drawing a picture of an innovative company ready to democratize private credit investing.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/f8ae2ec6a6a6c3e9d40a8550cc2a08b2e4947c09.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191102Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=7ce6beff05ba8843a9673a50eaa99094ba59de69756b3c5c96d276572c6ac5c6",
    "social_links": [
        "https://www.linkedin.com/company/useconstant"
    ],
    "logo_path": "data/logos\\Constant_logo.png"
}