{
    "links": "https://www.ycombinator.com/companies/convictional",
    "name": "Convictional",
    "headline": "Convictional is reinventing business operations",
    "batch": "W19",
    "description": "Convictional is fundamentally rethinking how business leaders pursue goals and make decisions. Instead of trying to coordinate through email chains, chat messages and meetings with slides, you'll get an entirely new kind of decision environment where the right context and people come together instantly.\r\n\nYour leaders will see every major initiative in motion across the company. They'll spot emerging patterns, tap into experience from past projects, and mobilize the right expertise at the right moment. No hunting for information, no voices lost in the noise, no painful reconstructions of why decisions were made.\r\n\nCustom workspaces spin up automatically for each goal. Critical metrics and context from prior decisions will surface proactively. Input will flow from experts inside and outside your company. Everything will be instantly documented. And your team's decision-making playbook will get smarter with every choice you make.",
    "activity_status": "Active",
    "website": "https://convictional.com",
    "founded_date": 2017.0,
    "team_size": 12.0,
    "location": "Toronto, Canada",
    "group_partner": "Michael Seibel",
    "group_partner_yc": "https://www.ycombinator.com/people/michael-seibel",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:b2b; industry:enterprise; industry:operations",
    "founders": [
        {
            "name": "Chris Grouchy, Founder",
            "description": "Helping startups figure out 0-1 GTM.",
            "linkedin": "https://www.linkedin.com/in/chrisgrouchy/"
        },
        {
            "name": "Roger Kirkness, CEO & Founder",
            "description": "CEO & Founder at Convictional",
            "linkedin": "https://www.linkedin.com/in/roger-kirkness/"
        }
    ],
    "status": true,
    "generated_description": "### Convictional: Reinventing How Businesses Operate\n\n**Overview**  \nFounded in 2017 and birthed from Y Combinator’s Batch W19, Convictional is a Toronto-based startup committed to transforming business operations. With a compact team of 12, their mission is to fundamentally rethink how business leaders make decisions and pursue goals.\n\n**The Problem They Solve**  \nEvery experienced leader knows the frustration of clunky email chains, endless chat threads, and slide-heavy meetings that obscure rather than clarify decision-making. Convictional tackles these issues head-on. They offer a platform that provides a structured decision-making environment, bringing the right context and expertise together in real time—essentially cutting through the noise.\n\n### Key Features\n\n1. **Unified Workspace**: Convictional replaces scattered communications with a streamlined interface where teams can collaborate instantly. This reduces the risk of lost voices and miscommunication.\n\n2. **Decisional AI**: By augmenting human judgment with AI, Convictional empowers leaders to make informed choices without surrendering decision-making power to machines. \n\n3. **Meeting Intelligence**: To maximize productivity, their platform automatically records, transcribes, and summarizes meetings. This ensures no decision goes undocumented and follow-ups are tracked seamlessly.\n\n4. **Knowledge Search**: Convictional helps unlock insights from past decisions, fostering a culture of learning and informed decision-making across your team.\n\n5. **Goal Alignment**: The platform helps ensure all teams are aligned towards shared objectives, improving focus on what truly matters.\n\n### The Bigger Picture\nBy facilitating real-time collaboration and providing AI-supported insights, Convictional allows organizations to synthesize data and make clear, actionable decisions more efficiently. It truly empowers team members at every level, aligning their work with the company’s broader goals.\n\n**Join the Movement**  \nAs businesses become increasingly complex, Convictional stands out as a beacon for those looking to optimize operations. If you’re interested in joining a forward-thinking team or want to improve your decision-making flows, check them out at [Convictional](https://convictional.com).\n\n### The Team Behind Convictional\nMichael Seibel, a notable group partner at Y Combinator, is associated with the startup, signaling the quality and potential of the venture.\n\nIn summary, Convictional isn’t just another tool; it's a mindset shift for enterprises. The old ways of managing information and making decisions are fading, and it’s time to embrace environments where clarity and collaboration reign supreme.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/fbc7a7581301b31e02c4dcbcc34efb6daae39ea5.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191102Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=8256da2c7e467cff63783469ca4c90bb7e0005b93de26470d9c642baab1736f7",
    "social_links": [
        "https://www.linkedin.com/company/18274570",
        "https://www.crunchbase.com/organization/convictional",
        "https://github.com/convictional"
    ],
    "logo_path": "data/logos\\Convictional_logo.png"
}