{
    "links": "https://www.ycombinator.com/companies/copia",
    "name": "Copia",
    "headline": "Copia's a for-profit technology company that solves food waste &â\u0080¦",
    "batch": "W16",
    "description": "We waste 3X more food than there are hungry mouths to feed. It is not a lack of food that's the issue, but rather an ineffective distribution of that food. Hunger is not a scarcity problem; it's a logistics problem.\r\n\nFor the first time ever, we can effectively donate prepared and highly perishable food to those who need it when we need it most. Copia is a for-profit company that has built technology allowing businesses (e.g., food management companies like Compass Group, corporate cafeterias, universities, hospitals, grocers, caterers, etc.) to easily request pickups of their surplus food, have it matched, and safely delivered to non-profits in need. With Copia, partnering businesses can seamlessly access significant tax savings, dramatically reduce food waste through data and analytics on surplus, and remove CO2 from the atmosphere, all while feeding their community.\r\n\nWe have diverted over 7M pounds of edible food from landfills and provided businesses and nonprofits with over $23M in savings. We will feed over 7M people with incredible food that would have otherwise been wasted!",
    "activity_status": "Active",
    "website": "http://www.gocopia.com",
    "founded_date": 2016.0,
    "team_size": 20.0,
    "location": "San Francisco",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:saas; industry:b2b; industry:food-tech; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Komal Ahmad",
            "description": "As the founder of Copia, Komal intelligently solved the complex logistics associated with the redistribution of perishable excess food to nonprofits in need. Copiaâ\u0080\u0099s technology dramatically reduces food waste and ends hunger. Copia will feed 7M people and provide businesses and nonprofits with over $30M in savings.\n\nEntrepreneur magazine names Komal as one of the Most Powerful Women in the World. She is on Forbes 30 Under 30 and was recently honored with the Nelson Mandela Humanitarian Award.",
            "linkedin": "https://www.linkedin.com/in/komalahmad"
        }
    ],
    "status": true,
    "generated_description": "**Copia: Solving Food Waste One Donation at a Time**\n\nFounded in 2016 and located in the vibrant heart of San Francisco, Copia is a for-profit tech company geared towards tackling food waste sustainably. The core idea? We waste three times more food than there are hungry mouths to feed. So instead of treating hunger as a scarcity issue, Copia recognizes it as a logistics challenge. \n\nCopia serves as a crucial bridge between businesses with surplus food—like corporate cafeterias, hospitals, and grocers—and nonprofits in need. Their technology allows these businesses to effortlessly schedule food pickups, which are then matched with local charities for distribution. Since its launch, Copia has successfully diverted over **7 million pounds of edible food** from landfills and saved businesses and nonprofits **over $23 million.** That’s equivalent to feeding **7 million people** with food that would have otherwise gone to waste!\n\nAt its core, Copia’s mission is simple: redistribute high-quality surplus food to those in need while helping its business partners enhance profitability, maintain compliance, and decrease carbon emissions—all through an intuitive app. Users can track their donations, the related tax benefits, and their overall impact, making the process not just ethical but measurable and beneficial to their bottom line.\n\nWith a **20-person team** and having been nurtured through Y Combinator's Batch W16, Copia is also tagged as being part of the **B2B** and **food-tech** ecosystem. Their operations are streamlined to support everything from individual local businesses to large enterprises across the country, effectively utilizing a **99% match rate** for food donations. \n\nIf your business wants to join the movement to reduce waste and provide for your community while also benefiting financially, Copia makes it easy to get started with straightforward solutions. It’s not just about donating; it’s about transforming surplus into something meaningful—food for those who need it, tax benefits for those giving, and a cleaner planet for everyone.\n\nYou can find out more and start your own journey with Copia by visiting their website at [Copia](http://www.gocopia.com). Whether you’re a business aiming to become more sustainable or a nonprofit seeking food assistance, Copia opens the door to a collaborative approach in solving one of our biggest challenges—food waste.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/24de7b03bbaf833017ced8254aad9441e4cc0b49.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191103Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=dbad1790fb3fe8edc65e22ae76827d751ef5c586267678e00ea3c99b8646fbd8",
    "social_links": [
        "https://www.linkedin.com/company/gocopia/",
        "http://www.twitter.com/gocopia",
        "https://www.facebook.com/gocopia",
        "https://www.crunchbase.com/organization/copia-2"
    ],
    "logo_path": "data/logos\\Copia_logo.png"
}