{
    "links": "https://www.ycombinator.com/companies/corecare",
    "name": "CoreCare",
    "headline": "Helping healthcare providers reduce administrative costs using AI",
    "batch": "S20",
    "description": "CoreCare is the leading AI-powered workflow platform helping Post-Acute and Long-Term Care (PALTC) providers achieve operational excellence. Trusted by 1,000+ locations nationwide, CoreCare increases admissions, optimizes reimbursement rates, improves collection metrics, and reduces administrative burdens—all on one intuitive platform.\r\n\nAt the heart of CoreCare is Collaborative Revenue Management, which unites essential data and teams on a shared platform. Our approach empowers employees—regardless of skill or tenure—to perform like experts from day one, collaborate with their peers on critical work, and give management unmatched visibility into performance across the organization.\r\n\nCoreCare replaces error-prone spreadsheets and fragmented portals with streamlined workflows that drive measurable results. Trusted by leading providers, CoreCare redefines how teams work and sets a new standard for AI in long-term care.",
    "activity_status": "Active",
    "website": "https://corecare.ai",
    "founded_date": 2020.0,
    "team_size": 11.0,
    "location": "New York",
    "group_partner": "Dalton Caldwell",
    "group_partner_yc": "https://www.ycombinator.com/people/dalton-caldwell",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:b2b; industry:workflow-automation; industry:enterprise-software; industry:healthcare-it; industry:ai; location:new-york",
    "founders": [
        {
            "name": "Mehrdad Shafaie, Founder",
            "description": "I get excited about solving really hard problems in payments and money movement.",
            "linkedin": "https://www.linkedin.com/in/mehrdad-shafaie-7904503b/"
        },
        {
            "name": "Dennis Antonelos, Cofounder & CEO",
            "description": "Always running towards the big, complicated problems. I love creating high quality software products for customers that 10x how employees and teams work, and make a big impact on critical business metrics.",
            "linkedin": "https://www.linkedin.com/in/antonelos1/"
        }
    ],
    "status": true,
    "generated_description": "**CoreCare: Revolutionizing Post-Acute and Long-Term Care Operations**\n\nFounded in 2020 and hailing from the vibrant tech ecosystem of New York, CoreCare is a trailblazer in the healthcare technology space. As a Y Combinator Batch S20 company, they are dedicated to helping healthcare providers streamline operations and cut administrative costs through the power of artificial intelligence.\n\nAt its core, CoreCare is an AI-driven workflow platform designed specifically for Post-Acute and Long-Term Care (PALTC) providers. With over 1,000 locations across the United States trusting their solution, CoreCare elevates operational efficiency by enhancing admissions, optimizing reimbursement processes, and reducing the administrative load on healthcare teams. This allows providers to focus on what really matters—patient care.\n\nCoreCare introduces **Collaborative Revenue Management**, a pioneering approach that integrates vital data and teams into one unified platform. This empowers employees of all skill levels to collaborate effectively, driving productivity from day one. Management, in turn, gains unprecedented visibility into performance metrics across the organization, allowing for informed, proactive decision-making.\n\nThe platform effectively replaces error-prone spreadsheets and disjointed management systems with optimized workflows that deliver tangible results. Key features include:\n\n1. **CoreCare Admit**: Ensures compliance for every admission while providing real-time tracking and alerts for required forms and authorizations.\n   \n2. **CoreCare Revenue**: Automates the verification of eligibility and benefits, minimizes data discrepancies, and streamlines compliance to enhance cash flow and expedite approvals.\n\n3. **CoreCare Clinical**: Simplifies MDS assessments and state form tracking, empowering clinical staff to optimize revenue through data-driven insights.\n\nThe results speak for themselves. CoreCare can reduce the time spent on Medicaid pending cases by up to 50%, eliminate missed renewals and forms effectively, and provide actionable insights to improve cash flow. With an integrated system that works seamlessly with existing EHRs and state Medicaid systems, CoreCare is fast becoming the go-to platform for nursing homes looking to improve financial performance and operational efficiency.\n\nWith just a team of 11, CoreCare is already making a monumental impact in the healthcare industry. They’ve got backing from influential figures, including Group Partner Dalton Caldwell, and their client testimonials echo the transformative impact of their services.\n\nFor those in the healthcare sector looking to liberate themselves from cumbersome workflows and embrace the future, CoreCare is not just an option; it’s a necessity. By leveraging AI technology, they are redefining standards within long-term care and proving that innovation can lead to improved outcomes for both providers and patients alike.\n\nFor more details, you can visit their website: [CoreCare](https://corecare.ai).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/36322f251717e7ebdd1b69a73b876120d354490d.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191104Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=f80d05924e492fd3c17cceacd2ac93adc94d579d4fb3266c03be5893e6615468",
    "social_links": [
        "https://www.linkedin.com/company/corecare/",
        "https://www.crunchbase.com/organization/corecare"
    ],
    "logo_path": "data/logos\\CoreCare_logo.png"
}