{
    "links": "https://www.ycombinator.com/companies/cortex",
    "name": "Cortex",
    "headline": "Cortex is the Internal Developer Portal eliminating â\u0080\u009cdeveloper taxâ\u0080\u009dâ\u0080¦",
    "batch": "W20",
    "description": "â\u0080\u008bâ\u0080\u008bCortex is an internal developer portal built to accelerate the path to engineering excellence. Companies like Docker, TripAdvisor, and Dropbox use Cortex to catalog, score, and assign action to improve service quality and velocity, so devs can get back to work that drives the business forward.",
    "activity_status": "Active",
    "website": "https://cortex.io/",
    "founded_date": 2019.0,
    "team_size": 100.0,
    "location": "San Francisco",
    "group_partner": "Jared Friedman",
    "group_partner_yc": "https://www.ycombinator.com/people/jared-friedman",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:developer-tools; industry:saas; industry:b2b; industry:productivity; location:san-francisco-bay-area",
    "founders": [],
    "status": true,
    "generated_description": "**Cortex: A Brief Overview**\n\nFounded in 2019 and hailing from the heart of San Francisco, Cortex is redefining the developer experience by introducing an Internal Developer Portal (IDP) that eliminates what’s often referred to as the “developer tax.” As a part of Y Combinator’s Winter 2020 batch, Cortex has quickly established itself as an essential tool for engineering teams at notable companies including Docker, TripAdvisor, and Dropbox.\n\n**Mission and Vision**\n\nAt its core, Cortex aims to accelerate the path to engineering excellence. The platform helps organizations streamline complex workflows and removes barriers that inhibit productivity. It does this by providing a comprehensive cataloging system that allows teams to score and assign tasks, thereby improving service quality and enhancing velocity.\n\n**How It Works**\n\nCortex operates on a systematic approach to optimize engineering operations: it connects various tools and systems, assesses current processes, drives actionable insights, builds upon existing frameworks, and measures outcomes. This cycle not only enhances awareness of ownership and software states but also facilitates agile, informed decision-making.\n\n**Key Features and Benefits**\n\n- **Developer Onboarding:** Automates tedious onboarding processes, getting new developers ramped up quicker.\n- **Software Modernization:** Helps in efficiently tracking transitions during significant software framework changes.\n- **Production Readiness:** Sets clear production standards for services and ensures ongoing alignment with real-time scorecards.\n- **Incident Response:** Cuts down response time by maintaining up-to-date ownership information and best practice guidelines.\n\nThe measurable benefits of adopting Cortex are noteworthy. Organizations report increased developer productivity, reduced mean time to restore (MTTR), and faster migration times. The platform stands out by providing clear ROI metrics that matter—like deployment frequency and service level objective (SLO) attainment.\n\n**Team and Culture**\n\nWith a team of 100 focused on delivering seamless developer experiences, Cortex operates under a culture that fundamentally understands the nuanced needs of engineering teams. Supported by its Group Partner Jared Friedman, the company remains agile and innovative.\n\nTheir commitment to developer satisfaction and operational excellence fosters strong relationships with clients, leading to productive partnerships and continuous growth.\n\n**In Conclusion**\n\nSo, is your internal developer process feeling sluggish? Cortex might be the gateway to turning that around—helping teams build better and faster, while minimizing distractions and complexities. Curious to see it in action? Check out [Cortex's website](https://cortex.io/) for demo opportunities and more insights.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/9e2b6efc6d7406c554388c3c3eb46ea0ec68b2f3.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191104Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=a89f86e441588119d98f0561687c6c538f9298db76407d798c0d2612547016c1",
    "social_links": [
        "https://www.linkedin.com/company/cortexapp/",
        "https://twitter.com/getcortexapp",
        "https://www.crunchbase.com/organization/cortex-98f5",
        "https://github.com/cortexapps"
    ],
    "logo_path": "data/logos\\Cortex_logo.png"
}