{
    "links": "https://www.ycombinator.com/companies/coupl",
    "name": "Coupl",
    "headline": "A neobank for couples in India",
    "batch": "S22",
    "description": "Coupl is India's first neobank for couples. \r\nWe help couples easily manage their shared payments.\r\n\nWhile Indian couples have evolved over the last 20 years, the traditional joint account hasn't.\r\n\nToday, young Indian couples start sharing payments well before tying the knot. They use multiple tools to budget, split, track and settle expenses. They also prefer a quick and digital banking experience. \r\nHowever, the traditional joint account is still only accessible to married couples, takes days to open and is very limited in its expense management features & user experience.\r\n\nCoupl lets any young couple (regardless of their marital status) open a digital joint wallet in under 60 seconds using the mobile app - without ever having to visit a physical bank branch.\r\nCustomers can use the Coupl wallet to pool in money together and pay for shared expenses using our RuPay cards.",
    "activity_status": "Active",
    "website": "https://coupl.money/",
    "founded_date": 2022.0,
    "team_size": 8.0,
    "location": "Bengaluru, India",
    "group_partner": "Michael Seibel",
    "group_partner_yc": "https://www.ycombinator.com/people/michael-seibel",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:consumer; industry:neobank",
    "founders": [
        {
            "name": "Srinivas Sarkar, Founder",
            "description": "Srini is an Indian tech entrepreneur ⚡️He is the co-founder & CEO of Coupl, India’s first neobank for couples, backed by Y Combinator. He was featured in Forbes 30 Under 30 Asia. He's an alum of BITS Pilani.",
            "linkedin": "https://www.linkedin.com/in/srinivas-sarkar/"
        },
        {
            "name": "Kushagra Manglik, Founder",
            "description": "Kushagra is the Co-Founder and COO of Coupl Money. He graduated with a Bachelor's degree in Electrical Engineering from IIT Kanpur in 2019. \n\nHe was a Research Software Engineer at IBM Research for close to 2 years in their AI for Supply Chain team, building multiple production level APIs for some of the top retail companies in the lifestyle space. During his stint with IBM Research, he published multiple papers at Tier 1 Data Science conferences and has 6 patents to his name.",
            "linkedin": "https://www.linkedin.com/in/kushagra-manglik-906399120/"
        }
    ],
    "status": true,
    "generated_description": "### Coupl: India’s First Neobank for Couples\n\n**Overview**  \nFounded in 2022 and incubated in the Y Combinator Batch S22, Coupl has emerged as India's pioneering neobank dedicated to modern couples. Located in Bengaluru, this eight-person team is on a mission to redefine how couples manage their shared finances, appealing not only to married partners but also to those in committed relationships or simply dating.\n\n**The Problem**  \nTraditionally, joint bank accounts in India have been mired in bureaucracy, available only to married couples and requiring cumbersome procedures and limited features. In contrast, modern relationships demand flexibility and ease, with couples often sharing expenses long before tying the knot. This disconnect between couples’ needs and available banking solutions presented a ripe opportunity.\n\n**The Solution**  \nCoupl addresses this gap by allowing any couple to open a digital joint wallet in under 60 seconds through a streamlined mobile app—no physical bank visit required. With Coupl, couples can pool their funds and manage joint expenses using linked RuPay cards. This innovative model replaces the tedious process of tracking who owes what with a simple shared account that handles all expenses seamlessly.\n\n**User Experience**  \nCoupl emphasizes speed and inclusivity. Couples can easily set up their accounts, invite partners, and start spending together. The experience is designed specifically for today’s needs, combining financial management with relationship dynamics, thus creating a platform where love and finances meet harmoniously.\n\n**Rewards and Benefits**  \nFurther enhancing the appeal, Coupl rewards users with perks for spending together. From discounts on travel to entertainment subscriptions, the platform enriches couples' shared experiences while managing their finances. \n\n**Community Focus**  \nCoupl also makes it a point to cater to diverse relationships, including same-sex couples, by providing a hassle-free setup catering to unique family needs.\n\n**The Future**  \nAs they scale, Coupl aims to empower a generation of financially savvy couples who can navigate shared expenses without the traditional banking hurdles. With backing from notable entities like Y Combinator, the potential for this neobank looks promising.\n\nIn essence, Coupl is reshaping how couples approach shared finances, making it faster, easier, and more relevant than ever. Check them out at [Coupl.money](https://coupl.money) to learn more about spending and saving together!",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/8e6edde2135c1bdc840918f14237192da7608cd5.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191105Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=cd736a0757edf2c6c133c5c3ed94dd323b7c2da3ae54e4e3e4b6b30ad02155f4",
    "social_links": [
        "https://www.linkedin.com/company/coupl/",
        "https://www.crunchbase.com/organization/coupl"
    ],
    "logo_path": "data/logos\\Coupl_logo.png"
}