{
    "links": "https://www.ycombinator.com/companies/cowrywise",
    "name": "Cowrywise",
    "headline": "Digitizing wealth management in Africa",
    "batch": "S18",
    "description": "Cowrywise is a FinTech company democratizing access to premium financial services by making these services available to the mass market cheaply. We are leveraging technology and investment management to re-imagine how financial planning, savings and investment products are delivered to people. We do this by helping our customers achieve their savings and investments goals in a simple, secure and affordable manner.",
    "activity_status": "Active",
    "website": "https://cowrywise.com",
    "founded_date": 2017.0,
    "team_size": 40.0,
    "location": "Lagos, Nigeria",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech",
    "founders": [],
    "status": true,
    "generated_description": "Cowrywise is a forward-thinking FinTech company based in Lagos, Nigeria, on a mission to democratize wealth management across Africa. Founded in 2017, Cowrywise emerged from the esteemed Y Combinator Batch S18 and has grown to a dynamic team of 40 employees. Their goal? To make premium financial services accessible and affordable to the mass market, leveraging technology and investment management to transform how savings, investments, and financial planning are delivered.\n\nAt its heart, Cowrywise is about simplifying the financial journey for its users. They offer a range of services that enable customers to save, invest, and grow their wealth with ease. For individuals, Cowrywise provides tools for financial planning, competitive saving options with better interest rates than traditional banks, and the ability to build a global investment portfolio right from an app. The platform includes various features tailored for both personal users and businesses, allowing users to make their idle cash work harder through services like Sprout—designed for businesses to put excess funds to productive use.\n\nSecurity is a priority for Cowrywise. They are fully licensed by the Securities and Exchange Commission (SEC) of Nigeria, ensuring that their operations comply with all regulatory standards. To safeguard user data and funds, Cowrywise employs industry-standard encryption and offers two-factor authentication, further cementing trust with their clientele.\n\nThe company’s user-friendly platform is designed to get users started in just five minutes. Once set up, users can sit back and let their money work for them, supported by robust investment options managed by experienced professionals.\n\nCowrywise embodies the spirit of innovation in finance, focusing not only on access but also on the education of their users. Their learning resources, including glossaries and blogs, help demystify finance and promote smart money management.\n\nIn summary, Cowrywise is a transformative force in Africa’s financial landscape, committed to helping clients of all backgrounds achieve their financial goals with simplicity, security, and exceptional service. Check them out at [cowrywise.com](https://cowrywise.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/a5df225ad7514f1dd90cb8dd0812e8c5f5f54eb3.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191106Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=b6ccbcd13eca18b8c03de199e361ae82c6278e5bb2cd1212342882c4e0a62b43",
    "social_links": [
        "https://www.linkedin.com/company/cowrywise/",
        "https://twitter.com/cowrywise",
        "https://www.facebook.com/cowrywise/",
        "https://www.crunchbase.com/organization/cowrywise",
        "https://github.com/cowrywise"
    ],
    "logo_path": "data/logos\\Cowrywise_logo.png"
}