{
    "links": "https://www.ycombinator.com/companies/craze",
    "name": "Craze",
    "headline": "All-in-one Payroll, HR and IT for India",
    "batch": "S22",
    "description": "Craze makes it simple for founders and growing teams in India to manage, run and automate all of payroll, HR and IT in one place. \r\n\nOur integrated system serves as the single source of truth for all of admin, from onboarding to offboarding and everything in between. With Craze, businesses in India:\r\n- Have a system of record for people, employee and entity data that automates onboarding and offboarding\r\n- Run payroll in one click\r\n- Ensure payroll compliance\r\n- Manage leaves, time and attendance seamlessly synced with payroll\r\n- Automate and manage expenses, devices, benefits and lots more\r\n\nEntrepreneurs start businesses to build something people want and change the world. Craze eliminates disjointed point solutions, multiple spreadsheets and coordination headaches and saves time, money and unnecessary stress so founders can focus on what matters most — growing their business.",
    "activity_status": "Active",
    "website": "https://www.crazehq.com/?utm_source=yc",
    "founded_date": 2022.0,
    "team_size": 8.0,
    "location": "Mumbai, India",
    "group_partner": "Dalton Caldwell",
    "group_partner_yc": "https://www.ycombinator.com/people/dalton-caldwell",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:saas; industry:compliance; industry:hr-tech; industry:payroll",
    "founders": [
        {
            "name": "Kabir Nagral, Founder",
            "description": "Co-founder and CEO of Craze. I studied computer science at Harvard before dropping out to build Craze. Outside of work, I'm a die-hard fan of the Indian Cricket Team, Manchester United, Mumbai Indians, Boston Celtics and New England Patriots.",
            "linkedin": "https://www.linkedin.com/in/kabirnagral/"
        },
        {
            "name": "Deepit Patil, Founder",
            "description": "Deepit Patil is the founder and CTO of Craze. He was studying Computational Mechanics at IIT Delhi before deciding to drop out and build Craze.",
            "linkedin": "https://www.linkedin.com/in/deepitpatil/"
        }
    ],
    "status": true,
    "generated_description": "**Craze: Revolutionizing Indian Payroll and HR Management**\n\nFounded in 2022 and based in Mumbai, Craze is an ambitious startup that aims to become the go-to solution for managing Payroll, HR, and IT all in one place. Backed by Y Combinator’s S22 Batch and led by a team of eight passionate employees, including notable founders with strong tech backgrounds, Craze is dedicated to simplifying the complexities of administrative tasks for Indian startups. \n\n### Mission\nCraze's mission is straightforward yet powerful: Create an all-in-one operating system for Payroll, HR, and IT. They aim to remove the cumbersome disconnect caused by multiple point solutions and spreadsheets, enabling founders to focus on what truly matters—growing their businesses.\n\n### Features\nWith Craze, businesses in India can harness the benefits of an integrated system that serves as a single source of truth for all administrative processes, from onboarding new employees to managing offboarding tasks. Key features include:\n\n- **Automated Onboarding/Offboarding**: Structure workflows that reduce manual entry and errors.\n- **One-Click Payroll**: Smooth payroll management that ensures compliance with local regulations.\n- **Time & Attendance Management**: Seamlessly linked to payroll for accurate salary calculations.\n- **Expense Automation**: Manage expenses, devices, benefits, and much more in one system.\n\nThe platform ensures that startups can conduct fast onboarding, enjoy lightning-quick customer support, and navigate HR processes with ease—without lock-in agreements or hidden fees.\n\n### Client Base\nTrusted by a growing number of fast-paced companies, Craze has received positive testimonials, highlighting its intuitive interface and exceptional customer service. By centralizing HR processes, automating payroll, and maintaining compliance with local labor laws, Craze has proven to be an asset for startups across India.\n\n### The Vision Behind Craze\nFounded by Kabir, a Harvard dropout, and Deepit, an IIT Delhi dropout, the team comprises seasoned entrepreneurs and talented engineers. Their combined expertise drives Craze's commitment to delivering the best in payroll and HR technology, making them a noteworthy contender in the fintech and HR-tech space.\n\n### Conclusion\nWhether you're a founder just starting out or part of a scaling team, Craze equips you with the tools you need to automate and optimize your people operations. With their clean UI and commitment to transparency, they stand out as a solution that understands the unique challenges of startups in India. \n\nFor more information or to book a demo, visit [CrazeHQ](https://www.crazehq.com/?utm_source=yc).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/1aa80a36e3d9cb3ae7da71170ed133c0c913da46.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191107Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=3285167842a529eebf6241e50ec51f4a0009646196e92065145112fe04dca332",
    "social_links": [
        "https://www.linkedin.com/company/crazehq/",
        "https://twitter.com/Craze_HQ"
    ],
    "logo_path": "data/logos\\Craze_logo.png"
}