{
    "links": "https://www.ycombinator.com/companies/creizer",
    "name": "Creizer",
    "headline": "Clear.co for LATAM. Revenue based financing for online sellers.",
    "batch": "W22",
    "description": "Creizer is Clearbanc (Clear.co) for LATAM. We provide revenue-based financing to online sellers.\r\n\nMore than 80% of SMEs can’t have access to loans in LATAM, thus limiting their growth. They represent 99% of online sellers in the region.\r\n\nAt Creizer we built a unique risk model in which the requirements for these online sellers are 100% accessible since the scoring is based on the store’s metrics and collections on a percentage of their daily sales.\r\n\nWe are growing 65% MoM and experiencing overdemand every month. Helping our customers to grow up to 7x in less than a year.",
    "activity_status": "Active",
    "website": "https://www.creizer.com/",
    "founded_date": 2021.0,
    "team_size": 12.0,
    "location": "Mexico City, Mexico",
    "group_partner": "Dalton Caldwell",
    "group_partner_yc": "https://www.ycombinator.com/people/dalton-caldwell",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:e-commerce",
    "founders": [
        {
            "name": "Emiliano Musalem, Founder",
            "description": "Emiliano is the founder and CEO of Creizer. Previously he was part of the launching team of Rappi(Doordash for Latam) in Cordoba, Argentina and Co-founder of a data analytic tool for SMEs. Passionate about how to optimize income distribution and boost developing countries' economies.",
            "linkedin": "https://www.linkedin.com/in/emiliano-musalem-58463a135/"
        }
    ],
    "status": true,
    "generated_description": "Creizer is a rapidly growing fintech company based in Mexico City, founded in 2021 and part of Y Combinator's Batch W22. Positioned as a solution akin to Clearbanc (now Clear.co) for the Latin American market, Creizer focuses on providing revenue-based financing to online sellers—crucial support in a region where over 80% of small and medium enterprises (SMEs) struggle to access loans.\n\nThe heart of Creizer's innovation lies in its unique risk model. Unlike traditional financing, which often relies on credit scores and collateral, Creizer assesses sellers based on their store metrics and daily sales. This makes funding not just more accessible, but also more aligned with the sellers’ actual performance.  \n\nThe company has been experiencing impressive growth—65% month-over-month—and reports that its financing helps customers scale their businesses by up to seven times within a year. With a dedicated team of 12, Creizer is positioned to capture a significant market opportunity, given that SMEs make up 99% of online sellers in Latin America.\n\nTheir simple process allows sellers to apply for credit quickly: fill out a contact form, connect sales accounts to a predictive engine, and receive a proposal within 72 hours. Flexible conditions mean no fixed payments; instead, sellers pay based on their sales performance, ensuring that if business slows, payments do too.\n\nCreizer is not just about financing; it’s about empowering a new generation of online entrepreneurs in LATAM. This approach has already earned trust from over 500 sellers in Mexico who praise the company for its flexibility and personalized service.\n\nAs a forward-thinking player in the fintech space, Creizer aims to redefine how online sellers can access capital, enabling their dreams to become a reality. Check out their services and more about their mission at [Creizer’s official website](https://www.creizer.com/).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/9e35e589eef8bb0d97fb0924626b91811e1fbd0a.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191107Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=5adc276dff5aeb414f1cbf27e65ecca107ea063d4af301d80bc959dc41b6f50a",
    "social_links": [
        "https://www.linkedin.com/company/creizer",
        "https://twitter.com/CreizerMX",
        "https://www.facebook.com/CreizerMX",
        "https://www.crunchbase.com/organization/creizer"
    ],
    "logo_path": "data/logos\\Creizer_logo.png"
}