{
    "links": "https://www.ycombinator.com/companies/culdesac",
    "name": "Culdesac",
    "headline": "We build cities for people, not cars.",
    "batch": "S18",
    "description": "Culdesac designs, builds, and manages walkable communities. \r\n\nCuldesac is a real estate developer and property manager. We build neighborhoods that embrace community, open space, and mobility. We offer residential units at a variety of price points integrated with local retail, commercial uses, and open space for nature and public plazas.\r\n\nOur communities prioritize biking, walking, and transit over cars and parking. We partner with leading mobility companies to deliver convenient and affordable transportation services. This creates a vibrant urban lifestyle without the need for a private vehicle.\r\n\nRead more here > https://medium.com/culdesac/introducing-culdesac-3fbfe7c4219c",
    "activity_status": "Active",
    "website": "http://culdesac.com",
    "founded_date": 2018.0,
    "team_size": 32.0,
    "location": "Tempe, AZ",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:real-estate; industry:housing; industry:proptech; industry:climatetech",
    "founders": [],
    "status": true,
    "generated_description": "Culdesac is reshaping the concept of urban living with a mission that’s refreshingly straightforward: \"We build cities for people, not cars.\" Founded in 2018 and nurtured by Y Combinator's Batch S18, the company operates from Tempe, Arizona, and has a team of 32 dedicated employees.\n\nAt its core, Culdesac is a real estate developer and property manager focused on creating walkable neighborhoods that prioritize community and environmental sustainability. The idea is simple: by reducing dependence on cars and enhancing accessibility for pedestrians and cyclists, they foster vibrant spaces where people can connect and thrive.\n\n**What They Offer:**\nCuldesac's developments integrate residential units at diverse price points with local businesses, open spaces, and community amenities. The flagship project, Culdesac Tempe, stands out as the first of its kind—offering various living options that accommodate different lifestyles and budgets. Apartment units include features such as direct access to shared courtyards, BBQ areas, and lush landscaping, all designed to enhance community living.\n\n**Innovative Mobility Solutions:**\nOne of the standout aspects of living at Culdesac is the robust mobility services integrated into the community. Residents benefit from free rides on public transit, access to scooters, and car-sharing options. Essentially, they can enjoy urban life without the burden of car ownership.\n\n**Community Engagement:**\nCuldesac doesn’t just build homes; they create a lifestyle. The community features local retailers and restaurants to cover all essential needs, all within a short walking distance. Events such as barbeques, fitness classes, and social gatherings prompt a lively community vibe, with nearly every aspect of Culdesac crafted to encourage interaction and connection.\n\n**Current and Future Projects:**\nAfter successfully launching in Tempe, they’re looking to expand their model to cities like Atlanta, suggesting that cultural shifts toward pedestrian-friendly spaces could soon become a nationwide phenomenon.\n\nTo learn more about living in a place that embraces community and mobility, check out their website at [Culdesac.com](http://culdesac.com) and explore the possibilities of urban living done right. \n\nIn summary, Culdesac is not just another real estate venture; it's a bold attempt to redefine urban spaces for the better—making them more livable, sustainable, and connected.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/e1bdf5295d5b12ba34bf4ccb4ac87c24e628f2d4.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191108Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=2252185cb01eb61497298fd5e6168d0451b1e27a9ba3412e45193fa2d791e0d8",
    "social_links": [
        "https://www.linkedin.com/company/liveculdesac/",
        "https://twitter.com/culdesac",
        "https://www.facebook.com/LiveC",
        "https://www.crunchbase.com/organization/culdesac-f070",
        "https://github.com/culdesac-labs"
    ],
    "logo_path": "data/logos\\Culdesac_logo.png"
}