{
    "links": "https://www.ycombinator.com/companies/curacel",
    "name": "Curacel",
    "headline": "AI Powered Insurance Infrastructure",
    "batch": "W22",
    "description": "AI-powered API to sell & process insurance across emerging markets globally. At Curacel, we leverage artificial intelligence to make it faster and more efficient to access and manage insurance. Our solutions help insurers reduce fraud, streamline claims, and improve customer experience. We are building the infrastructure to make insurance work seamlessly for the next billion users across Africa and other emerging markets.",
    "activity_status": "Active",
    "website": "https://curacel.co",
    "founded_date": 2019.0,
    "team_size": 30.0,
    "location": "Lagos, Nigeria",
    "group_partner": "Brad Flora",
    "group_partner_yc": "https://www.ycombinator.com/people/brad-flora",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:saas; industry:b2b; industry:api; industry:insurance",
    "founders": [
        {
            "name": "Henry Mascot, Founder",
            "description": "Henry, co-founder/CEO of Curacel, has transformed insurance in emerging markets powering big insurers in 10 markets like AXA. Raised $3.5 million from top VCs including YCombinator, Tencent, and Google. He leads product and sales at Curacel. Henry holds an Engineering degree. Previously, he spearheaded growth at 54Gene (YCW19) in the early days, securing major partnerships. At AmplifyPay, he led sales strategies, acquiring significant banking clients, laying the groundwork for Curacel.",
            "linkedin": "https://www.linkedin.com/in/henrymascot"
        },
        {
            "name": "John Flash Dada, Founder",
            "description": null,
            "linkedin": "https://www.linkedin.com/in/john-dada-16235b57/"
        }
    ],
    "status": true,
    "generated_description": "Curacel is an innovative company based in Lagos, Nigeria, that aims to revolutionize the insurance industry through AI-powered infrastructure. Founded in 2019 and a proud member of the Y Combinator Batch W22, Curacel has positioned itself at the intersection of technology and financial services, particularly in emerging markets.\n\n### Mission and Operations\nThe core mission of Curacel is to provide a seamless, AI-driven insurance experience. They started with an AI-powered API designed to sell and process insurance services across global emerging markets. By leveraging artificial intelligence, Curacel's solutions help insurers reduce fraud, streamline claims processing, and enhance customer experiences.\n\nCuracel focuses on building an infrastructure that aims to make insurance accessible and efficient for the next billion users in Africa and beyond. Their offerings include products like Curacel Grow, which enables businesses to manage and distribute insurance faster; Curacel Health, which processes health claims and detects fraud; Curacel Pay for automating payment operations; and Curacel Auto for streamlining auto insurance processes.\n\n### Team and Structure\nCuracel operates with a team of about 30 dedicated employees, led and supported by Brad Flora as their Group Partner. This relatively lean team structure allows for nimble operations and a focused approach to scaling their technology and services.\n\n### Industry Impact\nThe company is categorized under several tags including fintech, SaaS, B2B, API, and insurance, highlighting its multifaceted approach to transforming financial services. Their clients include various sectors, from logistics to fintech and healthcare, demonstrating their versatile solutions tailored to the needs of diverse industries.\n\n### Recruitment and Community\nCuracel is also committed to nurturing new talent through its Graduate Trainee and Undergraduate Internship programs, further solidifying its roots in the local ecosystem while boosting innovation in the insurance sector.\n\nThrough its suite of products and focus on increasing operational efficiency, Curacel is not just participating in the insurance revolution–it’s steering it. They are a part of a broader narrative where technology meets essential services in Africa, paving the way for a more inclusive financial future.\n\nFor more information about their offerings and how to get involved, you can visit their website: [curacel.co](https://curacel.co).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/399b2b4524c89fbf8596fe3aa8d7d076bc31200e.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191109Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=b59b69cf28837d5ccadf1a2c87c91e7f7892885d9c32cbd0c8fed4481e942bc4",
    "social_links": [
        "https://www.linkedin.com/company/curacel/",
        "https://twitter.com/curacel"
    ],
    "logo_path": "data/logos\\Curacel_logo.png"
}