{
    "links": "https://www.ycombinator.com/companies/curebase",
    "name": "Curebase",
    "headline": "End-to-end clinical trial execution built on cutting-edge software.",
    "batch": "S18",
    "description": "Curebase is reinventing decentralized clinical trials to help the vast majority of potential patients that currently cannot access clinical research. Curebase’s vision is that any patient, no matter where they are located, should be able to participate in clinical trials at home and with their own doctors. This is made possible through a unique suite of tools, including all-in-one eClinical software and virtual research sites, designed to engage patients in clinical trials across all settings, be it at home, at their local clinic, or other places in their community.",
    "activity_status": "Active",
    "website": "http://www.curebase.com",
    "founded_date": 2017.0,
    "team_size": 118.0,
    "location": "San Francisco",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:healthcare; location:san-francisco-bay-area",
    "founders": [],
    "status": true,
    "generated_description": "Curebase is a forward-thinking healthcare company revolutionizing the clinical trial landscape with its pioneering approach to decentralized trials. Founded in 2017 and backed by Y Combinator (Batch S18), Curebase emerged with a mission: to make clinical trials accessible for every patient, regardless of their location. Imagine a world where anyone can participate in research without having to travel to a clinical site. That's the vision driving this San Francisco-based company.\n\nAt the heart of Curebase's offering is an all-in-one eClinical software platform that integrates cutting-edge technology to facilitate seamless, end-to-end clinical trial execution. This AI-native platform is designed to engage participants from the comfort of their homes, allowing them to connect with healthcare providers and clinical teams without the usual barriers.\n\nThe company has cultivated a robust ecosystem of tools, providing solutions like ePRO/eCOA (electronic Patient Reported Outcomes/electronic Clinical Outcomes Assessments), eConsent, and a unified participant experience that encapsulates the entire process from prescreening to data submission. With over 118 team members, they are not just about technology; they're passionate about creating a user-friendly environment that blends clinical research with everyday healthcare.\n\nIt's impressive to see the impact they’ve made. In a short span, Curebase has engaged 250,000 participants, collected over 8.4 million data points, and powered 83 studies—all while ensuring high compliance rates. They are trusted by leading industry teams and are actively driving advancements in research methodologies.\n\nCurebase isn’t just a tech company; it’s a bridge between patients and the future of medicine. They believe that the digital age should empower patients to take part actively in trials and transform data collection, simplifying the complex processes often associated with clinical research.\n\nIf you're curious to learn more, you can check out their offerings on their [website](http://www.curebase.com). Whether you're a patient wanting to participate or a researcher looking for innovative solutions, Curebase is leading the charge toward a more inclusive clinical research environment.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/a4608d711bf959d0658f1e30d270db9e32ce4f8e.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191109Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=5be4ca661c336a6566414e3c34e0e6febf3e778070a45d353dc4835b712bf91c",
    "social_links": [
        "https://www.linkedin.com/company/curebase/mycompany/",
        "https://twitter.com/CurebaseDCT/",
        "https://www.crunchbase.com/organization/curebase",
        "https://github.com/Curebase"
    ],
    "logo_path": "data/logos\\Curebase_logo.png"
}