{
    "links": "https://www.ycombinator.com/companies/curo",
    "name": "Curo",
    "headline": "Electric fleets park and charge anywhere with Curo",
    "batch": "F24",
    "description": "Curo enables electric vehicle fleets to lease EV chargers. We do this by providing a standardized process so that any EV charger owner can host a fleet, such as an office building overnight when their employees go home.\r\n\nOwners of EV chargers get <15% usage after paying hundreds of thousands of dollars to install, and fleets are rapidly trying to electrify yet charging is a huge bottleneck. Curo increases revenue 5x for charger owners and enables fleets to electrify instantly, at a fraction of the cost. \r\n\nWe're live across 5 states, having grown 50% MoM for the past 6 months. Curo is already backed by investors like Blue Bear, Not Boring, Slow and Eniac.",
    "activity_status": "Active",
    "website": "https://www.curocharging.com/",
    "founded_date": 2023.0,
    "team_size": 6.0,
    "location": "San Francisco",
    "group_partner": "Pete Koomen",
    "group_partner_yc": "https://www.ycombinator.com/people/pete-koomen",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:transportation; industry:energy; industry:automotive; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Kieran White, CEO & Co-Founder",
            "description": "Kieran is the CEO and Co-Founder of Curo. He has deep expertise in eMobility after spending 2 years launching Tesla's Model 3 footprint in Europe, supporting one of the largest electric fleets in building their distributed operations. At Lasso Loop, Kieran led the business through Series A, alongside building the logistics and rollout process for their fleets material collection.",
            "linkedin": "https://linkedin.com/in/kieran-luke-white"
        },
        {
            "name": "Andrew Porter, CTO & Co-Founder",
            "description": "Andrew is the Co-founder and CTO of Curo. A self-taught developer with bachelor’s degrees in Mathematics and Economics from Occidental College, he has built marketplace platforms and integrated AI solutions from the ground up. Previously, he developed blockchain-based platforms focused on environmental solutions and worked on blockchain projects at DraftKings.",
            "linkedin": "https://linkedin.com/in/andrew--porter/"
        }
    ],
    "status": true,
    "generated_description": "**Curo: Powering the Future of Electric Fleets**\n\nFounded in 2023 and nestled in the heart of San Francisco, Curo is emerging as a game-changer in the electric vehicle (EV) charging landscape. Their mission is straightforward yet ambitious: enable electric fleets to park and charge anywhere with ease.\n\nInitially, Curo set out to address a glaring issue: EV charger owners see a mere 15% utilization of their expensive infrastructure. Meanwhile, fleets are in a frenzy to electrify, but charging availability remains a significant bottleneck. Curo's solution? A standardized platform that allows any EV charger host—think office buildings where employees park overnight—to lease their chargers to fleets. This innovative approach doesn’t just solve a widespread problem; it significantly increases the revenue potential for charger owners by an impressive factor of five.\n\nCuro's platform, dubbed the \"Virtual Depot,\" operates as the first dedicated network aimed at connecting commercial fleets with accessible, cost-effective EV charging solutions. In a few short months, Curo has already expanded into five states and is experiencing rapid growth, boasting a 50% month-over-month increase. Their commitment to transforming the electric transportation sector has garnered backing from notable investors, including Blue Bear and Eniac.\n\nWith a lean team of six employees and a former Y Combinator accelerator experience, Curo is making its mark in the burgeoning startup ecosystem. They offer fleets the opportunity to tap into an exclusive network of charging sites—affordably and conveniently. The platform promises short, medium, and long-term solutions designed to meet fleet needs, ensuring minimal disruption.\n\nAs we shift towards a more electrified future, Curo stands at the forefront, not just facilitating charging but actively participating in the sustainability movement. Curo’s system promises not just operational convenience; it also leverages existing EV charging infrastructure, effectively reducing costs and inefficiencies across the board.\n\nIf you’re interested in the smooth electrification of your fleet or looking to optimize the usage of your EV charging infrastructure, Curo might just be the partner you need. You can learn more at [Curo's website](https://www.curocharging.com/).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/2c82dcb9647a2ded70f975403f819b02eb7371b2.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191109Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=ab741dd90dcce09f28646b40bebb32ffa04dd6a1a9f345ba3513d44abb72e3f2",
    "social_links": [
        "https://www.linkedin.com/company/curocharging/"
    ],
    "logo_path": "data/logos\\Curo_logo.png"
}