{
    "links": "https://www.ycombinator.com/companies/cutr",
    "name": "CUTR",
    "headline": "The marketplace for wood manufacturing",
    "batch": "W22",
    "description": "Look around you - everything you see that was made with wood a designer conceived and then a woodworker has made. Most of the time, something went painfully wrong.\r\n\n60% of the $1.4T global woodworking market is serviced by small businesses with inefficient, manual processes - Cutr is digitising their workflow. This market is massive, chaotic and surprisingly manual. Woodworkers are mostly offline, hard to find and even harder to vet. They need help with critical back-of-house jobs like quoting and capacity planning. Customers have no idea where to find them and need help asking the right questions & providing the right info to get their job produced correctly. \r\n\nCutr solves discovery, pricing, payments and workflow for the woodworking market. \r\n\nOur users simply upload a file, accept an instant quote, and get their parts delivered. To make that possible we do the heavy lifting: filechecks, automated quoting, matchmaking, creating job packages, tracking changes & updates, logistics and payments.\r\n\nCutr saves time, cuts costs and ensures quality with a smooth workflow.",
    "activity_status": "Active",
    "website": "https://www.cutr.ai/",
    "founded_date": 2021.0,
    "team_size": 22.0,
    "location": "Amsterdam, Netherlands",
    "group_partner": "Brad Flora",
    "group_partner_yc": "https://www.ycombinator.com/people/brad-flora",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:marketplace; industry:manufacturing",
    "founders": [
        {
            "name": "Oscar Peppitt, Founder",
            "description": "Oscar is CEO of Cutr where he focuses on setting company strategy, speaking to customers and finding the world's best talent to join the team. Oscar was early-Uber, launching the transport business in APAC, UberEATS across APAC and EMEA, and even worked on self-driving cars for a bit.  He is focused on figuring out how to get to a zero carbon future through economics for the environment.",
            "linkedin": "https://www.linkedin.com/in/oscar-peppitt-99965331/"
        },
        {
            "name": "Rodny Heemskerk, Founder",
            "description": "Rodny is a trained industrial designer and CAD/CAM engineer. He previously built a successful manufacturing business. Rodny knows Cutr’s industry inside out – from workflow issues to machining solutions to how to close deals. At Cutr he is responsible for the sales and ops teams and working with the product team to turn his experience into scalable solutions.\n\n2013 Lean Startup Machine\n2015 Succesfull campaign at Kickstarter (US)\n2017-2020 Accelerator program - Entrepreneurs Organization (EO)",
            "linkedin": "https://www.linkedin.com/in/rodny-heemskerk-ab75b513/"
        },
        {
            "name": "Jasper Mittelmeijer, Founder",
            "description": "Jasper built the procedural furniture generator & CNC controller that started Cutr. He started writing code in high school and wrote his first 3D render engine at 15. At Cutr, Jasper is responsible for the engineering & design team. Because of his broad skillset and experience he excels at getting new product shipped fast.",
            "linkedin": "https://www.linkedin.com/in/jaspermittelmeijer/"
        }
    ],
    "status": true,
    "generated_description": "### Overview of CUTR\n\n**Company Name**: CUTR  \n**Founded**: 2021  \n**Location**: Amsterdam, Netherlands  \n**Team Size**: 22 employees  \n**Y Combinator Batch**: W22  \n**Website**: [cutr.ai](https://www.cutr.ai)  \n**Group Partner**: Brad Flora\n\n### Mission and Problem Addressed\n\nCUTR positions itself as the marketplace for wood manufacturing. It originated from the observation that almost everything made from wood begins with a designer's concept, only to often falter in the hands of woodworkers. A staggering 60% of the $1.4 trillion global woodworking market is served by small businesses that rely on inefficient, manual processes. This market is characterized by its chaos, with woodworkers largely offline, difficult to locate, and even harder to vet.\n\nCUTR aims to digitize the workflow for woodworkers. Their mission is to streamline the entire process of discovery, pricing, payments, and workflow in woodworking. CUTR provides critical support in back-office functions like quoting and capacity planning while assisting customers in understanding the right questions to ask.\n\n### How CUTR Works\n\nThe platform simplifies the manufacturing process down to a few straightforward steps:\n1. **Upload a Design**: Users simply upload their design file.\n2. **Instant Quoting**: The system offers an instant quote after performing necessary checks.\n3. **Production Management**: Once the quote is accepted, CUTR manages the entire manufacturing process, including logistics and payments.\n4. **Delivery**: Final products go through quality checks before being delivered to the customer.\n\n### Key Features\n\n- **Efficiency**: CUTR saves users time and reduces costs by automating workflows.\n- **Quality Assurance**: Users benefit from a network of trusted manufacturing partners and quality control practices.\n- **Transparent Pricing**: Customers receive clear and detailed pricing breakdowns.\n- **Flexible Production**: Whether it’s prototyping or mass production, CUTR caters to various needs, ensuring timely deliveries.\n\n### Clientele\n\nCUTR serves a diverse clientele that includes:\n- Interior builders\n- Contractors\n- Design & build firms\n- Product designers\n- Custom woodworkers\n\nAmong the notable partnerships, companies like **Unyoked** leverage CUTR to optimize their operations in the competitive European market. Various customer testimonials echo CUTR's reliability and efficiency in delivering high-quality, tailored solutions.\n\n### Conclusion\n\nIn a sector laden with inefficiencies, CUTR stands out by digitizing and streamlining wood manufacturing processes. It connects designers with skilled woodworkers, ensuring that quality and efficiency are prioritized. Whether you're an interior designer looking for bespoke pieces or a contractor needing reliable support, CUTR is positioned to make woodworking more accessible and efficient for all players in the industry.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/dd30cef5d3d9da729f141396732e7b45644344c6.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191110Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=c31d130821d160f4111dff8cb8e2a0820de98ab63f3780a96bef85c4f5b8c17d",
    "social_links": [
        "https://www.linkedin.com/company/cutr"
    ],
    "logo_path": "data/logos\\CUTR_logo.png"
}