{
    "links": "https://www.ycombinator.com/companies/cyble",
    "name": "Cyble",
    "headline": "Cyble is one of the fastest-growing threat intelligence provider.",
    "batch": "W21",
    "description": "Cyble provides the fastest and most comprehensive coverage across adversaries, infrastructure, exposure, weaknesses, and targets.\r\n\nCyble empowers governments and enterprises to safeguard their citizens and infrastructure by providing critical intelligence in a timely manner and enabling rapid detection, prioritization, and remediation of security threats through its advanced capabilities for data analysis, expert insights, and automated processes\r\n\nHeadquartered in Alpharetta, Georgia, and with offices in Australia, Malaysia, Singapore, Dubai, Saudi Arabia and India, Cyble has a global presence. To learn more about Cyble, visit www.cyble.com.",
    "activity_status": "Active",
    "website": "https://cyble.com/",
    "founded_date": 2019.0,
    "team_size": 260.0,
    "location": "Atlanta, GA",
    "group_partner": "Michael Seibel",
    "group_partner_yc": "https://www.ycombinator.com/people/michael-seibel",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:artificial-intelligence; industry:saas; industry:security",
    "founders": [
        {
            "name": "Beenu Arora, Founder",
            "description": "As the co-founder and CEO of Cyble, Inc., I lead a global team of experts and innovators who leverage AI-powered actionable threat intelligence to help our clients manage cyber risks. We specialize in gathering intelligence from the Deepweb, Darkweb, and Surface Web, and delivering timely and relevant insights and solutions to our customers. Our vision is to make the digital world safer and more secure for everyone.",
            "linkedin": "https://www.linkedin.com/in/beenu-arora-b5068412/"
        },
        {
            "name": "Manish Chachada, Founder",
            "description": "Seasoned finance professional with over 15+ years multinational experience in finance/accounting, business management, international corporate structuring, global tax strategies, fund raising. (Consulting experience - KNAV P.A. (member Allinial Global firms), Controller (Mitchell Group USA, LLC, Executive finance  - IT Service - Rolta International",
            "linkedin": "https://www.linkedin.com/in/manish-r-chachada/"
        }
    ],
    "status": true,
    "generated_description": "**Company Overview: Cyble**\n\nFounded in 2019 and headquartered in Alpharetta, Georgia, Cyble has quickly emerged as one of the fastest-growing providers of threat intelligence. This startup, a member of Y Combinator's W21 batch, now boasts a team of over 260 employees across several global locations, including Australia, Malaysia, Singapore, Dubai, Saudi Arabia, and India.\n\n**Mission and Services:**\n\nCyble's mission is straightforward yet critical: to empower governments and enterprises to protect their citizens and assets from cyber threats. They achieve this by delivering timely intelligence that allows for swift detection, prioritization, and remediation of security vulnerabilities. Their advanced capabilities stem from a combination of data analysis, expert insights, and automated processes.\n\nCyble offers a range of innovative products and services designed to cater to various sectors (B2B and B2C), enabling clients to manage online risks effectively:\n\n1. **Cyble Vision**: An award-winning cyber threat intelligence platform that enhances security through real-time insights.\n2. **Cyble Hawk**: Tailored specifically for federal bodies, it secures sensitive assets against cyber threats.\n3. **AmIBreached**: A tool for individuals and organizations to identify their exposure to the dark web.\n4. **Odin**: The most advanced internet-scanning tool aimed at real-time threat detection.\n\nBeyond these, Cyble's offerings encompass attack surface management, vulnerability management, brand intelligence, and more.\n\n**Recognition and Alliances:**\n\nCyble has received accolades from several industry authorities. They have been recognized in Gartner’s Hype Cycle for Cyber Risk Management and named a notable vendor in Forrester's Extended Threat Intelligence Service Providers Landscape as of Q1 2025. They were also designated as a leader in the Frost & Sullivan Cyber Threat Intelligence Radar for 2024.\n\n**Looking Ahead:**\n\nAs digital threats become more sophisticated and pervasive, Cyble is poised to remain at the forefront of cybersecurity by continuously evolving its services and leveraging artificial intelligence. Their commitment to proactive defense mechanisms is shaping a safer cyber landscape for both enterprises and individuals.\n\nTo learn more about Cyble and explore its solutions, visit [Cyble's official website](https://cyble.com/).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/883b8705b923e7ff3cb120ba19df957ce4f82118.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191110Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=2d72f2eb609e50fdc9f39d689b3926afc4d5aaadb9352197d248ad94010c87d5",
    "social_links": [
        "https://www.linkedin.com/company/14707748/",
        "https://twitter.com/cybleglobal",
        "https://www.facebook.com/cybleau",
        "https://www.crunchbase.com/organization/cyble"
    ],
    "logo_path": "data/logos\\Cyble_logo.png"
}