{
    "links": "https://www.ycombinator.com/companies/daily",
    "name": "Daily",
    "headline": "Conversational Voice and Multimodal AI built with Open Source",
    "batch": "W16",
    "description": "Daily is real-time voice, video, and AI for developers. Our cross-platform SDKs and global infrastructure enable ultra-low latency, highest quality experiences for developers building real-time voice and video AI agents. Our platform also supports integration of traditional voice/video calls, in addition to AI agent experiences.",
    "activity_status": "Active",
    "website": "https://daily.co",
    "founded_date": 2016.0,
    "team_size": 62.0,
    "location": "San Francisco",
    "group_partner": "Michael Seibel",
    "group_partner_yc": "https://www.ycombinator.com/people/michael-seibel",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:developer-tools; industry:open-source; industry:ai; industry:ai-assistant; location:san-francisco-bay-area",
    "founders": [],
    "status": true,
    "generated_description": "### Daily: Revolutionizing Real-Time Communication\n\n**Overview**  \nFounded in 2016 and hailing from Y Combinator's Batch W16, Daily is a San Francisco-based startup that's making waves in the AI and real-time communication space. With a dedicated team of 62 employees, Daily aims to empower developers to create conversational voice and multimodal AI experiences using their open-source tools.\n\n**Mission**  \nAt its core, Daily is about harnessing **real-time voice, video, and AI** technologies. Their mission is clear: They want to democratize access to powerful communication tools by enabling developers to build sophisticated AI agents while ensuring low latency and high-quality experiences. This mission aligns beautifully with today’s demand for instant, seamless communication.\n\n**Key Offerings**  \nDaily’s platform is centered around their **cross-platform SDKs** and a robust global infrastructure that supports a range of functionalities:\n- **Voice and Video APIs**: Integrate traditional voice and video calling into applications.\n- **Pipecat**: An open-source orchestration framework designed for real-time voice and multimodal AI agents, enabling developers to build scalable AI solutions.\n- **Daily Bots**: A cloud service that allows for the deployment of AI agents using Daily's powerful infrastructure.\n  \nThe company boasts an infrastructure optimized for speed and reliability, with a median first-hop latency of just 13ms and over 75 points of presence globally. This means developers can deliver top-notch video and audio experiences, no matter where users are located.\n\n**Security and Compliance**  \nDaily places heavy emphasis on security. They offer comprehensive data protection measures, including end-to-end encryption and compliance with best practice regulations such as HIPAA and GDPR.\n\n**Notable Partnerships**  \nDaily has established strong relationships with major players in the tech industry, partnering with companies like Accenture, NVIDIA, Google, and Pinterest. These collaborations highlight Daily’s credibility and effectiveness in enhancing real-time communication capabilities for developers.\n\n**Community and Open Source Contributions**  \nAs an active member of the W3C's WebRTC Working Group, Daily is committed to advancing open standards and open-source technologies. The company not only supports projects like Pipecat but also contributes to initiatives like Mediasoup and GStreamer, thereby fostering innovation in the developer community.\n\n**Impressive Testimonials**  \nKey stakeholders in various organizations have praised Daily's efficiency and flexibility in enhancing their communication infrastructure. From fast deployments to straightforward documentation, Daily has cemented its reputation as a developer-friendly solution.\n\n### Summary  \nWith a clear mission to elevate developer tools for real-time voice and video communications, Daily is carving a niche in the AI landscape. Their commitment to open-source, security, and developer empowerment makes them a significant player to watch in the evolving tech space. If you’re looking to integrate powerful communication technologies, 🏗️ **get started** with Daily for free at [daily.co](https://daily.co).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/1d3e193b0241065d64c99f1f19dc95b580bd9f95.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191111Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=f80f8edc42c8763982f1d4cffcc5c67ebf0517ad8dcbcf5546448749417c2a05",
    "social_links": [
        "https://www.linkedin.com/company/dailyco/",
        "https://twitter.com/trydaily",
        "https://www.crunchbase.com/organization/pluot",
        "https://github.com/daily-co"
    ],
    "logo_path": "data/logos\\Daily_logo.png"
}