{
    "links": "https://www.ycombinator.com/companies/dailybot",
    "name": "DailyBot",
    "headline": "AI Assistant and Chat Add-ons for Work",
    "batch": "S21",
    "description": "DailyBot is a chat AI Assistant and Workflow Automation platform. It takes chat to a new level by providing automation and chat use-cases that are underserved by the current messaging platforms. It helps users get more things done within the chat to be more efficient and save time.\r\n\nThe new generation lives in chat. Remote/hybrid teams use DailyBot to automate daily workflows like stand-ups, team check-ins, give kudos to teammates or even to create their own chat-automation for their back-office with no-code/low-code in an environment similar to Amazon Alexa. DailyBot offers numerous add-ons to make the work experience better.\r\n\nDailyBot provides a ChatGPT assistant and a unique AI Workflows tool. Users can build multi-step workflows that use AI to generate content, process information and run actions.\r\n\nDailyBot is cross platform and already available for Slack, Microsoft Teams, Google Chat and Discord.\r\n\nKeywords: chatops chat-ops async nocode assistant workflow automation developer",
    "activity_status": "Active",
    "website": "https://www.dailybot.com/",
    "founded_date": 2021.0,
    "team_size": 12.0,
    "location": "Pereira, Colombia",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:artificial-intelligence; industry:developer-tools; industry:saas; industry:collaboration; industry:ai-assistant",
    "founders": [
        {
            "name": "Mauricio Morales, Founder",
            "description": "CEO at DailyBot\n\nMauricio has been building internet products for over 15y. MsC and MBA. He has been involved in product management at different startups and helped build tech companies that have scaled rapidly and were acquired. He's lived in 3 countries.",
            "linkedin": "https://www.linkedin.com/in/maomorales/"
        },
        {
            "name": "Sergio Florez, Founder",
            "description": "CTO at DailyBot — leading and building unique conversational experiences for asynchronous work. \n\nSergio is a computer science engineer, MSc in data science and passionate entrepreneur, with talent and more than 8y of experience building digital businesses. He's in the search of the ideation of disruptive business models as agents of change and success.",
            "linkedin": "https://www.linkedin.com/in/xergioalex/"
        }
    ],
    "status": true,
    "generated_description": "**DailyBot: Your AI-Powered Workplace Assistant**\n\nFounded in 2021 as part of Y Combinator's Batch S21, DailyBot is redefining how teams collaborate in the age of remote and hybrid work. Based in Pereira, Colombia, and equipped with a dynamic team of 12, DailyBot is on a mission to elevate workplace communication through its chat AI Assistant and workflow automation tools.\n\n### Why DailyBot?\n\nIn a world where communication primarily happens in chat, DailyBot stands out by filling gaps that are often neglected by existing messaging platforms. It transforms everyday chat into a productive workspace by automating tasks like daily stand-ups, team check-ins, and even giving kudos to teammates. With DailyBot, users can create no-code or low-code workflows that simplify administrative back-office operations. \n\n### Powerful Features\n\nDailyBot isn't just another chat tool—it's a robust platform that integrates seamlessly across popular chat platforms like Slack, Microsoft Teams, Google Chat, and Discord. Key features include:\n\n- **AI Workflows**: Create multi-step processes that leverage AI to generate content and automate tasks.\n- **Smart Reports and Team Analytics**: Get AI-generated summaries of team activities, helping you track progress and bottlenecks.\n- **Kudos and Recognition Tools**: Foster positive team culture by celebrating accomplishments and recognizing effort.\n\n### A Platform for Everyone\n\nNo matter your role, DailyBot aims to make you feel heard and supported. From marketing teams tracking campaign performance to developers managing code release workflows, its versatility is appealing. For those in charge of people operations, it even includes wellness check-ins to track the team's mood and wellbeing.\n\n### Customer-Centric Approach\n\nDailyBot has garnered praise from users, who extol its ability to reduce unnecessary meetings and enhance team alignment—regardless of time zones. Testimonials highlight how the platform has improved productivity and made workflows smoother across teams.\n\n### The Road Ahead\n\nAs DailyBot continues to evolve, its commitment to automating and enhancing workplace interaction will only deepen. With ambitions to build the largest library of workflows for modern teams, the future looks bright.\n\nIf you're looking to streamline your team's communication and automate routine tasks, visit [DailyBot](https://www.dailybot.com/) and see how it can transform the way you work.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/a82b36322898a04824a44666c9592a4aed9a3f46.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191110Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=866dc36a39480b77f89fdfcf3d899387ea0532b20347163f8566fb38b1530af3",
    "social_links": [
        "https://www.linkedin.com/company/dailybot/",
        "https://twitter.com/dailybot",
        "https://www.facebook.com/HeyDailybot",
        "https://www.crunchbase.com/organization/dailybot"
    ],
    "logo_path": "data/logos\\DailyBot_logo.png"
}