{
    "links": "https://www.ycombinator.com/companies/darmiyan",
    "name": "Darmiyan",
    "headline": "Early detection of Alzheimer's disease",
    "batch": "S17",
    "description": "Novel quantitative virtual microscopy for early detection of Alzheimer's disease from non-invasive MRI.",
    "activity_status": "Active",
    "website": "https://www.darmiyan.com/",
    "founded_date": null,
    "team_size": 8.0,
    "location": "San Francisco",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:artificial-intelligence; industry:machine-learning; industry:health-tech; industry:diagnostics; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Padideh Kamali-Zare, Founder",
            "description": "I'm Padideh — brain enthusiast, data driven, and one of the brains behind Darmiyan. After my Ph.D. in Biological Physics from KTH (Sweden) and postdoc in computational neuroscience at NYU (New York), I dove headfirst into the startup world to tackle a cause close to my heart: Alzheimer's. I've been on a mission to outsmart this disease since my grandmother's diagnosis. BrainSee is our first product that catches Alzheimer's early and give people a fighting chance.",
            "linkedin": "https://www.linkedin.com/in/padideh-kamali-zare-353b2617/"
        },
        {
            "name": "Kaveh Vejdani, Founder/Chief Medical and Technology Officer",
            "description": null,
            "linkedin": "https://www.linkedin.com/in/kaveh-vejdani-5369561"
        }
    ],
    "status": true,
    "generated_description": "**Darmiyan: Pioneering Early Alzheimer’s Detection**\n\nDarmiyan is focused primarily on the early detection of Alzheimer’s disease, applying advanced medical imaging technology to identify neurodegenerative changes as early as possible. Originating from novel quantitative virtual microscopy for non-invasive MRI scans, the company leverages decades of neuroscience research and artificial intelligence to transform how we understand brain health.\n\nFounded in **2017**, Darmiyan is a proud member of Y Combinator's Batch S17 and is headquartered in **San Francisco** with a dedicated team of 8. They have a strategic partnership with **nan** and are making strides in the health-tech sector, particularly in diagnostics related to Alzheimer’s.\n\n### What They’re Doing\n\nDarmiyan’s flagship product, **BrainSee**, has recently received De Novo FDA approval, marking a significant milestone in its journey. This AI-powered software processes brain MRI scans to quantify subtle changes in brain tissue that might indicate the onset of Alzheimer's. The company’s mission emphasizes:\n\n- **Precision Diagnosis**: Utilizing AI and advanced medical imaging to provide accurate, non-invasive tests.\n- **Accessibility**: Making brain health testing widely available and easily integrated into clinical practice.\n- **Proactive Monitoring**: Allowing for early intervention by tracking changes over time.\n\nDarmiyan aims to tackle the significant healthcare challenge posed by dementia by offering a suite of tests centered around Alzheimer's detection and monitoring patient response to interventions. Their approach ensures high accuracy while remaining non-invasive, which is crucial for patient comfort and widespread usage.\n\n### Team and Technology\n\nThe Darmiyan team consists of neuroscientists, data scientists, and healthcare experts who are all passionate about advancing brain health. Their groundbreaking methodology focuses on assessing the “space in between” brain cells, providing insights that bridge normal health and neurodegenerative diseases.\n\n### Future Directions\n\nAs the healthcare landscape evolves, Darmiyan is positioned to revolutionize diagnostics around Alzheimer’s and similar conditions. Their use of machine learning and imaging technology could potentially reshape treatment protocols, leading to better patient outcomes. Their commitment to early detection and intervention stands to impact millions suffering from brain diseases, aiming to shift the paradigm of brain health from reactive to proactive.\n\nIn summary, Darmiyan is not just a tech company; they are on a mission to change lives through better brain health understanding and proactive detection. Keep an eye on them; they’re doing something significant in the health-tech space. For more information, visit their [website](https://www.darmiyan.com/).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/e05b51e8fa338be24b3f3aeec346c878d0811b16.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191111Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=b72268f4379597aedddca94cb1d499c83f295749c9790218f985a4bd4794364d",
    "social_links": [
        "https://www.crunchbase.com/organization/darmiyan"
    ],
    "logo_path": "data/logos\\Darmiyan_logo.png"
}