{
    "links": "https://www.ycombinator.com/companies/darsel",
    "name": "Darsel",
    "headline": "Chatbot teaching K12 math in developing countries",
    "batch": "W22",
    "description": "Darsel is a AI-powered math education chatbot which is designed to supplement K12 education systems in resource-constrained environments. Darsel allows students to practice math questions & do their homework through platforms like SMS, WhatsApp and Facebook Messenger.",
    "activity_status": "Active",
    "website": "http://darsel.tech",
    "founded_date": 2021.0,
    "team_size": 5.0,
    "location": null,
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:ai-enhanced-learning; industry:education; industry:elearning; industry:nonprofit",
    "founders": [
        {
            "name": "Abdulhamid Haidar, Founder",
            "description": "MIT (Math, CS, Econ); McKinsey (3yrs, Middle East); Harvard (MPA International Development); Stanford (MBA)",
            "linkedin": "https://www.linkedin.com/in/abdulhamid-haidar/"
        }
    ],
    "status": true,
    "generated_description": "### Darsel: Revolutionizing Math Education in Developing Countries\n\n**Overview:**  \nFounded in 2021 and part of Y Combinator's W22 batch, Darsel is a non-profit organization harnessing the power of AI to enhance math education for K12 students in developing countries. By providing a chat-based learning experience through widely-used messaging platforms like SMS, WhatsApp, and Facebook Messenger, Darsel makes quality education accessible to students in resource-constrained environments.\n\n**Mission:**  \nDarsel aims to tackle the challenges faced by over a billion students who can't reliably access traditional video-based educational platforms due to limited internet connectivity or device access. Their mission is clear: Utilize AI to reverse learning losses and significantly improve educational outcomes in low- and middle-income countries.\n\n**Key Features:**\n- **Accessibility:** The Darsel chatbot requires minimal data, making it usable on any mobile device, without the need for apps or extensive loading times. This level of accessibility ensures that even the most underserved students can engage with math content effectively.\n- **Personalized Learning:** Darsel leverages AI algorithms to provide a tailored learning experience, adapting to each student’s unique skill level. This personalized approach includes hints, explanations, and feedback to bridge learning gaps.\n- **Comprehensive Math Library:** With over 500,000 unique math questions aligned with local curriculums, Darsel supports teachers by providing data insights on student performance and automating homework grading.\n\n**Current Impact:**\n- **Engagement:** More than 120,000 students have interacted with Darsel, collectively solving over 170 million math questions.\n- **Partnerships:** Darsel collaborates with educational institutions to equip teachers with valuable insights into their students' skills and needs, thus enhancing the overall learning environment.\n\n**Team and Support:**  \nDarsel operates with a compact team of five, driven by a passion for education. Their support system is both human and automated—ensuring students receive help when needed, while data-driven reporting empowers teachers to address classroom challenges effectively.\n\n**Get Involved:**  \nWhether you're an educator looking for innovative tools, a student eager to enhance your learning, or a supporter wanting to contribute to the cause, Darsel offers various avenues for engagement, including donations and partnerships.\n\nDarsel isn't just another education tech initiative; it's a powerful step towards unlocking human potential in the world’s resource-limited communities. To learn more, visit [Darsel.tech](http://darsel.tech).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/def7ae0cd649dc5b3e3b47bae121bf3b3d58a9b1.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191112Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=33f33215f7f7940267fdd5cf6c96bc7c4c8d03c7257a048b5c7272a318456b36",
    "social_links": [
        "https://www.facebook.com/DarselTech/"
    ],
    "logo_path": "data/logos\\Darsel_logo.png"
}