{
    "links": "https://www.ycombinator.com/companies/dashworks",
    "name": "Dashworks",
    "headline": "Your team's intelligent start page.",
    "batch": "W20",
    "description": "Dashworks is where work begins. Where all your documents, messages, tickets, and other knowledge scattered across your company's apps and people come together seamlessly. And where you and your team can get on the same page, and get things done.",
    "activity_status": "Active",
    "website": "http://www.dashworks.ai",
    "founded_date": 2019.0,
    "team_size": 9.0,
    "location": "San Francisco",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:saas; industry:ai; location:san-francisco-bay-area",
    "founders": [],
    "status": true,
    "generated_description": "### Dashworks: Your Team's Intelligent Start Page\n\n**Founding Story**  \nDashworks was founded in 2019 and emerged from Y Combinator's W20 batch. Based in the bustling heart of San Francisco, the company has a small but proficient team of 9 individuals dedicated to transforming how teams access information.\n\n**Mission**  \nThe mission of Dashworks is clear: to serve as the intelligent start page for your team. Essentially, it's the place where all scattered documents, messages, and knowledge tools converge so that everyone can be on the same page and, importantly, get things done efficiently.\n\n**What Does Dashworks Do?**  \nDashworks allows teams to harness the power of AI for seamless workplace communication and knowledge management. Through a single search interface, it enables users to pull up vital information and answers, cutting down on time spent sifting through different applications. It’s like having a personal assistant but on a grand scale.\n\n1. **Unified Search**: The platform connects all your apps, consolidating knowledge bases to answer questions in real-time. No more toggling between a dozen tabs; everything is at your fingertips.\n  \n2. **Customization**: Users can create and customize AI assistants tailored to specific tasks, whether it's onboarding new hires or answering product-related questions.\n  \n3. **Integrations**: Dashworks offers robust integration capabilities to work within your existing tools, such as Slack, thereby feeding into existing workflows without disruption.\n   \n4. **Security**: With enterprise-grade security (SOC-2 Type 2, GDPR, and HIPAA compliance), Dashworks ensures that your data stays safe while avoiding redundancy and security risks typically associated with traditional enterprise search solutions.\n\n**Client Testimonials**  \nDashworks has received glowing endorsements from its users. Thomas Mancuso, Director of Product Partnerships, noted an improvement in onboarding times and overall responsiveness of sales and support teams. Similarly, users highlighted the tool's accuracy and capability to surface information, significantly reducing the effort spent on repetitive inquiries.\n\n**The Competitive Edge**  \nCompared to traditional enterprise search systems, which often require extensive setup and delay in data syncs, Dashworks thrives with its immediate search capabilities and ease of onboarding. This agility makes it an attractive choice for companies looking to streamline processes without the typical hurdles.\n\n**Join the Movement**  \nWith a growing client base that includes both hypergrowth startups and Fortune 500 companies, Dashworks is shaping up to be a significant player in the SaaS market. If you're looking to eliminate information silos and enhance team productivity, checking out Dashworks could be the right move.\n\n**Discover More**  \nTo explore Dashworks further, visit their website at [Dashworks.ai](http://www.dashworks.ai) and see firsthand how it can revolutionize your team's workflow. Ready to transform how your team accesses knowledge? Get a demo today!",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/bae1ed6b7cc5c23d0fff4417c147d153b506d321.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191112Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=4700f5a81e988269a4036bfecf8f28c55a75e7b8097a344810e81e7baac6af95",
    "social_links": [
        "https://www.linkedin.com/company/dashworksai/",
        "https://twitter.com/DashworksAI",
        "https://www.crunchbase.com/organization/dashworks"
    ],
    "logo_path": "data/logos\\Dashworks_logo.png"
}