{
    "links": "https://www.ycombinator.com/companies/dataglade",
    "name": "Dataglade",
    "headline": "The smart way to research stocks.",
    "batch": "W23",
    "description": "Dataglade is the smart way to research stocks. Our AI generates clear analyses and financial models for any public company, and our fundamental data fulfills almost every research need. We save investors hours every day by eliminating the need to manually dig through financial filings. Customers trust our reports because every number is backed by citations to our proprietary financial data warehouse. We inform $1+ billion of trades every day, and we’re just getting started. Check us out at dataglade.com.",
    "activity_status": "Active",
    "website": "https://dataglade.com",
    "founded_date": 2022.0,
    "team_size": 2.0,
    "location": "New York",
    "group_partner": "Jared Friedman",
    "group_partner_yc": "https://www.ycombinator.com/people/jared-friedman",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:generative-ai; industry:saas; industry:finance; industry:ai; location:new-york",
    "founders": [
        {
            "name": "Ash Rai, Founder",
            "description": "Ash is the Co-Founder and CEO of Dataglade. Before Dataglade, Ash founded a hedge fund from his freshman dorm room at Vanderbilt and grew it to $1 million AUM before turning 20. He was the country’s youngest-ever registered investment advisor. While running the fund, Ash was cut off from his university’s Bloomberg Terminal for overuse, so he built his own solution. Ash graduated early from Vanderbilt University with degrees in Economics, History, and Classics.",
            "linkedin": "https://linkedin.com/in/ashraioff"
        },
        {
            "name": "Patrick Higgins, Founder",
            "description": "Patrick grew up tinkering with whatever computers he could get his hands on, building apps with his friends, and learning lessons from trying to trade the stock market. Now, he's building Dataglade.",
            "linkedin": null
        }
    ],
    "status": true,
    "generated_description": "### Dataglade: The Smart Way to Research Stocks\n\n**Overview**  \nDataglade emerged on the scene in 2022, fueled by a mission to revolutionize stock research using AI. Based in New York and operating with a lean team of two, this startup is creating ripples in the fintech industry by automating stock analysis and significantly cutting research time for investors.\n\n**Core Offering**  \nAt its core, Dataglade harnesses the power of artificial intelligence to generate clear analyses and robust financial models for any public company. This eliminates hours of tedious manual labor spent sifting through financial filings. By providing solid fundamental data, Dataglade tackles nearly every research need an investor might encounter and backs its reports with citations from its proprietary financial data warehouse. The result? Trustworthy insights that inform over $1 billion in trades daily.\n\n**Key Features**  \n- **Comprehensive Data:** Dataglade provides extensive financial data on more than 48,000 public companies, covering key aspects from fundamentals to ratios and multiples.\n- **Market Intelligence:** Institutions, hedge funds, and wealth managers rely on Dataglade for up-to-date market insights and decisions.\n- **Real-Time Tracking:** With features like live options flow and insider trade monitoring, users can get immediate updates on market movements.\n- **Customizable Research:** Investors can easily customize their data related to internal business intelligence, enhancing the reliability of insights.\n\n**Innovative Solutions**  \nDataglade isn't just rehashing what’s already available; it’s introducing innovative tools like GladeAI, which dives deeper into companies and generates analyses based on real-time data. From technical stock screening to generating complex business analyses (think SWOT or BCG), users have a comprehensive suite of tools to elevate their investment research.\n\n**About the Founders and Team**  \nFounded as part of Y Combinator’s Winter 2023 batch, Dataglade is driven by Jared Friedman, a Group Partner at Y Combinator. The team’s small size may seem modest, but it allows for agile moves and rapid innovation in a fast-paced industry.\n\n**Conclusion**  \nIf you're tired of traditional stock research methods that eat up your time, Dataglade offers a fresh, efficient alternative. With its AI-driven insights and solid backing by a reliable data foundation, it’s poised to become an indispensable tool for savvy investors everywhere.\n\nFor more information, check out their website at [dataglade.com](https://dataglade.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/a911abe92ba8ebece3f59fbf1b3c6b7a871a7bdc.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191113Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=4af16774e7433f6fa1c22ac859ca1193d5f81c6ab738c45e526f2f215968bd68",
    "social_links": [
        "https://linkedin.com/company/dataglade",
        "https://twitter.com/dataglade",
        "https://facebook.com/dataglade"
    ],
    "logo_path": "data/logos\\Dataglade_logo.png"
}