{
    "links": "https://www.ycombinator.com/companies/deako",
    "name": "Deako",
    "headline": "We make beautiful connected light switches that allow you to controlâ\u0080¦",
    "batch": "W16",
    "description": "Deako believes that everyone should be able to enjoy the wonderful experiences of smart lighting, regardless of their budget.  We invented the modular light switch, giving homeowners maximum flexibility to customize and upgrade their systems, at any time, in minutes and without turning off the power. Deakoâ\u0080\u0099s beautiful designer switches are like nothing else on the market today.  Deako Smart Lighting has been named the #1 Smart Lighting Control System by TecHome Builder, Top 25 Innovative IOT Companies by Entrepreneur, featured in â\u0080\u009cI Want That!â\u0080\u009d episode on DIY Network, Top 50 most promising Startups by Bloomberg, and â\u0080\u009cChanging The Way Builders Spec Light Switchesâ\u0080\u009d - Builder Magazine.",
    "activity_status": "Active",
    "website": "https://www.deako.com",
    "founded_date": null,
    "team_size": 11.0,
    "location": "Seattle, WA",
    "group_partner": "Michael Seibel",
    "group_partner_yc": "https://www.ycombinator.com/people/michael-seibel",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:iot; industry:home-automation; location:seattle",
    "founders": [],
    "status": true,
    "generated_description": "Deako is a Seattle-based innovative company that's transforming how we think about lighting in our homes. Their mission is straightforward: create beautiful, connected light switches that allow anyone to enjoy the wonders of smart lighting, no matter their budget. This isn't just about aesthetics; it's about making smart lighting accessible to all.\n\nFounded during the Y Combinator Batch W16, Deako introduced the modular light switch—a game changer that allows homeowners to customize and upgrade their systems in seconds, without needing to shut off the power. This approach has garnered significant recognition, including being named the #1 Smart Lighting Control System by TecHome Builder and a spot in the Top 25 Innovative IoT Companies by Entrepreneur.\n\nTheir product lineup includes smart switches, dimmers, and motion sensors, all designed with the user in mind. Each switch is easy to install, effectively turning anyone into their own electrician. This practicality is crucial; it empowers homeowners to control the ambiance of their space without complicated setups or the extra cost of professional installation.\n\nWith a team of 11 employees and notable backing from investor Michael Seibel, Deako is well-positioned in a rapidly growing market. They've shipped over 30 million products, installed in 300,000 homes and counting. Each month sees approximately 10,000 new homes equipped with Deako's smart lighting solutions, reflecting a growing consumer base enamored with their user-friendly designs.\n\nDeako has not only made waves in terms of functionality; they bring style to the table, too. Their designer switches inject a touch of elegance into any home—a stark contrast to traditional options that often lack visual appeal. Plus, Deako's products can be managed via popular platforms like Google Home and Amazon Alexa, making it easy to integrate smart technology into daily routines.\n\nBeing a standout in the industry, Deako is tagged with the key themes of IoT and home automation, signaling their commitment to future-proofing homes. The company invites inquiries through their website, where prospective customers and builders can learn more about their offerings and get assistance with installations.\n\nTo summarize, Deako isn't just selling light switches—they're simplifying the way we interact with our environments, injecting a bit of beauty and a ton of user-friendliness into our homes. If you're looking to upgrade your lighting, Deako seems to be the smart choice to consider. Check them out at [Deako.com](https://www.deako.com).",
    "logo": "/logos/medium/missing.png",
    "social_links": [
        "https://www.crunchbase.com/organization/deako",
        "https://github.com/DeakoLights"
    ]
}