{
    "links": "https://www.ycombinator.com/companies/deanslist",
    "name": "DeansList",
    "headline": "Enterprise SaaS software helping schools manage administrative andâ\u0080¦",
    "batch": "IK12",
    "description": "DeansList is a new gradebook that helps schools assess critical â\u0080\u009csoft skillsâ\u0080\u009d like perseverance, diligence, leadership, teamwork and grit. With DeansList, schools capture data on classroom behavior and disciplinary interventions, and use that data to define metrics and goals for student improvement. They also benefit from powerful analytics enabling them to see behavior trends emerge and constantly improve school culture.",
    "activity_status": "Active",
    "website": "http://www.deanslistsoftware.com",
    "founded_date": null,
    "team_size": 11.0,
    "location": "New York",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "location:new-york",
    "founders": [],
    "status": true,
    "generated_description": "**DeansList: Transforming Educational Administration**\n\nDeansList is a New York-based startup that's shaking up how schools manage their administrative tasks. Initially conceived as an innovative gradebook, DeansList focuses on assessing critical soft skills—like perseverance, leadership, and teamwork—in addition to standard academic metrics. With the rise of educational technology, DeansList has pivoted to become a comprehensive Enterprise SaaS solution designed to streamline school operations and improve student outcomes.\n\n### The Mission\nDeansList aims to help schools harness the power of data to foster student improvement and enhance school culture. They provide tools for tracking classroom behavior, managing disciplinary actions, and visualizing trends over time through powerful analytics. Essentially, it’s about turning data into actionable insights that guide educators and bolster student success.\n\n### Key Features\n1. **Behavior & Culture Management**: DeansList equips schools with tools to track student behavior and promote a positive school culture. This includes implementing interventions like Positive Behavioral Interventions and Supports (PBIS) and restorative justice practices.\n\n2. **Family Engagement**: They believe strong communication with families is crucial. Their platform allows schools to send automated messages—whether emails or texts—that can be translated into different languages, ensuring all families stay informed.\n\n3. **Attendance & Absenteeism Solutions**: By taking a holistic approach, DeansList helps identify students who may need additional support to ensure they arrive on time, every day.\n\n4. **Referral Management & Incident Tracking**: The platform simplifies the referral process for behavioral incidents to help students quickly return to the classroom, while documenting everything in one centralized system.\n\n5. **Powerful Reporting Tools**: DeansList allows for the easy generation of custom reports on student performance, helping to keep families involved in their child's education without the hassle of traditional mail merges.\n\n### Company Highlights\n- **Founded**: In the current unspecified year, DeansList is a proud member of Y Combinator's Batch IK12, indicating its commitment to education-focused innovation.\n- **Team Size**: A focused team of 11 professionals is driving the mission forward, showcasing the startup's belief in efficiency and purpose over sheer size.\n- **Promotions**: DeansList is currently offering a Pre-Thanksgiving promotion, giving schools the chance to save 25% off the first two years if they sign up before November 25th.\n\nFor education administrators looking for a modern solution to age-old problems, the DeansList platform stands out as a capable ally. From capturing critical data to facilitating communication and enhancing school culture, it's designed to empower schools to run more smoothly and effectively.\n\nTo learn more about their offerings or to schedule a demo, visit [DeansList](http://www.deanslistsoftware.com). \n\nIn an era where education is as much about social-emotional learning as academic achievement, DeansList is set to play an important role in shaping the future of educational administration.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/9f367f4dc00e3dc2681b6861485bec2ba43e8d1c.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191114Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=f95ad50cd35b7f5bf9c163c1132830f77859035a3afa18a2cbccc2e5a0803f8f",
    "social_links": [
        "https://www.crunchbase.com/organization/deanslist-inc"
    ],
    "logo_path": "data/logos\\DeansList_logo.png"
}