{
    "links": "https://www.ycombinator.com/companies/deed",
    "name": "Deed",
    "headline": "Making it easy for employees to donate and volunteer with good causes.",
    "batch": "S21",
    "description": "Deed makes it easy for employees to donate to their favorite charities and volunteer with great causes at work. Companies like Airbnb and Stripe use Deed to increase employee retention and happiness. Since launching publicly in January, we’ve increased our logo count by 4X with companies like DoorDash, Box, and Lob. We did this by making sure employees have the same awesome experience using their workplace giving tool as they do with their favorite consumer apps.",
    "activity_status": "Active",
    "website": "https://www.joindeed.com",
    "founded_date": 2016.0,
    "team_size": 40.0,
    "location": "New York",
    "group_partner": "Michael Seibel",
    "group_partner_yc": "https://www.ycombinator.com/people/michael-seibel",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:saas; industry:b2b; industry:enterprise; location:new-york",
    "founders": [
        {
            "name": "Deevee Kashi, Founder",
            "description": "At age 24, I helped lead a top hospitality brand, generating $14 million in revenue a year before expanding the brand around the world. Feeling empty after ten years in the industry, I sought to give back but found it incredibly difficult to volunteer. It was then that I had the crazy idea of making doing good both easy and exciting!",
            "linkedin": "https://www.linkedin.com/in/deeveekashi"
        },
        {
            "name": "Aske Ertmann, Founder",
            "description": "More than 15 years experience architecting and building applications for MM and enterprise organizations. Former partner at web agency and release manager of Neos CMS. Applying these skills to build tools that help people do good.",
            "linkedin": "https://www.linkedin.com/in/aske-ertmann-816a07101/"
        },
        {
            "name": "Steve Liu, Founder",
            "description": "Prior to Deed, I spent 17 years creating new products, trading new markets, and generating over $120M of revenue at Merrill, Lehman, and Jefferies. Also built a boutique investment bank from scratch in the aftermath of the financial crisis. Stanford MS (Management Science and Engineering) and BA (Economics).",
            "linkedin": "https://www.linkedin.com/in/stevenliu98/"
        }
    ],
    "status": true,
    "generated_description": "### Deed: Making Good Deeds Easy\n\n**Overview:**\nFounded in 2016 and hailing from Y Combinator's Batch S21, Deed is a company on a mission: they aim to simplify the process for employees to donate and volunteer for causes they care about. With their headquarters in New York City, their growing team of 40 is dedicated to enhancing social impact in the workplace by transforming how organizations engage their employees in charitable activities.\n\n**Vision and Strategy:**\nFrom its inception, Deed has focused on creating a user-friendly platform that feels as intuitive as popular consumer apps. This approach resonates with high-profile clients like Airbnb, Stripe, DoorDash, and Box, contributing to an impressive 4X increase in logos since their public launch in January. They're not just about facilitating donations; they’re fostering a robust culture of volunteerism and philanthropy right at the workplace.\n\n**Core Offerings:**\nDeed’s platform addresses multiple facets of social impact, including:\n- **Employee Engagement:** The platform boasts top-notch UX/UI, making contributing to good causes enjoyable and meaningful.\n- **Workplace Philanthropy:** With access to over two million vetted nonprofits, employees can easily engage with worthy organizations.\n- **Employee Volunteering:** Deed curates vast opportunities for volunteering based on employees' interests, ensuring a tailored experience.\n- **Environmental, Social, and Corporate Governance (ESG):** Companies can lead in ESG efforts with valuable data-driven insights.\n\nTheir comprehensive solutions extend to disaster relief efforts and corporate grants, proving they're serious about tackling modern challenges in corporate social responsibility (CSR).\n\n**Why Companies Love Deed:**\nUnder the stewardship of group partner Michael Seibel, Deed is all about ease of use combined with robust support—offering 24/7 assistance to address issues swiftly. Their platform integrates seamlessly with tools like Slack and Teams, enhancing accessibility for all employees.\n\n**Join the Movement:**\nDeed encourages businesses to be part of a growing community that prioritizes social impact. Their commitment to user experience means that organizations can design their social impact programs to align with their specific values and goals, all while fostering community and engagement among their employees.\n\nSo, are you ready to embrace a purpose-driven workplace? Take a look at Deed's platform and discover how easy it is to make a difference. Let’s make good deeds a daily practice! [Visit Deed here](https://www.joindeed.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/4ef30097e0d0c648ac2387d4ad6d1da321fd3ec1.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191115Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=ab1f55b7545583876ba3118c6c957cff8179da8683f35432b3a7275f628051ba",
    "social_links": [
        "https://www.linkedin.com/company/joindeed",
        "https://twitter.com/join_deed",
        "https://www.facebook.com/joindeednow",
        "https://www.crunchbase.com/organization/deed-2",
        "https://github.com/joindeed"
    ],
    "logo_path": "data/logos\\Deed_logo.png"
}