{
    "links": "https://www.ycombinator.com/companies/delegasi",
    "name": "Delegasi",
    "headline": "Automated accounting service for small businesses in Indonesia",
    "batch": "S22",
    "description": "Financial statements are definitely a hassle for business owners. Many accounting software are available, yet not everyone has the capability to operate them.\r\n\nAmidst this problem, Delegasi dares to provide a solution. As the first virtual financial manager in Indonesia, we assist SMB owners in putting together their financial statements and business analysis. By simply uploading receipts and bank statements, owners will receive their financial statements and business analyses with guaranteed accuracy, allowing them to make well informed financial decisions.",
    "activity_status": "Active",
    "website": "https://delegasi.co/",
    "founded_date": 2022.0,
    "team_size": 8.0,
    "location": "Bandung, Indonesia",
    "group_partner": "Gustaf Alstromer",
    "group_partner_yc": "https://www.ycombinator.com/people/gustaf-alstromer",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:saas; industry:b2b",
    "founders": [
        {
            "name": "Okky Pratama, Founder",
            "description": "Okky has an MBA from MIT, and he was Senior VP of Business & Operations for Modal Rakyat (Fazz Financial Group) before starting Delegasi. He is passionate about finance and analytics, he even reads financial statements as a hobby.",
            "linkedin": "https://www.linkedin.com/in/yudha-okky-pratama-84217331/"
        },
        {
            "name": "Ans Syuhada, Founder",
            "description": "Anshorimuslim (Ans) is technology and social cause enthusiast. Ans has wide range experiences from product development to data intensive system and leadership role. He also actives to nurture tech community and giving talks. His recent deck and writings can be seen on https://speakerdeck.com/ans4175 - https://ans4175.dev/\n\nHe is on quest helping Food and Beverages Industries understand their Finance Statement better for scaling their company better. Business Intelligence for everyone.",
            "linkedin": "https://linkedin.com/in/anshorimuslim"
        }
    ],
    "status": true,
    "generated_description": "**Delegasi: Simplifying Accounting for Small Businesses in Indonesia**\n\nFounded in 2022 and based in Bandung, Indonesia, Delegasi operates as the first virtual financial manager specifically dedicated to small and medium-sized businesses (SMBs). While many accounting software options promise efficiency, they often fall short due to user complexity. Delegasi tackles this head-on, offering a streamlined automated accounting service that minimizes hassle for business owners who often grapple with financial statements. \n\nThe mission? To make accounting straightforward. Business owners simply upload their receipts and bank statements, and Delegasi handles the rest. They ensure accurate financial statements and analyses, empowering owners to make informed decisions without the usual stress of accounting tasks.\n\n**What They Offer:**\nDelegasi’s services include:\n- **Professional Financial Reporting**: This encompasses essential documents like profit and loss statements, balance sheets, and cash flow reports. They feature analyses that help businesses identify revenue channels and understand their financial health.\n- **Business Analysis Services**: They provide tools for analyzing profitability across sales channels, break-even analysis, and even product mix strategies. \n\n**Why It Matters:** \nBuilt with the needs of SMBs in mind, Delegasi is particularly useful for those businesses experiencing fluctuating finances—where owners need accurate, detailed reports but lack the budget for a full-time accountant. This makes it indispensable for entrepreneurs looking to focus on scaling their operations rather than getting lost in the numbers.\n\n**Recognition and Support**: \nDelegasi is part of Y Combinator’s Batch S22, which speaks volumes about their potential and innovation. With a small dedicated team of just eight, they are led by a capable group partner, Gustaf Alstromer, and they’ve already gained trust from over 400 SMB owners.\n\n**Getting Started**: \nPrices start at Rp999,000 per month, which comes with a 25% discount based on monthly revenue. Their engaging approach and easy-to-use platform aim to transform the daunting task of financial management into a seamless experience.\n\nFor small business owners in Indonesia who wish to improve their accounting practices, Delegasi presents a compelling solution that combines automation with comprehensive financial reporting. Curious to learn more? Check out their website at [delegasi.co](https://delegasi.co/) and take the first step toward clearer financial management.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/6bd0655ba87b6e378a43756dc082da0ae69ba65c.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191116Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=6abbe92de2cb9cec0a1634388b79e76d24ee1296fc8bf247dd95d1d1c17d67f0",
    "social_links": [
        "https://www.linkedin.com/company/delegasi/"
    ],
    "logo_path": "data/logos\\Delegasi_logo.png"
}