{
    "links": "https://www.ycombinator.com/companies/democracyos",
    "name": "DemocracyOS",
    "headline": "Online space for deliberation, policy making and democraticâ\u0080¦",
    "batch": "W15",
    "description": "DemocracyOS is an online space for deliberation and voting on political proposals. It is a platform for a more open and participatory government.The software aims to stimulate better arguments and come to better rulings, as peers.",
    "activity_status": "Active",
    "website": "http://www.democracyos.org",
    "founded_date": null,
    "team_size": 1.0,
    "location": "Buenos Aires, Argentina",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:civic-tech; industry:govtech",
    "founders": [],
    "status": true,
    "generated_description": "**DemocracyOS: A Fresh Approach to Civic Engagement**\n\nDemocracyOS is a bold venture rooted in Buenos Aires, Argentina, aiming to reshape the way we engage with democratic processes. Founded during the Y Combinator Winter 2015 batch, this innovative platform lives by a simple yet profound mission: to create an online space for deliberation, policy-making, and democratic participation. \n\nAt its core, DemocracyOS provides a digital forum where individuals can collaboratively discuss and vote on political proposals. The goal? To cultivate an environment where better arguments lead to better decisions, reflecting a more participatory government. \n\nThe platform is particularly appealing to those frustrated by traditional political channels. It's tagged with \"civic-tech\" and \"govtech,\" signaling its commitment to enhancing civic participation through technology.\n\nOne of the key features of DemocracyOS is its user-friendly design, making it accessible for anyone interested in voicing their opinions on pressing issues. Its versatility accommodates various languages, broadening its appeal and usability across different demographics.\n\nAlthough the company currently operates with a lean team of just one employee, it continues to generate significant interest in its mission. Users can explore more about this platform and its offerings at [DemocracyOS](http://www.democracyos.org).\n\nIn a world where many feel disconnected from their governments, DemocracyOS stands out as a tool that seeks to bridge that gap, transforming passive citizens into active participants in shaping their societies. It’s a glimpse into what future democracies could look like—more inclusive, transparent, and genuinely representative of the people's will.",
    "logo": "/logos/medium/missing.png",
    "social_links": [
        "https://www.crunchbase.com/organization/democracyos-5751",
        "https://github.com/DemocracyOS/democracyos"
    ]
}