{
    "links": "https://www.ycombinator.com/companies/deskimo",
    "name": "Deskimo",
    "headline": "Workspaces on demand, paid by the minute.",
    "batch": "S21",
    "description": "Join the hybrid work revolution! \r\n\nFind professional workspaces near your home and escape the home office without wasting time on commuting. \r\n\nDeskimo connects the hybrid corporate workforce with quality workspaces all over Singapore, Indonesia, Malaysia, Hong Kong and the UAE.\r\n\n1) Deskimo is an asset-light extension of a corporate office\r\nMost companies are looking to downsize their office leases and move to a hybrid work model to save costs and provide employees greater flexibility post pandemic.\r\n\n2) Deskimo is an instant access pass to all workspaces\r\nOne tap in the Deskimo app generates a QR code, which gets scanned at the front desk to check in and check out. No memberships, no registrations, no long-term commitments needed.\r\n\n3) The hybrid work revolution is only getting started\r\nEmployees have no intention to go back to the office 5 days / week post pandemic. This will transform the way companies manage their hybrid workforce and decentralized workplace. Deskimo is at the center of this transformation.",
    "activity_status": "Active",
    "website": "http://www.deskimo.com",
    "founded_date": 2021.0,
    "team_size": 12.0,
    "location": "Singapore, Singapore",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:marketplace; industry:saas; industry:proptech",
    "founders": [
        {
            "name": "Christian Mischler, Founder",
            "description": "Previously co-founded & scaled GuestReady (the leading short-term rental management company in Europe and the Middle East), HotelQuickly (at the time the leading last-minute hotel booking  app in Asia-Pacific), Foodpanda (Asia's largest food delivery company outside of China). \n\nPreviously an In-House Consultant at Credit Suisse.\n\nFurther: Swiss national; double master's degrees from the University of St.Gallen (HSG) and CEMS; Captain at the Swiss Military Intelligence; visited 100+ countries.",
            "linkedin": "https://www.linkedin.com/in/christianmischler"
        },
        {
            "name": "Raphael Cohen, Founder",
            "description": "Past experience:\n- Head of Asia, Rocket Internet\n- Co-Founder, Gobee.bike (2nd largest bike sharing operator outside of China)\n- Co-Founder, HotelQuickly (largest last-minute hotel booking app in Asia-Pacific)\n- Managing Director, Foodpanda Vietnam (Asia's largest food delivery company outside of China)\n\nFurther:\n- French national\n- Lived in Singapore, Hong Kong, China, Vietnam, Canada, France\n- Speaks 7 languages and visited 100+ countries\n- Bachelor of Commerce, University of Toronto",
            "linkedin": "https://www.linkedin.com/in/raphaelc/"
        }
    ],
    "status": true,
    "generated_description": "**Deskimo: Your Flexible Workspace Solution**\n\nFounded in 2021 and based in Singapore, Deskimo emerged from the need for flexible work environments that cater to our post-pandemic reality. The mission is simple yet transformative: “Workspaces on demand, paid by the minute.” Think of it as a casual stroll into the future of work—no long-term leases, no cumbersome paperwork, just seamless access to professional workspaces.\n\nDeskimo operates in key Asian and Middle Eastern cities like Singapore, Indonesia, Malaysia, Hong Kong, and the UAE. It serves as an innovative link between the corporate workforce and quality workspaces, ushering in an era where companies are downsizing expansive office footprints to adapt to hybrid work models. For many organizations, it’s a move towards cutting costs and giving employees the flexibility they crave.\n\n### How Deskimo Works\n\nAt the heart of Deskimo is an app that transforms the way you find and book workspaces. Here’s how it works:\n1. **Instant Access:** Users open the app, tap to generate a QR code, and simply scan it at the workspace entrance. There’s no need for membership fees, registrations, or waiting lists—just find a spot, check in, and get to work.\n   \n2. **Flexibility on Your Terms:** No more paying for unused office time. With Deskimo, you’re only billed for the minutes you occupy a workspace. This unique pay-per-minute model ensures that you have complete control over your expenses.\n\n3. **Learning as You Go:** The hybrid work revolution is still evolving, and Deskimo is positioned right at its nexus. Employees don’t intend to revert to the traditional nine-to-five office grind, and companies are reevaluating how they manage dispersed teams. Deskimo is critical in this shift toward decentralization.\n\n### A Lean Operation\n\nDeskimo exemplifies an asset-light business model. It allows organizations to enhance their operational capabilities without the burdens of physical real estate. With a dedicated team of just 12 and backing from Y Combinator (Batch S21), they’ve streamlined how businesses can manage their workspace needs efficiently and effectively.\n\nTheir current offerings span various services, including:\n\n- Flexible office spaces\n- Private office rentals\n- Meeting room access and management tools for enterprises\n\n### The Future of Workspaces\n\nAs workspace needs change, Deskimo is at the forefront, ready to adapt. Their approach emphasizes simplicity and consumer empowerment in an era that embraces remote and hybrid work. Whether you are a freelancer, a corporate employee, or a startup seeking innovative solutions, Deskimo makes finding the right workspace as easy as a tap on your phone.\n\nIn the next phase of work, it’s all about choice, flexibility, and convenience—the same values that Deskimo stands for. Visit their website at [Deskimo.com](http://www.deskimo.com) and explore how you can redefine your work environment today.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/75ae772b13a401c1d785f08da7ea4062401eb490.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191118Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=ebc2c2dc7269e419a92c5c12a5db0489ecf75ac898e525f5145f307886cc1f4f",
    "social_links": [
        "https://www.linkedin.com/company/72052483",
        "https://www.facebook.com/deskimoapp",
        "https://www.crunchbase.com/organization/deskimo"
    ],
    "logo_path": "data/logos\\Deskimo_logo.png"
}