{
    "links": "https://www.ycombinator.com/companies/devyce",
    "name": "Devyce",
    "headline": "The global mobile network for business.",
    "batch": "S22",
    "description": "Devyce is building the global mobile network for business. Right now, we give your employees a business phone number in an app, on their personal phone, instantly, alongside a portal for analytics, management and integrations.\r\n\nNick has a background in recruiting and real estate and understands the pain points these industries face with hybrid working, while Ed has a solid tech background including a CS degree from Cambridge. Because of our relationship with a mobile network operator, we have the unfair advantage that we will actually become a mobile network, unlike other SaaS VoIP providers.\r\n\nhttps://devyce.com/",
    "activity_status": "Active",
    "website": "https://devyce.com",
    "founded_date": 2020.0,
    "team_size": 20.0,
    "location": "London, United Kingdom",
    "group_partner": "Aaron Epstein",
    "group_partner_yc": "https://www.ycombinator.com/people/aaron-epstein",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:telecommunications",
    "founders": [
        {
            "name": "Nick Browne, Founder",
            "description": "Nick has spent the last 4 years working in telecoms as VP of Business Development for Stour Marine a UK Mobile Network Operator. Before entering the technology space he spent several years in finance at Deutsche Bank and HSBC.",
            "linkedin": "https://www.linkedin.com/in/nicholas-browne-a8a829147/"
        },
        {
            "name": "Edward Clayton, Founder",
            "description": "I'm a developer from Lancashire, England. I've lived in London for the last 20 years or so, except for some overseas stints (I'm currently in Kazakhstan). I've a knack for interesting technical solutions, but besides that, I enjoy skiing and wine.\n\nMost of my career has involved C#, which I guess is what comes from working in finance in London.",
            "linkedin": "https://www.linkedin.com/in/ed-clayton-1b8b7b27/"
        }
    ],
    "status": true,
    "generated_description": "### Devyce: The Future of Business Communication\n\n**Overview**  \nFounded in 2020 and based in London, Devyce is carving out a niche in the telecommunications space with its mission to create \"the global mobile network for business.\" It's an ambitious endeavor led by co-founders Nick and Ed, who bring varied strengths—Nick’s background in recruiting and real estate and Ed’s strong technical foundation from a Computer Science degree at Cambridge. Having gone through Y Combinator's Batch S22, Devyce is positioned to leverage its unique relationship with a mobile network operator to evolve beyond mere software, striving to become an actual mobile network, setting it apart from traditional SaaS VoIP solutions.\n\n**What They Do**  \nDevyce offers a streamlined service that equips employees with a business phone number delivered directly through an app on their personal devices. This setup allows businesses to maintain professionalism without sacrificing employee convenience. The platform includes robust analytics and management tools so that businesses can gauge performance and make data-driven decisions. Their offerings focus on enhancing communication efficiency, allowing teams to work seamlessly, whether in-office or remotely.\n\n**Key Features**  \n1. **AI-Powered Functionality**: Live call analytics and seamless CRM integration help businesses better understand their communications.\n2. **Flexibility**: The platform allows easy user management, with simple add and remove functions to keep pace with fluctuating team sizes. \n3. **No Contracts**: Devyce provides flexibility with subscription plans that have no long-term commitments, minimizing risk for businesses trying out the service.\n4. **Global Coverage**: Users can secure numbers from around the world while keeping personal contact details private.\n\n**Plans and Pricing**  \nDevyce provides several pricing tiers tailored to different business needs:\n- **Solo Plan**: £10.50/month, offering a single user with two numbers.\n- **Teams Plan**: £25/user/month, designed for larger groups needing additional features like team management and call analytics.\n- **Enterprise Solutions**: Customized pricing for teams of 50 or more, with bespoke integrations available.\n\n**Customer Insights**  \nDevyce isn’t just about technology; it’s built around real-world needs. Testimonials highlight how the platform simplifies workflows, saves administrative time, and enhances team collaboration. Users appreciate the ease of setup and the team's responsive customer service.\n\n**Conclusion**  \nDevyce is not just another communication tool; it's a complete solution aimed at improving business productivity through smarter calls. For companies navigating the hybrid work landscape, Devyce offers a compelling proposition with its blend of technological innovation and operational flexibility. If you're seeking a straightforward yet powerful communication system for your business, Devyce is worth exploring further.\n\n**Website**: [devyce.com](https://devyce.com)",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/1f73e615e8b7b1e10da761d1cb4dd03556d6fea8.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191119Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=712754c5a6ee2ac2d2cd13f648339da88d09cba9c43d30d39e28f35a86ea8943",
    "social_links": [
        "https://www.linkedin.com/company/devyce",
        "https://twitter.com/DevyceUK",
        "https://www.facebook.com/DevyceUK/"
    ],
    "logo_path": "data/logos\\Devyce_logo.png"
}