{
    "links": "https://www.ycombinator.com/companies/dex",
    "name": "Dex",
    "headline": "Dex is a personal CRM that reminds you to keep in touch with theâ\u0080¦",
    "batch": "S19",
    "description": "Dex is a personal CRM that reminds you to keep in touch with the people you would otherwise forget.\r\n\nDex helps turn your acquaintances into your allies.  Going beyond the superficiality of social networks requires commitment.  If you remember to keep in touch thoughtfully, you can turn the interesting person you met at a networking event into a friend that has your back.  \r\n\nI built Dex after failing to keep up with the tools I tried (Airtable, Notion, etc) for relationship management. Installing an actual CRM like Hubspot felt like a wrong fit for my informal relationships -- these people were 'my team,' not customers.\r\n\nDex is a lightweight personal CRM thatâ\u0080\u0099s easy to stick with. Key to Dex is a Chrome extension that enables you to manage relationships while youâ\u0080\u0099re in Facebook, Messenger, Twitter, and the social apps you already use. Dex can also send you actionable reminders (daily, or based on your calendar events) to log your interactions for next time. By using Dex, you can:\r\n\n- Build stronger relationships, by sending you a nudge to follow-up.\r\n- Be more thoughtful, by helping you remember where you left off.\r\n- Become a superconnector, by making connections you wouldnâ\u0080\u0099t otherwise remember.",
    "activity_status": "Active",
    "website": "https://getdex.com",
    "founded_date": 2019.0,
    "team_size": 7.0,
    "location": "San Francisco",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:saas; industry:productivity; industry:crm; location:san-francisco-bay-area",
    "founders": [],
    "status": true,
    "generated_description": "**Dex: The Personal CRM for Meaningful Connections**\n\n**Overview**\nFounded in 2019 and hailing from San Francisco, Dex is a personal CRM designed to help you manage your relationships more effectively. It emerged out of the founder's struggle with existing tools—like Notion and Airtable—that never quite fit the informal nature of personal connections. With a lean team of 7 and backing from Y Combinator (Batch S19), Dex challenges the conventional view of customer relationship management by focusing on personal relationships rather than sales pipelines.\n\n**Mission**\nDex aims to be more than just a reminder tool. Its mission is to turn acquaintances into allies by encouraging users to maintain thoughtful follow-ups, whether it's that interesting person you met at a networking event or old school friends. By making relationship management simple and contextual, Dex helps you stay connected with the people who matter.\n\n**Features**\n- **Lightweight CRM:** Dex simplifies your life by blending seamlessly into your daily workflow. A Chrome extension allows you to manage relationships while using popular apps like Facebook and Twitter.\n- **Actionable Reminders:** It sends you nudges to follow up and log interactions, ensuring you never miss an opportunity to reconnect.\n- **Relationship Building:** With Dex, you can build stronger relationships by remembering critical details about how you met, important dates, and more.\n\n**Usability**\nUnlike heavyweight CRM systems like HubSpot that feel clunky for personal use, Dex is designed for busy individuals. It integrates directly with platforms like LinkedIn and Gmail, ensuring your contacts are always updated without tedious data entry. \n\n**Security & Privacy**\nDex takes user privacy seriously, supporting its service through subscriptions—not ads. You’re in control of your data, with the ability to export or delete it anytime.\n\n**Target Audience**\nDex appeals to busy professionals, students (especially MBA candidates), investors, and creators looking to deepen their networks without getting bogged down by complex systems.\n\n**Current Status**\nWith over 30,000 users, Dex is steadily growing as the go-to tool for those seeking to enhance their professional and personal relationships. If you're intrigued and want to give it a spin, you can start for free at [getdex.com](https://getdex.com).\n\nIn essence, Dex is redefining how we think about our networks—no longer merely lists of contacts but a living, breathing ecosystem of connections that can enhance both personal and professional lives.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/8a7c31b59fc569c063f26df8918651aeb1184278.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191119Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=5f076f426ff83c8c03b3ba9fbdcf03f2a3abe0d9d4899bddc168c0830b69fb5f",
    "social_links": [
        "https://www.linkedin.com/company/getdex"
    ],
    "logo_path": "data/logos\\Dex_logo.png"
}