{
    "links": "https://www.ycombinator.com/companies/dexter",
    "name": "Dexter",
    "headline": "AI workflow automation for field operations",
    "batch": "F24",
    "description": "Dexter is the AI workflow automation tool for field operations. With Dexter, customers reduce traffic fines, automate van management, and run asset recovery. We're the only tool that can hand-off tasks between the back office, in-field workers, and AI agents.",
    "activity_status": "Active",
    "website": "https://www.getdexter.co/",
    "founded_date": 2024.0,
    "team_size": 3.0,
    "location": "Berlin, Germany",
    "group_partner": "Diana Hu",
    "group_partner_yc": "https://www.ycombinator.com/people/diana-hu",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:saas; industry:b2b; industry:workflow-automation; industry:automation; industry:operations",
    "founders": [
        {
            "name": "Bella Wu, Founder",
            "description": "Bella led the HubSpot automation product team from 2015-2019, where she launched many workflow automation products in Marketing, Sales and Service Hubs. She was the Head of Product and Growth at Dance, where she scaled the member base to 10k+ and built the tools for ops. She graduated from UChicago with a BA in Economics.",
            "linkedin": "https://linkedin.com/in/bellacwu"
        },
        {
            "name": "Vincent Garrigues, Founder",
            "description": "Vincent has 12+ years of experience leading engineering teams.\nHe joined SoundCloud as the 2nd iOS engineer and worked his way to director of engineering, overseeing the media streaming, player, and core listener teams (iOS, Android, Web, Backend, C++).\nAs principal engineer at Dance, he worked on everything, from customer facing apps to internal web and mobile apps for the operations team.",
            "linkedin": "https://www.linkedin.com/in/garriguv/"
        },
        {
            "name": "Caterina Kiehntopf, Founder",
            "description": "Caterina has 10+ years of experience working in business development and operations. She was the second EMEA employee at Uber JUMP, where she launched Berlin operations and defined how markets in Europe operated. Most recently she was the Head of Operations at Dance, an ebike subscription provider, where she built the operations org from the ground up, scaling the company to +10k monthly subscribers with operations in 5 markets.",
            "linkedin": "https://www.linkedin.com/in/caterina-kiehntopf-58a6aa34/"
        }
    ],
    "status": true,
    "generated_description": "**Company Overview: Dexter Technologies, Inc.**\n\nEstablished in 2024 and based in Berlin, Germany, Dexter Technologies is on a mission to revolutionize how businesses operate in the field through AI workflow automation. Their platform aims to streamline field operations by reducing traffic fines, automating van management, and optimizing asset recovery processes. More than just another SaaS tool, Dexter offers a unique capability to transfer tasks seamlessly between back-office teams, in-field workers, and AI agents—essentially creating a connected ecosystem for operational workflows.\n\n**Key Features:**\n- **AI-Powered Automation:** Dexter uses cutting-edge AI agents to handle complex tasks such as data extraction from images and online form submissions, drastically reducing manual input and errors.\n- **Customizable In-Field Tasks:** With a library of mobile-optimized AI-native components, users can easily tailor in-field tasks to keep operations running smoothly without concerns about mistakes from typing on phones.\n- **Integration Flexibility:** Dexter is designed to integrate smoothly with existing tools, offering businesses the ability to customize their workflows according to their unique needs.\n- **Efficiency Tracking:** Businesses can measure their processes from end to end, identifying bottlenecks and improving efficiency through insightful reporting features.\n\n**Real-World Impact:**\nOne notable success story is Dance, a European electric mobility subscription company that reported a 90% reduction in late payment fees and a 50% decrease in average ticket resolution time using Dexter. By automating the routing of traffic tickets and leveraging integrations with payment platforms, Dance streamlined their operations significantly.\n\n**Team & Leadership:**\nThe Dexter team is small yet skilled, consisting of just three employees. The leadership includes Bella Wu as CEO, who brings a wealth of experience from her time at HubSpot, where she led automation workflows. Caterina Kiehntopf, the COO, has a strong background in operations from her roles in companies like Uber, while Vincent Garrigues, the CTO, has extensive experience in software engineering from names like SoundCloud and Zalando.\n\n**Funding & Support:**\nDexter is part of Y Combinator's Batch F24, which lends additional credibility and support as they embark on this journey to reshape field operations through innovative technology.\n\n**In Summary:**\nIf your operations still rely on spreadsheets and ineffective communication channels, it might be time for a change. Dexter offers a cohesive solution that not only reduces the chaos often associated with field operations but also enhances productivity and efficiency through smart automation. To explore how Dexter can transform your workflow, you can [book a demo](https://www.getdexter.co/<https:/meetings.hubspot.com/bella50/demo>) or learn more through their [website](https://www.getdexter.co/).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/74ed4d8cd8895ec178d702d63236c1bdc303d21d.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191119Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=c7c315db43b698c8e48e04e5d689c9d902ee2a4888a3794759b092277d9f6c3c",
    "social_links": [
        "https://www.linkedin.com/company/getdexter",
        "https://x.com/get_dexter",
        "https://github.com/getdexter"
    ],
    "logo_path": "data/logos\\Dexter_logo.png"
}