{
    "links": "https://www.ycombinator.com/companies/dianahr",
    "name": "DianaHR",
    "headline": "An AI-Powered HR Person",
    "batch": "W24",
    "description": "DianaHR is an AI-powered HR person for the 1.4 million SMBs with at least 10 employees. Today, SMB owners spend 10+ hours a week struggling with managing software, state compliance notices, benefits questions, onboarding, insurance, workers comp, 401k, etc. With DianaHR, a human-in-the-loop AI takes care of all that and delivers peace of mind.",
    "activity_status": "Active",
    "website": "http://www.dianahr.ai",
    "founded_date": 2023.0,
    "team_size": 3.0,
    "location": "San Francisco",
    "group_partner": "Michael Seibel",
    "group_partner_yc": "https://www.ycombinator.com/people/michael-seibel",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:artificial-intelligence; industry:human-resources; industry:compliance; industry:hr-tech; industry:operations; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Upeka Bee, Founder",
            "description": "Upeka is the co-founder and CEO of DianaHR. Before DianaHR, she was at Gusto where she was the Head of Engineering of their HR Platform. Her team built the feature set that put Gusto on the map as an HR provider, beyond payroll and benefits. Prior to that she worked at salesforce and several startups. She and her co-founder, Tim Kral, met at Carnegie Mellon, and this is the third time they are working together.",
            "linkedin": "https://linkedin.com/in/upeka"
        }
    ],
    "status": true,
    "generated_description": "**DianaHR: Your AI-Powered HR Ally for SMBs**\n\nDianaHR, founded in 2023 and supported by the Y Combinator Batch W24, is geared towards revolutionizing human resources for small and medium-sized businesses (SMBs)—specifically those with at least 10 employees. Located in San Francisco and powered by a compact but fierce team of three, DianaHR is on a mission to provide an AI-powered HR solution that is tailored to the unique needs of its users.\n\n### The Problem It Solves\n\nIn today’s fast-paced business environment, SMB owners often find themselves submerged under the weight of HR-related tasks. They can spend upwards of 10 hours a week dealing with software management, state compliance notices, benefits questions, onboarding processes, insurance matters, workers' compensation, and even 401(k) plan complexities. DianaHR addresses these pain points by offering a human-in-the-loop AI tailored to simplify and streamline HR processes, effectively liberating entrepreneurs from daily HR headaches to focus on what truly matters—their business growth.\n\n### What They Offer\n\nDianaHR delivers a robust array of services designed to ease the HR burden, including:\n\n- **Managed Compliance:** Handling state registrations and ensuring compliance with ever-changing regulations.\n- **Payroll Management:** Streamlining payroll processes for both employees and contractors.\n- **Onboarding & Offboarding:** Efficient management of employee transitions, keeping everything smooth and compliant.\n\nWith their expertise and innovative technology, DianaHR promises to save businesses 10+ hours each week—an appealing prospect for busy owners.\n\n### Advantages of Partnering with DianaHR\n\nDianaHR combines human expertise with intelligent technology. Clients can connect with seasoned HR professionals via their preferred communication channels—be it email, Slack, or Zoom. The platform facilitates seamless task management, from compliance monitoring to document handling, ensuring that nothing slips through the cracks.\n\n### Client Success Stories\n\nDianaHR is already making waves with notable endorsements from satisfied clients. Business leaders like Vaughn Koch from Kivo Health and Trey H. from Tennr rave about the time and stress savings they have experienced. \"DianaHR has taken a whole slew of headaches that we had at Tennr and completely eliminated them,\" Trey shared. Such testimonials highlight the tangible benefits—as users reclaim precious hours and maintain focus on their core business operations.\n\n### In Summary\n\nIf you're an SMB owner battling the complexities of HR compliance and administrative overload, DianaHR might just be the ally you need. With a focus on efficiency, simplicity, and peace of mind, they stand ready to transform your HR experience. To discover how DianaHR can revolutionize your HR processes, you can visit their website at [DianaHR](http://www.dianahr.ai) or book a call to get started and reclaim your precious time.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/be9dbf64804826a12add45c3936339619e7b52d5.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191120Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=ec485aba91ae8f2ed8bf88b0393e5fb342f8d14630ff6aaef60f2498271fe048",
    "social_links": [
        "https://www.linkedin.com/company/dianahr/",
        "https://x.com/getdianahr"
    ],
    "logo_path": "data/logos\\DianaHR_logo.png"
}