{
    "links": "https://www.ycombinator.com/companies/diffuse-bio",
    "name": "Diffuse Bio",
    "headline": "Generative AI for protein design",
    "batch": "W23",
    "description": "Diffuse is building generative AI for protein design. Our mission is to build AI systems that engineer new and useful proteins with unprecedented control and accuracy. Our team has been behind breakthroughs in AI protein design for the past 7 years, including the first experimental validation of AI-generated proteins and diffusion models for protein structure and sequence.",
    "activity_status": "Active",
    "website": "http://diffuse.bio",
    "founded_date": 2022.0,
    "team_size": 10.0,
    "location": "San Carlos, CA",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:ai-powered-drug-discovery; industry:deep-learning; industry:generative-ai; industry:machine-learning; industry:biotech",
    "founders": [
        {
            "name": "Namrata Anand, Founder",
            "description": "I’m a bioengineer / computer scientist who’s worked on problems at the intersection of machine learning and biology. For the past several years, I’ve been working on re-envisioning the computational protein design toolkit with AI. Some highlights are the first crystal structures of AI-designed proteins and diffusion models for protein structure generation.",
            "linkedin": "https://www.linkedin.com/in/namrata-a-427807188/"
        }
    ],
    "status": true,
    "generated_description": "**Diffuse Bio: Pioneering AI in Protein Design**\n\n**Overview**: Founded in 2022 and based in San Carlos, CA, Diffuse Bio is at the forefront of generative AI for protein design. As part of the Y Combinator Batch W23, this small but ambitious team of 10 aims to revolutionize how we design proteins, focusing on achieving unprecedented control and accuracy.\n\n**Mission**: The mission of Diffuse Bio is clear: to leverage generative AI to engineer new and useful proteins, which could lead to breakthroughs in various fields including biotechnology and drug discovery. The company has built on seven years of prior experience, having achieved significant milestones in AI-generated proteins, including the first experimental validations and the development of diffusion models for both protein structure and sequence.\n\n**Current Initiatives**: Diffuse Bio's current initiatives revolve around advancing their AI technologies that enhance the design and effectiveness of proteins. They are actively engaged in publishing research papers and generating meaningful discussions about the future of AI in biology. Their work has gained traction in prominent publications like the New York Times and NBC News, showcasing their innovations to a broader audience.\n\n**Notable Research**: The company has made substantial contributions to the field, including groundbreaking papers such as:\n- \"Protein Structure and Sequence Generation with Equivariant Denoising Diffusion Probabilistic Models\" on arXiv.\n- \"Protein Sequence Design with a Learned Potential\" published in Nature Communications.\n- \"Generative Modeling for Protein Structure,\" which was influential in establishing the field.\n\n**Backers and Support**: Diffuse Bio has garnered support from notable investors including Y Combinator, Fellows Fund, Humba Ventures, and GreatPoint Ventures, reflecting confidence in their innovative approach and potential for impact.\n\n**In Summary**: Diffuse Bio represents a compelling intersection of cutting-edge AI technology and the biological sciences. Their focus on generative AI for protein design positions them as a key player in advancing how we understand and utilize proteins in medicine and beyond. If you're curious to learn more or get involved, check out their [website](http://diffuse.bio).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/dc45cf05495a769fa3a7d241dd49544df419a4dc.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191120Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=00c3f055168bc35f2d7555f8dac80c1fa758ffc9394377729ec1bb9c1cca3da8",
    "social_links": [],
    "logo_path": "data/logos\\Diffuse_Bio_logo.png"
}