{
    "links": "https://www.ycombinator.com/companies/digistain",
    "name": "Digistain",
    "headline": "Pioneering Breast Cancer Diagnostics for a Healthier Tomorrow",
    "batch": "S21",
    "description": "In the global fight against breast cancer, Digistain stands at the forefront, offering a beacon of hope to millions. Our journey began at Imperial College London, where ground-breaking research gave birth to a technology poised to revolutionize breast cancer diagnostics.\r\n\nThe Challenge: Every year, breast cancer affects 2.3 million individuals globally. Post-surgery, 60% of patients are advised to undergo genomic testing, an expensive and time-consuming process monopolized by a single lab in the U.S., costing around $4,000 and taking nearly two months. Consequently, only 5% undergo this vital testing. The rest, unable to access this crucial diagnostic step, often resort to chemotherapy—a treatment that, in one in four cases, is more harmful than the cancer itself.\r\n\nOur Solution: Digistain addresses this critical gap. Our technology transforms the current diagnostic process by enabling hospitals to analyze patient samples in-house using existing equipment, supplemented with our innovative technology. This approach offers near-instantaneous decision-making data, a stark contrast to the existing month-long waits. Central to our technology is a proprietary algorithm that identifies a unique spectral fingerprint of the tumour in the infrared spectrum, providing a personalized risk score. This score guides oncologists in selecting the most effective, individualized treatment plans, potentially reducing unnecessary chemotherapy and its harmful side effects.\r\n\nImpact and Potential: Our solution not only challenges the status quo in technology but also in accessibility. In a landmark government-commissioned study, Digistain demonstrated clinical evidence on par with the market leader, but at a fraction of the cost and time. Already making waves in clinical practice globally, with insurance reimbursement at leading cancer centers, our technology represents a paradigm shift in cancer care.\r\n\nRecognized by the Institute of Physics, the Royal Society, and Imperial College for our innovative contributions, and supported by entities like the NHS, Y Combinator, and the European Investment Bank, Digistain is more than a company—it’s a movement towards equitable, effective cancer treatment. With the potential to democratize access to life-saving diagnostics, Digistain is not just envisioning a better future for cancer patients; we are actively creating it.",
    "activity_status": "Active",
    "website": "https://digistain.co.uk/",
    "founded_date": 2019.0,
    "team_size": 40.0,
    "location": "London, United Kingdom",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:medical-devices",
    "founders": [
        {
            "name": "Hemmel Amrania, Founder",
            "description": "Hemmel Amrania Ph.D, CEO has previously scaled several 7 figure businesses both in therapeutics and diagnostics. As a doctoral researcher he was awarded the Outstanding Research Prize at Imperial College London. He has also won several UK business awards including the Innovation & Entrepreneurship Challenge Imperial College and the Climate KIC Competition held by the Mayor of London. For Digistain he spear-headed the research out of the lab all the way through to clinical trials.",
            "linkedin": "https://www.linkedin.com/in/hemmel-amrania/"
        },
        {
            "name": "Chris Phillips, Founder",
            "description": "Chris is an Imperial College Physics Professor, researching into photovoltaics, and biomedical imaging. He's spent the last few years, with Hemmel Amrania, developing the Digistain cancer diagnosis technology with Imperial medics.\n\nHe has won a number of prizes and has explained his research on  invisibility caused by quantum optical effects to comedy legend Cleese on TV. He once rowed 500 miles non-stop from London to Paris. See https://en.wikipedia.org/wiki/Chris_Phillips_(professor)",
            "linkedin": "https://www.linkedin.com/in/chris-phillips-a650151b/"
        }
    ],
    "status": true,
    "generated_description": "Digistain is a London-based company founded in 2019 with a mission to revolutionize breast cancer diagnostics, offering hope to millions worldwide. Emerging from groundbreaking research at Imperial College London, Digistain addresses a significant gap in the fight against breast cancer—specifically, the lack of accessible, timely, and cost-effective genomic testing post-surgery.\n\n### The Challenge\nEvery year, 2.3 million individuals worldwide are diagnosed with breast cancer. Following surgery, 60% of these patients are recommended for expensive genomic testing—often taking up to two months and costing around $4,000. Unfortunately, only 5% can access these crucial tests, leading many to default into often unnecessary chemotherapy treatments.\n\n### Our Solution\nDigistain's innovative technology enables hospitals to conduct in-house analyses of breast cancer biopsies using existing equipment. This game-changing approach provides near-instantaneous decision-making data, drastically reducing the wait time from weeks to potentially less than an hour. At its core, Digistain uses a proprietary algorithm to identify a spectral fingerprint of tumors in the infrared spectrum, resulting in a unique Digistain Prognostic Score that informs oncologists in tailoring personalized treatment plans.\n\n### Impact and Potential\nDigistain's work challenges not just the technological aspects of cancer diagnostics, but accessibility as well. It has already shown clinical evidence comparable to the industry leader—yet at a fraction of the typical costs and time requirements. With backing from reputable organizations, including the NHS, Y Combinator, and the Royal Society, and with a diverse team of 40, this technology is quickly making a mark in clinical practices globally.\n\n### Recognition and Future\nDigistain is not just a company; it’s a movement toward equitable cancer care. Recognized for its contributions and supported by significant partnerships, it strives to democratize access to life-saving diagnostics. By changing how we assess and treat breast cancer, Digistain is actively creating a healthier tomorrow.\n\nFor more information, visit [Digistain's website](https://digistain.co.uk).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/124d5a965d332f80ad609b1333be8f71fd34a099.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191121Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=8875bf1b72062fde6a8d59743f235fd9c28fd244500085f8ad149d585a2f9e18",
    "social_links": [
        "https://uk.linkedin.com/company/digistain"
    ],
    "logo_path": "data/logos\\Digistain_logo.png"
}