{
    "links": "https://www.ycombinator.com/companies/dimorder",
    "name": "DimOrder",
    "headline": "Toast for Southeast Asia",
    "batch": "W22",
    "description": "DimOrder - Restaurant POS system for Southeast Asia\r\n\nFounded in 2019, DimOrder is a Hong Kong-based technology company transforming the F&B industry. In addition to online payments, we allow restaurants to market to their customers, order food from their suppliers, and receive short term loans. Through one single platform, restaurateurs can easily manage their business and focus on their passion, we let the chef be chef.",
    "activity_status": "Active",
    "website": "https://dimorder.com",
    "founded_date": 2019.0,
    "team_size": 70.0,
    "location": "Hong Kong, Hong Kong",
    "group_partner": "Brad Flora",
    "group_partner_yc": "https://www.ycombinator.com/people/brad-flora",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:saas; industry:b2b; industry:supply-chain",
    "founders": [
        {
            "name": "Tim Lee, Founder",
            "description": "Co-founder of DimOrder. Oversees sales, strategy and direction at DimOrder. Previous life in running a cafe and a Japanese restaurant, after years in the financial field doing wealth management. Graduated from University of Warwick, studying economics. \n\nA food lover, tennis player and F1 fan.",
            "linkedin": "https://www.linkedin.com/in/tim-lee-a8676896/"
        },
        {
            "name": "Ben Wong, Founder",
            "description": "Founder of DimOrder. Oversees operation and direction of DimOrder.  Ben has been in F&B industry for over 5 years, ran a 20-staff 3000sq. ft. Japanese restaurant and bubble tea shops.\nBen has expertise in the financial ecosystem, especially in payment clearing, loan model, and cash management.",
            "linkedin": "https://www.linkedin.com/in/dobenwong/"
        }
    ],
    "status": true,
    "generated_description": "**DimOrder: Revolutionizing the F&B Industry in Southeast Asia**\n\nFounded in 2019, DimOrder is on a mission to become the toast of Southeast Asia's food and beverage (F&B) industry. Based in Hong Kong and proud to be part of Y Combinator’s W22 batch, DimOrder serves as an all-encompassing restaurant point-of-sale (POS) system tailored specifically for local needs. With a dedicated team of 70 employees, the company aims to let chefs focus on their culinary passions by simplifying the business side of running a restaurant.\n\nWhat sets DimOrder apart? The platform is not just a typical POS system; it offers a comprehensive suite of tools that integrates online payments, marketing solutions, supplier ordering, and even short-term loan options—all rolled into one user-friendly interface. This means restaurant owners can manage their operations efficiently without getting bogged down in a myriad of separate systems.\n\nLet's break it down a bit further:\n\n1. **All-in-One Platform**: DimOrder combines various functionalities like customer engagement, inventory tracking, and financial insights into a single system. This is crucial in a sector where time and customer experience are everything.\n\n2. **Boosting Revenue**: The DimPOS self-ordering system enhances customer convenience and increases order accuracy. With features like digital menus complete with images and customization options, it helps restaurants maximize sales potential.\n\n3. **Expanding Reach**: Connected to the DimOrder delivery app, restaurants can easily manage takeaway and delivery orders, opening new revenue streams and attracting diverse customer segments.\n\n4. **Efficiency in Operations**: By providing QR codes for pre-ordering during wait times, DimOrder helps restaurants improve table turnover rates and service quality, ultimately enhancing customer satisfaction.\n\n5. **Recognition and Growth**: With over 1,000 partnered restaurants and accolades such as being featured in Forbes Asia's \"100 to Watch,\" DimOrder is rapidly gaining traction in the competitive food tech landscape.\n\nLooking ahead, DimOrder is not just solving current problems but also innovating for a more streamlined and interconnected future for the F&B industry in Southeast Asia. If you’re part of the restaurant sector looking to elevate operations and customer experience, consider DimOrder as the go-to solution. For more details, visit [DimOrder's website](https://dimorder.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/d0b26cbee57e58de44b0206bd62de9a488c1e96a.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191122Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=968f1bf5168070f544344bece2a3be8d6d03087a48f704e6e4007d927625bc11",
    "social_links": [
        "https://www.linkedin.com/company/dimorder/",
        "https://facebook.com/dimorder",
        "https://www.crunchbase.com/organization/infinity-technology-corporation-limited"
    ],
    "logo_path": "data/logos\\DimOrder_logo.png"
}