{
    "links": "https://www.ycombinator.com/companies/disclo",
    "name": "Disclo",
    "headline": "Health disclosure and accommodation management platform",
    "batch": "S22",
    "description": "Disclo is the first software for employers to collect, verify, and manage health disclosures and employee accommodation requests (HIPAA and SOC2 compliant, of course).\r\n\nWe help employees secure the enhancements and protections they need to succeed in their careers without having to disclose their underlying medical condition to their employer. We handle the collection of that data, the verification, the secure data management, and much more.\r\n\nUsing our patent-pending medical verification system, Disclo validates that an employee's accommodation request is legitimate and required, interacting with medical providers directly, so HR managers can focus on what they do best. We help companies stay compliant with EEOC, ADA, and HIPAA guidelines.",
    "activity_status": "Active",
    "website": "http://www.disclo.com",
    "founded_date": 2019.0,
    "team_size": 10.0,
    "location": "Austin, TX",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:human-resources; industry:b2b; industry:compliance; industry:hr-tech; location:austin",
    "founders": [
        {
            "name": "Hannah Olson, Founder",
            "description": "Hannah Olson is the Co-Founder and CEO of Disclo, the first software helping employees safely ask for, verify, and act on accommodation requests at work. Hannah’s own experience navigating her career while undergoing intensive treatment for Lyme disease sparked the idea for her first venture, Chronically Capable, which became one of the largest and most-used disability recruiting platforms in the world.",
            "linkedin": "http://www.linkedin.com/in/hanrosols"
        },
        {
            "name": "Kai Keane, Founder",
            "description": null,
            "linkedin": "https://www.linkedin.com/in/kaikeane"
        }
    ],
    "status": true,
    "generated_description": "**Disclo: Redefining Workplace Accommodations for the Modern Era**\n\nWelcome to Disclo, a pioneering platform reshaping the way businesses approach health disclosure and accommodation management. Founded in 2019 and part of the Y Combinator Batch S22, Disclo is based in Austin, TX, and is staffed by a dedicated team of 10.\n\n### Mission\nDisclo's mission is clear: to create a seamless, compliant environment for employers and employees to navigate health disclosures and accommodation requests—without requiring employees to disclose underlying medical conditions. \n\n### The Solution\nAt its core, Disclo provides the first software that allows employers to collect, verify, and manage health disclosures in a way that is both HIPAA and SOC2 compliant. Their patent-pending medical verification system interacts directly with medical providers, ensuring that accommodation requests are genuine and necessary. This functionality frees up HR professionals to focus on their primary roles while maintaining compliance with EEOC, ADA, and HIPAA guidelines.\n\n### Why Choose Disclo?\n1. **Cost-Efficiency**: Disclo streamlines what can often be a resource-heavy process. By automating workflows and reducing administrative burdens, organizations can reclaim valuable time and cut costs.\n   \n2. **Compliance Assurance**: With the rise of EEOC lawsuits related to accommodations, Disclo’s platform provides peace of mind by delivering sustainable, compliant processes that adapt as laws evolve.\n\n3. **Culture Enhancement**: Disclo transforms the handling of accommodations into a strategic asset, promoting inclusivity and boosting overall employee morale and productivity.\n\n4. **Expert Support**: The platform offers 24/7 access to experts in workplace accommodations, ensuring organizations have support at every step of the process.\n\n### Features and Use Cases\nDisclo is equipped to handle diverse scenarios:\n- **Return to Office (RTO) Necessities**: With many companies adjusting to hybrid models, Disclo helps tackle the complexities of RTO accommodations.\n- **Interview Accommodations**: Their 'Disclo Hire' tool ensures candidates are appropriately supported from day one.\n- **Addressing Mental Health**: Given rising awareness around mental health issues, Disclo integrates processes to accommodate these needs effectively.\n\n### The Future\nAs workplace dynamics transform, particularly in recovery from global events and shifting employee needs, Disclo stands ready to lead the way in making workplaces healthier and more adaptable. The growing acknowledgment of diverse workplace requirements—like family care and mental health—places Disclo in a prime position to support organizations in maintaining not just compliance but genuine employee well-being.\n\nIn summary, if you’re a forward-thinking organization looking to revolutionize the way you handle accommodations, Disclo provides not just software but a pathway to a more inclusive, compliant, and efficient workplace.\n\nFor those interested in exploring Disclo further, details and demos are available on their [website](http://www.disclo.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/2b8c9451f062f8a9d5cc5e7fa36ade65e54adafe.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191123Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=0e5422d35d7db3021fa42175fd05b3a1fa8a6efa786da70822752027ea8cdb8d",
    "social_links": [
        "https://www.linkedin.com/company/disclo/",
        "https://twitter.com/disclotime",
        "https://www.crunchbase.com/organization/disclo"
    ],
    "logo_path": "data/logos\\Disclo_logo.png"
}