{
    "links": "https://www.ycombinator.com/companies/distro",
    "name": "Distro",
    "headline": "The AI co-pilot for sales reps at industrial wholesale distributors.",
    "batch": "S24",
    "description": "Distro is the all-in-one AI-powered sales platform for counter staff and inside sales at industrial wholesale distributors (HVAC/R, plumbing, electrical, and more).",
    "activity_status": "Active",
    "website": "https://distro.app",
    "founded_date": 2022.0,
    "team_size": 7.0,
    "location": "Palo Alto",
    "group_partner": "Nicolas Dessaigne",
    "group_partner_yc": "https://www.ycombinator.com/people/nicolas-dessaigne",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:artificial-intelligence; industry:saas; industry:b2b; industry:manufacturing; industry:supply-chain; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Jason Sullivan, Founder",
            "description": "Jason is the founder and CEO of Distro, the all-in-one AI co-pilot for counter staff and inside sales at industrial wholesale distributors. He is a repeat founder, having previously co-founded Vested. Before Vested, he was CTO at Elementus, Tech Lead at Coatue, and Senior Software Engineer at PeerIQ. In a prior life, Jason was a credit derivatives trader.\n\nJason holds an MS in Computer Science from Stanford and a BA in Cognitive Science from Yale.",
            "linkedin": "https://linkedin.com/in/jasoncsullivan"
        }
    ],
    "status": true,
    "generated_description": "**Company Overview: Distro**\n\nDistro is an innovative software startup tailored specifically for the industrial wholesale distribution sector. Founded in 2022 and currently part of the Y Combinator Batch S24, Distro aims to enhance the effectiveness of sales reps through artificial intelligence, establishing itself as the go-to AI co-pilot for those working in industries like HVAC/R, plumbing, and electrical distribution. With a team of just seven based in Palo Alto, Distro is making big strides in empowering counter staff and inside sales teams. \n\n**Mission**\n\nDistro's mission is straightforward yet ambitious: to leverage cutting-edge AI technology to make sales representatives at industrial wholesalers significantly more productive. By offering an all-in-one AI sales platform, Distro enhances quoting accuracy, boosts conversion rates, and increases profit margins, all while ensuring exceptional customer experiences.\n\n**Product Suite**\n\nThe platform boasts a robust suite of AI-driven tools designed to cater to the varying needs of the distribution industry:\n\n1. **Distro RepBot**: An internal assistant that provides sales reps with immediate access to product and customer information.\n   \n2. **Distro CustomerBot**: An external-facing chatbot enhancing e-commerce capabilities by giving contractors quick access to order details and quote requests.\n\n3. **Distro AutoBid**: A game-changer for processing bid lists and purchase orders, capable of interpreting documents in various formats to streamline quote generation.\n\n4. **Distro QuoteTech**: Tailored for complex sales environments, this feature automates quoting processes to help sales reps close deals more efficiently.\n\n5. **Custom AI Solutions**: Distro also collaborates with businesses to develop bespoke AI tools that address unique challenges, driving operational efficiency.\n\n**Why Distro?**\n\nWhat sets Distro apart is its singular focus on the wholesale distribution industry. Many AI solutions attempt to serve diverse sectors without specific tailoring; Distro, conversely, dedicates itself entirely to its niche. This focused approach enables it to offer deep insights and optimal efficiencies that resonate well with its target audience.\n\n**Future Direction**\n\nWith the foundation laid and early successes already evident, Distro is poised for growth. It continues to refine its AI solutions, expand its capabilities, and most importantly, deliver exceptional value to its customers—empowering every participant in the distribution ecosystem to perform at their best.\n\nIn a world where AI is ubiquitous but often misaligned with specific industry needs, Distro stands out as a company genuinely committed to revolutionizing industrial sales through tailored technology. For further information or to get started, visit [Distro's website](https://distro.app).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/e96d81994e0175f2873e6c0096f2483adf1e816c.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191123Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=a13d9d58706bb4cc92e21e8112f5a13bcc277ee09a8a30b8f87750956f8b89fc",
    "social_links": [
        "https://www.linkedin.com/company/distro-ai-app"
    ],
    "logo_path": "data/logos\\Distro_logo.png"
}