{
    "links": "https://www.ycombinator.com/companies/docvita",
    "name": "DocVita",
    "headline": "Telehealth provider for India.",
    "batch": "W20",
    "description": "We make it easy for anyone in India to access healthcare over Zoom, Meet, or WhatsApp. We provide care in 11 local languages.\r\n\nFor every appointment, we provide a concierge who manages all logistics for the patient & handles the back-office work for doctors. With this, we have cracked the code to make telehealth work in India.",
    "activity_status": "Active",
    "website": "https://docvita.com",
    "founded_date": 2019.0,
    "team_size": 14.0,
    "location": "Bengaluru, India",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:marketplace; industry:consumer-health-services; industry:telemedicine; industry:mental-health",
    "founders": [
        {
            "name": "Anmol Arora, Founder",
            "description": "Anmol is currently CEO at DocVita, a telehealth platform to consult doctors & therapists on Zoom, Meet, WhatsApp.\n\nHe is an IIT Indore alumnus from the class of 2016. Before pursuing his startup full-time, he has worked as a Trainee at CERN(European Centre for Nuclear Research) in Geneva, Switzerland.\n\nHe is an expert in marketing & fast product-led growth.",
            "linkedin": "https://www.linkedin.com/in/aroraanmol/"
        },
        {
            "name": "Vikram Patel, Founder",
            "description": "Vikram is currently CTO at DocVita, a telehealth platform to consult doctors & therapists on Zoom, Meet, WhatsApp.\nHe is an IIT Indore alumnus from the class of 2016. He’s an expert in all things tech and stitching it all together to ensure seamless customer journeys.",
            "linkedin": "https://www.linkedin.com/in/vikram-d-patel"
        }
    ],
    "status": true,
    "generated_description": "**DocVita: Transforming Telehealth in India**\n\nFounded in 2019 and part of Y Combinator’s Winter 2020 batch, DocVita is a telehealth platform dedicated to making healthcare accessible to everyone in India. Based in Bengaluru, this innovative company started with a simple mission: to facilitate healthcare consultations through popular platforms like Zoom, Google Meet, and WhatsApp, supporting patients in 11 local languages. \n\nDocVita understands the unique challenges within the Indian healthcare landscape and addresses them by providing a concierge service for every appointment. This ensures a seamless experience for patients, as they enjoy logistical support while healthcare professionals concentrate on patient care without back-office distractions.\n\nWith a small but mighty team of 14, DocVita addresses a breadth of mental health conditions, including anxiety, depression, attention disorders, and various personality disorders. They offer different types of therapy, notably Cognitive Behavioral Therapy (CBT), Dialectical Behavior Therapy (DBT), and more, thereby catering to the diverse needs of their users.\n\nWhat stands out about DocVita is its commitment to creating a customer-centered experience. Each patient is paired with a dedicated care manager who supports them via WhatsApp, ensuring they have guidance throughout their healthcare journey, from finding the right therapist to managing schedules.\n\nAs an emerging marketplace in the realm of consumer health services and telemedicine, DocVita not only connects individuals with qualified mental health professionals but also prioritizes confidentiality and accessibility. With no hidden costs and competitive pricing equivalent to in-person consultations, they make mental healthcare approachable for many.\n\nFor those interested, finding a therapist or psychiatrist and getting matched to the right provider is just a few clicks away on their user-friendly website: [DocVita](https://docvita.com). \n\nIn short, DocVita is actively shaping the future of mental health services in India, making healthcare not just accessible but personal and supportive. If you're seeking professional help, whether you're a patient or a mental health professional looking to make an impact, DocVita might just be the right platform for you.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/f908666e8946fee1c417af1172afd4160c726897.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191124Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=a64bcf1c957f9e3f3117f4ea7d6729e07818439b528cbc394c8f95165af40878",
    "social_links": [
        "https://www.linkedin.com/company/docvita",
        "https://twitter.com/DocVitaOfficial",
        "https://www.facebook.com/DocVitaOfficial"
    ],
    "logo_path": "data/logos\\DocVita_logo.png"
}