{
    "links": "https://www.ycombinator.com/companies/dojah-inc",
    "name": "Dojah Inc",
    "headline": "Prevent Fraud and Onboard Users Faster",
    "batch": "W22",
    "description": "Dojah is an end-to-end AI Powered Fraud Prevention and KYC Platform. From onboarding to ongoing monitoring, we are helping businesses fight financial crime and onboard customers faster.",
    "activity_status": "Active",
    "website": "https://www.dojah.io",
    "founded_date": 2021.0,
    "team_size": 22.0,
    "location": "San Francisco",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:artificial-intelligence; industry:fintech; industry:saas; industry:identity; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Tobi Ololade, Founder",
            "description": "Tobi Ololade is the Founder and CEO of Dojah. Tobi plays a leading role in driving key strategic initiatives across the global business. Previously he was the CTO of Tradebua, a data and API infrastructure for agriculture finance. Tobi became an entrepreneur in his early days as a student, running a business that served clients in multiple countries.",
            "linkedin": "https://www.linkedin.com/in/ololaday/"
        },
        {
            "name": "Ayomide Oso, Founder",
            "description": "Ayomide is the co-founder and Head of product. Ayomide's tech journey started at Elta Solutions, a dev shop providing a range of services for building digital products. This gave her a good understanding of major problems innovators across the continent face.\nAyomide worked on several products, including Ropay (https://ropay.ng/). While at this, she faced similar problem innovators across sectors are dealing with in \"sourcing API's and necessary data\" and decided to solve it once and for all.",
            "linkedin": "https://www.linkedin.com/in/ayomideoso/"
        }
    ],
    "status": true,
    "generated_description": "Dojah Inc. is making a big splash in the fintech space with its commitment to preventing fraud and accelerating user onboarding. Founded in 2021 and part of the Y Combinator Batch W22, this San Francisco-based company has quickly carved out a niche as an AI-powered end-to-end fraud prevention and KYC platform. \n\nWith a lean team of just 22 employees, Dojah is tackling some heavy challenges in the realm of financial crime. Their mission? To help businesses onboard customers faster while keeping fraud at bay. \n\n### What They Offer:\n\nAt its core, Dojah’s platform encompasses two primary hubs: \n1. **Anti-Fraud Hub**: This aspect focuses on real-time fraud prevention, employing a combination of rule-based and event-based approaches. Be it AML compliance or transaction monitoring, they have tailored solutions that manage risk effectively.\n  \n2. **Identity Hub**: A comprehensive identity verification solution that goes beyond traditional KYC (Know Your Customer) tools. Dojah offers customizable verification flows that can adapt to specific business needs, enhancing user experience and compliance readiness.\n\n### Why It Matters:\n\nIn a digital age where security and trust are paramount, Dojah's tools help companies build a robust framework for growth. Businesses can streamline customer due diligence and quickly identify any suspicious behaviors, reducing the chances of financial loss significantly. \n\n### Customer Success:\n\nDojah's technology is already being lauded by its users, including testimonies of up to a 99% reduction in user verification time and an unwavering reliable service with no downtime recorded.\n\nAs they push forward, Dojah remains committed to maintaining high standards of data privacy and compliance, ensuring businesses can confidently integrate their solutions. If you’re looking to bolster your defenses against fraud while enhancing customer onboarding, Dojah could be the partner you need.\n\nFor more details and to see what they can do for your business, visit their [website](https://www.dojah.io).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/68df0c677ac01f253e5d3984740e55fd32e307f5.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191125Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=ef7be37dfc9a1e4ac96073c534b155156dc47c502b040d41909f1576f6378566",
    "social_links": [
        "https://www.linkedin.com/company/dojah",
        "https://twitter.com/dojahinc"
    ],
    "logo_path": "data/logos\\Dojah_Inc_logo.png"
}