{
    "links": "https://www.ycombinator.com/companies/domu-technology-inc",
    "name": "Domu Technology Inc.",
    "headline": "Automating debt collection calls for banks.",
    "batch": "S24",
    "description": "Domu automates debt collection calls for the banks using generative AI. We have $870k in ARR with clients like BBVA, BNP Paribas and Skandia.",
    "activity_status": "Active",
    "website": "https://www.domu.ai/",
    "founded_date": 2023.0,
    "team_size": 5.0,
    "location": "San Francisco",
    "group_partner": "Tom Blomfield",
    "group_partner_yc": "https://www.ycombinator.com/people/tom-blomfield",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:aiops; industry:call-center; industry:ai; industry:ai-assistant; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Nick Diaz, Founder",
            "description": "I bring over 5 years of experience as a developer engineer. I studied computer science and have a strong background in building and leading technical teams. Before joining Domu, I worked on research around the use of LLMs for credentialing systems within healthcare companies with the ETIM program at CMU. Additionally, with my past startup Cerebrum, an AI digital identity company, I addressed identity verification challenges for banks such as Bank of America and JP Morgan, as well as for medical",
            "linkedin": "https://www.linkedin.com/in/nicolasdiaz27/"
        },
        {
            "name": "Camila Zancanella, Founder",
            "description": "Co-founder @ Domu | We automate debt collection calls for banks.\nCamila has 5 years of experience in multiple business areas, data analytics, and data science. She is responsible for building the models to analyze client data to personalize communication flows and decision-making processes. She previously worked at Rappi and Otter (a unit of Cloud Kitchens) and has contributed to research papers by running statistical models for business studies.",
            "linkedin": "https://linkedin.com/in/camilazancanella"
        }
    ],
    "status": true,
    "generated_description": "### Domu Technology Inc.: Revolutionizing Debt Collection\n\n**Foundation and Mission**  \nFounded in 2023, Domu Technology Inc. is a cutting-edge startup based in San Francisco, specialized in automating debt collection calls for banks using generative AI. Their mission? To streamline and enhance the way financial institutions handle debt collections and sales calls, making the process more efficient and effective.\n\n**Performance and Growth**  \nIn just under a year, Domu has made significant strides, achieving an annual recurring revenue (ARR) of $870k. They count noteworthy clients among their roster, including major players like BBVA, BNP Paribas, and Skandia. Their ability to tailor services to the nuances of the financial sector sets them apart.\n\n**The Team**  \nDomu operates with a nimble team of five employees, which is quite impressive considering the scale of results they’re producing. Their involvement with Y Combinator's Batch S24 adds a layer of credibility and support that’s crucial for early-stage startups.\n\n**Technology and Impact**  \nAt the heart of their offering is the ability to perform human-like voice calls for both the insurance and financial industries. Domu’s generative AI technology allows for 24/7 automation of sales and debt collection calls, engaging with potential clients in real-time right after they express interest—think of it as having your best sales agents operating around the clock.\n\n**Addressing Key Challenges**  \nDomu tackles significant pain points faced by businesses today. With statistics showing that 70% of companies don’t meet their sales goals due to a lack of actionable data, and a staggering 85% of customers abandoning a purchase after receiving a quote online, the need for their service is clear. Traditional call rates are dismally low, with only 14% of clients picking up the phone. Domu aims to change that narrative by optimizing outreach efforts in a way that generates results.\n\n**A/B Testing and Real-Time Engagement**  \nWhat’s particularly compelling is Domu’s capability to perform extensive A/B testing—over 100 experiments per client monthly. This agility not only helps improve engagement but ensures that strategies evolve based on data-driven insights. The technology allows calls to be triggered based on customer interactions with websites, emails, or ads, significantly enhancing the chances of conversion.\n\n### Success Stories  \nDomu’s approach has already borne fruit:  \n- **Skandia** generated over $1M through automated calls directed at debtors interested in negotiating.\n- **BNP Paribas Cardif** reported a fivefold increase in call capacity, resulting in over $500k in new sales.\n- **SBS Insurance** saw a 3% improvement in conversion rates shortly after implementation, showing the practical benefits of their innovative solutions.\n\n**In Summary**  \nDomu Technology Inc. is more than just a startup; it's a forward-thinking solution to long-standing problems in the financial and insurance sectors. By combining advanced AI technology with practical applications, they are well-positioned to transform how companies approach debt collection and sales calls. If you're interested in exploring their services, you can learn more on their website [Domu.ai](https://www.domu.ai/). \n\nIn an industry ripe for disruption, Domu is gearing up to take debt collection into the future. Are you ready to automate your approach?",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/d6f06f6d1446c6c85e9c5fb78b6ce53e3cb2b7e0.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191125Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=02104052429dfe194537c33eebac10bdbdf844efbedde3e27c666b55c2a54081",
    "social_links": [
        "https://www.linkedin.com/company/domu-ai/"
    ],
    "logo_path": "data/logos\\Domu_Technology_Inc._logo.png"
}