{
    "links": "https://www.ycombinator.com/companies/dost-education",
    "name": "Dost Education",
    "headline": "Getting kids ready for school in India.",
    "batch": "W17",
    "description": "Dost is an ed-tech nonprofit building a platform to expand access to early childhood development in low-resource settings through parent education. Our mission is to unlock children’s full potential by focusing on early learning - the time when 90% of our brains develop.\r\n\nWe believe that parents of any literacy level can play a critical role in developing their children’s school and life readiness. In India alone, there are 150 million under-resourced caregivers who can benefit from resources developed for them. That’s why our team at Dost Education - educators, entrepreneurs, and engineers - are passionate about using technology and user-centric product design to change the trajectory of families’ lives.\r\n\nSince 2017, we’ve grown from a small pilot with a few hundred mothers, to reaching over 100,000 families working with state governments. Join us as we continue to innovate, grow our reach, and deepen our impact. We are supported by some of the best funders in tech and social impact space like Y Combinator, Mulago, and many others.\r\n\nDost Education values diversity. We do not discriminate on the basis of race, religion, colour, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.",
    "activity_status": "Active",
    "website": "http://www.dosteducation.com/",
    "founded_date": 2017.0,
    "team_size": 30.0,
    "location": "Delhi, India",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:education; industry:nonprofit; industry:india; industry:data-science",
    "founders": [
        {
            "name": "Sindhuja Jeyabal, Founder/CTO",
            "description": "Sindhuja has expertise building digital learning experiences and is passionate about making quality education accessible to everyone. She has worked across user-centered design, product development and engineering at Samsung and Adobe to build engaging digital experiences that make learning fun. Sindhuja received her Masters from UC Berkeley, where she specialized in technology for international development and began building Dost.",
            "linkedin": "htttp://www.linkedin.com/in/sindhujajeyabal"
        },
        {
            "name": "Sneha Sheth, Founder/CEO",
            "description": "Sneha is passionate about using entrepreneurship to solve educational inequality in the world. She started Dost while completing her MBA at UC Berkeley. She has experience designing programs for women’s empowerment, financial inclusion and education across the world. In previous roles, she advised clients like Goldman Sachs, the Gates Foundation, Teach For India, and UN Women. She’s a Mulago Rainer Arnhold Fellow and GLG Social Impact Fellow.",
            "linkedin": "https://www.linkedin.com/in/snehaksheth"
        }
    ],
    "status": true,
    "generated_description": "**Dost Education: Empowering Parents for a Brighter Future**\n\nFounded in 2017 and part of Y Combinator’s W17 batch, Dost Education is a nonprofit based in Delhi, India, committed to ensuring that every child is ready for school. The organization has a clear mission: to improve early childhood development in low-resource settings through parent education. With an impressive journey from a pilot project involving a few hundred mothers to reaching over 100,000 families, Dost Education is leveraging the power of technology and user-centric design to transform the lives of families across India.\n\n### The Need for Early Childhood Development\n\nIn India, there are about 150 million under-resourced caregivers. These individuals, regardless of their literacy level, play a crucial role in their children’s education and life readiness. Experts agree that enhancing parents' capabilities is a cost-effective way to address the cycle of illiteracy and promote early childhood development. Dost Education fills this gap by providing accessible educational resources tailored for all parents.\n\n### Innovative Approach\n\nDost’s model is refreshing and grounded in proven strategies. They create simple, actionable steps based on scientific research that parents can easily integrate into their daily routines. Recognizing that parents already carry mobile phones, Dost leverages this by delivering short, friendly audio content directly to families. This approach not only personalizes the learning experience but also scales effectively without losing relevance.\n\n### A Diverse and Passionate Team\n\nWith a team of 30 dedicated professionals, Dost Education comprises educators, entrepreneurs, and engineers all driven by a shared passion for creating impactful change. The organization also aligns itself with principles of diversity and inclusivity, ensuring that all families can benefit from its programs.\n\n### Support and Community Engagement\n\nDost Education is supported by esteemed funders in both the tech and social impact spaces, including Y Combinator and Mulago. The organization thrives on community involvement, welcoming interested partners to pilot their initiatives in various communities.\n\n### Join the Movement\n\nDost Education invites everyone to be a part of this transformative journey. By empowering parents as leaders in early education, they are not just preparing children for school but paving the way for a future where each child's potential can truly flourish.\n\nFor more information or to support their mission, visit [Dost Education’s website](http://www.dosteducation.com/).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/87041d24371866dc432df97d794d235b7b56f9ec.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191125Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=e16e59a3f389a620e94988174bda88e27f53bccf17bd7bc1c49254939dfa8dbb",
    "social_links": [
        "https://www.linkedin.com/company/dost-education/",
        "https://twitter.com/DostEducation",
        "https://www.facebook.com/dosteducation/",
        "https://www.crunchbase.com/organization/dost-education",
        "https://github.com/DostEducation"
    ],
    "logo_path": "data/logos\\Dost_Education_logo.png"
}