{
    "links": "https://www.ycombinator.com/companies/dover",
    "name": "Dover",
    "headline": "Supercharge your hiring",
    "batch": "S19",
    "description": "Dover gives you actionable data, supercharges your team’s workflows, and enables you to engage talent at scale so you can deliver an amazing candidate experience. We combine best-in-class candidate evaluation technology with bespoke process automation to help companies find and hire top talent for their open roles.\r\n\nRecruiting is a $50B/year industry in the US, but recruiting departments and agencies still have incredibly manual processes. \r\n\nWe've built a better way. Our advanced matching software identifies the perfect candidates across all recruiting channels and drives the hiring process to create a seamless, white-glove experience for both companies and candidates.\r\n\nDover went through Y Combinator in 2019, and today 200+ companies use our product to run a better hiring process. We've raised $23M from top VCs. We're a remote team of 50+ with hubs in San Francisco and NYC and a presence in Denver, LA, and Seattle.",
    "activity_status": "Active",
    "website": "https://dover.com",
    "founded_date": 2019.0,
    "team_size": 25.0,
    "location": "New York",
    "group_partner": "Michael Seibel",
    "group_partner_yc": "https://www.ycombinator.com/people/michael-seibel",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:b2b; industry:recruiting; location:new-york",
    "founders": [
        {
            "name": "George Carollo, Founder",
            "description": "Working hard: Founder at Dover (S19) –– free recruiting tools for startups",
            "linkedin": "http://www.linkedin.com/pub/george-carollo/2b/35a/7b2"
        },
        {
            "name": "Max Kolysh, Founder",
            "description": "Founder at Dover (S19) –– the free ATS for startups",
            "linkedin": "https://www.linkedin.com/in/maxkolysh"
        },
        {
            "name": "Anvisha Pai, Founder",
            "description": "MIT Computer Science grad, previously Dropbox + several startups. Forbes 30 Under 30 for Enterprise Tech.\n\nLeading Eng Product & Design at Dover (YC S19).\n\nI live in NYC now but visit SF often",
            "linkedin": "https://linkedin.com/in/anvisha"
        }
    ],
    "status": true,
    "generated_description": "Dover is a forward-thinking company that aims to revolutionize the hiring process with the mission to \"Supercharge your hiring.\" Founded in 2019 and part of Y Combinator's batch S19, Dover combines sophisticated data-driven candidate evaluation technologies and process automation. This is crucial in a U.S. recruiting industry worth $50 billion that is still hampered by labor-intensive methods. \n\nDover's product helps organizations engage talent on a massive scale while providing a smooth and enjoyable experience for candidates. Their advanced matching software has been designed to seamlessly identify optimum candidates from multiple channels—streamlining the tedious parts of the hiring process. A unique feature is their “white-glove” service approach, which emphasizes concierge-level support for both firms and job seekers.\n\nCurrently, over 200 companies are leveraging Dover’s platform, which has attracted $23 million in funding from notable venture capitalists. The company operates as a remote team of over 50 personnel, with significant presence in San Francisco, New York City, as well as in other areas like Denver, LA, and Seattle.\n\nSpeaking of their tools, they offer a free Applicant Tracking System (ATS) and sourcing capabilities aimed at startups, enabling quick and effective hiring. Besides this, they provide access to recruiting partners who assist with everything from candidate searches to handling logistics. With current pricing tailored for startups, their ATS is free while their recruiting partner services are offered on an hourly basis without any long-term commitment.\n\nDover's commitment to transparency is reflected in the way they track the cost per hire and the fill rates, allowing companies to choose recruiters based on how efficiently they perform.\n\nIn a nutshell, Dover stands out in the overly complex recruiting landscape by providing streamlined, tech-enhanced solutions that save time and money, all while building great teams. If you’re keen on improving your hiring process, you might want to check them out at [Dover.com](https://dover.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/f7c845edc5b171d7b4681806c9810d95daadcb3b.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191126Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=b0bc2656460f872f330add408ca924ce7f22c8e25e4dcf61e19d14eb6b1c9505",
    "social_links": [
        "https://www.linkedin.com/company/doverhq",
        "https://twitter.com/DoverHq",
        "https://www.facebook.com/doverhq",
        "https://www.crunchbase.com/organization/dover-37be"
    ],
    "logo_path": "data/logos\\Dover_logo.png"
}