{
    "links": "https://www.ycombinator.com/companies/downtobid",
    "name": "Downtobid",
    "headline": "Using AI to understand construction plans faster.",
    "batch": "S19",
    "description": "Our product helps GCs automatically identify scopes of work, find qualified local subcontractors, and send personalized bid invites.",
    "activity_status": "Active",
    "website": "https://downtobid.com",
    "founded_date": 2019.0,
    "team_size": 5.0,
    "location": "New York",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:construction; location:new-york",
    "founders": [
        {
            "name": "Andy Lee, Founder",
            "description": "Downtobid - AI to understand construction plans faster",
            "linkedin": "https://www.linkedin.com/in/andy-lee-36365963/"
        },
        {
            "name": "Kevin Wu, Founder",
            "description": "currently building downtobid.  previously BCG. previously previously professional gamer.",
            "linkedin": "https://www.linkedin.com/in/kevinswu/"
        }
    ],
    "status": true,
    "generated_description": "**Company Overview: Downtobid**\n\nFounded in 2019 and a proud member of Y Combinator's S19 batch, Downtobid is a New York-based company that is revolutionizing the construction bidding process using artificial intelligence. Their mission is simple yet ambitious: to help general contractors (GCs) and trade contractors understand construction plans faster and more efficiently.\n\n**What They Do**\n\nDowntobid offers a suite of AI-driven tools designed specifically for the construction industry. Their products include:\n\n- **ITB Tool for Commercial GCs**: This tool simplifies the process for GCs to automatically identify scopes of work, send personalized invitations to subcontractors, and ultimately streamline bid management.\n- **Bid Board for Commercial Trade Contractors**: A platform that allows trade contractors to manage all their bid invitations, deadlines, and communications, centralizing everything in one dashboard without laborious manual data entry.\n\nThe focus is on connecting GCs with vetted subcontractors, ensuring that invitations go out quickly and effectively, while also allowing subcontractors to respond with ease.\n\n**Why Downtobid Stands Out**\n\nIn a market where outdated tools can cost general contractors time and frustrate project timelines, Downtobid offers a compelling solution. Their platform has over 57,000 active subcontractor profiles, simplifying the search for reliable partners and targeting bids more effectively. With features like automated follow-ups and a contractor-friendly planroom, their tools not only increase efficiency but also foster better relationships in the bidding process.\n\nDowntobid is particularly attractive for those looking to optimize their time and bidding results. They boast double the response rates on invitations—the kind of leverage any contractor would want. They even offer 95% trade coverage, making expansion into new markets less daunting.\n\n**The Team and Vision**\n\nBased in New York with a dedicated team of five, Downtobid is guided by strategic insights and a vision to reshape the bidding landscape. Their group partner, Nan, adds weight to their growth ambitions. \n\n**Success Stories and Future Prospects**\n\nSuccesses are already rolling in. Contractors using Downtobid report significant time saved, enhanced bid management, and increased opportunities. For instance, George H. Pastor & Sons doubled their subcontractor responses and cut down administrative hours drastically by leveraging Downtobid's tools.\n\nThe future looks promising for Downtobid as they continue to disrupt and elevate the construction bidding landscape with more innovations on the horizon. Curious about how these tools work in practice? You can explore them further on their website: [Downtobid.com](https://downtobid.com).\n\nIn short, if you’re a general contractor or trade contractor looking to streamline your bidding efforts and enhance productivity, Downtobid could be your next best move.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/a2e906ebd097909aaa61c47420bd87a496ffb58e.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191126Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=7ac2619a5029c1b30ca0a910c68a10b932edeea79c5be52736aef2496a234964",
    "social_links": [
        "https://www.linkedin.com/company/downtobid/about/"
    ],
    "logo_path": "data/logos\\Downtobid_logo.png"
}