{
    "links": "https://www.ycombinator.com/companies/draftaid",
    "name": "Draftaid",
    "headline": "Go from 3D models to CAD drawings using AI",
    "batch": "W24",
    "description": "DraftAid is the world's first generative AI for CAD manufacturing drawings, akin to GitHub Copilot but for CAD. It drastically shortens drawing creation time, turning hours into seconds.\r\n\nEvery product that is manufactured - from construction to aerospace, automotive, durable goods, and electronics—relies on drawings. Currently, engineers and designers painstakingly make these essential drawings manually. Draftaid streamlines this process saving teams millions in time and quality. \r\n\nThe idea was born out of Abdullah's experience as a mechanical design team member, where he created thousands of drawings and longed for a more efficient process. Partnering with Tahsin, a neighbour with a PhD in AI, and Mohammed, a seasoned engineering VP with experience in construction software, they turned the dream into reality.\r\n\nSince their launch in August, DraftAid has engaged customers through targeted outreach and word-of-mouth, securing paid pilots with subsequent contracts valued at $150,000.\r\n\nBe a part of ushering in the new era of CAD designs!",
    "activity_status": "Active",
    "website": "https://draftaid.io/",
    "founded_date": 2023.0,
    "team_size": 3.0,
    "location": "Toronto, Canada",
    "group_partner": "Tom Blomfield",
    "group_partner_yc": "https://www.ycombinator.com/people/tom-blomfield",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:construction; industry:design; industry:manufacturing; industry:architecture; industry:ai-assistant",
    "founders": [
        {
            "name": "Mohammed Al-arnawoot, Founder",
            "description": "Founder and CEO of DraftaidHe studied Mechatronics engineering at University of Waterloo with a focus on manufacturing systems. Before DraftAid, Mohammed worked as a Director of Engineering at Dozr, a Series B construction tech company. Where he wore many hats building a rockstar engineering team to deliver a new category of product. Before that he was a VP of eng. at Emagin (acquired by Innovyze), where he lead product solution development.",
            "linkedin": "https://www.linkedin.com/in/mohammed-al-arnawoot/"
        },
        {
            "name": "Abdullah Elqabbany, Founder",
            "description": "Abdullah is an electromechanical engineer with years of experience in design and manufacturing. In his last role Abdullah led manufacturing process automation where he worked to bridge the gap between design and manufacturing. Prior to that, he worked as a drafter where he made thousands of CAD drawings shaping Toronto’s skyline. DraftAid is the culmination of years of experiences solving the biggest challenges facing teams trying to go from design to manufacturing as efficiently as possible.",
            "linkedin": "https://linkedin.com/in/abdullah-elqabbany-8160551a8"
        },
        {
            "name": "Tahsin Rahman, Founder",
            "description": "Cofounder and CTO of Draftaid, Tahsin has a PhD from the University of Toronto in Electrical and Computer Engineering. He has pioneered algorithms and machine learning techniques at the intersection of geometry, wireless communications, and quantum computing. Previously, he led a team of engineers and researchers in developing cyber security AI/ML systems for the Canadian Department of National Defence.  Rewind 10 years and you would see him orchestrating instrumentation systems in Oil and Gas.",
            "linkedin": "https://linkedin.com/in/muhammed-tahsin-rahman"
        }
    ],
    "status": true,
    "generated_description": "**Company Overview: Draftaid**\n\nDraftaid, founded in 2023 and based in Toronto, Canada, is revolutionizing the way we think about CAD (Computer-Aided Design). The company’s mission is clear and bold: to transition from 3D models to CAD drawings using AI—essentially compressing what used to be hours of tedious work into mere seconds. \n\nImagine a tool that's like GitHub Copilot, but for CAD drawings. That’s Draftaid—dubbed the world's first generative AI designed specifically for CAD manufacturing drawings. This innovation not only streamlines the drawing creation process but also saves countless hours for engineers and designers across various sectors including construction, aerospace, automotive, durable goods, and electronics.\n\n### Origin Story\n\nThe concept for Draftaid emerged from the firsthand experiences of co-founder Abdullah, a mechanical design team member. After generating thousands of drawings, he recognized a critical need for efficiency. Joining forces with Tahsin, an AI expert, and Mohammed, a seasoned engineering VP, they transformed that vision into the reality of Draftaid. Their collaboration has propelled the company into the limelight, securing initial pilots and contracts amounting to $150,000 since its launch in August.\n\n### Key Features\n\n- **AI-Powered Automation**: Draftaid dramatically accelerates the creation of fabrication drawings, minimizing the time from weeks to just minutes while maintaining high levels of precision and consistency.\n- **Seamless Integration**: It works effortlessly with major 3D modeling software, enabling teams to enhance their current workflows without the chaos of extensive retraining.\n- **Customization UI**: The platform is designed to be tailored for specific project requirements, which guarantees high-quality output that meets varied engineering standards.\n\n### Reception\n\nThe early feedback from users has been overwhelmingly positive. Clients report transformative improvements, likening their experiences to a significant jump in productivity. Drawings that they previously spent countless hours on can now be generated quickly and accurately, allowing engineers to focus on more impactful tasks rather than mundane manual work. \n\n### Engaging With Draftaid\n\nDraftaid is poised to lead a new era in CAD design, making it an exciting opportunity for engineers and organizations keen on boosting efficiency. With a small but dedicated team of three, and backed by the mentorship of Tom Blomfield from Y Combinator Batch W24, Draftaid is set to make waves in the construction and design industries.\n\nFor more information, or to see Draftaid in action, you can check out their website at [Draftaid.io](https://draftaid.io/) or schedule a demo to experience firsthand how they can help streamline your fabrication drawing process.\n\nIn a world where every second counts, Draftaid offers a compelling solution to an age-old problem. The future of CAD design seems not just brighter, but also much faster.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/7d212f8782603b6f5b73b38c677e3f7835230312.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191126Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=5f7d672d61da9d66aeb4776de71c6c3084cf4fa409ffcf677a7655e685f08cb0",
    "social_links": [
        "https://www.linkedin.com/company/draftaid"
    ],
    "logo_path": "data/logos\\Draftaid_logo.png"
}