{
    "links": "https://www.ycombinator.com/companies/draftbit",
    "name": "Draftbit",
    "headline": "Build mobile apps visually. Source-code included.",
    "batch": "W18",
    "description": "We're building Draftbit to make it easier for everyone to build, launch, and iterate on mobile apps. And do it without writing code, unless you want to. Over time, we hope to make building great looking, high quality apps as easy as (or easier than?!) launching a website is now. And by doing so, we hope to democratize software development, allowing anyone to turn their idea into reality, and build it into something great.",
    "activity_status": "Active",
    "website": "https://draftbit.com",
    "founded_date": 2018.0,
    "team_size": 10.0,
    "location": "Chicago, IL",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:developer-tools; industry:design-tools",
    "founders": [
        {
            "name": "Brian Luerssen, Founder/CEO",
            "description": "Hey there -- I'm one of the co-founders of Draftbit, a new way to visually design, build, and iterate on cross-platform mobile applications. https://draftbit.com\n\nBefore Draftbit, I created and was General Manager of OkCupid Labs, based in San Francisco. OkCupid Labs is the new business creation arm of Match.com and IAC Personals (NASDAQ: IACI). Prior to working at OkCupid, I co-founded Quantitative Insights, a machine-learning focused medical imaging and healthcare IT company (acquired).",
            "linkedin": "http://www.linkedin.com/in/brianluerssen/"
        }
    ],
    "status": true,
    "generated_description": "Draftbit is rewriting the playbook on mobile app development. Founded in 2018 and part of Y Combinator's W18 batch, this Chicago-based startup is on a mission to democratize the app-building process by enabling anyone, regardless of coding expertise, to visually build and launch mobile applications. The idea is simple yet transformative: if creating a mobile app can be as easy as launching a website, then more people can bring their ideas to life without getting bogged down by technical hurdles.\n\nAt its core, Draftbit empowers users to design, build, and publish apps, all in one place—while also providing the convenience of including the source code. This means you won’t hit a wall where you're stuck with proprietary tools. You're free to iterate and evolve your creations as you wish.\n\nDraftbit operates in the developer and design tools sectors, catering to entrepreneurs and builders looking for a more straightforward path to app development. With a tight-knit team of around 10 employees, they emphasize collaboration through their platform, allowing teams to share feedback and streamline their development processes.\n\nYou can start exploring what Draftbit has to offer by visiting their website at [Draftbit.com](https://draftbit.com), where you can dive into features, pricing, and success stories from other builders who have benefited from the platform. It's an invitation to build anything you can imagine, backed by support and expertise if you need it. In a landscape where access to technology can be a barrier, Draftbit is doing the crucial work of making mobile app development accessible and efficient for all. \n\nSo, if you've got an app idea brewing, why not see if Draftbit can help bring it to fruition? It's time to take that leap.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/a7bb42cc549c9c2df8b2b11c7e8073b43e2891c7.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191127Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=4a034ffc5e60195ef0b21d009d97163b81f1369bf84e91dbc298b09fe46faea5",
    "social_links": [
        "https://www.linkedin.com/company/draftbit/",
        "https://twitter.com/draftbit",
        "https://www.crunchbase.com/organization/draftbit",
        "https://github.com/draftbit"
    ],
    "logo_path": "data/logos\\Draftbit_logo.png"
}