{
    "links": "https://www.ycombinator.com/companies/dreamerly",
    "name": "Dreamerly",
    "headline": "Art commission marketplace",
    "batch": "S21",
    "description": null,
    "activity_status": "Active",
    "website": "https://dreamerly.com",
    "founded_date": 2021.0,
    "team_size": 4.0,
    "location": "Singapore, Singapore",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:art-trading-platforms; industry:marketplace",
    "founders": [
        {
            "name": "Viet Long Tran, Founder",
            "description": "Long is the CEO and Co-founder of DanteHQ. Previously, he worked as a machine learning engineer at Bytedance and Quora and as an equity associate at AllianceBernstein. Long is also the co-founder and advisor of Pencil Philosophy, a liberal arts education non-profit program in Vietnam. He earned a Master's degree from Stanford and a Bachelor's degree from Columbia with Phi Beta Kappa and summa cum laude.",
            "linkedin": "https://www.linkedin.com/in/longvtran/"
        },
        {
            "name": "Thanh Nguyen, Founder",
            "description": "Thanh is the CTO and Co-founder of Tinai. Previously, he was working as a software engineer for Amazon Fashion and Amazon Advertising for 6 years.",
            "linkedin": "https://www.linkedin.com/in/thanh-n-43467a3a/"
        }
    ],
    "status": true,
    "generated_description": "**Dreamerly: Bridging Art and Opportunity**\n\nFounded in 2021 and based in Singapore, Dreamerly is an innovative marketplace for art commissions, fostering a unique environment where artists and clients can connect, collaborate, and create. Initially part of Y Combinator's S21 batch, Dreamerly has quickly carved out a niche in the art community by facilitating the commission process across various genres, including illustration, anime, and traditional art forms.\n\n### The Heart of Dreamerly\n\nThe mission of Dreamerly is clear: to serve as a comprehensive platform for art commissions. With a small but dedicated team of four, the company is structured to respond rapidly to the evolving needs of artists and commissioning clients alike. Visitors can explore a diverse array of artwork and commission options directly on their user-friendly website [dreamerly.com](https://dreamerly.com).\n\n### Features & Offerings\n\nDreamerly’s marketplace allows users to post commission briefs, enabling artists to apply and showcase their portfolios. They categorize services under various tags, such as \"art-trading-platforms\" and \"marketplace,\" ensuring that both creators and buyers can navigate easily. Notably, the platform champions diverse artistic expressions, allowing engagement in areas from anime designs to personalized character sketches.\n\nDreamerly distinguishes itself with features like portfolio displays for artists, ratings and reviews, and a seamless briefing process for clients looking to commission specific pieces. The marketplace is designed to streamline these interactions, making the commissioning process as smooth as possible.\n\n### Vision for the Future\n\nAs they continue to grow, Dreamerly aims to scale its operations and expand its offerings. They envision a community-driven platform, where artists can not only thrive creatively but also build meaningful connections with clients and fellow artists.\n\nWith its roots in innovation and community, Dreamerly stands to redefine how art commissions are perceived and conducted, positioning itself as a vital link in the artistic and entrepreneurial ecosystems. \n\n**In Summary:** Dreamerly is not just a marketplace; it's a vibrant community for artists to flourish, connect, and create incredible artwork, one commission at a time.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/64a881180ea37811b49231712df109c9c79e141e.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191127Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=06b4550e542bc86125d5c02da1552818623b82841b5cff58147b807cfd846c24",
    "social_links": [],
    "logo_path": "data/logos\\Dreamerly_logo.png"
}