{
    "links": "https://www.ycombinator.com/companies/drip-capital",
    "name": "Drip Capital",
    "headline": "Digital trade financing for small businesses",
    "batch": "S15",
    "description": "Drip is a digital trade finance startup.  Trade finance is an age-old paper-based industry dominated by banks that focus on large, established corporate customers. Today, however, small businesses account for 40% of trade, but still remain neglected by banks. Drip is using technology to re-build core parts of the trade finance infrastructure and make the underwriting and financing of B2B transactions seamless for small businesses. Our mission is to level the playing field for small businesses and to finance their trade at the click of a button.\r\n\nDrip consists of experts in both finance and technology and has offices in Palo Alto and Mumbai. Drip is backed by top tier investors Accel,  Sequoia, Wing, Initialized and Y Combinator.",
    "activity_status": "Active",
    "website": "http://dripcapital.com",
    "founded_date": 2015.0,
    "team_size": 280.0,
    "location": "India",
    "group_partner": "Garry Tan",
    "group_partner_yc": "https://www.ycombinator.com/people/garry-tan",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech",
    "founders": [],
    "status": true,
    "generated_description": "Drip Capital is shaking up the age-old world of trade finance by putting small businesses front and center. Founded in 2015 and part of Y Combinator's S15 batch, Drip Capital is based in Palo Alto and Mumbai, with a team of over 280 experts in finance and technology. Their mission is straightforward: provide digital trade financing to small businesses that have historically been overlooked by traditional banks.\n\nThe traditional trade finance model relies heavily on paper and is focused on large corporations, but small businesses now account for a significant 40% of global trade. Drip uses technology to streamline this process, allowing small businesses to finance their B2B transactions with just a few clicks. This is not just about convenience; it's about leveling the playing field for those who have been left behind.\n\nDrip Capital provides a simple and efficient platform for cash flow management, where businesses can submit invoices and receive advances, often within 24 hours and without the necessary collateral that traditional banks require. Their offerings include invoice factoring, cost-efficient solutions, and the promise of transparent, flexible payment terms. This kind of access can free up existing bank limits and enhance overall liquidity, which is vital for growth, especially during peak seasons.\n\nThey're backed by powerhouse investors such as Accel, Sequoia, Wing, Initialized, and Y Combinator, signaling strong confidence in their approach. With Garry Tan serving as Group Partner, Drip represents a merging of expertise and innovation in the fintech space.\n\nFor small businesses looking to take control of their financial future, Drip Capital might just be the answer. You can learn more or get started at [Drip Capital's website](http://dripcapital.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/e26d5fa4d50324837b6efd1d2583953e121026a3.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191128Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=df708eed407bb84712d4d50372537726f5687960f39f9f2fbfc9b0252444d4e3",
    "social_links": [
        "https://www.linkedin.com/company/dripcapital/",
        "https://twitter.com/DripCapital_Inc",
        "https://www.crunchbase.com/organization/drip-capital",
        "https://github.com/dripcapital"
    ],
    "logo_path": "data/logos\\Drip_Capital_logo.png"
}