{
    "links": "https://www.ycombinator.com/companies/dropback",
    "name": "Dropback",
    "headline": "The front office software suite for college sports",
    "batch": "W24",
    "description": "Dropback is building front office software for the future of college sports. We help major athletic departments manage their teams' \"salary caps\" and roster limits to construct their most competitive rosters.\r\n\nJust two years ago, it became legal for athletes to earn an income beyond their scholarships. Since then, despite college athletes earning $2B+, rapid regulation change has put college sports in disarray. Dropback brings order to this chaos through custom compensation frameworks, roster management, what-if playgrounds, and more--ultimately helping elite programs optimize spend & maximize talent.",
    "activity_status": "Active",
    "website": "https://www.dropback.com",
    "founded_date": 2024.0,
    "team_size": 2.0,
    "location": "Roeland Park, KS",
    "group_partner": "Dalton Caldwell",
    "group_partner_yc": "https://www.ycombinator.com/people/dalton-caldwell",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:sports-tech; industry:finance; industry:hr-tech; industry:operations",
    "founders": [
        {
            "name": "Luke Bogus, Co-Founder",
            "description": "Before Dropback, Luke was Head of Product for Vial, a Series B life science tech startup, helping zero-to-one new clinical trial infrastructure that now generates millions in ARR. Prior, Luke was a Product Manager at Microsoft, and studied computer science and marketing at Nebraska's Raikes School.",
            "linkedin": "https://linkedin.com/in/lukebogus"
        },
        {
            "name": "Nick Siscoe, Founder",
            "description": "Building tech to power the front office of elite college sports teams @ dropback.com",
            "linkedin": "https://linkedin.com/in/nick-siscoe-58a1099b"
        }
    ],
    "status": true,
    "generated_description": "### Dropback: The Future of College Sports Management\n\n**Founded**: 2024  \n**Location**: Roeland Park, KS  \n**Team Size**: 2  \n**Y Combinator Batch**: W24\n\n---\n\n#### Mission\nDropback provides an innovative front office software suite specifically designed for college sports. The platform aims to help athletic departments efficiently manage their teams' roster limits and salary caps, enabling them to build competitive rosters.\n\n---\n\n#### Context\nIn 2021, the landscape of college athletics changed dramatically when it became legal for athletes to earn an income beyond their scholarships. This move unleashed a financial wave—over $2 billion flowing into the hands of athletes. However, it also created a chaotic regulatory environment. Enter Dropback, which brings order to this newfound complexity. With customized compensation frameworks and roster management tools, Dropback assists elite programs in optimizing spending while maximizing talent.\n\n---\n\n#### Features\nDropback combines both back office operations and front office strategy through its all-in-one tech stack. Here's what they offer:\n\n- **Custom Compensation Structures**: Tailor contracts and payout schedules that fit your program's financial strategies.\n- **Roster Management**: Create and manage dynamic and competitive rosters across various sports.\n- **What-If Scenarios**: Experiment with different strategies for roster construction and salary cap management to see what will give you the best edge.\n- **Budget Monitoring**: Track spending against both internal targets and league rules for compliance.\n- **Data-Driven Insights**: Utilize analytics to make informed decisions when valuing athletes and assessing team needs.\n  \nWith these tools, Dropback allows general managers and coaches to collaborate effectively, putting data at the forefront of talent evaluation and roster planning.\n\n---\n\n#### Key People\n- **Group Partner**: Dalton Caldwell, an experienced figure in driving growth and innovation within the sports-tech space.\n\n---\n\n#### Tags\nDropback is categorized under sports-tech, finance, HR-tech, and operations, showcasing its broad applicability and focus on enhancing performance through technology.\n\n---\n\n#### Future Vision\nAs college athletics continues to evolve, tools like Dropback are essential for programs aiming to stay competitive while navigating a complex financial landscape. Their recent fundraising efforts of **$1.6 million** indicate a strong belief in their vision and potential for scalability.\n\nFor more information or to see Dropback in action, check out their website: [Dropback](https://www.dropback.com).\n\n---\n\nIn a world where every dollar and every athlete counts, Dropback is charting a path towards smarter, data-driven decision-making in college sports. It’s refreshing to see tech helping athletic departments adapt to the changing game—after all, when talent meets efficient management, great things can happen.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/063a851e6e06749351a4de191402a1ee9ed7757a.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191128Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=70cf6d9a98db1985b511eaea3df519fe4404aa1563e29ddd86e8e22ce3f5b75f",
    "social_links": [
        "https://www.linkedin.com/company/dropback-hq",
        "https://twitter.com/dropbackhq"
    ],
    "logo_path": "data/logos\\Dropback_logo.png"
}