{
    "links": "https://www.ycombinator.com/companies/durioo",
    "name": "Durioo",
    "headline": "Streaming Platform for Muslim Children",
    "batch": "W22",
    "description": "We create and license high quality Islamic cartoons and shows that kids watch on our subscription app.\r\n\nWe are the right team to do this because we previously created an Islamic cartoon with more than 3 billion views on YouTube.\r\n\nAll parents want their kids to grow up with values and virtues close to them. The same goes for Muslim parents - but the reality is - they are struggling to get high quality Islamic content for their kids.\r\n\nWe are addressing an underserved market of 70 million Muslim families with internet access globally.",
    "activity_status": "Active",
    "website": "http://www.durioo.com",
    "founded_date": 2021.0,
    "team_size": 50.0,
    "location": "Cyberjaya, Malaysia",
    "group_partner": "Jared Friedman",
    "group_partner_yc": "https://www.ycombinator.com/people/jared-friedman",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:entertainment; industry:subscriptions",
    "founders": [
        {
            "name": "Sinan Ismail, Founder",
            "description": "I am the Founder and CEO at Durioo.\n\nI love to inspire happy-ness, and I am blessed by able to do that via creation of animations and games. In my previous venture, we created Omar & Hana and Didi & Friends that has more than 8 billion views and 7 million subscribers on YouTube.\n\nNothing drives me more than to create impact. Impact to children, impact to parents, impact for my team, impact for our investors, impact for our partners - and most importantly - a positive impact to the world :)",
            "linkedin": "https://www.linkedin.com/in/sinanismail/"
        }
    ],
    "status": true,
    "generated_description": "Durioo is carving out a significant niche in the streaming landscape as a dedicated platform for Muslim children's entertainment. Founded in 2021 and incubated in Y Combinator's W22 batch, the company is rooted in the belief that children should be surrounded by content that instills values and virtues relevant to their upbringing. Based in Cyberjaya, Malaysia, Durioo has a robust team of 50 and was founded by creators who previously launched an Islamic cartoon that amassed over 3 billion YouTube views.\n\nThe mission of Durioo is straightforward yet profound: to provide high-quality, safe, and engaging Islamic content for the 70 million Muslim families with internet access globally. This is no small task given that many parents struggle to find suitable media for their children. Durioo+ is their flagship subscription service, featuring a wealth of animated shows, curated specifically to nurture a love for Islam while being fun and educational.\n\nThe platform has garnered impressive ratings—4.8 stars on the App Store—driven by its family-friendly approach. The content is ad-free and rigorously vetted, ensuring that parents can feel confident in what their children watch. Users can enjoy the service on multiple devices, including TVs and mobile devices, which adds a layer of convenience for tech-savvy families.\n\nBacked by Sam Altman and Jared Friedman, among others, Durioo is not only about entertainment but a holistic approach to learning in a way that aligns with Islamic values. With thousands of fun and safe video options already downloaded by over 500,000 Muslim parents worldwide, it’s clear that Durioo is meeting a deep-seated need within the community.\n\nIf you're looking for a way to enrich your children's understanding of their faith through entertaining content, Durioo is worth exploring. You can start a free trial at their website [durioo.com](http://www.durioo.com) and see how they’re making faith-based learning a fun experience for kids today.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/f2bc11a52510b1121ff16e32aeae30beccf1162c.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191129Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=4201d2ab157cf1d090a2b732128429c43117c86b1d3b25c2017a1bc2d8cb08f5",
    "social_links": [
        "https://www.linkedin.com/company/durioocom",
        "https://www.crunchbase.com/organization/durioo-dc5f"
    ],
    "logo_path": "data/logos\\Durioo_logo.png"
}