{
    "links": "https://www.ycombinator.com/companies/dyspatch",
    "name": "Dyspatch",
    "headline": "Two products to help everyone email better. Dyspatch.io - Emailâ\u0080¦",
    "batch": "W14",
    "description": "Dyspatch by Sendwithus is a powerful communications platform built around advanced email content management. Our platform simplifies transactional email creation with a robust API, an easy to use editor, and built-in device testing, allowing for truly collaborative email strategy and execution.\r\n\nA centralized hub for email creation, approval, and publishing, our cloud-based solution empowers Product, Marketing, CRM, and Loyalty teams to efficiently build and test meaningful, dynamic communications without involving developers or deploying code. And with built-in support for 300+ locales, your teams can seamlessly manage localized content for global communications.\r\n\nEasily connect your cloud email provider or customize your integration to connect to your digital messaging service. Upload your existing templates in minutes. And from there, youâ\u0080\u0099re well on your way to optimizing every email you send.",
    "activity_status": "Active",
    "website": "https://www.dyspatch.io",
    "founded_date": null,
    "team_size": 20.0,
    "location": "Victoria, Canada",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:saas; industry:b2b",
    "founders": [],
    "status": true,
    "generated_description": "**Company Overview: Dyspatch**\n\nDyspatch is a SaaS company based in Victoria, Canada, that aims to revolutionize how businesses communicate via email. Their mission is simple yet impactful: to help everyone email better. Founded as Dyspatch by Sendwithus and part of Y Combinator Batch W14, Dyspatch is a powerful communications platform designed around advanced email content management.\n\n### What They Do\n\nAt its core, Dyspatch provides a centralized hub for email creation, approval, and publishing. Whether you're in Product, Marketing, CRM, or Loyalty teams, their cloud-based platform allows you to build and test tailored communications without coding. Think of it as giving non-technical teams the tools to craft sophisticated, dynamic emails that drive engagement. With support for 300+ locales, you can manage global communications effortlessly.\n\nKey features include:\n\n- **No-Code Email Builder:** No need for coding skills to create engaging emails.\n- **Email Collaboration Tools:** Get teams aligned with built-in commenting and approval workflows.\n- **Template Localization:** Easily customize emails for different regions and languages.\n- **AMP for Email:** Create interactive email experiences that engage users in real time.\n\n### Impact\n\nDyspatch boasts impressive stats: they claim to reduce engineering resources by 95%, boost email conversions by 300%, and increase email engagement by a staggering 500%. Trusted by major brands like Canva, BMO, and Postmates, their platform is positioned as a go-to solution for companies looking to streamline their email communications while improving their overall marketing strategy.\n\n### Team and Growth\n\nWith a team of around 20 employees, Dyspatch is small but nimble. Their approach focuses on innovation and strong customer support. The enthusiasm within their team of #emailgeeks stems from a deep commitment to email excellence, helping brands achieve higher engagement and ROI.\n\n### Why Choose Dyspatch?\n\nIf your organization struggles with slow email production, broken templates, or complex localization processes, Dyspatch could be a game-changer. Their modular design system offers flexibility, allowing you to quickly adapt and innovate without getting bogged down by development cycles.\n\n### Conclusion\n\nIn a world where communication is key, Dyspatch stands out as a leading player that empowers businesses to optimize their email strategies. Their user-friendly platform, coupled with insightful support, makes them a valuable partner for any enterprise looking to elevate its email game. For more information, check out their [website](https://www.dyspatch.io).\n\nThis blend of utility and innovation makes Dyspatch not just another email tool; it’s a comprehensive solution for brands keen on staying ahead in digital communications.",
    "logo": "/logos/medium/missing.png",
    "social_links": [
        "https://twitter.com/getdyspatch",
        "https://www.crunchbase.com/organization/sendwithus",
        "https://github.com/getdyspatch"
    ]
}