{
    "links": "https://www.ycombinator.com/companies/eclipse-foods",
    "name": "Eclipse Foods",
    "headline": "Eclipse Foods is building the future of dairy using micelles, theâ\u0080¦",
    "batch": "W19",
    "description": "Eclipse Foods is building the future of dairy using micelles (the microscopic magic of milk.) Eclipse has developed the world's first plant-based dairy platform which makes plant-based products with the taste, texture, and functionality of conventional dairy. \r\n\nWe are transforming the $500B dairy industry and have raised over $60M from leading investors such as Y Combinator, the chairman of Beyond Meat, the founder of Reddit, the creator of Gmail, Forerunner Ventures, Sozo Ventures, Initialized Capital, and more. \r\n\nOur mission is to create a more sustainable, healthy, and humane food system by making plant-based foods that require no sacrifice.",
    "activity_status": "Active",
    "website": "http://www.eclipsefoods.com",
    "founded_date": 2019.0,
    "team_size": null,
    "location": "Oakland, CA",
    "group_partner": "Gustaf Alstromer",
    "group_partner_yc": "https://www.ycombinator.com/people/gustaf-alstromer",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:consumer; industry:climate; industry:food-tech; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Aylon Steinhart, Founder",
            "description": "Aylon is the founder / CEO of Eclipse Foods. Aylon has spoken regularly on food innovation at Harvard, Yale, Berkeley, and Stanford, has been featured in Forbes, WSJ, etc., and has worked with companies such as Nestle and Kelloggâ\u0080\u0099s. At the Good Food Institute, the leading non-profit in alternative proteins, Aylon incubated dozens of startups and advised investors and strategic partners on alternative proteins. Aylon graduated cum laude from UC Berkeley's Haas School of Business.",
            "linkedin": "https://www.linkedin.com/in/aylonsteinhart/"
        },
        {
            "name": "Thomas Elliott Bowman, Founder",
            "description": null,
            "linkedin": "https://www.linkedin.com/in/thomas-bowman-b2a2a9195"
        }
    ],
    "status": true,
    "generated_description": "### Eclipse Foods: A Plant-Based Dairy Pioneer\n\n**Founded**: 2019  \n**Location**: Oakland, CA  \n**Funding**: Over $60M raised, backed by notable investors like Y Combinator, the chairman of Beyond Meat, and the founder of Reddit.  \n**Team**: A small yet dedicated team working on a big vision.\n\n---\n\n**Mission**: At its core, Eclipse Foods is on a mission to revolutionize the $500 billion dairy industry by leveraging plant-based technology to create dairy alternatives that mimic the taste, texture, and functionality of traditional dairy. Their secret sauce? Micelles—the microscopic wonders of milk.\n\n**Core Products**: Eclipse has developed the first-ever plant-based dairy platform, allowing them to churn out a range of products, including their wildly popular plant-based ice creams, which are made from ingredients like corn, cassava, rapeseed, and potato. It’s dairy’s creaminess, without the dairy.\n\n**Sustainability and Ethics**: Eclipse is not just about good taste. They aim to foster a food system that is more sustainable, healthier, and humane. This means creating delicious plant-based foods that require no compromise—that's a win-win for both consumers and our planet.\n\n**Customer Focus**: Eclipse products are evidence that plant-based doesn’t mean tasting like cardboard. Rave reviews flood in from users who can’t believe they’re enjoying vegan treats that taste like the real deal—like their Cookie Butter Crumble and Peanut Butter Brownie ice creams.  \n\n**Community Engagement**: Their presence extends beyond consumer products. Eclipse is committed to raising awareness about plant-based eating and its impact on climate change. Expect to see them in retail stores and foodservice venues, including partnerships with restaurants like Smashburger that are now offering dairy-free milkshakes.\n\n### Why Now?\n\nAs consumers become more conscious of their food choices and how they impact their health and the environment, companies like Eclipse Foods are positioned at the frontier of this evolving market. Their ability to deliver indulgent, sustainable alternatives without sacrificing flavor sets them apart in a crowded space.\n\nFor more information on their offerings, check out their website: [Eclipse Foods](http://www.eclipsefoods.com).\n\n**In Summary**: Eclipse Foods is not just another food tech startup; it’s a bold endeavor to reshape our dairy consumption and meet the demands of a more sustainable future. With innovative products and a passionate vision, they're milking the best from nature’s pantry—truly redefining what dairy can be.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/29ff3098a13e5209b3831e5393669bb4f7a2d8ab.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191131Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=f8a3913ed52c0d4e677cbd65ad2dd124827b3f8bedae5ab09bc2864cca42445d",
    "social_links": [
        "https://www.linkedin.com/company/eclipse-foods",
        "https://twitter.com/eclipse_foods",
        "https://www.facebook.com/eclipsefoodsco/"
    ],
    "logo_path": "data/logos\\Eclipse_Foods_logo.png"
}