{
    "links": "https://www.ycombinator.com/companies/eden-2",
    "name": "Eden",
    "headline": "Digital platforms that enable an outstanding patient experience",
    "batch": "S18",
    "description": "Using infrared technology, we provide a non-invasive, painless, private, and accurate adjunct breast cancer screening in under 10 minutes. Our Eva Centers are located in shopping centers.",
    "activity_status": "Active",
    "website": "https://edenmed.com",
    "founded_date": null,
    "team_size": 55.0,
    "location": "Mexico City, Mexico",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:digital-health; industry:healthcare",
    "founders": [
        {
            "name": "Julián Cantú, Founder/Co-Fundador, CEO",
            "description": "After his mother's painful three-time battle with cancer, Julián Ríos resolved to save lives through developing exceptional products that improve healthcare for everyone. \n\nCurrently, he is the CEO and Co-founder of Eden (edenmed.com), the leading radiology and imaging platform in Latinamerica. Eden creates tools that make radiology and imaging based diagnosis extremely precise and significantly more productive. \n\nIn 2018 Eden (formerly Eva) was named one of the 30 most promising businesses by F",
            "linkedin": "https://www.linkedin.com/in/juli%C3%A1n-r%C3%ADos-cant%C3%BA-903b76106/"
        },
        {
            "name": "Raymundo Gonzalez, Co-Founder / CTO",
            "description": "Skilled in complex problem solving and in communicating with others. I am persistent working both individually and in teams. I always bring with me an innovation mindset, and a desire to make a difference for people. I am interested in technology, entrepreneurship, and engineering.",
            "linkedin": "https://www.linkedin.com/in/raymundo-gzz/"
        },
        {
            "name": "Antonio Torres, Founder/CTO",
            "description": "My job consists mainly of predicting and acting towards the future before it’s even here. Taking calculated risks and innovative decisions that better our company in both the short and long run. I’m in charge of supervising the technological areas of Eva Center and making sure our products and services are of the highest quality.",
            "linkedin": "https://www.linkedin.com/in/toniotgz/"
        }
    ],
    "status": true,
    "generated_description": "**Eden: Revolutionizing Patient Experience in Healthcare**\n\nFounded in Mexico City and a proud member of Y Combinator Batch S18, Eden aims to transform digital healthcare solutions, specifically focusing on enhancing the patient experience. Their mission is succinctly clear: to create digital platforms that enable outstanding patient experiences.\n\nInitially, Eden developed a non-invasive breast cancer screening technology leveraging infrared technology, enabling tests to be completed in under ten minutes at convenient locations like shopping centers. Today, they offer comprehensive solutions through their flagship products: Eden PACS (Picture Archiving and Communication System), Eden Management, and Eden Intelligence. \n\n1. **Eden PACS**: The most advanced cloud PACS system on the market, designed for efficient data management and quick access to diagnostic results.\n2. **Eden Management**: Centralizes operations, facilitating intelligent scheduling and automated communication between healthcare providers and patients.\n3. **Eden Intelligence**: Enhances institutional productivity through data insights, providing healthcare organizations with analytical tools to streamline operations.\n\nEden employs a team of 55 dedicated professionals, serving over 1,800 institutions across 17 countries, impacting more than 10 million patients annually. Their digital solutions are designed to eliminate inefficiencies and provide seamless integration into existing workflows, thereby improving the overall quality of care.\n\nNotable success stories include Telerob, which reported a 60% increase in remote study interpretations using Eden PACS, and Torre Médica, which saw a 19% growth in patient numbers fueled by enhanced referrals due to the efficacy of Eden's technology.\n\nThe future for Eden is bright, as they continue to expand and adapt to the evolving landscape of digital healthcare. By focusing on innovation through technology, they prioritize patient-centered care, making them an important player in the healthcare sector.\n\nFor more information or to schedule a demonstration, you can visit their website at [Eden Med](https://edenmed.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/a2c81d3509a287051a785216744d26551a7879a0.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191132Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=efca7335c7feb4bbcab5251ee44a625433516480c87dd9918a9f93ee6fb5e190",
    "social_links": [
        "https://www.linkedin.com/company/edenmedicalglobal/",
        "https://twitter.com/evacenter_mx",
        "https://www.facebook.com/evacenter.mx/",
        "https://github.com/eva-tech"
    ],
    "logo_path": "data/logos\\Eden_logo.png"
}