{
    "links": "https://www.ycombinator.com/companies/eden-farm",
    "name": "Eden Farm",
    "headline": "Delivering fruits and vegetables to multi-segment restaurants andâ\u0080¦",
    "batch": "S19",
    "description": "Problem:\r\nIndonesia has severe problem in multi-layered food supply chain food  which are very harmful to farmers income and restaurants' raw material cost due to food price volatility.\r\n\nEden's Solution:\r\nCut through the multi-layer middlemen and bring stability to food price in Indonesia thus help stabilise farmers income and lower restaurants raw material cost.\r\n\nFarmers:\r\nWe provide our farmers with revenue guarantee and demand forecast\r\n\nB2B Customer:\r\nOur B2B Customers consist of Restaurant and Cafes, we serve them with stable price and quality guarantee\r\n\nEden's Tech:\r\nOrdering App: Collecting customer order, placing Eden's brand on our customers's desk everyday\r\nERP: Processing supply & demand data to produce demand forecast and internal performance measurement\r\nFarmer's App: Collecting harvest data and communicating Eden's supply need to them.",
    "activity_status": "Active",
    "website": "https://edenfarm.id/",
    "founded_date": 2017.0,
    "team_size": 110.0,
    "location": "Jakarta, Indonesia",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:grocery; industry:supply-chain",
    "founders": [],
    "status": true,
    "generated_description": "**Eden Farm: Simplifying Indonesia's Food Supply Chain**\n\nEden Farm is tackling a significant problem in Indonesia's food supply chain. The complex, multi-layered system has led to volatile food prices, harming both farmers' incomes and the operational costs for restaurants. Founded in 2017 and part of the Y Combinator Batch S19, Eden Farm is based in Jakarta and has a growing team of 110 dedicated employees.\n\n**Mission-Driven Approach**\n\nAt the heart of Eden Farm is a clear mission: to deliver fresh fruits and vegetables directly to multi-segment restaurants while stabilizing food prices across the board. The aim is not just to eliminate middlemen but to create a more predictable and profitable environment for all stakeholders. By cutting out the unnecessary layers, Eden Farm enhances the livelihoods of farmers and reduces raw material costs for restaurants, promoting a healthier ecosystem for food distribution.\n\n**Support for Farmers**\n\nEden Farm stands out for its commitment to farmers. They offer revenue guarantees and demand forecasts, ensuring that farmers know what to expect and can plan their harvests accordingly. This focus on stability helps farmers feel secure and valued in an often unpredictable agriculture landscape.\n\n**B2B Customer Base**\n\nOn the other side, Eden Farm caters to restaurants and cafes by providing a stable pricing structure along with quality guarantees. This assurance is critical for B2B customers who need reliable suppliers amid fluctuating market conditions.\n\n**Innovative Technology**\n\nTo facilitate this ecosystem, Eden Farm has developed several tech solutions:\n- **Ordering App:** Simplifies the ordering process for customers, ensuring that Eden’s brand is consistently present and accessible.\n- **ERP System:** Analyzes supply and demand data to produce accurate demand forecasts and measure internal performance.\n- **Farmer's App:** Bridges communication between Eden Farm and farmers, gathering harvest data and relaying supply needs efficiently.\n\n**In Conclusion**\n\nEden Farm is more than just a grocery and supply chain company. It’s a proactive player striving for fairness in the food economy of Indonesia. By fortifying relationships between farmers and restaurants through technology and fair practices, Eden Farm is poised to create a stable and thriving food supply chain that benefits everyone involved. For more information, you can visit their website at [edenfarm.id](https://edenfarm.id/).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/2307b2f6734d056552b90122cb0aa9590ffc9d5e.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191131Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=cb437080050c2ee7576389e8f42c577f881386363dfe9f779a15f866ab0cf661",
    "social_links": [
        "https://www.linkedin.com/company/14422413",
        "https://www.facebook.com/EdenFarmId/"
    ],
    "logo_path": "data/logos\\Eden_Farm_logo.png"
}