{
    "links": "https://www.ycombinator.com/companies/ello",
    "name": "Ello",
    "headline": "Building the world's first 1:1 AI teacher.",
    "batch": "W20",
    "description": null,
    "activity_status": "Active",
    "website": "https://www.ello.com",
    "founded_date": 2020.0,
    "team_size": 26.0,
    "location": "San Francisco",
    "group_partner": "Michael Seibel",
    "group_partner_yc": "https://www.ycombinator.com/people/michael-seibel",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:education; industry:ai; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Elizabeth Adams, Founder",
            "description": "Elizabeth is a clinical psychologist who specializes in child development, child behavior, academic achievement, and working with children and families in community settings, schools, clinics, and hospitals. She has worked with children and families for over 15 years. She is the co-founder of Ello, the first AI reading coach for children that works with real books.",
            "linkedin": "http://www.linkedin.com/in/elizabeth-adams-ph-d-465bb75"
        },
        {
            "name": "Tom Sayer, Founder",
            "description": "Tom was the head of impact and adoption programs at Google for Education. He is involved in various organizations promoting education, including GO Public schools and Education Reimagined. Tom also has experience as an intelligence officer, product manager, and EdTech company founder. He holds a first-class honors degree in maths and psychology from Cambridge University and an MBA and MA in Education from Stanford. He has won several awards, including the Lamor prize and the Queen's medal.",
            "linkedin": "https://www.linkedin.com/in/tom-sayer"
        },
        {
            "name": "Catalin Voss, Founder",
            "description": "Before co-founding Ello, Catalin was a PhD candidate in AI at Stanford University where he worked on social good projects and built digital therapies for developmental conditions. He co-founded and sold two ML startups, DukaConnect and Sension. He has won the Lemelson-MIT Grad Student prize, Stanford's Kennedy Medal, Forbes' 30 under 30, and Business Insider's 40 under 40. He moved to California from Germany at age 17 and now lives in SF with his partner Ruby and dog Ed.",
            "linkedin": "https://www.linkedin.com/in/catalinvoss/"
        }
    ],
    "status": true,
    "generated_description": "**Company Overview: Ello**\n\nFounded in 2020 and located in the bustling tech hub of San Francisco, Ello aims to revolutionize the education landscape with its mission to create the world’s first 1:1 AI teacher. As a proud member of Y Combinator's Batch W20, Ello is staffed by a dedicated team of 26 employees and led by Group Partner Michael Seibel.\n\n**What They Do**\n\nEllo develops an innovative reading app designed specifically for children in Kindergarten through 3rd grade. This app acts as a personalized reading coach, utilizing their proprietary Adaptive Learn™ technology to create a tailored learning experience that understands, adapts, and responds to each child's unique reading level and interests. The goal? To transform young learners into enthusiastic readers while addressing the significant gap in reading proficiency among early elementary school children.\n\n**Core Features and Offerings**\n\n1. **Adaptive Read-Along Companion**: The Ello app features interactive, decodable e-books and a one-on-one coaching experience reminiscent of personal tutoring.\n2. **Flexible Pricing**: After a 7-day free trial, the subscription is priced at $14.99 per month, with a yearly option for $139 (23% off).\n3. **Gift Boxes**: For $59, recipients receive a gift box with three months of app access, five grade-level books, and fun activities, making reading a delightful gift.\n4. **Wide Range of Resources**: Ello includes a free public library with over 700 decodable e-books, parental resources, and materials for teachers.\n\n**Impact and Vision**\n\nEllo emerged to tackle a pressing challenge: millions of kids are not receiving the individualized literacy support they need during crucial early learning years. By promoting confidence and independence in reading, Ello not only helps children improve their reading skills but also nurtures a love for literature. Their AI tutor has garnered positive attention from experts and parents alike, supported by research that backs their educational methodologies.\n\n**Conclusion**\n\nIn a world where data-driven solutions meet educational needs, Ello embodies a promising blend of technology and pedagogy, committed to maximizing every child's reading potential. If you want to empower young readers in an engaging way, give Ello a try—building a brighter, literate future is just a read away.\n\nFor more information, you can visit their [website](https://www.ello.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/18d35905322c7b113659650528f98dc061810d26.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191235Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=227f6f74173bde6c30eee422c0f0edfc0b4a34330f4104ebf9df78a4a295236b",
    "social_links": [
        "https://www.linkedin.com/company/elloinc/",
        "https://www.crunchbase.com/organization/trustle"
    ],
    "logo_path": "data/logos\\Ello_logo.png"
}