{
    "links": "https://www.ycombinator.com/companies/elythea",
    "name": "Elythea",
    "headline": "ML to predict and prevent pregnancy complications",
    "batch": "S23",
    "description": "Over 80% of maternal mortalities were preventable with earlier intervention. Currently, doctors miss >50% of moms who have life-threatening complications and wait until labor to start doing manual risk assessments, at which point it's too late.\r\n\nElythea's proprietary ML models catch life-threatening obstetric complications (like postpartum hemorrhage, preeclampsia/eclampsia, emergency c-section, preterm labor, and more) as soon as the first visit. We automatically analyze relevant demographic and clinical risk factors, flag high-risk patients, and provide evidence-based interventions, giving doctors months in advance to intervene and prevent complications from ever happening.\r\n\nOur global clinical studies have shown that we can catch 3x more complications than clinical judgment 10x sooner.",
    "activity_status": "Active",
    "website": "https://elythea.org/",
    "founded_date": 2023.0,
    "team_size": 2.0,
    "location": "San Jose, CA",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:health-tech; industry:digital-health; industry:women's-health; industry:ai; industry:ml; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Reetam Ganguli, Founder",
            "description": "Got into Med school at Brown at 17, was studying to be an OBGYN, and dropped out to do Elythea. 1st authored 20+ publications, including multiple Nature journals. Previously founded and scaled a medical education organization across 30+ countries.",
            "linkedin": "https://linkedin.com/in/reetamganguli"
        }
    ],
    "status": true,
    "generated_description": "**Elythea: Pioneering AI for Maternal Health**\n\nElythea is a forward-thinking startup dedicated to revolutionizing maternal healthcare through machine learning. Founded in 2023 and part of the Y Combinator Batch S23, Elythea has a bold mission: to predict and prevent pregnancy complications early in the reproductive process. This ambition springs from a sobering statistic: over 80% of maternal deaths are preventable with timely interventions, yet many doctors miss more than half of at-risk mothers until it's almost too late—often waiting until labor starts to assess risks.\n\nWith its proprietary machine learning models, Elythea addresses this crucial gap. Their technology swiftly analyzes demographic and clinical risk factors during a woman's first visit, flagging high-risk patients. It targets serious complications like postpartum hemorrhage and preeclampsia, ensuring that healthcare providers have the foresight to act months in advance. The results? Elythea's clinical studies have demonstrated that they can identify three times as many complications as traditional clinical judgment, and do so ten times earlier.\n\nThe startup, based in San Jose, California, operates with a lean team of just two employees and is currently engaged in creating innovative health-tech solutions focused on women's health. They're not just catching complications; they’re changing the conversation around maternal health, emphasizing prevention as a form of care that saves lives.\n\nIf you're interested in learning more or connecting with the team, you can explore their website at [Elythea.org](https://elythea.org).\n\nElythea's dedication to proactive engagement and early identification of risks reflects a growing trend in healthcare—using technology to empower patients and improve outcomes. So, if you care about maternal health and the future of digital health solutions, keep an eye on Elythea; they’re just getting started.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/84a56002644b643c0380ce6ace6d5a77a180e101.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191305Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=03e653888de0fe4178c91009d2040458a98675d21508f4a0cdbe22643df747c7",
    "social_links": [
        "https://www.linkedin.com/company/elythea/",
        "https://www.crunchbase.com/organization/elythea"
    ],
    "logo_path": "data/logos\\Elythea_logo.png"
}