{
    "links": "https://www.ycombinator.com/companies/emerge-career",
    "name": "Emerge Career",
    "headline": "All-in-one re-entry & workforce development training platform",
    "batch": "S22",
    "description": "Vocational training programs and workforce management software for government agencies looking to create high-paying jobs and up-skill their low-income and justice-involved citizens out of poverty.",
    "activity_status": "Active",
    "website": "https://www.emergecareer.com/",
    "founded_date": 2022.0,
    "team_size": 3.0,
    "location": null,
    "group_partner": "Michael Seibel",
    "group_partner_yc": "https://www.ycombinator.com/people/michael-seibel",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:education; industry:govtech",
    "founders": [
        {
            "name": "Uzoma \"Zo\" Orchingwa, Co-Founder, Co-CEO",
            "description": "Co-founder. In 2022, Zo and Gabe co-founded Ameelio, a tech nonprofit that builds education and communication products for prisons. While scaling Ameelio, they stumbled upon the issue of unemployment post-incarceration which Emerge seeks to address. Zo holds a Masters degree in Criminology from the University of Cambridge, and  a JD-MBA from Yale Law School and Yale School of Management.",
            "linkedin": "https://www.linkedin.com/in/uzoma-orchingwa-2346481a3/"
        },
        {
            "name": "Gabriel Saruhashi, Founder",
            "description": "Co-founder. In 2020, Gabe and Zo co-founded Ameelio, a tech nonprofit that builds education and communication tools for prisons. While scaling Ameelio, they stumbled upon the issue of unemployment post-incarceration which Emerge Career seeks to address. Previously, he was a YC intern and the first product manager at Zippi (YC19). Gabe is a Yale grad, where he co-founded an organization connecting refugees with their new communities, and built an app to assist homeless communities in New Haven.",
            "linkedin": "https://www.linkedin.com/in/gabrielsaruhashi/"
        }
    ],
    "status": true,
    "generated_description": "**Company Overview: Emerge Career**\n\nFounded in 2022 and hailing from the Y Combinator Batch S22, Emerge Career is on a mission to transform workforce development through its innovative, all-in-one re-entry and training platform. The company uniquely focuses on helping low-income and justice-involved individuals land high-paying jobs by offering comprehensive vocational training programs. \n\n**Core Mission**\n\nEmerge Career aims to upskill economically disadvantaged groups, particularly those affected by the criminal justice system. They design programs specifically for government agencies looking to create pathways to prosperity for their citizens. Their approach is straightforward: provide the resources and support that help people transition into the workforce efficiently.\n\n**Services and Features**\n\n1. **Collaborative Programs:** Emerge Career partners with Community-Based Organizations (CBOs) to recruit eligible participants and ensure a training experience that complements existing social support systems.\n\n2. **Digital Learning Hub:** Their online platform is accessible from any device, allowing students to engage in a secure, flexible learning environment—both online and offline.\n\n3. **Individualized Support:** Each participant is paired with a dedicated Student Success Coach who provides mentorship, goal setting, and advice to navigate challenges.\n\n4. **Hands-on Training:** Emerge Career facilitates real-world training opportunities with trusted educational partners, ensuring students gain practical skills that meet industry demands.\n\n5. **Career Readiness:** They don't just focus on training; Emerge Career emphasizes job placement, offering career coaching, resume preparation, and interview support tailored to the job market.\n\n6. **Impact Measurement:** Utilizing analytics, government agencies can track training outcomes, student progress, and overall program impact, ensuring transparency and accountability.\n\n**Current Operations and Expansion**\n\nCurrently, Emerge Career operates in major states like New York, Colorado, Massachusetts, and California, constantly looking to expand their reach and impact. Their impressive metrics include a 94% graduation rate and a perfect placement rate. \n\n**Future Prospects**\n\nWith plans in place for additional trade programs in fields like roofing, welding, and construction, Emerge Career is strategically building a robust pipeline from prison to meaningful employment. Their focus on trauma-informed care ensures that even the most marginalized communities receive the support needed to succeed.\n\n**Leadership and Team**\n\nWith a small yet dynamic team of three, backed by the guidance of Y Combinator's Michael Seibel, Emerge Career is positioning itself as an innovative leader in the workforce development space. Their vision of merging technology with compassionate support services promises a brighter future for those often left behind.\n\nFor more information, visit their website at [emergecareer.com](https://www.emergecareer.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/c584da767d2e7a17a7854258b4dccc842e2935a2.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191308Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=ceef19c9ea5826447da97fc9c59a03ff71fd4eea9dda0785a4b8856cc78775e4",
    "social_links": [],
    "logo_path": "data/logos\\Emerge_Career_logo.png"
}