{
    "Links": "https://www.ycombinator.com/companies/emojis-com",
    "Name": "emojis.com",
    "Headline": "AI Copilot for Graphic Design",
    "Batch": "W25",
    "Description": "Our mission is to give small businesses an AI Graphic Designer to help them create a brand and identity without having to pay 💰💰💰 of dollars hire someone.",
    "Activity_Status": "Active",
    "Website": "https://emojis.com/",
    "Founded_Date": "2023",
    "Team_Size": "2",
    "Location": "San Francisco",
    "Group_Partner_YC": "https://www.ycombinator.com/people/jared-friedman",
    "Group_Partner": "Jared Friedman",
    "Company_Linkedin": "https://www.linkedin.com/company/851-inc",
    "Company_Twitter": "",
    "Tags": "industry:design; industry:design-tools; industry:ai; location:san-francisco-bay-area",
    "social_links": [
        "https://www.linkedin.com/company/851-inc",
        "https://x.com/emojisdotcom",
        "https://www.crunchbase.com/organization/emojis-com",
        "https://github.com/851-labs"
    ],
    "logo_path": "data\\logos\\emojis.com.png",
    "Active_Founders": [
        {
            "Name": "Dylan Player, Founder",
            "Description": "Co-Founder & CTO at emojis.com. Former software engineer at Shopify, building new lending products and scaling to over $10B in lending volume.",
            "LinkedIn": "https://linkedin.com/in/dylan-player"
        },
        {
            "Name": "Alexandru Turcanu, Founder",
            "Description": "Co-founder and CEO at emojis.com. Previously, led posts initiative at Campsite (acq by Notion).",
            "LinkedIn": "https://linkedin.com/in/pondorasti"
        }
    ],
    "crawl_status": true,
    "generated_description": "**Emojis.com: Your AI Design Partner**\n\nFounded in 2023 and hailing from the bustling tech hub of San Francisco, Emojis.com is on a mission to revolutionize graphic design for small businesses. The idea is simple yet powerful: provide businesses with an AI Copilot that acts as a graphic designer, making it easier and more affordable to create a unique brand identity. Who wouldn’t want a tool that can help you craft a visual identity without breaking the bank? \n\nWith just a tiny team of two, Emojis.com is already making waves. They’re part of Y Combinator’s Batch W25, which gives them a solid backing in the startup community. Jared Friedman serves as their Group Partner, bringing his expertise to the project.\n\nSo, what can you do with Emojis.com? Here’s a taste:\n\n1. **AI Emoji Generator**: It’s exactly what it sounds like. Create custom emojis that fit your branding, from a penguin wizard to a shark in a top hat. \n\n2. **Diverse Options**: The platform offers a staggering array of more than 2,000,000 AI-generated emojis. Whether you need a matcha emoji, a sleeping emoji, or even a dresser full of quirky characters, they have you covered.\n\n3. **Integrations**: Emojis.com isn’t just a stand-alone tool. They’ve designed integrations with popular platforms like WhatsApp, Slack, and Discord, allowing users to seamlessly enhance their messaging with custom emojis.\n\n4. **Mobile Apps**: They’ve also launched iOS and Android apps, making it easy to access their features on the go. \n\nWith their minimalist approach to design tools, Emojis.com is all about accessibility. They recognize that small businesses often can’t afford high-end design teams, so they’re stepping in to fill that gap. \n\n**Location**: All of this innovation is happening in the heart of the San Francisco Bay Area, where the tech pulse beats strongest. \n\nIn summary, Emojis.com is more than just an emoji generator; it’s a creative partner for small businesses looking to stand out in a crowded marketplace. Their blend of cutting-edge AI, affordability, and user-friendly design tools could very well make them a go-to resource for anyone serious about building a brand. If you're looking to take your business visuals to the next level without hefty costs, Emojis.com seems like a promising bet."
}