{
    "links": "https://www.ycombinator.com/companies/enerjazz",
    "name": "Enerjazz",
    "headline": "Making electric vehicle batteries affordable",
    "batch": "S21",
    "description": "Enerjazz is building a battery swapping network (like gasoline stations) for 2M+ commercial electric vehicles in India. We make batteries affordable for EV owners and enable them to earn 80% more.",
    "activity_status": "Active",
    "website": "https://www.enerjazz.tech/",
    "founded_date": 2021.0,
    "team_size": 9.0,
    "location": "Delhi, India",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:climate",
    "founders": [
        {
            "name": "Ravi Bharihoke, Founder",
            "description": "While working as an analyst covering renewable energy developments at Shell, Ravi came to the conclusion that anything that makes energy storage more affordable will have the most impact in the next couple of decades. That simple thought is how the idea of Enerjazz was born. \n\nRavi is a graduate of IIT Kharagpur and worked with Shell in strategy, operations and analytics for 8.5 years before starting Enerjazz.",
            "linkedin": "https://www.linkedin.com/in/ravi-b-hiring-for-operations-and-tech-9a92a412/"
        },
        {
            "name": "Pratik Ranjan Das, Founder",
            "description": "I am Co-founder at Enerjazz. I am a material scientist and have 8+ years of experience in Lithium ion battery and electric mobility sector.",
            "linkedin": "https://www.linkedin.com/in/pratikrdas"
        }
    ],
    "status": true,
    "generated_description": "Enerjazz is on a mission to revolutionize the electric vehicle (EV) landscape in India by making batteries more affordable and accessible. Founded in 2021 and part of Y Combinator's Batch S21, this Delhi-based startup is taking the bold step of building a comprehensive battery swapping network—much like conventional gasoline stations—targeting over 2 million commercial EVs across the country.\n\nAt its core, Enerjazz aims to alleviate the high upfront costs of EV ownership. Through innovative battery swapping solutions, they not only lower the financial burden on owners but also create opportunities for them to earn substantially more—up to 80% additional revenue. Imagine being able to swap out a depleted battery for a fully charged one in the same time it takes to refuel a car!\n\nThe brains behind Enerjazz include CEO Ravi, who brings over a decade of experience from Shell and holds a degree from IIT Kharagpur, and CTO Pratik, an expert in lithium-ion battery technology with a PhD from the German Aerospace Center. Their combined expertise is critical as they develop patent-pending technology to power their battery swapping infrastructure.\n\nEnerjazz has garnered attention on a global scale, receiving funding from prestigious investors, including the European Union and tier 1 VCs in the U.S. They were even selected as one of eight innovative startups by a Mercedes-Benz-backed accelerator in Germany, indicating their potential to lead the change in sustainable transportation.\n\nWith a small team of 9, Enerjazz is already making big moves in a field that's poised for explosive growth. They also provide e-commerce delivery solutions, supporting the first and last mile logistics challenges in an increasingly digital economy. \n\nIn summary, Enerjazz exemplifies the entrepreneurial spirit, tackling a critical challenge in climate change while setting the stage for the future of transportation in India. You can learn more about their vision and progress on [their website](https://www.enerjazz.tech/).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/fd1e7df8a34365d18229da01827172f8147b2cb6.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191314Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=44ada4c532a7ac55fe7e657c646c0724cbf1ccbdcdf2b8b2f12905621949dd1b",
    "social_links": [
        "https://www.linkedin.com/company/18545573/admin/"
    ],
    "logo_path": "data/logos\\Enerjazz_logo.png"
}