{
    "links": "https://www.ycombinator.com/companies/entocycle",
    "name": "Entocycle",
    "headline": "Automated factory to produce insect protein for farm animals.",
    "batch": "S17",
    "description": "The Insect Farming Company.\r\n\nWe’re developing the world’s most efficient and sustainable way to produce protein.\r\n\nInsects are rich in protein and are a natural component of the diets of many fish and free-range poultry.\r\n\nOur technology is significantly more efficient at producing protein than traditional methods of production as our insects are vertically farmed and not restricted to floor space or area.\r\n\nThanks to our automated system we can produce at industrial scale and offer farmers a cost-effective and sustainable alternative to soymeal and fishmeal.",
    "activity_status": "Active",
    "website": "https://www.entocycle.com/",
    "founded_date": null,
    "team_size": 13.0,
    "location": "London, United Kingdom",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:food-tech; industry:agriculture",
    "founders": [],
    "status": true,
    "generated_description": "Entocycle is a pioneering company based in London, UK, focused on revolutionizing protein production through insect farming. Originally launched as The Insect Farming Company, they are now on a mission to create automated factories for producing insect protein on an industrial scale. This protein is particularly important for livestock, as insects are a natural dietary source for fish and free-range poultry.\n\nHere's their pitch: insects are not just a sustainable option; they are incredibly efficient compared to traditional protein sources like soy and fishmeal. Thanks to their vertically farmed, automated systems, Entocycle leverages space and technology to produce protein more efficiently than ever. This innovation not only offers a cost-effective alternative for farmers but also supports environmental sustainability.\n\nEntocycle was founded as part of Y Combinator's Batch S17 and is helmed by a dedicated team of 13. They provide a range of services, including complete insect farm solutions, insect engineering, and feedstock trials. Their technologies utilize black soldier fly larvae to convert food waste and agricultural byproducts into low-carbon protein, offering an eco-friendly solution that aligns with net-zero targets for businesses.\n\nThe emphasis on their technology and process positions them at the intersection of food tech and agriculture, responding to the growing demand for sustainable food production. The company actively supports farmers, insect companies, waste management solutions, and food firms by diversifying their operations and enhancing productivity.\n\nIn short, Entocycle is not just about breeding insects—it's about rethinking how we produce protein sustainably and innovatively. Their commitment to insect welfare and technological advancement ensures they are at the forefront of transforming the agricultural landscape.\n\nTo learn more about their innovative solutions, you can visit their website at [Entocycle](https://www.entocycle.com/).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/95a5d5ffe17078936c50197562fa84e3cb993980.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191317Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=59f3d92a258615c080b56155885464357eb4d652ea34aad984baf2fcc518e86d",
    "social_links": [
        "https://twitter.com/Entocycle",
        "https://www.crunchbase.com/organization/entocycle"
    ],
    "logo_path": "data/logos\\Entocycle_logo.png"
}