{
    "links": "https://www.ycombinator.com/companies/equator-therapeutics",
    "name": "Equator Therapeutics",
    "headline": "We are developing a drug to burn calories and increase metabolismâ\u0080¦",
    "batch": "W20",
    "description": "We are developing a drug to increase metabolism and burn calories without exercise.\r\n\nObesity and type 2 diabetes have reached epidemic proportions. There are 2.2B overweight people and 500M people with type 2 diabetes worldwide, and these numbers increase drastically every year. Existing drugs are not effective enough to reverse the trend. Our drug can solve this problem, because it addresses the root cause of metabolic disorders â\u0080\u0093 the imbalance between caloric intake and expenditure.\r\n\nOur drug will target mitochondria â\u0080\u0093 the powerhouse of the cell â\u0080\u0093 to generate heat. This approach has been proven to fully reverse obesity and type 2 diabetes in animals. However, therapeutic application for humans was impossible, because mitochondrial heat production could only be induced by highly artificial methods with side effects. This changed after our recent breakthrough discovery of the protein that mitochondria naturally use to generate heat. We have developed a unique high-throughput drug discovery platform to identify compounds that selectively activate this target protein, without side effects.\r\n\nFor decades people have wanted a drug that burns calories like exercise does. We are realizing this dream at Equator Therapeutics.",
    "activity_status": "Active",
    "website": "https://equatortherapeutics.com/",
    "founded_date": null,
    "team_size": 2.0,
    "location": "San Francisco",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:biotech; industry:therapeutics; location:san-francisco-bay-area",
    "founders": [],
    "status": true,
    "generated_description": "**Equator Therapeutics: A Revolutionary Approach to Metabolic Disorders**\n\nEquator Therapeutics is tackling one of the most pressing health issues of our time: obesity and type 2 diabetes, which now affect over 2.2 billion and 500 million people globally, respectively. Founded in San Francisco and part of Y Combinator's W20 batch, their mission is clear: to create a drug that increases metabolism and burns calories without the need for exercise. This is more than just lofty rhetoric; it’s a response to a growing epidemic, where traditional weight loss methods often fall short.\n\n### The Problem with Current Solutions\n\nMost existing treatments for obesity and metabolic disorders revolve around dieting and exercise. However, many people struggle to maintain weight loss through these methods alone. Equator Therapeutics recognizes that there's a third critical mechanism at play: thermogenesis, the process through which our bodies burn calories.\n\nHistorically, inducing thermogenesis in humans has been challenging. Previous methods required synthetic interventions that came with unpleasant side effects. But Equator has made a breakthrough by identifying the protein that natural mitochondria—a cell's powerhouse—use to generate heat. By harnessing this mechanism, Equator aims to help restore thermogenesis to levels found in our ancestors, enhancing calorie burning effortlessly throughout daily activities.\n\n### Innovative Drug Discovery Platform\n\nAt the heart of Equator's approach is a high-throughput drug discovery platform. This technology allows them to identify compounds that selectively activate mitochondrial proteins, promoting safe thermogenesis without negative side effects. Initial animal studies demonstrate full reversals of obesity and type 2 diabetes, raising hopes that these results can translate to human applications.\n\nWhat makes Equator particularly exciting is its commitment to exploring multiple avenues in mitochondrial medicine, expanding beyond thermogenesis into other therapeutic mechanisms.\n\n### A Team of Experts\n\nEquator Therapeutics is led by a passionate team of scientists and innovators:\n\n- **Jonah Sinick, Ph.D.** - Co-founder and CEO\n- **Yuriy Kirichok, Ph.D.** - Co-founder and Chief Scientific Officer\n- **Katherine Widdowson, Ph.D.** - Head of Medicinal Chemistry\n\nThe company's scientific advisory board includes notable figures from institutions like Yale and UCSF, further solidifying their credibility and expertise in the field.\n\n### Looking Forward\n\nWith a team of just two employees, Equator is leveraging cutting-edge scientific research to challenge the status quo in metabolic disorder treatment. The implications of their work could lead to a paradigm shift in how we address obesity and related diseases—treatments that could one day feel as natural as breathing, all while restoring our innate ability to burn calories.\n\nEquator Therapeutics is not just about creating a drug; they’re on a mission to change lives by making calorie burning as effortless as it should be. The promise of making thermogenesis pharmacological might be the step humanity has long awaited in the battle against obesity.\n\nTo find out more, visit their website at [Equator Therapeutics](https://equatortherapeutics.com/) and follow their journey as they strive to realize this ambitious goal.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/330555e13ede0758f03d8e9ecef2029c3b02f709.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191319Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=3f15c80952ce2a040d2aea6d98170ba7f44fdbfebfaf682545cb761602070937",
    "social_links": [],
    "logo_path": "data/logos\\Equator_Therapeutics_logo.png"
}