{
    "links": "https://www.ycombinator.com/companies/equipt-health",
    "name": "Equipt Health",
    "headline": "Home medical equipment, prescribed online and delivered.",
    "batch": "S21",
    "description": "Equipt Health makes it easy for any healthcare company to offer prescription medical devices to patients. We handle the whole process: the packaging, the logistics, the clinical (via our provider network) and technical support, and the return of data from connected devices. We're starting with the diagnosis and treatment of sleep apnea at heliosleep.com.",
    "activity_status": "Active",
    "website": "http://www.equipthealth.com",
    "founded_date": 2021.0,
    "team_size": null,
    "location": "Seattle, WA",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:sleep-tech; industry:consumer-health-services; industry:digital-health; industry:telemedicine; location:seattle",
    "founders": [
        {
            "name": "Rebecca Weisinger, Founder",
            "description": "Rebecca Weisinger is the co-founder and CEO of Equipt Health, which she started with Max Greenfeld in 2021. She earned a degree in Chemistry from Harvard University.",
            "linkedin": "https://www.linkedin.com/in/rebecca-weisinger-62ab44/"
        },
        {
            "name": "Max Greenfeld, Founder",
            "description": "Max Greenfeld is the co-founder of Equipt Health. He previously led data and engineering projects as an early employee at Q Bio and Genapsys. He completed a PhD from Stanford.",
            "linkedin": "https://www.linkedin.com/in/max-greenfeld-9718309/"
        }
    ],
    "status": true,
    "generated_description": "**Equipt Health Overview**\n\nFounded in 2021 and based in Seattle, WA, Equipt Health aims to revolutionize how patients access medical equipment by providing a straightforward online platform for purchasing prescribed home medical devices. As part of Y Combinator's Batch S21, they've carved out a niche in the sleep health space, focusing initially on sleep apnea through their brand, Helio Sleep.\n\n**Mission & Services**\n\nEquipt Health's mission is to simplify the process of obtaining home medical equipment. They manage everything from the logistics of delivery to the technical support required for using connected devices. They aim to create a seamless user experience for healthcare companies and their patients, especially in the treatment of sleep apnea.\n\nThrough their website, HelioSleep.com, patients can order FDA-approved home sleep apnea tests and treatment devices that are shipped directly to their door. They offer tools like the NightOwl Home Sleep Apnea Test, Zzoma Positional Device, and the myTAP Oral Appliance, each designed to address various aspects of obstructive sleep apnea. \n\n**How It Works**\n\n1. **Get Started**: Patients answer a quiz about their symptoms and history, which helps a provider determine if a home sleep study is appropriate.\n2. **Receive Your Equipment**: If diagnosed, treatment devices will be sent to the doorstep.\n3. **Care Coaching**: A Helio care coach reaches out to ensure patients are on track with their treatment.\n\n**Why It Matters**\n\nSleep apnea affects millions, impairing their quality of life. Equipt Health is tackling this by making diagnosis and treatment more accessible. By employing telemedicine and a user-friendly approach, they stand to help thousands reclaim healthy, restful sleep.\n\nWith a backing from a reputed incubator and a dedicated team, Equipt Health is well-positioned to expand beyond sleep apnea and impact consumer health services on a larger scale. Their innovative approach could serve as a blueprint for how digital health services evolve moving forward.\n\nFor those ready to take control of their sleep health, Equipt Health offers an easy entry point: start with their online platforms, engage with their community, and explore the science-backed solutions they provide.\n  \n**Where to Learn More**\n\nVisit [Equipt Health](http://www.equipthealth.com) to explore their offerings, and if sleep issues are on your mind, you might just find the solution you've been looking for!",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/3299186d4b9081d503ebd27b27b87b916b42dc47.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191320Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=70ea765d1ed9997d546d9352d0cc5a0b02cc29ece29c9d3b12fc7f774733a9e5",
    "social_links": [
        "https://www.linkedin.com/company/equipt-health",
        "https://twitter.com/equipthealth"
    ],
    "logo_path": "data/logos\\Equipt_Health_logo.png"
}