{
    "links": "https://www.ycombinator.com/companies/erad",
    "name": "erad",
    "headline": "Non-dilutive funding and payments in the Middle East",
    "batch": "S22",
    "description": "erad provides startups in the Middle East with non-dilutive growth capital. Connect your sales, marketing and banking data and receive an offer within 48 hours. Get access to key insights and analysis about your business.",
    "activity_status": "Active",
    "website": "https://erad.co/",
    "founded_date": 2022.0,
    "team_size": 5.0,
    "location": "Riyadh, Saudi Arabia",
    "group_partner": "Dalton Caldwell",
    "group_partner_yc": "https://www.ycombinator.com/people/dalton-caldwell",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:payments; industry:b2b",
    "founders": [
        {
            "name": "Salem Abu-Hammour, Founder",
            "description": "Previously worked in M&A and banking, after working on an online coffee store with my current co-founder, Faris. Passionate about building, investing and data.",
            "linkedin": "https://www.linkedin.com/in/salem-abu-hammour-8717a6100/"
        },
        {
            "name": "Youssef Said, Founder",
            "description": "CTO, in charge of tech @ erad\nLed large scale e-commerce programs in the Middle East from idea to development, after spending 10 years in tech consulting and building products as an engineer in Europe.",
            "linkedin": "https://linkedin.com/in/saidyoussef"
        },
        {
            "name": "Faris Yaghmour, Founder",
            "description": "Accidentally launched my first business, a coffee e-commerce store, with my current co-founder Salem, 6 years ago! Then stumbled into the Financial services world and spent 4 years learning about product and operations in retail & corporate banking. I then joined a BNPL startup before founding erad.",
            "linkedin": "https://www.linkedin.com/in/farisyaghmour/"
        }
    ],
    "status": true,
    "generated_description": "**Erad: Pioneering Non-Dilutive Funding in the Middle East**\n\nFounded in 2022 and part of Y Combinator's S22 batch, Erad is making waves in the fintech sector from its base in Riyadh, Saudi Arabia. With a compact team of five, Erad specializes in providing startups across the Middle East with non-dilutive growth capital—essentially, they offer funding without requiring startups to give up equity.\n\n### The Pitfalls of Venture Capital\nTraditional venture capital can come with strings attached. Startups often bootstrapped through VC funding risk giving away significant ownership in their quest for growth. Erad flips this narrative, offering a streamlined, data-driven alternative that insists on quick assessments and approvals. You can connect your sales, marketing, and banking data, and if all goes well, expect a funding offer within just 48 hours.\n\n### Why Choose Erad?\nWhat sets Erad apart? Here are a few critical features:\n\n1. **Speedy Solutions**: Utilize their data-driven approach for funding assessments, with quick approvals that can block the funding bottleneck many startups face.\n   \n2. **Top-Up Flexibility**: Erad supports businesses in growing sustainably, allowing for additional financing options as needs evolve over time.\n\n3. **Insight-Driven**: Beyond just providing funds, they offer valuable insights that can help startups navigate their growth journeys effectively.\n\n4. **Shariah Compliance**: Their financing adheres to Sharia law principles, making it a suitable choice for many businesses in the region.\n\n5. **Integration and Accessibility**: By connecting with platforms that businesses rely on (think Shopify and QuickBooks), Erad provides a smooth path to funding.\n\n### A Growing List of Success Stories\nErad has already backed a variety of businesses, helping them achieve impressive growth metrics. For instance, many clients have reported substantial revenue increases after leveraging Erad's funding. Companies like Hafla, Citron, and Mealato have paved their growth paths thanks to the financing and insights provided by Erad. \n\n### The Vision\nWith a mission focused on reshaping the financing landscape for startups in the Middle East, Erad aims to be a reliable partner, enabling businesses to grow on their own terms, free from the pressure of diluting ownership in exchange for the capital they need.\n\nTo explore their offerings or learn more about how you can partner with them, check out their website at [erad.co](https://erad.co/).\n\nIn sum, Erad is not just another funding platform—it's a fresh approach to financing that considers the ethical and practical needs of businesses looking to thrive in today’s competitive marketplace. If you're a startup in the Middle East looking for capital without compromising your control, it might be worth exploring what Erad has to offer.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/3aae703f9378327d8b5966d8a5fa9d2416125818.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191319Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=3a9027106f3153f78d656508ef32d724462e26dd327e8f5f46ffcc8ee86b859d",
    "social_links": [
        "https://www.linkedin.com/company/eradco/",
        "https://twitter.com/geterad"
    ],
    "logo_path": "data/logos\\erad_logo.png"
}