{
    "links": "https://www.ycombinator.com/companies/ergo",
    "name": "Ergo",
    "headline": "Make Your Existing CRM Autonomousâ\u009a¡",
    "batch": "W25",
    "description": "Ergo lets sales teams plug in natural customer communication channels like Zoom, Gmail, and Slack to allow CRMs such as Hubspot or Salesforce to update themselves. With Ergo, Sales Directors always have the most updated view of their pipeline. No longer do businesses lose millions in pipeline bleed, or struggle with customer handoffs within internal teams.",
    "activity_status": "Active",
    "website": "https://joinergo.com",
    "founded_date": 2025.0,
    "team_size": null,
    "location": "San Francisco",
    "group_partner": "Jared Friedman",
    "group_partner_yc": "https://www.ycombinator.com/people/jared-friedman",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:saas; industry:b2b; industry:sales; industry:ai; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Yash Dulla, Founder & CEO",
            "description": "Co-founder and CEO @ Ergo. I studied biomedical engineering at Georgia Tech, and have been passionate about startups since I was a child. Previous to Ergo, I founded another startup Breezy Medical for AI healthcare documentation and reimbursements.",
            "linkedin": "https://www.linkedin.com/in/yash-dulla/"
        },
        {
            "name": "Ishan Sheth, Founder & CTO",
            "description": "Co-founder & CTO of Ergo. Studied Computer Science and Economics at Georgia Tech. Previously founded Breezy Medical, which provided AI nurses for medical documentation and reimbursements. Also did software/ML for a handful of tech startups and a large bank.",
            "linkedin": "https://www.linkedin.com/in/isheth/"
        }
    ],
    "status": true,
    "generated_description": "**Ergo: Make Your CRM Autonomous**\n\nFounded in 2025, Ergo is on a mission to revolutionize the way sales teams manage their customer relationships by making existing Customer Relationship Management (CRM) systems autonomous. Backed by the reputable Y Combinator Batch W25, Ergo is based in the dynamic San Francisco Bay Area and is a promising player in the SaaS, B2B, sales, and AI sectors.\n\n### What Does Ergo Do?\n\nErgo began with a straightforward yet powerful idea: sales teams should be able to integrate natural communication tools like Zoom, Gmail, and Slack into major CRMs like HubSpot or Salesforce seamlessly. This integration ensures that sales directors always have access to the most current view of their pipeline, effectively eliminating issues such as \"pipeline bleed,\" where potential sales opportunities are lost due to poor data management or miscommunication among team members.\n\n### Key Features\n\n1. **Automated Data Entry**: Say goodbye to time-consuming manual CRM updates. Ergo's intelligent systems automatically capture and organize customer interactions, saving teams hours of work each week.\n   \n2. **Seamless Integration**: Ergo easily connects with existing tools and workflows, enabling sales teams to leverage the software they already use without missing a beat.\n\n3. **Task Automation**: By managing internal tasks that stem from customer communications, the platform allows teams to focus more on selling rather than administrative overhead.\n\n### Real Results\n\nErgo doesn't just promise efficiency; it delivers measurable outcomes. The platform has proven to help teams prevent an average of $125,000 from going down the drain due to pipeline issues, close 1.6 times more deals, and save over 10 hours of work per week. Users have praised the tool for providing a real-time view of their pipeline without the hassle—Karun Kaushik, CEO of Delve, noted that it saves him 12 hours of work every week.\n\n### Who’s Using Ergo?\n\nThe platform is trusted by companies like Delve, Greptile, and Splitit, showcasing its effectiveness within diverse sales environments. With constant founder access and dedicated support during onboarding, Ergo ensures teams have everything they need to leverage their CRM fully.\n\n### Conclusion\n\nErgo is not just another CRM tool; it's a game changer for sales teams navigating the complexities of customer relations in the modern market. By simplifying data management and automating workflows, companies can truly focus on building relationships and closing deals without the cumbersome overhead of manual updates. If you haven't explored what Ergo can do for your sales process, now is the time to book a demo!\n\nFor more information, visit [joinergo.com](https://joinergo.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/3cb83fac8fb1c60861f682d2aee6c154a8437c6e.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191320Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=5fec345287a3234e62a7ac47a44f5d50e4fc9f6bf0ace24cab61be0fa08721c5",
    "social_links": [
        "https://www.linkedin.com/company/ergoai/",
        "https://x.com/yashdulla"
    ],
    "logo_path": "data/logos\\Ergo_logo.png"
}