{
    "links": "https://www.ycombinator.com/companies/erudifi",
    "name": "ErudiFi",
    "headline": "Digital financial services for students in Southeast Asia",
    "batch": "W18",
    "description": "ErudiFi is a mission-driven technology company focused on expanding access to financial services for students. Operating as Danacita in Indonesia and Bukas in the Philippines, ErudiFi provides students a smarter way to pay for education and helps them build credit history. By providing financial inclusion to underserved students across the region, we believe we can drive generational transformation and build a better tomorrow.",
    "activity_status": "Active",
    "website": "http://www.erudifi.com",
    "founded_date": null,
    "team_size": 180.0,
    "location": "Singapore, Singapore",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:education; industry:fintech",
    "founders": [
        {
            "name": "Naga Tan, Founder",
            "description": null,
            "linkedin": "https://www.linkedin.com/in/nagatan/"
        },
        {
            "name": "Susli Lie",
            "description": "Growing up in Indonesia and the first in her family to attend university, Susli co-founded ErudiFi, a technology company on a mission to build a better tomorrow for youths in Southeast Asia together with Naga Tan. Susli is now a Partner at Monk's Hill Ventures, a Southeast Asia focused VC with 40+ portfolio companies in the region. She holds degrees from Yale, Wharton, and Johns Hopkins, and is also a mother of two young boys.",
            "linkedin": "https://www.linkedin.com/in/susli/"
        }
    ],
    "status": true,
    "generated_description": "### Overview of ErudiFi\n\n**ErudiFi** is a fintech company based in Singapore, focused on transforming education financing for students in Southeast Asia. Their mission is centered around providing **digital financial services** that empower students, helping them access affordable education while also building a credit history along the way. You can dive deeper into their services on their website: [erudifi.com](http://www.erudifi.com).\n\n### Origins and Growth\n\nInitially launched as **Danacita** in Indonesia and **Bukas** in the Philippines, ErudiFi aims to democratize education financing in a region where access can be challenging. The company was founded as part of the Y Combinator Batch W18, demonstrating potential and innovation in the fintech space. With a dedicated team of 180 employees, ErudiFi represents not just a business, but a growing movement towards financial inclusion in education.\n\n### What They Do\n\nErudiFi is innovating how students pay for their education:\n\n- **Bukas** offers affordable student loans in the Philippines, partnering with prestigious institutions to provide tailored payment plans that ease the financial burden on students. Their goal: a brighter tomorrow for Filipino youth.\n  \n- **Danacita** serves the Indonesian market, enabling access to education loans for various programs, from diplomas to master's degrees. They've made strides as the first platform in Indonesia to finance full degree programs.\n\n### Core Values\n\nErudiFi prides itself on a strong set of values that guide their operations:\n\n1. **Empathy**: Understanding customer needs and crafting solutions together.\n2. **Mission-driven**: Engaging with top talents to create impactful financing options.\n3. **Integrity**: Upholding fairness and reliability in a trust-sensitive industry.\n   \nTheir commitment is not just to financial transactions but to catalyzing long-term change within the education financing landscape.\n\n### Conclusion\n\nIn a world where education is often a privilege, ErudiFi is hard at work making it accessible to all students in Southeast Asia. With its innovative platforms and unwavering commitment to its mission, the company is positioning itself as a critical player in the fintech arena, aiming for generational transformation through education. If you're interested in reshaping the future of education financing, ErudiFi is leading the charge.\n\n---\nWhether you're a student, an institution, or an investor looking to be part of a significant movement, ErudiFi offers much to explore and many opportunities to engage with.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/9df5c87d4b1650d842203c9fd0b9496e27bb5fe1.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191321Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=c987828447dcd6b394ac7e7955f0e7f63d9f1cde6ad7f574d9c522c9f443de44",
    "social_links": [
        "https://www.linkedin.com/company/erudifi/",
        "https://github.com/erudifi"
    ],
    "logo_path": "data/logos\\ErudiFi_logo.png"
}