{
    "links": "https://www.ycombinator.com/companies/estoca",
    "name": "Estoca",
    "headline": "Logistics Operating System for E-commerces in Latam",
    "batch": "W21",
    "description": "Estoca sells warehouse management and logistics software to e-commerce in Latam. Unlike the US, in Latam most of these companies control their own warehouse and need software to increase delivery speed and reduce operational costs.",
    "activity_status": "Active",
    "website": "https://www.estoca.com.br/en",
    "founded_date": 2020.0,
    "team_size": 80.0,
    "location": "São Paulo, Brazil",
    "group_partner": "Michael Seibel",
    "group_partner_yc": "https://www.ycombinator.com/people/michael-seibel",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:b2b; industry:logistics; industry:e-commerce",
    "founders": [
        {
            "name": "Caio Almeida, Founder",
            "description": "Entrepreneur & mechanical engineer, I have been working with Tech companies since 2015. Founded Alugalogo in 2015, a marketplace for construction equipment (chosen as the best Startup of Google Campus' 2016 Batch).\nLed Uber Eats' partnership team in Brazil from 2018 to early 2020, contributing to the expansion to more than 70 cities in 2 years.\nFounded Estoca in 2020, a technology company focused on logistics for e-commerce.",
            "linkedin": "https://www.linkedin.com/in/caioborgesalmeida/"
        },
        {
            "name": "Rodrigo Cava, Founder",
            "description": "Technical Founder who loves to build products and solve real-world problems. Experienced in Marketplaces such as Uber & Rappi with Data Analytics, Ops and CX, and also with Consulting, with Project Management, Development and Design",
            "linkedin": "https://www.linkedin.com/in/rodrigocava"
        }
    ],
    "status": true,
    "generated_description": "**Estoca: Streamlining E-commerce Logistics in Latin America**\n\nFounded in 2020 and part of Y Combinator's W21 batch, Estoca is transforming the way e-commerce businesses in Latin America manage their logistics. Based in São Paulo, Brazil, and with a team of 80 dedicated employees, Estoca has positioned itself as a key player in the logistics software space. Their mission? To create a Logistics Operating System tailored for the unique challenges faced by e-commerce companies in the region, unlike their counterparts in the U.S., who often leverage third-party logistics services.\n\nIn Latin America, many e-commerce companies retain control over their own warehouse operations. This makes reliable warehouse management and logistics software indispensable for enhancing delivery speed and cutting operational costs. Estoca's offerings include robust Warehouse Management Systems (WMS), personalized tracking pages, WhatsApp tracking capabilities, and fulfillment services, making them a comprehensive solution for online retailers.\n\nEstoca also operates several distribution centers across Brazil, including locations in Extremas, São Paulo, Serra, Cotia, and Pernambuco. These strategically placed centers are designed to facilitate swift and efficient fulfillment, helping businesses meet their customers' expectations for quick delivery.\n\nThe company's backers include notable investors such as Canary, K50 Ventures, Starling Ventures, MarathonLab, and 8VC, which speaks volumes about the confidence the venture capital community has in Estoca's potential.\n\nBeyond providing software, Estoca is committed to education and thought leadership within the space. Their blog features insights on fiscal benefits various e-commerce models can leverage, logistics strategies, and partnerships to enhance business practices.\n\nIf you're e-commerce in Latin America looking to optimize your logistics operations, Estoca could be the partner to help you scale efficiently and effectively. For more information, check out their website [here](https://www.estoca.com.br/en). \n\nIn a nutshell, Estoca is more than just a logistics software company—it's a critical ally for e-commerce brands in a rapidly evolving market.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/19a65930d3e1a723bc7cb259234c3d1d0937c56c.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191320Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=e6afa40f5933376ceb884e2fc2ea9c5ca9db409ddd1394df5c919ecce7dc6b7d",
    "social_links": [
        "https://www.linkedin.com/company/estoca",
        "https://www.crunchbase.com/organization/estoca"
    ],
    "logo_path": "data/logos\\Estoca_logo.png"
}