{
    "links": "https://www.ycombinator.com/companies/et-al",
    "name": "et al.",
    "headline": "Feed of insights extracted from your go-to sources using LLMs.",
    "batch": "S24",
    "description": "et al. is a mobile app that aggregates your newsletters, research papers, articles, and more, in one place. Think of it as an LLM-powered feed delivering you useful content in short insights.\r\n\nFor example, if you’re building an AI voice agent, you’ll see the latest in speech-to-text models without having to actively search, go through a pile of research papers, or prompt an LLM.\r\n\nWe extract key takeaways from long-form content - allowing you to read as little or as much as you like from the original piece of information. With et al., you get to stay on top of breakthroughs in your field, build knowledge, and discover new interests effortlessly.",
    "activity_status": "Active",
    "website": "https://www.et-al.io",
    "founded_date": 2024.0,
    "team_size": 2.0,
    "location": "San Francisco",
    "group_partner": "Diana Hu",
    "group_partner_yc": "https://www.ycombinator.com/people/diana-hu",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:ai-enhanced-learning; industry:consumer; industry:productivity; industry:ai; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Marie van der Klink, Founder",
            "description": "Design engineer graduate from Imperial College London with experience in software and UI/UX design.",
            "linkedin": "https://www.linkedin.com/in/marie-van-der-klink/"
        },
        {
            "name": "Carine Fattal, Founder",
            "description": "Masters in design engineering from Imperial College London. Experience in mobile app development and interaction design.",
            "linkedin": "https://www.linkedin.com/in/carine-fattal/"
        }
    ],
    "status": true,
    "generated_description": "**Company Overview: et al.**\n\nFounded in 2024 and based in San Francisco, et al. is an innovative startup that’s part of Y Combinator Batch S24. With a two-person team, they’re tackling the challenge of information overload in our digital age by curating valuable insights from a variety of sources.\n\n**Mission**\n\net al. aims to seamlessly deliver insights from your trusted sources, leveraging Large Language Models (LLMs) to create a personalized, efficient browsing experience. Their goal is to help users extract meaningful information without the hassle of sifting through endless articles and research papers.\n\n**Product Offering**\n\nThink of et al. as a smart, AI-powered aggregator that takes the hard work out of staying on top of your field. Whether you're researching the latest speech-to-text advancements for an AI voice agent or diving into trends in any sector, et al. condenses extensive content into digestible insights. You get to keep your finger on the pulse of innovation while saving precious time.\n\nThe platform not only extracts key takeaways from lengthy texts but also allows users to control their feed based on personal interests. So, if AI isn’t your thing anymore, you can pivot your focus with just a click.\n\n**Unique Value Proposition**\n\net al. encourages users to \"scroll smarter\" by trading mindless scrolling for engaging, curated insights—from research papers to motivational podcasts. By transforming how we consume knowledge, they tap into our inherent curiosity and drive for understanding, akin to a digital scroll used in ancient times.\n\nMoreover, et al. highlights the importance of mental health, such as underscoring how sleep significantly impacts memory retention, providing users essential information to optimize their learning experiences.\n\n**Team and Leadership**\n\nDiana Hu serves as the Group Partner, helping guide the startup's vision as they carve their niche in the crowded tech landscape. With a core team of two, et al. demonstrates a focused commitment to building a meaningful and user-driven product.\n\n**Culture and Community Engagement**\n\net al. invites users to co-create the platform with them, encouraging feedback and suggestions. They aim to be not just another tool, but a community-driven project.\n\nIf you’re looking to enhance your learning experience and keep your knowledge fresh in an era of information overload, et al. is a promising avenue to explore. \n\nCheck them out at [et-al.io](https://www.et-al.io) to join their beta program and be part of the journey toward smarter scrolling.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/f5670579665d0b7b924b93227b65acc6054008ad.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191321Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=9001c83554a64d082bfa2a1b1a88d8e944e63d9c85e84303a40d12f13f63eacb",
    "social_links": [
        "http://linkedin.com/company/et-al-app/"
    ],
    "logo_path": "data/logos\\et_al._logo.png"
}