{
    "links": "https://www.ycombinator.com/companies/ethosx",
    "name": "EthosX",
    "headline": "The protocol for derivatives on blockchains",
    "batch": "S22",
    "description": "EthosX is a decentralized finance platform creating end-to-end financial derivatives on blockchains. No centralized exchanges, clearinghouses, depositories, clearing banks, CSD participants etc. required.\r\n\nWe are starting with cryptocurrency options first, with the intention to move towards other crypto derivatives and traditional finance derivatives eventually.\r\n\nFor example, one can buy a bitcoin hedging token directly from EthosX without involving any exchange or counterparty and earn profits when the bitcoin price is falling (similar to a put option). It is perpetual and is completely on-chain, end-to-end. It is held as a token in wallets and can be sold/transferred to anyone at any time.\r\n\nAt institutional level, using EthosX’s options infrastructure two hedge funds can trade high-value on-chain options with each other directly without involving any banks or brokers with zero counterparty risk and zero settlement risk.\r\n\nWe are also providing derivatives infrastructure to other crypto companies who want to use these products as a part of a larger package to their customers.\r\n\nGlobal derivatives ecosystem is broken. Derivatives trading in traditional finance has way too many gatekeepers and intermediaries. Crypto was supposed to be free of these issues and a solution to all of this, but it is itself getting more and more centralized with disastrous consequences.\r\n\nWe at EthosX intend to pick the best of both worlds and change the way retail and institutional financial derivatives are traded world over.",
    "activity_status": "Active",
    "website": "https://www.ethosx.finance/",
    "founded_date": 2022.0,
    "team_size": 2.0,
    "location": "Claymont, DE",
    "group_partner": "Brad Flora",
    "group_partner_yc": "https://www.ycombinator.com/people/brad-flora",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:defi; industry:fintech; industry:crypto-web3; industry:consumer; industry:b2b",
    "founders": [
        {
            "name": "Deepanshu ., Founder",
            "description": "Deepanshu is Co-founder and CEO of EthosX. He has been a quantitative finance professional for over 8 years. He is very passionate about using the blockchain technology generally and cryptocurrencies specifically to solve real world problems, especially problems related to financial markets. He was Vice President of Quantitative Research in the Global Derivatives Clearing business at JP Morgan Chase before EthosX . He studied engineering at IIT Kharagpur and obtained his MBA from IIM Calcutta.",
            "linkedin": "https://www.linkedin.com/in/deepanshu1/"
        },
        {
            "name": "Smit Patoliya, Founder",
            "description": "Smit did B.Tech. in Chemical Engineering from IIT Madras. He has worked in quantitative finance most of his career and has keen interest in financial derivatives. At EthosX, he aims to build end-to-end derivatives solutions on blockchain.",
            "linkedin": "https://www.linkedin.com/in/smit-patoliya"
        }
    ],
    "status": true,
    "generated_description": "### EthosX Overview\n\n**Company Name**: EthosX  \n**Founded**: 2022  \n**Location**: Claymont, DE  \n**Team Size**: 2 employees  \n**Y Combinator**: Batch S22  \n\n**Mission**: EthosX aims to create a decentralized protocol for financial derivatives on blockchain, providing a seamless trading experience free of intermediaries.\n\n### What They Do\n\nEthosX is pioneering a decentralized finance (DeFi) platform that's reshaping how derivatives are traded. Their initial focus is on cryptocurrency options, with plans to eventually expand into a broader range of crypto and traditional financial derivatives. \n\nImagine being able to buy a hedging token for Bitcoin directly from EthosX—no exchanges or counterparty risk involved. This allows traders to profit, even when market prices fall, akin to a put option. Everything is managed on-chain, meaning trading is transparent and can be conducted at any time.\n\nOn the institutional level, EthosX's infrastructure empowers hedge funds to conduct high-value options trading directly with one another. This eliminates the need for banks or brokers, reducing both counterparty and settlement risk. \n\nAdditionally, they're building a derivatives infrastructure for other crypto companies, enhancing their offerings without the hassle of extra intermediaries.\n\n### The Problem at Hand\n\nTraditional derivatives trading is bogged down by layers of intermediaries—think exchanges, clearinghouses, banks, and custodians. Conversely, the crypto ecosystem is fast becoming centralized, threatening the very freedom it promised. EthosX believes there's a better way to bridge these two worlds and take back that freedom in derivatives trading, ensuring a transparent, efficient, and user-empowered experience.\n\n### Key Features\n\n- **Direct Market Access**: Users can trade derivatives on assets like BTC, ETH, and various altcoins without intermediaries.\n- **Transparent Transactions**: All transactions are clear and straightforward, giving traders confidence over their assets.\n- **Real-Time Data & Insights**: EthosX provides advanced analytics tools, helping both retail and institutional traders make informed decisions based on current market conditions.\n- **Derivatives RFQ Platform**: Users can easily request quotes for various derivative options, making trading simpler.\n- **On-Chain Clearing**: Transactions are streamlined through secure and transparent automated processes.\n\n### Culture and Philosophy\n\nAt its core, EthosX is about empowerment—giving traders (both retail and institutional) more control over their trades while simplifying the process. The ethos here is that trading derivatives should not be a labyrinthine process; it should be as straightforward, direct, and risk-aware as possible.\n\n### Community Engagement\n\nEthosX encourages users to join their community, participate in rewards campaigns, and access educational resources designed to improve trading strategies and capabilities. \n\n**Website**: [EthosX](https://www.ethosx.finance/)  \n\nAs the derivatives market continues evolving, EthosX stands at the forefront, advocating for a decentralized future that favors participants, not intermediaries. If you're tired of the convoluted processes and hidden fees in traditional trading, EthosX presents a compelling alternative.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/c13248c60f2f8730c58a5fab539b6a3e3bb81174.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191321Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=665eea7b58aa7c3e0681a6dcb9cd62787d871319dfc844d2d3efc4b77fdfe61a",
    "social_links": [
        "https://www.linkedin.com/company/ethosx/",
        "https://twitter.com/ethosx_finance"
    ],
    "logo_path": "data/logos\\EthosX_logo.png"
}