{
    "Links": "https://www.ycombinator.com/companies/excellence-learning",
    "Name": "Excellence Learning",
    "Headline": "AI tutor starting with maths and science for 4th-12th grade",
    "Batch": "W25",
    "Description": "Aiming at complementing/replacing private tutoring and long-term study programs such as Kumon (over 30B TAM).\r\n\nExcellence is a web app for both ambitious and struggling students to learn math. As we believe each student is unique, we adapt our high quality courses and exercices to their knowledge and learning style in a very granular way. To facilitate learning, they get detailed text, voice and graphical explanations, can craft study plans, revise and memorize, and received human mentorship if needed.\r\n\nIn addition, we offer a program with daily courses and exercices, detailed feedback on their worksheets and more (super Kumon).\r\n\nFinally we sell the AI tutoring and exercise databases to schools in a B2B and B2B2C model and already work for the most prestigious institutions in France (Ecole polytechnique, college Stanislas...).\r\n\nWe're a passionate team of ex-quants, mathematicians and physics champions devoted to improving science education.",
    "Activity_Status": "Active",
    "Website": "https://excellence-ai.com/",
    "Founded_Date": "2025",
    "Team_Size": "4",
    "Location": "Stanford, CA",
    "Group_Partner_YC": "https://www.ycombinator.com/people/gustaf-alstromer",
    "Group_Partner": "Gustaf Alstromer",
    "Company_Linkedin": "https://www.linkedin.com/company/excellence-ai/",
    "Company_Twitter": "",
    "Tags": "industry:ai-enhanced-learning; industry:education; industry:saas; industry:edtech; location:san-francisco-bay-area",
    "social_links": [
        "https://www.linkedin.com/company/excellence-ai/"
    ],
    "logo_path": "data\\logos\\Excellence_Learning.png",
    "Active_Founders": [
        {
            "Name": "Alexis Bonnafont, Founder",
            "Description": "After earning a degree in Physics and Computer Science from École Polytechnique, I moved to the Bay Area to pursue a Research Master’s in Energy Science Engineering at Stanford University. I am now excited to join Y Combinator’s Winter 2025 batch and embark on this exciting entrepreneurial journey!",
            "LinkedIn": "https://www.linkedin.com/in/alexis-bonnafont"
        },
        {
            "Name": "Sovann Linden, Founder",
            "Description": "Sovann has deep expertise in maths education, having tutored over 10+ years and emerged from an unconventional school path, leading him to Oxford at 15. He holds a Mathematics Masters from Oxford and a Masters of Engineering from Stanford, where he conducted medical research. Sovann also spent 3 years working in finance, for a hedge fund and then for Softbank.",
            "LinkedIn": "https://www.linkedin.com/in/sovann-linden/"
        },
        {
            "Name": "Mattia Mauro, Founder",
            "Description": "Ex-quant, physics champion and VC, I want to share my passion for science. I grew up between Italy, Switzerland, South Korea and France. I started coding and tinkering with physics very early and won the International Physicists' Tournament in 2022. I've also briefly headed the nascent early-stage investing at Squarepoint Capital, a leading quantitative hedge fund.",
            "LinkedIn": "https://www.linkedin.com/in/mattia-mauro-437a35197/"
        }
    ],
    "crawl_status": true,
    "generated_description": "**Excellence Learning: Revolutionizing Math and Science Education with AI**\n\n**Overview**  \nFounded in 2025 and based in Stanford, CA, Excellence Learning is an innovative EdTech startup on a mission to personalize education through cutting-edge AI. This ambitious initiative is particularly aimed at students from 4th to 12th grade, focusing initially on math and science subjects. By leveraging AI technology, the company seeks to complement or even replace traditional private tutoring methods, targeting a massive $30 billion total addressable market (TAM).\n\n**What They Offer**  \nExcellence Learning operates as a web application designed to adapt to the unique learning styles of each student, combining tailored courses, diverse exercises, and human mentorship. Here's a breakdown of their offerings:\n\n1. **Adaptive Learning**: Students receive daily personalized lessons and practice worksheets crafted by experts, which help build a deep understanding of concepts rather than rote memorization.\n  \n2. **AI Tutor**: Their AI tutor, dubbed \"Tony,\" adapts in real-time to student queries—whether it’s through drawing, typing, or voice. This interaction mimics the engagement a student might receive from a human teacher.\n   \n3. **Human Mentorship**: If needed, students can opt for mentorship from top university graduates. This human element provides personalized support, study strategies, and motivation.\n\n4. **Super Kumon Program**: A step beyond conventional models like Kumon, this program delivers daily courses and detailed feedback on student progress.\n\n5. **B2B Solutions**: Excellence Learning also sells its AI tutoring and exercise databases to schools in a B2B and B2B2C model, already partnering with prestigious institutions like Ecole Polytechnique and College Stanislas.\n\n**Core Beliefs**  \nExcellence Learning stands firm on several principles:\n- **Personalization**: Every student is unique, and the learning approach should reflect that.\n- **Consistency is Key**: Regular practice and engagement are crucial for mastery in subjects.\n- **Holistic Engagement**: True learning involves engaging multiple senses and avoiding passive screen time, promoting handwriting, and encouraging interactive methods.\n\n**Team & Backing**  \nThe company boasts a passionate team of ex-quants, mathematicians, and physics champions, backed by Y Combinator, one of the most prestigious startup accelerators globally, under the guidance of Group Partner Gustaf Alstromer.\n\n**Pricing**  \nExcellence Learning offers competitive pricing models:\n- **Essentials Program**: $19/week for basic AI tutoring and daily courses without intensive human mentorship.\n- **Mentorship Program**: $29/week includes everything in the Essentials package plus dedicated mentoring.\n\n**Final Thoughts**  \nExcellence Learning is a bold attempt to redefine how students learn math and science, catering to both struggling and ambitious learners with its unique mix of technology and mentorship. They're not just teaching subjects; they’re fostering the love of learning—an essential ingredient for long-term success in education and beyond. For anyone interested in improving their child’s academic journey, this might just be the solution you’ve been waiting for.\n\nFor more information, check out their website: [Excellence AI](https://excellence-ai.com/) and explore a free trial to see how your child can benefit."
}