{
    "links": "https://www.ycombinator.com/companies/excepgen",
    "name": "Excepgen",
    "headline": null,
    "batch": "W19",
    "description": null,
    "activity_status": "Active",
    "website": "http://www.excepgen.com",
    "founded_date": null,
    "team_size": 3.0,
    "location": "San Francisco",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:biotech; location:san-francisco-bay-area",
    "founders": [],
    "status": true,
    "generated_description": "**Excepgen Overview: A Summit of Science and Innovation**\n\nWelcome to Excepgen, a bold biotechnology startup nestled in the vibrant tech hub of San Francisco. This company, part of Y Combinator's Winter 2019 batch, is on a mission to revolutionize nucleic acid medicines, focusing on gene therapies and vaccines powered by cutting-edge DNA and mRNA technologies.\n\n### What They Do\nAt Excepgen, the primary aim is not merely to improve how gene therapies are delivered, but to fundamentally alter how cells respond to these therapies. The team is tackling some significant biological challenges by dampening undesirable cellular pathways that can hinder therapeutic effectiveness. Their core initiatives target:\n\n- **Preventative and Therapeutic Vaccines**\n- **Rare Diseases**\n- **Gene Therapy**\n\n### The Team Behind It\nExcepgen boasts a small yet powerful team of three visionary scientists. They are driven by an unwavering commitment to human health, eager to challenge the status quo and explore foundational biological principles to make meaningful impacts on lives.\n\n### Engaging with Excepgen\nIf you’re curious to learn more, you can explore their work on their [website](http://www.excepgen.com). While they may be small, their ambition is anything but. For those looking for collaboration or opportunities, they have dedicated pages for careers and contact, reinforcing their openness to grow and innovate.\n\n---\n\nIn essence, Excepgen is not just another biotech company; it's a catalyst for change in the field of nucleic acid therapeutics. By focusing on how cells react to genetic therapies, they aim to usher in a new era of effective treatments that can tackle some of medicine’s toughest challenges. If their vision resonates with you, don't hesitate to reach out or check out their initiatives. The future of health might just be rewritten by teams like theirs.",
    "logo": "/logos/medium/missing.png",
    "social_links": [
        "https://www.crunchbase.com/organization/excepgen"
    ]
}