{
    "links": "https://www.ycombinator.com/companies/exin-therapeutics",
    "name": "Exin Therapeutics",
    "headline": "Precision genetic therapies targeting neural activity across disorders",
    "batch": "W25",
    "description": "We’re building a precision genetic therapy platform that targets neurological and neuropsychiatric disorders from a circuit-level perspective. Current approaches pursue single-gene fixes that only help small subsets of patients, leaving a multi-million patient population without effective treatment options.\r\n\nGene therapy opens the door to precisely modifying brain circuits. The problem is the elevated risk in neuroscience drug discovery. To solve this, we use a pre-clinical screening platform, multiple gene therapy candidates, and ML analytics to develop gene therapies capable of controlling neural activity and addressing neurological conditions such as autism spectrum disorder, epilepsy, and Parkinson’s disease.",
    "activity_status": "Active",
    "website": "https://www.exintherapeutics.com/",
    "founded_date": 2024.0,
    "team_size": 3.0,
    "location": "San Francisco",
    "group_partner": "Jared Friedman",
    "group_partner_yc": "https://www.ycombinator.com/people/jared-friedman",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:gene-therapy; industry:neurotechnology; industry:biotech; industry:therapeutics; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Ivan Lazarte, Founder",
            "description": "Experience in interdisciplinary research spanning Physics, Engineering and Neuroscience. DPhil in Physiology, Anatomy, and Genetics, focusing on molecular to systems level brain development and function, complemented by computational biophysical modeling.",
            "linkedin": "https://www.linkedin.com/in/ilazarte"
        },
        {
            "name": "Gabriel Ocana Santero, Founder",
            "description": "Neuroscientist with a background in biochemistry and research on gene therapy, pancreatic cancer, and muscle physiology at institutions in Boston, Vienna, and Stockholm. Earned MSc in Neuroscience and PhD in Pharmacology at Oxford Uni, focusing on neurodevelopment and the effects of SSRI anti-depressants on early patterns of neural activity. Used neuroAI models at the Gatsby Unit (UCL) to study serotonin’s role in cognition. Currently developing gene therapies for neurological conditions.",
            "linkedin": "https://www.linkedin.com/in/gabriel-ocana-santero-85b41819a"
        },
        {
            "name": "Marko Tvrdic, Founder",
            "description": "Cofounder & COO @ Exin Therapeutics. Worked across analysis levels in bio – from molecules to complex behavior. Previously, I worked on retinal and circadian rhythm disorders, neurodevelopment, and systems and comp neuro, with a small stint in venture. Oxford MSc + PhD (on leave to build Exin).",
            "linkedin": "https://www.linkedin.com/in/marko-tvrdic/"
        }
    ],
    "status": true,
    "generated_description": "**Company Overview: Exin Therapeutics**\n\nFounded in 2024, Exin Therapeutics is a promising startup based in San Francisco and proudly part of Y Combinator's W25 batch. The company is on a mission to revolutionize the treatment of neurological and neuropsychiatric disorders through precision genetic therapies that target neural activity at a circuit-level. \n\n**The Problem**\n\nTraditionally, the landscape of neurotherapeutics has been woefully underwhelming, particularly for the millions suffering from idiopathic neurological conditions. Existing treatments focus mostly on rare genetic causes, leaving a vast population with ineffective options. Moreover, neuroscience drug discovery is notoriously high-risk, contributing to the failure of many promising candidates.\n\n**The Solution**\n\nExin Therapeutics is taking a bold step beyond single-gene fixes. Their innovative platform leverages a combination of pre-clinical screening, machine learning analytics, and multiple gene therapy candidates to effectively tackle neural dysfunction. The aim? To develop effective gene therapies for conditions like Autism Spectrum Disorder, Epilepsy, and Parkinson’s Disease, thereby addressing the critical unmet need in the neurotherapeutics market.\n\n**Team and Leadership**\n\nThe company is currently a small but mighty team of three dedicated employees. Jared Friedman serves as the group's partner, bringing invaluable guidance as they navigate this complex field.\n\n**Tags and Focus Areas**\n\nExin Therapeutics operates at the intersection of several exciting domains: gene therapy, neurotechnology, biotech, and therapeutics. Their work encapsulates a forward-thinking approach to unraveling the complexities of neural activity and boosting the efficacy of potential treatments.\n\nFor more information about their groundbreaking work, you can visit their official website at [Exin Therapeutics](https://www.exintherapeutics.com/).\n\nIn a nutshell, Exin Therapeutics is setting out to dismantle the traditional approaches to neurological treatment, heralding a new era of precision medicine that brings hope where it's most needed.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/217af82ba5fb1287843dcdd3d18e8814f6801530.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191323Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=a1159bb86e2f075da5f0d52ce550c91bea0e12434e866061a09c8957e24c4812",
    "social_links": [
        "https://www.linkedin.com/company/exin-therapeutics",
        "https://x.com/ExinTx"
    ],
    "logo_path": "data/logos\\Exin_Therapeutics_logo.png"
}