{
    "links": "https://www.ycombinator.com/companies/expent-inc",
    "name": "Expent Inc",
    "headline": "Procure the right software 5x faster",
    "batch": "W21",
    "description": "Expent is a marketplace that accelerates software procurement for teams, while giving organizations control over the entire purchasing process.",
    "activity_status": "Active",
    "website": "https://www.expent.ai/",
    "founded_date": 2020.0,
    "team_size": 2.0,
    "location": "Fremont, CA",
    "group_partner": "Michael Seibel",
    "group_partner_yc": "https://www.ycombinator.com/people/michael-seibel",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:machine-learning; industry:saas; industry:b2b; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Harikrishna Narayanan, Founder",
            "description": "In 2020 Hari co-founded Expent. Prior to Expent, Hari was running the Machine Learning Services Product and Engineering group at Workday as a director where he was responsible for designing and executing the strategy & vision for multiple Machine Learning services. Before Workday, Hari led multiple data initiatives at Yahoo. Hari has a Masters in Computer Science from Georgia Institute of Technology and Bachelors from PSG Tech, India.",
            "linkedin": "https://www.linkedin.com/in/harikrishnanarayanan/"
        },
        {
            "name": "Srikanth Veeraraghavan, Founder",
            "description": "Srikanth is a co-founder of Expent. Prior to Expent, he was the Head of Security, Privacy and Compliance at PlanGrid. Prior to that, he was an early member of Zendesk’s Pre-IPO security team. He has more than 8+ years of extensive Security and Privacy experience working at various small, medium and large security companies. He has a Masters in Information Security from Johns Hopkins University and a Bachelors in Information Technology from Vellore Institute of Technology, India.",
            "linkedin": "https://www.linkedin.com/in/srikanth-veeraraghavan-426bb825"
        }
    ],
    "status": true,
    "generated_description": "**Expent Inc: Streamlining Software Procurement**\n\nExpent Inc, founded in 2020 and part of Y Combinator's W21 batch, is revolutionizing the way businesses procure software. With a mission to help organizations procure the right software five times faster, Expent serves as a marketplace that brings efficiency to the procurement process while giving teams ultimate control.\n\nBased in Fremont, CA, with a lean team of just two employees, Expent is leveraging machine learning and SaaS technology to power its solutions. Their group partner is Michael Seibel, a notable figure in the startup ecosystem, which adds credibility to their venture.\n\n### What They Do\n\nAt its core, Expent simplifies the software procurement lifecycle. They offer a comprehensive platform that manages everything from vendor sourcing to renewal management. Here's a quick overview of their key offerings:\n\n- **Sourcing**: Streamlining vendor selection and onboarding.\n- **Vendor Management**: Centralizing and optimizing vendor relations.\n- **Risk Management**: Utilizing AI to assess and manage vendor security and compliance risks.\n- **Approval Workflows**: Automating approval processes to speed up procurement timelines.\n- **Software Asset Management**: Keeping track of software assets and managing contracts efficiently.\n\nTheir platform even includes vendor catalogs, performance management tools, and renewal management systems, which eliminate the need for multiple disparate tools.\n\n### The Impact\n\nThe need for robust vendor management and procurement processes has never been more pressing. Organizations often face delays and inefficiencies due to siloed systems and lack of oversight. Expent tackles this by offering a unified platform that enhances collaboration across departments, improves visibility into vendor performance, and ensures compliance at every step.\n\nTheir solution appeals to various stakeholders in businesses—such as procurement, compliance, IT, and finance—making it a versatile tool for enhancing operational efficiency.\n\n### Trust and Backing\n\nExpent isn’t just another startup; it’s backed by a network of established investors, lending it significant credibility in the B2B space. Companies looking to streamline their procurement processes and minimize risks will find a valuable partner in Expent.\n\nExpent’s website, [expent.ai](https://www.expent.ai/), provides further insights and the opportunity to book a demo, helping teams envision how they can transform their procurement processes.\n\nIn essence, if your organization is overwhelmed with vendor chaos, Expent is positioning itself as a savvy solution for making procurement smarter, faster, and more integrated.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/d50aeacf775e26eb243a3456a707a11e40dd2479.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191325Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=52db1e42a4de60e745aaa823245c7a7e359ecb131ebffaf6f303cc5178c716ba",
    "social_links": [],
    "logo_path": "data/logos\\Expent_Inc_logo.png"
}