{
    "links": "https://www.ycombinator.com/companies/experiment",
    "name": "Experiment",
    "headline": "crowdfunding platform for science",
    "batch": "W13",
    "description": "Today's funders are so conservative they only fund the most obvious ideas. At Experiment, we fund the ideas that they won't fund; the ideas that matter.\r\n\nSince founding, over 47,000 citizens have pledged $9 million dollars supporting 900 scientific projects on the platform. 46% of all projects on Experiment are successfully funded. When the projects are finished, the scientists share the scientific results with their backers as lab notes and peer-reviewed publications.\r\n\nScientists from Stanford, Harvard, and Yale have chosen to use Experiment instead of writing grants. Bill Gates recognized Experiment by saying \"this solution helps close the gap for potentially-promising but unfunded projects.\"",
    "activity_status": "Active",
    "website": "http://experiment.com",
    "founded_date": 2012.0,
    "team_size": 1.0,
    "location": "Honolulu, HI",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:marketplace; industry:crowdfunding",
    "founders": [
        {
            "name": "Denny Luan, Founder",
            "description": "hello",
            "linkedin": "https://www.linkedin.com/in/denny-luan-8189b726/"
        }
    ],
    "status": true,
    "generated_description": "Experiment is a pioneering crowdfunding platform designed specifically for the scientific community. Founded in 2012 and part of Y Combinator's Winter 2013 batch, the company set out with a mission to support innovative scientific projects that traditional funders often overlook. The approach is straightforward: while today’s conventional funders prefer safe, obvious ideas, Experiment champions the bold, unorthodox endeavors that can lead to significant breakthroughs.\n\nSince its inception, Experiment has gained impressive traction. Over 47,000 individuals have come together to pledge around $9 million to support approximately 900 diverse scientific projects. Notably, 46% of these projects succeed in reaching their funding goals. What’s refreshing is that once these projects conclude, the scientists share their findings with backers in the form of detailed lab notes and peer-reviewed publications—truly making the supporters part of the scientific journey.\n\nThe platform is chosen by researchers from prestigious institutions like Stanford, Harvard, and Yale as a viable alternative to traditional grant writing, which can be cumbersome and competitive. Bill Gates has acknowledged Experiment's impact on bridging the funding gap for promising, yet unfunded, projects.\n\nHeadquartered in Honolulu, Hawaii, with a small team of just one employee, the company operates in the crowdfunding marketplace. They provide an open platform where civic-minded individuals can engage with science and directly contribute to research initiatives. This not only fuels innovation but also encourages broader participation in scientific discovery, opening the door for future generations of scientists.\n\nExperiment is all about making science accessible and exciting. The website is user-friendly, allowing visitors to discover different projects, start new ones, or just learn how it all works. For anyone interested in supporting science or participating in funding research, Experiment is the go-to platform.\n\nFor further information, you can check out their [website](http://experiment.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/4f9679770bc7929f9edd2983ca94c60f2f4a9a23.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191324Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=510d5edd5e7e531d85c7292cf77dc25f8c6ba042ef4502d6dfc0e248c517ef4f",
    "social_links": [
        "http://twitter.com/lets_experiment",
        "https://www.facebook.com/experimentcom/",
        "https://www.crunchbase.com/organization/experiment"
    ],
    "logo_path": "data/logos\\Experiment_logo.png"
}