{
    "links": "https://www.ycombinator.com/companies/explorex",
    "name": "Explorex",
    "headline": "Ecosystem Platform for Restaurants in India",
    "batch": "S20",
    "description": "The Indian restaurant industry has already adopted technology to adapt to the growing demands and match the expectations of today's customers but the absence of a full-stack cloud-based software is extremely frustrating to business owners today. The existing systems lack modularity, lack the ability to integrate with services, and hence aren't plug and play. Also, Restaurants are extremely frustrated with all the 5-6 independent systems that don't talk to each other. \r\n\nWe are solving these problems by building a full-stack solution for the 30 million+ restaurants in India, by solving order management, operations management, online delivery, payment processing, reports & analytics, and guest identification and re-engagement all using one system - Explorex.",
    "activity_status": "Active",
    "website": "https://explorex.co",
    "founded_date": 2020.0,
    "team_size": 18.0,
    "location": "Bengaluru, India",
    "group_partner": "Aaron Epstein",
    "group_partner_yc": "https://www.ycombinator.com/people/aaron-epstein",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:marketplace; industry:saas; industry:consumer",
    "founders": [
        {
            "name": "Mainak Sarkar, Founder",
            "description": "Hardcore product guy with core focus on UX and Practicality. Leading Explorex - A company that aims to revolutionise the dining out industry through tech. We at Explorex are building a full-stack solution for the 30 million+ restaurants in India, by solving order management, operations management, online delivery, payment processing, reports & analytics, and guest identification and re-engagement all using one system!",
            "linkedin": "https://www.linkedin.com/in/mainak-sarkar-679546107/"
        },
        {
            "name": "Pritam Khan, Founder",
            "description": "Tech enthusiast | Ex LinkedIn",
            "linkedin": "https://www.linkedin.com/in/iampkhan"
        }
    ],
    "status": true,
    "generated_description": "Explorex is on a mission to revolutionize the restaurant ecosystem in India. Founded in 2020, this Bengaluru-based startup is tackling a critical pain point in the restaurant industry: the lack of an integrated, cloud-based management system. Traditionally, restaurant owners have faced the frustration of juggling multiple, disjointed software systems that simply don’t communicate with each other. Explorex aims to change that.\n\nThe company delivers a comprehensive, full-stack solution tailored for the over 30 million restaurants in India. Their platform covers everything from order management and operations to online delivery, payment processing, and guest engagement. By consolidating all these features into a singular system, Explorex eliminates the inefficiencies of using several unconnected services.\n\nExplorex gained traction quickly, emerging from Y Combinator’s S20 batch, which provided valuable guidance and resources for scaling its services. The team, composed of 18 employees, has received endorsements from restaurant owners like Fox in the Field and Food Culture, who praise the platform for boosting operational efficiency and revenue. \n\nSo, what sets Explorex apart? Here are the core features:\n\n1. **Automated Ordering**: Customers can place orders directly through a web app—no cumbersome app downloads required.\n2. **Integrated POS**: A cloud-based point of sale that facilitates seamless order tracking and management.\n3. **Real-Time Analytics**: Owners have access to live data on restaurant performance, enabling data-driven decisions.\n4. **Customer Re-engagement Tools**: Smart profiling helps restaurants connect with their customers, enhancing loyalty and retention through targeted campaigns.\n5. **Third-Party Delivery Integration**: Manage multiple delivery services like Swiggy and Zomato from a single dashboard.\n\nWith these solutions, restaurant owners can expect a faster table turnaround (up to 40% improvement), increased average ticket sizes (up to 30%), and significant boosts in staff productivity—effectively enabling them to focus on providing excellent customer service rather than administrative tasks.\n\nAs the restaurant landscape continues to evolve, Explorex stands at the forefront, empowering business owners with the tools they need to thrive in a competitive market. If you're interested in giving your restaurant operations a much-needed upgrade, check out Explorex for a free demo at [Explorex.co](https://explorex.co).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/b914cc92bf46ed2f59be6fa43623a6df3125a8b1.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191324Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=6614403c4303a5dbd74d02b33edbf0b91943c184944ed154a770eb068c193cf0",
    "social_links": [
        "https://www.linkedin.com/company/explorexinc",
        "https://twitter.com/explorex_inc",
        "https://www.facebook.com/explorexinc"
    ],
    "logo_path": "data/logos\\Explorex_logo.png"
}