{
    "links": "https://www.ycombinator.com/companies/extern",
    "name": "Extern",
    "headline": "Professional Experience Anytime, Anywhere.",
    "batch": "W17",
    "description": "At Extern, we’re solving the experience gap.  Extern created the remote Externship, a skill-building work experience that is easier for students to access, and easier for companies to run, than an internship.  Our mission is to help anyone discover and launch their career through professional experiences available anywhere at any time.  Since 2020, we’ve created and powered Externships on behalf of companies from Fortune 500s to startups that have enabled tens of thousands of students to build real experience and open doors to incredible opportunity.  \r\n\nAfter spending $100K on average for a 4-year degree, graduates find that almost 40% of entry level jobs on Linkedin required 3+ years of work experience. Internships are how many college students get this kind of experience, but the demand for good internships outstrips the supply. Internship programs are difficult to scale, they favor students who already have social capital, and they’re time-consuming for employers to run.\r\n\nExternships are short, online, project-based work experiences that employers can offer to hundreds of students using less resource and employee time than it would take to support an intern.  Extern makes the complex process of running an Externship completely turnkey with software and industry experts which in turn makes professional experience more accessible to more students.\r\n\nBy making work experience more accessible, Extern is driving the rapid mobility and upskilling needed for a new economy.  We envision a world where anyone can access work experience as a form of education – no matter their background, experience, or socio-economic status.  Come join our movement to reshape work, education, and credentialing for future generations with the Externship.\r\n\nExtern was born out of a pivot from Paragon One (W17) which initially focused on providing students with a career center-as-a-service platform, connecting them with industry professionals to receive career coaching and guidance.  Backed by Y Combinator, Foundation Capital, Launch Fund, University Ventures, and Learn Capital.",
    "activity_status": "Active",
    "website": "http://www.extern.com",
    "founded_date": 2019.0,
    "team_size": 35.0,
    "location": "New York",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:education; industry:marketplace; industry:elearning; industry:recruiting; industry:remote-work; location:new-york",
    "founders": [
        {
            "name": "Matt Wilkerson, Founder/CEO",
            "description": "Matt is the Co-founder & CEO of Extern (www.extern.com) which created the remote Externship, a new form of work experience that lets people quickly build their resumes while giving companies expert-designed, turnkey projects that drive business outcomes.  Extern was a pivot from Paragon One which was YC'W17.  Matt previously co-founded e-commerce marketplace AHAlife, started his career at Morgan Stanley and TCV, and holds degrees from MIT in Computer Science & Engineering and Management Science.",
            "linkedin": "https://www.linkedin.com/in/mattwilkerson"
        }
    ],
    "status": true,
    "generated_description": "**Extern: Bridging the Experience Gap**\n\nFounded in 2019 and based in New York, Extern is transforming the way students gain professional experience, leveling the playing field for aspiring professionals across various backgrounds. Imagine spending an average of $100,000 for a degree, only to find that many entry-level positions demand years of experience—it's a disheartening realization. Extern's mission is clear: *Professional Experience Anytime, Anywhere.* \n\nAt its core, Extern is addressing a significant issue—what they term the \"experience gap.\" The conventional path to gaining work experience, namely internships, is often inadequate. The number of students seeking these opportunities dwarfs the available slots, and the traditional internships frequently cater to those with existing advantages, like strong social networks. This has led to tens of thousands of students missing out on critical professional development.\n\nEnter Externships: a modern, remote, project-based alternative to internships that offers meaningful professional experiences at scale. By leveraging advanced technology, Extern allows companies—ranging from Fortune 500 giants to agile startups—to manage these externships with ease. This flexibility makes it simpler for employers to connect with hundreds of students, without the extensive resources that traditional internships require.\n\nExtern's approach not only democratizes access to work experience but also accelerates skill development in an ever-evolving economy. With a vision where everyone can secure work experience as an educational vehicle, Extern is leading the charge to reshape how we perceive work, education, and credentials for future generations.\n\nOriginally pivoting from an earlier initiative called Paragon One—focused on career coaching—Extern has garnered backing from notable investors such as Y Combinator and Foundation Capital. Today, the team of 35 is passionately implementing innovative externship programs that empower students to explore diverse career paths through real, impactful projects.\n\nFor just $10 a month, students can submit an application to access a multitude of externships, diving into fields ranging from marketing to product development. By participating, they gain hands-on experience, build essential skills, and connect with industry professionals—all while remaining flexible and remote.\n\nExtern is clearly not just filling a gap; it's opening doors. With their innovative externship model, they’re changing the narrative for students who are eager to step into real-world roles and asking us all to reconsider what vital experience truly looks like in today’s job market. For more information, check them out at [www.extern.com](http://www.extern.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/a6b0867467c38890662ea7522056f9c46324d88b.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191326Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=f71debecfe1d5101728acf0e6bbaee34a3e17242676dfe64e0c583801b123831",
    "social_links": [
        "https://www.linkedin.com/company/paragon-one/"
    ],
    "logo_path": "data/logos\\Extern_logo.png"
}