{
    "links": "https://www.ycombinator.com/companies/faction",
    "name": "Faction",
    "headline": "Driverless electric vehicles at a fraction of the cost of a car.",
    "batch": "W21",
    "description": "Faction Technology, Inc. is a leader in developing right-sized driverless vehicle fleets. As pioneers in supervised autonomous mobility, Faction is dedicated to creating innovative solutions that redefine the future of transportation. With a commitment to sustainability, safety, and technological excellence, Faction is driving the evolution of autonomous mobility for a smarter, more connected world. Learn more at www.faction.us.",
    "activity_status": "Active",
    "website": "http://www.faction.us",
    "founded_date": 2020.0,
    "team_size": 25.0,
    "location": "South San Francisco, CA",
    "group_partner": "Brad Flora",
    "group_partner_yc": "https://www.ycombinator.com/people/brad-flora",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:autonomous-delivery; industry:robotics; industry:logistics; industry:electric-vehicles; industry:self-driving-vehicles",
    "founders": [
        {
            "name": "Ain McKendrick, Founder",
            "description": "Currently CEO at Faction Technology.  Prior to founding Faction, Ain has focused on autonomous systems on everything from light electric vehicles to the first successful driverless semi trucks to run on public highways.\n\nBefore getting in to the vehicle space, Ain spent a number of years in consumer electronics at Netflix, Dell, TiVo, and various startups.  He began his career as one of the founders of Palm Computing developing the original PalmPilot handheld digital assistants.",
            "linkedin": "https://www.linkedin.com/in/ainmckendrick/"
        }
    ],
    "status": true,
    "generated_description": "**Faction Technology, Inc.: Redefining Transportation with Driverless Electric Vehicles**\n\nFounded in 2020 as part of Y Combinator's W21 batch, Faction Technology, Inc. epitomizes the future of autonomous mobility. Located in South San Francisco, CA, and staffed by a team of 25, Faction is on a mission to deliver driverless electric vehicles at a fraction of traditional car costs. Their ambitions are grounded in a commitment to sustainability, safety, and technological innovation.\n\n**What They Do:**\nFaction aims to transform transportation by offering right-sized driverless fleets that cater to various needs—from on-demand vehicle services to last-mile deliveries. The innovations they bring to the table aren't just about self-driving; they encompass a comprehensive software suite that integrates seamlessly with existing fulfillment and order management systems, making driving more efficient and environmentally friendly.\n\nTheir driverless technology is adaptable across a range of industries, including airfields, grocery, fast food, and delivery fleets. This flexibility allows businesses to enhance operations, reduce their carbon footprint with lighter EVs, and engage customers through real-time order tracking via an application.\n\n**Technology and Approach:**\nAt Faction, they take a pragmatic approach to autonomy. Their solutions combine baseline autonomy with a trajectory-based assist system, allowing for rapid deployment while ensuring safety with backup drivers during initial rollouts. They also emphasize fleet electrification, encouraging companies to adopt micro EVs that can operate autonomously, significantly impacting their operational costs and ecological footprint.\n\n**Getting Started:**\nFor businesses looking to transition to driverless operations, Faction follows a structured roadmap:\n1. Assess current operations and regulations.\n2. Deploy a test fleet with drivers to gather operational data.\n3. Integrate their cloud technology with existing management systems.\n4. Gradually scale up to fully driverless operations.\n\n**Future-Proofing Transport:**\nFaction is at the forefront of the autonomous vehicle revolution, working closely with partners like GoCar to expand their impact. Their solutions promise to make transportation smarter, safer, and more connected, laying the groundwork for a future where sustainable mobility is accessible to all.\n\nExplore more about Faction's journey and capabilities at [Faction.us](http://www.faction.us).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/3242c4000a3efcb386fdaad5b35f144e3b97fb9c.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191326Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=97524cc374e2bc9aa4d5f574740e2221de11a31bc44a73a189aec5caab7da65b",
    "social_links": [
        "https://www.linkedin.com/company/faction-technology",
        "https://twitter.com/factionmoto",
        "https://www.facebook.com/factiontechnology",
        "https://www.crunchbase.com/organization/faction-65b7"
    ],
    "logo_path": "data/logos\\Faction_logo.png"
}