{
    "links": "https://www.ycombinator.com/companies/faire",
    "name": "Faire",
    "headline": "The global online platform empowering independent retail.",
    "batch": "W17",
    "description": "Faire is an innovative online marketplace that uses machine learning to match local retailers with the brands and products that uniquely fit their stores. We are using the power of technology to connect brands and independent retailers from all over the world, building a thriving community of hundreds of thousands of retailers, which has resulted in over 7 million new connections to date. Faire was founded on the belief that the future of retail is local.\r\n\nOur mission is to empower brands and retailers to strengthen the unique character of local communities. Our data-driven approach unburdens retailers from decades-old obstacles by helping find the right products for their shop. Plus, our straight-forward financial terms level the playing field by eliminating inventory risk and providing access to capital—key offerings previously only available to big box chains. For brands, our platform provides powerful sales, marketing, and analytics tools that simplify their business and allow them to focus on what they love: making great products.",
    "activity_status": "Active",
    "website": "https://www.faire.com/",
    "founded_date": 2017.0,
    "team_size": 900.0,
    "location": "San Francisco",
    "group_partner": "Gustaf Alstromer",
    "group_partner_yc": "https://www.ycombinator.com/people/gustaf-alstromer",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:marketplace; industry:retail; location:san-francisco-bay-area",
    "founders": [],
    "status": true,
    "generated_description": "**Company Overview: Faire**\n\nFounded in 2017 and based in San Francisco, Faire is reshaping the retail landscape with its innovative online marketplace. Empowering independent retail is at the core of its mission. The platform leverages machine learning to connect independent retailers with over 100,000 brands and products tailored to fit their unique needs.\n\nAt its essence, Faire believes that the future of retail is local. By fostering connections between independent brands and retailers, Faire has successfully established a bustling community, resulting in over 7 million new connections. They’re not just selling products; they’re crafting and maintaining the vibrancy of local communities across the globe.\n\n**How Faire Works**\n\nFaire challenges the traditional wholesale model. By removing long-standing barriers, it helps retailers discover the right products effortlessly while eliminating inventory risks. Retailers can confidently experiment with new brands, enjoying benefits like free returns on first orders and payment terms that allow invoices to be settled 60 days later, all without hidden fees. \n\nFor brands, the Faire platform simplifies operations by providing powerful sales, marketing, and analytics tools. This means brands can concentrate on their passion for crafting outstanding products instead of getting bogged down by logistics.\n\n**Key Features**\n- **Diverse Catalog**: Retailers can explore various categories ranging from home decor and beauty products to food and drink, seeking out items that resonate with their customers.\n- **Focus on Values**: The platform champions brands that reflect values important to the community—including eco-friendliness, women-owned businesses, and handcrafted goods.\n- **Support and Resources**: Faire offers educational resources and community engagement through its blog and support centers.\n\n**Team and Leadership**\n\nWith a dedicated team of approximately 900 employees, Faire is led by a strong vision inspired by the belief that independent retail is vital for enriching local economies. The company is part of Y Combinator Batch W17, a notable accelerator that has paved the way for many successful startups.\n\n**Why It Matters**\n\nFor aspiring entrepreneurs, local shops, and independent brands, Faire is not just a platform; it's a movement. By challenging monopolistic retail practices and focusing on community empowerment, Faire is reshaping the future of how we shop, fostering diversity and innovation in independent retail.\n\n**Website & Contact**\nTo explore more about what Faire has to offer, visit their website at [faire.com](https://www.faire.com). Whether you’re a retailer looking to curate your store or a brand seeking to expand your reach, Faire is where the future of independent retail is happening.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/8bcc78a3560fb27da8701777d5f7d302a22d4255.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191326Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=8de02bdf3a5c169196faf3af123014309ecd9f1703caccee6b67561a8cbb79ad",
    "social_links": [
        "https://www.linkedin.com/company/fairewholesale/",
        "https://twitter.com/faire_wholesale",
        "https://www.facebook.com/FaireWholesale/",
        "https://www.crunchbase.com/organization/indigo-fair",
        "https://github.com/Faire"
    ],
    "logo_path": "data/logos\\Faire_logo.png"
}