{
    "links": "https://www.ycombinator.com/companies/fampay",
    "name": "FamPay",
    "headline": "Indiaâ\u0080\u0099s first neobank for teenagers",
    "batch": "S19",
    "description": "With FamPay, minors can do UPI, P2P and card payments without the need to set up a bank account. FamPay allows parents to send money to their kids below the age of 18, which they can spend securely any time, anywhere, under parentâ\u0080\u0099s supervision. FamPay aims at making payments smooth and fun for children.",
    "activity_status": "Active",
    "website": "https://fampay.in",
    "founded_date": 2019.0,
    "team_size": 24.0,
    "location": "Bengaluru, India",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:payments",
    "founders": [
        {
            "name": "Sambhav Jain, Founder",
            "description": "Founder at FamPay (YC S19) \nBuilding the future of payments for teenagers in India",
            "linkedin": "https://www.linkedin.com/in/sambhavanandjain"
        },
        {
            "name": "Kush Taneja, Founder",
            "description": "Kush is the founder and co-CEO of FamPay - one of the largest fintechs in India processing 100M txs/ month and is designed exclusively for GenZs and GenAlphas. Theyâ\u0080\u0099re backed by YC, Sequoia, GC and have raised $42M. FamPay is doing great and is taking significant market share. Kush is quite bullish on the generation born in 21st century. He is also recognised by Forbes 30 under 30. Other than fintech, Kush is passionate about the intersection of education, health and technology.",
            "linkedin": "https://www.linkedin.com/in/kushtaneja"
        }
    ],
    "status": true,
    "generated_description": "### FamPay: Pioneering Teen Financial Inclusion in India\n\n**Overview:**\nFounded in **2019** and based in **Bengaluru**, India, FamPay is carving a unique niche in the fintech sector by being India’s first **neobank for teenagers**. This innovative platform allows minors to make electronic payments—like UPI (Unified Payments Interface), peer-to-peer (P2P) transfers, and even card payments—without the hassle of a traditional bank account. Essentially, FamPay helps parents transfer money to their kids securely, letting the younger generation spend under their supervision while paving the way for financial literacy.\n\n**Mission:**\nFamPay's mission is straightforward yet compelling: **to make payments smooth and enjoyable for children**. By doing so, they’re not just facilitating transactions; they’re empowering the next generation to understand and manage money effectively.\n\n**Key Features:**\n1. **Spending Account**: FamPay’s offering, known as **FamX**, allows users aged 11 and above to open a spending account that simplifies financial interactions. \n2. **UPI Payments**: The platform enables transactions that are almost instantaneous, boasting payment times of less than 2 seconds—talk about a frictionless experience!\n3. **Custom Features**: Kids can personalize their experience with custom UPI IDs and cards, including a one-of-a-kind “doodle card” option that encourages creativity.\n4. **Rewards System**: Regular spenders can earn cashback and discounts through FamCoins on various transactions, incentivizing financial responsibility.\n5. **24/7 Support**: FamPay’s commitment extends to customer service, providing help whenever needed.\n\n**Growth and Impact:**\nWith a team of 24 dedicated employees, FamPay has already garnered over **10 million registered users**, reflecting its strong market penetration and trust from both teenagers and parents alike. The platform also has strong backing from notable investors, including **Y Combinator**, providing a solid foundation for future growth and innovation.\n\n**What Sets Them Apart?**\nFamPay taps into a demographic that has largely been overlooked by banks and traditional financial institutions. By creating a bridge between parents and children regarding money management, they are pioneering a new way for teens to learn about spending, saving, and financial independence. \n\n**Conclusion:**\nIn a world where financial technology is rapidly evolving, FamPay stands out not just for what it offers but for the societal change it aims to induce. It’s reshaping how young people in India engage with money, ensuring they are not just passive users but educated participants in their financial futures. They are not just a fintech enterprise; they are a part of a movement towards smarter, well-informed financial habits for the youth.\n\nFor more information, visit their website at [FamPay](https://fampay.in).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/ecf2156d9e82bcc5d049ec91e692bf481952c39e.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191327Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=e7ee8f648821d1b5a3990e382fd424df41267f451b175c27edeaf0d2c5918797",
    "social_links": [
        "https://www.linkedin.com/company/fampay/",
        "https://twitter.com/fampayindia",
        "https://www.facebook.com/fampay.in/",
        "https://www.crunchbase.com/organization/fampay",
        "https://github.com/fampay"
    ],
    "logo_path": "data/logos\\FamPay_logo.png"
}