{
    "links": "https://www.ycombinator.com/companies/farmako-healthcare",
    "name": "Farmako Healthcare",
    "headline": "India's fastest medicine delivery in just 30 minutes",
    "batch": "S20",
    "description": "We are India's fastest medicine delivery service. We deliver medicines in just 30 minutes. We have built highly optimized pharmacy stores and a set of internal tools designed to process prescriptions quickly.\r\n\nWe also provide easy-to-integrate APIs and SDK for anyone to start a virtual pharmacy without needing a license, pharmacy, or delivery fleet. Any doctor, teleconsultation app, or EMR provider can start delivering medicines to their patients on WhatsApp or App using our service in the background. We have more than 80 B2B partners, including India's top teleconsultation apps, EMR providers, hospitals, elderly care apps, and insurance providers.\r\n\nWe operate 24/7 in Gurgaon, New Delhi, and Moradabad and deliver over 15,000 orders monthly. So far, we have processed more than 250K orders and done thousands of life-saving deliveries.\r\n\nWe started in 2020 with the vision to build a centralized health record system for India. We had an AI-powered EMR app for doctors and a SaaS for diagnostic labs to add patients' medical records to Farmako Health ID. We have more than 3M health records added on Farmako. In 2022, the Indian government launched ABHA Health ID and we became one of the first official partners with them. In 2023, we launched quick medicine delivery and decided to move forward with ABHA Health ID for medical records.\r\n\nNow, we are building a safe health assistant inside our medicine delivery app, which will be connected to your Health ID and all your past medical records. Our goal is to make it a super-safe and accurate health assistant for the world, which can eliminate your doctor in the long run for all primary care issues.",
    "activity_status": "Active",
    "website": "https://farmako.in/delivery",
    "founded_date": 2019.0,
    "team_size": 25.0,
    "location": "Gurugram, India",
    "group_partner": "Gustaf Alstromer",
    "group_partner_yc": "https://www.ycombinator.com/people/gustaf-alstromer",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:health-tech; industry:delivery; industry:digital-health; industry:healthcare",
    "founders": [
        {
            "name": "Aman Bhandula, Founder",
            "description": "I'm the founder & CEO of Farmako. I studied at IIT Roorkee for 4 years. I love machine learning and designing. \n\nI believe that the work we are doing at farmako is saving thousands of lives. Digital Health records will be game-changing for countries like India where we don't have a great healthcare infrastructure and we don't have enough doctors either. The market is huge, the work is challenging and it does a great impact on people's lives directly.",
            "linkedin": "https://www.linkedin.com/in/aman-bhandula-b71032132/"
        },
        {
            "name": "Kaishu Sahu, Founder",
            "description": "Kaishu is the co-founder and CEO of UnifyAir. Previously, he was the co-founder and CTO of Farmako (YC S20). \n\nKaishu is a graduate of IIT Roorkee and contributed to open-source projects like LibreOffice, as well as being a part of Google Summer of Code. He also led Android infrastructure update at Zomato.",
            "linkedin": "https://linkedin.com/in/kaishu-sahu"
        }
    ],
    "status": true,
    "generated_description": "**Farmako Healthcare: Redefining Medicine Delivery in India**\n\nFounded in 2019 and a Y Combinator S20 alum, Farmako Healthcare is on a mission to be India’s fastest medicine delivery service, boasting a remarkable 30-minute delivery promise. Based out of Gurugram, this dynamic company operates 24/7 in key cities like Gurgaon, New Delhi, and Moradabad, delivering over 15,000 orders monthly and having processed more than 250,000 orders since its inception.\n\n**The Backbone of Farmako: Technology and Partnerships**\n\nFarmako’s innovation lies in its optimized pharmacy stores and technology stack that streamlines prescription processing. Beyond just delivery, they offer easy-to-integrate APIs and SDKs that allow healthcare providers—be it doctors, teleconsultation apps, or EMR platforms—to facilitate medicine delivery through channels like WhatsApp. With over 80 B2B partners including acclaimed teleconsultation platforms and hospitals, Farmako is becoming a cornerstone in India’s healthcare ecosystem.\n\n**Vision for Health Records**\n\nOriginally launched with a broader vision to build a centralized health record system in India, Farmako developed an AI-powered EMR app for doctors and a diagnostic lab SaaS, accumulating over 3 million health records. In partnership with the Indian government’s ABHA Health ID initiative, they've adapted their model to incorporate structured health records, aligning with national healthcare goals. Their future plans include a health assistant within their delivery app, aiming to provide accessible and accurate primary care solutions.\n\n**Customer-Centric Approach**\n\nFarmako isn’t just about speed. Customer feedback highlights the reliability and supportive nature of their service. They enable easy ordering through calls or apps, providing real-time assistance from licensed pharmacists. They also offer significant discounts on medicines, making healthcare not just fast but cost-effective.\n\n**Awards and Recognition**\n\nFarmako’s promise and quality have been acknowledged by being listed in Forbes' “30 Under 30 Asia” for Healthcare in 2022. Their innovative approach has gained attention from prominent media outlets such as The Indian Express, YourStory, and TechCrunch.\n\n**A Committed Team**\n\nWith a growing team of around 50 professionals drawn from top colleges like IIT Roorkee, Farmako combines expertise in technology, operations, and customer engagement. Their goal is clear: improve healthcare delivery in a country where medical resources are often scarce.\n\n**Conclusion**\n\nIn a nutshell, Farmako Healthcare is not just a medicine delivery service; it’s a transformative player in the healthcare sector, leveraging technology to improve access and efficiency. They are committed to making healthcare swift, affordable, and reliable—which is precisely what India needs. You can learn more or place an order at [Farmako's website](https://farmako.in/delivery).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/829e971fe9a0e9012155a43e34646b6a2a8208d4.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191327Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=e72d393e94eff19c963a8e81a6055837454b6f923350980bb68aecb08056c5db",
    "social_links": [
        "https://www.linkedin.com/company/14597491",
        "https://twitter.com/FarmakoIn",
        "https://www.facebook.com/FarmakoIN",
        "https://www.crunchbase.com/organization/farmako-4206",
        "https://github.com/FarmakoHealthcare"
    ],
    "logo_path": "data/logos\\Farmako_Healthcare_logo.png"
}