{
    "links": "https://www.ycombinator.com/companies/fathom",
    "name": "Fathom",
    "headline": "Never take notes again with the #1 AI Meeting Assistant",
    "batch": "W21",
    "description": "Instead of trying to hurriedly take notes while also having a conversation, you simply push a button in our app whenever you hear something important, like a piece of product feedback or action item. In real-time our system records, transcribes, and creates clips from the parts of the conversation you tagged that can share with your team or use to write post-call notes.",
    "activity_status": "Active",
    "website": "https://fathom.video",
    "founded_date": 2020.0,
    "team_size": 25.0,
    "location": "San Francisco",
    "group_partner": "Michael Seibel",
    "group_partner_yc": "https://www.ycombinator.com/people/michael-seibel",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:saas; industry:b2b; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Richard White, Founder",
            "description": "First employee and lead designer of Kiko (S05) with Justin Kan and Emmett Shear. Founder and former long-time CEO of UserVoice. I love to design low-friction SAAS products for B2B.",
            "linkedin": "https://www.linkedin.com/in/rrwhite/"
        }
    ],
    "status": true,
    "generated_description": "Fathom is a cutting-edge AI meeting assistant founded in 2020 and based in San Francisco. As a proud member of Y Combinator's W21 batch, its mission is straightforward yet ambitious: \"Never take notes again.\" This product is designed to enhance productivity during meetings by allowing users to focus on the conversation rather than scrambling to jot down notes.\n\nThe core proposition of Fathom is the elimination of traditional note-taking. Instead of typing or writing during discussions, users can simply push a button in the app whenever something notable comes up—like feedback or action items. The AI handles the rest: it records, transcribes, and produces clips from the tagged moments of the conversation, which can be shared with team members or used for post-call summaries. Within 30 seconds of a meeting ending, users receive a neatly organized summary, set to sync automatically with their CRM, saving them an average of 20 minutes per meeting.\n\nWith a team of 25, Fathom is positioned as a powerful tool for anyone who relies on video conferencing platforms like Zoom, Microsoft Teams, and Google Meet. The product is versatile, supporting 28 languages and integrating seamlessly with various tools like Slack and Asana, making it an indispensable asset for sales, customer success, operations, and marketing teams alike.\n\nFathom's customer satisfaction is reflected in its impressive net promoter score of 81 and over 4,000 positive reviews, earning it accolades like \"AI Product of the Year\" and making it the top-ranked AI meeting assistant on platforms like G2 and Product Hunt.\n\nFor users interested in exploring Fathom, the app is free for unlimited recording, transcription, and summarization, offering premium features like advanced AI-generated summaries and action item generation at a low cost. The commitment to user privacy and data security is robust; Fathom ensures that all recordings are private and safeguarded by the latest encryption standards.\n\nIn summary, whether you’re managing complex projects, leading sales calls, or coordinating team efforts, Fathom is designed to streamline your workflow, allow for greater engagement in conversations, and transform the way meetings are conducted. You can learn more and get started at [Fathom’s website](https://fathom.video).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/ac7634c0c6e0d6e35869433aaa73039bd3920f59.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191327Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=ce935fe74a3c23002f837c09fe14d9b6db419b2d8865e107015bded2010ebaf3",
    "social_links": [
        "https://www.linkedin.com/company/fathom-video/"
    ],
    "logo_path": "data/logos\\Fathom_logo.png"
}