{
    "links": "https://www.ycombinator.com/companies/fazeshift",
    "name": "Fazeshift",
    "headline": "AI agent for Accounts Receivable",
    "batch": "S24",
    "description": "Fazeshift is an AI agent for automating Accounts Receivable. What used to take teams of people and hours of manual work can now be fully automated with Fazeshift. \r\n\nCaitlin and Timmy met while getting their MBA at Harvard. After graduating, they started a B2B marketing software startup, which is where they first experienced the pain of this process.\r\n\nThe problem stems from fragmented data across software platforms like QuickBooks, Stripe, NetSuite, DocuSign, HubSpot, and Salesforce. Fazeshift’s infrastructure connects the data across these software platforms and uses LLMs to automate the previously manual workflow.",
    "activity_status": "Active",
    "website": "https://www.fazeshift.com/",
    "founded_date": 2023.0,
    "team_size": 2.0,
    "location": "San Francisco",
    "group_partner": "Garry Tan",
    "group_partner_yc": "https://www.ycombinator.com/people/garry-tan",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:b2b; industry:ai; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Caitlin Leksana, Founder",
            "description": "Caitlin is the co-founder and CEO of Fazeshift. Before Fazeshift, Caitlin was CEO of a crypto marketing automation startup where she sold to global enterprises including Square Enix, dYdX, and the founder of Marvel Studios. She spent 2 years as a consultant at BCG advising tech companies on product, operations, and pricing strategy. She received her MBA from Harvard Business School and has a deep personal understanding of the operational pain points that Fazeshift has set out to solve.",
            "linkedin": "https://www.linkedin.com/in/caitlinleksana/"
        },
        {
            "name": "Timmy Galvin, Founder",
            "description": "Timmy is the co-founder and CTO of Fazeshift.  He previously worked at a fintech startup using AI to automate bank operations and financial services.  Timmy holds two computer science degrees from MIT and an MBA from Harvard Business School.  He served for seven years as a nuclear submarine officer in the US Navy, taught cybersecurity at the US Naval Academy, and holds a software patent for data algorithms.",
            "linkedin": "https://www.linkedin.com/in/timmygalvin/"
        }
    ],
    "status": true,
    "generated_description": "### Fazeshift: Revolutionizing Accounts Receivable with AI\n\n**Overview:**\nFazeshift, a San Francisco-based startup, is redefining the world of accounts receivable (AR) automation through its cutting-edge AI technology. Founded in 2023 by Caitlin and Timmy, both MBA graduates from Harvard, this company emerged from the founders' firsthand experiences with the convoluted and labor-intensive processes of AR management. Today, Fazeshift stands as part of Y Combinator's Batch S24, signaling both credibility and potential for growth.\n\n**Mission:**\nFazeshift's mission is clear: to empower businesses by automating the accounts receivable process. The tools that used to require hours of manual labor and multiple team members can now perform their tasks almost instantaneously, thanks to Fazeshift’s AI agent. \n\n**Challenges Addressed:**\nMany businesses grapple with fragmented data across various software platforms such as QuickBooks, Stripe, DocuSign, HubSpot, and Salesforce. Fazeshift tackles this problem head-on by integrating and connecting data from these platforms, thereby streamlining the AR workflow and reducing the risk of human error.\n\n**Core Features:**\n1. **Automation of Invoicing:** Transform sales contracts into invoices instantly with AI, ensuring prompt billing and payment.\n2. **Cash Application:** Automatically match payments regardless of the method (ACH, wire, credit card, or check), providing companies with real-time updates and accuracy.\n3. **Collections Management:** Automate reminders and follow-ups, creating intelligent workflows for faster payment cycles while reducing days sales outstanding (DSO) by up to 50%.\n4. **Integration-Friendly:** Fazeshift seamlessly connects with existing tools in your tech stack to minimize disruption and streamline implementation.\n\n**Benefits:**\n- **Cost Reduction:** Businesses experience up to 90% reduction in AR costs.\n- **Time Savings:** Up to 90% time savings compared to traditional processes.\n- **Cash Flow Improvement:** Achieve up to 5x cash flow uplift, making a tangible difference in financial health.\n\n**Security and Compliance:**\nFazeshift takes security seriously, adhering to global privacy laws and standards like SOC 2 and PCI compliance to safeguard sensitive financial data.\n\n**The Founders' Vision:**\nCaitlin and Timmy are committed to simplifying AR processes for businesses of all sizes. Their experiences in B2B marketing demonstrated the pains associated with managing invoicing and collections, fueling their resolve to create a more efficient solution.\n\nWith a lean team of just two employees, Fazeshift is poised for rapid growth as it aims to help businesses face unique AR challenges. The founders also enjoy backing from Garry Tan, a respected figure in the startup ecosystem.\n\nIf you’re interested in transforming your financial operations and enhancing your company's cash flow management, visit Fazeshift at [fazeshift.com](https://www.fazeshift.com/) to learn more or schedule a demo. \n\nIn short, Fazeshift isn't just a product; it's a game-changer for anyone serious about financial efficiency.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/bf7aae439f9448724308c2d46610f7caa35ad970.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191328Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=bd73d1b69e43648cf93259780f7f0f4b23e7ff15b9470adacfc9566272d6cd2d",
    "social_links": [
        "https://www.linkedin.com/company/fazeshift/"
    ],
    "logo_path": "data/logos\\Fazeshift_logo.png"
}