{
    "links": "https://www.ycombinator.com/companies/fello",
    "name": "Fello",
    "headline": "Grow money and win $1000 every week by saving and playing games",
    "batch": "W22",
    "description": "Fello is a game-based savings and investment application for the gen-z and young millennials of India to save play and earn returns more than a traditional savings bank account. We are merging the worlds of gaming and finance to make finance fun, easy and rewarding!\r\n\nUsers can save and invest in financial assets and for every rupee they save they get one gaming token using which they can play daily and weekly games and if they win in these games they get to win Rs.1 lakh every week!\r\n\nJust within a short span of 12 weeks of launch, we onboarded 250,000 users with 92% of them being referred users, 88% of them being first-time investors who are spending over 12 minutes on an average per day on the app saving and playing games together!",
    "activity_status": "Active",
    "website": "https://fello.in",
    "founded_date": 2021.0,
    "team_size": 24.0,
    "location": "Bengaluru, India",
    "group_partner": "Aaron Epstein",
    "group_partner_yc": "https://www.ycombinator.com/people/aaron-epstein",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:consumer; industry:gaming",
    "founders": [
        {
            "name": "Manish Maryada, Founder",
            "description": "I am Manish, Founder & CEO of Fello where we are building India's first gaming and finance application. I come with experience of working in traditional finance and early-stage fintech startups and scaling them. My skillset in Product Management, Growth, Operations, and Strategy are some of the key strengths developed out of working in a corporate and startup environment. All of this is complemented by a Master’s Degree focused in Finance from Texas A&M University - Mays Business School.",
            "linkedin": "https://www.linkedin.com/in/manish-maryada/"
        }
    ],
    "status": true,
    "generated_description": "Fello is a fresh fintech startup based in Bengaluru, India, that’s shaking up the traditional ways of saving and investing. Founded in 2021 and part of Y Combinator’s W22 batch, Fello combines gaming with finance to attract Gen-Z and young millennials by making money management fun and rewarding.\n\nThe core mission of Fello is simple: \"Grow money and win $1000 every week by saving and playing games.\" Users can save and invest while earning gaming tokens for every rupee they save. These tokens unlock daily and weekly games where participants can win exciting cash prizes, including up to ₹1 lakh each week! Within just 12 weeks of launching, Fello has onboarded 250,000 users, with a staggering 92% coming via referrals. Notably, 88% of these users are first-time investors, who now spend over 12 minutes each day engaging with the app.\n\nFello offers high returns—up to 15.5% on savings—compared to traditional savings accounts. They also provide access to digital gold and P2P lending assets, regulated by RBI, allowing users to choose secure investment options. There’s a sleek app that supports this gamification of saving, making financial literacy more approachable for a younger audience.\n\nThe company is led by a nimble team of 24, and they have already gained the trust of over a million Indians. They've crafted a platform where savings aren't just static—they translate into tickets for weekly draws, creating compounding excitement. Plus, they've successfully made finance a community activity, as users can invite friends to play along.\n\nIn a nutshell, Fello is redefining how young Indians think about money—turning the often monotonous task of saving into an engaging and potentially lucrative game. For anyone looking to save smartly while having fun, Fello is a compelling option to check out. You can explore more about them on their website: [fello.in](https://fello.in).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/66d7388403cb1bb5f9eb0c671d899203fb8d9190.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191329Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=194304d485fe2bbe3223b82393d0e065b0c566099b06257cb4670af4b737bf48",
    "social_links": [
        "https://in.linkedin.com/company/fellofinance",
        "https://twitter.com/TheFelloApp",
        "https://www.facebook.com/fellofinance/",
        "https://www.crunchbase.com/organization/fello-3331"
    ],
    "logo_path": "data/logos\\Fello_logo.png"
}