{
    "links": "https://www.ycombinator.com/companies/fella-health",
    "name": "Fella Health",
    "headline": "The telehealth clinic for men with obesity",
    "batch": "W20",
    "description": "Fella Health is the telehealth clinic for men with obesity. With Fella, patients meet a board-certified obesity doctor to prescribe FDA-approved medications, while they undertake personalized health coaching through our app.",
    "activity_status": "Active",
    "website": "https://www.fellahealth.com/",
    "founded_date": 2021.0,
    "team_size": 4.0,
    "location": "San Francisco",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:consumer-health-services; industry:healthcare; industry:telemedicine; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Richie Cartwright, Founder",
            "description": "Co-founder of Fella Health, the telemedicine clinic for men with obesity. Serving 1 million fellas by 2026.\nInspired by my own 6-year secret battle with binge eating disorder.\n\nBefore Fella, I founded an AI company (FlowX) working with the UK government. FlowX applied a layer of computer vision to existing CCTV cameras to extract transport data, to help ease congestion. FlowX was acquired after we won a $650k contract with the UK Department for Transport.",
            "linkedin": "https://www.linkedin.com/in/richard-cartwright"
        }
    ],
    "status": true,
    "generated_description": "**Fella Health: Revolutionizing Men's Health Through Telemedicine**\n\nFounded in 2021 and located in the tech hub of San Francisco, Fella Health is a telehealth clinic aiming to make waves in the realm of men’s obesity management. As part of Y Combinator’s Batch W20, they've adopted an approach that combines advanced medical treatments with personalized health coaching delivered via their app.\n\n**Mission at Heart**\nFella's mission is straightforward: to be the go-to telehealth clinic for men battling obesity. They make it easy for patients to connect with board-certified obesity doctors who prescribe FDA-approved medications. Pair that with their easy-to-use app for health coaching, and you’ve got a comprehensive weight management solution.\n\n**The Team and Treating Patients**\nFella Health runs with a lean team of just four employees, all committed to helping men achieve their weight loss goals. They focus on evidence-based treatments like GLP-1 medications, such as Semaglutide and Tirzepatide, known to aid significant weight loss—averaging 16.9% and 22.5% respectively of total body weight.\n\n**Personalized Approach**\nAt Fella, it's not just about medications. Every patient undergoes a metabolic assessment, and they receive free coaching tailored to their unique lifestyle and challenges. The program includes regular check-ins with a health coach and access to ongoing support—an essential element for maintaining weight loss long-term.\n\n**Risk-Free Health Exploration**\nWorried about committing? Fella offers a six-month money-back guarantee, which underscores their confidence in the effectiveness of their program. If you dedicate yourself to the plan and don’t achieve your target within that period, you get your money back—no strings attached.\n\n**Next Steps and Accessibility**\nFella Health has simplified the onboarding process. Interested individuals can fill out a quick quiz to get started. From weight loss medications to testosterone rejuvenation treatments, they cater to various aspects of men's health.\n\nFor more information or to join Fella Health in their mission to redefine men’s health, visit their website at [Fella Health](https://www.fellahealth.com/).\n\n---\n\nIn summary, Fella Health is where science meets lifestyle changes. It's practical, straightforward, and offers the kind of personalized touch that busy men need. If you're looking for a way to tackle obesity without the hassle of traditional clinics, this is definitely a place to explore.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/3bd36cc52030b106ca8ab40fd18b4d97d118c911.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191328Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=cb27bc170e8899be2e6839c74c09d9386bf37af4026e0125631241c080155f61",
    "social_links": [
        "https://www.linkedin.com/company/fella-health/",
        "https://twitter.com/FellaHealth",
        "https://www.facebook.com/fellahealth",
        "https://www.crunchbase.com/organization/fella"
    ],
    "logo_path": "data/logos\\Fella_Health_logo.png"
}