{
    "links": "https://www.ycombinator.com/companies/female-invest",
    "name": "Female Invest",
    "headline": "Female Invest is a social e-learning app for finance and investing",
    "batch": "S21",
    "description": "Female Invest is on a mission to close the financial gender gap. By creating a safe space and a trusted source for knowledge, we’re democratising investing for everyone globally. \r\n\nWe’ve supported more than half a million women across 100 countries with our services. This makes us the world's largest univers combining financial learning and community. \r\n\nCurrently, we make $5.2 million in ARR from approx. 43.000 paying users. 92% of our users are on a yearly plan, and average churn is 2.4% in the last 3 months. Our unit economics are best in class and consistently improving .\r\n\nWe’ve raised approximately $12 million in seed funding from prominent investors across the EU and US and are soon ready to raise our Series A, where we are aiming to close an additional $10-15 million. The company operates within FinTech, EdTech and Investing. \r\n\nIn 2022, Female Invest did its first acquisition by acquiring the Danish investing platform, GAIA Technologies A/S. \r\n\nThe company’s headquarter is located in Copenhagen and has a smaller office in London.\r\n\nDownload our app to get the full experience.",
    "activity_status": "Active",
    "website": "https://www.femaleinvest.com/",
    "founded_date": 2019.0,
    "team_size": 35.0,
    "location": "Copenhagen, Denmark",
    "group_partner": "Gustaf Alstromer",
    "group_partner_yc": "https://www.ycombinator.com/people/gustaf-alstromer",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:elearning; industry:investing",
    "founders": [
        {
            "name": "Anna-Sophie Hartvigsen, Founder",
            "description": "I am a Co-Founder of Female Invest, Europe's leading financial educator targeting women.",
            "linkedin": "https://www.linkedin.com/in/anna-sophie-hartvigsen-46352611a/"
        },
        {
            "name": "Emma Bitz, Founder",
            "description": "I am a co-Founder of Female Invest - a social e-learning platform for investing.",
            "linkedin": "https://www.linkedin.com/in/emmabitz/?originalSubdomain=dk"
        },
        {
            "name": "Camilla Falkenberg, Founder",
            "description": "I am a co-Founder of Female Invest - a social e-learning platform for investing.",
            "linkedin": "https://www.linkedin.com/in/camilla-clo%C3%ABtta-falkenberg-69b78895/"
        }
    ],
    "status": true,
    "generated_description": "**Company Summary: Female Invest**\n\nFounded in 2019 and hailing from Copenhagen, Female Invest is on a mission to close the financial gender gap through a unique social e-learning app that empowers women across the globe with financial knowledge and investing skills. They’ve already impacted over 500,000 women in 100+ countries, positioning themselves as the largest global community-focused financial learning platform specifically designed for women.\n\n**Business Model and Growth Metrics**\n\nAs of now, Female Invest boasts an impressive annual recurring revenue (ARR) of $5.2 million from approximately 43,000 paying users. Notably, 92% of these users are subscribed to annual plans, demonstrating a strong value perception and loyalty—evidenced by a low average churn rate of just 2.4% over the past three months. Their unit economics are touted as best-in-class, continuously improving as they scale.\n\nHaving successfully raised around $12 million in seed funding from esteemed investors in both the EU and the US, they are gearing up to close an additional $10-15 million in Series A funding. This financial injection will aid their ongoing expansion into the intersection of FinTech, EdTech, and investing.\n\nIn a significant strategic move, Female Invest made its first acquisition in 2022 by purchasing the Danish investing platform GAIA Technologies A/S, further expanding its offerings and market reach.\n\n**Team and Headquarters**\n\nThe company has a dedicated team of 35 employees led by co-founders who foster an inclusive and educational atmosphere aimed specifically at female empowerment within the financial realm. \n\n**What They Offer**\n\nTheir app is a comprehensive platform that combines financial learning and community engagement. Members gain access to a rich pool of resources, including in-depth courses, articles, and weekly expert webinars covering topics from personal finance to sustainable investing. They emphasize a welcoming environment for anyone curious about finance—regardless of gender—reflecting a shared commitment to increasing financial literacy across demographics.\n\n**Conclusion**\n\nIn a world where financial literacy is key to empowerment, Female Invest stands out not just for its mission, but for its proven ability to engage and support women in their financial journeys. The combination of an engaged global community, sound business metrics, and strategic growth plans positions them well as a leader in democratizing finance for women worldwide. \n\nFor more details and to join the mission, check out their website: [Female Invest](https://www.femaleinvest.com/).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/80d08d6d13c7f48b9f11666afcf511771a480873.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191329Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=94423730873c8501a55cb012bd67c39a9e690079d6b8e4e1d62868e0858310a3",
    "social_links": [
        "https://www.linkedin.com/company/17986786/admin/",
        "https://twitter.com/femaleinvest?lang=da",
        "https://www.facebook.com/FemaleInvest",
        "https://www.crunchbase.com/organization/female-invest"
    ],
    "logo_path": "data/logos\\Female_Invest_logo.png"
}