{
    "links": "https://www.ycombinator.com/companies/fetii",
    "name": "Fetii",
    "headline": "Fetii transports groups and businesses together, on-demand",
    "batch": "S22",
    "description": "Fetii is a group rideshare app that lets both consumers and businesses order 15-passenger vans on-demand. Users pay using a QR check-in system that splits payments seamlessly amongst the group at time of boarding. \r\n\nNo longer are groups forced to reserve a charter vehicle weeks in advance, pay a 5 hour minimum for a 15 minute trip, and have no payment flexibility OR split up the group and utilize multiple vehicles...Fetii takes the friction out of group transportation.\r\n\nFetii has already transported over 800,000 passengers, removed over 140,000 unnecessary vehicles, and is operating in 7 cities.",
    "activity_status": "Active",
    "website": "https://www.fetii.com/",
    "founded_date": 2020.0,
    "team_size": 6.0,
    "location": "Austin, TX",
    "group_partner": "Brad Flora",
    "group_partner_yc": "https://www.ycombinator.com/people/brad-flora",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:transportation; location:austin",
    "founders": [
        {
            "name": "Matthew Iommi, Founder",
            "description": "Matthew Iommi is the Co-founder and CEO of Fetii, a fast growing rideshare platform that aims to decongest cities and provide a superior transportation experience. Fetii utilizes a network of 15-passenger vans to move groups and businesses together, removing unnecessary vehicles off of the road and reducing congestion. As of 2022, Fetii has transported over 617,000 passengers and completed over 49,000 trips. Matthew earned an Economics and Business degree from Texas A&M University.",
            "linkedin": "https://www.linkedin.com/in/matthew-iommi-100/"
        },
        {
            "name": "Justin Rath, Founder",
            "description": "Co-Founder & CTO at Fetii. I'm a technology entrepreneur currently focused on building a platform that aims to make group transportation accessible and easy for groups and businesses across the world.",
            "linkedin": "https://www.linkedin.com/in/justin-rath-91b1a8195/"
        }
    ],
    "status": true,
    "generated_description": "### Fetii: Transforming Group Transportation On-Demand\n\n**Overview**\nFetii is an innovative group rideshare solution founded in 2020 and proudly part of Y Combinator Batch S22. Based in Austin, TX, this nimble startup has developed a user-friendly app that allows both consumers and businesses to easily order 15-passenger vans on-demand. Their mission is clear: “Fetii transports groups and businesses together, on-demand.”\n\n**The Problem Fetii Solves**\nGone are the days of reserving charter vehicles weeks in advance or paying exorbitant fees for minimal travel. Fetii eliminates the traditional hassles of group transportation—like high costs and the need for multiple vehicles—by offering a seamless, on-demand service where users can check in via QR code and split payments effortlessly. This modern approach has already seen the company transport over 800,000 passengers while removing 140,000 unnecessary vehicles from the roads in just a few short years.\n\n**Operations and Features**\nOperating in seven cities, Fetii provides a wide range of services, including:\n- **University & Campus Shuttles**: Ideal for educational institutions.\n- **Corporate & Employee Shuttles**: A flexible, cost-effective solution for businesses.\n- **Healthcare Transport**: Specifically tailored for hospitals and healthcare workers.\n- **Airport Services**: Making travel to and from airports more convenient.\n- **On-Demand Rides**: Flexibility for any group needing a ride on short notice.\n\nFetii has designed its app to be straightforward. Users can select how many passengers they want to pay for right at the moment of boarding, thanks to their unique QR check-in system.\n\n**Join the Movement**\nIf you’re someone who enjoys driving, Fetii offers an opportunity to become a business owner without the upfront costs of purchasing a vehicle. Drivers use Fetii’s luxury vans while maximizing their earning potential through shared rides.\n\n**Sustainability and the Future**\nFetii is not just about moving people; it’s about moving smartly. Their model aims to integrate with city transit systems, promoting higher ridership and cutting down on traffic congestion and emissions. They are not just participating in the transportation space—they're helping to redefine it.\n\n**Conclusion**\nWith a focused mission and an innovative service model, Fetii stands out as a player reshaping the future of group transportation. Founded by a resourceful team of six and led by Brad Flora as their Group Partner, Fetii is not just another transportation app; it’s a game changer in how we think about getting from point A to B together.\n\nFor more information, visit their website: [Fetii](https://www.fetii.com).\n\n### Key Takeaways\n- **Founded**: 2020\n- **Team Size**: 6 employees\n- **Cities**: 7\n- **Passengers Transported**: 800,000+\n- **Mission**: On-demand group transportation, hassle-free.\n\nWith Fetii, group travel just got a lot simpler.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/f206cba45c3a7eb3ca18535ced6ca876e6532b99.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191330Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=883a84a9a3f9bd15a6bf3eae2bb500583ae7ff0b9333caf466d0ad5b30a7b2ad",
    "social_links": [
        "https://www.linkedin.com/company/fetii/",
        "https://mobile.twitter.com/fetiiride",
        "https://www.crunchbase.com/organization/fetii"
    ],
    "logo_path": "data/logos\\Fetii_logo.png"
}