{
    "links": "https://www.ycombinator.com/companies/ficra",
    "name": "Ficra",
    "headline": "Real time, source of truth for every product screen and user flow",
    "batch": "S24",
    "description": "Ficra enables product teams to ship higher quality releases, faster. \r\n\nFicra is the source of truth for every product screen and user flow, giving companies real-time visibility into what their users actually see in their live product. Ficra's AI provides a live, visual map of your users’ journeys: every screen, flow, A/B test, push notification and email. \r\n\nWith Ficra, product teams no longer waste 25% of their time auditing complex user flows to assess product quality and find the blind spots in funnels.",
    "activity_status": "Active",
    "website": "https://ficra.ai/",
    "founded_date": 2024.0,
    "team_size": 2.0,
    "location": "San Francisco",
    "group_partner": "Aaron Epstein",
    "group_partner_yc": "https://www.ycombinator.com/people/aaron-epstein",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:artificial-intelligence; industry:b2b; industry:workflow-automation; industry:productivity; industry:design-tools; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Omar El-Sadany, Founder",
            "description": "Co-Founder at Ficra; 3x founder; engineer.\n\nPreviously, Omar founded Sawa, a venture-backed platform increasing opportunity and transparency in Web3 and AI. An early Tech Lead at Voicea (acquired by Cisco), he developed core AI assistant features, like patented chat-based interaction and voice commands. Earlier, he was a software engineer at Apple, where he was recruited following the success of his mobile app, flagtag.\n\nHolds an MBA from Stanford; BS in Computer Science from Carnegie Mellon.",
            "linkedin": "https://linkedin.com/in/omar-el-sadany"
        },
        {
            "name": "Mohammed Abid, Founder",
            "description": "Co-founder Ficra; 3x founder; designer.\n\nPreviously, Mo served as CEO of Salams, where he scaled the app to millions of users, significantly increased ARR profitably, and sold the company to The Match Group. As Director of Product Design at Voicea (acquired by Cisco), Mo led the design of the first meeting-specfic AI assistant. Earlier, he was a founding member of Facebook's first Design Systems Team.\n\nHolds Master’s in HCI from Carnegie Mellon; BA in Economics from Stanford.",
            "linkedin": "https://www.linkedin.com/in/mohammed-abid-40777b16/"
        }
    ],
    "status": true,
    "generated_description": "Ficra is a San Francisco-based startup that's all about transforming product development through real-time insights. Its mission? To be the ultimate source of truth for every screen and user flow in your product. Founded in 2024 and backed by Y Combinator's Batch S24, Ficra is still a small team of just two but packs a considerable punch in the artificial intelligence space.\n\nAt its core, Ficra helps product teams ship higher quality releases, faster. Imagine having a live, visual map of your users' journeys—it covers every screen, flow, A/B test, push notification, and email interaction. This level of visibility eliminates the time wasted on audits, typically around 25% of a product team's efforts, and spots those sneaky blind spots in your funnels.\n\nFicra's cutting-edge AI tools essentially turn your product team into a \"10x\" operation—empowering them to do their jobs better and faster. Whether you're a product designer, manager, or support staff, Ficra provides clarity that helps everyone understand what users actually experience, thereby streamlining processes and ensuring compliance.\n\nThe pitch is simple: no more hours lost to product audits or endless code searches. Instead, you get a unified view of user interactions, enabling quicker iterations and better decision-making.\n\nAnd while Ficra may be a recent entry in the market, it's already resonating with professionals across various companies. Given its innovative approach to workflow automation and productivity, it's tagged with essentials like artificial intelligence, B2B, and design tools, making it a notable player in the SaaS landscape.\n\nTo find out more about what Ficra can do, you can check them out at [Ficra.ai](https://ficra.ai) and see how they can help your team achieve greater efficiency and clarity in product development.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/bc65994339ef096848b09c49648baeda58d0d89e.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191330Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=7001707ea10aebccbcb59431308f4378c4821b9b8c0b6fb30cf9620cc3d35acd",
    "social_links": [
        "https://www.linkedin.com/company/ficra-ai-yc-s24/",
        "https://x.com/ficra_ai"
    ],
    "logo_path": "data/logos\\Ficra_logo.png"
}