{
    "links": "https://www.ycombinator.com/companies/fidocure",
    "name": "FidoCureÂ®",
    "headline": "FidoCureÂ® is the leader in Precision Medicine for Canine Oncology.",
    "batch": "W18",
    "description": "Cancer is a genetic disease. We know this from decades of human and veterinary cancer research. Precision medicine and targeted therapies are successfully used to treat humans with cancer. At FidoCureÂ®, we bring this approach to the world of veterinary medicine. \r\n\nFidoCureÂ® empowers veterinarians to offer genetic sequencing and targeted therapies to treat dogs with cancer. We are committed to expanding the veterinary oncology toolbox for both diagnostics and therapeutics. \r\n\nOur veterinary partners have treated thousands of dogs over the past 30 years and work closely with the growing FidoCureÂ® network of over 143 clinics and 180 forward-thinking veterinary oncologists throughout the US.\r\n\nTogether, we can combat canine cancer!",
    "activity_status": "Active",
    "website": "https://www.fidocure.com/",
    "founded_date": null,
    "team_size": 14.0,
    "location": "Palo Alto",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:oncology; location:san-francisco-bay-area",
    "founders": [],
    "status": true,
    "generated_description": "FidoCure® is a pioneering company based in Palo Alto, California, driven by the mission to lead the charge in precision medicine for canine oncology. Launching from the core understanding that cancer is a genetic disease, FidoCure® applies the lessons learned from decades of research in human and veterinary cancer therapy to dogs, offering hope where traditional treatment options may fall short.\n\nThe company enables veterinarians to administer genetic sequencing and targeted therapies, creating an enhanced toolkit for diagnosing and treating canine cancer. This is particularly impactful as FidoCure® aligns with a reliable community of over 143 clinics and 180 innovative veterinary oncologists across the U.S., who have collectively treated thousands of dogs over the last three decades.\n\nFounded as part of Y Combinator’s Winter 2018 batch, FidoCure® exemplifies how technology can be harnessed to improve veterinary healthcare. With a small but dedicated team of 14 employees, the company's approach is bolstered by the largest proprietary cancer data set in the world, having collected and analyzed clinical-genomic data from thousands of dogs.\n\nA significant aspect of FidoCure®'s promise is its AI-driven methodology, which customizes cancer treatments based on genomic testing. Rather than relying solely on traditional chemotherapy and radiation, FidoCure® offers bespoke therapies that target the specific mutations affecting each dog. This tailored approach has resulted in success stories, with pets experiencing prolonged lives and better quality of life after receiving treatment.\n\nIn essence, FidoCure® not only fights canine cancer effectively but also serves as a bridge between veterinary and human oncology, sharing insights that could potentially benefit both. For more information or insights into what they do, you can visit their website at [www.fidocure.com](https://www.fidocure.com/). \n\nSo, if you’re in the veterinary field or a pet parent dealing with the tough reality of canine cancer, FidoCure® is worth a look. They’re not just treating dogs—they’re transforming how we think about and tackle cancer in our furry companions.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/a36968cb92326bf43433ee6c8cf95d63a3574cea.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191331Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=d6f495256b90e805657462c7191e16aa60986f619b642d81ced65e5dbef1517d",
    "social_links": [
        "https://www.linkedin.com/company/the-one-health-company/",
        "https://twitter.com/fidocure",
        "https://www.facebook.com/FidoCure/",
        "https://www.crunchbase.com/organization/the-one-health-company"
    ],
    "logo_path": "data/logos\\FidoCureÂ®_logo.png"
}