{
    "links": "https://www.ycombinator.com/companies/filadd",
    "name": "Filadd",
    "headline": "We help students in Latin America graduate from College.",
    "batch": "S21",
    "description": "With online courses, we help students graduate from University, starting from the admissions and throughout their entire college education until they graduate. All our courses include 24/7 interaction with our Tutors and Teachers making 95% of our users reach their desire score. We have prepared more than 10,000 students and in 2021 we have already made 800K which means 6X Year-over-Year growth.",
    "activity_status": "Active",
    "website": "https://courses.filadd.com/",
    "founded_date": 2018.0,
    "team_size": 60.0,
    "location": "Córdoba, Argentina",
    "group_partner": "Diana Hu",
    "group_partner_yc": "https://www.ycombinator.com/people/diana-hu",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:education; industry:elearning; industry:community",
    "founders": [
        {
            "name": "Joaquin olmedo, Founder",
            "description": "Industrial Engineer- CEO - I'm passionate about technology and people management. I don't really know why I founded Filadd, but helping young people through their process of becoming adults make me proud and is the fuel I need to make the company grow",
            "linkedin": "https://www.linkedin.com/in/joaquin-olmedo-9619b1100/"
        },
        {
            "name": "Guillermo Bruchmann Tanodi, Founder",
            "description": "Passionate for discovery and delivery of digital products. I have a full stack software developer background, which allows me to design digital products that are quick to implement while having in mind both the user and the business requirements.",
            "linkedin": "https://www.linkedin.com/in/guillermo-bruchmann-4a3b9713b/"
        },
        {
            "name": "Nicolás Ferrer, Founder",
            "description": "I graduated as an Industrial Engineer in 2018. I am passionate about Marketing and Statistics. I always try to find an explanation for everything, if I don't understand something, i can't go to sleep peacefully. I am currently in charge of leading the Growth of Filadd.",
            "linkedin": "https://www.linkedin.com/in/nicol%C3%A1s-ferrer-6b1527117/"
        },
        {
            "name": "Agustin Trombotto, Founder",
            "description": "I love Technologies. I always try to be up to date with the latest tech tends and good practices.\nI have double titulation in Bachelor of Applied Sciences and Computer Engineering.\nWhen I was in college, I wanted to use my learned skills to create a solution for students. From that moment, I started to build FIladd. Currently I am CTO of the company.",
            "linkedin": "https://www.linkedin.com/in/agustin-trombotto-a258b512a/"
        }
    ],
    "status": true,
    "generated_description": "**Filadd: Bridging Educational Dreams in Latin America**\n\nFounded in 2018 and part of the Y Combinator Batch S21, Filadd is on a mission: to empower students in Latin America to not just dream of graduating college but to achieve it. Based in Córdoba, Argentina, and employing a team of 60, Filadd has developed into a significant player in the online education landscape.\n\nWhat sets Filadd apart? They’ve combined a comprehensive online course offering with 24/7 access to tutors and teachers, resulting in a remarkable 95% user success rate in reaching their desired scores. Since its inception, the company has prepared over 10,000 students and reported an impressive revenue of $800k in 2021, showcasing a 6X year-over-year growth. Their commitment to education is not just about numbers; it's about unlocking opportunities for students across Chile, Brazil, Colombia, and Argentina.\n\nThe essence of Filadd's approach is straightforward: they're creating an environment where students can thrive. Each student is guided from the admission stage through to graduation, ensuring no one feels lost in the process. With Filadd, the dream of studying at the university of one's choice becomes a tangible reality.\n\nWhat’s next for Filadd? They’re expanding their reach, fostering community engagement, and continuously enhancing the educational experience they offer. With the backing of notable investors like Diana Hu, Filadd is poised to lead a revolution in e-learning across Latin America.\n\nFor more information or to explore courses, visit their [website](https://courses.filadd.com/). \n\nKeep an eye on Filadd; they're not just helping students graduate—they’re changing lives.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/f8bd7a71875adb6e5fca0ec898d4c53c6ec51ace.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191332Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=039e08aacc199919ff0b91e2179bf64359522348b137a20b4ec068061b880ece",
    "social_links": [
        "https://www.linkedin.com/company/filadd",
        "https://twitter.com/Filadd_web",
        "https://facebook.com/filaddco",
        "https://www.crunchbase.com/organization/filadd"
    ],
    "logo_path": "data/logos\\Filadd_logo.png"
}