{
    "links": "https://www.ycombinator.com/companies/fingo-africa",
    "name": "Fingo Africa",
    "headline": "A neobank for Africa's 500 million youth",
    "batch": "S21",
    "description": "Fingo is building a pan-African digital bank.\r\n\nToday, most Africans pay 5-15% fees to transfer money to friends, family, or businesses - with Fingo these fees will be 90% cheaper. \r\n\nIn 240 seconds, any young person will be able to access a full suite of financial services including personal, business, investment and savings accounts.",
    "activity_status": "Active",
    "website": "https://fingo.africa",
    "founded_date": 2020.0,
    "team_size": 8.0,
    "location": "Nairobi, Kenya",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:neobank",
    "founders": [
        {
            "name": "Kiiru Muhoya, Founder",
            "description": "Kiiru is the co-founder and CEO of Fingo Africa. Fingo is the first youth focused Pan-African Neo-Bank. Previously he was part of the team at Acorn Holdings, the largest private developer of real estate in East Africa, being the first Kenyan company to successfully list a bond on the London Stock Exchange. Kiiru is a Philosophy, Politics and Economics graduate from the University of Warwick.",
            "linkedin": "https://www.linkedin.com/in/kiiru-muhoya-251360131"
        },
        {
            "name": "Ian Njuguna, Founder",
            "description": "Experienced technology founder. Engineered for over a decade, Built outdoor advertising automation allowing advertisers to upload their ads to digital billboards and pay digitally from their devices, and multiple other systems. (Think Instagram ads but on outdoor advertising)\n\nNow Joining 3 others to build the largest Neobank for Africa at Fingo.",
            "linkedin": "https://www.linkedin.com/in/ian-n/"
        },
        {
            "name": "Gitari Tirima, Founder",
            "description": "Trying to bring banking to the African youth!\nJust a kid who loves interesting problems and creating viable solutions that will outlast me.",
            "linkedin": "https://www.linkedin.com/in/gitari-t/"
        },
        {
            "name": "James da Costa, Founder",
            "description": "Partner @ a16z focused on enterprise software.\nYC S21 - Cofounder/ COO of Fingo.",
            "linkedin": "https://www.linkedin.com/in/jamesdacosta"
        }
    ],
    "status": true,
    "generated_description": "Fingo Africa is a pan-African neobank launched in 2020, aiming to revolutionize banking for Africa's youth, particularly targeting the 500 million young people across the continent. Founded in Nairobi, Kenya, and part of Y Combinator's Batch S21, Fingo addresses a critical pain point: high money transfer fees that currently range from 5% to 15%. By introducing its platform, Fingo promises to make these transfers up to 90% cheaper.\n\nWith an easy onboarding process that allows users to access a full suite of financial services—including personal, business, investment, and savings accounts—in just about 240 seconds, Fingo is designed for efficiency and user-friendliness. The company's small but dedicated team of eight employees is focused on creating a dynamic banking experience that empowers users to manage their finances better.\n\nFingo's platform not only facilitates peer-to-peer transfers among users without transaction fees but also offers tools for budgeting, savings, and financial literacy through engaging trivia games. Users earn Fingo Coins with each transaction, encouraging responsible spending and providing opportunities for rewards.\n\nThe bank has features tailored for various financial needs. There are plans for both personal and corporate accounts, each equipped with specific tools for managing finances effectively. Notably, the Interest-Earning Savings account promises competitive annual rates of up to 15%, underscoring Fingo's commitment to enhancing savings for its community.\n\nIn collaboration with Ecobank, Fingo is regulated by the Central Bank of Kenya (CBK), elevating user trust and ensuring compliance with financial regulations. With ambitions to grow beyond 100,000 clients towards the goal of serving 100 million, Fingo is not just about banking; it is about building a community where young Africans can thrive financially.\n\nTo learn more about Fingo Africa, visit their website at [fingo.africa](https://fingo.africa).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/8b87d64f4d40bf820443fedfed100d4d5a80a0d3.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191334Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=60777fb34a41fcec4fa9b310810ca9a4ad90aeda22263841a6bf725fe431e4dc",
    "social_links": [],
    "logo_path": "data/logos\\Fingo_Africa_logo.png"
}