{
    "links": "https://www.ycombinator.com/companies/finnix",
    "name": "Finnix",
    "headline": "Financial technology solutions for Indonesian creative businesses",
    "batch": "W22",
    "description": "Finnix is a financial technology solutions provider for Indonesian creative businesses. We provide loans and financial management tools for event organizers, agencies, concert promoters, and others.",
    "activity_status": "Active",
    "website": "http://finnix.id",
    "founded_date": 2021.0,
    "team_size": 13.0,
    "location": "Jakarta, Indonesia",
    "group_partner": "Gustaf Alstromer",
    "group_partner_yc": "https://www.ycombinator.com/people/gustaf-alstromer",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:entertainment; industry:music; industry:creator-economy",
    "founders": [
        {
            "name": "Reinhart Hermanus, Founder",
            "description": "Ex software engineer turned into business and product management. Worked in the fintech industry since my early career.",
            "linkedin": "https://www.linkedin.com/in/reinhart-hermanus-6a149115/"
        },
        {
            "name": "Philip Moniaga, Founder",
            "description": "Philip was previously Senior Software Engineer at Bloomberg LP working on data infrastructure. Before that he was a software engineer at Booking.com building flights platform. Prior to that he worked as Senior Software Engineer in Carousell building ads platform - the largest c2c marketplace in Singapore and was a Software Engineer in GDP Venture.",
            "linkedin": "https://www.linkedin.com/in/philipmoniaga/"
        },
        {
            "name": "Sebastian Yaphy, Founder",
            "description": "Co-founder of Aigis. Previously leading the Insurance team in Alodokter and OVO, with various fintech product experience from lending to investment.\n\nLove great and practical designs. Always love exploring new things.",
            "linkedin": "https://www.linkedin.com/in/syaphy/"
        }
    ],
    "status": true,
    "generated_description": "**Finnix: Empowering Indonesian Creative Businesses with Financial Innovation**\n\nFounded in 2021 and part of Y Combinator's W22 batch, Finnix is on a mission to revolutionize the financial landscape for Indonesia's vibrant creative sector. Situated in Jakarta, the company leverages technology to provide tailored financial solutions designed specifically for event organizers, agencies, concert promoters, and other creative enterprises.\n\n**What does Finnix do?**\n\nAt its core, Finnix offers loans and financial management tools that help businesses streamline their operations. They specialize in preparing essential financial documents, ensuring that clients not only look good on paper but are also ready to seize funding opportunities. With over 100 projects under their belt, they act like a financial partner—think of them as your virtual CFO—giving clients the tools needed for effective project tracking, budgeting, and cash flow management.\n\n**Services and Solutions**\n\nFinnix provides services that range from financial support to event consultation and technology solutions. They focus on:\n\n1. **Financial Structuring**: Organizing financial documents to meet professional standards.\n2. **Simplifying Transactions**: Offering payment tools and connecting clients with financial resources.\n3. **Event Management**: Utilizing their technology and partnerships to help manage events seamlessly.\n\nThey also collaborate with Cicil, a licensed peer-to-peer lending platform, to offer customized, project-based loans, thus bridging the financial gap for creative projects.\n\n**Why Finnix?**\n\nFor businesses in the creative industry, especially those planning large-scale events, Finnix stands out because it combines financial expertise with a deep understanding of the creative world. They focus on security by verifying financial documents and conducting thorough risk assessments, ensuring safe and reliable transactions.\n\n**A Community of Creativity**\n\nWith a dedicated team of 13 and backed by industry partners like Gustaf Alstromer, Finnix is carving a niche in a market that thrives on innovation and creativity. By connecting businesses with trusted vendors and sponsors, Finnix aims to unlock new opportunities for growth and partnership.\n\nFor more information, check out their website: [Finnix](http://finnix.id).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/c25252d3d16734a0698a49f1c5cbec2f6e729e23.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191335Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=c39c6dbb13cea1a1de437d9575bf81a7b9a76da36cf33ffd2d490e48de10f5d6",
    "social_links": [
        "https://www.linkedin.com/company/finnix-id"
    ],
    "logo_path": "data/logos\\Finnix_logo.png"
}