{
    "links": "https://www.ycombinator.com/companies/flagright",
    "name": "Flagright",
    "headline": "AI-native AML compliance platform for fintechs & banks",
    "batch": "W22",
    "description": "Flagright helps fintechs & banks monitor, screen, investigate, and report their transactions & customers against financial crime risks with a best-in-class AML compliance software. Catering to a diverse clientele across various financial sectors, we serve customers across 6 continents. Flagright is a pioneer in the application of generative AI for AML compliance operations with its AI suite, Flagright AI, delivering unmatched scalability and extreme performance. Our products are designed to help our customers scale volume without scaling headcount and grow faster.",
    "activity_status": "Active",
    "website": "https://flagright.com",
    "founded_date": 2021.0,
    "team_size": 20.0,
    "location": "Singapore",
    "group_partner": "Tom Blomfield",
    "group_partner_yc": "https://www.ycombinator.com/people/tom-blomfield",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:artificial-intelligence; industry:fintech; industry:b2b; industry:compliance; industry:regtech",
    "founders": [
        {
            "name": "Baran Özkan, Founder",
            "description": "Baran is co-founder and CEO of Flagright. He defines the product strategy at Flagright for making compliance & fraud prevention infrastructure more accessible for fintechs and banks. He has previously worked in various domains including healthcare, marketing, e-commerce, logistics, and most recently fintech. Baran is a Certified Anti Money Laundering Specialist (CAMS).",
            "linkedin": "https://www.linkedin.com/in/baranozkan/"
        },
        {
            "name": "Madhu G Nadig, Founder",
            "description": "Madhu is co-founder and CTO of Flagright. He leads engineering and design, building the compliance & fraud prevention infrastructure for startups. He has previously worked in various domains including data analytics and integration for pharmaceuticals and social media marketing, core cloud computing infrastructure and real time systems for logistics & fintech.",
            "linkedin": "https://www.linkedin.com/in/madhugnadig/"
        }
    ],
    "status": true,
    "generated_description": "**Flagright: Revolutionizing AML Compliance with AI**\n\nFounded in 2021 and based in Singapore, Flagright is an innovative player in the financial technology (fintech) sector—specifically focusing on anti-money laundering (AML) compliance solutions for fintechs and banks. They burst onto the scene with ambitious goals and a solid backing from Y Combinator, having joined Batch W22.\n\n**Mission and Vision**\nFlagright’s mission is simple yet crucial: to provide an AI-native AML compliance platform tailored for fintech companies and banks. They help organizations not just monitor and screen transactions but also investigate and report potentially illicit activities, tackling the relentless threat of financial crime. The essence of their platform lies in leveraging generative AI, granting users unparalleled scalability while enabling them to enhance operations without proportionately increasing their workforce.\n\n**Core Offerings**\nFlagright markets itself through a suite of products designed to streamline compliance processes:\n- **Transaction Monitoring:** A high-performance solution that enables rapid API responses and customizable scenario building.\n- **Case Management:** Automated, efficient tools that simplify the investigation of suspicious activities.\n- **AI Forensics:** Specialized AI agents that specifically address compliance and fraud challenges.\n- **AML Screening:** An extensive screening process that checks individuals against various watchlists, tightening the noose on illicit transactions.\n- **Risk Scoring:** A dynamic engine that evaluates risk via customer and transaction profiles.\n\n**Industry Reach**\nFlagright has positioned itself as a pioneer across six continents, serving a diverse clientele that spans payment processors, neobanks, traditional banks, cryptocurrency platforms, and insurance companies. They've effectively redefined how compliance teams interact with risk, enabling small firms to compete with larger entities by streamlining their operations.\n\n**Operational Insights**\nWith a compact team of just 20 employees, Flagright has demonstrated that size doesn't equate to capability. They have managed to record impressive operational metrics, including an 80% decrease in false positives for clients. Their approach ensures firms can maintain compliance rigor while enjoying significant cost savings.\n\n**Backed for Success**\nUnder the guidance of seasoned experts like Group Partner Tom Blomfield and CEO Piew Yap, the company not only aims to streamline compliance but also intends to continuously evolve its offerings based on customer needs and regulatory changes.\n\nIn a world where compliance is growing increasingly complex, Flagright stands out as a robust, AI-driven solution that empowers financial institutions to combat financial crimes effectively while maximizing operational efficiency.\n\nFor more insights and to learn how Flagright can enhance your compliance strategy, visit [Flagright](https://flagright.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/3ba660b82a6401c5eb7679f89025579fbb3f8508.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191340Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=3f2dc2fcc37e13405992107a3fb0f72074f17635b5415fce63f7833bb5fbc9a3",
    "social_links": [
        "https://www.linkedin.com/company/flagright",
        "https://twitter.com/FlagrightHQ",
        "https://www.crunchbase.com/organization/flagright",
        "https://github.com/flagright"
    ],
    "logo_path": "data/logos\\Flagright_logo.png"
}