{
    "links": "https://www.ycombinator.com/companies/fleek",
    "name": "Fleek",
    "headline": "A B2B marketplace for wholesale second hand fashion",
    "batch": "W22",
    "description": "Fleek is a B2B Wholesale Marketplace for second-hand fashion. Our buyers are vintage stores and online resellers; our suppliers are used clothing wholesalers, rag-houses, and donation centres.",
    "activity_status": "Active",
    "website": "https://www.joinfleek.com/",
    "founded_date": 2021.0,
    "team_size": 3.0,
    "location": "San Francisco",
    "group_partner": "Brad Flora",
    "group_partner_yc": "https://www.ycombinator.com/people/brad-flora",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:marketplace; industry:b2b; industry:e-commerce; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Abhi Arora, Founder",
            "description": "Abhi has scaled startups in San Francisco, Berlin, and London. Most recently, he co-founded a video AI startup for media creators. Before that, he was an early employee at Dubsmash and led growth to 300M users (acquired by Reddit). Abhi has a BS from Berkeley and an MBA from Cambridge.",
            "linkedin": "https://www.linkedin.com/in/abhishekarora7/"
        },
        {
            "name": "Sanket Agarwal, Founder",
            "description": "Sanket is a seasoned tech enterpreneur who has been part of companies at all stages. Most recently he was leading 30 people Consumer and Marketing Eng & Product Org with 20M DAU and 5M/mo marketing spend.\n\nBefore that Sanket has experience working on ground up startups at Suki where he was a founding engineer building a audio streaming stack. He helped the company raise Seed and Series A and grew to $1M ARR before he left.",
            "linkedin": "https://www.linkedin.com/in/sanket-agarwal-32209641/"
        }
    ],
    "status": true,
    "generated_description": "**Company Overview: Fleek**\n\nFleek, founded in 2021 and part of Y Combinator's W22 batch, operates out of San Francisco with a tiny but mighty team of three. The company has positioned itself as a B2B marketplace that focuses on wholesale second-hand fashion, catering specifically to the needs of vintage stores and online resellers. Unlike traditional fashion platforms, Fleek connects buyers with used clothing wholesalers, rag-houses, and donation centers, creating a circular economy around fashion. \n\n### Mission and Focus\nFleek aims to transform the wholesale landscape of second-hand fashion by creating an efficient marketplace that makes it easier for retailers to discover and stock vintage gems. Their clientele includes vintage stores that thrive on unique, pre-loved clothing, and they provide a platform that simplifies purchasing from various suppliers. This approach not only supports sustainable fashion practices but also taps into the growing demand for unique, vintage styles.\n\n### Categories and Offering\nFleek's website showcases a diverse array of categories, including:\n- Men’s/Unisex\n- Women’s\n- Kid's\n- Outerwear\n- T-shirts\n- Sweatshirts\n- Denim and more!\n\nThey feature well-known brands like Nike, Ralph Lauren, Burberry, and Patagonia, making it easy for resellers to source popular items at competitive prices. Regular drops and curated selections ensure that retailers stay ahead of trends while maintaining stock of high-demand items.\n\n### Unique Selling Proposition\nWhat sets Fleek apart is not just its focus on second-hand fashion, but also its commitment to quality and authenticity. They leverage partnerships with reputable suppliers, ensuring that every piece meets the standards vintage retailers expect. Plus, the ability to chat and connect directly with suppliers facilitates real-time inventory management and personalized service—definitely a win for busy resellers.\n\n### Team and Culture\nLed by Brad Flora as Group Partner, Fleek operates on a small scale, which fosters a close-knit culture that prioritizes innovation and agility. In the fast-paced realm of fashion, this nimble structure allows them to adapt quickly to market changes and customer demands.\n\n### Conclusion\nFleek is a promising player in the second-hand fashion marketplace, fitting snugly into the growing trend of sustainable fashion. With its emphasis on providing a curated selection of vintage clothing, a direct line to suppliers, and a focus on community, Fleek is not just selling clothes—it's championing a movement towards a more conscious approach to fashion retail. \n\nFor more information, explore their offerings at [joinfleek.com](https://www.joinfleek.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/1d4b2cac8e1e76dbc65e4a6e5b94f927d1850e5a.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191340Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=3378e9ffc011e6c5ab7a918b44fd00abc992a116efd12885241a82a90d3f7696",
    "social_links": [
        "https://www.linkedin.com/company/joinfleek/"
    ],
    "logo_path": "data/logos\\Fleek_logo.png"
}