{
    "links": "https://www.ycombinator.com/companies/fleetzero",
    "name": "Fleetzero",
    "headline": "Battery-electric cargo ships.",
    "batch": "W22",
    "description": "Fleetzero is building battery-electric cargo ships that operate with 5X higher net margins than fossil fuel ships. Our battery technology is the only pathway to decarbonize the $1.3 trillion shipping industry without a green premium.",
    "activity_status": "Active",
    "website": "https://www.fleetzero.com",
    "founded_date": 2021.0,
    "team_size": 15.0,
    "location": "Houston, TX",
    "group_partner": "Gustaf Alstromer",
    "group_partner_yc": "https://www.ycombinator.com/people/gustaf-alstromer",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:climate",
    "founders": [
        {
            "name": "Steven Henderson, Founder",
            "description": "Steven is a marine engineer by background and has managed a wide range of businesses and operations in the marine environment including cargo ships, a hospital ship, and one of the largest offshore facilities in the US Gulf of Mexico. He has a bachelors of science in Marine Engineering Systems from the US Merchant Marine Academy and an MBA from Harvard Business School. Steven served in the US Navy Reserve as a Strategic Sealift Officer.",
            "linkedin": "http://www.linkedin.com/in/stevenhenderson"
        },
        {
            "name": "Mike Carter, Founder",
            "description": "Michael is a marine engineer and enterprise sales professional. He graduated from the US Merchant Marine Academy with a BS in Marine Engineering Systems and received an MBA from Rice. Michael brings expertise in marine engineering, ship operations, and significant business experience in energy and shipping. He is also proud to have served as an officer in the US Navy Reserve.",
            "linkedin": "https://www.linkedin.com/in/michael-carter-2684b575/"
        }
    ],
    "status": true,
    "generated_description": "### Fleetzero: Charting a Course for Zero-Emission Shipping\n\nFounded in 2021 and hailing from Houston, TX, Fleetzero is on a mission to revolutionize the shipping industry by building battery-electric cargo ships. Their innovative approach is notable: these ships operate with five times higher net margins compared to conventional fossil fuel vessels. Their battery technology is being touted as the key to decarbonizing the $1.3 trillion shipping sector—without imposing a green premium on operators.\n\nFleetzero is tackling a massive challenge with a smart solution. As companies like Amazon, Ikea, and Patagonia aim for zero-carbon shipping by 2040, Fleetzero’s technology is positioned to make that goal feasible. The company's flagship product, the Leviathan Energy Storage System (ESS), is said to be the world’s most advanced marine battery. It allows vessels to operate with zero emissions in port and during short sea operations. By hybridizing existing vessels with the Leviathan system, ship owners can reduce operational emissions dramatically, and the projects themselves often pay for some of their upfront costs through fuel and maintenance savings.\n\nWhat’s particularly compelling about Fleetzero's offering is the promise it holds: a single voyage on one of their ships can prevent as much CO2 emissions as planting 92,577 trees and allowing them to grow for a decade. This dramatic reduction in emissions is already attracting attention from both the media and investors, including significant players like Y Combinator, Founders Fund, and Breakthrough Energy Ventures.\n\nWith a dedicated team of 15 employees and backing from influential figures like Gustaf Alstromer, Fleetzero is part of Y Combinator's Batch W22—a sure sign that this disruptive startup is one to watch.\n\nAs we navigate a world increasingly concerned with climate change, Fleetzero is not just talking the talk. They are paving the way for a more sustainable future in ocean freight, balancing affordability with environmental responsibility. For more about their mission and products, check out their website at [Fleetzero](https://www.fleetzero.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/bcf4603be8dd4d2abccd0d361dd19dc1ddbb1680.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191341Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=f72a571d537de32b1118d4abe8c848e49e6f3bc5088695dee15f354e9b539b4e",
    "social_links": [
        "https://www.linkedin.com/company/fleetzero/"
    ],
    "logo_path": "data/logos\\Fleetzero_logo.png"
}