{
    "links": "https://www.ycombinator.com/companies/fleetworks",
    "name": "FleetWorks",
    "headline": "Automating the 2B phone calls and emails that keep freight moving",
    "batch": "S23",
    "description": "FleetWorks automates the 2B phone calls and emails that the freight industry makes every year. We use voice synthesis, generative AI, and integrations with logistics systems to solve the largest cost in this industry - people. \r\n\nWhen Uber Freight needs to ship a truckload of Coca-Cola going from Phoenix to Bentonville. They can use FleetWorks to call the driver to get an ETA, alert the receiver and shipper that the driver is running late, and reschedule the appointment - all with automated text messages, phone calls, and emails.",
    "activity_status": "Active",
    "website": "https://fleetworks.ai",
    "founded_date": 2023.0,
    "team_size": 8.0,
    "location": "San Francisco",
    "group_partner": "Michael Seibel",
    "group_partner_yc": "https://www.ycombinator.com/people/michael-seibel",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:artificial-intelligence; industry:logistics; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Paul Singer, Founder",
            "description": "Automating the manual parts of logistics management. Previously PM at Uber Freight where I led the tech teams managing carrier quality.",
            "linkedin": "https://linkedin.com/in/paul-singer"
        },
        {
            "name": "Quang Tran, Founder",
            "description": "Prior to FleetWorks, worked on moonshot projects at Airbnb.",
            "linkedin": "https://linkedin.com/in/quangtran20"
        }
    ],
    "status": true,
    "generated_description": "**FleetWorks: Automating the Future of Freight Management**\n\nFounded in 2023 and hailing from the bustling tech hub of San Francisco, **FleetWorks** is on a mission to revolutionize the freight industry by automating the myriad of phone calls and emails that traditionally bog down logistics operations. This startup, part of Y Combinator's Batch S23, deploys cutting-edge tools like voice synthesis and generative AI to tackle the industry's most pressing challenge: its reliance on human labor.\n\nAt its core, FleetWorks simplifies the complex communication involved in freight logistics. For instance, when Uber Freight needs to relocate a truckload of Coca-Cola from Phoenix to Bentonville, FleetWorks can seamlessly manage the entire communication process—from calling the driver for an ETA, notifying shippers and receivers of delays, to rescheduling appointments—all through automated messages and phone calls.\n\n**Meet the Team and Technology**\nWith a compact team of 8 skilled employees led by Group Partner Michael Seibel, FleetWorks utilizes a suite of AI-driven carrier representatives, affectionately named Felice and Fred. These digital advocates allow logistics teams to focus on building relationships and negotiating effectively, while routine tasks are efficiently handled behind the scenes.\n\n**Impressive Metrics and Trusted Partnerships**\nFleetWorks not only promises time and cost savings—averaging 4 hours saved per day per carrier representative and 80% less cost compared to traditional methods—but also delivers exceptional performance with a remarkable 100% response rate on calls answered on the first ring. \n\nThe startup is already gaining traction with top brokers in the industry, showcasing its ability to integrate with various logistics systems. FleetWorks partners with notable names like Ryder and Worldwide Logistics, further cementing its reputation in the market.\n\n**Innovating for the Future**\nFleetWorks is not just about automating calls and emails; it’s reshaping how brokerages operate. They offer a demo to potential clients, promising a quick response time—10 minutes or less, even without AI. This commitment reflects their intent to be at the forefront of logistical innovation.\n\nFor anyone looking to streamline their logistics processes and embrace the benefits of automation, you can check out more at [FleetWorks' website](https://fleetworks.ai). They’re paving the way for a smarter, more efficient freight industry—one call at a time.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/1f6e3ff0994027a9fd7c2c0f9b9baf0836edac37.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191340Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=01c5721d12a5aed32cae56369e90f151098c4848d7b97cfeedacfb085cc07974",
    "social_links": [
        "https://www.linkedin.com/company/94275825/"
    ],
    "logo_path": "data/logos\\FleetWorks_logo.png"
}