{
    "links": "https://www.ycombinator.com/companies/flextock",
    "name": "Flextock",
    "headline": "Tech-enabled fulfillment provider in the Middle East & Africa",
    "batch": "W21",
    "description": "Flextock is a tech-enabled fulfillment provider in the Middle East & Africa. For local merchants, we warehouse the stock and deliver orders directly to their customers through our network of last mile delivery partners.",
    "activity_status": "Active",
    "website": "http://www.flextock.com",
    "founded_date": 2020.0,
    "team_size": 10.0,
    "location": "Cairo, Egypt",
    "group_partner": "Michael Seibel",
    "group_partner_yc": "https://www.ycombinator.com/people/michael-seibel",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:logistics; industry:supply-chain",
    "founders": [
        {
            "name": "Mohamed Mossaad, Founder",
            "description": "Mohamed is the co-founder and CEO of Flextock. He has an experience combining building and scaling tech startups in the Middle East with corporate management consulting from his time at Bain & Company. He studied business at Stanford GSB and has an Engineering degree from AUC.",
            "linkedin": "https://www.linkedin.com/in/mohamed-mossaad-50903438/"
        },
        {
            "name": "Enas Siam, Founder",
            "description": "I have 10 years experience working across large multinational companies and start-ups in the areas of commercial, operations and general management. I'm passionate about solving complex problems and making an impact in my community.",
            "linkedin": "https://www.linkedin.com/in/enas-siam-18150115/"
        }
    ],
    "status": true,
    "generated_description": "**Flextock: Revolutionizing Fulfillment in the MENA Region**\n\nFounded in 2020 and part of Y Combinator's W21 batch, Flextock has quickly become a significant player in the logistics and supply-chain landscape of the Middle East and Africa. Nestled in Cairo, Egypt, this small but mighty team of 10 is on a mission to streamline and elevate the logistics operations for local merchants.\n\n**What They Do**\n\nFlextock offers a tech-driven fulfillment service that allows businesses to warehouse inventory and efficiently deliver orders straight to their customers. They partner with last-mile delivery services, ensuring that items reach consumers swiftly and reliably. Think of them as the backbone for retailers looking to scale operations without the headache of managing logistics on their own.\n\nIn just a short span, Flextock has rolled out several notable services:\n- **End-to-End Fulfillment**: They handle the entire process, from inventory management to delivery, so businesses can focus more on growth.\n- **Delivery Aggregation**: By consolidating shipments, they cut costs and improve delivery efficiency.\n- **Cross-Border E-commerce Solutions**: They've made it easier for businesses to tap into international markets.\n- **Sales Growth Opportunities**: Helping businesses expand their reach through various online platforms.\n\n**The Impact**\n\nFlextock claims to drive growth for its partners, stating that many experience a 2-3x increase in sales within such a short time frame as 12 months of using their services. Moreover, clients often see up to a 15% reduction in operational costs. With a focus on speed and accuracy—boasting over 99% on-time deliveries—Flextock is positioned to transform how commerce operates in this vibrant region.\n\n**Future Forward**\n\nWith Michael Seibel as their Group Partner, Flextock is poised for continued growth and innovation. The company is not just resting on its laurels but is also looking to diversify its offerings with upcoming fintech solutions.\n\nIf you're a local merchant looking to streamline operations and enhance customer satisfaction, Flextock might just be the partner you need. Their promise? To empower businesses by turning logistical challenges into seamless operations. Want to learn more? Check out their website at [Flextock.com](http://www.flextock.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/230d5b3b1588f2ba2cc93b4eb85064da566c6d8e.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191341Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=3c594401489de9fb1ab562af63534c8df6f2ff8375acfd99c4bbbbcdc9e99491",
    "social_links": [
        "https://www.linkedin.com/company/flextock/"
    ],
    "logo_path": "data/logos\\Flextock_logo.png"
}