{
    "links": "https://www.ycombinator.com/companies/flexport",
    "name": "Flexport",
    "headline": "Platform for global logistics.",
    "batch": "W14",
    "description": "Founded in 2013, we believe trade can move the human race forward. That’s why our mission at Flexport is to make global trade easy for everyone.\r\n\nWhat the internet has done for bits and bytes, Flexport is doing for physical goods: giving every business the ability to connect to any customer, wherever they are in the world. That sounds pretty straightforward, but a fragmented and inefficient global supply chain has held the world back from untapped growth and innovation. By connecting everyone in the global economy we can unlock commerce, creativity, and human progress.\r\n\nTo do so, we’re building the platform for global logistics—empowering buyers, sellers and their logistics partners with the technology and services they need to grow and innovate. \r\nToday, we work with more than 40,000 customers and their suppliers across industries like manufacturing, retail, electronics, consumer goods, tech, apparel, and beauty. Companies of all sizes—from emerging brands to Fortune 500s—used Flexport technology to move nearly $19B of merchandise across 112 countries in 2021.\r\n\nInterested in joining our team? Check out our open job postings on careers site and apply directly today! https://www.flexport.com/careers/jobs/",
    "activity_status": "Active",
    "website": "https://www.flexport.com/careers/jobs/",
    "founded_date": 2013.0,
    "team_size": 3000.0,
    "location": "San Francisco",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:saas; industry:logistics; industry:supply-chain; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Ryan Petersen, Founder/CEO",
            "description": "Founder of Flexport",
            "linkedin": "https://www.linkedin.com/in/rpetersen"
        }
    ],
    "status": true,
    "generated_description": "**Flexport: Unlocking Global Trade**\n\nFounded in 2013 and based in San Francisco, Flexport aims to streamline international logistics, turning trade into a seamless experience. Imagine transforming the fragmented, often chaotic state of global supply chains into something as simple and accessible as browsing a website. That’s what Flexport is doing.\n\nWhen you think of Flexport, think of it as the equivalent of the internet for physical goods. Just like the internet democratized information, Flexport’s platform is opening up global markets for businesses of all sizes. Whether you’re an emerging brand or a Fortune 500 company, if you want to get your products to customers around the world, Flexport has the tools to help you do it efficiently.\n\n**The Mission**: Flexport believes that trade can be the driving force for human progress. Their mission is to make global trade easy for everyone, enabling buyers, sellers, and logistics partners to connect and thrive.\n\n**Impact**: In 2021 alone, Flexport facilitated the movement of nearly $19 billion worth of merchandise across 112 countries, serving over 40,000 customers in diverse sectors such as manufacturing, retail, electronics, and consumer goods.\n\n**What They Do**: Flexport’s platform encompasses a full suite of logistics solutions:\n- **Forwarding**: Simplifying ocean, trucking, and air freight operations.\n- **Fulfillment**: Accelerating eCommerce through streamlined warehousing and shipping solutions.\n- **Control Tower**: Offering tools for order and booking management.\n- **Customs & Financial Services**: Covering customs brokerage, insurance, trade finance, and advisory services.\n\nWith a dedicated team of around 3,000 employees, Flexport is positioned to lead the logistics tech space, drawing on insights to navigate the impacts of tariffs, trade politics, and environmental considerations.\n\n**Join the Movement**: If you’re interested in shaping the future of global trade, Flexport is actively hiring. Check out their open roles [here](https://www.flexport.com/careers/jobs/)!\n\nFlexport isn’t just about logistics; it’s about empowering businesses to innovate and engage in a truly global economy. And in a world where traditional means often fall short, this tech-driven approach is essential for unlocking new avenues of growth and creativity.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/af84247ec86ff6bd7e0df735b79dbaf156df6d12.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191341Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=7d255eba91bf754bcbe20e86a22ce14051c625201a3c01bcb7bf94162cb0553a",
    "social_links": [
        "https://www.linkedin.com/company/flexport/",
        "https://twitter.com/flexport",
        "https://www.crunchbase.com/organization/flexport",
        "https://github.com/flexport"
    ],
    "logo_path": "data/logos\\Flexport_logo.png"
}