{
    "links": "https://www.ycombinator.com/companies/flexdesk",
    "name": "FlexDesk",
    "headline": "One platform for corporate occupiers to manage their office portfolios",
    "batch": "W23",
    "description": "FlexDesk is the modern platform for corporate real estate departments. Combining lease administration with utilization intelligence, financial management, and a coworking booking platform, FlexDesk’s all-in-one solution is designed to help occupiers maximize the ROI of their real estate portfolio. Leading public and private corporations like Confluent, Hopper, ezCater, Blink Health, Paystand, and Bluecrest use FlexDesk to streamline their portfolio management processes while delighting their business users.",
    "activity_status": "Active",
    "website": "https://www.flexdesk.com/",
    "founded_date": 2022.0,
    "team_size": 8.0,
    "location": "New York",
    "group_partner": "Dalton Caldwell",
    "group_partner_yc": "https://www.ycombinator.com/people/dalton-caldwell",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:real-estate; industry:b2b; industry:hr-tech; industry:proptech; location:new-york",
    "founders": [
        {
            "name": "Clark Jacobs, Founder",
            "description": "Co-Founder/CEO @ FlexDesk. Passionate about the future workplace experience. Previously an early employee at a Proptech startup. Started my career as a management consultant at Bain & Company.",
            "linkedin": "https://www.linkedin.com/in/clark-jacobs-19a86665/"
        },
        {
            "name": "Dhanvi Reddy, Founder",
            "description": "Dhanvi is the co-founder of FlexDesk. He leads the technology efforts there, bringing over 13 years of software engineering experience in healthcare and adtech to the real-estate industry.",
            "linkedin": "https://www.linkedin.com/in/dhanvi/"
        }
    ],
    "status": true,
    "generated_description": "**FlexDesk: Redefining Corporate Office Management**\n\nFounded in 2022 and boasting an enthusiastic team of eight, FlexDesk is spearheading a revolution in corporate real estate management. Based in New York and proudly part of Y Combinator's Batch W23, FlexDesk’s mission is clear: provide a singular, streamlined platform for corporate occupiers to effectively manage their office portfolios.\n\n### The FlexDesk Approach\n\nAt its core, FlexDesk combines multiple facets of office management into one cohesive tool. The platform integrates lease administration, utilization intelligence, financial management, and coworking space booking, ensuring that businesses can maximize their real estate ROI without the hassle of juggling different systems.\n\nProminent corporations like Confluent, Hopper, ezCater, Blink Health, Paystand, and Bluecrest have adopted FlexDesk, benefiting from streamlined portfolio management processes that have redefined their approach to workspace utilization.\n\n### Key Product Offerings\n\n1. **Portfolio Management**: Centralize lease tracking, achieve accounting compliance, and unlock critical portfolio insights to inform better decision-making.\n2. **Coworking Bookings Management**: Provide on-demand booking access to over 7,000 coworking locations worldwide, making flexible workspace truly accessible for teams.\n3. **Utilization Intelligence**: Sync attendance data to gain insights into occupancy trends, enabling smarter space allocation and utilization.\n\n### Feedback from Users\n\nFlexDesk has received positive accolades from its users. Catherine Sabourin, Manager of Office and People Programs at Hopper, noted, \"FlexDesk is the opposite of a one-size-fits-all vendor. They truly sought to understand our challenges.\" Nikki Ellis from ezCater remarked, “I have spent very little time managing our company’s coworking program. I simply point employees to FlexDesk.”\n\n### Robust Integration and Security\n\nFlexDesk stands out as an API-based, AI-native platform tailored exclusively for corporate real estate management. Its architecture allows seamless integration with existing tools while offering the ability to function autonomously. Additionally, FlexDesk emphasizes security with features like Single Sign-On, SOC2 compliance, and geo-role-based access.\n\n### Conclusion\n\nFlexDesk is at the forefront of corporate real estate innovation. With its all-in-one platform, it simplifies the complexities of office management, enhances user experience, and ultimately positions its clients to turn their real estate into a competitive advantage. If your corporation is stepping into a new era of office management, you might want to check out [FlexDesk](https://www.flexdesk.com/) and schedule a demo to see firsthand how it can transform your workspace strategy.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/2ea94bd54a5a1bb0e5d21affd7cc17f2c7b42c7d.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191341Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=267004ab867b0f9e93dd19ad35a9e29f456b08c04c2ffc1cdb0a19f249e28616",
    "social_links": [
        "https://www.linkedin.com/company/flexdesk-workspace/",
        "https://www.crunchbase.com/organization/flexdesk"
    ],
    "logo_path": "data/logos\\FlexDesk_logo.png"
}