{
    "links": "https://www.ycombinator.com/companies/flirtey",
    "name": "Flirtey (SkyDrop)",
    "headline": "Flirtey is the worldâ\u0080\u0099s first commercial drone delivery service andâ\u0080¦",
    "batch": "S15",
    "description": "Flirtey is the leading drone delivery service. We are reinventing the on-demand economy with our network of flying robots for last mile delivery. Our mission is to save lives and change lifestyles by making delivery instant.\r\n\nFlirteyâ\u0080\u0099s drone delivery service is faster, more efficient and the ultimate customer experience. Weâ\u0080\u0099re rapidly growing our team and achieving a record number of historic firsts in the drone delivery industry, advancing autonomy, safety systems and advanced delivery technology.\r\n\nIf you are interested in having your goods delivered via Flirtey, or joining the team that is transforming the delivery industry, visit www.flirtey.com \r\n\nRecent Company Milestones:\r\n- October 2017 â\u0080\u0093 Announced a partnership to launch the first automated external defibrillator (AED) drone delivery service in the U.S.\r\n- January 2017 â\u0080\u0093 Raised $16 million in Series A funding from top Silicon Valley investors.\r\n- August 2016 â\u0080\u0093 Launched the worldâ\u0080\u0099s first commercial pizza-by-drone delivery model in partnership with Dominoâ\u0080\u0099s.\r\n- July 2016 â\u0080\u0093 Conducted the first fully autonomous, FAA-approved drone delivery from a store to a home in partnership with 7-Eleven. \r\n- June 2016 â\u0080\u0093 Completed the first fully autonomous, FAA-approved ship-to-shore drone delivery in collaboration with Johns Hopkins. \r\n- April 2016 â\u0080\u0093 The Flirtey drone used to make the first FAA-approved delivery in the U.S. accepted into the Smithsonianâ\u0080\u0099s National Air and Space Museum, alongside the Space Shuttle Discovery and the Wright Flyer. \r\n- March 2016 â\u0080\u0093 Conducted the first fully autonomous, FAA-approved urban drone delivery in the U.S. \r\n- July 2015 â\u0080\u0093 Completed the first FAA-approved drone delivery on U.S. soil in collaboration with NASA Langley Research Center.\r\n- Summer 2015 â\u0080\u0093 Graduated Y Combinator.\r\n- 2013 â\u0080\u0093 Founded the first drone delivery service in the world.",
    "activity_status": "Active",
    "website": "https://www.flirtey.com/",
    "founded_date": null,
    "team_size": 11.0,
    "location": "Reno, NV",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:drones; industry:delivery",
    "founders": [],
    "status": true,
    "generated_description": "Flirtey, now branded as SkyDrop, is pioneering the world of drone delivery as the first commercial service of its kind. Founded in 2013 and part of Y Combinator's Summer 2015 batch, Flirtey is headquartered in Reno, NV and operates with a team of 11 innovators. Their mission is straightforward yet ambitious: to transform the on-demand economy using autonomous flying robots to streamline last-mile delivery. They aspire not just to deliver goods but to save lives and enhance lifestyles by making deliveries instantaneous.\n\nThe company's journey has been marked by a series of noteworthy milestones that underscore its leadership in the drone delivery industry. Here are a few highlights:\n\n- **April 2016**: Flirtey's drone made the first FAA-approved delivery in the U.S., earning a spot in the Smithsonian’s National Air and Space Museum.\n- **July 2015**: They achieved the first FAA-approved drone delivery on U.S. soil in collaboration with NASA.\n- **August 2016**: A partnership with Domino’s saw the launch of the first commercial pizza delivery by drone.\n- **October 2017**: They announced a groundbreaking partnership to deploy the first automated external defibrillator (AED) delivery service via drone in the U.S.\n\nWith continued advancements in autonomy, safety systems, and delivery technology, Flirtey is not just keeping up but is setting new industry standards. They emphasize speed, efficiency, and an exceptional customer experience, making it clear that the future of delivery is airborne.\n\nFor those intrigued by the potential of drone technology or keen to join the team at Flirtey, more information is available at [Flirtey’s website](https://www.flirtey.com).\n\nFlirtey's story isn't just about tech; it's about vision—redefining how we think about deliveries, and in doing so, influencing the very fabric of our daily lives.",
    "logo": "/logos/medium/missing.png",
    "social_links": [
        "https://twitter.com/Fly_Flirtey",
        "https://www.crunchbase.com/organization/flirtey"
    ]
}