{
    "links": "https://www.ycombinator.com/companies/floatpays-inc",
    "name": "Floatpays Inc",
    "headline": "On-demand wage access service built for the African market",
    "batch": "S21",
    "description": "Floatpays is an on-demand wage access platform that helps employees access, spend, save and manage their money.\r\n\nThe problem we are solving is that more than 75% of the 12 million employed South African’s run out of money before the end of the month, 52% of those end up borrowing money to survive. Informal lending is the only option for most borrowers, with interest rates anywhere between 30-50%. The story is the same in most African countries where payday/micro-lending has become the norm amongst lower-income earners.\r\n\nOur app features include financial education, a budget planning tool, cash access, and voucher purchases all from wages earned but unpaid. We are currently working on a savings product to promote long-term financial resilience.\r\n\nWe launched our product in South Africa in July 2020 and plan to extend our reach into additional African countries in 2022 and beyond.",
    "activity_status": "Active",
    "website": "https://www.floatpays.com",
    "founded_date": 2019.0,
    "team_size": 15.0,
    "location": "Cape Town, South Africa",
    "group_partner": "Aaron Epstein",
    "group_partner_yc": "https://www.ycombinator.com/people/aaron-epstein",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:saas",
    "founders": [
        {
            "name": "Simon Ward, Founder",
            "description": "I am a passionate technologist and product builder. I get my energy from building products that disrupt existing markets and make a positive impact on how we live our lives.\n\nMy experience includes 25 years as an entrepreneur and business leader in the fintech and eCommerce business verticals. I have worked globally and been fortunate enough to be part of a few business exits along the way. Brands include Play.com, Rakuten, Moonpig.com, Photobox.com, Prodigy Finance and most recently Floatpays.",
            "linkedin": "https://www.linkedin.com/in/wardsimon/"
        }
    ],
    "status": true,
    "generated_description": "### Floatpays Inc: Revolutionizing Wage Access in Africa\n\n**Company Overview:**\nFounded in 2019 and part of Y Combinator Batch S21, Floatpays Inc is on a mission to tackle financial instability in the African workforce by providing on-demand wage access. Headquartered in Cape Town, South Africa, the company has grown to a team of 15 dedicated employees.\n\n**The Problem:**\nIn South Africa, over 75% of the 12 million employed individuals are running out of money before the month ends, with a staggering 52% resorting to borrowing to make ends meet. Too often, they turn to informal lending, which can charge oppressive interest rates between 30% and 50%. It’s a dire situation replicated across many African nations, making the need for a sustainable solution urgent.\n\n**The Floatpays Solution:**\nFloatpays provides a platform that gives employees the ability to access their earned wages before payday. This truly innovative approach helps users manage their finances more effectively, enabling them to spend, save, and invest more wisely. The app isn’t just about access to cash; it also integrates financial education, budget planning tools, cash access, and even offers vouchers—all aimed at promoting long-term financial resilience. Notably, a savings product is slated for release, further cementing its commitment to improving users' financial futures.\n\n**Launched in South Africa in July 2020**, Floatpays aims to expand its services across more African nations starting in 2022. This will help provide much-needed wage access solutions to even more workers grappling with financial instability.\n\n**Product Features:**\nFloatpays offers a suite of services designed to foster financial wellness among employees. These include:\n- **Earned Wage Access:** Immediate access to wages earned but unpaid.\n- **Automated Savings:** Tools that encourage savings without stress.\n- **Pension-backed Home Loans:** Help employees finance their dream homes responsibly.\n- **Financial Wellness Tools:** Resources designed to enhance financial literacy.\n- **Employee Rewards and Communication Platform:** Enhancing engagement via recognition and effective communication.\n\n**Impact Metrics:**\nFloatpays is already making waves:\n- 84% of users report ease in financial planning.\n- 77% find saving simpler post-usage.\n- 36% have reduced reliance on loans, while 23% use less credit overall.\n- A remarkable 96% of users feel a sense of control over their finances, with 77% experiencing reduced stress.\n\n**Why Floatpays?**\nFloatpays delivers these impactful services without imposing fees or costs on employers—truly a win-win proposition. Their integration is seamless, allowing HR teams to focus on what matters most—caring for their employees—while all financial benefits are managed in one place.\n\n**In Summary:**\nAs a fintech company focusing on the African market's unique needs, Floatpays stands out by addressing a critical financial challenge head-on. By empowering employees to take control of their financial health, Floatpays is not just making a product; they’re creating a movement towards financial literacy and stability across Africa. \n\nFor more insights, visit [Floatpays](https://www.floatpays.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/b1cd26fccbbb9905b2ae71fac45f73a501006b31.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191343Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=f328f3e2cabb69b6b96bbf0e35e3c3892650441236c8b57c23b2b181b5ca6e76",
    "social_links": [
        "https://www.linkedin.com/company/floatpays",
        "https://twitter.com/Floatpays",
        "https://www.facebook.com/floatpays/",
        "https://github.com/floatpays"
    ],
    "logo_path": "data/logos\\Floatpays_Inc_logo.png"
}