{
    "links": "https://www.ycombinator.com/companies/float-health",
    "name": "Float Health",
    "headline": "the marketplace for Specialty Pharma",
    "batch": "W22",
    "description": "Float brings a nurse to your home when you’re sick. If you have a chronic illness, instead of making you come to an overcrowded hospital full of sick people, we bring the best of the hospital to you.",
    "activity_status": "Active",
    "website": "http://float.health",
    "founded_date": 2021.0,
    "team_size": 3.0,
    "location": "Carlsbad, CA",
    "group_partner": "Michael Seibel",
    "group_partner_yc": "https://www.ycombinator.com/people/michael-seibel",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:health-tech",
    "founders": [
        {
            "name": "Ryan Johnson, Founder",
            "description": "ER Nurse with 20y in healthcare at bedside and in leadership.\nCo-founded coffee roasting company with online sales and delivery.\nI can also ride bikes.",
            "linkedin": "http://linkedin.com/in/ryan-johnson-2a189221b"
        },
        {
            "name": "Christy Johnson, Founder",
            "description": "Natural salesperson that establishes credibility and develops lasting relationships with customers.\nFounded an events management business and co-founded a marketing subscription platform.\nCan also jazzercise.",
            "linkedin": "https://www.linkedin.com/in/christysnowiejohnson/"
        }
    ],
    "status": true,
    "generated_description": "Float Health, founded in 2021 in Carlsbad, CA, is a standout player in the health-tech landscape, particularly noted for connecting specialty pharmacies with on-demand home infusion nursing services. As a part of Y Combinator's W22 batch, they've taken an innovative approach to healthcare by bridging the gap between hospital-level care and the convenience of home treatment.\n\nThe company's initial service, known simply as Float, aimed to revolutionize how patients cope with chronic illnesses. Instead of hauling patients to sometimes crowded hospitals, Float brings qualified nurses to their homes, providing the necessary medical care right where they are most comfortable. This commitment to home care is not just about convenience; it's about enhancing patient experience and outcomes.\n\nFloat Health’s unique model is structured around specialty pharmacies. They manage to secure top-notch nursing staff quickly, typically staffing within minutes instead of the days or weeks it might take through traditional agencies. This agility has resulted in impressive metrics: they have conducted over 35,000 home visits and boast a medication completion rate 180% higher than typical home infusion patients, coupled with a staggering staffing success rate of 98-100%.\n\nIn terms of financial efficiency, Float Health is equally compelling — their tech-driven solutions reduce administrative burdens for pharmacies and streamline reimbursement processes. This results in cost savings compared to managing in-house nursing teams or relying on external agencies.\n\nWith a small, dedicated team of three, and notable backing from Michael Seibel as a group partner, Float Health is making a mark as a trusted partner for pharmacies, healthcare payers, and prescribers alike. They promise reliable, high-quality care without the waste — both in terms of resources and time.\n\nIf you're interested in exploring how Float Health can enhance your pharmacy services or bring expert care to your patients’ homes, you might want to check out their services on their website: [Float Health](http://float.health). As they continue to grow and get the word out, Float Health is positioning itself as a leader in the home healthcare digital space, and it’s worth keeping an eye on their journey.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/2411ca1a9ad78d655d372774d9b693fdf872d251.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191342Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=685138f8b886284c709b277e455afff3439ac1d67795c6763d70596dcff7f5f6",
    "social_links": [
        "https://www.linkedin.com/company/float-health-inc/",
        "https://twitter.com/float_health",
        "https://www.facebook.com/Float-Health-107599855062976"
    ],
    "logo_path": "data/logos\\Float_Health_logo.png"
}