{
    "links": "https://www.ycombinator.com/companies/flock-safety",
    "name": "Flock Safety",
    "headline": "The first public safety operating system that eliminates crime.",
    "batch": "S17",
    "description": "Flock Safety provides the first public safety operating system that empowers private communities and law enforcement to work together to eliminate crime. We are committed to protecting human privacy and mitigating bias in policing with the development of best-in-class technology rooted in ethical design, which unites civilians and public servants in pursuit of a safer, more equitable society. \r\n\nOur Safety-as-a-Service approach includes affordable devices powered by LTE and solar that can be installed anywhere.  Our technology detects and captures objective details, decodes evidence in real-time and delivers investigative leads into the hands of those who matter. \r\n\nWhile safety is a serious business, we are a supportive team that is optimizing the remote experience to create strong and fun relationships even when we are physically apart. Our flock of hard-working employees thrive in a positive and inclusive environment, where a bias towards action is rewarded. Flock Safety is headquartered in Atlanta and operates nationwide. We have raised $150M in our Series E led by Tiger Global at a $3.5B valuation.",
    "activity_status": "Active",
    "website": "http://www.flocksafety.com",
    "founded_date": 2017.0,
    "team_size": 1000.0,
    "location": "Atlanta, GA",
    "group_partner": "Garry Tan",
    "group_partner_yc": "https://www.ycombinator.com/people/garry-tan",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:hardware; industry:machine-learning; industry:saas",
    "founders": [
        {
            "name": "Matt Feury, Founder/CTO",
            "description": "I spit rhymes in n log(n) time.",
            "linkedin": "https://www.linkedin.com/in/matt-feury-a105a339/"
        },
        {
            "name": "Garrett Langley, Founder/CEO",
            "description": null,
            "linkedin": "https://www.linkedin.com/in/glangley/"
        }
    ],
    "status": true,
    "generated_description": "Flock Safety is setting a new standard in public safety with a mission that's both ambitious and compelling: to create the first public safety operating system that aims to eliminate crime entirely. Founded in 2017 and proud member of Y Combinator’s S17 batch, this innovative company is based in Atlanta, GA, and currently employs around 1,000 dedicated team members.\n\nTheir unique approach blends cutting-edge technology with a commitment to privacy and ethical design. Flock operates on a Safety-as-a-Service model, providing municipalities and private communities with affordable devices powered by LTE and solar energy that can be swiftly deployed anywhere. The technology captures essential details, decodes evidence in real-time, and delivers actionable investigative leads to law enforcement and community members alike.\n\nFlock's offerings include advanced license plate readers, gunshot detection technology, and security cameras, all integrated into a cohesive platform that enables communities to leverage objective data. This approach is especially vital in an era where safety is paramount, allowing law enforcement to solve cases quickly and effectively.\n\nThe company has gained traction with significant backing, raising $150 million in a Series E funding round led by Tiger Global, bringing its valuation up to a remarkable $3.5 billion. Over 5,000 communities across the nation trust Flock, with some police departments reporting a 100% clearance rate for homicide cases thanks to Flock’s systems. \n\nWhat’s unique about Flock? Beyond the technology, they foster a positive remote work culture that emphasizes inclusivity and a strong team spirit. Their culture encourages not just efficiency but also relationships—a crucial factor when striving to make our communities safer. \n\nOverall, Flock Safety is not just another tech company; it's a movement towards safer neighborhoods, engaging law enforcement, and empowering communities with the tools they need to tackle crime. For more information, you can visit their website at [Flock Safety](http://www.flocksafety.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/0695e226161142e021fd89bd2b64715fbb657de8.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191343Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=04eb12e441f1e53292771105b629bbef9c13db51e6aa56c0816d99236ac88f49",
    "social_links": [
        "https://www.linkedin.com/company/flock-safety",
        "https://twitter.com/flock_safety",
        "https://www.facebook.com/flocksafety/",
        "https://www.crunchbase.com/organization/flock-safety"
    ],
    "logo_path": "data/logos\\Flock_Safety_logo.png"
}