{
    "links": "https://www.ycombinator.com/companies/floworks",
    "name": "Floworks",
    "headline": "Hire the best AI Sales employees | AI SDR | AI RevOps | AI EA",
    "batch": "W23",
    "description": "Floworks (https://floworks.ai) is building a suite of AI employees that helps business to run several business functions such as sales, on autopilot.\r\n\nOur flagship product, Alisha is an AI SDR that performs the full outbound SDR job- fully autonomously without any human involvement. \r\n\nOur AI SDR Alisha can perform ICP research, find out prospect lists, research about each prospect across 180 web sources, write highly personalized emails to each, follow and engage, and finally coordinate like a human to book sales calls.\r\n\nBusinesses using Alisha get 3 key benefits:\r\n1.⁠ ⁠They get 12x output from your existing sales team.\r\n2.⁠ ⁠⁠Are able to scale to 8 figure revenues with just a single AE.\r\n\nAlisha is built on our proprietary function calling model ThorV2 (https://floworks.ai/research) that outperforms both Claude 3 and GPT-4 function calling in accuracy by 13% and 43% respectively. At the same time, ThorV2 uses only a fraction of the cost (<40%) and time/latency (<78%) as the other models.\r\n\nOur second AI employee, Ashley, is an AI Executive Assistant that keeps you reminded and on top of your on your schedule. Works on your whim- just command Flowy to book a meeting, move a meeting or write a email, and it does without you having to navigate through every apps. You can teach Flowy specific workflows such as ‘inform me immediately if i receive a reply from xyz’, “show my unread emails from last day every morning 7am” and much more\r\n\nOur third AI employee, Romona is a helpful AI Revenue Operations Manager that keeps track of every CRM data updation on behalf of your team, works on your instruction to update notes, next steps, MEDDIC after every call, does periodic CRM reporting and much more.",
    "activity_status": "Active",
    "website": "https://floworks.ai/",
    "founded_date": 2022.0,
    "team_size": 20.0,
    "location": "San Francisco",
    "group_partner": "Brad Flora",
    "group_partner_yc": "https://www.ycombinator.com/people/brad-flora",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:generative-ai; industry:productivity; industry:sales; industry:ai; industry:ai-assistant; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Sarthak Shrivastava, Founder",
            "description": "An 2X entrepreneur and problem solver with experience in the e-commerce, logistics, and financial services industries of India, Singapore, and Philippines markets. I have built and scaled multiple business verticals in now unicorn startups in India with annual revenues of over US$30M.",
            "linkedin": "https://www.linkedin.com/in/sarthak-shrivastava/"
        },
        {
            "name": "Sudipta Biswas, Founder",
            "description": "I'm a startup junkie, who loves to build stuffs. I'm passionate about physics and technology, I previously built an AI referee, holds a patent and journal publication.\n\nI am a graduate of Indian Institute of Technology Kharagpur (IIT Kgp). I started my career at Goldman Sachs as a Quantitative Strat. My first startup was Engphile Labs where I utilised AI to solve umpiring errors in live sports. I have also built multiple tax filing products for India’s business at Cleartax.",
            "linkedin": "https://www.linkedin.com/in/sudipta-biswas/"
        }
    ],
    "status": true,
    "generated_description": "**Floworks: Automating Sales with AI-Powered Employees**\n\nFounded in 2022 and part of Y Combinator's Batch W23, Floworks is based in San Francisco and has a compact team of 20 driven employees, spearheaded by co-founder Siddhant Mohan. Their mission? To automate sales processes and hire the best AI-driven sales roles including AI SDRs (Sales Development Representatives), RevOps, and Executive Assistants.\n\nAt the heart of Floworks is **Alisha**, their flagship AI SDR. Alisha operates autonomously to execute the full outbound sales development role. This means it can handle everything from researching Ideal Customer Profiles (ICPs) to generating prospect lists, crafting personalized emails for each lead from 180 sources, following up, and scheduling calls—all without human intervention. The benefits are significant:\n\n1. **12x Output**: Businesses using Alisha report an impressive 12 times more output from their sales teams.\n2. **Scalability**: Companies can achieve 8-figure revenues with just one Account Executive (AE) alongside Alisha, thanks to the increased efficiency.\n\nFloworks utilizes its proprietary ThorV2 model, which boasts a 13% and 43% accuracy improvement over established models like GPT-4 and Claude 3 respectively. More importantly, it operates at under 40% of the cost and with 78% less latency than these alternatives.\n\nIn addition to Alisha, Floworks offers two more AI solutions:\n\n- **Ashley**: An AI Executive Assistant that keeps users organized and on top of their schedules with tailored reminders and management capabilities. Whether it’s moving meetings or drafting emails, Ashley simplifies the process.\n  \n- **Romona**: This AI Revenue Operations Manager handles manual and mundane tasks associated with CRM updates. Romona keeps track of data, updates notes, and produces periodic reports to streamline operations for the sales team.\n\nFloworks has attracted attention for its innovative use of generative AI in sales productivity, significantly optimizing sales processes. Their technology doesn't just automate; it enhances sales strategies and results. With clients experiencing up to **6x ROI** on the very first day of integration, the future looks bright.\n\nIf you’re managing a sales team, it’s time to consider what a fully automated AI sales team could do for you. Floworks is not just another automation tool; it’s designed for real business impact, helping teams focus on what matters most—closing deals. Interested? You can [book a demo](https://floworks.ai/contact) to see Alisha and the team in action!",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/4bc416eab947d5a4c0067bcfd0f1e82fdacf4f57.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191344Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=14c34377757d935d5e66807ee678313c77515db3ce1bb355a16b3085c5555fb5",
    "social_links": [
        "https://www.linkedin.com/company/floworkssolutions",
        "https://twitter.com/Floworks4"
    ],
    "logo_path": "data/logos\\Floworks_logo.png"
}