{
    "links": "https://www.ycombinator.com/companies/flowly",
    "name": "Flowly",
    "headline": "Our mobile app reduces chronic pain for 100 million Americans.",
    "batch": "S21",
    "description": "Flowly’s mobile app is the VR version of Calm with a focus on reducing chronic pain for 100 million Americans. Flowly subscribers receive a $5 VR headset and Heart Rate sensor that collects a user's biometric data like HR and HRV, and converts it to visualizations in virtual experiences that reduce pain by 46%. \r\nFlowly is backed by the National Institutes of Health.",
    "activity_status": "Active",
    "website": "https://www.flowly.world/",
    "founded_date": 2019.0,
    "team_size": 3.0,
    "location": "Los Angeles, CA",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:health-tech; location:los-angeles",
    "founders": [
        {
            "name": "Celine Tien, Founder",
            "description": "Founder and CEO of Flowly. Principal Investigator on two phased clinical trials at UPMC and USC, backed by the NIH. Director and writer of Pippa’s Pan 盼, one of the world’s first immersive Virtual Reality hybrid live-action films (selected for 2017 Festival de Cannes VR, placed top three at  VR/AR challenges at CES). Previously, in feature development at DreamWorks Animation. Grew up as a film/TV actor.  Also the founder of the non-profit education-based organization: Zoom for Kids!",
            "linkedin": "https://www.linkedin.com/in/celine-tien-70828698/"
        },
        {
            "name": "Narae Kim, Founder",
            "description": "Narae is a Co-Founder and CCO of Flowly, a clinically proven platform for managing pain and its comorbidities: anxiety, depression, and disordered sleep. In addition to her role at Flowly, Narae is a multi-award-winning art and creative director across VR, film, theater, and entertainment. Her drive to blend art, technology, and mental well-being is evident in her original works, showcased at esteemed events like the Cannes Film Festival, Cork International Film Festival, CES, Siggraph and more.",
            "linkedin": "https://www.linkedin.com/in/narae-kim-933b7669/"
        },
        {
            "name": "Julien Soros, Founder",
            "description": "Julien is Cofounder & CTO at Flowly. He has a background in Electrical Engineering from Yale University where he focused on Systems & Controls as well as Digital Signal Processing. Previously, Julien worked at Hyperloop One on their Transponics team doing control algorithm design and monte carlo system stability analysis. Julien's interest in Engineering began with guitar building, honing his skills at Veillette Guitars.",
            "linkedin": "https://www.linkedin.com/in/julien-s-7268a9140/"
        }
    ],
    "status": true,
    "generated_description": "**Flowly: Revolutionizing Pain Management**\n\nFounded in 2019 and emerging from Y Combinator's Batch S21, Flowly is on a mission to help 100 million Americans reduce chronic pain through its innovative mobile app. Think of Flowly as the virtual reality counterpart to Calm, but with a specific focus on alleviating chronic pain.\n\n### How It Works\nFlowly's platform combines cutting-edge VR technology with biofeedback tools, including a heart rate sensor that provides real-time data about the user's physiological state. Subscribers not only get access to the app but also a $5 VR headset to enhance their experience. This technology allows Flowly to tailor immersive experiences that have been shown to reduce pain by 46%. \n\nThe company's **Healing from Pain program** operates over a structured 12-week period, pairing users with licensed therapists who help them navigate the complexities of chronic pain. With an impressive statistic that 88% of participants report benefits from the program, and 55% noting improved sleep, the method is scientifically backed and recommended by healthcare providers.\n\n### Insurance and Accessibility\nOne of the standout features of Flowly is that many programs are covered by insurance providers such as Aetna and Medicare, making it accessible to a broader audience. So, if you're tired of being sidelined by pain, this might just be the solution you've been looking for.\n\n### Team and Support\nOperating out of Los Angeles, California, Flowly operates with a compact team of three, supported by a group partner, Nan. Despite the size, the impact is profound, bridging the gap between technology and healthcare in a meaningful way.\n\n### Why Flowly?\nFlowly understands that pain isn’t just physical; it’s emotional, affecting one’s quality of life. By addressing both the physical and psychological aspects of pain, they’re not just selling an app but offering a comprehensive toolkit. Think of it as therapy combined with personal coaching, all available from the comfort of your home.\n\nIf you’ve felt trapped by chronic pain, take a moment to check out their program. Flowly isn't just about pain management; it’s about reclaiming your life.\n\nFor more information, visit [Flowly's official site](https://www.flowly.world/) and consider scheduling a free consultation to see if this could be the right fit for you in your journey toward a pain-free life.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/7579534495d1bbe5a5a515e2aefe354113ddec12.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191344Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=7bc895c1597158766d915bc4f6a9b71c94f5270c0882289e49d47c7787a1bd66",
    "social_links": [
        "https://www.linkedin.com/company/officialflowly",
        "https://twitter.com/officialflowly",
        "https://www.facebook.com/officialflowly"
    ],
    "logo_path": "data/logos\\Flowly_logo.png"
}