{
    "links": "https://www.ycombinator.com/companies/flow-club",
    "name": "Flow Club",
    "headline": "Virtual Co-working Community",
    "batch": "S21",
    "description": "https://www.flow.club/ is a virtual co-working space where people work in high-intensity sprints designed to double their productivity. \r\n\nWe envision a world where...\r\n- anyone can access deep, focused flow anytime, anywhere\r\n- working independently or remotely doesn’t have to feel like you're on your own\r\n\nOur mission is to build the software that powers the most inspiring and productive work environment for knowledge workers.\r\n\nOur members love Flow Club (https://www.flow.club/wall-of-love). We’re growing quickly, just presented at Y Combinator's Summer 2021 Demo Day, raised $5M, and hiring our founding team.\r\n\nWe are backed by Worklife Ventures, a firm investing in companies re-designing the way work gets done in the future, and 100 more of the world's best investors and operators. Among our investors are Paul Graham and the founders of iconic companies like Dropbox, Mercury, Quora, Outschool, and Sendbird. \r\n\nFinally, we are inspired by our members and hosts who we see everyday working out of Flow Club building the most incredible things. They remind us great things are built incrementally, one step at a time.",
    "activity_status": "Active",
    "website": "https://www.flow.club/",
    "founded_date": 2020.0,
    "team_size": 6.0,
    "location": "San Francisco",
    "group_partner": "Harj Taggar",
    "group_partner_yc": "https://www.ycombinator.com/people/harj-taggar",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:consumer; industry:community; industry:productivity; industry:health-&-wellness; industry:remote-work; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Ricky Yean, Founder",
            "description": "Working on Flow.Club",
            "linkedin": "https://www.linkedin.com/in/rickyyean/"
        },
        {
            "name": "David Tran, Founder",
            "description": "Co-founder, Flow Club— come co-work with me: https://in.flow.club/h/david-t?inviteCode=David958\n\nPreviously: wrote the first lines of code for Alchemy, and co-founded Crowdbooster/Upbeat (YC S2010)",
            "linkedin": "https://linkedin.com/in/davetran"
        }
    ],
    "status": true,
    "generated_description": "Flow Club is carving out a unique space in the world of remote work by offering a virtual co-working community designed to maximize productivity through high-intensity work sprints. Founded in 2020 and part of Y Combinator’s Summer Batch 2021, Flow Club aims to tackle one of the biggest challenges of the modern work landscape: the isolation of remote work.\n\n### Mission & Vision\nAt its core, Flow Club is driven by a mission to create an inspiring and productive environment for knowledge workers, allowing individuals to tap into deep, focused flow. They envision a world where anyone, anywhere can access a supportive work environment, breaking the solitude that often comes with independent and remote work.\n\n### How It Works\nFlow Club sessions are intentionally structured to kickstart productivity. During these sessions, members work in a shared virtual environment, often employing techniques like **body doubling**, where the mere presence of others increases focus and accountability. Each session includes goal sharing, muted work periods with focus-inducing music, and celebration of progress, even if goals aren’t fully achieved. The backbone of their methodology is grounded in proven productivity techniques like the Pomodoro Technique, which encourages focused work intervals followed by breaks.\n\n### Community Impact\nFlow Club is more than just a productivity tool; it fosters a vibrant community where 94% of members report feeling supported in their productivity journeys. Testimonials from users, which they have lovingly dubbed their \"Wall of Love,\" highlight increased accountability, connection, and an enriched sense of accomplishment. \n\n### Growth & Support\nIn its short lifespan, Flow Club has already garnered significant attention, raising $5 million in funding from notable investors, including Dropbox’s founders and Paul Graham of Y Combinator. The company employs a small but dedicated team of six from its base in San Francisco. \n\n### For Everyone\nFlow Club's offerings extend to a broad audience, especially neurodivergent individuals seeking a structured yet flexible work environment. They even offer discounts for students and non-profits, ensuring that access to productivity-enhancing tools is available to all.\n\n### Conclusion\nIn essence, Flow Club is positioning itself as a cornerstone for individuals seeking a more intentional and community-oriented approach to work. Their emphasis on fun, focus, and meaningful connections may well make them a go-to solution for anyone grappling with the challenges of remote productivity. If you want to see their approach in action, check out their offerings [here](https://www.flow.club).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/56b025e95d7425fe71e4a25c0be6c6d72f6055da.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191344Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=bd04a29980b4bd2c17a026b1cea32fde819adbf8faab295d305ca4d990f46aee",
    "social_links": [
        "https://www.linkedin.com/company/flow-club",
        "https://twitter.com/flowdotclub",
        "https://www.facebook.com/flowdotclub",
        "https://github.com/Flow-Club"
    ],
    "logo_path": "data/logos\\Flow_Club_logo.png"
}