{
    "links": "https://www.ycombinator.com/companies/flowbo-inc",
    "name": "Flowbo",
    "headline": "Pipe for online businesses",
    "batch": "S21",
    "description": "Flowbo provides financing to online revenue-generating companies including creators and eCommerce. \r\n\nWe package assets into investable products so creators can raise money. For example, we package receivables into factoring products.",
    "activity_status": "Active",
    "website": "https://www.flowbo.co/",
    "founded_date": 2021.0,
    "team_size": 2.0,
    "location": "Los Angeles, CA",
    "group_partner": "Aaron Epstein",
    "group_partner_yc": "https://www.ycombinator.com/people/aaron-epstein",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:marketplace; industry:creator-economy; location:los-angeles",
    "founders": [
        {
            "name": "Daniel Kang, Founder",
            "description": "Daniel is co-founder of Flowbo, marketplace that provides financing to influencers and allow fans to share in their success. In the past, Daniel was an investment professional at Softbank Vision Fund focused on fintech investments, and served as a Board Observer of Auto1 Group (ETR: AG1). \n\nFormally, he studied policy and finance at University of Oxford and McGill University. As an immigrant founder from a modest background, Daniel has strong interest is accessibility to capital.",
            "linkedin": "https://www.linkedin.com/in/itsdankang/"
        },
        {
            "name": "Norman Yu, Founder",
            "description": null,
            "linkedin": "https://www.linkedin.com/in/normanyu1/"
        }
    ],
    "status": true,
    "generated_description": "**Flowbo: Paving the Way for Online Creators**\n\nFounded in 2021 and hailing from the innovation hub of Los Angeles, Flowbo is a fintech startup that serves as a funding lifeline for online businesses, particularly creators and eCommerce ventures. With its forward-thinking approach, it seeks to act as a \"pipe\" to fill the funding gap that many creators face. They're part of the Y Combinator Batch S21, which gives them street cred in the startup world.\n\n**Mission and Offerings**\n\nFlowbo understands that traditional banks often overlook the unique financial identities of creators. That’s why they package various revenue streams—like receivables—into investable products, allowing creators to access capital more flexibly and quickly. Whether your funding needs stem from sponsorships or eCommerce sales, Flowbo’s model is tailored to assist you in getting paid sooner, without the traditional delays of 30 to 90 days. \n\nHere's how it works:\n1. **Upload Invoices**: Creators can upload their signed contracts and invoices.\n2. **Review Offers**: After evaluation, Flowbo presents funding options with manageable fees ranging from 1-4%.\n3. **Instant Payment**: Once you agree to the terms and link your account, funds are transferred often within minutes.\n\nThis model provides a frictionless experience for creators who need immediate cash flow without the cumbersome hoops of traditional financing.\n\n**Backing and Growth**\n\nFlowbo has garnered attention from seasoned investors like Jonas Templstein of Monzo fame, HOF Capital, and Unshackled Ventures, adding credibility to its mission. The company operates with a compact team of two, which makes for a lean, focused operation.\n\n**Why Flowbo?**\n\n- **Creator-Centric Approach**: The company prides itself on understanding creators’ true value—an insight often lost on traditional banks.\n- **Control and Flexibility**: Creators retain full creative control, without stringent commitments to content.\n- **Ease of Access**: With an intuitive platform and a keen understanding of the creator economy, Flowbo is positioning itself as the go-to funding solution.\n\n**Join the Movement**\n\nAspiring or established creators looking for funding clarity can join Flowbo’s private beta on their website [Flowbo.co](https://www.flowbo.co/). This is more than just financial help; it's about unlocking potential in the burgeoning creator economy.\n\nIn a nutshell, Flowbo isn’t just helping creators get funded; they’re reshaping how funding is perceived and accessed in the digital age. It's an exciting time for online entrepreneurs, and Flowbo is at the forefront of their success.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/c6a66c3c5a15153701b40ad4095ec513dfca5c5c.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191343Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=cd04f8537da226659998cb42306994abe7bb47262693ca923f1046cebfb72ffa",
    "social_links": [],
    "logo_path": "data/logos\\Flowbo_logo.png"
}