{
    "links": "https://www.ycombinator.com/companies/fluently",
    "name": "Fluently",
    "headline": "AI-powered speaking coach for calls",
    "batch": "W24",
    "description": "Fluently is an app that helps non-native professionals improve their English with instant feedback after each Zoom call. Imagine having a personal coach, always listening and providing tips.\r\n\nThere are 84 million non-native employees who work in English-speaking environments, and companies spend $10 billion annually solely on their English corporate training to improve communication efficiency across the company and help them grow and feel more confident.\r\n\nFluently offers a more efficient and convenient way to boost speaking skills by providing feedback on pronunciation, grammar, and vocabulary after each call and fine-tuning the learning trajectory over time. That became possible by recent advancements in ML and the power of M1 chips for local processing.\r\n\nWe are non-native founders who solve their pain, and have deep expertise in running ML on edge devices.",
    "activity_status": "Active",
    "website": "https://getfluently.app/",
    "founded_date": 2023.0,
    "team_size": 2.0,
    "location": null,
    "group_partner": "Tom Blomfield",
    "group_partner_yc": "https://www.ycombinator.com/people/tom-blomfield",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:education; industry:saas; industry:b2b; industry:productivity; industry:ai",
    "founders": [
        {
            "name": "Yurii Rebryk, Founder",
            "description": "Yurii is the co-founder and CEO of Fluently — AI-powered speaking coach for calls.\n\nDuring his university years, Yurii interned at Google, Nvidia, Lyft, and Amazon, where he did ML research. Later, he founded and grew a deep tech startup from 2 to 50 people. The startup developed state-of-the-art face and voice swap technologies that work on mobile devices in real-time.",
            "linkedin": "https://linkedin.com/in/yrebryk"
        },
        {
            "name": "Stanislav Beliaev, Founder",
            "description": "Stan is the co-founder and CTO of Fluently — AI-powered speaking coach for calls. During his university years, Stan interned at Google, Nvidia, where he did ML research. Later, he founded and grew a deep tech startup from 2 to 50 people. The startup developed state-of-the-art face and voice swap technologies that work on mobile devices in real-time.",
            "linkedin": "https://linkedin.com/in/stasbel"
        }
    ],
    "status": true,
    "generated_description": "**Fluently: Your AI-Powered English Coach**\n\nFluently is a newly launched company with a clear mission: to empower non-native English speakers in professional environments by leveraging AI technology. Founded in 2023 and part of Y Combinator’s Batch W24, Fluently tackles a significant gap in the market—helping the staggering 84 million non-native employees enhance their English speaking skills effectively.\n\nThe concept behind Fluently is straightforward yet powerful. Imagine having an AI coach that listens in on your Zoom calls, providing instant feedback on your pronunciation, grammar, and vocabulary. This approach is not just innovative; it’s also backed by substantial economic insights—companies fork out around $10 billion annually on English language training, highlighting a booming demand for effective communication tools in the workplace.\n\nWhat sets Fluently apart? It utilizes advancements in machine learning, particularly the capabilities of M1 chips for local processing, to offer a personalized feedback system after each call. This isn’t just about correcting mistakes; it’s about creating a tailored learning trajectory, ensuring that each user can focus on their unique areas for improvement. \n\nThe founders of Fluently know this struggle firsthand. As non-native speakers themselves, they are motivated to solve a problem they've experienced. With a small team of just two, they have considerable expertise in machine learning, particularly in deploying it on edge devices—making their product not only functional but also efficient.\n\nFluently is categorized under education, SaaS, B2B, productivity, and AI, which gives you a hint about the versatility and market relevance of its offering. The messaging to potential users is clear: while many platforms stop at teaching basics, Fluently aims to take learners to advanced levels and beyond.\n\nThe platform is simple to start with—users can sign up for a free week to experience its features, including assessments of their current English level through a short AI-guided call. The aim is straightforward: foster improvement in real-world contexts like meetings, job interviews, and sales pitches—places where effective communication is paramount.\n\nAs a final note, in this ever-connected world, Fluently’s model not only caters to individual users but also opens the door for businesses to scale their training efforts seamlessly, providing a cost-effective alternative to traditional human tutors available 24/7.\n\nSo whether you’re looking to fine-tune your English skills for a better job opportunity or improve communication within your team, Fluently is poised to be a game-changer in personal development and professional growth. Visit [Fluently](https://getfluently.app/) to kickstart your journey.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/2d8db84cdb486b9a087b1e4794a5b6c9cb08f800.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191345Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=c19e3d0aac70fd9d9a1e980bcce3a615507fc7685834e5224a7e242fabf2d358",
    "social_links": [
        "https://linkedin.com/company/fluently-ai"
    ],
    "logo_path": "data/logos\\Fluently_logo.png"
}