{
    "links": "https://www.ycombinator.com/companies/fluke",
    "name": "fluke",
    "headline": "fluke is a full-digital mobile operator in Brazil",
    "batch": "S21",
    "description": "Brazilians hate the experience of using the traditional mobile carriers. They force you to pay for data packages you don’t need and make it impossible to switch your plans. Fluke offers a better customer experience and that’s why we have a CAC that is 50% lower and an LTV that’s 30% higher than traditional carriers.\r\n\nWhat’s smart about our approach is we rent infrastructure from these incumbents and build a better customer experience on top of it. This keeps our costs lows and lets us focus on what really matters: the customer experience! \r\n\nWe have the best network and customers are switching to us because of the service and flexibility to build their own customized mobile plans.\r\n\nWe are doing in telco what Nubank did in banking in Brazil.\r\n\nWe are Fluke, thank you!",
    "activity_status": "Active",
    "website": "https://flu.ke/",
    "founded_date": 2018.0,
    "team_size": 18.0,
    "location": "São Carlos, Brazil",
    "group_partner": "Harj Taggar",
    "group_partner_yc": "https://www.ycombinator.com/people/harj-taggar",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:b2b; industry:telecommunications",
    "founders": [
        {
            "name": "Marcos Oliveira Jr, Founder",
            "description": "I believe that good people make good companies and that good companies are worth more than big ones! I'm an enthusiast of new technologies and business models in telecommunications area. And for the most part of my time, I work to build my favorite company in this solar system 🚀",
            "linkedin": "https://www.linkedin.com/in/marcos-ant%C3%B4nio-oliveira-jr-3a0526137/"
        },
        {
            "name": "Augusto Pinheiro, Founder",
            "description": "Founder & CTO at fluke fighting every day for a fairer market. For me, technology is not just my job, it is my passion! 😊.",
            "linkedin": "https://www.linkedin.com/in/augusto-pinheiro-173896114/"
        },
        {
            "name": "Yuki Watanabe Kuramoto, Founder",
            "description": "Founder & CPO, working to develop the best customer experience in telecommunications 💚",
            "linkedin": "https://www.linkedin.com/in/yuki-watanabe-kuramoto-858856146/"
        }
    ],
    "status": true,
    "generated_description": "### Introducing Fluke\n\nFluke is a trailblazing digital mobile operator based in Brazil, founded in 2018 and part of Y Combinator's Batch S21. It emerged as a revolutionary response to the frustrations associated with traditional telecommunications providers. Numerous Brazilians found themselves shackled by unwanted data packages and inflexible plans, prompting Fluke to focus on crafting a superior customer experience.\n\nTheir mission is straightforward: to enhance the mobile experience while keeping costs low. By renting infrastructure from established players like Vivo, Fluke can redirect its resources towards customer-centric services. This strategy has resulted in a customer acquisition cost (CAC) that is 50% lower and a customer lifetime value (LTV) that is 30% higher than that of traditional carriers.\n\n### What Makes Fluke Stand Out?\n\n1. **Flexibility**: Customers can tailor their mobile plans precisely to their needs. Whether it’s choosing their data allowances or adding features, the options are abundant—without the burden of contracts.\n\n2. **Simplicity**: Fluke’s app provides a seamless way for customers to handle everything from plan adjustments to tracking usage. No more frustrating calls to customer service; a friendly chat feature ensures human help is just a message away.\n\n3. **No More Telemarketing**: In an era where unsolicited sales calls become a chronic annoyance, Fluke’s commitment to a telemarketing-free experience is refreshing.\n\n4. **Comprehensive Coverage**: Utilizing Vivo's well-established network through a partnership with Telecall, Fluke guarantees extensive coverage throughout Brazil. \n\n5. **Portability Made Easy**: Switching to Fluke is hassle-free. The app handles the porting process, meaning customers can ditch their old plans without the typical rigmarole.\n\n### Product Offerings\n\nFluke offers a variety of plan options:\n- **Ready-made Packages**: These include fixed amounts of data and unlimited calling, including options for popular apps like WhatsApp without data charges.\n  - **6GB** for R$37/month\n  - **12GB** for R$53/month\n  - **20GB** for R$90/month\n  - **50GB** for R$199/month\n\n- **Customized Plans**: Tailor your own package based on how much data, minutes, and SMS you really need, paying only for what you want. This plan also charges a nominal monthly fee to keep unused data from expiring.\n\n### The Team and Vision\n\nBased in São Carlos, Brazil, Fluke operates with a dedicated team of 18 employees. Aiming to replicate the transformational effect that Nubank had on the banking sector, Fluke is set to challenge the norms of mobile telecommunications in Brazil.\n\nTheir clear vision and effective execution have attracted attention, ensuring they will continue to be a formidable force in the Brazilian market. \n\n### Final Thoughts\n\nIn an age where users seek transparency and flexibility, Fluke delivers on both fronts, striving to be the mobile operator you’ve always wanted. Want to learn more? Check them out at [Fluke's website](https://flu.ke/) and experience the future of mobile telecom in Brazil.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/72013cc6ae9aeecc38c2795eb8b8135c378a66cf.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191344Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=ac5eafc59f2f23b094910ef12d3316459ae698c47298386e59d2b6f4be491af6",
    "social_links": [
        "https://www.linkedin.com/company/flukeoperadora"
    ],
    "logo_path": "data/logos\\fluke_logo.png"
}