{
    "links": "https://www.ycombinator.com/companies/flutterwave",
    "name": "Flutterwave",
    "headline": "Helping businesses make and accept payments from anywhere in Africa.",
    "batch": "S16",
    "description": "At Flutterwave, we are on a mission to build payments infrastructure to connect Africa to the global economy. \r\n\nWe do this by building technology, tools, and infrastructure for businesses and banks who want to provide a more seamless and secure payments experience for their customers. Founded in 2016 by a team of African finance and technology veterans from Standard Bank, Angela, PayPal, Google Wallet amongst others.\r\n\nFlutterwave has grown to become one of the fastest growing payments companies in the world. Since inception Flutterwave has processed close to $20 billion in payments and 100 million transactions across over 33 African countries where it currently operates. \r\n\nIt has attracted significant investment from experienced Fintech investors such as Ycombinator Continuity Fund (investors in Stripe), Greycroft (investors in Braintree and Venmo), Greenvisor Capital, Omidyar Network, and Glynn Capital amongst others. In 2017 Flutterwave was named Africa’s best fintech company at the Apps Africa Innovation Awards.",
    "activity_status": "Active",
    "website": "https://flutterwave.com",
    "founded_date": 2016.0,
    "team_size": 500.0,
    "location": "Lagos, Nigeria",
    "group_partner": "Jared Friedman",
    "group_partner_yc": "https://www.ycombinator.com/people/jared-friedman",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech",
    "founders": [],
    "status": true,
    "generated_description": "**Flutterwave: Connecting Africa to the Global Economy**\n\nFounded in 2016 and based in Lagos, Nigeria, Flutterwave has quickly emerged as a frontrunner in the fintech space, specifically in payment solutions for African businesses. The company was established by a team of finance and tech veterans with backgrounds from well-known institutions like Standard Bank, PayPal, and Google Wallet. This impressive pedigree has enabled Flutterwave to craft a robust payments infrastructure that allows businesses across Africa to seamlessly accept and process payments on a global scale.\n\nThe mission is clear: **\"Helping businesses make and accept payments from anywhere in Africa.\"** By providing advanced technology and tailored tools, Flutterwave empowers thousands of merchants, ranging from SMEs to large enterprises, to grow their business by simplifying the payments process. \n\nFlutterwave operates in over 33 African countries and has processed almost **$20 billion** in payments through **100 million transactions** to date. Their solutions include online payment acceptance, cross-border transactions, and point-of-sale systems—all essential in today’s increasingly connected economy. The company has also garnered significant investment from notable fintech investors, including Y Combinator and Greycroft, reinforcing its status in the industry.\n\nWith over **500 dedicated employees**, Flutterwave isn't just a payments platform—it's a thriving ecosystem for over **1 million businesses** and **2 million individuals** who rely on it for their financial transactions. From facilitating student tuition payments to enabling effortless money transfers and creating online storefronts, Flutterwave's service offerings are diverse and ever-expanding.\n\nAmong its various features are:\n\n- **Online Payments**: Easily accept payments in multiple currencies from customers worldwide.\n- **Payouts & Transfers**: Experience hassle-free cross-border payments.\n- **Payment Links**: Accept payments without needing to write code.\n- **API for Developers**: Comprehensive API documentation makes integration a breeze, supporting capabilities like quick transfers and payment verifications.\n\nMoreover, Flutterwave has been recognized as Africa’s best fintech company at the Apps Africa Innovation Awards in 2017, underscoring its innovative approach and impact in the region.\n\nIn an environment where the question isn't \"what's possible?\" but rather \"what isn't possible?\", Flutterwave continues to unlock new payment opportunities, contributing to Africa's integration into the global economy. For anyone looking to harness the power of payments across Africa, Flutterwave is a name to remember.\n\nFor further details, check out their website: [Flutterwave](https://flutterwave.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/ef92c87e881f68cfca20d502ac83e018d330ee68.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191345Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=ff7216c8f2e9ef47ed7e842bec8d868861c8bb9e4c76d43ae8080cf79d2526b6",
    "social_links": [
        "https://www.linkedin.com/company/flutterwave/",
        "https://twitter.com/theflutterwave",
        "https://www.crunchbase.com/organization/flutterwave",
        "https://github.com/Flutterwave"
    ],
    "logo_path": "data/logos\\Flutterwave_logo.png"
}