{
    "links": "https://www.ycombinator.com/companies/flux",
    "name": "Flux",
    "headline": "Flux is building the payment network for alternative payments inâ\u0080¦",
    "batch": "S19",
    "description": "Flux is building the payment network for alternative payments, with a focus on bringing acceptance of all BNPL options to on-site merchants so they can max their client's buying power.\r\n\nFlux provides an instant-issuing and payment acceptance solution for consumer credit products, and a payment terminal for alternative credit (non-card) for retailers.",
    "activity_status": "Active",
    "website": "http://paywithflux.com",
    "founded_date": 2018.0,
    "team_size": 9.0,
    "location": "Mexico City, Mexico",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:payments",
    "founders": [
        {
            "name": "Maximiliano Echeverria, Founder",
            "description": "Re-imagining payments since 2002",
            "linkedin": "https://www.linkedin.com/in/maximilianoe"
        },
        {
            "name": "Fernando de la Torre, Founder",
            "description": null,
            "linkedin": "https://www.linkedin.com/in/fdelatorre/"
        }
    ],
    "status": true,
    "generated_description": "**Flux: Payment Solutions for the Future of Commerce**\n\nFounded in 2018 and hailing from Mexico City, Flux is a dynamic player in the fintech arena, specifically focused on empowering consumers and retailers with alternative payment solutions. As part of the prestigious Y Combinator Batch S19, Flux is on a mission to revolutionize the payments landscape by enhancing the purchasing power of customers through Buy Now, Pay Later (BNPL) options.\n\n### What Does Flux Do?\n\nAt its core, Flux facilitates instant issuing and payment acceptance of consumer credit products. This means retailers can offer a seamless payment experience without the limitations of traditional credit cards. With their bespoke payment terminal tailored for non-card transactions, Flux helps merchants unlock the potential of underserved customer segments—after all, around 80% of buyers might not have access to a credit card.\n\n### How Does It Work?\n\nThe Flux model is refreshingly straightforward. Retailers can sign up without upfront costs and begin accepting alternative payment methods through a user-friendly app. Customers can apply for credit directly from their phones and select their preferred payment terms, all while merchants receive their funds immediately—no complicated terminals involved, just a single app to manage it all.\n\n### Key Features:\n\n1. **Empowering Purchases**: Flux enables retailers to boost their average transaction value by over 40% and potentially increase overall sales by 20%. This is a game changer for businesses that want to maximize customer spending without the usual friction of payment processes.\n   \n2. **Risk-Free Revenue**: Merchants get paid upfront, and they only pay a small commission for each transaction. This model minimizes financial risk while facilitating smooth sales.\n\n3. **Easy Onboarding**: Signing up with Flux is a breeze. Retailers just fill out their business information, download the app, and start notifying customers about new payment options—Flux even provides marketing materials to help get the word out.\n\n### The Team Behind Flux\n\nWith a dedicated team of nine and leadership guided by a vision of innovation and quality, Flux is truly committed to customer service and support. Their approach has earned them praise from partners like Grupo Herdez and BonnusCard, showcasing their effectiveness in fostering growth for retailers.\n\n### Join the Future of Payments with Flux\n\nIf you’re a retailer looking to enhance customer experience and drive sales, consider making the switch to Flux. Their model not only meets the needs of modern consumers but also positions businesses for success in a competitive landscape. For more information, check out their website at [paywithflux.com](http://paywithflux.com).\n\nIn a universe where traditional payment methods can fall short, Flux stands out as a beacon for both customers and merchants, transforming how transactions are conducted and expanding financial accessibility for all.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/e158acd070138363d80802407b5b211cbe106802.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191345Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=7091fc542eb86be698269030b8f9959aada82281772c87f533dbd9592dcbb179",
    "social_links": [
        "https://www.linkedin.com/company/paywithflux",
        "https://www.facebook.com/fluxqr/",
        "https://www.crunchbase.com/organization/flux-3dc6"
    ],
    "logo_path": "data/logos\\Flux_logo.png"
}