{
    "links": "https://www.ycombinator.com/companies/flyflow",
    "name": "Flyflow",
    "headline": "The easiest way to find high-quality sales leads",
    "batch": "S24",
    "description": "\"I don’t know how I would have found these leads myself.\"  - YC Founder\r\n\nFlyflow enables companies to find prospective customers using AI workflows instead of drowning in tables. Try out our product at app.flyflow.ai.\r\n\nHow are we different?\r\n\n(1) Higher quality leads: get to a list that’s so relevant, you’ll want to spend time getting introduced to people there, instead of sending another 1,000 cold emails\r\n\n(2) Incredibly easy to set up: get up and running with a list of prospects in hand  in under 10 minutes\r\n\n(3) Integrate the best of different sales tools all in one place: no need to switch between different tabs for web research, filtering by company size, and finding prospect LinkedIns",
    "activity_status": "Active",
    "website": "https://flyflow.ai",
    "founded_date": 2024.0,
    "team_size": 2.0,
    "location": null,
    "group_partner": "Gustaf Alstromer",
    "group_partner_yc": "https://www.ycombinator.com/people/gustaf-alstromer",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": null,
    "founders": [
        {
            "name": "Pritee Tembhekar, Founder",
            "description": "Pritee is co-founder and CEO of Flyflow. Flyflow enables you to find the perfect sales leads, without the grunt work.\n\nPritee was previously Head of Product at Lithic (card-issuing APIs and Privacy.com consumer brand). Before that, she held product roles at Plaid and Coinbase. She started her career at BCG and Google and holds degrees from MIT and HBS.",
            "linkedin": "https://linkedin.com/in/priteet"
        }
    ],
    "status": true,
    "generated_description": "### Flyflow: Simplifying Your Lead Generation\n\n**Overview**  \nFlyflow is a fresh startup birthed from the 2024 Y Combinator Batch S24, focusing on revolutionizing how companies find sales leads. Struck by a common frustration—\"I don’t know how I would have found these leads myself\"—the founders decided it was time to innovate. With just a team of two, Flyflow aims to strip away the tedious grunt work that often plagues sales teams.\n\n**Mission**  \nAt its core, Flyflow stands for making lead generation the easiest it can be. They leverage AI to provide high-quality, targeted sales leads to businesses right when they need them.\n\n**Key Features and Differentiators**  \n1. **Higher Quality Leads**: Flyflow offers a curated list of leads that are not just random contacts; they’re highly relevant to your business, making cold outreach feel a lot less cold.\n  \n2. **Quick Setup**: Companies can be up and running in under ten minutes. It’s a stark contrast to traditional methods that often involve hours of tedious data entry and analysis.\n\n3. **All-in-One Integration**: With Flyflow, users can unify their sales tools without the hassle of flipping between a myriad of tabs. They centralize web research, filtering by company size, and even LinkedIn prospecting into a single platform.\n\n**User-Friendly Product**  \nFlyflow’s product design means you don’t need to be a data scientist or an engineer to make the most of it. It includes functionalities such as:\n- **Lookalike Search**: Identify companies that resemble your ideal customers.\n- **Custom Filters**: Dive deep into your own data to prioritize leads based on your unique criteria.\n- **Enrichment Features**: Utilize powerful filters to refine results by company size, hiring signals, and more.\n- **CRM Integrations**: Seamlessly connect with Salesforce or Hubspot to keep everything organized.\n\n**Pricing Structure**  \nFlyflow offers a straightforward pricing model:\n- **Free Trial**: 7 days of free exploration with no credit card required. \n- **Pro Plan**: Access unlimited searches for $650/month with top-tier support.\n- **Enterprise Solutions**: Custom contracts tailored to your business needs.\n\n**Where to Find Flyflow**  \nCurious to give it a spin? Head over to [Flyflow's website](https://flyflow.ai) and check out their intuitive platform.\n\n**Conclusion**  \nIn a world flooded with data and leads that often don’t convert, Flyflow cuts through the noise. With an ethos of quality over quantity, they promise that connecting with prospects won’t feel like filling out spreadsheets—it’ll feel like building relationships. Whether you’re a small startup or an established enterprise, Flyflow is poised to change your lead-generation game without the usual hassle.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/58e1c800e18d41d1bd77c146a0ccba50cdc794aa.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191345Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=3586338d7edab9f33dd5a16c3b886178653fa7ee808d2f001b259e1980bdee1e",
    "social_links": [
        "https://www.linkedin.com/company/flyflowai"
    ],
    "logo_path": "data/logos\\Flyflow_logo.png"
}