{
    "links": "https://www.ycombinator.com/companies/focal-systems",
    "name": "Focal Systems",
    "headline": "Building the Operating System for B&M Retail using Deep Learning",
    "batch": "W16",
    "description": "Focal Systems is on a mission to lower the cost of living for all mankind by automating and optimizing Brick and Mortar Retail with the latest advancements in AI. Focal Systems is the industry leader in retail automation solutions. By digitizing store shelves hourly and unleashing FocalOS, retailers unlock huge operational efficiencies, optimized merchandising, and streamlined supply chains which deliver impactful financial results. Focal is transforming retail by empowering store management to make automated, data-driven decisions. We are the operating system of retail.",
    "activity_status": "Active",
    "website": "http://www.focal.systems",
    "founded_date": 2016.0,
    "team_size": 170.0,
    "location": "New York",
    "group_partner": "Jared Friedman",
    "group_partner_yc": "https://www.ycombinator.com/people/jared-friedman",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:deep-learning; industry:grocery; industry:computer-vision; location:new-york",
    "founders": [
        {
            "name": "Michael Cantalino, Founder/COO",
            "description": "Founder at Focal Systems, the AI operating system of brick-and-mortar retail. Leading with a people-first mentality. Constantly aiming to leave the world better than I found it in all aspects of business and life. Alongside technology, heavily involved in the non-profit sector and all things outdoors.",
            "linkedin": "https://www.linkedin.com/pub/michael-john-cantalino/12/b44/747"
        }
    ],
    "status": true,
    "generated_description": "Focal Systems is at the forefront of revolutionizing the brick-and-mortar retail industry by leveraging deep learning and artificial intelligence to create a sophisticated operating system for retail, aptly named FocalOS. Founded in 2016 and a proud member of Y Combinator's Winter 2016 batch, their mission resonates deeply—\"to lower the cost of living for all mankind\" by automating and optimizing retail experiences.\n\nBased in New York, Focal Systems employs a dynamic team of 170 people. Their innovative approach involves digitizing store shelves on an hourly basis, which allows retailers to see exactly how their inventory is doing at any given moment. This real-time data paves the way for smarter merchandising and streamlined supply chains, ultimately enhancing operational efficiency. The results? A remarkable average EBITDA lift of 88%, a substantial reduction in food waste, and significant productivity gains—more than doubling stocker efficiency.\n\nThis is not just about theory; Focal has deployed over 200,000 cameras in more than 1,000 stores, proving their commitment to transforming the retail landscape. Their cutting-edge solutions, such as AdaOrder for precise inventory management and FocalOS for comprehensive store management, assist retailers in making data-driven decisions that are automated rather than reactive.\n\nTheir clientele includes notable retailers like Walmart Canada and Piggly Wiggly, who attest to the effectiveness of Focal's technology in improving customer availability and overall in-store experience. Such endorsements underscore Focal Systems' influential role in not just enhancing operational metrics, but also prioritizing employee satisfaction through user-friendly interfaces that are designed with the workforce in mind.\n\nIn summary, Focal Systems is not merely a tech firm; they are the architects of a smarter retail future, where every inch of shelf space is optimized, costs are minimized, and customer satisfaction is enhanced—truly fulfilling their mission of lowering living costs through advanced AI solutions. For more insight into Focal Systems and their innovations, visit their website at [focal.systems](http://www.focal.systems).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/4487b14f76fea1e508d91c3868820c0b8ff6e55d.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191345Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=982a2196b1a192d90e1b163bd1edffc77f4b0f6bf33cd13f7324d7d6700c4c8e",
    "social_links": [
        "https://www.crunchbase.com/organization/focal-systems"
    ],
    "logo_path": "data/logos\\Focal_Systems_logo.png"
}