{
    "links": "https://www.ycombinator.com/companies/focus-buddy",
    "name": "Focus Buddy",
    "headline": "AI Productivity Coach you speak with while working to stay focusedâ\u0080¦",
    "batch": "S24",
    "description": "Reach out to us at founders@focusbuddy.ai\r\n\nFocus buddy is an AI productivity coach that stays on calls with you and help you accomplish your important work goals on a daily basis, even when you are struggling to focus.\r\n\nWe noticed that our users develop a productive relationship with Focus Buddy. Users stay on calls for multiple hours everyday where they depend on Focus Buddy to:\r\nâ\u0080¢ Avoid procrastination and get started: Address hidden anxieties, embrace imperfection, chunk tasks, kickstart with mini-goals, and use regular check-ins to maintain momentum.\r\nâ\u0080¢ Recover from distractions and stay focused: Focus Buddy detects when they are working on less important tasks or scrolling on social media, help them overcome the underlying concerns feeding the distraction, and help them get back to the important task\r\nâ\u0080¢ Manage stress and Prevent Burnout: Focus Buddy detects stress buildup, integrates mindfulness habits to the workflow, helps take short rejuvenating breaks, and stay composed.\r\n\nOur Initial ICP is people with ADHD who are highly motivated but also highly blocked by internal and environmental factors. In the future, we believe each worker should have their own personal coach that enforces proven productivity techniques in real time to help them extract more focused hours every day with the same effort.",
    "activity_status": "Active",
    "website": "https://www.focusbuddy.ai/?ref=yc",
    "founded_date": 2024.0,
    "team_size": 2.0,
    "location": "San Francisco",
    "group_partner": "Michael Seibel",
    "group_partner_yc": "https://www.ycombinator.com/people/michael-seibel",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:artificial-intelligence; industry:consumer; industry:productivity; industry:mental-health; industry:conversational-ai; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Adnan Sherif, Founder",
            "description": "CEO Focus Buddy. Ex ML @ Google working on Generative AI on the Pixel Phone. Ex ML Researcher @ UC Berkeley Sky Lab",
            "linkedin": "https://www.linkedin.com/in/adnan-sherif-as/"
        },
        {
            "name": "Yash Ramchandani, Founder",
            "description": "Co-Founder of Focus Buddy. Previously PM @ Google working on AI features on the Pixel phone, and Ads for stores trying to drive in-store traffic",
            "linkedin": "https://www.linkedin.com/in/yashmr/"
        }
    ],
    "status": true,
    "generated_description": "Focus Buddy is an intriguing startup born out of Y Combinator's Batch S24 in 2024, located in the bustling tech hub of San Francisco. The company’s mission is straightforward yet ambitious: to serve as your AI productivity coach, helping you stay focused while tackling your daily tasks, especially when distractions and procrastination threaten to derail your progress.\n\nThe core idea is that Focus Buddy keeps you company on calls as you work, turning what typically feels like a solitary grind into a more engaging experience. Users have reported spending multiple hours on these calls. The AI assists in several key areas:\n\n1. **Starting Tasks**: For those battling procrastination, Focus Buddy helps uncover the root causes of hesitation—be it anxiety or perfectionism—encouraging users to break their work into manageable mini-goals. These check-ins create momentum and make the daunting tasks feel less intimidating.\n\n2. **Maintaining Focus**: It meticulously monitors your activity, steering you back when it detects you veering off into less important tasks or the abyss of social media. By addressing the distractions head-on, it aims to reinforce your focus on what truly matters.\n\n3. **Stress Management**: Focus Buddy is also in tune with your mental health, identifying signs of stress buildup and integrating mindfulness techniques into your workflow. Regular breaks are encouraged to help prevent burnout, ensuring you stay composed and productive.\n\nThe primary target audience for Focus Buddy is individuals with ADHD, who often face unique challenges in maintaining focus and productivity. However, the company envisions a future where every worker benefits from a personal productivity coach, one that employs effective techniques in real-time to help maximize output with the same effort.\n\nThe founders, a two-person team, have already started to make waves with positive user feedback, underscoring the effectiveness of their AI coach. Users describe the experience as transformative, feeling more engaged and equipped to tackle their tasks with less hesitation.\n\nFor anyone interested in exploring this service further, Focus Buddy has crafted a user-friendly platform with both free and personalized pricing tiers. It’s available around the clock, inviting you to work alongside your AI coach whenever you choose.\n\nIf productivity is something you struggle with, especially in this age of distractions, checking out Focus Buddy might just be the step you need to reclaim your focus and productivity. \n\nFor more information, visit their website at [focusbuddy.ai](https://www.focusbuddy.ai/?ref=yc).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/6d04601a4edf428321cd925a1f52244ece4a09d0.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191346Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=8837959357b9e169aedcace4ea8d872d96eeb68533051169003d656a7baf3098",
    "social_links": [],
    "logo_path": "data/logos\\Focus_Buddy_logo.png"
}