{
    "links": "https://www.ycombinator.com/companies/followupthen",
    "name": "FollowUpThen",
    "headline": "FollowUpThen is an email-based personal assistant that sends youâ\u0080¦",
    "batch": "S17",
    "description": "FollowUpThen is a personal assistant that sends you exactly what you need at exactly the right moment to get something done. Its uncanny timing is not the result of AI wizardry, but rather an explicit reminder syntax that is embedded in an email address. Email 1min@followupthen.com, 1hour@followupthen.com or {any-time}@followupthen.com and you'll get the email back at that time. Adding a reminder to any email is a one-second operation thanks to your email client's address autocomplete.\r\n\nExample use-cases include:\r\n * Following up with sales prospects\r\n * Maintaining relationships\r\n * Task delegation (put FollowUpThen in the bcc field)\r\n * Just-in-time reminders to get a task done (pay bills, etc)\r\n * Hitting inbox zero (forwarding emails to your future)\r\n\nIn today's workplace we are bombarded with realtime demands on our attention. FollowUpThen answers this trend by making work more asynchronous, allowing you to place information in the future,  giving you freedom and peace of mind in the present and allowing you actually get something done.",
    "activity_status": "Active",
    "website": "https://www.followupthen.com/",
    "founded_date": null,
    "team_size": 1.0,
    "location": "San Jose, CA",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:artificial-intelligence; industry:productivity; industry:automation; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Reilly Sweetland, Founder",
            "description": "Solo technical founder of FollowUpThen, an email-based personal assistant that helps you become a followup master. Previously founded Internet Simplicity (acq. 2016) where we built software for companies like Netflix, Blue Jeans, Disney Family Foundation, Mozilla and others.",
            "linkedin": "https://www.linkedin.com/in/reillysweetland/"
        }
    ],
    "status": true,
    "generated_description": "FollowUpThen is a straightforward yet powerful email-based personal assistant that aims to streamline your productivity. The company was founded and is based in San Jose, California, and it emerged from Y Combinator's S17 batch. The premise is simple but effective: by leveraging a unique email reminder syntax, you can send tasks to your future self without the hassle of complex setups or software. Whether you need to remember a quick task, follow up with a colleague, or manage relationships, FollowUpThen allows you to dictate when your reminders arrive, making your workflow more asynchronous and manageable.\n\n### How It Works\nTo use FollowUpThen, you send an email to special addresses like `1min@followupthen.com` for a reminder in one minute, or `1hour@followupthen.com` for one hour later; the flexibility here is essentially boundless. Just type your reminder in the subject line or body, and it’ll find its way back to your inbox at the designated time. This takes that mental load off your mind—an easy step towards achieving inbox zero.\n\n### Practical Use-Cases\n1. **Sales Follow-Ups**: Keep tabs on potential clients.\n2. **Relationship Maintenance**: Schedule reminders to connect.\n3. **Task Delegation**: Use BCC to assign tasks.\n4. **Time Management**: Set reminders for important bills or deadlines.\n5. **Organizational Clarity**: Send emails into the future to keep your inbox neat.\n\n### Why Use FollowUpThen?\nIn today's fast-paced world, the ability to manage time effectively is crucial. The platform’s focus on asynchronous work means you can free up your mental space while enhancing productivity. You can rely on FollowUpThen for its simplicity, privacy, and versatility—it's like a personal assistant that lives in your email.\n\n### Pricing\n- **Free Plan**: Up to 50 active reminders per month.\n- **Base Plan**: $4/month for unlimited reminders and additional features.\n- **Team Plan**: $4/user/month, including team productivity tools.\n\n### User Feedback\nTrusted by numerous organizations and professionals, FollowUpThen has garnered a loyal user base, citing its stability and ease of use as key advantages. Users appreciate being able to control their future workload while maintaining a clutter-free present.\n\nIn conclusion, FollowUpThen is a tool designed to alleviate the pressure of managing tasks and deadlines in a world of constant distractions. If you find yourself overwhelmed with a barrage of emails or task obligations, it might just be the email assistant you've been waiting for: simple, effective, and right at your fingertips. For more details, check out their site: [FollowUpThen](https://www.followupthen.com/).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/8a05db3d65f9cfa79467e83bd4c8cacd092b542f.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191346Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=037308de13b4b7d247d789eff2ceba03fd0b76933a159840c8821cd215bc01c0",
    "social_links": [
        "https://twitter.com/followupthen"
    ],
    "logo_path": "data/logos\\FollowUpThen_logo.png"
}