{
    "links": "https://www.ycombinator.com/companies/foodcourt",
    "name": "FoodCourt",
    "headline": "Virtual Restaurants & Stores for Africa",
    "batch": "S22",
    "description": "FoodCourt (CoKitchen) is Africa's leading virtual restaurant company. We've served over 350,000 meals in the last 12 months & our goal is to make good food and quick convenience goods more accessible across Africa, through virtual restaurants & dark stores.\r\n\nUnderstanding the unique problems of the African on-demand/ food delivery market, we've taken a full-stack approach by controlling different areas of the value chain such as technology, production & delivery to give users a seamless & consistent experience while giving us unlimited flexibility for growth. \r\n\nLearn more at www.getfoodcourt.com or email henry@cokitchen.ng",
    "activity_status": "Active",
    "website": "https://www.getfoodcourt.com",
    "founded_date": 2021.0,
    "team_size": 80.0,
    "location": "Lagos, Nigeria",
    "group_partner": "Brad Flora",
    "group_partner_yc": "https://www.ycombinator.com/people/brad-flora",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:ghost-kitchens; industry:consumer; industry:delivery; industry:food-tech",
    "founders": [
        {
            "name": "Henry Nneji, Founder",
            "description": "Henry is the Co-Founder & CEO of CoKitchen. He is from a very entrepreneurial family and has always had a keen interest for solving problems with technology. Prior to CoKitchen, Henry has been able to accumulate a range of experiences cut across design, marketing, product development/ management & entrepreneurship. In 2019 he co-founded Fashion Map, a quick way for Nigerians to find tailors & fashion designers across the country, dubbed as the “Uber for Tailors” by The Economist.",
            "linkedin": "http://linkedin.com/in/henrynneji"
        },
        {
            "name": "Paul Adokiye Iruene, Founder",
            "description": "Paul is the Co-Founder & CTO of CoKitchen. \nHe has a strong engineering background and has always been passionate about technology. \nPaul is a full-stack engineer with vast experience in back end, web, mobile development, AI, machine learning & DevOps. Prior to CoKitchen he was on the founding tech team of Prospa (YC W21), a digital bank for small businesses across Africa. As a personal project, built “for food only” an AI Vision app that identifies African food items using image classification.",
            "linkedin": "https://www.linkedin.com/in/paul-adokiye-iruene-5537a5163/"
        }
    ],
    "status": true,
    "generated_description": "**FoodCourt Overview**\n\nFounded in 2021 and hailed as Africa's leading virtual restaurant company, FoodCourt is on a mission to revolutionize food accessibility across the continent. Located in Lagos, Nigeria, and part of Y Combinator Batch S22, this innovative startup aims to bridge the gap in the on-demand food delivery market through a unique combination of technology, production, and delivery.\n\n### Mission and Vision\nFoodCourt is set on establishing a network of virtual restaurants and dark stores to serve high-quality meals and convenience goods. In just the last year, they've delivered over 350,000 meals, highlighting a commitment to good food and quick service. Their approach tackles the peculiar challenges of the African market by controlling various parts of the value chain, which ensures a user-friendly experience and allows for rapid growth.\n\n### Product Line\nFoodCourt's offerings include:\n\n- **FoodCourt App**: A platform for ordering chef-prepared meals with a focus on speed and quality.\n- **Corporate Meal Plans**: Tailored to enhance employee satisfaction and productivity.\n- **Event Catering**: Custom solutions for events, emphasizing quality.\n- **Heat-and-Serve Products**: Recently expanded options like freshly pressed juices, smoothies, and baked items, with a commitment to natural ingredients and flavors.\n\n### Team and Leadership\nWith a team of 80 dedicated employees, FoodCourt boasts of expertise across culinary arts, logistics, and customer service. Chef Tilewa Odedina, their Head of Culinary and Restaurants, exemplifies the blend of business savvy and culinary excellence, bringing experience from Le Cordon Bleu and the financial sector to lead FoodCourt's kitchen operations.\n\n### Customer Experience\nThe platform has quickly garnered a positive reputation, with customers praising the speed of delivery, variety of dishes, and overall quality of food—particularly their shawarma. FoodCourt has positioned itself as a go-to app for food delivery in Lagos, promising not just meals, but an overall dining experience to be excited about.\n\n### Future Outlook\nAs FoodCourt continues to innovate and expand its services, the focus remains on making delicious food accessible to more people across Africa. With robust backing and a clear customer-oriented strategy, the company is poised for significant growth.\n\nFor more information, visit [FoodCourt's website](https://www.getfoodcourt.com) or reach out via email at hello@getfoodcourt.com.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/4ec43d4f38d649702eb2f3db8b10ade65c8c28e9.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191347Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=35da42f3d47ab51d08ab9ccb4b3cc3b5c57b7eb2b9bca5466b65366ad30e84b1",
    "social_links": [
        "https://www.linkedin.com/company/joinco-kitchen/",
        "https://www.twitter.com/foodcourt_app",
        "https://web.facebook.com/getfoodcourt/"
    ],
    "logo_path": "data/logos\\FoodCourt_logo.png"
}