{
    "links": "https://www.ycombinator.com/companies/forge",
    "name": "Forge",
    "headline": "Procurement software for hardware companies",
    "batch": "W24",
    "description": "Forge makes procurement software for hardware companies. Trillions of dollars of purchases at the most advanced manufacturing companies are managed across spreadsheets, emails, and meetings - we automate this.\r\n\nEmir and Haris are brothers with backgrounds in both software and hardware engineering. While developing rocket engines, Emir saw firsthand how poor procurement operations caused weeks to months of delay, bottlenecking the pace of development.\r\n\nOur product lets teams collaborate with manufacturers, track orders from quote to delivery, manage purchase approvals, and more!",
    "activity_status": "Active",
    "website": "https://www.forgehq.com/",
    "founded_date": 2023.0,
    "team_size": 3.0,
    "location": "San Francisco",
    "group_partner": "Tom Blomfield",
    "group_partner_yc": "https://www.ycombinator.com/people/tom-blomfield",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:hardware; industry:b2b; industry:supply-chain; industry:procurement; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Emir Sahmanovic, Founder",
            "description": "Emir is the co-founder and CEO of Forge. Previously he was a lead engineer with experience designing, building, and testing rocket engines at Blue Origin and Stoke Space. At Stoke, Emir was part of a small team that became the fastest to ever go from seed funding to engine hot fire.",
            "linkedin": "https://linkedin.com/in/emir-sahmanovic-976b71b5"
        },
        {
            "name": "Haris Sahmanovic, Founder",
            "description": "Haris is the co-founder and CTO of Forge. Before Forge, he worked at Facebook and Vanguard as a backend engineer.",
            "linkedin": "https://linkedin.com/in/haris-sahmanovic-438884126"
        }
    ],
    "status": true,
    "generated_description": "### Forge: Revolutionizing Procurement for Hardware Companies\n\nFounded in 2023 and hailing from the San Francisco Bay Area, Forge is on a mission to transform procurement processes for hardware companies. With Emir and Haris, two brothers enriched with experience in software and hardware engineering, the company addresses a pervasive problem: the outdated reliance on spreadsheets, emails, and meetings in procurement. Emir's experience developing rocket engines highlighted how inefficient procurement operations could delay critical development timelines—frustrations that Forge aims to eliminate.\n\n#### What Does Forge Do?\n\nAt its core, Forge automates and streamlines procurement operations. The product facilitates collaboration between teams and manufacturers, allowing users to track orders from initial quotes to final delivery. It also enables efficient management of purchase approvals. For businesses managing trillions in purchases, such a tool is not just beneficial—it's essential.\n\nSome features of Forge include:\n- **Collaborative Tools**: Seamlessly work with manufacturers and keep all parties informed.\n- **Order Tracking**: Monitor the progress of purchases throughout the entire process.\n- **Approval Management**: Simplify the process of purchase approvals to reduce bottlenecks.\n\n#### Building on Strong Foundations\n\nBeing part of the prestigious Y Combinator Batch W24, Forge has garnered notable support, including backing from Tom Blomfield, a distinguished Group Partner. This affiliation not only provides credibility but also opens doors to valuable networks and resources.\n\n#### A Compact Yet Powerful Team\n\nCurrent operations are powered by a small team of three dedicated employees. Their commitment and technological prowess position Forge as a nimble player in a complex industry. As businesses increasingly look for tailored solutions, Forge is setting itself up as a go-to solution provider for procurement automation.\n\n#### The Forge Experience\n\nThe website, [forgehq.com](https://www.forgehq.com/), highlights Forge’s commitment to making procurement accessible and efficient. Their platform allows users to:\n- **Create Custom Apps**: Businesses can build internal applications quickly using natural language and predefined components.\n- **Integrate Easily**: Connect with existing tools and automate workflows smoothly.\n\nAdditionally, Forge showcases a variety of use cases that can help finance, operations, supply chain, and procurement teams automate their processes.\n\n#### The Bigger Picture\n\nIn an industry where procurement inefficiencies lead to significant losses, Forge's innovative approach promises to reshape how hardware companies manage their purchasing processes. With their solution, companies can expect not just improved efficiency but also accelerated development cycles. \n\nIn a nutshell, Forge stands out as a promising new player, armed with a genuine understanding of the struggles faced by hardware companies today and the technology to overcome them. As we watch their journey unfold, the intersection of technology and procurement is sure to see interesting developments thanks to Forge.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/4530ff0f6b4e5bd0e1d2d6263653ab27c4d86120.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191348Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=5e52c8de3d320f3d0ee105655f4be82b5ab2658b936db60cee4d8f5b76fbc144",
    "social_links": [
        "https://www.linkedin.com/company/forgehq/"
    ],
    "logo_path": "data/logos\\Forge_logo.png"
}