{
    "links": "https://www.ycombinator.com/companies/formative",
    "name": "Formative",
    "headline": null,
    "batch": "IK12",
    "description": "The platform for real-time formative assessments + a free student response system for digital classrooms.  \n\nOur web-based software found at goformative.com allows live data analytics on any homework, classwork or assessment in order to help teachers, parents and schools guarantee student growth in the moments when it matters most.",
    "activity_status": "Active",
    "website": "http://www.goformative.com",
    "founded_date": null,
    "team_size": 2.0,
    "location": "Inglewood, CA",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": null,
    "founders": [
        {
            "name": "Kevin McFarland, Founder/CFO/COO",
            "description": "Founder of formative.com and lover of all things education and music. Successful exit.",
            "linkedin": "https://www.linkedin.com/in/kevinrmcfarland"
        },
        {
            "name": "Craig Jones, Founder/CEO",
            "description": null,
            "linkedin": "https://www.linkedin.com/in/craigcarterjones"
        }
    ],
    "status": true,
    "generated_description": "**Company Overview: Formative**\n\nFormative is an innovative educational technology company based in Inglewood, CA. Initially launched as a platform for real-time formative assessments and a free student response system for digital classrooms, Formative aims to empower educators with tools that enhance student engagement and learning. \n\nTheir flagship product, accessible at [goformative.com](http://www.goformative.com), is a web-based software that provides live data analytics on homework, classwork, or assessments. This allows teachers, parents, and schools to track and nurture student growth precisely when it matters most—during the learning process itself. \n\nFounded during a Y Combinator batch (IK12), Formative is a small but dedicated team of 2 employees. While some details about the company's partnerships and specific mission remain under wraps (\"nan\" indicates missing or undisclosed information), the core focus is clear: driving student success through real-time feedback and assessment.\n\nWith the education landscape rapidly evolving, particularly in digital classrooms, tools like Formative's are essential. They not only facilitate engagement but also help ensure that no student is left behind, which is a significant concern for educators today. \n\nIn summary, Formative is at the forefront of leveraging technology in education, making substantial strides towards improving formative assessment processes for better educational outcomes.",
    "logo": "/logos/medium/missing.png",
    "social_links": []
}