{
    "links": "https://www.ycombinator.com/companies/compound-writing",
    "name": "Foster",
    "headline": "A better way to write.",
    "batch": "W21",
    "description": "Community-powered writing workflow driven by some of the internet's best writers, editors, and experts.",
    "activity_status": "Active",
    "website": "https://foster.co",
    "founded_date": 2020.0,
    "team_size": 15.0,
    "location": "New York",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:productivity; location:new-york",
    "founders": [
        {
            "name": "Dan Hunt, Founder",
            "description": "Entrepreneur focused on community-powered products.\n\nBelieve in a future built by tightly aligned, tech-enabled tribes.\n\nFounded the world's largest cannabis community, MassRoots, and helped change marijuana policies in multiple states and Fortune 500s like Apple. Curated a community of NYC fitness enthusiasts for RCVR, a DTC brand in the athletic recovery space. Now building Compound Writing, a community-powered writing workflow.",
            "linkedin": "http://linkedin.com/danhuntco"
        }
    ],
    "status": true,
    "generated_description": "**Company Overview: Foster**\n\nFounded in 2020 and hailing from New York, Foster emerged out of the belief that writing can be a community-driven endeavor, where creativity flourishes in supportive environments. It’s a fresh approach to writing, catering to anyone from seasoned authors to those merely dipping their toes into the literary waters. Foster is part of Y Combinator's W21 batch, which offers a testament to its innovative potential and growth trajectory.\n\n**Mission Statement**: A better way to write.\n\n### What Does Foster Do?\n\nFoster operates as a collective of writers, editors, and creative thinkers, providing various avenues for individuals to explore and enhance their writing. At the heart of Foster’s offering are their **Writing Circles**, where members engage in structured writing sessions, drawing on community support to cultivate their craft. These circles create a space to share experiences, provide feedback, and discover new ideas—all while grounding participants in a consistent writing practice.\n\n**Key Activities**:\n1. **Weekly Writing Circles**: These 90-minute sessions invite participants to write, meditate, and connect. The sessions are designed to help writers tap into a flow state, enabling genuine expression and exploration.\n  \n2. **Bi-annual Retreats**: Twice a year, Foster organizers bring members together in serene locations, merging structured writing practice with community bonding and fun activities, like yoga and excursions.\n\n3. **Community Support**: Beyond the circles, Foster fosters interaction through WhatsApp channels, allowing members to share ideas, links, and support asynchronously.\n\n### Why Join Foster?\n\nFoster provides an antidote to the pressures often associated with writing—perfectionism and isolation. Here are compelling reasons to consider joining:\n- **Revitalize Your Writing**: Whether you're starting anew or need a spark for ongoing projects, Foster helps breath fresh air into your writing practice.\n- **Beat the Inner Critic**: In a nurturing space, you can confront and overcome barriers to genuine expression.\n- **Supportive Environment**: Collaborate and connect with other curious and creative minds; experience the communal journey of writing where everyone sees and witnesses each other’s journeys.\n\n### The Collective\n\nThe Foster community is made up of about 15 employees, alongside numerous contributors and stewards—fostering a diverse range of talents. Foundational team members include experienced writers and coaches who guide the collective, ensuring that all participants feel welcome and encouraged to express their unique voices.\n\n### Strike a Chord\n\nMembers of the Foster community speak passionately about their experiences, declaring life changes catalyzed by the program. They highlight moments of clarity, creative breakthroughs, and meaningful connections formed through shared writing practices. Foster stands as a reminder that writing doesn’t have to be a solitary endeavor—it's a communal exploration that can serve as a lifeline to creativity and self-discovery.\n\n**Interested?** Check out [Foster’s website](https://foster.co) to join a free writing circle and discover how this collective can transform your writing journey.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/73ab6369dee90baf92b774da253a8483acd57353.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191349Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=4862dd2af25f12a88966404d67886ee3ecc5851fa625fc6e0401f78c4d94e7b7",
    "social_links": [
        "https://www.linkedin.com/company/fosterwriting/",
        "https://twitter.com/FosterCoWriting"
    ],
    "logo_path": "data/logos\\Foster_logo.png"
}