{
    "links": "https://www.ycombinator.com/companies/friday",
    "name": "Friday",
    "headline": "An assistant that understands your emails and handles them for you",
    "batch": "F24",
    "description": "Email sucks. It takes forever to go through, and hiring an assistant is costly and invasive. Friday is building the assistant that learns how to predict the action that you will take on your emails, and does it for you.\r\n\nToday's email products try to help you go through your emails a little faster, but if you have to get through 1000 emails, those products doesn't do much for you. \r\n\nThe reality is, most of the emails you get don't require you to personally look at them. Friday completely eliminates the need to check those emails, and handles them all at once for you, immediately. \r\n\nFriday is here to file away spam, sift through newsletters for important tidbits, text you important notifications, and reply to mundane emails, so that no matter how many thousands of emails are in your inbox, you'll just be left with the few emails that actually require your personal touch.\r\n\nGetting this right is difficult, so everyone else settles with trying to help you go through your email twice as fast. If you want to go 100x as fast, you shouldn't spend even a second on useless emails. \r\n\nFriday gets this right, bringing the elite experience of having a professional assistant to the entire world.",
    "activity_status": "Active",
    "website": "https://www.fridaymail.ai",
    "founded_date": 2024.0,
    "team_size": 2.0,
    "location": "San Francisco",
    "group_partner": "Diana Hu",
    "group_partner_yc": "https://www.ycombinator.com/people/diana-hu",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:artificial-intelligence; industry:productivity; industry:email; industry:ai-assistant; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Allen Naliath, Founder, CEO",
            "description": "We're building the perfect virtual assistant for your email. I get rejected daily, I write great emails, and I'm a beekeeper.",
            "linkedin": "https://www.linkedin.com/in/allennaliath/"
        },
        {
            "name": "Advait Paliwal, Founder, CTO",
            "description": "We're building the perfect virtual assistant for your email. I memorized my dad's credit card to start a 6 figure reselling business and I built a viral AI tutor with 1M+ users.",
            "linkedin": "https://linkedin.com/in/advaitpaliwal"
        }
    ],
    "status": true,
    "generated_description": "**Friday: Your AI Email Assistant**\n\nFounded in 2024 and part of Y Combinator's Batch F24, Friday is on a mission to simplify your life by transforming how you manage email. If you’ve ever felt overwhelmed by the relentless tide of messages flooding your inbox, you’re not alone. Traditional email tools merely help you sift through this noise slightly faster, but minimally address the real problem: your time is precious, and most emails simply don’t deserve your personal attention.\n\nFriday steps in as an intelligent assistant that learns your preferences and predicts how you'd like to handle different emails. Instead of forcing you to wade through a sea of 1,000 messages, it smartly categorizes, replies to the mundane stuff, and even escalates important notifications directly to you. Imagine never having to check irrelevant emails again. Friday takes care of spam, filters newsletters for key content, and ensures that the only emails you interact with are critical.\n\nThis isn’t just automation; it’s a whole new way to engage with your inbox. With a lean team of just two based in San Francisco, Friday leverages advanced AI models, offering a seamless experience that integrates with popular email platforms like Gmail and Outlook. Its capabilities include tracking action items and automating routine workflows, giving you back control of your day.\n\nLet’s face it, email management shouldn’t be a major life challenge. With the elite efficiency of a professional assistant now available to everyone, Friday is redefining productivity in a connected world. So, if you're fed up with the email grind and ready to reclaim your time, check out [Friday](https://www.fridaymail.ai) and never experience email overload again.\n\n**Key Details:**\n- **Founded:** 2024\n- **Location:** San Francisco\n- **Team Size:** 2 employees\n- **Mission:** An assistant that understands your emails and handles them for you.\n- **Tags:** Artificial Intelligence, Productivity, Email, AI Assistant, San Francisco Bay Area\n- **Backed by:** Y Combinator\n- **Website:** [Friday](https://www.fridaymail.ai)",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/7673b687c2628a8faf17db10b66ea9e52c3e51a7.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191351Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=7d1130c6da01580846fed3974d30b77bdd15ed28ae2cabd3e64753a3681cf181",
    "social_links": [
        "https://www.linkedin.com/company/fridaymail/",
        "https://x.com/fridaymail"
    ],
    "logo_path": "data/logos\\Friday_logo.png"
}