{
    "links": "https://www.ycombinator.com/companies/fuse-2",
    "name": "Fuse",
    "headline": "Boosting contracted revenue for US healthcare providers",
    "batch": "S24",
    "description": "AI-powered analysis of healthcare contracts and payments to help providers detect underpayments, compare their negotiated rates, and identify opportunities to boost revenue from insurers. \r\n\nIf you know senior finance execs in health systems, partners in healthcare PE, or mid to large sized healthcare practice owners, please do connect us. We won’t waste their time: +1 628 468 3232.",
    "activity_status": "Active",
    "website": "http://www.fuseinsight.com",
    "founded_date": 2024.0,
    "team_size": 2.0,
    "location": "London, United Kingdom",
    "group_partner": "Tom Blomfield",
    "group_partner_yc": "https://www.ycombinator.com/people/tom-blomfield",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:artificial-intelligence; industry:fintech; industry:payments; industry:b2b; industry:healthcare",
    "founders": [
        {
            "name": "Sho Sugihara, Founder",
            "description": "Sho is a repeat founder. He scaled his last business to multi-million $ ARR within twelve months from launch, and eventual profitability. Before that, he worked on data analytics projects at McKinsey for some of the largest healthcare systems in the world, including the NHS and several of the top ten private healthcare insurers. He studied Social Sciences at Cambridge and Global Health at the Karolinska Institutet.",
            "linkedin": "https://linkedin.com/in/shoalexander"
        },
        {
            "name": "Oscar Wilsby, Founder",
            "description": "Oscar has built large-scale payments and credit data analytics models that outperformed incumbents like Experian by a significant margin. These models helped power the first startup he co-founded and scaled to a multi-million $ run rate. Before tech, Oscar was a post-doc researcher and completed an MEng and PhD in Machine Learning and Computational Physics at Cambridge. He’s worked in research divisions for companies like McLaren F1 and Dyson, applying machine learning to complex data problems.",
            "linkedin": "https://linkedin.com/in/oscar-wilsby-71020931"
        }
    ],
    "status": true,
    "generated_description": "**Company Summary: Fuse**\n\n**Mission:**  \nFuse aims to boost contracted revenue for U.S. healthcare providers by leveraging AI to analyze healthcare contracts and payment systems. This helps providers detect underpayments, compare negotiated rates, and uncover new revenue opportunities from insurers.\n\n**Founding and Background:**  \nFounded in 2024 and part of Y Combinator's Batch S24, Fuse is headquartered in London with a compact team of just two employees. The leadership includes Sho Sugihara, Co-Founder and CEO, who has extensive experience in healthcare financial data analytics, and Oscar Wilsby, Co-Founder and CTO, an AI expert with a strong research background.\n\n**Core Services:**  \nFuse offers various AI-powered tools to streamline administrative processes in healthcare settings, including:\n- **Patient Intake**  \n- **Benefits Verification**  \n- **Patient Fee Estimates**\n\nTheir technology is designed to reduce administrative burdens—freeing up 70% of admin time, decreasing denial rates, and ultimately improving patient satisfaction. By handling tasks like reading insurance cards, checking contracts, and calculating patient benefits, Fuse enables providers to focus more on delivering care rather than getting bogged down by repetitive tasks.\n\n**Target Market:**  \nFuse supports diverse healthcare sectors, including integrative care, behavioral health (telehealth), and specialty care. They are on the lookout for connections with senior finance executives in health systems, private equity partners in healthcare, and owners of mid- to large-sized healthcare practices.\n\n**Engagement and Contact:**  \nFor those interested in exploring Fuse's offerings or connecting with their team, they encourage outreach via their website [Fuse Insight](http://www.fuseinsight.com) or by phone at +1 628 468 3232.\n\n**Conclusion:**  \nIn a landscape where healthcare needs innovation, Fuse stands out by merging artificial intelligence with financial analytics to empower providers to optimize their revenue cycle. With patient price transparency in focus, they're poised to make a significant impact in the healthcare finance sector.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/68aacf7e801b18a3c0f81bba540755809acd1da0.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191354Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=47876d4c3f0befee4d5e0b14b527b4f4225e571df1512e326709278f3edb0517",
    "social_links": [
        "https://www.linkedin.com/company/fuseinsight/"
    ],
    "logo_path": "data/logos\\Fuse_logo.png"
}