{
    "links": "https://www.ycombinator.com/companies/future-fields",
    "name": "Future Fields",
    "headline": "We make unmakeable proteins with radical advanced biomanufacturing.",
    "batch": "S20",
    "description": "Future Fields has developed the world's first multicellular advanced biomanufacturing platform for the production of the most challenging recombinant proteins. We help companies in biotech, life sciences, and pharma by manufacturing their proteins.",
    "activity_status": "Active",
    "website": "https://www.futurefields.io/about",
    "founded_date": 2018.0,
    "team_size": 34.0,
    "location": "Edmonton, Canada",
    "group_partner": "Gustaf Alstromer",
    "group_partner_yc": "https://www.ycombinator.com/people/gustaf-alstromer",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:biotech; industry:manufacturing; industry:climate",
    "founders": [
        {
            "name": "Matt Anderson-Baron, Founder",
            "description": "I am a biotech entrepreneur with a background in the biological sciences. I am a co-founder of Future Fields, a Canadian start-up working to enable cellular agriculture commercialization through cost-effective, scalable, and custom growth media. I obtained a PhD in cell biology from the University of Alberta and was one of the first Canadian grant recipients in the field of cellular agriculture.",
            "linkedin": "http://linkedin.com/in/matthew-anderson-baron-92640315a"
        },
        {
            "name": "Jalene Anderson-Baron, Founder",
            "description": "I obtained my MA from the University of Alberta and have worked in diverse analytical capacities over the past decade, focused on environmental and social causes. I'm a critical thinker with a keen attention to detail and the ability to turn big ideas into reality. I have extensive experience in health and social research, project management, stakeholder engagement, and policy planning, implementation and advocacy.",
            "linkedin": "https://www.linkedin.com/in/jalene-anderson-baron/"
        }
    ],
    "status": true,
    "generated_description": "**Future Fields: Transforming Protein Production**\n\nFounded in 2018 and hailing from Edmonton, Canada, Future Fields is on a mission to revolutionize the biomanufacturing landscape. They stand out as the creators of the world’s first multicellular advanced biomanufacturing platform, tailored specifically for producing notoriously tricky recombinant proteins. This innovation is not just a technical marvel; it’s a game changer for industries relying on biotech, life sciences, and pharmaceuticals.\n\nThe company has made significant strides since its inception, primarily supported by its participation in Y Combinator's Summer 2020 batch. With a lean team of 34 dedicated employees, Future Fields is not just about high-tech platforms; it’s about making the \"unmakeable\" proteins a reality for their clients.\n\n**Market Focus and Sustainability**\n\nTagged under 'biotech', 'manufacturing', and 'climate', Future Fields isn't just focused on profitability; they are committed to sustainability. Their approach aims to lower the carbon footprint of protein production, aligning with broader environmental goals. This commitment is a nod to the growing demand for sustainability in every industry, particularly in biotech and pharmaceuticals.\n\n**Team and Leadership**\n\nThe company benefits from the guidance of Gustaf Alstromer, their Group Partner at Y Combinator, who helps steer their vision and strategy in this competitive field. \n\n**Key Offerings**\n\nFuture Fields provides a range of services that empower other companies in the biosciences sector. By taking the complexities out of protein production, they enable their clients to focus on what they do best, whether it’s research, development, or more novel applications of biotechnology.\n\nYou can learn more about their work and mission at [Future Fields' website](https://www.futurefields.io/about) and follow their journey as they continue to push the boundaries of what’s possible in protein manufacturing. As they grow and innovate, Future Fields is definitely a company to watch in the biotech space!",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/92926d180ab8f8a598433a233936f940313204d9.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191353Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=c4a3df0dee7259259482aed9fbb7ccf49068c76f9aff118ac2cc02dd5e22060f",
    "social_links": [
        "https://www.linkedin.com/company/future-fields-cellular-agriculture/",
        "https://twitter.com/futurefieldsHQ",
        "https://www.crunchbase.com/organization/future-fields"
    ],
    "logo_path": "data/logos\\Future_Fields_logo.png"
}