{
    "links": "https://www.ycombinator.com/companies/gale",
    "name": "Gale",
    "headline": "Stripe Atlas for immigration.",
    "batch": "W25",
    "description": "Gale makes getting a visa suck less. We’re disrupting the $50B immigration services market, starting with US H-1Bs. We've simplified the visa application process to a web form, streamlined compliance, and can integrate with HR systems - saving teams time, money and headaches. By using AI and automation we enable our lawyers to maintain quality but be 3x as efficient. This allows us to deliver a superior user experience, decrease costs and reduce visa turn-around times, giving us an advantage over traditional law firms.",
    "activity_status": "Active",
    "website": "https://getgale.app/",
    "founded_date": 2024.0,
    "team_size": 3.0,
    "location": "San Francisco",
    "group_partner": "Jared Friedman",
    "group_partner_yc": "https://www.ycombinator.com/people/jared-friedman",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:b2b; industry:legal; industry:hr-tech; industry:immigration; industry:ai; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Rahul Gudise, Founder",
            "description": "Working on overhauling the outdated immigration industry with automation and AI. Previously built Canada's first instant immigration PDF filler and automation suite. Previously worked at NVIDIA and Tesla. CS @ Waterloo.",
            "linkedin": "https://linkedin.com/in/rahulgudise"
        },
        {
            "name": "Haokun Qin, Founder",
            "description": "Coding and designing since middle school. Studied Waterloo CM, interned as MLE at Viavi, immigrated twice in the last 20 years - now building immigration automation software.",
            "linkedin": "https://linkedin.com/in/haokun-qin"
        },
        {
            "name": "Rishabh Sambare, Founder",
            "description": "Currently working on simplifying the H-1B process for startups at Gale. Studied Math & CS at the University of Waterloo. Previously built automations for Canadian immigration forms, worked on energy trading at Tesla, and improved matching algorithms for the Waterloo co-op program.",
            "linkedin": "https://linkedin.com/in/rishabhsamb"
        }
    ],
    "status": true,
    "generated_description": "**Gale: Simplifying H-1B Visa Applications**\n\n**Mission:** Gale aims to disrupt the $50 billion immigration services market, much like Stripe Atlas has for entrepreneurs. It’s focused on making the visa process less painful, particularly for H-1B visas.\n\n**What They Do:** Founded in 2024 and based in San Francisco, Gale has streamlined the visa application process into an easy online form. By integrating compliance checks and connecting seamlessly with HR systems, they save companies significant time and frustration. Leveraging AI and automation, their lawyers are able to work three times more efficiently, allowing for faster processing times and reduced costs compared to traditional law firms.\n\n**Team:** Currently, Gale operates with a compact team of three employees and has Jared Friedman as their Group Partner. This small size allows for agility and deep focus on perfecting their model.\n\n**Y Combinator:** Gale is part of the Y Combinator Batch W25, a badge that lends credibility and a network of support in the startup ecosystem.\n\n**Core Features:** \n- Easy H-1B application without the need to interact with a lawyer. \n- Free consultation to tailor the best service package for clients’ needs.\n- Generous use of technology to maintain quality while enhancing efficiency. \n\n**Why it Matters:** For businesses looking to hire international talent, navigating the immigration process can be a significant barrier. Gale looks to change that by not only simplifying the process but doing it in a way that is cost-effective and user-friendly.\n\nIf you're considering hiring talent through the H-1B process, or just curious about how it all works, Gale makes it straightforward. You can check them out at [Gale's website](https://getgale.app/) for more information, pricing, or to book a demo.\n\nIn short, Gale is on the cutting edge of immigration services, merging legal expertise with modern tech to make a historically complex process as painless as possible.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/1d08420aef1ecc3fff430da20e6af3ac36ce64fe.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191353Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=267f96702187b669e2e21b134ff60410776377bb1176ecf22bc1f2fe27b4daef",
    "social_links": [
        "https://www.linkedin.com/company/galeapp/"
    ],
    "logo_path": "data/logos\\Gale_logo.png"
}