{
    "links": "https://www.ycombinator.com/companies/gamerpay",
    "name": "GamerPay",
    "headline": "We are the marketplace for trading gaming skins & assets without scams",
    "batch": "S21",
    "description": "GamerPay is a marketplace for trading gaming skins and assets without scams. We do this by integrating with games to instantly validate all trades.\r\n\nWe launched 3 months ago and transacted 245.000 dollars growing 30% MoM. \r\n\nTalking to 5.000 gamers we learned that 46% have been scammed more than once. Over half are minors, who are stuck trading for cash on social media due to their age. \r\n\nWe are the first to build a fully compliant system for parental consent, enabling the majority of gamers to trade legally and giving the parents peace of mind.\r\n\nThere are 215 million trades annually in games we support. We make 7 dollars on average per trade. So a $1.5B initial market, growing fast alongside gaming and blockchain game economies.   \r\n\nThe team behind previously co-founded the largest transactional marketplace for secondhand high end clothes in Denmark, with 1 million users and a yearly transacted GMV north of $40 million.",
    "activity_status": "Active",
    "website": "https://gamerpay.gg",
    "founded_date": 2020.0,
    "team_size": 6.0,
    "location": "Copenhagen, Denmark",
    "group_partner": "Michael Seibel",
    "group_partner_yc": "https://www.ycombinator.com/people/michael-seibel",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:marketplace; industry:gaming",
    "founders": [
        {
            "name": "Martin Lykke Suhr, Founder",
            "description": "Generalist, coder, head of growth, paid marketing - Co-founder of GamerPay, ex. ultrarunner, farther of two.\n\nPreviously co-founded Denmarks largest transactional marketplace Trendsales. Grew it from 0 to 1 mio. users and a GMV north of 40mill dollars.",
            "linkedin": "https://www.linkedin.com/in/martingeorgesuhrmadsen/"
        },
        {
            "name": "Morten Byskov, Founder",
            "description": "Co-founder @ GamerPay and Product Lead. \nI love winning, especially peoples hearts. I'm double black belt in Karate, I never quit and I'm always on the lookout for that next challenge. My career consist of 5 years as a broker @ Maersk, 2 years as a PO @ SumUp along with a few startup failures. I'm also graduate of YC's first online Startup School (2017). Winner of Net’s Fintech Challenge, and winner of Startup Weekend. \n\nAll this has lead to you reading these lines.",
            "linkedin": "https://www.linkedin.com/in/mortenbyskov"
        },
        {
            "name": "Peter Haldbæk, Founder",
            "description": "Co-founder at GamerPay.\n\nMore than 20 years of development experience ranging from traditional web applications, backend development, fat desktop clients and native mobile apps in both corporate and startup settings.\n\nIndustry experience ranges from banking, shipping and the public sector to marketplaces in the startup space along with consulting jobs as a contractor.",
            "linkedin": "https://www.linkedin.com/in/peterhaldbaek/"
        },
        {
            "name": "Mathias Hermansen, Founder",
            "description": "Co-founder & CEO of GamerPay. Been working on marketplaces since 2013 covering various business & Product mgmt roles. Held roles as COO and most recently as CPO building Denmarks largest transactional marketplace going from 0 til $40 mio GMV.",
            "linkedin": "https://www.linkedin.com/in/mathias-hermansen-34b1b88/"
        }
    ],
    "status": true,
    "generated_description": "### GamerPay: Revolutionizing Gaming Asset Trading\n\n**Company Overview**  \nFounded in 2020 and hailing from Copenhagen, Denmark, GamerPay emerged as a solution to a common problem in the gaming world: scams in trading gaming skins and assets. Integrated directly with games, the marketplace offers a secure platform where players can transact with confidence, ensuring seamless validation of trades.\n\n**Mission and Market Need**  \nGamerPay is laser-focused on creating a trustworthy environment for trading gaming assets. In just three months since launch, they've processed an impressive $245,000 in transactions, growing 30% month-over-month. Conversations with 5,000 gamers revealed a staggering statistic: 46% of those surveyed have been scammed multiple times, with over half being minors. Many of these young traders resort to cash transactions on social media due to age restrictions. \n\nRecognizing this critical gap, GamerPay has introduced a fully compliant system for obtaining parental consent, making it easier and safer for younger gamers to trade legally while giving parents peace of mind.\n\n**Market Potential**  \nWith a massive annually supported trading volume of 215 million transactions across the games they cover, GamerPay stands to harness significant market potential. At an average fee of $7 per trade, the marketplace is eyeing a market worth around $1.5 billion. As gaming and blockchain economies continue to expand, GamerPay is well-positioned for rapid growth.\n\n**The Team**  \nThe company is powered by a talented team of six, including co-founders with prior experience in building one of Denmark's largest transactional marketplaces for high-end second-hand clothes, boasting a user base of one million and generating over $40 million in annual GMV. Their expertise and insight into marketplaces are pivotal in navigating the complex landscape of gaming assets.\n\n**Backing and Future Outlook**  \nGamerPay is part of Y Combinator's Batch S21, mentored by renowned Group Partner Michael Seibel. This affiliation not only lends credibility but also access to resources and networking opportunities essential for scaling effectively.\n\nWith the gaming landscape continually evolving, GamerPay is positioned to disrupt the market, making trading gaming skins and assets safer, easier, and more enjoyable for everyone involved.\n\n**Website**: [gamerpay.gg](https://gamerpay.gg)  \n**Tags**: Fintech, Marketplace, Gaming",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/38bd663e452374ad4c24e97a6e2639274eeb5bf2.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191354Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=2ff8b870c0c8200b5642293cdce9a22b50bc5d41919afe1799d80bb6d79783f1",
    "social_links": [
        "https://www.linkedin.com/company/gamerpayio/",
        "https://twitter.com/GamerPayGG",
        "https://www.facebook.com/gamerpay.gg",
        "https://www.crunchbase.com/organization/gamerpay"
    ],
    "logo_path": "data/logos\\GamerPay_logo.png"
}