{
    "links": "https://www.ycombinator.com/companies/garage",
    "name": "Garage",
    "headline": "Auto parts marketplace for Africa",
    "batch": "S22",
    "description": "Garage is a wholesale auto parts distributor in Africa where there are more than 2M retailers selling $25B of auto parts annually. \r\n\nWe aggregate parts from the largest suppliers in the world and deliver directly to retailers for a profit.  \r\n\nAfrica will have the 2nd most vehicle owners in the world by 2050 at 400M vehicles, who will each spend over $1000 annually on vehicle parts, with retail shops 'powered by Garage' being the backbone of all these transactions.",
    "activity_status": "Active",
    "website": "https://www.garagemobility.com/",
    "founded_date": 2021.0,
    "team_size": 54.0,
    "location": "Accra, Ghana",
    "group_partner": "Michael Seibel",
    "group_partner_yc": "https://www.ycombinator.com/people/michael-seibel",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:auto-commerce; industry:marketplace; industry:transportation",
    "founders": [
        {
            "name": "Gwanygha’a Gana, Founder",
            "description": "Gana in an ex-founder with experience building and investing in companies in the US and Africa. He holds a BS in Electrical Engineering and an MS in Data Science from Georgia Tech, and an MBA from Harvard Business School. He is a casual bartender.",
            "linkedin": "https://www.linkedin.com/in/ggana/"
        },
        {
            "name": "Cedric Foudjet, Founder",
            "description": "Cedric is an ex-founder and Venture Capitalist with experience building and investing in companies in Africa and South East Asia. Cedric is also a self-taught cloud computing  engineer with experience helping major fortune 500 companies execute digital transformations and build a new cloud native applications. On his free time he geeks over crypto and watches shows like Billions and Succession. Cedric holds a Bachelors of Science degree from Concordia College and an MBA from Wharton.",
            "linkedin": "https://www.linkedin.com/in/cedric-foudjet-0470064b/"
        }
    ],
    "status": true,
    "generated_description": "**Garage: Revolutionizing Auto Parts in Africa**\n\nGarage is not just another startup; it's part of a critical transformation in how auto parts are distributed across Africa. Founded in 2021 and nestled in the vibrant tech hub of Accra, Ghana, Garage has set its sights on becoming the go-to auto parts marketplace for the continent. With more than 2 million retailers generating a staggering $25 billion in annual sales, the potential in this space is immense.\n\nThe company initially took root as a wholesale auto parts distributor, aggregating supplies from top-tier global manufacturers to deliver directly to local retailers. This model doesn’t just streamline the supply chain; it empowers businesses across Africa by providing them with access to quality parts at competitive prices.\n\nLooking ahead, the numbers suggest that Africa will boast the second-largest number of vehicle owners worldwide by 2050—400 million vehicles, each clocking in at over $1,000 in annual spending on vehicle parts. Garage envisions itself as the backbone of this burgeoning market, with retail partners powered by its robust platform.\n\nWhat's really cool about Garage is how it leverages technology. The company has introduced a WhatsApp-based procurement system, allowing users to order auto parts directly through the app, saving time and cutting through the clutter of dealing with multiple vendors. It's efficiency and simplicity wrapped into one—perfect for the African market.\n\nAs a member of Y Combinator's Summer 2022 batch, Garage has caught the attention of some serious investors and is already trusted by over 2,000 African businesses. Their team of 54 is passionate and driven, led by notable figures like Group Partner Michael Seibel from Y Combinator. This isn't just about selling parts; it's about fostering a network of reliable transactions that can elevate the automotive industry across the continent.\n\nIn summary, Garage isn’t just another auto parts marketplace. It’s a forward-thinking player in the auto-commerce landscape, poised to capitalize on Africa’s rapid growth in vehicle ownership and spending. If you're in the auto parts space in Africa, or you just love the potential of technology to transform industries, keep an eye on Garage. You might just find that it’s the missing piece to your automotive puzzle.\n\nFor more information, check out their website: [Garage Mobility](https://www.garagemobility.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/e250fb0765be0a209ca4a5c006b70c9019b62ba1.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191354Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=ac7b680816f49ab332f3af9dcaf068a58799b39ab67cb5406bf1ae95f95954d3",
    "social_links": [
        "https://www.linkedin.com/company/garage-mobility/"
    ],
    "logo_path": "data/logos\\Garage_logo.png"
}