{
    "links": "https://www.ycombinator.com/companies/gather-2",
    "name": "Gather",
    "headline": "Building a better way to meet online.",
    "batch": "S19",
    "description": "Gather is a video chat platform designed to make virtual interactions more human. Our mission is to create opportunity and connection for everyone, no matter where they are. We do this by building the Metaverse, a virtual layer over the physical world where people can work, socialize, and learn. \r\n\nSince we launched in May of 2020, Gather has brought millions of people together. We have raised a total of $77 million in Series A and B from Sequoia Capital, Index Ventures, and more. We’re a small, friendly team based out of a state-of-the-art virtual office, where you can work whenever and wherever suits you. Come join us!\r\n\nhttps://www.fastcompany.com/90692692/gather-inclusive-metaverse-vr",
    "activity_status": "Active",
    "website": "https://www.gather.town/",
    "founded_date": 2020.0,
    "team_size": 60.0,
    "location": "San Francisco",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:metaverse; location:san-francisco-bay-area",
    "founders": [],
    "status": true,
    "generated_description": "**Gather: Bridging Virtual Connections**\n\nSince its inception in May 2020, Gather has established itself as a significant player in the realm of virtual interactions. Founded in San Francisco and an alumnus of Y Combinator's S19 batch, Gather is not just another video chat tool; it's a platform designed to humanize online meetings, making them more engaging and effective.\n\n**The Mission**  \nGather's mission is simple yet profound: \"Building a better way to meet online.\" This mission reflects a commitment to enhance connections for people everywhere—whether in professional settings, casual meet-ups, or educational discussions—by creating a unique, immersive experience reminiscent of real-world interactions. Think of it as creating a virtual layer over our physical world, an accessible Metaverse where work and play can seamlessly coexist.\n\n**The Journey So Far**  \nGather has seen impressive growth since launch, bringing millions together virtually. With a team of around 60 talented individuals, the company has successfully raised $77 million in Series A and B funding, backed by major players like Sequoia Capital and Index Ventures. This solid financial foundation supports a vision of continuous innovation and enhancement of its platform.\n\n**Why Gather Stands Out**  \nGather transforms traditional remote work dynamics by emphasizing proximity and visibility. It creates an environment where team members can communicate freely, pop by each other's 'desks,' and even engage in impromptu conversations—mimicking the natural flow of an in-person office. This approach is not just functional; it cultivates a sense of community and camaraderie among dispersed teams.\n\n**Targeted Solutions**  \nThe platform’s offerings span various use cases including virtual offices, team meetings, and social gatherings. It’s particularly beneficial for remote work, education, and even virtual conferences. The plethora of integrations, such as Slack and Google, enhances its utility, allowing users to stay connected and productive without the hassle of switching between applications.\n\n**User Testimonials**  \nThe feedback from Gather’s users underscores its impact. From CEOs to employees, users report an enhanced culture, better communication, and improved efficiency in their remote interactions. It's evident that Gather isn’t just a tool; it's become integral to how teams collaborate and thrive in diverse environments.\n\n**In Conclusion**  \nFor anyone looking to redefine their online meeting experience and foster a genuine sense of connection among remote teams, Gather is an exceptional choice. Whether you’re a startup seeking to cultivate a vibrant workplace culture or an established firm looking for innovative solutions, Gather is ready to help you bridge the gaps that distance creates.\n\nFor more information or to get started, visit [Gather Town](https://www.gather.town/).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/144a41bd697bce65b33b18c21066e0f6bb2c883a.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191354Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=79f9e74724e93d200428bd7ee58b0f20f7c07eeea53e81f494e71742bcfaa161",
    "social_links": [
        "https://www.linkedin.com/company/gathertown/",
        "https://twitter.com/gather_town",
        "https://github.com/gathertown"
    ],
    "logo_path": "data/logos\\Gather_logo.png"
}