{
    "links": "https://www.ycombinator.com/companies/gauss",
    "name": "Gauss",
    "headline": "Lower interest rates on existing credit cards",
    "batch": "W22",
    "description": "Gauss allows people with good credit scores to significantly lower interest rates on their credit cards while they keep using them. \r\n\nUsers connect their credit cards to the mobile app and get a revolving credit line in under 10 minutes. Gauss tracks and automatically pays off any expensive balance on connected cards, saving users thousands of dollars on interest charges and helping them pay off card balances faster and improve credit scores.",
    "activity_status": "Active",
    "website": "https://gauss.money",
    "founded_date": 2021.0,
    "team_size": 16.0,
    "location": "New York",
    "group_partner": "Michael Seibel",
    "group_partner_yc": "https://www.ycombinator.com/people/michael-seibel",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:consumer; location:new-york",
    "founders": [
        {
            "name": "Alex Matsenov, Founder",
            "description": "Alex is the co-founder and CEO of Gauss Money. Alex led credit at Nordea Bank and MDM Bank. He's a 3x founder, 2x YC. Alex has an advance degree in machine learning, was a late stage venture investor in the machine learning space, and is a huge fan of fundamental physics and artificial intelligence research.",
            "linkedin": "https://www.linkedin.com/in/alexmatsenov/"
        },
        {
            "name": "Abdullo Akhadov, Founder",
            "description": "Abdullo is the co-founder and COO of Gauss. He has a 17+ years management tenure in credit risk, compliance, operations, and technology with the largest financial institutions in Europe and the Asia Pacific (JPK, ASEAN, ANZ, Greater China).",
            "linkedin": "https://www.linkedin.com/in/abdulloakhadov/"
        }
    ],
    "status": true,
    "generated_description": "**Gauss** is a New York-based fintech company on a mission to lower interest rates on existing credit cards. Founded in 2021 and part of Y Combinator's Batch W22, Gauss offers a unique financial solution that allows individuals with good credit scores to significantly reduce their credit card interest rates while still using their cards.\n\nThe process is pretty straightforward: users connect their existing credit cards with the Gauss mobile app, which then provides a revolving line of credit in under 10 minutes. This innovative system tracks users' spending, automatically pays off high-interest balances, and helps them save thousands in interest charges over time. By managing payments smartly and efficiently, Gauss not only expedites the payoff process but also actively works to improve users' credit scores.\n\nGauss is led by a compact team of 16 employees, with notable support from Michael Seibel as their Group Partner. Their platform is designed for anyone who has unpaid credit card balances or uses multiple credit cards frequently. Essentially, if you’re feeling the weight of high-interest credit card debt, Gauss might be your new best friend.\n\nUsers enjoy a range of services through the app, including:\n\n1. **Lower Interest Rates**: Users can transfer high-interest balances to Gauss’s lower APR line (between 14% - 18%).\n   \n2. **Credit Building**: Tools like Gauss’s Credit Builder help improve credit scores with minimal effort—some products even require no credit checks and feature monthly payments under $5.\n\n3. **Rewards System**: By interacting with the app and making timely payments, users earn rewards points that can be used to offset fees, reduce APRs, or access premium services.\n\n4. **Automated Payments**: Users can set up autopay for their credit cards to ensure bills are paid on time, avoiding late fees and interest.\n\n5. **Personalized Plans**: The app can help users create tailored plans for debt repayment based on their financial circumstances.\n\nAs a tech company rather than a bank, Gauss positions itself as a helpful ally in managing credit card debt efficiently. It charges a small monthly subscription fee starting at $4.99, which can be canceled at any time. Gauss is particularly useful for those who struggle with multiple credit cards—making financial management less stressful and more intuitive.\n\nIn essence, if you’re dealing with the chaos of credit card debt and looking for a streamlined solution, Gauss offers a compelling approach that blends technology with personal finance. Check them out at [Gauss Money](https://gauss.money).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/8b3e33bee85fba09fd0a0bd4db3cb221935b9473.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191354Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=2a070f800798a18d3e563d2b7c7fa2fedbef37f9d96ce1f8efce76f8ad6352b8",
    "social_links": [],
    "logo_path": "data/logos\\Gauss_logo.png"
}