{
    "links": "https://www.ycombinator.com/companies/gem",
    "name": "Gem",
    "headline": "Talent engagement platform",
    "batch": "S17",
    "description": "Gem’s talent engagement platform helps recruiting teams use data and automation to improve hiring speed, quality, and diversity.\r\n\nGem unifies data and context from the tools recruiters use every day, including email, applicant tracking systems, LinkedIn, and other social networks, to create a source of truth for all talent relationships. Armed with insights about the entire recruiting process, automation to reach out to talent at scale, and true cross-functional collaboration tools, TA teams can proactively and strategically plan for what’s ahead.\r\n\nGem's customers are savvy recruiting teams from industry-leading companies — like Wayfair, Dropbox, Nasdaq, Cisco, and Doordash — who understand that hiring the best talent in the market is key to maintaining their competitive advantage.",
    "activity_status": "Active",
    "website": "https://www.gem.com/",
    "founded_date": 2017.0,
    "team_size": 200.0,
    "location": "San Francisco",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:saas; industry:b2b; industry:recruiting; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Steven Bartel, Founder/CEO",
            "description": "Co-founder & CEO @ Gem. Prior to founding Gem, Steve was an engineering leader at Dropbox where his experience working closely with the recruiting process allowed him to see the lack of technology in the space. This inspired him to co-found Gem, which allows recruiting teams of all sizes to source talent, engage with talent, and use data to improve recruiting processes.",
            "linkedin": "https://github.com/sbartel"
        }
    ],
    "status": true,
    "generated_description": "**Company Overview: Gem**\n\n- **Founded:** 2017\n- **Location:** San Francisco, CA\n- **Team Size:** Approximately 200 employees\n- **Funding:** Part of Y Combinator Batch S17\n- **Website:** [Gem](https://www.gem.com/)\n- **Group Partner:** Nan\n\n**Mission:**\nGem is a talent engagement platform designed to enhance recruiting efforts by leveraging data and automation. Its primary goal is to improve hiring speed, quality, and diversity within recruiting teams.\n\n**What They Do:**\nAt the core of Gem’s offerings is a powerful platform that integrates data from various recruiting tools—think email, applicant tracking systems, LinkedIn, and numerous social networks. This unified data creates a \"source of truth\" for organizations, enabling talent acquisition (TA) teams to build stronger relationships with potential hires. Gem empowers recruiters to not only react but also plan strategically for the future, providing insights and automation to facilitate outreach to talent at scale.\n\n**Customer Base:**\nGem's clientele includes high-profile companies like Wayfair, Dropbox, Nasdaq, Cisco, and DoorDash. These organizations recognize that attracting top talent is critical for maintaining their competitive edge in the market. More than 1,200 TA teams trust Gem to streamline their hiring processes.\n\n**Key Features:**\n1. **AI-First Recruiting Software:** Gem is marketed as an all-in-one recruitment platform that integrates applicant tracking systems (ATS), sourcing, CRM, scheduling, and analytics—all powered by AI.\n  \n2. **Workflow Automation:** Their platform offers automation for various functions such as sourcing and outreach, inbound application review, and interview scheduling.\n  \n3. **AI Enhancements:** With features like AI-powered outbound sourcing, application review, and talent rediscovery, Gem helps teams find and engage candidates more effectively.\n\n4. **Diverse Solutions:** Gem caters to startups as well as Fortune 500 companies, allowing organizations to select and integrate only the tools they need.\n\n5. **End-to-End Analytics:** This functionality helps teams visualize their recruiting efforts and performance, extracting actionable insights to continually refine their strategies.\n\n**Results Driven:**\nCompanies utilizing Gem often report significant improvements in recruiting efficiency. For instance, many have experienced reductions in time-to-hire, increased productivity for recruiters, and substantial cost savings.\n\n**Why Gem?**\nGem is designed for usability, minimizing the learning curve for recruiters. This means teams can focus more on making hires rather than getting bogged down in tech headaches.\n\nIn summary, Gem is reshaping the way companies approach talent acquisition with its AI-driven, unified platform that not only streamlines processes but enhances the quality and diversity of hires. For any recruitment team looking to regain a competitive edge in a challenging talent market, exploring Gem's capabilities might be a vital step.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/f0466717b936b51c650a494397292bfb91690d22.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191355Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=63038462d76b4913cf3e8b8124a75fea1f6d9bdf6a4105315ff95627d9428fcc",
    "social_links": [
        "https://www.linkedin.com/company/gem-recruiting-software",
        "https://twitter.com/Gem_Software",
        "https://www.facebook.com/GemRecruitingSoftware/",
        "https://www.crunchbase.com/organization/gem-software"
    ],
    "logo_path": "data/logos\\Gem_logo.png"
}