{
    "links": "https://www.ycombinator.com/companies/gen1e-lifesciences",
    "name": "GEn1E Lifesciences",
    "headline": "AI platform accelerating therapies for rare & inflammatory diseases.",
    "batch": "S19",
    "description": "GEn1E Lifesciences is a Clinical-stage, multi-target company with a unique AI platform. We develop novel, next-generation, immunomodulatory therapies for rare & inflammatory diseases with no effective treatments. Our team is supercharging the drug development cycle by applying AI to multiple-mechanism-of-action protein targets and their natural platform capabilities—creating novel therapeutics at an unprecedented pace. Our AI platform has enabled us to develop a purpose-built therapy for ARDS to reduce its $20 billion cost on society (just in the USA). \r\n\nGEn1E has built a rich pipeline of 21+ novel and selective immunomodulators and has plans to accelerate 2 additional devastating diseases (beyond their lead indication) to IND in the next 12 months. Our AI platform enables tremendous pace and capital efficiency as demonstrated by our progress in ~2 years with seed capital—a stark contrast to the typical spend of $100M+ and 7+ years exhibited in the pharmaceuticals / biotech industry.\r\n\nWith ~90% of rare diseases having no therapeutic treatment at all, GEn1E is taking a giant swing that will hopefully bring life-saving therapies to the lives of patients in need.\r\n\nThe team at GEn1E has decades of experience in drug development and machine learning. We graduated from YCombinator and Stanford-StartX in late 2019. We are based in Palo Alto, CA.",
    "activity_status": "Active",
    "website": "https://www.gen1e.com",
    "founded_date": 2018.0,
    "team_size": null,
    "location": "Palo Alto",
    "group_partner": "Jared Friedman",
    "group_partner_yc": "https://www.ycombinator.com/people/jared-friedman",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:artificial-intelligence; industry:biotech; industry:healthcare; industry:drug-discovery; location:san-francisco-bay-area",
    "founders": [],
    "status": true,
    "generated_description": "GEn1E Lifesciences is an ambitious biotech startup that launched in 2018, born from the roundtable discussions of Y Combinator's S19 batch and fueled by a mission that's both noble and urgent: to accelerate the development of therapies for rare and inflammatory diseases through an innovative AI platform. Based in Palo Alto, California, GEn1E has quickly positioned itself as a clinical-stage, multi-target company that’s making waves in the drug discovery arena.\n\n### The Mission \nAt its core, GEn1E is dedicated to finding effective treatments for diseases that, as it stands, have none—an alarming statistic that applies to around 90% of rare diseases. Their focus on immunomodulatory therapies aims to change that narrative. By applying advanced AI technologies, GEn1E is not just speeding up the drug development process; it’s doing so with a brisk efficiency that shatters the norms of the industry, often characterized by $100 million budgets and 7-year timelines.\n\n### The Technology \nGEn1E's proprietary AI platform, GRID™, stands out by harnessing a wealth of curated data that seamlessly interlinks genes, proteins, and disease pathways to identify promising therapeutic targets. This allows them to pinpoint new binding sites for drug development—an approach that has led them to identify 21+ first-in-class compounds and move at a dizzying pace from early discovery to Phase 2 clinical trials in just two and a half years. They’ve developed targeted therapies such as their ARDS-specific treatment, sharply aimed at reducing a staggering $20 billion societal cost in the U.S. alone.\n\n### The Pipeline \nCurrently, GEn1E boasts a pipeline with an impressive array of novel therapeutics. They have key programs targeting multiple inflammatory disease pathways using their cutting-edge p38α:MK2 Dual Signal Modulators, among other innovative compounds. In the next year, they plan to fast-track two additional disease targets toward Investigational New Drug (IND) application status.\n\n### The Team \nLed by a seasoned team with extensive experience in drug development and machine learning, GEn1E combines expertise to bridge the gap between technology and therapeutic innovation. Their board recently welcomed François Nader, MD, further bolstering their strategic direction.\n\n### Conclusion\nGEn1E Lifesciences is not just another company in the healthcare space. It embodies a forward-thinking approach that leverages AI to tackle some of medicine's toughest challenges. By focusing on precision therapies for inflammatory and rare diseases, GEn1E is positioned not only to innovate but to transform the lives of patients facing profound health struggles. Keep an eye on this company as it navigates the complexities of drug development and delivers on its promise to improve global healthcare—one therapy at a time. \n\nFor more information, you can visit [GEn1E Lifesciences](https://www.gen1e.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/cce0d8631131696c31be79c0620bf3fb37d381b2.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191355Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=9b6d2e55a8922fbc6c950cb78fbeadc75c92833b4b4b04e64a1daca447e9b5a3",
    "social_links": [
        "https://www.linkedin.com/company/gen1e-lifesciences/",
        "https://twitter.com/GEn1ELifesci",
        "https://www.crunchbase.com/organization/gen1e-lifesciences"
    ],
    "logo_path": "data/logos\\GEn1E_Lifesciences_logo.png"
}