{
    "links": "https://www.ycombinator.com/companies/genuity",
    "name": "Genuity",
    "headline": "SaaS Platform to manage IT and buy business software",
    "batch": "S21",
    "description": "Genuity is a one-stop-shop for companies to manage IT and buy business software. Companies use Genuity to keep track of all the company laptops, manage employee support requests, and buy software at wholesale prices.",
    "activity_status": "Active",
    "website": "https://gogenuity.com/",
    "founded_date": 2017.0,
    "team_size": 31.0,
    "location": "Chicago, IL",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:saas; industry:enterprise-software",
    "founders": [
        {
            "name": "Colum Donahue, Founder",
            "description": "I’m a serial entrepreneur with a history of building technology companies that have collectively done over $1b in revenue. Previously the co-founder of GlobalNet International, a NASDAQ publicly traded telecommunications company purchased by the Titan Corporation, an NYSE defense company, and the founder of Visseo, Inc., a leading Voice-over-IP provider that completed millions of phone calls daily for the world’s biggest telecom companies and earned company investors a 12X return.",
            "linkedin": "https://www.linkedin.com/in/colum-p-donahue/"
        },
        {
            "name": "Jason Noble, Founder",
            "description": "Got my technology start as an IT Specialist in the United States Navy. Technology expert with experience ranging from Enterprise/Government networks to the challenges faced by SMBs managing and implementing tech. Previously the Chief Operating Officer of Xerillion and the Founder of Stratum, Inc. Currently, the Co-Founder of Genuity (gogenuity.com), empowering businesses with technology through software and community.",
            "linkedin": "www.linkedin.com/in/jason-noble-chicago"
        },
        {
            "name": "Zaeem asif, Founder",
            "description": "I am a programmer specializing in web development with almost 2 decades of software development experience and over 50k contributions on Github alone. I have a bachelor’s degree in computer science from LUMS and received my master’s from Stanford, I have also led the team that built the enterprise application integration tier for the largest telecom operator, VEON, serving millions of network messages every second between different enterprise systems.",
            "linkedin": "https://www.linkedin.com/in/zaeem-asif/"
        }
    ],
    "status": true,
    "generated_description": "### Genuity: Simplifying IT Management for Businesses\n\n**Overview**  \nFounded in 2017 and based in Chicago, Genuity emerged from Y Combinator's Batch S21 as an innovative solution to streamline IT management and software procurement for businesses. With a 31-member team, Genuity positions itself as a one-stop-shop for companies seeking to manage their IT needs effectively while purchasing software at wholesale prices.\n\n**Mission**  \nGenuity’s mission is clear: to provide a comprehensive SaaS platform that simplifies the management of IT assets and software procurement. The platform enables organizations to keep track of laptops, manage employee support requests, and acquire software affordably.\n\n**Core Offerings**  \nGenuity's offerings can be grouped into several key areas:\n\n1. **IT Solutions**:\n   - **Microsoft Solutions**: Simplified licensing options, including feature matrices and premier support.\n   - **Security Solutions**: A range of services covering device compliance, email protection, endpoint security, and more to protect companies from cyber threats.\n\n2. **The Wingman Experience**: Acting as an IT partner, Genuity provides managed services (ITaaS), telecom and VoIP solutions, business software access, cyber security, and cloud solutions.\n\n3. **Technology Management**: Tools for managing SaaS and vendor spending, contract management, IT asset management, and a help desk module for streamlined support operations.\n\n4. **Marketplace**: A hub to source, spend, and save on IT needs, Genuity negotiates with suppliers to leverage collective purchasing power, promising lower prices for its members.\n\n**Key Features**  \n- **Ease of Use**: Genuity simplifies complex IT operations, making life easier for tech leaders.\n- **Comprehensive Management Tools**: Integrated applications for technology management, spending analysis, and asset oversight.\n- **Community Power**: Access to a large network empowers customers by providing competitive pricing that traditional approaches can't match.\n\n**Pricing and Accessibility**  \nGenuity's subscription model starts at an affordable $29.99 per month per company, acknowledging the challenges smaller firms face in IT budgeting without hidden fees or complex terms. They even offer a 30-day free trial for interested businesses.\n\n**Conclusion**  \nIn a world where IT complexities continue to grow, Genuity stands out as a powerful ally for companies aiming to take control of their technology infrastructure and spending. Whether for IT professionals, finance departments, or executive leadership, Genuity presents solutions that enable informed decision-making and cost efficiency—making it a compelling choice for modern businesses looking to optimize their IT management.\n\nFor a closer look at how Genuity can transform your business's IT infrastructure, visit their website at [gogenuity.com](https://gogenuity.com/).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/d60f4e2197abdfeca4458f1c4cc948dd74436c95.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191356Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=37a3e229237a308294fb330d555352657a165fd8db94a3c07a7266e72734eea1",
    "social_links": [
        "https://www.linkedin.com/company/gogenuity",
        "https://twitter.com/gogenuity",
        "https://www.facebook.com/gogenuity/",
        "https://www.crunchbase.com/organization/genuity-a9ae"
    ],
    "logo_path": "data/logos\\Genuity_logo.png"
}