{
    "links": "https://www.ycombinator.com/companies/getcrux",
    "name": "GetCrux",
    "headline": "AI Creative Strategist",
    "batch": "W24",
    "description": "GetCrux is the AI Creative Strategist to launch winning ads.\r\n\nCreatives have become the biggest lever to win on ad platforms. Yet, there is no clear way to figure out why something works. Marketers end up guessing and replicating the best performing ad, only to see it fail - with high CAC & wasted dollars.\r\n\nGetCrux helps performance marketers find winning patterns in their ad creatives across 100+ parameters like hooks, messaging, storyline, music, pacing, and recommend exactly what to launch next.",
    "activity_status": "Active",
    "website": "http://getcrux.ai/",
    "founded_date": 2022.0,
    "team_size": 9.0,
    "location": "San Francisco",
    "group_partner": "Harj Taggar",
    "group_partner_yc": "https://www.ycombinator.com/people/harj-taggar",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:saas; industry:analytics; industry:marketing; industry:automation; industry:ai; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Himank Jain, Co-Founder and CEO",
            "description": "Himank is the co-founder and CEO at GetCrux. He has previously worked at J&J as an ML Engineer, leading the NLP initiatives to automate sales transcript and was a data consultant at PwC. \n\nHimank has graduated from IIT Bombay. During his college time, he headed Mood Indigo which is Asia's largest student-led festival. It attracts artists from 25+ countries and 140K+ visitors nationwide and has raised $500K in capital from global brands. \n\nExcited about space, spirituality and sports!",
            "linkedin": "https://linkedin.com/in/himank1"
        },
        {
            "name": "Atharva Padhye, Founder",
            "description": "Atharva is a co-founder at getcrux. Prev a Renewable Energy Engg grad at IIT Bombay. Started Crux while in college and dropped a management consulting job offer at Bain & Co. Prev worked on Risk Analytics at Citibank.\n\nWhile in college, I headed Mood Indigo (Asia's largest college festival) where we built the first-ever metaverse for colleges - a 3D experience to explore live events on the campus that brought in 100K viewership in 2 days.\n\nAvid interest in music & international cuisines.",
            "linkedin": "https://linkedin.com/in/atharvapadhyecrux"
        },
        {
            "name": "Prabhat Singh, Founder",
            "description": "Hi! I'm Prabhat, Co-founder of getcrux.ai. I completed my bachelor's at IIT Bombay. Previously, I co-founded a social initiative, Eduride, which helped over 1000 applicants reach their exam centers during COVID-19. I'm passionate about AGI, game design, fintech, and sports.",
            "linkedin": "https://linkedin.com/in/prabhat7758"
        }
    ],
    "status": true,
    "generated_description": "**GetCrux: Your AI-Powered Creative Strategist for Ads**\n\nFounded in 2022 and currently a part of Y Combinator's W24 batch, GetCrux is shaking up the marketing landscape from San Francisco. The company aims to enhance the effectiveness of advertising campaigns using an AI Creative Strategist that helps performance marketers optimize their ads based on data rather than guesswork.\n\n### The Problem at Hand\nAs any marketer knows, advertising success hinges largely on creative content. However, deciphering the ingredients of a winning ad can feel like chasing shadows. Marketers often find themselves replicating previously successful ads, only to face dismal performance and rising customer acquisition costs (CAC). Enter GetCrux, a tool designed to eliminate the guesswork by analyzing ad creatives across over 100 parameters—from messaging to pacing and beyond.\n\n### What Does GetCrux Do?\nGetCrux empowers marketers by identifying winning patterns in their ad creatives, offering actionable insights into what works best. Here are a few vital capabilities:\n- **Deep Analysis**: Examine every pixel to understand why certain ads resonate.\n- **Creative Fatigue Insights**: Detect when an ad is running out of steam, ensuring marketing budget optimization.\n- **Next Steps Recommendations**: Get data-driven suggestions on what to launch next, aligning with brand identity.\n\n### The Team and Vision\nWith a dedicated team of nine employees and local backing from Y Combinator, GetCrux is led by Harj Taggar as the Group Partner. Their mission is straightforward: to craft a repeatable formula for winning ads, thereby eliminating the uncertainty that plagues many marketing teams.\n\n### Partnerships and Recent Success\nBacked by a successful $2.6 million seed round, GetCrux is already making waves in the performance marketing space, focusing on automation, analytics, and AI. Clients can start with a 30-day free trial, providing them a risk-free way to tap into AI-driven marketing insights. \n\n### Ready to Join the Revolution?\nIf you're tired of flying blind in your advertising campaigns and want a tool that can not only predict outcomes but also enhance your creative process, GetCrux might just be the answer. You can find more information and request a demo on their website: [GetCrux.ai](http://getcrux.ai/).\n\nIn a world where marketing budgets are stretched thin and ad performance can be a roller coaster, GetCrux stands out as a beacon of clarity and efficiency. By utilizing AI to harvest insights from your ads, they promise to keep your performance targets not just within reach, but achievable.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/df3e286fa7f108fb1f62f31620123c02bfdb0a60.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191356Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=056c892569710eae068d0b0236dc42fb4d4dd2e5da1db0c47540364988d1b400",
    "social_links": [
        "https://www.linkedin.com/company/getcruxai/",
        "https://x.com/getcruxai",
        "https://www.crunchbase.com/organization/crux-7f13"
    ],
    "logo_path": "data/logos\\GetCrux_logo.png"
}