{
    "links": "https://www.ycombinator.com/companies/gigs",
    "name": "Gigs",
    "headline": "Stripe for phone plans.",
    "batch": "W21",
    "description": "At Gigs, we're building the operating system for mobile services - a platform that enables tech companies to seamlessly embed connectivity into their products.\r\n\nJust as Stripe enables businesses to embed a payment button into any product, Gigs enables businesses to add a connect button and issue SIMs with a single click or API call. From fintechs launching mobile services to HRIS platforms offering work phone plans, we automate phone plan provisioning.\r\n\nWe're solving complex technical, operational and regulatory challenges to make connectivity truly effortless. We've grown to a team of around 90 people across the US and Europe, bringing together an experienced team of early-stage engineers, product builders and business athletes from companies like Stripe, Airbnb and Shopify. We know what it takes to solve hard problems.\r\n\nWith almost $100MM in funding from Ribbit Capital, Google and Y Combinator, Gigs is one of the fastest growing tech companies. Building on our strong foundation, we’re looking for exceptional candidates who want to do the best work of their lives in a high-paced environment, surrounded by a highly talented, ambitious team.\r\n\nYou’ll be joining at an exciting inflection point in our company’s history. At sub-100 people and with a year of hyper-growth ahead of us, opportunity is abundant.",
    "activity_status": "Active",
    "website": "https://gigs.com",
    "founded_date": 2020.0,
    "team_size": 90.0,
    "location": "San Francisco",
    "group_partner": "Dalton Caldwell",
    "group_partner_yc": "https://www.ycombinator.com/people/dalton-caldwell",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:saas; industry:hr-tech; industry:api; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Hermann Frank, Co-founder, CEO",
            "description": "Co-Founder, CEO - Gigs",
            "linkedin": "https://www.linkedin.com/in/hermannfrank"
        },
        {
            "name": "Dennis Bauer, Founder",
            "description": "Co-founder, Gigs",
            "linkedin": "https://www.linkedin.com/in/dennisjbauer/"
        }
    ],
    "status": true,
    "generated_description": "**Company Summary: Gigs**\n\n**Mission:** Gigs positions itself as \"Stripe for phone plans,\" aiming to streamline the way businesses embed mobile connectivity into their offerings. \n\n**Overview:** Founded in 2020 as part of the Y Combinator Batch W21, Gigs started with a simple premise: to build the operating system for mobile services. They’ve successfully created a platform that allows tech companies to integrate connectivity into their products with remarkable ease—imagine adding a connect button that issues SIM cards with just one click or API call.\n\n**Team:** With a current team of about 90 employees, Gigs is notable for its diversity in expertise, drawing talent from heavyweights like Stripe, Airbnb, and Shopify. Their collective experience equips them to tackle the complex technical, operational, and regulatory hurdles intrinsic to mobile connectivity.\n\n**Funding:** The company has raised nearly $100 million from prominent investors such as Ribbit Capital, Google, and Y Combinator, underscoring its status as one of the fastest-growing tech companies in the sector.\n\n**Product Offerings:** Gigs provides an integrated suite of telecom products that enable businesses to launch their embedded wireless services. Key features include:\n- **Connect:** A plug-and-play hosted checkout for wireless plans.\n- **Payments:** An embedded multi-currency payments suite.\n- **Operator:** A conversational AI assistant designed specifically for telecom.\n- **Dashboard:** A powerful cockpit for managing connectivity and subscriptions.\n- **API:** A best-in-class, multi-carrier telecom API.\n\nTheir solutions cater to various sectors, including fintech, HR tech, and broadband, allowing clients to offer services like employee phone plans, travel SIMs, and combined broadband/mobile packages.\n\n**Growth Potential:** Positioned at a pivotal moment in its evolution, Gigs aims to leverage its foundation for hyper-growth over the next year. With a remote-first culture and hubs in major cities like San Francisco, London, and Berlin, Gigs is on the lookout for exceptional talent ready to tackle big challenges.\n\n**Why Gigs Stands Out:** Unlike traditional telecom operations, which involve lengthy and costly setups, Gigs offers a streamlined model that can result in a positive ROI right out of the gate. This shift enables companies to focus on innovation and customer experience rather than navigating intricate telecom logistics.\n\n**Website:** For more information, visit [gigs.com](https://gigs.com).\n\nIn short, Gigs is not just about connectivity; it's about empowerment—empowering businesses to enhance their offerings without the usual pain points associated with telecom services. If you're looking to embed mobile services seamlessly, Gigs might just be the way forward.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/27610c20242b6dfb697115350fccfb9dfd968963.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191357Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=7c4ca3955862e1cd6954d6ff16ac4dce9e45ccc3dd077ca32f598fbe4ad34d8f",
    "social_links": [
        "https://www.linkedin.com/company/meetgigs",
        "https://www.twitter.com/gigstel"
    ],
    "logo_path": "data/logos\\Gigs_logo.png"
}