{
    "links": "https://www.ycombinator.com/companies/gigwell",
    "name": "Gigwell",
    "headline": "Building the Future of Live Event Bookings.",
    "batch": "W16",
    "description": "Gigwell is building the future of live event bookings.  \r\n\nOur platform is trusted by over 80,000 touring artists and venues using Gigwell to streamline the booking process -from managing booking requests to handling electronic contracts and online payments. We have facilitated over $3B in gigs on our platform, in verticals ranging from DJs & Musicians to Public Speakers and Comedians. Leveraging a network of thousands of industry professionals and talent buyers, Gigwell is hyper-tailored to the workflow of a $200B industry that still operates on Excel spreadsheets and Word documents. \r\n\nGigwell is the first integrated, vertical SaaS platform that integrates end-to-end workflow automation for artists, booking, and management agencies. We provide a simple solution for managing artist logistics, collecting and tracking payments electronically, negotiating contracts and talent availabilities, and monitoring revenue goals.\r\n\nGigwell has been featured in TechCrunch, Billboard, DJ Mag, Hypebot, DJ Times, and Magnetic Mag and awarded the most promising startup from Nitey Awards and SF MusicTech’s StartUp Innovators Challenge.",
    "activity_status": "Active",
    "website": "https://www.gigwell.com",
    "founded_date": 2014.0,
    "team_size": 12.0,
    "location": "Los Angeles, CA",
    "group_partner": "Michael Seibel",
    "group_partner_yc": "https://www.ycombinator.com/people/michael-seibel",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:marketplace; industry:saas; industry:entertainment; location:los-angeles",
    "founders": [
        {
            "name": "Jeremie Habib, Founder/CEO",
            "description": "Jeremie Habib is the Co-Founder and CEO of Gigwell, a digital booking platform that streamlines the booking process between live entertainers and event venues. The company has streamlined over $1.5B in gigs for DJs, musicians, comedians, and public speakers. Prior to launching Gigwell, Jeremie held senior Sales & BD positions at Cisco and several early-stage SaaS companies like OpenDNS where he helped grow the company from 0 - $100 m in revenue.",
            "linkedin": "https://www.linkedin.com/in/jeremiehabib/"
        },
        {
            "name": "Glade Luco, Founder/CTO",
            "description": null,
            "linkedin": "https://www.linkedin.com/in/gladeluco"
        },
        {
            "name": "Antonio Sierra, Founder/Vice President, Customer Success",
            "description": null,
            "linkedin": "https://www.linkedin.com/in/antonioasierra"
        }
    ],
    "status": true,
    "generated_description": "**Gigwell: Revolutionizing Live Event Bookings**\n\nFounded in 2014 and hailing from the vibrant city of Los Angeles, Gigwell is transforming the landscape of live event bookings. Their mission, simply put, is to build the future of booking in a $200 billion industry that has been lagging behind the tech curve, still heavily relying on Excel spreadsheets and Word documents.\n\nWhat Gigwell brings to the table is their integrated platform trusted by over 80,000 touring artists and venues. The result? An astonishing $3 billion in gigs facilitated through their system, covering a vast array of talent from DJs and musicians to public speakers and comedians. This makes them a vital resource for those involved in any form of live entertainment.\n\n**The Unique Offering**\n\nBeing the first integrated vertical SaaS platform in this space, Gigwell provides a comprehensive suite of tools that streamline the booking process. The platform covers everything from managing booking requests and handling electronic contracts to managing online payments. Their features include:\n\n- **Productivity Suite**: An all-in-one tool to simplify the logistics of booking, saving time and effort.\n- **Tour IQ**: A resource for agents and artists to identify new gigs and key industry contacts quickly.\n- **Ticket Counts Pro**: Automates ticket tracking, delivering meaningful analytics without manual effort.\n\nThe beauty of Gigwell is that it removes the headache of administrative tasks, enabling artists and agents to focus on what they do best—creating and performing. \n\n**Recognition and Growth**\n\nGigwell's innovative approach hasn’t gone unnoticed. The company has received accolades from various reputable publications like TechCrunch and Billboard, along with awards such as the Most Promising Startup at the Nitey Awards. It's also part of the prestigious Y Combinator Batch W16, a stamp of approval that highlights its potential for growth and impact.\n\nWith a dynamic team of 12 employees and under the guidance of Michael Seibel, Gigwell is poised for continued success. \n\n**Get in Touch**\n\nFor those in the live event industry looking to elevate their booking experience, Gigwell promises not only efficiency but a new way of thinking about artist management and revenue tracking. If you’re ready to ditch the spreadsheets and embrace a streamlined future, head over to their [website](https://www.gigwell.com) and check out what they can offer.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/0552478042fcfdbea2b8585a576a5394c543e1d2.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191357Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=f5be753369d89db13d551235e35741ba9c03b6d4ad74b82187af31a0b2264197",
    "social_links": [
        "https://www.linkedin.com/company/gigwell",
        "https://twitter.com/gigwellofficial",
        "https://www.facebook.com/gigwell",
        "https://www.crunchbase.com/organization/gigwell-2",
        "https://github.com/gigwell"
    ],
    "logo_path": "data/logos\\Gigwell_logo.png"
}