{
    "links": "https://www.ycombinator.com/companies/givemetap",
    "name": "GiveMeTap",
    "headline": "We produce & sell stainless steel water bottles that enables peopleâ\u0080¦",
    "batch": "W15",
    "description": "GiveMeTap is a social enterprise. Our mission is to make clean drinking water available to everyone, everywhere.\r\n\nWe create stainless steel water bottles, and each bottle funds 5 years of clean water for someone in Africa. When you get a GiveMeTap bottle, you also have access to the free-water network of cafes and shops who give free tap water to people on the go. No questions, no hassle.\r\n\nWe build water projects in remote villages and elect a water committee to run the maintenance of the water. So far we have made an impact in Namibia, Malawi, and Ghana to bring clean water for the first time.\r\n\nWe like to think of this as â\u0080\u0098Water for You, Water for Everyoneâ\u0080\u0099.\r\n\nWe help awesome companies create custom bottles for their staff, customers, and events so that they can stay hydrated, reduce plastic waste and help fund water projects. Our partners include:\r\n\nDeloitte\r\nHSBC\r\nYCombinator\r\nGoogle\r\nTED\r\nFlexport\r\nLegal & General\r\nRichard Branson's The Lodge, Switzerland\r\nCambridge University \r\n\nWant to get your company involved? Visit http://bit.ly/2j2Ef64\r\n\nWater for you. Water for everyone.",
    "activity_status": "Active",
    "website": "http://givemetap.com",
    "founded_date": 2011.0,
    "team_size": 1.0,
    "location": "London, United Kingdom",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:sustainability",
    "founders": [],
    "status": true,
    "generated_description": "**GiveMeTap: Redefining Hydration with a Purpose**\n\nFounded in 2011 and notable for being part of Y Combinator's Batch W15, GiveMeTap is a London-based social enterprise on a mission to ensure clean drinking water is available to everyone, everywhere. They achieve this through a simple yet effective approach: every stainless steel water bottle sold funds five years of clean water for someone in Africa. \n\nWhen you purchase a GiveMeTap bottle, you not only contribute to a noble cause but also gain access to their free-water network. This network includes cafes and shops committed to providing complimentary refills to bottle owners, making hydration on the go easy and accessible—sans the guilt of single-use plastic.\n\n**Impact and Reach**\n\nWith projects established in Namibia, Malawi, and Ghana, GiveMeTap has already improved the lives of over 116,391 people by giving them access to clean water for life. Their philosophy is “Water for You, Water for Everyone,” which underscores a commitment to sustainability. The company operates with a model where 20% of their revenue directly benefits these water projects, reflecting a robust focus on social impact over profit.\n\nThey’ve partnered with some impressive names—including Deloitte, HSBC, Google, and Richard Branson's The Lodge in Switzerland—helping businesses customize bottles for their teams and events. This not only promotes a more sustainable work culture but also helps in reducing plastic waste.\n\n**Sustainability at the Core**\n\nGiveMeTap’s stainless steel bottles are a durable alternative to plastic, contributing to a significant reduction in plastic waste. Their mission aligns well with the growing global awareness around environmental sustainability.\n\nIn a nutshell, GiveMeTap is not just selling water bottles; they are fostering a movement towards conscious consumption and social responsibility. Their commitment is clear: hydrate yourself while uplifting communities in need. So, if you're looking to make a purchase, or simply want to explore their offerings, head over to [GiveMeTap's website](http://givemetap.com) and join them on this journey of hydration with purpose.",
    "logo": "/logos/medium/missing.png",
    "social_links": [
        "http://www.facebook.com/givemetap",
        "https://www.crunchbase.com/organization/givemetap"
    ]
}