{
    "links": "https://www.ycombinator.com/companies/glitzi",
    "name": "Glitzi",
    "headline": "At-home spa, beauty & grooming services marketplace for LatAm",
    "batch": "S21",
    "description": "Glitzi provides at-home spa, beauty and grooming services for people in Latin America. We do this by connecting you to our network of high quality masseuses, manicurists and barbers.",
    "activity_status": "Active",
    "website": "https://glitzi.com.mx/",
    "founded_date": 2019.0,
    "team_size": 33.0,
    "location": "Mexico City, Mexico",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:marketplace; industry:beauty; industry:health-&-wellness",
    "founders": [
        {
            "name": "Ana Ramos, Founder",
            "description": "CEO & Co-founder at Glitzi. \nEarly stage VC investor turned entrepreneur to help latin americans access good quality wellness, beauty and grooming services at-home when they need them.",
            "linkedin": "https://www.linkedin.com/in/ana-ramos-b2681a32/"
        },
        {
            "name": "Luis Enrique Vazquez, Founder",
            "description": "Luis is a programmer who for a long time was focused on the development of mobile applications\n\nBefore joining Glitzi, Luis spent several years working as developers for small companies and large corporations in various cities in Mexico. After acquiring a great experience in the development and entrepreneurship environment, he decided to undertake several projects until he teamed up with Ana Ramos to create Glitzi\n\nLuis is very passionate about finding solutions to complicated problems",
            "linkedin": "https://www.linkedin.com/in/luis-enrique-vazquez-escobar-35230464/"
        }
    ],
    "status": true,
    "generated_description": "**Glitzi: The At-Home Beauty Revolution in Latin America**\n\nFounded in 2019 and hailing from the bustling heart of Mexico City, Glitzi is carving a niche in the wellness and beauty space, specifically across Latin America. With the mission to deliver spa-quality services right to your doorstep, Glitzi connects customers with a diverse network of well-vetted professionals—masseuses, manicurists, and barbers—ensuring high-quality experiences that can easily fit into anyone’s busy schedule.\n\n### What They Offer\nGlitzi is much more than a traditional beauty service; it’s a comprehensive marketplace for on-demand beauty, grooming, and wellness. Think of it like having a salon that comes to you. They offer a variety of services including:\n\n- **Spa and Massages**: Relax and rejuvenate with professional massages in the comfort of your home.\n- **Nail Services**: Get manicures and pedicures without stepping out.\n- **Hair Care**: Enjoy haircuts and styling, done at your convenience.\n- **Makeup Services**: Look your best for any occasion with expert makeup artists.\n- **Special Packages**: Glitzi often curates packages for special events, ensuring you look and feel your best no matter the occasion.\n\nWith over 100,000 appointments completed, it’s clear that Glitzi has struck a chord. They hold a stellar 4.9 out of 5 customer rating, which showcases their commitment to quality and customer satisfaction.\n\n### The Team & Support\nWith a team of 33 passionate employees, Glitzi is part of the prestigious Y Combinator Batch S21, positioning itself firmly within the global startup ecosystem. Their group partner, nan, adds another layer of strategic support. \n\n### Promotions and Availability\nTo attract new customers, Glitzi frequently runs promotions such as a 25% discount on the first service or a 10% discount with specific promo codes. Their services are currently available in key cities like Mexico City, Querétaro, Monterrey, and Guadalajara, making it accessible for a significant population.\n\n### Convenience and Trust\nGlitzi emphasizes convenience—no more traffic, extended wait times, or unqualified service providers. Each professional goes through a rigorous screening process before joining their network, ensuring you receive top-tier services. \n\nIn an age where self-care often takes a backseat, Glitzi is not just an app but a movement towards better self-care right from home. If you’re feeling the weight of the world, Glitzi is ready to transform your space into a personal oasis of beauty and relaxation.\n\nFor more on Glitzi and to book your first service, visit [glitzi.com.mx](https://glitzi.com.mx/). It's time to treat yourself!",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/f240de69445fdda789d8b97cb2532e30ca109ae4.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191359Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=7ddd3212cda3f12320b288d8db222cd7fd92f17728646a167f59762c290ea16d",
    "social_links": [
        "https://www.linkedin.com/company/glitzimx/",
        "https://twitter.com/GlitziMx/",
        "https://www.facebook.com/GlitziMx/",
        "https://www.crunchbase.com/organization/glitzi"
    ],
    "logo_path": "data/logos\\Glitzi_logo.png"
}