{
    "links": "https://www.ycombinator.com/companies/go1",
    "name": "Go1",
    "headline": "A learning platform that enables you to train your staff or customers.",
    "batch": "S15",
    "description": "In today’s environment, employees need training to ensure business compliance, skill development and to support an engaged workforce. Go1 brings together content from the world’s top training providers and makes it easy to access in whichever platform your organization uses. This makes it easier to deliver, manage and engage with training. Go1 also works with existing LMS, HRIS, and business systems to make learning simpler and more effective.",
    "activity_status": "Active",
    "website": "https://go1.com",
    "founded_date": 2015.0,
    "team_size": 650.0,
    "location": "San Francisco",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:elearning; location:san-francisco-bay-area",
    "founders": [],
    "status": true,
    "generated_description": "Go1 is a cutting-edge eLearning platform designed to streamline training and compliance for organizations by offering an extensive library of educational content from top providers. Founded in 2015 and launched through Y Combinator’s batch S15, Go1 has quickly established itself as a leader in the corporate training space. With its headquarters in San Francisco and a robust team of approximately 650 employees, Go1 is well-equipped to support its mission: equipping companies to better train their staff and customers.\n\nWhat makes Go1 particularly compelling is its focus on integrating seamlessly with existing Learning Management Systems (LMS), Human Resource Information Systems (HRIS), and various business platforms. This flexibility allows organizations to deliver, manage, and engage with training in ways that align closely with their operational workflows. Whether it’s compliance training, leadership programs, wellness topics, or cybersecurity education, Go1 offers a one-stop shop for diverse learning needs.\n\nA significant milestone for Go1 is its impressive roster of over 10,000 clients, including industry giants like Microsoft, P&G, and Johnson & Johnson. These partnerships underline Go1's effectiveness in enhancing business compliance and fostering an engaged workforce. Users can tap into content from more than 250 providers, ensuring that they have access to high-quality materials catered to their specific business needs.\n\nGo1’s customer-centric approach is evident from testimonials highlighting measurable improvements in engagement and completion rates, showcasing a clear impact on learning outcomes. They've refined learning experiences through AI-driven insights, helping businesses tailor their training programs to target specific skills and compliance requirements efficiently.\n\nMoreover, Go1 is committed to easing the overwhelming complexities often associated with workforce training through its user-friendly interface and intelligence tools that simplify content discovery and reporting. In an age where continuous learning is paramount, Go1 positions itself as not just a training platform, but a strategic partner in cultivating a skilled and compliant workforce.\n\nFor more information, you can explore their website at [Go1.com](https://go1.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/d4d60b0dccc380c454c5e2427906f25a36dce6e1.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191401Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=1ab379b9d7dffd7f6c5ceb30dfc83b6fc794b44fc278ebd1d80baa93a22a35d1",
    "social_links": [
        "https://www.linkedin.com/company/go1/",
        "https://twitter.com/go1com",
        "https://www.facebook.com/go1com",
        "https://www.crunchbase.com/organization/go1",
        "https://github.com/go1com"
    ],
    "logo_path": "data/logos\\Go1_logo.png"
}