{
    "links": "https://www.ycombinator.com/companies/goalbook",
    "name": "Goalbook",
    "headline": "Web application for teachers to plan instruction. SaaS to US K-12â\u0080¦",
    "batch": "IK12",
    "description": "At Goalbook, we empower teachers to transform instruction so that ALL students succeed. We partner with over 1000 districts across 46 states, working closely with school and district leaders to scale and sustain improved instructional practice. Founded by former teachers and administrators, Goalbook was part of YC Edtech's inaugural class and the first company funded through New Schools'â\u0080\u008b Seed Fund, now Reach Capital.",
    "activity_status": "Active",
    "website": "http://goalbookapp.com",
    "founded_date": 2011.0,
    "team_size": 100.0,
    "location": "San Mateo, CA",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:education; industry:saas; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Daniel Yoo",
            "description": "Daniel Jhin Yoo is the co-founder and CEO of Goalbook. Daniel was a special education teacher and district administrator at Ravenswood City School District in East Palo Alto, CA. Daniel studied Electrical Engineering and Computer Science at  UC Berkeley and received his general and special education teaching credentials from Cal State East Bay.",
            "linkedin": "https://www.linkedin.com/in/danieljyoo/"
        }
    ],
    "status": true,
    "generated_description": "**Goalbook: Empowering Educators, Transforming Learning**\n\nFounded in 2011 and based in San Mateo, California, Goalbook is a robust SaaS platform focused on empowering K-12 educators to enhance instructional practices, particularly for special education. The company started with a vision: to ensure that all students thrive by transforming how teachers plan and deliver instruction. With over a decade of experience, Goalbook now partners with more than 1,100 school districts across 47 states, demonstrating its commitment and reach within the educational sector.\n\n**Mission and Impact**\n\nGoalbook equips teachers with tools designed for effective educational planning, enabling the creation of high-quality Individualized Education Programs (IEPs). Their platform integrates research-backed methodologies to support diverse learners, ensuring that educators can address varying needs in the classroom. Notably, research from reputable institutions like Johns Hopkins University validates that using Goalbook leads to improvements in teacher effectiveness and student outcomes. \n\n**A Collaborative Approach**\n\nThe company, which is part of the esteemed Y Combinator's Batch IK12, collaborates closely with educational leaders to foster sustainable improvements in teaching practices. With a team of around 100, founded by former educators who understand the intricacies of the classroom, Goalbook is dedicated to breaking down barriers hindering educational fulfillment.\n\n**Products and Resources**\n\nGoalbook offers an array of resources, including the Goalbook Toolkit, which provides frameworks and competencies essential for effective teaching. They also showcase success stories that demonstrate tangible impacts from districts implementing their platform. Curious educators can explore further through their [Website](http://goalbookapp.com), where various tools and research studies are available.\n\n**Endorsements and Success**\n\nTestimonials from district leaders highlight the platform's effectiveness—educators report enhanced collaboration, streamlined workflows, and a significant positive impact on instructional quality. Goalbook's commitment to research-driven practices positions it as an invaluable partner for schools aiming for excellence in education.\n\n**Get Started**\n\nIf you’re an educator or a district leader interested in elevating instructional quality and inclusivity in your classrooms, explore how Goalbook can assist you through their resources and services. The future of education is here, and it's all about equipping educators to succeed. [Request a quote](http://goalbookapp.com/<https:/goalbookapp.com/explore-toolkit/#get-started>) today and discover the potential of your teaching!\n\nIn summary, Goalbook isn't just a tool—it's a transformative partner in the educational journey, dedicated to ensuring that all students have the opportunity to thrive.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/c9d6f236867235bfc0d37466e130619572ba63f4.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191400Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=7a880745cde7d6f60e284ba7437022e77c14fe19b9aaefab9f4ee135ee90d8f5",
    "social_links": [
        "https://www.linkedin.com/company/goalbook",
        "https://twitter.com/goalbookapp",
        "https://www.crunchbase.com/organization/goalbook",
        "https://github.com/goalbook"
    ],
    "logo_path": "data/logos\\Goalbook_logo.png"
}