{
    "links": "https://www.ycombinator.com/companies/goodcover",
    "name": "Goodcover",
    "headline": "Digital Co-op Renters Insurance = half the price, better coverage.",
    "batch": "S17",
    "description": "Goodcover provides its Members with Good Renters Insurance for 50% less than legacy companies and an Annual Dividend of the money left over after claims obligations are met.\r\n\nGoodcover is a Managing General Agent (MGA) that administers personal insurance on behalf of our Membership, a bit like how USAA does it.\r\n\nMember's premiums are pooled and used to pay claims.  We take a fixed fee, and the remainder is returned in our Annual Member Dividend.\r\n\nWe work with multi-billion dollar capital partners to ensure regulations are followed, adequate claims capital is always available, and we have emergency capacity for catastrophes.\r\n\nTechnology allows us to eliminate waste, saving roughly 25% of the cost.  We are 100% digital, but not bots - we invest in tech that enables our experts to help Members.\r\n\nAs an Invitation Only Membership served by an MGA, **we can give Members Free Insurance** when they invite others, turning our \"Marketing Budget\" into savings for Members.  This eliminates Lizards and Sales Agents, saving the other 25%.\r\nWe do not use the standard industry models, instead using a multiperil model to more granularly price risk.  This means that for a few of you we are more expensive... but everyone else pays much less than they would otherwise pay.\r\n\nOur granular, multiperil model allows us to offer a superior policy over the standard market including:\r\n    - coverage for if your place is flooded by a neighbor\r\n    - Replacement Cost Coverage (meaning new stuff for your old)\r\n    - All Risk coverage for high value items you tell us about - including computers (almost no one does that amazingly)\r\n    - added coverage for mold removal\r\n\nOur MGA business model allows us to be capital efficient, \"renting\" capacity as we need it.\r\n\nAll this adds up to our government approved pricing being 40-60% cheaper on average than that of our competitors.",
    "activity_status": "Active",
    "website": "http://www.goodcover.com",
    "founded_date": 2017.0,
    "team_size": 4.0,
    "location": "San Francisco",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:insurance; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Christopher Lotz, Founder/CEO",
            "description": "Chris has spent a decade in the insurance business working in New York, Singapore, Australia, and San Francisco. At AIG he worked on setting up high net worth personal insurance for clients all around the world. Chris is an insurance nerd who’s passionate about making insurance work better and be accessible for all.",
            "linkedin": "https://www.linkedin.com/in/chrislotz/"
        },
        {
            "name": "Daniel Di Spaltro, Founder",
            "description": null,
            "linkedin": "https://www.linkedin.com/in/dispaltro"
        }
    ],
    "status": true,
    "generated_description": "Goodcover is shaking up the renters insurance game with its mission to provide affordable, high-quality coverage through a digital cooperative model. Founded in 2017 and part of Y Combinator's S17 batch, Goodcover offers renters insurance at about half the price of traditional providers while delivering superior coverage options. \n\nAs a Managing General Agent (MGA), Goodcover pools member premiums to pay out claims and takes a fixed fee, returning excess funds to members as an annual dividend. This unique approach not only keeps costs down but also aligns the interests of the members—if the pool performs well, they benefit directly.\n\nThe technology behind Goodcover allows them to cut out inefficiencies and pass those savings on to users—approximately 25% savings come from streamlining processes that traditional insurers often bloat with agents and advertising expenses. Instead of squeezing profit margins through hidden fees, Goodcover believes in transparent pricing and clear coverage. Plus, the invitation-only membership means members can further reduce their costs by bringing in others, effectively turning Goodcover's marketing budget into savings.\n\nGoodcover offers a range of innovative coverages that go beyond typical policies—think replacement cost coverage for personal property and special provisions for high-value items like computers. They also offer relief for unique scenarios, such as damage from neighboring properties. Their pricing is government-approved and can be 40-60% cheaper than competitors on average.\n\nHeadquartered in San Francisco with a lean team of four, Goodcover collaborates with substantial capital partners to ensure compliance and adequate claims handling. Their digital-first approach allows you to get a policy quickly—often in under a minute—without the hassle of meeting in person or lengthy paperwork.\n\nIn short, Goodcover is redefining what renters insurance looks like in the digital age. With a focus on community, transparency, and efficiency, they provide a modern solution for renters looking for reasonable rates and solid coverage. For more details, you can check out their [website](http://www.goodcover.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/7971508f0d217dcab8ddd1b7f3dabc6e6c5370aa.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191402Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=3742ff505acf3ccf4a43dda3447bb54931dcac4848c810266db81ee7f21b1558",
    "social_links": [
        "https://www.linkedin.com/company/goodcover",
        "https://twitter.com/goodcover",
        "https://www.facebook.com/GoodcoverCo/",
        "https://github.com/goodcover"
    ],
    "logo_path": "data/logos\\Goodcover_logo.png"
}