{
    "links": "https://www.ycombinator.com/companies/goodcourse",
    "name": "GoodCourse",
    "headline": "The TikTok style corporate training platform",
    "batch": "W23",
    "description": "GoodCourse is the TikTok-style corporate learning platform achieving 10x better completion rates, training employees on topics like compliance and inclusion.",
    "activity_status": "Active",
    "website": "https://www.goodcourse.co",
    "founded_date": 2021.0,
    "team_size": 8.0,
    "location": "London, United Kingdom",
    "group_partner": "Aaron Epstein",
    "group_partner_yc": "https://www.ycombinator.com/people/aaron-epstein",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:elearning",
    "founders": [
        {
            "name": "Chris Mansfield, Founder",
            "description": "Co-founder of GoodCourse, the TikTok-style micro-learning platform used by universities to engage students. Responsible for sales, engineering, and product. Background in sales & product roles at VC-backed B2B SaaS start-ups. Oxford graduate.",
            "linkedin": "https://www.linkedin.com/in/chris-mansfield-01/"
        }
    ],
    "status": true,
    "generated_description": "GoodCourse is a dynamic eLearning company based in London, founded in 2021 and currently operating with a lean team of eight. Their mission? To revolutionize corporate training with a TikTok-style platform that ensures high engagement and completion rates—up to 10x better than traditional methods. They’ve made a name for themselves by focusing on vital training topics such as compliance, inclusion, and student safety, making the content immediate, relatable, and engaging. \n\nThis startup has garnered attention by being part of the illustrious Y Combinator Batch W23, adding credibility and a supportive network to their innovative approach. Their platform merges social media-esque interactivity with evidence-based micro-learning techniques, allowing organizations to reach today’s distracted learners effectively.\n\nTheir offerings focus on producing courses that resonate with a younger audience—particularly Gen-Z—by delivering bite-sized content that can be accessed directly on learners’ phones without cumbersome logins. They emphasize real-time analytics to track engagement and outcomes, ensuring that organizations can see the impact of their training initiatives.\n\nGoodCourse has attracted noteworthy clients such as the University of Florida and Brown University, highlighting their adaptability and effectiveness across educational institutions. They offer services such as customizable course creation, periodic refreshes of content, and seamless integration into existing communication channels, like email and SMS.\n\nTheir commitment to transforming learning experiences is evident in testimonials, with educators noting an impressive engagement rate that stands out in the often lackluster world of corporate training. By prioritizing engagement and contextual relevance, GoodCourse is reshaping how organizations approach training, making it something that employees actually look forward to.\n\nTo sum it all up, GoodCourse is not just another eLearning platform. It’s a fresh take on corporate training—one where the traditional methods are being unceremoniously tossed aside for an engaging, effective learning experience worthy of today’s workforce challenges. If you're looking for a solution to stale training formats, GoodCourse might just be your next best bet. \n\nVisit their website at [GoodCourse.co](https://www.goodcourse.co) to learn more or dive right into their engaging courses.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/7a6ab728916c6d0a6f7015f4a4b3637773f6403a.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191402Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=f63c956f104f0af37246a15ebd9410d9f283205a3576d8bb87675bf7c0ba54f0",
    "social_links": [
        "https://www.linkedin.com/company/goodcourse",
        "https://twitter.com/GoodCourse_",
        "https://www.crunchbase.com/organization/goodcourse"
    ],
    "logo_path": "data/logos\\GoodCourse_logo.png"
}