{
    "links": "https://www.ycombinator.com/companies/greaseboss",
    "name": "GreaseBoss",
    "headline": "GreaseBoss verifes industrial machinery is greased correctly",
    "batch": "W21",
    "description": "Our hardware and software product verifies industrial machines are greased correctly. \r\n\nIncorrect greasing is the number one cause for machinery failure and costs $21bn per annum.",
    "activity_status": "Active",
    "website": "https://www.greaseboss.com.au",
    "founded_date": 2020.0,
    "team_size": 10.0,
    "location": "Sunshine Coast, Australia",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:hardware; industry:iot",
    "founders": [
        {
            "name": "Peter Condoleon, Founder",
            "description": "Peter is the co-founder and CTO of GreaseBoss, a company with a vision to transform the way industries manage lubrication for heavy machinery. In his role as CTO, Peter drives the ongoing innovation and development of GreaseBoss technology, employing cutting-edge solutions to solve an age old problem.",
            "linkedin": "https://www.linkedin.com/company/30238673"
        },
        {
            "name": "Tim Hall, Founder/CEO",
            "description": "Tim's entrepreneurial spirit and strategic foresight sees him actively developing business opportunities and building partnerships whilst constantly pushing the possibilities of what is achievable with the resources at hand.  \nHe is focussed and tenacious on overcoming issues and delivering on technical projects.  As an experienced project manager with a mechanical engineering background, he has the business, technical and people skills to deliver on business outcomes.",
            "linkedin": "https://www.linkedin.com/in/timothyhall87/"
        }
    ],
    "status": true,
    "generated_description": "### GreaseBoss: Ensuring Machinery Reliability Through Smart Greasing\n\n**Overview**  \nFounded in 2020 and hailing from the Sunshine Coast, Australia, GreaseBoss is tackling one of the most significant pain points in industrial machinery maintenance—incorrect greasing. This oversight isn't trivial; it’s the leading cause of machinery failure, resulting in a staggering $21 billion in losses annually. \n\n**Mission**  \nGreaseBoss aims to verify that industrial machinery is greased correctly, all the time. Their solution combines hardware and software to monitor and ensure that the right grease is applied in the right amount and at the right time.\n\n**Product Offering**  \nGreaseBoss has developed a cutting-edge system that is not only user-friendly but also easily retrofittable into existing industrial equipment and greasing systems. The technology provides industries with the right data to prevent avoidable breakdowns, enabling remote monitoring and systematic greasing practices that help maintain operations through staff turnover.\n\n**Market Position**  \nGreaseBoss distinguishes itself as the first to market with comprehensive tools that digitally transform industrial greasing. Their innovative approach has revolutionized how businesses handle lubrication, making processes safer, more reliable, and productive.\n\n**Team and Support**  \nThe company is comprised of a dedicated team of 10 employees and is part of Y Combinator's Batch W21 incubator, giving them strong backing and resources. Their unique value proposition is enhanced by partnerships, notably with Nan—a recognized group partner.\n\n**Target Sectors**  \nGreaseBoss primarily serves sectors like mining, metals, utilities, and asphalt plants, addressing critical needs in these high-demand areas for precise lubrication solutions.\n\n**Call to Action**  \nIf you’re in an industry where machinery uptime is crucial, consider booking a demo to see how GreaseBoss can transform your greasing practices and prevent costly breakdowns. Visit their website [GreaseBoss](https://www.greaseboss.com.au) for more information and to explore their offerings.\n\nIn summary, GreaseBoss is not just about grease; it's about enhancing industrial efficiency through smarter maintenance solutions. They’re redefining how businesses think about and manage lubrication—one machine at a time.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/abd96398038a71dd65760e579357d97064609a22.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191404Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=9ff2c6f927428cd131df060c68d55df2d7b6e95a3c1b286981c8f0d0c34628f1",
    "social_links": [
        "https://www.linkedin.com/company/greaseboss",
        "https://twitter.com/greaseboss1",
        "https://www.facebook.com/greasebossaustralia"
    ],
    "logo_path": "data/logos\\GreaseBoss_logo.png"
}