{
    "links": "https://www.ycombinator.com/companies/greentally",
    "name": "GreenTally",
    "headline": "Affordable carbon tracking solution for all businesses",
    "batch": "S23",
    "description": "GreenTally is a carbon accounting platform built for all businesses that transforms environmental reporting from a complex, expensive ordeal into a streamlined, affordable process. Using LLM, we help companies measure their carbon footprint in hours instead of months.\r\n\nGreenTally automates emissions calculations and reporting, enabling businesses to meet regulatory requirements and track reduction targets without the overhead of consultants or dedicated sustainability teams. By making enterprise-grade carbon accounting accessible and practical, GreenTally empowers growing businesses to take control of their sustainability journey.",
    "activity_status": "Active",
    "website": "https://www.greentally.ai",
    "founded_date": 2023.0,
    "team_size": 2.0,
    "location": "San Mateo, CA",
    "group_partner": "Diana Hu",
    "group_partner_yc": "https://www.ycombinator.com/people/diana-hu",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:artificial-intelligence; industry:generative-ai; industry:machine-learning; industry:saas; industry:ai; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Yulong Liu, Founder",
            "description": "Co-founder at GreenTally. Previously machine learning engineering manager at Snap, and senior software engineer at Google Research",
            "linkedin": "https://linkedin.com/in/yulong-liu-b4b96b16"
        }
    ],
    "status": true,
    "generated_description": "### GreenTally: Simplifying Carbon Accounting for Businesses\n\n**Overview**\nGreenTally is a groundbreaking carbon accounting platform aimed at making carbon tracking accessible and affordable for businesses of all sizes. Founded in 2023 and a member of Y Combinator's Batch S23, this San Mateo, CA-based startup is on a mission to transform complex emissions reporting into a seamless process, thanks to its innovative use of large language models (LLM).\n\n**Mission**\nTheir mission is straightforward: offer an affordable carbon tracking solution that makes it easier for businesses to measure their carbon footprint in mere hours, compared to the traditional months-long processes. By automating emissions calculations and reporting, GreenTally enables companies to meet regulatory demands and set reduction targets without burdening themselves with consultants or dedicated sustainability teams.\n\n**Key Features and Benefits**\n- **Time Efficiency**: Users can save 90% of the time typically spent on carbon reporting, converting weeks of work into just hours.\n- **Cost Savings**: To date, GreenTally users have collectively saved over $1.2 million in emissions reporting costs.\n- **User Experience**: 100% of users report experiencing less stress with the white-glove carbon accounting service.\n- **Broad Tracking**: The platform tracks over 45,000 tonnes of greenhouse gas (GHG) emissions across various business operations.\n\n**Product Offerings**\nGreenTally offers tiered subscription plans designed for different business sizes:\n- **Starter Plan**: €199/month for businesses with up to 25 employees, encompassing comprehensive emissions tracking and continuous monitoring.\n- **Medium Plan**: €299/month for 26-50 employees, featuring added supplier engagement tools and quarterly reporting.\n- **Large Plan**: €599/month for businesses with 51-200 employees, inclusive of accounting integrations and dedicated support.\n\nEach plan emphasizes user-friendly functionality, allowing businesses to manage and report their emissions with minimal hassle.\n\n**Customer Testimonials**\n- **Elena Slabutu**, CEO of WifiCandy, shares how GreenTally helped clarify emissions management, enabling her to focus on her core business.\n- **Lillian Wu**, Lead Sustainability Manager at Fingo.ie, notes the platform's ability to enhance their consulting services, leading to better client outcomes.\n\nGreenTally isn’t just software; it’s a partner in sustainability. By simplifying carbon accounting, it empowers businesses to control their impact on the environment without overwhelming complexity.\n\n**Get Started**\nTo experience GreenTally and see firsthand how it can simplify your carbon accounting, consider booking a demo via their [website](https://www.greentally.ai). With a small team of two and backing from top-tier investors, GreenTally is poised to change the game in carbon management, ensuring that sustainability is within everyone’s reach.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/9b22a074465387fd2f0eaf8227124f6d493f92a4.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191404Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=7f32661702197a5e8d917bfe96c22c2dfcda92fc7c3428f801fdbd07348dceba",
    "social_links": [
        "https://www.linkedin.com/company/greentally-ai"
    ],
    "logo_path": "data/logos\\GreenTally_logo.png"
}