{
    "links": "https://www.ycombinator.com/companies/greywing",
    "name": "Greywing",
    "headline": "The Operating System for Maritime",
    "batch": "W21",
    "description": "Greywing is a platform for ship operators to automate their business, through actionable intelligence, better data and communication.\r\n\nGreywing today serves three product lines to customers:\r\n\n*Flotilla* is a monitoring tool for vessels, enabling vessel managers to identify fleet-level patterns and optimizations and to identify risk and liability vectors in advance.\r\n\n*CRY4* is an operational tool for individual vessels that allows crew managers, security officers and masters to gather intelligence about a vessels current or proposed route, making decisions about the safest and the cheapest ports of call that a vessel can be directed to.\r\n\n*Landfall* is a crew management and analysis system to provide risk reporting and detailed editing capabilities about the crew on-board a vessel.\r\n\n*Semaphore* is a port-agent communications tool meant to simplify the process of interfacing with large numbers of port agents while planning a port call.",
    "activity_status": "Active",
    "website": "https://grey-wing.com/",
    "founded_date": 2019.0,
    "team_size": 3.0,
    "location": "Singapore, Singapore",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:hard-tech; industry:saas; industry:maritime",
    "founders": [
        {
            "name": "Nick Clarke, Founder",
            "description": "Former Royal Marine Commando,  bootstrapped entrepreneur. Now turning data into Crew Changes in the maritime industry.",
            "linkedin": "https://www.linkedin.com/in/nick-j-clarke/"
        }
    ],
    "status": true,
    "generated_description": "### Greywing: Revolutionizing Maritime Operations\n\nFounded in 2019 and part of Y Combinator's W21 batch, **Greywing** is setting the pace for innovation in the maritime industry. With a bold mission to be “The Operating System for Maritime,” Greywing aims to automate the business of ship operations through actionable intelligence, enhanced data, and streamlined communication.\n\n#### Product Offerings\n\nGreywing has crafted a suite of tools tailored for different needs within maritime operations:\n\n1. **Flotilla**: A monitoring tool that helps vessel managers analyze fleet-level data, recognize optimization opportunities, and preemptively spot risks.\n\n2. **CRY4**: This operational tool is designed for individual vessels, aiding crew managers, security personnel, and shipmasters in making informed decisions about safe and cost-effective routing.\n\n3. **Landfall**: A comprehensive crew management system that focuses on risk reporting and crew documentation oversight.\n\n4. **Semaphore**: A communication platform that simplifies interactions with numerous port agents during the planning of port calls.\n\nLocated in Singapore and with a compact team of three, Greywing is making waves in a traditionally stagnant sector, combining modern technology with maritime expertise to provide significant operational efficiencies.\n\n#### Leading with AI\n\nAt the forefront of Greywing’s initiatives is **Proteus**, an AI-driven solution designed to uncover data insights and optimize decision-making. Its capabilities include real-time access to complex operational manuals and crew management, multilingual support, data export features for business presentations, and an interactive interface that aggregates data from various software into a unified platform.\n\nGreywing isn't just focused on improving efficiency; they’re also dedicated to maintaining privacy and security. Their system is built with robust measures for data protection, ensuring that users maintain control over their information.\n\n#### Trusted by Leaders in the Industry\n\nGreywing's cutting-edge tools are already in use by industry disruptors such as BW Group, BW LNG, IINO Lines, and Hafnia, displaying the trust and recognition it has garnered in a short span of time.\n\n#### Conclusion\n\nIf you're in maritime operations and looking to harness the power of data and AI to streamline your processes, Greywing offers a compelling set of resources. Their tools not only make operational tasks easier but can also unlock substantial revenue opportunities. \n\nFor more information and to see how Greywing can support your maritime journey, check out their website: [Greywing](https://grey-wing.com/).\n\n---\n\nBy focusing on automation and intelligence, Greywing is poised to transform how maritime businesses operate. It's an exciting time for this company, as they continue to innovate and shape the future of the industry.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/d0ec3a105ff98afb5f4938db61ef63c758c30ef1.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191405Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=cf577c4d9e3128107b7ec0d55fdebbafd9c73d9501a3c59147ef5d30d883707e",
    "social_links": [
        "https://www.linkedin.com/company/greywing",
        "https://mobile.twitter.com/greywing_ltd",
        "https://www.crunchbase.com/organization/greywing-28da",
        "https://github.com/Greywing-Maritime"
    ],
    "logo_path": "data/logos\\Greywing_logo.png"
}