{
    "links": "https://www.ycombinator.com/companies/guardian-rf",
    "name": "Guardian RF",
    "headline": "Drone detection for US defense and national security",
    "batch": "S24",
    "description": "The rise of weaponized drones has fundamentally transformed security threats both in warfare and civilian contexts. In Ukraine, $500 modified commercial drones regularly neutralize million-dollar military assets. At our southern border, cartels use drones to smuggle fentanyl and survey law enforcement positions. Critical infrastructure, military bases, and correctional facilities face unprecedented vulnerability to unauthorized surveillance and drone-based attacks.\r\n\nFounded in 2024, GuardianRF develops advanced RF spectrum sensors to protect against this evolving threat landscape. Our technology has been battle-tested in Ukraine, where consumer drones converted into precise guided missiles have become a daily reality. Unlike traditional systems that rely on regulatory compliance, our sensors can detect modified and non-Remote ID compliant drones from up to 3 km away, accurately pinpointing both drone and operator locations.\r\n\nWhat sets us apart is our distributed mesh network of sensors combining advanced Software Defined Radio (SDR) technology with AI-driven signal classification. Trained on extensive combat zone datasets, our system processes RF signatures in real-time across multiple frequency bands, catching even sophisticated stealth drones using frequency-hopping protocols. When a threat is detected, the system delivers precise targeting data while maintaining continuous tracking.\r\n\nOur product line includes:\r\n- Scout Detector: A handheld drone detector for rapid deployment and portability\r\n- Mosaic Sensor Network: A scalable mesh network of RF sensors for detecting, tracking, and mapping drone activity across expansive areas\r\n\nThe stakes are severe: along our borders, cartel drones facilitate trafficking that costs thousands of lives annually. In prisons, a single successful drone contraband delivery can trigger facility-wide violence. For critical infrastructure, a coordinated drone strike could cause billions in business interruption losses. Traditional drone defense systems, often priced in the millions, are cost-prohibitive for most organizations.\r\n\nGuardianRF bridges this critical gap with accessible, effective protection. Our AI classification engine recognizes various control protocols including modified ExpressLRS, Crossfire, and DJI variants, providing early warning of threats that traditional systems miss entirely. The system's fully automated detection, tracking, and response mechanisms ensure continuous protection with minimal operational overhead.\r\n\nBuilt and manufactured in the United States, GuardianRF combines field-proven technology with real-world deployment experience to counter modern drone threats. Whether safeguarding critical infrastructure, securing borders, or supporting defense operations, our systems deliver the comprehensive drone detection capabilities needed for today's security challenges.",
    "activity_status": "Active",
    "website": "https://guardianrf.com/",
    "founded_date": 2024.0,
    "team_size": 3.0,
    "location": "Washington, DC",
    "group_partner": "Gustaf Alstromer",
    "group_partner_yc": "https://www.ycombinator.com/people/gustaf-alstromer",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:hard-tech; industry:drones; industry:security",
    "founders": [
        {
            "name": "Lucas Raskin, Founder",
            "description": "Physics enthusiast. Building next generation counter UAS capabilities.",
            "linkedin": "https://www.linkedin.com/in/lucas-r-422937242/"
        },
        {
            "name": "John Andrzejewski, Founder",
            "description": "Former Physics at Georgetown. Working on counter UAS and hitting PRs on bench press.",
            "linkedin": "https://www.linkedin.com/in/john-andrzejewski/"
        },
        {
            "name": "Eli Kerstein, Founder",
            "description": "My background is in physics and comp sci. I build Counter UAS systems.",
            "linkedin": "https://www.linkedin.com/in/eli-kerstein-64a98919a/"
        }
    ],
    "status": true,
    "generated_description": "**Company Summary: Guardian RF**\n\n**Mission:**  \nGuardian RF is on a crucial mission: defending the U.S. through advanced drone detection systems. The rising threat of weaponized drones—especially highlighted by recent conflicts like the one in Ukraine—has made traditional security measures inadequate. With drones being repurposed for everything from battlefield attacks to smuggling operations, Guardian RF aims to fill this gap.\n\n**Founding and Development:**  \nFounded in 2024 and part of Y Combinator's Batch S24, Guardian RF emerged from an urgent need for effective drone defense solutions. The company's technology has been battle-tested in Ukraine, proving its reliability in real-world conflict scenarios where everyday commercial drones have been modified into lethal weapons.\n\n**Technology:**  \nThe core of Guardian RF's innovation lies in their advanced RF spectrum sensors. Their systems can detect modified drones, even those not compliant with Remote ID regulations, from a distance of up to 3 kilometers. Unlike conventional systems that often rely on regulatory adherence, Guardian RF utilizes a distributed mesh network combining Software Defined Radio (SDR) technology and AI-driven signal classification, providing unmatched detection capabilities.\n\n**Products:**  \nGuardian RF offers two main products:\n1. **Scout Detector:** A portable, handheld device designed for rapid deployment that allows site security teams to identify drone operators with ease.\n2. **Mosaic Sensor Network:** A scalable mesh network that tracks drone activity across large areas, suitable for border security and critical infrastructure monitoring.\n\nWhat sets Guardian RF apart isn't just their detection prowess; their AI classification engine is capable of identifying various control protocols, allowing for early warnings of threats that other systems might overlook.\n\n**Impact and Accessibility:**  \nThe stakes are exceptionally high. Across borders, cartel drones contribute to drug trafficking, costing lives, while in prisons, drone deliveries of contraband can ignite violence. Guardian RF's affordable solutions counter these threats head-on, providing organizations with accessible yet effective protective measures against drone-based attacks.\n\n**Team and Location:**  \nWith a small team of three based in Washington, D.C., Guardian RF is nimble and focused, leveraging their expertise to tackle the evolving security landscape. Under the guidance of Group Partner Gustaf Alstromer from Y Combinator, the company is positioned for robust growth.\n\n**Final Thoughts:**  \nGuardian RF represents the intersection of need and technology in a rapidly changing security environment. By providing innovative solutions to combat advanced drone threats, they are not just enhancing physical security but also helping to safeguard lives and essential infrastructure across the United States.\n\n**For more information, visit their website:** [Guardian RF](https://guardianrf.com)",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/6c2e6b4bddcc8c69da2fd9ad3fb7c790fac01027.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191406Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=3169ad877d97418e31f8224eea44819fdd8dd87b3f40a8b03d46ea7f9b31e63d",
    "social_links": [
        "https://www.linkedin.com/company/guardian-rf",
        "https://x.com/Guardian_RF"
    ],
    "logo_path": "data/logos\\Guardian_RF_logo.png"
}