{
    "links": "https://www.ycombinator.com/companies/guardian-bio",
    "name": "Guardian Bio",
    "headline": "Dendritic cell-based platform for cancer therapy",
    "batch": "S22",
    "description": "Your immune system is your body’s best weapon and defense against cancer. It is only when it is overcome that cancer develops into full blown disease. Dendritic cells sit at the helm of the immune system, directing and dictating immune responses. Data has shown dendritic cells are often dysfunctional in cancer patients, and that this dysfunction is a bottleneck for other therapies. \r\n\nGuardian Bio’s approach is focused on creating a dendritic cell-based product which drives anti-tumor activity through activating the killers of the immune system AND training them against multiple cancer targets. We take stem cells from cancer patients, turn them into specific therapeutic dendritic cells specially trained against that patient’s tumor, and re-introduce them back into the body. \r\n\nOur therapeutic dendritic cells revitalize the killers of the immune system and give them the kickstart they need to fight - and win - against cancer.",
    "activity_status": "Active",
    "website": "http://www.guardian-bio.com",
    "founded_date": 2022.0,
    "team_size": 2.0,
    "location": "Boston",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:biotech; industry:healthcare; industry:therapeutics; industry:oncology; location:boston",
    "founders": [
        {
            "name": "Ananya Zutshi, Founder",
            "description": "Ananya is Co-Founder and CEO of Guardian Bio, a company which controls immunity using dendritic cell-based therapies. \n\nShe has a Bachelors in Science in Engineering from Duke and Masters in Engineering and MBA from Harvard. Her experiences span across the pharma/biotech industry in operations, engineering, project management, and early stage investing. She is passionate about delivering better therapies for patients and diversity, equity, and inclusion.",
            "linkedin": "http://linkedin.com/in/ananya-zutshi/"
        },
        {
            "name": "Ricky Barrett, Founder",
            "description": "Co-founder and CSO at Guardian Bio.\n\nRicky started his career as a marine biologist and research diver at FAU with a focus on marine natural products and drug discovery.  \n\nHe pursued a PhD at UCF, focused on immunology followed by a postdoc in cancer immunology and tumor microenvironment at the University of Pennsylvania.\n\nRicky is a prolific science communicator creating educational science content for an audience of over a quarter million followers across various social media platforms.",
            "linkedin": "http://www.linkedin.com/in/rickbarrett21/"
        }
    ],
    "status": true,
    "generated_description": "### Guardian Bio: Reinventing Cancer Therapy\n\n**Overview:**  \nGuardian Bio is a Boston-based biotech company founded in 2022 that's on a mission to transform cancer therapy using a novel dendritic cell-based platform. The company operates under the belief that the immune system—our body’s most potent defense against cancer—can be enhanced, particularly through the revitalization of dendritic cells. \n\n**What They Do:**  \nDendritic cells play a critical role in guiding immune responses; however, research shows these cells often become dysfunctional in cancer patients, which can stymie the effectiveness of other treatments. Guardian Bio uniquely addresses this issue by creating tailored therapeutic dendritic cells that are derived from patients' own stem cells. This product not only revitalizes the immune system’s killer cells but also trains them to target multiple cancer types, boosting anti-tumor activity.\n\n**The Technology:**  \nGuardian Bio has developed a proprietary process to produce specialized dendritic cells, termed Guard-cDC1s, which effectively restore immune functionality. These cells are pivotal in reinstating antigen presentation capabilities that are often compromised in late-stage cancer. By training these cells against specific tumor targets, Guardian Bio enhances the body’s natural immune responses, making it a promising frontrunner in cancer therapy.\n\n**Team and Education:**  \nThe founding team includes Ananya Zutshi, who has extensive experience in the biotech sector and education from prestigious institutions such as Duke and Harvard, and Karolina Palucka, a luminary in cancer immunology. Both co-founders are committed to harnessing advanced science to bring innovative solutions to market. The team also includes Richard Barrett, who brings a strong background in immunology and science communication.\n\n**Affiliation and Growth:**  \nPart of Y Combinator's Summer 2022 batch, Guardian Bio is poised for growth in the biotech and healthcare realms. Their work is tagged under key sectors like therapeutics and oncology, signaling their focus on impactful areas within the cancer treatment landscape.\n\n**Contact and Learn More:**  \nFor more information, visit [Guardian Bio's website](http://www.guardian-bio.com), where you can explore their technology and team further.\n\nIn a nutshell, Guardian Bio is not just another player in cancer therapy; they're pioneering a path that could redefine how we approach treatment, grounded in harnessing our very own biology to combat this formidable disease.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/9713d3fadf374be97e576e6676080f2c72a6a1bf.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191406Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=7404c1747cf2563dcdb681e5a20b7ecd8f29ccc3a7e5dcf30c6a7b1e9fbe636b",
    "social_links": [
        "https://www.linkedin.com/company/guardian-bio"
    ],
    "logo_path": "data/logos\\Guardian_Bio_logo.png"
}