{
    "links": "https://www.ycombinator.com/companies/guruhotel",
    "name": "GuruHotel",
    "headline": "The Shopify for the hotel industry.",
    "batch": "W20",
    "description": "GuruHotel is Shopify for the hotel industry. Independent hotels use our software to rebuild their hotel website, drive more direct bookings from online travel agencies (OTAs), and generate 30% more revenue. \r\n\nWe have decades of experience building products and leading companies in the hotel industry, including founding and selling LastRoom, the HotelTonight for LATAM.\r\n\nThat’s where we learned that 73% of people who find a hotel room on Booking.com or Expedia also check the hotel website to see if the price is cheaper.  Independent hotels are missing these opportunities because they haven’t figured out that they should offer extras, discounts, and better user experience in order to drive bookings on their websites to avoid paying 15-25% commissions to OTAs.  We help them automate all of this.\r\n\nWhy now - Shopify did this for e-commerce allowing them to pull their content from Amazon - we will do this for hotels allowing them to gain freedom from Booking and Expedia.",
    "activity_status": "Active",
    "website": "https://guruhotel.com",
    "founded_date": 2019.0,
    "team_size": 50.0,
    "location": "Mexico City, Mexico",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:saas; industry:b2b; industry:travel",
    "founders": [
        {
            "name": "Jorge Flores Acevedo, Founder",
            "description": "Hospitality Professional with over 10 years of experience in E-commerce, Revenue Management and Online Distribution for Hotels and Vacation Rentals.\n\nBroad experience managing overall sales for properties in Mexico and the Caribbean with a deep understanding of booking engines, channel managers, price comparison and revenue management tools.",
            "linkedin": "https://www.linkedin.com/in/jorgefloresacevedo/"
        },
        {
            "name": "Josue Gio 🔥, Founder",
            "description": "Cofounder at @GuruHotel (YCW20). Angel Investor in +40 LATAM startups.",
            "linkedin": "https://www.linkedin.com/in/josuegio"
        },
        {
            "name": "Stiven Martinez, Founder",
            "description": "I make digital products. I am based in Medellín, Colombia. Brands and UI / UX designer, frontend developer lead and co-founder of GuruHotel, Inc.",
            "linkedin": "https://www.linkedin.com/in/stivenmartinez/"
        }
    ],
    "status": true,
    "generated_description": "### GuruHotel: The Shopify for the Hotel Industry\n\n**Overview:**\nFounded in 2019 and based in Mexico City, GuruHotel is on a mission to revolutionize the independent hotel sector by providing them with tools to capitalize on direct bookings. Taglined as “The Shopify for the hotel industry”, GuruHotel empowers these hotels to take control of their websites and booking processes, aiming to increase direct sales and reduce dependency on Online Travel Agencies (OTAs) like Booking.com and Expedia.\n\n**The Problem:**\nIndependent hotels often struggle with online visibility and booking efficiency. Research found that a staggering 73% of hotel seekers comparing prices still visit the hotel’s website after checking OTAs, indicating a huge opportunity for hotels to capture additional bookings directly. However, many are unable to offer competitive pricing, additional incentives, or an optimized user experience necessary to effectively convert these visitors.\n\n**The Solution:**\nGuruHotel addresses these challenges by automating the process of building hotel websites and integrating booking functionalities that are synchronized with real-time inventory. Hotels can launch a professional website in under 60 seconds, which helps them avoid paying hefty OTA commissions, which typically range from 15% to 25%.\n\n**Core Features:**\n1. **Automated Website Creation**: Set up a professional hotel website quickly with real-time inventory synchronization.\n2. **Customer Support Tools**: Ensure guests have a seamless booking experience with tailored assistance.\n3. **Multiple Payment Options**: Fast, secure payment methods, including credit cards and mobile payments.\n4. **Multi-Language and Currency Support**: Cater to a global audience by allowing guests to choose their preferred language and currency.\n\n**Market Position & Strategy:**\nGuruHotel taps into the fintech and SaaS markets within the travel industry, strategically positioning itself for success as it seeks to empower independent hotels. By offering a free and maintenance-free solution, with no upfront infrastructure costs, they make it viable for hotels to shift bookings away from OTAs.\n\n**Team and Recognition:**\nWith a team of about 50 and backed by notable investors, including Y Combinator, GuruHotel is well-equipped to expand its services and reach. They’ve been recognized as an industry champion at the SiteMinder Partner of the Year Awards in 2023, further solidifying their credibility and market relevance.\n\n**Why Now?**\nThe timing for GuruHotel couldn’t be better. Just as Shopify transformed e-commerce by giving small businesses the tools to sell directly and maintain control, GuruHotel aims to do the same for the hotel industry. It’s a clear pivot towards empowering hoteliers to enhance their operational efficiency and revenue generation.\n\nIn summary, GuruHotel is more than just a product; it's a vital tool for independent hotels wanting to reclaim their autonomy in a landscape dominated by OTAs. If you're in the hotel business and looking to boost your direct bookings, GuruHotel is worth a look.\n\n**Visit them at:** [GuruHotel](https://guruhotel.com)",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/f466a742f4b64843658ef972be8a3350daca8bd0.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191409Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=b166c30104d702239cbf9743db938593cc8a9c16f9359ac349b51f56292c030f",
    "social_links": [
        "https://www.linkedin.com/company/guruhotel/",
        "https://twitter.com/guruhotelhq",
        "https://www.facebook.com/guruhotelmx/",
        "https://www.crunchbase.com/organization/guruhotel"
    ],
    "logo_path": "data/logos\\GuruHotel_logo.png"
}