{
    "links": "https://www.ycombinator.com/companies/h3x-technologies",
    "name": "H3X Technologies",
    "headline": "The lightest electric aircraft motors in the world.",
    "batch": "W21",
    "description": "At H3X, we are making the lightest, high-power electric propulsion systems in the world to enable a large-scale revolution in aircraft electrification.\r\n\nOur first product is a 250-kW (335 HP) integrated motor drive in an 18 kg package. It combines the electric motor, inverter, and gearbox into a single powerful unit and is the culmination of patent pending innovation in multiple areas.",
    "activity_status": "Active",
    "website": "http://h3x.tech/",
    "founded_date": 2020.0,
    "team_size": 18.0,
    "location": "Denver, CO",
    "group_partner": "Brad Flora",
    "group_partner_yc": "https://www.ycombinator.com/people/brad-flora",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:airplanes; industry:climate; industry:electric-vehicles",
    "founders": [
        {
            "name": "Max Liben, Founder",
            "description": "Max is a multidisciplinary engineer with a laser focus on physics fundamentals and deep knowledge in both mechanical and electrical engineering. As CTO, he is responsible for H3X’s overall product engineering, electric motor design, and core technology development. Max has held key roles in vehicle modeling, architecture, and electric motor design in both the automotive and aerospace sectors. He has a B.S. in Mechanical Engineering and an M.S. in Electrical Engineering from UW-Madison.",
            "linkedin": "http://linkedin.com/in/max-liben-381360118"
        },
        {
            "name": "Eric Maciolek, Founder",
            "description": "I am responsible for all operations and mechanical design at H3X. In prior roles, I have led projects developing control systems for electric and hybrid powertrain systems from the ground up. I have a BS in Mechanical Engineering from University of Wisconsin-Madison. I come from a proud heritage of craftsmen – from butchers and bakers to electricians and steamfitters. This unique background has enabled me to bridge the gap between advanced engineering theory to practical and scalable solutions.",
            "linkedin": "https://www.linkedin.com/in/eric-maciolek-677425a5/"
        },
        {
            "name": "Jason Sylvestre, Founder",
            "description": "Co-founder & CEO of H3X Technologies. Ex- Specter, Tesla, MTS. MS and BS in Electrical Engineering from University of Wisconsin-Madison. Built electric racecars in college (FSAE).",
            "linkedin": "https://www.linkedin.com/in/jason-sylvestre/"
        }
    ],
    "status": true,
    "generated_description": "**H3X Technologies: Revolutionizing Electric Aircraft Propulsion**\n\nFounded in 2020 and part of Y Combinator's W21 batch, H3X Technologies is making waves in the aerospace sector from its base in Denver, CO. The company's mission is straightforward yet ambitious: to develop the lightest electric aircraft motors in the world. This focus on electric propulsion isn't just a tech play; it represents a significant shift towards sustainable aviation.\n\nTheir flagship product, the 250 kW (335 HP) integrated motor drive, weighs a mere 18 kg, efficiently combining the electric motor, inverter, and gearbox into a single powerhouse unit. This innovative design marks a leap forward in electric aviation technology with patent pending innovations across several domains. \n\nThe H3X team is comprised of 18 dedicated employees, driven by the vision of enabling a large-scale revolution in aircraft electrification. With products ranging from 30 kW to 30 MW, H3X is not just about lightweight motors; it’s about creating scalable, versatile solutions that can pull their weight in aerospace, defense, marine, and heavy industry applications. Their offerings include a range of integrated motor drives designed to maximize power density—recording up to an astounding 12 kW/kg continuous.\n\nSupport has poured in from significant industry players, including NASA and the USAF, solidifying H3X’s reputation as a trusted innovator. The company's commitment to domestic manufacturing is evident, with all products designed and built in the USA, rekindling the engineering prowess that once dominated the aerospace landscape.\n\nRecently, they've made headlines by securing a $1.9 million TACFI contract with the U.S. Air Force and a $20 million deal that promises to further amplify their impact. \n\nIn a world where rapid innovation is essential, H3X Technologies is at the forefront, pushing the boundaries of engineering to help shape a sustainable future for aviation. If you're keen to learn more, check out their offerings, or even explore job opportunities, dive into their [website](http://h3x.tech/). It's clear: H3X isn't just building motors; they're laying the groundwork for the future of flight.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/d77d562552c9984402d6f80dd1db835d2765dd95.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191409Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=b815e85e79acccacdf2a78cbc6c805e026da4de387c01b19371274ca2d29a177",
    "social_links": [
        "https://www.linkedin.com/company/h3x-technologies"
    ],
    "logo_path": "data/logos\\H3X_Technologies_logo.png"
}