{
    "links": "https://www.ycombinator.com/companies/hammr",
    "name": "Hammr",
    "headline": "Rippling for the Construction Industry",
    "batch": "W23",
    "description": "Hammr is the all-in-one platform for construction companies to manage their back office. Top contractors use Hammr for payroll, time tracking, benefits and compliance — in one place.",
    "activity_status": "Active",
    "website": "https://www.hammr.com",
    "founded_date": 2023.0,
    "team_size": 7.0,
    "location": null,
    "group_partner": "Harj Taggar",
    "group_partner_yc": "https://www.ycombinator.com/people/harj-taggar",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": null,
    "founders": [
        {
            "name": "Brek Goin, Founder",
            "description": "Co-founder and CEO at Hammr. What I enjoy most is building relationships with customers, growing our channels, and working on product design. \n\nWhen I was 6, I told  my dad I wanted be a builder.\nNow I get the opportunity to build things for an industry that raised me.",
            "linkedin": "https://www.linkedin.com/in/brekgoin/"
        },
        {
            "name": "Sanket Firodiya, Founder",
            "description": "Co-founder and CTO at Hammr. \n\nPreviously founding engineer at Superhuman. I enjoy building software, product design, and working closely with customers to understand their worldviews.",
            "linkedin": "https://www.linkedin.com/in/sanketfirodiya/"
        }
    ],
    "status": true,
    "generated_description": "### Hammr: The All-In-One Platform Transforming Construction Payroll\n\nFounded in 2023 and part of Y Combinator's Winter 2023 batch, Hammr is carving out a niche in the construction industry by offering an integrated back-office platform tailored specifically for contractors. The company's mission—putting a \"Rippling\" spin on construction—is to simplify complex payroll, HR, compliance, and operational tasks into one cohesive solution.\n\n**What’s the Deal?**\nHammr caters to the everyday needs of construction professionals by unifying several critical functionalities under one roof. Think of it as a backstage pass for construction management, where everything from payroll, time tracking, and benefits to compliance can be managed seamlessly. \n\nThe platform allows contractors to dodge the outdated, cumbersome systems prevalent in the industry. It’s a breath of fresh air for contractors who are tired of the administrative burden and tedious paperwork that comes with managing employees in the field. Users claim it can save over 500 hours a year in administrative tasks—now that's a time and money saver.\n\n**Key Features:**\n1. **Construction Payroll**: Handle multiple pay rates and ensure compliance with prevailing wage laws effortlessly.\n2. **Time Tracking**: A mobile app designed for ease of use in both the office and the field, making tracking hours a breeze.\n3. **Benefits Management**: Streamline employee benefits directly from the platform.\n4. **Scheduling**: Quickly assign crew schedules and maximize team efficiency.\n5. **Messaging**: An integrated messaging system to keep communication flowing smoothly among teams.\n\nWith a small yet agile team of seven led by Group Partner Harj Taggar, Hammr is positioned to provide tailored support and exceptional customer service—a crucial factor when businesses transition to new systems.\n\n**Why Choose Hammr?**\nThe testimonials say it all. Contractors are raving about the ease of adoption, the responsive customer support, and the overall boost in productivity that Hammr provides. As Landon M. from Southern Sun describes it, using Hammr has transformed his company’s processes, akin to upgrading from a Model T to a Lamborghini.\n\n**Getting Started:**\nWith Hammr, contractors looking to elevate their management practices can request a demo right from their website. The user-friendly nature of the platform is designed to cater to everyone—from owners and admins to field workers.\n\nIn summary, Hammr is not just another software solution; it's a game-changer for the construction industry, aiming to minimize stress and maximize efficiency. If you're in construction and managing payroll and benefits is taking too much of your time, Hammr might just be the upgrade you need to get your business running like a well-oiled machine. \n\nFor more information, explore their [website](https://www.hammr.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/13a79083f6abd94aa8db043792b815896fe168a4.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191410Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=6c76dfa7337a73090299d4f7fc71ddb69393c983c03345156d07a5d706bfdc31",
    "social_links": [
        "https://www.linkedin.com/company/hammr/",
        "https://twitter.com/wearehammr"
    ],
    "logo_path": "data/logos\\Hammr_logo.png"
}