{
    "links": "https://www.ycombinator.com/companies/haven",
    "name": "Haven",
    "headline": "Homeownership reimagined for the 21st century.",
    "batch": "W20",
    "description": "Haven is re-imagining the $11 trillion U.S. mortgage industry, with a focus on engaging the 53 million homeowners with a mortgage. The incumbent technologies used by mortgage lenders and servicers are decades old, and the borrowers who are served by them increasingly demand modern digital experiences and frictionless financial products throughout the home journey. Haven’s mission is to deliver them at a transformational scale, and to improve lives in one of the world’s largest asset classes.\r\n\nThe company is well capitalized and backed by top fintech and mortgage venture funds and led by seasoned veterans of tech startups and financial marketplaces.",
    "activity_status": "Active",
    "website": "http://www.havenservicing.com",
    "founded_date": 2019.0,
    "team_size": 15.0,
    "location": "New York",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:proptech; location:new-york",
    "founders": [
        {
            "name": "Aditya Acharya",
            "description": "Experienced engineering leader with expertise in both sides of all fences: enterprise & consumer, front-end & back-end, IC & management.\n\nPassionate about using computers to solve hard problems to make people's lives better.",
            "linkedin": "https://www.linkedin.com/in/adityaacharya27/"
        },
        {
            "name": "Nipun Kant",
            "description": "Founder of Haven, a Series A fintech SaaS;  0->1.4M homeowners live, raised $14M, and built a 20 person team. Before Haven, I was the first employee at Industrious, a venture-backed real estate startup, where I helped take it to 450 employees and $100M ARR, mostly by leading growth, bd, corp dev, and strategy functions.\n\nBefore Haven, I attended Yale Law School and worked as a data analyst in the public sector.",
            "linkedin": "https://www.linkedin.com/in/nipun-kant-4166b35/"
        }
    ],
    "status": true,
    "generated_description": "**Company Overview: Haven**\n\nFounded in 2019 and based in New York, Haven is challenging conventional wisdom in the $11 trillion U.S. mortgage industry. With a simple yet ambitious mission—\"Homeownership reimagined for the 21st century\"—Haven seeks to transform the way homeowners experience their mortgage journey. They focus on a critical demographic: the 53 million homeowners currently navigating the outdated systems of traditional lenders.\n\n**The Problem Haven Addresses**\n\nMortgage lenders and servicers have long relied on decades-old technologies that can’t keep pace with the digital expectations of today’s borrowers. Homeowners want seamless, modern solutions that simplify their financial decisions associated with homeownership. Haven is here to fill that gap, offering a suite of digital experiences designed to engage, educate, and empower homeowners, making the complex journey of homeownership less daunting.\n\n**Backing and Leadership**\n\nHaven's efforts are well-supported, having garnered backing from renowned fintech and mortgage venture capital funds. The company's team is composed of seasoned professionals from tech startups and financial marketplaces, helping ensure that they have the expertise necessary to navigate this challenging landscape. \n\n**Core Offerings**\n\nHaven’s platform offers an all-in-one hub for home finances. It’s designed to:\n- Understand borrower intent: By anticipating future needs, Haven helps homeowners plan adequately for their financial journey.\n- Educate and engage: They aim to draw homeowners into a broader conversation about their finances beyond just payments.\n- Present personalized offers: Turning mundane payment portals into avenues for tailored financial opportunities.\n- Provide white-label solutions: Allowing various brands to present customized offerings while maintaining brand integrity.\n\n**Key Metrics**\n- They’ve engaged over **1.4 million homeowners** and generated **11% high-intent leads** through their innovative approach.\n- Their tools support various stakeholders, including servicers, subservicers, and lenders, with strategies that enhance customer retention and boost yield on mortgage servicing rights (MSRs).\n\n**Company Culture and Access**\n\nHaven embraces a culture that prioritizes simplicity and clarity in homeownership. Visitors can engage with their offerings via a user-friendly website that outlines their solutions, integration capabilities, and client success stories.\n\nWith a compact team of just 15 employees and part of the Y Combinator W20 batch, they exemplify how agility and innovation can impact a traditionally complex industry.\n\nTo learn more about their approach and explore their services, visit their website at [Haven Servicing](http://www.havenservicing.com).\n\n**Tags:** fintech, proptech, new-york\n\nIn summary, Haven stands poised as a progressive player in the mortgage landscape, making waves by modernizing an industry rife with antiquated systems. Their commitment to transforming homeownership is not just strategic—it’s a mission to simplify lives in one of our most important investments.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/5ca79c287e8a397f0afdda0059d093757d068382.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191412Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=ecb0622444ae81aa0a39c819bfa291de9e88ee836466d8e4f2fba075d153b2aa",
    "social_links": [],
    "logo_path": "data/logos\\Haven_logo.png"
}