{
    "links": "https://www.ycombinator.com/companies/healthtech-1",
    "name": "Healthtech 1",
    "headline": "Automating repetitive processes in healthcare",
    "batch": "S23",
    "description": "Healthtech-1 automates repetitive processes for healthcare systems. We’re starting with the world’s most famous: the NHS. We’re already live in over 400+ primary care practices.\r\n\nBased out of Raj's parents' Primary Care practice the Healthtech 1 team are systematically digitising the repetitive processes they experience everyday, saving thousands of hours of staff time. \r\n\nWhy now? \r\nThe UK's National Health Service (NHS) delivers free healthcare in 590 million patient contacts every year. Post-pandemic, Britain's most treasured institution is in crisis. Patient satisfaction is at 25 year low and 1/7 staff are applying for Non-NHS jobs fuelling an 11% recruitment gap. \r\n\nBy digitising the 100s of repetitive processes in healthcare, Healthtech 1 will reverse the trend, and produce the world's most productive health care system.",
    "activity_status": "Active",
    "website": "https://www.healthtech1.uk/",
    "founded_date": 2021.0,
    "team_size": 13.0,
    "location": "London, United Kingdom",
    "group_partner": "Tom Blomfield",
    "group_partner_yc": "https://www.ycombinator.com/people/tom-blomfield",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:health-tech; industry:workflow-automation; industry:digital-health; industry:healthcare; industry:healthcare-it",
    "founders": [
        {
            "name": "Raj Kohli, Founder",
            "description": "NHS Clinical Entrepreneur who grew up running around my parents primary care practice. Ex-management consultant who delivered intelligent automation projects for global banks. \n\nSometimes I teach people how to ski ⛷️",
            "linkedin": "https://www.linkedin.com/in/rajkumarkohli/"
        },
        {
            "name": "Peter Huang, Founder",
            "description": "Cofounder and Head of Product of Healthtech 1. \n\nBritish Born Chinese based in London. A deep generalist with skills in product, growth & engineering. Most recently a Web Engineer @ Monzo.\n\nI'm building a health tech automation company with a best friend from school! This is our 2nd company together, having found our true Ikigai in helping a national health system thrive. There isn't a convincing plan to fill the huge staffing gap in the NHS. This is where our automation platform fits in.",
            "linkedin": "https://www.linkedin.com/in/petejayhuang/"
        }
    ],
    "status": true,
    "generated_description": "### Healthtech 1: Revolutionizing Healthcare Administration\n\n**Overview**  \nHealthtech 1 is a healthcare technology startup that aims to automate the repetitive processes inherent in healthcare systems, beginning with the UK's National Health Service (NHS). Founded in 2021 and based in London, this burgeoning company operates from the primary care practice of its co-founder, Raj. With a lean team of 13 employees, Healthtech 1 has already integrated its automation solutions into over 400 primary care practices, striving to save thousands of hours of staff time.\n\n**The Mission**  \nThe crux of Healthtech 1's mission is straightforward: automate healthcare administration to alleviate the burden on health professionals and improve the overall productivity of healthcare systems. By focusing on digital transformation, Healthtech 1 intends to bolster patient care where it’s most needed, and help the NHS emerge from a post-pandemic crisis characterized by declining patient satisfaction and staffing shortages.\n\n**The Need for Change**  \nThe NHS handles an enormous volume of patient interactions—about 590 million each year. However, following the pandemic, the system is facing significant challenges: patient satisfaction is at a 25-year low, and the NHS is struggling with an 11% recruitment gap, as 1 in 7 staff members are seeking jobs outside the public health system. In this context, automating the myriad repetitive tasks in healthcare is not just advantageous; it's imperative.\n\n**The Approach**  \nHealthtech 1 is tackling these issues head-on with solutions like **Automated Registrations** and **Automated GP2GP Filing**. Their platform allows healthcare practices to manage patient registrations seamlessly while providing insights into patient dynamics—essentially freeing up valuable time for healthcare providers to focus on patient care rather than administrative tasks.\n\n**Funding and Growth**  \nAs part of Y Combinator's Batch S23, Healthtech 1 has garnered attention and support that positions it well for continued growth and impact in healthcare technology.\n\n**Conclusion**  \nBy bringing automation to the forefront of healthcare administration, Healthtech 1 is not just improving efficiency; it's redefining how healthcare can serve patients better. With their tools, they aim to transform the NHS into the most productive healthcare system globally, ensuring not only the survival of one of Britain’s most cherished institutions but its revival as a beacon of efficiency and patient satisfaction.\n\nFor more information, visit [Healthtech 1's website](https://www.healthtech1.uk/).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/668407d3dd3fb9cedf5f2dee2167c7a6358438f3.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191413Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=cd8bd37f8901da84ed5dbe001583a65daa7a2cb5d9b7ae326f6b76de4ffd209c",
    "social_links": [
        "https://www.linkedin.com/company/healthtech-1/",
        "https://twitter.com/healthtech_1"
    ],
    "logo_path": "data/logos\\Healthtech_1_logo.png"
}