{
    "links": "https://www.ycombinator.com/companies/healthspark",
    "name": "HealthSpark",
    "headline": "Launch and run an AI-native physical therapy practice",
    "batch": "F24",
    "description": "HealthSpark empowers physical therapists to launch and run an AI-native independent practice by automating admin tasks like insurance, scheduling, handling calls and texts, and charting.",
    "activity_status": "Active",
    "website": "https://www.joinhealthspark.com",
    "founded_date": 2024.0,
    "team_size": 2.0,
    "location": "San Francisco",
    "group_partner": "Dalton Caldwell",
    "group_partner_yc": "https://www.ycombinator.com/people/dalton-caldwell",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:artificial-intelligence; industry:health-tech; industry:digital-health; industry:healthcare; industry:ai; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Stephen Grinich, CEO & Co-Founder",
            "description": "Stephen is a software engineer building at the intersection of healthcare and AI, previously at Rad AI and 98point6. Holds a Master of Translational Medicine degree from UC Berkeley and UCSF, with a focus on health tech entrepreneurship at Berkeley Haas, and studied Computer Science at Carleton College. Now building HealthSpark to empower independent healthcare providers.",
            "linkedin": "https://linkedin.com/in/stephengrinich"
        },
        {
            "name": "Jonah Tuchow, CTO and Co-Founder",
            "description": "Jonah was an early engineer at Doctor on Demand, where he was a founding member of the revenue cycle management team. His high-impact contributions helped support the company’s rapid growth and eventual merger with Grand Rounds.",
            "linkedin": "https://www.linkedin.com/in/jonah-tuchow-3302628a/"
        }
    ],
    "status": true,
    "generated_description": "Welcome to HealthSpark—a company that’s reimagining physical therapy using AI. Founded in 2024 and proudly part of Y Combinator's Batch F24, HealthSpark is based in San Francisco. With a lean team of two, they’re on a mission to empower physical therapists to create and manage their own independent, AI-driven practices efficiently.\n\nSo, what does that look like? HealthSpark takes the pain out of practice management by handling the administrative drudgery—insurance credentialing, scheduling, call management, and charting—allowing therapists to focus on what they do best: helping patients recover and thrive. Their platform includes an AI-native Electronic Health Record (EHR) and a Call Inbox, making it easier for practitioners to keep their operations smooth and client-focused.\n\nDalton Caldwell, a seasoned partner, is a guiding force behind this innovative venture. It’s no wonder HealthSpark has resonated with those in the health tech space—they’re merging cutting-edge artificial intelligence with essential healthcare services to improve patient outcomes.\n\nImagine starting your own practice with minimal hassle. HealthSpark's offerings include a comprehensive dashboard for clients, secure messaging, billing management, and even marketing support to attract new clients. It’s a refreshing take on traditional practice management, putting control firmly in the therapists' hands, while providing all the tools they need to be successful.\n\nWorried about existing clients? HealthSpark won’t constrain your current practice; it's designed to enhance and grow it. And the best part? There’s no cost to join. It’s all about creating a supportive network for licensed physical therapists—whether they want to see clients in-person, through telehealth, or even in a home health setting.\n\nAll this is a mere scratch of the surface. If you're intrigued and want to dive deeper, visit [HealthSpark’s website](https://www.joinhealthspark.com) and explore how they’re making private practice easier and more rewarding for therapists everywhere.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/8b22d9a459beb8e4c981aae1f57dc95fab2a8aeb.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191413Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=9db5b36bdd85924fa6f80325bd8507a0a0e8e289310f27dc5f5ad94f8a618fb0",
    "social_links": [
        "https://www.linkedin.com/company/health-spark",
        "https://x.com/joinhealthspark"
    ],
    "logo_path": "data/logos\\HealthSpark_logo.png"
}