{
    "links": "https://www.ycombinator.com/companies/hedgehog-2",
    "name": "Hedgehog",
    "headline": "Building robotic mushroom farms",
    "batch": "S22",
    "description": "Hedgehog builds robotic mushroom farms. Our robots eliminate labor and our AI optimizes grow conditions to increase yield. We’ll soon grow mushrooms and fungi for <1/3rd the cost of leading growers. \r\n\nFungi may address our food system’s biggest problems: they transform agricultural waste into protein-rich foods with near-zero environmental impact. Hedgehog’s technology is unleashing fungi as our next major food source.",
    "activity_status": "Active",
    "website": "http://hedgehogfoods.com",
    "founded_date": 2022.0,
    "team_size": 4.0,
    "location": "San Francisco",
    "group_partner": "Jared Friedman",
    "group_partner_yc": "https://www.ycombinator.com/people/jared-friedman",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:artificial-intelligence; industry:robotics; industry:climate; industry:food-tech; industry:agriculture; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Jamie Balsillie, Founder",
            "description": "Jamie is a co-founder of Hedgehog, building robotic mushroom farms. He previously founded Indigo Carbon, the largest agriculture carbon credit platform. He joined Indigo Agriculture pre-revenue and helped scale sales to >$250m as GM of two new business units. Before Indigo, he worked in software and food at McKinsey & Co. In June 2022, Jamie graduated from Stanford's MBA.",
            "linkedin": "https://www.linkedin.com/in/jamie-balsillie/"
        },
        {
            "name": "Wilson Ruotolo, Founder",
            "description": "Wilson Ruotolo is a co-founder of Hedgehog, where he designs robotics for mushroom production. He received his PhD from Stanford, studying the design of robotic hands. He collaborated with NASA on end-effectors for martian exploration and his prototypes have been used to retrieve artifacts off the Mediterranean seafloor. He has first author publications in multiple journals, including Science Robotics, and his work is featured in TechCrunch, Popular Science, and Spotify’s Soft Robotics podcast.",
            "linkedin": "https://www.linkedin.com/in/wilson-ruotolo-679a6697/"
        }
    ],
    "status": true,
    "generated_description": "Hedgehog is an exciting startup founded in 2022, located in San Francisco and part of the illustrious Y Combinator Batch S22. The company is on a mission that’s both innovative and sustainable: they’re building robotic mushroom farms. By automating the growing process and using AI to optimize conditions, Hedgehog aims to reduce labor costs and increase yields, making it possible to produce mushrooms for less than a third of what leading growers do.\n\nWhy mushrooms? They’re not just tasty; fungi have the potential to transform our food systems. They convert agricultural waste into protein-rich foods while leaving a minimal environmental footprint. Hedgehog sees fungi as the next major food source, harnessing technology to unlock this potential.\n\nThe team behind Hedgehog is small but mighty, consisting of just four employees. Under the guidance of Y Combinator partner Jared Friedman, they’re tackling some of the biggest challenges in food production and climate impact. With tags like 'artificial-intelligence', 'robotics', and 'food-tech', it’s clear they’re melding advanced tech with agricultural science, all while being stationed in the vibrant San Francisco Bay Area.\n\nHedgehog's offerings are diverse, showcasing a range of mushrooms grown locally in Tennessee, including shiitake, oyster, and pioppino mushrooms—all certified organic. They pride themselves on being regeneratively farmed and sustainably sourced, catering to culinary enthusiasts and local restaurants alike. The whimsical yet down-to-earth branding invites customers to \"Eat More Curiously\" and explore the extraordinary flavors of their products.\n\nFor more on their journey, you can check out their website [Hedgehog](http://hedgehogfoods.com). They’re not just growing mushrooms; they’re on the forefront of a food revolution. Keep an eye on them—this is just the beginning.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/263dd17749f588c12c20b505323ed1dd0e2244fa.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191414Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=9cd7274e3031a90b958ed6fcd50dfe8bf852c7b3bf24e9dac889dc6b20c28610",
    "social_links": [],
    "logo_path": "data/logos\\Hedgehog_logo.png"
}