{
    "links": "https://www.ycombinator.com/companies/heimdal",
    "name": "Heimdal",
    "headline": "Affordable and verified direct air carbon capture and storage",
    "batch": "S21",
    "description": "Heimdal builds machines that permanently capture and store atmospheric CO2. Congress has passed legislation (IRA) guaranteeing a tax credit for each tonne removed via Direct Air Capture until 2044. We are building technology that profitably captures CO2 with this tax credit, right here in the United States.",
    "activity_status": "Active",
    "website": "https://www.heimdalccu.com",
    "founded_date": 2020.0,
    "team_size": 10.0,
    "location": "Denver, CO",
    "group_partner": "Gustaf Alstromer",
    "group_partner_yc": "https://www.ycombinator.com/people/gustaf-alstromer",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:carbon-capture-and-removal; industry:climate",
    "founders": [
        {
            "name": "Marcus Lima, Founder & CEO",
            "description": "Co-founder and CEO of Heimdal. I have a background in Chemistry from the University of Oslo and University of Cambridge, and a master's degree in energy system engineering from the University of Oxford. Before founding Heimdal I was a management consultant with QVARTZ (now Bain & Co) and developed various climate related projects including a reforestation project in Australia and a solar farm on the Isle of Man.",
            "linkedin": "https://www.linkedin.com/in/marcus-lima-144974101/"
        }
    ],
    "status": true,
    "generated_description": "Heimdal is an innovative company founded in 2020, based in the vibrant city of Denver, Colorado, and part of the renowned Y Combinator Batch S21. Its mission? To make carbon capture affordable and verified, effectively tackling atmospheric CO2 with cutting-edge technology.\n\n### What They Do\n\nHeimdal specializes in Direct Air Capture (DAC), a process that extracts carbon dioxide directly from the atmosphere. They’ve successfully built America’s largest DAC facility, dubbed Bantam, which has the capacity to capture over 5,000 tons of CO2 annually. This is not just a technical feat; it’s a vital step in balancing America’s carbon output as the world grapples with climate change.\n\nThe company is capitalizing on recent legislation like the Inflation Reduction Act (IRA), which offers tax credits for every tonne of CO2 removed via DAC until 2044. This combination of technology and incentivization positions Heimdal to profitably convert CO2 capture into a scalable business model right here in the U.S.\n\n### The Team and Leadership\n\nHeimdal operates with a compact team of 10 passionate employees, guided by Group Partner Gustaf Alstromer. This small but critical assembly of talent is dedicated to transforming the landscape of climate technology.\n\n### Core Values and Vision\n\nHeimdal profiles itself not just as a company, but as a vital player in the climate movement. Their vision focuses on building affordable DAC units that can be replicated across America, contributing significantly to the reduction of carbon footprints nationwide.\n\n### Get Involved\n\nIf you're interested in learning more about Heimdal, contributing to their mission, or exploring job opportunities, you can visit their [website](https://www.heimdalccu.com).\n\nIn summary, Heimdal represents a promising frontier in carbon capture technology, bringing innovation and practicality together in the fight against climate change. As their facilities scale up and their technology matures, the impact they make could be substantial—proof that sustainable solutions can also be economically viable.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/1c6b52c4b9b0d080a4b38a0502128c685dbdec9a.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191415Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=4e44f770acbcd98b596ff93ff144bfaccda4d5fbf2474d14f8f96c382f4fc3c0",
    "social_links": [
        "https://www.linkedin.com/company/72122978/",
        "https://www.crunchbase.com/organization/heimdal"
    ],
    "logo_path": "data/logos\\Heimdal_logo.png"
}