{
    "links": "https://www.ycombinator.com/companies/helpwear",
    "name": "HelpWear",
    "headline": null,
    "batch": "S17",
    "description": "HelpWear is striving to better at-home healthcare by developing affordable and accessible products for patients all around the world. HelpWear is currently developing its first product, the HeartWatch, allowing for 24/7 at home heart monitoring with an embedded emergency contact system for furthered prevention and bettered treatment of heart related illness.",
    "activity_status": "Active",
    "website": "http://helpwear.ca/",
    "founded_date": null,
    "team_size": 2.0,
    "location": "Toronto, Canada",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": null,
    "founders": [],
    "status": true,
    "generated_description": "**HelpWear Overview**\n\nHelpWear, based in Toronto, Canada, is on a mission to revolutionize at-home healthcare through innovative and accessible technology. The company is in the process of developing its flagship product, the HeartWatch, which promises continuous heart monitoring from the comfort of home. What sets HeartWatch apart is its built-in emergency contact system, enhancing preventative care and treatment for heart-related ailments.\n\nFounded as part of the prestigious Y Combinator Batch S17, HelpWear operates with a lean team of just two employees. This small team is dedicated to empowering telemedicine by creating hardware that helps patients maintain their health outside of traditional medical settings.\n\nFor more details about their offerings, you can visit their website at [helpwear.ca](http://helpwear.ca/).\n\n**Contact Information:**\n- Address: 209 Victoria St. Rm 774, Toronto, Ontario, M5B 1T8\n- Phone: (647) 863-2420\n\nHelpWear is clearly geared towards making healthcare more personalized and accessible, aligning perfectly with the growing need for remote health monitoring solutions.",
    "logo": "/logos/medium/missing.png",
    "social_links": [
        "https://www.crunchbase.com/organization/helpwear"
    ]
}