{
    "links": "https://www.ycombinator.com/companies/her",
    "name": "HER",
    "headline": "HER helps lesbian, bisexual and queer people meet each other",
    "batch": "S15",
    "description": "HER is here to connect womxn and queer people.\r\n\nOur dating app helps LGBTQ+ folks express their identity fully and unequivocally to meet someone for love, lust or anything in between. \r\nOur communities connect people to each other socially around interests and identity. Group chats around what's important to you as well as listings of LGBTQ+ evens taking place in your area. \r\n\nHER also hosts events in 12 cities across the world, helping queer womxn meet in person. Our parties are typically 300-600 people per event and we host 4 per month.",
    "activity_status": "Active",
    "website": "http://weareher.com",
    "founded_date": 2013.0,
    "team_size": 10.0,
    "location": "San Francisco",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:consumer; location:san-francisco-bay-area",
    "founders": [],
    "status": true,
    "generated_description": "HER is a vibrant dating app focused exclusively on the needs of lesbian, bisexual, and queer people, making it a game-changer in the LGBTQ+ dating landscape. Founded in 2013 and hailed as part of Y Combinator's S15 batch, the platform serves as a welcoming space where over 15 million users connect, socialize, and build relationships.\n\nThe app's mission, simply put, is to help queer individuals meet one another—whether it’s for love, lust, or friendship. HER isn’t just a dating service; it's a community that facilitates expression and connection around shared interests and identities. It features group chats, and resources, and also highlights local LGBTQ+ events, fostering a sense of belonging among its users.\n\nHER organizes events in 12 cities worldwide, hosting parties that draw between 300-600 attendees. This commitment to real-world connections adds an exciting dimension to the app, allowing users to mingle and form bonds beyond the screen.\n\nHeadquartered in San Francisco with a tight-knit team of 10, HER stands out not only for its focus on inclusivity but also for its user-friendly features. The app allows users to showcase their authentic selves through customizable profiles, complete with pronouns, sexual orientation, and unique identifiers that resonate with the queer community. This thorough approach to identity helps create deeper connections amongst users.\n\nAlthough the core app is free forever, a premium version offers added features, including incognito browsing and the ability to see who has viewed your profile. Safety is paramount at HER; their Trust and Safety team actively moderates and ensures that the app remains a respectful space for everyone.\n\nWith events, vibrant community features, and a commitment to diversity, HER doesn't just connect people— it cultivates a rich community of support and understanding. Whether you're looking for love, friendship, or simply a space where you can be you, HER has something for everyone. \n\nIf you're part of the LGBTQ+ community or just looking to expand your social circle, HER is definitely worth checking out. You can find it at [weareher.com](http://weareher.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/08d137930397fd3cb04278159eda63613a001a7c.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191418Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=7dcb1e644857665c0e2c9a6a2d5aefd4d20f41ae28cbcc254beab9d63ff4343e",
    "social_links": [
        "https://twitter.com/HerSocialApp",
        "https://www.facebook.com/hersocialapp/?ref=br_rs",
        "https://www.crunchbase.com/organization/dattch"
    ],
    "logo_path": "data/logos\\HER_logo.png"
}