{
    "links": "https://www.ycombinator.com/companies/heroic-story",
    "name": "Heroic Story",
    "headline": "AI-native Book Publishing",
    "batch": "S19",
    "description": "We're building the world's first true Author OS - an intelligent engine that will transform how stories are created, shared, and loved. Our mission is to give storytellers superpowers, removing every barrier between imagination and reality through AI. Founded by brothers who've pushed creative boundaries across VR gaming, Twitch streaming, and Hollywood, we combine deep technical expertise with an innate understanding of what makes stories work. Our CEO, a former world-class poker player, brings the same strategic depth and calculated boldness that won millions to our mission of empowering creators. We're a team of rebellious optimists who believe we're standing at the threshold of storytelling's next great evolution. The printing press gave stories reach. We're giving them wings.",
    "activity_status": "Active",
    "website": "https://heroicstory.com",
    "founded_date": 2019.0,
    "team_size": 5.0,
    "location": "Los Angeles, CA",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:entertainment; industry:marketing; industry:creator-economy; industry:ai; industry:ai-assistant; location:los-angeles",
    "founders": [
        {
            "name": "Jay Rosenkrantz, Founder",
            "description": "Co-founder and CEO. Former high-stakes poker pro turned storytelling innovator. Created a hit poker comedy series, a leading training platform, and narrative-driven VR experiences.",
            "linkedin": "https://www.linkedin.com/in/jay-rosenkrantz-05846511b/"
        },
        {
            "name": "Scott Rosenkrantz, Founder",
            "description": "Co-Founder @ Heroic Story/COO. prev. built vr games",
            "linkedin": "https://www.linkedin.com/in/scottrosenkrantz/"
        }
    ],
    "status": true,
    "generated_description": "**Heroic Story: Empowering Storytellers with AI**\n\n**Overview:**\nHeroic Story is an ambitious Los Angeles-based company redefining the landscape of book publishing through AI. Founded in 2019, it’s part of the Y Combinator Batch S19. The brainchild of two brothers who’ve navigated the worlds of VR gaming, Twitch streaming, and Hollywood, the company aims to develop the world's first true Author OS—an intelligent platform designed to empower creators by demolishing barriers between their imagination and storytelling.\n\n**Mission:**\nThe mission is clear: give storytellers superpowers using cutting-edge AI technology while ensuring they maintain creative control. They believe in ushering in a new era of storytelling, where narrative creation feels as seamless as breathing. The vision is to give stories wings, akin to how the printing press once broadened their reach.\n\n**The Team:**\nHeroic Story has a lean team of five employees, spearheaded by CEO Jay, a former world-class poker player known for his strategic thinking. COO Scott complements this with operational excellence, ensuring everything runs smoothly. Lead Designer Andy adds a professional flair, having previously amplified the brand visibility for global stars. Technical prowess is brought in by Senior Engineers Martin and Sercan, who harness machine learning to craft innovative tools. The team mascot, Aesop the Poodle, adds a creative touch to their brainstorming sessions.\n\n**Current Offerings:**\nHeroic Story is rapidly developing offerings that include AI-driven writing tools such as PlotDrive, which allows creators to write at unprecedented speeds without losing their unique voice. Their web presence actively invites aspiring authors to join their mailing list, explore products, and even apply for careers, showcasing their commitment to building a community of storytellers.\n\n**Values and Future Vision:**\nThe ethos of Heroic Story reflects a group of \"rebellious optimists,\" pushing for what they believe is the next great evolution in storytelling. They not only prioritize creativity and artistry but also lean into the economic realities of the creator economy, aiming to harmonize artistic ambitions with financial success.\n\n**Connect with Heroic Story:**\nFor those interested in the groundbreaking work being done in AI-native book publishing, you can learn more at their official website: [Heroic Story](https://heroicstory.com) or follow them on social media platforms. \n\nIn a world craving fresh narratives, Heroic Story stands at the forefront, ready to revolutionize how stories are birthed and shared—giving storytellers not just tools, but true wings.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/6561e98a34fe96e3b128e60b22073a4e498df987.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191418Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=fa81c4a3efcff4010f8de5930916e4ac4501c4c823b5e71461f025ddde4151a2",
    "social_links": [
        "https://twitter.com/_heroicstory"
    ],
    "logo_path": "data/logos\\Heroic_Story_logo.png"
}