{
    "links": "https://www.ycombinator.com/companies/heru",
    "name": "Heru",
    "headline": "Tax Automation Infrastructure",
    "batch": "S19",
    "description": "Heru is the tech-based tax solution that automates tax filing procedures for consumers and Enterprises in Mexico. Our technology automatically, files taxes, deducts expenses, issues invoices and collects payments all from one app. Easy, transparent and automated.\r\n\n14 million digital workers and SMEs in Mexico face constant stress derived from their lack of knowledge on tax related issues. By providing these users a suite of tax based solutions, we will allow them to further progress in their financial health.",
    "activity_status": "Active",
    "website": "https://www.heru.app/",
    "founded_date": 2020.0,
    "team_size": 53.0,
    "location": "Mexico City, Mexico",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:latin-america",
    "founders": [
        {
            "name": "Stiven Rodriguez Sanchez, Founder",
            "description": "Extensive background working for and advising tech companies. Started his professional and formal career at Uber in 2014, contributed to grow the company's presence from 3 cities to more than 150 in Latin America and from ~50 employees to more than ~5,000. Stiven is a Growth expert with a lot of focus on product and execution.",
            "linkedin": "https://www.linkedin.com/in/stiven-rodr%C3%ADguez-s%C3%A1nchez-b65958101/"
        }
    ],
    "status": true,
    "generated_description": "Heru is a fintech startup based in Mexico City that simplifies tax management for individuals and SMEs. Founded in 2020 and a proud member of Y Combinator's Batch S19, Heru aims to revolutionize how taxes are handled in Mexico. With a team of 53 dedicated employees, the company addresses the needs of approximately 14 million digital workers and small businesses who often find themselves overwhelmed by tax responsibilities.\n\nHeru’s mission is crystal clear: to create a tax automation infrastructure that makes tax filing straightforward and stress-free. Their technology automates the filing process, expense deduction, invoicing, and even payment collection—all from a single app. This ensures users can focus more on growing their businesses rather than getting bogged down by tax issues.\n\nThe application provides a comprehensive suite of features designed to enhance financial health. By automating tax compliance, Heru not only simplifies the filing process but also allows users to maximize their savings through meticulous expense tracking and strategic planning. Customers can readily connect their RFC (Federal Taxpayer Registry) in just two minutes, and enjoy 24/7 expert support, making tax compliance less of a headache.\n\nHeru's service has garnered trust from over 18,000 taxpayers, proving that their platform is both reliable and effective. They offer tailored plans for freelancers, enterprise professionals, and those utilizing platforms like Uber or Rappi, empowering each user to choose what fits their specific needs best.\n\nIn a world where tax laws seem increasingly complex, Heru stands out by adopting technology that not only demystifies the orders of the Mexican tax authorities but also transforms tax season from a source of anxiety into a seamless experience.\n\nIf you're looking for more information, check out their website at [Heru](https://www.heru.app/).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/0cd7b31a70505e73b1a9035f3d42a31d2db6020b.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191418Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=169bc7f8ed9bfd8f786974370b7012c52b3bb7e3ad5b943066e2a4579915d688",
    "social_links": [
        "https://www.linkedin.com/company/somosheru/",
        "https://twitter.com/somosheru",
        "https://www.facebook.com/somosheru",
        "https://www.crunchbase.com/organization/heru"
    ],
    "logo_path": "data/logos\\Heru_logo.png"
}