{
    "links": "https://www.ycombinator.com/companies/hestus-inc",
    "name": "Hestus, Inc.",
    "headline": "An AI-powered CAD software",
    "batch": "S24",
    "description": "Hestus is AI-powered CAD software that speeds up hardware development. While engineers are typically quick at coming up with initial design concepts, they are bogged down getting from idea to the final design due to countless tedious and repetitive tasks. We are building CAD software that automates these mundane tasks and speeds up the design execution process, while letting engineers spend more time on the creative part of the design process.",
    "activity_status": "Active",
    "website": "https://www.hestus.co",
    "founded_date": 2024.0,
    "team_size": 3.0,
    "location": null,
    "group_partner": "Michael Seibel",
    "group_partner_yc": "https://www.ycombinator.com/people/michael-seibel",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": null,
    "founders": [
        {
            "name": "Sohrab Haghighat, Founder",
            "description": "Sohrab is a 2x YC founder, currently running Hestus, Inc (S24). Prior to that, Sohrab was founder and CEO of SpaceRyde (W19), a space transportation company, and ran the company for 6 years before selling the IP. Before starting SpaceRyde, Sohrab was an early employee of Cruise and ran Planning and Controls Teams.\nSohrab holds a PhD in Aerospace Engineering, has published 13 patents and 23 technical papers.",
            "linkedin": "https://www.linkedin.com/in/sohrabhaghighat/"
        },
        {
            "name": "Kevin Chu, Founder",
            "description": "Kevin is leading the engineering and product as the CTO at Hestus (S24).  Previously, he led Autonomous Vehicle engineering at Cruise, growing the team from 20 to 300 over seven years and holds a Robotics PhD from UCLA. He also worked in multiple robotics startups including energy and medical spaces",
            "linkedin": "https://linkedin.com/in/kevin-chu-11a4511"
        }
    ],
    "status": true,
    "generated_description": "Hestus, Inc. is an exciting new player in the world of hardware development, specifically through its innovative AI-powered CAD (Computer-Aided Design) software. Founded in 2024 and currently part of Y Combinator's Batch S24, Hestus aims to streamline the typically laborious design process that engineers face. While engineers can quickly conceptualize ideas, they often find themselves swamped by the repetitive tasks necessary to finalize their designs. Hestus addresses this issue by automating those tedious elements, allowing engineers to focus more on creativity and less on grunt work.\n\nThe software currently supports Autodesk Fusion 360, with plans to extend compatibility to other CAD platforms in the future. The company's mission—\"Dream. Design. Deliver.\"—summarizes their commitment to enhancing hardware development efficiency. It’s a clear commitment: speed up the design execution process so engineers devote their time to the innovative aspects of their work.\n\nTeam-wise, Hestus is lean, consisting of just three members based in an unspecified location, and they benefit from the mentoring of Michael Seibel as their group partner at Y Combinator. \n\nIf you’re keen to explore Hestus further, you can check out their offerings and even try the software for free on their website: [Hestus, Inc.](https://www.hestus.co). As they expand and refine their solution, they undoubtedly have exciting things ahead.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/ce68625d0c2e23b12977da4387c4a242277ae54f.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191418Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=b25b1e0d12c01ce3157058e6b720d4c9aeba5c1270e14467005d15da9c3c9cc2",
    "social_links": [
        "https://www.linkedin.com/company/hestus-inc"
    ],
    "logo_path": "data/logos\\Hestus,_Inc._logo.png"
}