{
    "links": "https://www.ycombinator.com/companies/quid",
    "name": "Hilos",
    "headline": "Zapier for WhatsApp.",
    "batch": "S21",
    "description": "Hilos allows startups and SMBs to run their entire business on WhatsApp, without code. We focus specifically on letting businesses build apps within WhatsApp that integrate with other systems (CRMs, Databases, Payment providers, etc.).\r\n\nCompanies can use Hilos to allow their customers to run self serve processes like tracking the status of a package, generating payment links, creating an invoice on demand, or anything else you can dream up.",
    "activity_status": "Active",
    "website": "https://hilos.io",
    "founded_date": 2021.0,
    "team_size": 5.0,
    "location": "Mexico City, Mexico",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:saas; industry:b2b; industry:productivity; industry:messaging",
    "founders": [
        {
            "name": "Florian Raetzer, Founder",
            "description": "German & Mexican with a product & ops background. Excited about letting companies build on top of WhatsApp to make everyone's life easier!",
            "linkedin": "https://www.linkedin.com/in/florian-raetzer/"
        },
        {
            "name": "Alfonso Lizárraga, Founder",
            "description": "Looking for social problems to solve in LATAM through tech and product design.",
            "linkedin": "https://www.linkedin.com/"
        }
    ],
    "status": true,
    "generated_description": "### Hilos: The Zapier for WhatsApp\n\nFounded in 2021 and part of Y Combinator's S21 batch, Hilos is a dynamic startup based in Mexico City, with a core mission: to enable businesses to run their operations seamlessly on WhatsApp without requiring any code. Think of it as the \"Zapier for WhatsApp,\" bridging the gap between complex systems and user-friendly messaging environments.\n\n#### What They Offer\n\nHilos simplifies customer interactions by allowing startups and small to medium-sized businesses (SMBs) to build automated applications directly within WhatsApp, integrating effortlessly with various tools such as CRMs, databases, and payment providers. This means that companies can create self-service solutions for their customers—like tracking orders, generating payment links, or handling invoices—all through WhatsApp.\n\nWith a compact team of five, Hilos streamlines processes that typically consume significant resources and time, thereby boosting efficiency and sales conversions. The platform includes:\n\n- **Flows:** Automate conversations with customers.\n- **Inbox:** A multi-agent inbox designed for businesses to manage chats effectively.\n- **Broadcasts:** Send out WhatsApp newsletters and mass messages.\n\nMoreover, integration with services like **Zapier** expands Hilos' functionality, allowing it to connect with any system your business may already be using.\n\n#### Why Hilos Matters\n\nIn a world where swift communication can differentiate between closing a sale or losing a lead, Hilos leverages WhatsApp's widespread usage and familiarity among consumers to facilitate business communications. Their focus on automation means that sales teams can spend less time on repetitive tasks and more time on what truly matters—engaging with potential customers and closing deals.\n\nBusinesses using Hilos have reported significant improvements in their operations, such as achieving up to an 80% recovery rate of unfinished requests and a staggering 99% delivery rate for authentication messages. The platform's design makes it incredibly accessible for companies at various stages of growth, letting them enhance customer experience without the heavy lifting usually associated with tech integrations.\n\n#### Getting Started\n\nWant to see Hilos in action? You can schedule a demo or connect with them via WhatsApp directly through their website at [hilos.io](https://hilos.io). Pricing starts from $199 USD per month, providing a cost-effective solution for enhancing customer engagement through one of the most popular messaging platforms globally. \n\nIn an increasingly competitive landscape, tools like Hilos offer not just an opportunity for improvement but a formidable edge in customer engagement and operational efficiency. Whether you're a startup or an established SMB, Hilos might just be the game changer you need to elevate your WhatsApp communications.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/ddd89494399a68986e04ddc4e1bf7fb445d307d3.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191419Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=d09eeef2d80976f1350b6e1fbbd070c166e9b6ed347c56b18bc261014b2168c1",
    "social_links": [
        "https://www.linkedin.com/company/hilos-io",
        "https://twitter.com/HilosIO"
    ],
    "logo_path": "data/logos\\Hilos_logo.png"
}