{
    "links": "https://www.ycombinator.com/companies/hippo-scribe",
    "name": "Hippo Scribe",
    "headline": "AI assisted documentation for PT/OT/SLP",
    "batch": "W23",
    "description": "Burdensome documentation is the #2 reason causing burnout for physical therapists. More than half of all physical therapists have to write documentation in their free time without pay. up to 2 hours a day. \r\n\nOur AI Scribe listens, generate first draft of clinical documentation in minutes, and sync reviewed documentation to EMR in 2 seconds. With us, clinicians can finish documentation 70% faster and become happier.",
    "activity_status": "Active",
    "website": "https://gethipposcribe.com",
    "founded_date": 2023.0,
    "team_size": 2.0,
    "location": null,
    "group_partner": "Jared Friedman",
    "group_partner_yc": "https://www.ycombinator.com/people/jared-friedman",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:artificial-intelligence; industry:health-tech; industry:healthcare; industry:ai; industry:ai-assistant",
    "founders": [
        {
            "name": "Yansen Zhou, Founder",
            "description": "Software engineer building in healthcare",
            "linkedin": "https://www.linkedin.com/in/yansen-zhou/"
        }
    ],
    "status": true,
    "generated_description": "**Company Overview: Hippo Scribe**\n\nFounded in 2023 and part of Y Combinator's Batch W23, Hippo Scribe is on a mission to alleviate documentation burnout for physical therapists (PT), occupational therapists (OT), and speech-language pathologists (SLP). The stark reality is that around half of all physical therapists spend up to two hours a day writing documentation in their off hours, leading to significant burnout—second only to the demands of patient care itself.\n\n**What do they do?**\n\nHippo Scribe leverages AI to streamline the documentation process. Their AI Scribe listens to clinician notes and generates first drafts of clinical documentation within minutes. Once reviewed, the documentation can be synced to electronic medical records (EMR) in just two seconds. This approach has been shown to enable clinicians to complete their documentation 70% faster, making them not only more efficient but also happier in their roles.\n\n**How does it work?**\n\n1. **Ambient Listening**: Clinicians can dictate their notes or record patient visits.\n2. **Automatic Drafting**: The app generates notes in about 30 seconds after recording.\n3. **Integration with EMRs**: The documentation can be easily integrated into any web-based EMR system, streamlining workflow further.\n\n**Team and Environment**\n\nHippo Scribe currently has a small team of two, operating remotely, with Jared Friedman serving as their group partner. This compact team structure allows for quick iterations and responsiveness to user feedback.\n\n**Market Position**\n\nHippo Scribe fits snugly into a niche at the intersection of artificial intelligence and healthcare, tagged under categories such as 'health-tech' and 'AI assistant.' Their commitment to reducing clinician burnout while improving the quality and efficiency of healthcare documentation is not just transformative for individual practices but also pivotal for the industry.\n\n**Pricing**\n\nHippo Scribe offers a “Free Forever” tier for up to five visits per week, which requires no credit card details. For $99 a month, clinicians gain access to unlimited visits and custom templates along with full EMR integration. There are also options for group pricing and discounts for pro bono clinics or students.\n\n**User Feedback**\n\nTestimonials highlight how Hippo Scribe significantly reduces documentation time and enhances productivity, with users praising its ease of use and effectiveness. Responses suggest that the tool not only helps with the documentation burden but also positively impacts the overall clinician-patient interaction.\n\n**Conclusion**\n\nIn sum, Hippo Scribe is positioning itself as a game-changer in healthcare documentation, making strides to relieve burnout among therapists while maintaining compliance with healthcare regulations such as HIPAA. For therapists looking to reclaim their time and enhance their practice, Hippo Scribe is certainly worth considering. \n\nFor more information, visit [Hippo Scribe's website](https://gethipposcribe.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/0a6fbbf47935987a6d816af51ccd9f8f72c0eb06.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191419Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=dd91d3c0c45973824548cd36ecb121e5881943e23e4fd56c62ee931011fb6725",
    "social_links": [
        "https://www.linkedin.com/company/100888807/"
    ],
    "logo_path": "data/logos\\Hippo_Scribe_logo.png"
}