{
    "links": "https://www.ycombinator.com/companies/hiration",
    "name": "Hiration",
    "headline": "We help job seekers quickly create resumes that get 2X more interviews",
    "batch": "W20",
    "description": "Our SaaS product solves the different problems that job seekers face in the process of finding a new job - creating an efficient resume, writing a cover letter/email, updating their LinkedIn profile, applying to suitable jobs, interview preparation...\r\nIt's the 1st time in history that we've been able to create resumes using technology that surpass human made resumes.\r\nThis is a novel way to add active job seekers to our database of resumes as none of the incumbents are focussing on candidates' problems.\r\n100k+ new active job seekers are added to our database every month, growing rapidly.\r\nAs the next step, we are launching a recruitment marketplace to close the loop.",
    "activity_status": "Active",
    "website": "https://www.hiration.com/",
    "founded_date": 2017.0,
    "team_size": 22.0,
    "location": "New Delhi, India",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:marketplace; industry:saas; industry:recruiting",
    "founders": [
        {
            "name": "Anish Raj Sikka, Founder",
            "description": "I went to IIT D & IIM C for my B. Tech. & MBA degrees.\nPost MBA, I worked with BCG as a consultant but quickly moved on to join the founding team of this hospitality startup, ZO Rooms, which was 1 hell of a ride. We raised $30M+, scaled from 10 to 600 employees and got acquired in <2 years!\nHad a lot of insane learning from ZO & since then, I've been working on Hiration to solve a problem very near to my heart: helping people in finding new jobs & achieving their dream careers.",
            "linkedin": "https://www.linkedin.com/in/anishrajsikka/"
        },
        {
            "name": "Aditya Sharma, Founder",
            "description": "I'm the Co-Founder and CTO of Hiration and have a deep interest in AI, especially NLP, which we also leverage heavily at Hiration. I have a total work experience of 9 years, 7 of which have been spent building companies where I've led the Data Science team or the Software Engineering team. I strongly believe that \"Quick iteration with the right set of customers\" is the only way to build successful products.",
            "linkedin": "https://linkedin.com/in/aditya-sharma/"
        }
    ],
    "status": true,
    "generated_description": "Hiration is shaping the future of job hunting. Founded in 2017 as part of Y Combinator’s W20 batch, this New Delhi-based company has a clear mission: to help job seekers create resumes that double their chances of landing interviews. They’ve tapped into the power of technology to address persistent challenges faced by candidates—everything from crafting effective resumes and cover letters to optimizing LinkedIn profiles and preparing for interviews.\n\nWhat's striking about Hiration is their innovative approach. For the first time, they've developed a SaaS product that outperforms human-made resumes by using AI. This isn’t just another resume builder; it's a sophisticated platform that actively solves real problems for job seekers, which the industry often overlooks. Hiration is a rapidly growing entity, adding over 100,000 new active job seekers to its database every month.\n\nAs they scale, Hiration is gearing up to launch a recruitment marketplace, effectively creating a circular ecosystem that connects job seekers with potential employers. They offer a suite of tools including a resume builder, resume review service, cover letter creation, LinkedIn profile optimization, and interview preparation—powered by, you guessed it, AI.\n\nBacked by a small team of 22 and a group partner named Nan, Hiration is positioned at the intersection of marketplace and SaaS within the recruiting space. If you’re looking for an edge in your job search, Hiration is clearly worth a look. You can explore what they offer at their website: [Hiration](https://www.hiration.com/). \n\nIn summary, for anyone navigating the tricky waters of job hunting, Hiration presents a refreshing solution that's innovative, user-focused, and ever-evolving.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/23ba0252dfb59aeddb13d5c23cbe4939a17cffa9.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191419Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=a02ef09332c45fae7b1e97c3970fcfb4003d9b2d5fa5e9fe3d1ad30356499668",
    "social_links": [
        "https://www.linkedin.com/company/hiration",
        "https://twitter.com/teamhiration",
        "https://www.facebook.com/Hiration",
        "https://www.crunchbase.com/organization/hiration"
    ],
    "logo_path": "data/logos\\Hiration_logo.png"
}