{
    "links": "https://www.ycombinator.com/companies/hitpay",
    "name": "HitPay",
    "headline": "Payments infrastructure for businesses scaling in APAC",
    "batch": "S21",
    "description": "HitPay is a full stack payments infrastructure platform designed for growing businesses in APAC. Founded in 2016 and headquartered in Singapore, HitPay unifies e-commerce, point of sale, and B2B payments into a single platform. The company is regulated in 6 APAC jurisdictions and backed by leading global investors, including Tiger Global, Y Combinator, Global Founders Capital, and HOF Capital.",
    "activity_status": "Active",
    "website": "https://www.hitpayapp.com",
    "founded_date": 2016.0,
    "team_size": 33.0,
    "location": "Singapore, Singapore",
    "group_partner": "Nicolas Dessaigne",
    "group_partner_yc": "https://www.ycombinator.com/people/nicolas-dessaigne",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:payments",
    "founders": [
        {
            "name": "Aditya Haripurkar, Founder",
            "description": "Aditya has a background in financial services. He has graduated from INSEAD and worked at Barclays Capital and RBS. Prior to starting HitPay, Aditya worked at mid-tier SMBs from varied industries such as web analytics consulting and commodities trading.",
            "linkedin": "https://www.linkedin.com/in/adityaharipurkar/"
        },
        {
            "name": "Nitin Muthyala, Founder",
            "description": "Nitin has a background in software engineering. He graduated from the National University of Singapore (NUS) and worked at a cybersecurity startup in Singapore before joining DBS Bank.",
            "linkedin": "http://linkedin.com/in/nitinmuthyala/"
        }
    ],
    "status": true,
    "generated_description": "**HitPay** \n\nFounded in 2016, HitPay is a Singapore-based fintech company aimed at transforming the payments landscape for businesses across the APAC region. With a team of 33 employees, HitPay operates as a full-stack payment infrastructure platform designed specifically for growing businesses to streamline their payment processes. The company integrates e-commerce, point of sale (POS), and B2B transactions into a unified solution, which is beneficial for companies ready to scale. \n\n### Mission\nHitPay's mission is clear: to provide robust payment infrastructure for businesses looking to expand in the APAC market. The platform enables merchants to accept a variety of payment methods, ensuring flexibility and accessibility for their customers.\n\n### Backing & Regulation\nHitPay is regulated across six APAC jurisdictions and has garnered support from notable investors such as Tiger Global, Y Combinator, and Global Founders Capital. Being part of Y Combinator's Batch S21 is a testament to its potential and credibility in the fintech sector.\n\n### Products & Services\nHitPay’s offerings include:\n- **Online Payment Solutions:** Businesses can accept payments via various popular methods, ensuring customer convenience.\n- **Point of Sale Systems:** Integrated POS features that assist with inventory management and sales tracking enable nuanced sales strategies.\n- **E-commerce Integration:** HitPay seamlessly integrates with platforms like Shopify and WooCommerce, making it easier for businesses to manage online sales.\n- **Smart Billing Tools:** Features such as invoicing, recurring billing, and payment links assist merchants in getting paid on time.\n- **APIs for Developers:** Access to powerful payment APIs allows businesses to tailor solutions to their specific needs.\n\n### Financials\nAs of now, the company has processed thousands of transactions with growing monthly volumes. It also prided itself on recent metrics showing daily transaction amounts indicating a steady upward trend in activity.\n\n### Closing Thoughts\nIn summary, HitPay is on a solid trajectory to redefine the payment processing experience for businesses in the APAC region. With a strong foundation, robust investor backing, and a user-friendly approach, HitPay is poised for ongoing success in supporting business growth through smart payment solutions.\n\nIf you're ready to elevate your payment processing experience, you can check out their offerings on their [website](https://www.hitpayapp.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/dc59318e02a8cdbde0d1cb1ca8bffb90b7399adb.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191420Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=f67cf66d9a34510257ba3e6c9236142320f73ede6c76aa6f1947da2591ee18c4",
    "social_links": [
        "https://www.linkedin.com/company/hit-pay",
        "https://www.twitter.com/officialhitpay",
        "https://www.facebook.com/HitPaynow/",
        "https://www.linkedin.com/company/hit-pay",
        "https://github.com/hit-pay"
    ],
    "logo_path": "data/logos\\HitPay_logo.png"
}