{
    "links": "https://www.ycombinator.com/companies/hokali",
    "name": "HOKALI",
    "headline": "After School & Enrichment Activities Marketplace",
    "batch": "W22",
    "description": "HOKALI is the marketplace for buying after-school programs and enrichment activities with high-quality, vetted vendors in the US. We simplify the process of booking, organizing, and managing after-school programs and camps for schools.",
    "activity_status": "Active",
    "website": "https://www.hokali.com/",
    "founded_date": 2020.0,
    "team_size": 12.0,
    "location": "San Francisco",
    "group_partner": "Michael Seibel",
    "group_partner_yc": "https://www.ycombinator.com/people/michael-seibel",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:marketplace; industry:edtech; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Ignacio Viau, Founder/CEO",
            "description": "Ignacio Viau is a driven entrepreneur and a qualified lawyer with a strong background in business development and sales. As the CEO of HOKALI, he leads a platform that streamlines after-school programs and enrichment activities in the U.S. Ignacio has launched three startups and successfully managed the strategic releases of new products, showcasing his talent for building and scaling ventures. His unique combination of legal expertise and entrepreneurial spirit positions him to navigate complex",
            "linkedin": "https://www.linkedin.com/in/ignacio-javier-viau-4567b459/"
        },
        {
            "name": "Tomas Bisi, Founder",
            "description": "Waterman & sports enthusiast, Tech Entrepreneur, CTO, Product Manager, Software Developer, and Consultant. Passionate about new technologies. Experienced professional with a demonstrated history of working in the computer software industry. Strong engineering professional with a Master's degree focused in Computer Science from 42 Silicon Valley University.",
            "linkedin": "https://www.linkedin.com/in/tomasbisi/"
        }
    ],
    "status": true,
    "generated_description": "**HOKALI: Revolutionizing After-School Activities**\n\nFounded in 2020 and based in San Francisco, HOKALI serves as an innovative marketplace dedicated to after-school and enrichment activities in the U.S. With a team of 12 passionate individuals and supported by Y Combinator (W22 Batch), HOKALI simplifies the process of discovering, booking, and managing high-quality after-school programs and camps for schools.\n\n### Mission Statement\nHOKALI's core mission is to streamline how schools access and manage after-school programs. The platform connects schools with vetted vendors, ensuring that students receive enriching experiences that boost their learning and personal growth.\n\n### What HOKALI Does\nThe platform offers a broad range of activities—from visual arts and sports to dance and cooking—making it easy for schools to find and book programs that align with their educational goals. HOKALI’s comprehensive system facilitates online registrations, manages payments, and supports funding through ELO-P, easing administrative burdens for educators. \n\n### Key Features:\n- **Centralized Platform**: All enrichment activities are accessible through one simple interface.\n- **High-Quality Vendors**: Programs are offered by pre-vetted instructors, alleviating the stress of finding reliable sources.\n- **Variety of Programs**: From before school inspiration to exciting day camps, HOKALI covers all bases to enrich students' extracurricular experiences.\n\n### Trusted Partnerships\nHOKALI has built a strong network, currently collaborating with over 100 schools and school districts. Feedback from educators highlights the platform's effectiveness and reliability, often praising the diversity of classes and the love for the enrichment options provided.\n\n### Why It Matters\nHOKALI is more than just a marketplace; it’s a community-focused solution aiming to enhance children's educational journeys. By bridging the gap between schools and high-quality enrichment programs, HOKALI is setting the stage for a revolution in after-school learning.\n\n### Additional Information\n- **Website**: [HOKALI](https://www.hokali.com/)\n- **Contact**: (415) 707-2892 | support@hokali.co\n- **Location**: San Francisco, CA\n\nIn a landscape where educational resources can sometimes feel fragmented and difficult to sift through, HOKALI offers a refreshing solution that's straightforward and impactful. The future of after-school programming is here, and it looks promising.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/08ff2215ffa6ff0683701c13ab8605121e3c346b.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191421Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=f68888b7c23fbc6ea75901ce70bcbce13d7a9cfc9e5eb09880823b6f6f4a139f",
    "social_links": [
        "https://www.linkedin.com/company/42697643/admin/",
        "https://twitter.com/hokalico",
        "https://www.facebook.com/HOKALI.co/",
        "https://www.crunchbase.com/organization/hokali"
    ],
    "logo_path": "data/logos\\HOKALI_logo.png"
}