{
    "links": "https://www.ycombinator.com/companies/homebase",
    "name": "Homebase",
    "headline": "Personalized rent-to-own real estate financing using technology in SEA",
    "batch": "W21",
    "description": "Homebase provides Rent-To-Own real estate financing for buyers in Southeast Asia - the only alternative to inflexible/high-interest rate (12%+) mortgages in the region. We strive to provide more innovative, compelling, and empathetic solutions for those who aspire to own a home.\r\n\nHomebase was founded in 2019 in Singapore and is backed by Y Combinator, VinaCapital Ventures, Class 5 Global, Pegasus Technology Ventures, 1982 Ventures, Iterative VC and Antler, as well as the founders and executives at disruptive real estate financing companies including Opendoor, Zerodown, 99.co and Divvy Homes.",
    "activity_status": "Active",
    "website": "http://www.gethomebase.com/",
    "founded_date": 2019.0,
    "team_size": 20.0,
    "location": "Ho Chi Minh City, Vietnam",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:proptech",
    "founders": [
        {
            "name": "Phillip An, Founder",
            "description": "Founder at Homebase (YC W21)",
            "linkedin": "https://www.linkedin.com/in/phillipan/"
        },
        {
            "name": "Jun Yuan Tan, Founder",
            "description": "JY is the Co-founder and CEO of Homebase. Before this, he was CEO & Co-founder of Reprice Technologies, a VC-backed software company, and Atlantis Lab, a VC-backed blockchain development & advisory firm. JY studied computer science at University of Pennsylvania, business at University of Manchester and has completed all 3 levels of CFA.",
            "linkedin": "https://www.linkedin.com/in/jy-tan/"
        }
    ],
    "status": true,
    "generated_description": "Homebase is a promising venture launched in 2019 in Singapore, aimed at reshaping the real estate financing landscape in Southeast Asia (SEA). With its mission to provide personalized rent-to-own real estate financing, Homebase stands as a compelling alternative to the rigid and often exorbitantly priced mortgages (12%+ interest rates) that dominate the region. \n\nFounded during the Y Combinator Batch W21, Homebase has garnered support from prominent investors including VinaCapital Ventures and Class 5 Global, as well as industry veterans from companies like Opendoor and Divvy Homes. With a dynamic team of around 20 based in Ho Chi Minh City, Vietnam, they’re set to disrupt traditional home financing with innovative, empathetic solutions for aspiring homeowners.\n\n### Services Offered\n\nHomebase primarily serves three types of clients:\n- **Homebuyers:** They can purchase properties with as little as 8% down and benefit from financing that supports up to 80% of the home value. This service is designed to make homeownership accessible without the usual mountains of paperwork or stringent income verification common in traditional lending.\n  \n- **Homeowners:** For current homeowners, Homebase offers products that allow them to unlock up to 80% of their home's value, presenting a more flexible alternative to standard mortgages.\n  \n- **Investors:** Homebase provides opportunities for investors to earn passive income by supporting homebuyers in securing bank loans, all without requiring initial capital.\n\n### The Landscape\n\nHomebase is well-positioned within the fintech and proptech fields, seeking to enhance life in Asia by making property investment achievable for more people. The company has won accolades, such as being recognized by Plug & Play Center and KPMG, and has been featured in notable publications like Forbes and Vietcetera.\n\n### Community Impact\n\nThe company is more than just a financial institution; it aims to empower individuals by turning homeownership dreams into reality across Southeast Asia. They focus on delivering accessible financial products that cater to both local and foreign citizens, making strides to improve living standards and financial empowerment in the region.\n\n### Conclusion\n\nThrough its innovative approach to real estate financing and a clear commitment to customer success, Homebase looks to redefine what it means to own a home in Southeast Asia. Their user-centric design and process not only emphasize empathy but also open the door to new possibilities for many who previously thought homeownership was out of reach.\n\nYou can learn more about them on their website: [Homebase](http://www.gethomebase.com/).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/a1d3ddf75a0d393a03b71b59b00493c0f7040b1e.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191421Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=b83598ab92a11741d9d65dde51c817cc959f8327bc6c161ff1ab18c6f92f8924",
    "social_links": [
        "https://www.linkedin.com/company/gethomebase",
        "https://www.facebook.com/gethomebase",
        "https://www.crunchbase.com/organization/homebase-ad4c",
        "https://github.com/homebaseio"
    ],
    "logo_path": "data/logos\\Homebase_logo.png"
}