{
    "links": "https://www.ycombinator.com/companies/hotplate",
    "name": "Hotplate",
    "headline": "Online ordering platform for independent chefs and bakers.",
    "batch": "S20",
    "description": "Hotplate is changing how people sell food across the US by giving Chefs and Bakers the tools necessary to solo launch and manage a food business online. There are talented people around the world capable of making amazing food, but either due to a lack of awareness, financial constraints, or the daunting overhead costs associated with traditional brick-and-mortar businesses, many never venture into this space independently. \r\n\nHotplate is fueling a new model of food sales, allowing anyone to create a storefront, announce a sale, and coordinate local pickups with hundreds, or even thousands of customers—all within a 10-minute setup. \r\n\nOur aim is to make the food industry more available to everyone with the desire to enter it, consequently making food more accessible and diverse across the United States.",
    "activity_status": "Active",
    "website": "http://www.hotplate.com/",
    "founded_date": 2020.0,
    "team_size": 8.0,
    "location": "San Francisco",
    "group_partner": "Michael Seibel",
    "group_partner_yc": "https://www.ycombinator.com/people/michael-seibel",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Ben Klenk, Founder",
            "description": "I hope that one day a new batch member will excitedly be looking at this profile",
            "linkedin": "https://www.linkedin.com/in/benklenk/"
        },
        {
            "name": "Rishi Talati, Founder",
            "description": "I’m a curious guy who is always interested in meeting new people, so ping me if you want to chat about anything!",
            "linkedin": "https://www.linkedin.com/in/rishitalati/"
        }
    ],
    "status": true,
    "generated_description": "**Hotplate: Revolutionizing Food Sales for Independent Chefs and Bakers**\n\nFounded in 2020 and hailing from San Francisco, Hotplate is on a mission to redefine how food is sold across the United States. This online ordering platform empowers independent chefs and bakers by giving them the tools to launch and manage their food businesses without the heavy burdens of traditional brick-and-mortar establishments.\n\n### The Problem They're Solving\n\nDespite the culinary talent that exists worldwide, many skilled cooks hesitate to take the leap into entrepreneurship due to a lack of visibility, high overheads, and the complexities of navigating food sales on existing platforms. Hotplate recognizes that the food industry should be more inclusive, enabling any passionate individual to create a unique storefront and efficiently manage local sales — all within a mere ten minutes of setup.\n\n### How It Works\n\nWith Hotplate, chefs can effortlessly create their food storefronts, announce sales, and manage local pickups. The platform has already facilitated over 1.2 million orders, accounting for over $40 million in sales. Hotplate stands out with features like oversell protection, automatic customer reminders, and a streamlined management interface — designed specifically for high-volume food sales.\n\n### Getting Started\n\nSetting up a sale on Hotplate is straightforward and swift, taking about three minutes on average. The platform's built-in features ensure that chefs can manage inventory, sales limits, and customer profiles effortlessly. The result is a hassle-free experience that allows chefs to focus on their passion — cooking.\n\n### User Experience and Growth\n\nTestimonials from users highlight the platform's user-friendliness and reliability. Many chefs have shared how they’ve transformed their operations, reducing the busy hours spent managing orders through direct messages and outdated systems. Hotplate dramatically simplifies this, creating a seamless workflow for vendors and a superior shopping experience for customers.\n\n### Future Developments\n\nAs a participant in the Y Combinator Batch S20, Hotplate is backed by experienced mentors, including Group Partner Michael Seibel. The company is on a promising trajectory, continuously building new tools to further simplify food sales. Upcoming features include enhanced SMS customer reminders, integrations with point-of-sale systems, and detailed analytics to boost business operations.\n\n### The Goal\n\nUltimately, Hotplate's vision is about democratizing the food industry. By providing a robust platform for independent chefs and bakers, they aim to increase food accessibility and diversify culinary offerings across the nation.\n\nFor more information or to join this food revolution, visit [Hotplate's Website](http://www.hotplate.com/).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/390de87ac0b88b5e76fedf46f7b0f2a2125bfcb0.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191423Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=04177a615789663f592015244d1471768dd2d74893e4f3a3869c05be14642cdb",
    "social_links": [
        "https://www.linkedin.com/company/hotplates/",
        "https://twitter.com/realHotplate",
        "https://www.facebook.com/hotplateatx/",
        "https://www.crunchbase.com/organization/hotplate"
    ],
    "logo_path": "data/logos\\Hotplate_logo.png"
}