{
    "links": "https://www.ycombinator.com/companies/howdy-com",
    "name": "Howdy.com",
    "headline": "We help US tech companies hire and manage software engineers in LATAM",
    "batch": "W21",
    "description": "Why Howdy.com?\r\n\nHowdy was founded in 2018 to help Austin startups hire talented engineers who work within US time zones in Latin America.\r\n\nSince then we’ve grown to a team of over 300, and our platform has enabled hundreds of companies to hire individual teammates, set up remote, hybrid or in-office teams, and manage remote equipment assets and benefits.\r\n\nJoin over 200 companies, like Coinbase, Kojo,Truepill, Vanta and other YC companies that have hired with Howdy to build their tech outpost in Latin America.\r\n\nBetter talent: Howdy is deeply involved in the Latin American tech scene, regularly hosting meetups and inviting speakers and industry leaders into our local communities called Howdy Houses throughout Latin America. We get to personally know the top tech leaders who are interested in joining product teams in the US for the long-term. These individuals are not actively seeking jobs through freelancer platforms.\r\n\n98% retention: Developer churn slows teams down. That’s why, when you hire with Howdy, developers are automatically provided with premium health insurance, top-of-the-line Apple equipment, gym memberships, lunches and the use of class-A office spaces.\r\nYour engineering culture: When you partner with Howdy, you're not just hiring individuals; you're gaining access to a skilled local workforce that becomes an extension of your team. We provide full support in all areas, from recruitment to equipment and office spaces, allowing you to build and directly oversee your engineering outpost in Latin America as your team grows.\r\n\nAll-in monthly pricing:\r\n\nSoftware Developer:       $6k - 11k\r\n\nFinance Back-office:       $1.8K - 3K\r\n\nCustomer Service:          $1.8K - 3K\r\n\nDesigner:                        $1.8K - 4K\r\n\nMarketing:                       $2k - 4K\r\n\n*All-in monthly rate includes: salary, taxes, benefits, computer, equipment, office space, Howdy fee & more",
    "activity_status": "Active",
    "website": "https://www.howdy.com/",
    "founded_date": 2018.0,
    "team_size": 300.0,
    "location": "Austin, TX",
    "group_partner": "Jared Friedman",
    "group_partner_yc": "https://www.ycombinator.com/people/jared-friedman",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:b2b; industry:recruiting; location:austin",
    "founders": [
        {
            "name": "Jacqueline Samira, Founder/CEO",
            "description": "Jacqueline Samira identified a critical gap in the tech industry and addressed it by connecting U.S. businesses with top talent from Latin America. Her approach goes beyond traditional business models, emphasizing cultural understanding and the welfare of those individuals she places. Jacqueline is focused on solving real-world problems and making a significant impact on both the American and Latin American tech communities.",
            "linkedin": "https://www.linkedin.com/in/jacquelinesamira/"
        },
        {
            "name": "Frank Licea, Founder",
            "description": "Austin Software",
            "linkedin": "https://www.linkedin.com/in/franklicea/"
        }
    ],
    "status": true,
    "generated_description": "**Howdy.com: Connecting U.S. Tech Companies with Latin American Talent**\n\nFounded in 2018, Howdy.com was born out of a simple yet powerful mission: to help U.S. tech companies hire and manage software engineers based in Latin America (LATAM). What initially started as a response to the hiring challenges faced by Austin startups has evolved into a significant player in the recruiting space, especially for those looking for talent that operates within the U.S. time zones.\n\n### Key Highlights:\n- **Team and Growth**: Starting from a small operation, Howdy has scaled to over 300 employees. The company operates in various locations across the Americas, including Austin, Texas, and has established a strong foothold in the LATAM tech scene.\n- **Talent Acquisition & Management**: Howdy helps over 200 companies—including well-known names like Coinbase, Truepill, and various Y Combinator startups—effectively hire and build remote teams, whether in a fully remote, hybrid, or in-office setup. They give companies access to a network of vetted talent, which isn’t just passively seeking jobs through freelancer platforms.\n  \n### Unique Value Proposition:\n- **Community Engagement**: By hosting local tech meetups and creating \"Howdy Houses\" throughout LATAM, Howdy fosters a community where companies can connect with promising tech leaders eager to join U.S. product teams long-term.\n- **98% Retention Rate**: Howdy’s approach not only focuses on bringing the right talent into teams but also on maintaining them. Every developer hired through Howdy is provided with excellent benefits—including premium health insurance, top-notch Apple equipment, gym memberships, and access to upscale office spaces. This package significantly reduces churn and promotes a stable work environment.\n\n### Services and Pricing:\nHowdy offers flexible hiring solutions across various domains like software development, AI & machine learning, data engineering, and more—essentially acting as an all-in-one workforce solution. Their pricing models are clear and straightforward, ranging from $6k to $11k monthly for software developers, with similar tailored packages for other roles like finance, customer service, and design.\n\n### The Road Ahead:\nAs Howdy continues to grow, their commitment remains steadfast: enabling U.S. companies to tap into the top 1% of Latin American talent efficiently and effectively. This not only ensures high-quality hires but also gives companies a seamless way to manage and integrate these remote talents into their existing teams.\n\nIn a world where traditional hiring practices can be slow and cumbersome, Howdy simplifies the process, showing that good talent has no borders and can fill the tech talent gaps many companies face today. You could say they've made it easier for tech firms to say \"Howdy\" to their next potential superstar.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/886209bc78c79c853bfe00c450e2dab488795af1.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191423Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=bdeea4d8ee8d0413842df6a4a6964662b6fdbd052c55f2907ead52e05c7fbbae",
    "social_links": [
        "https://www.linkedin.com/company/wearehowdy/mycompany/"
    ],
    "logo_path": "data/logos\\Howdy.com_logo.png"
}