{
    "links": "https://www.ycombinator.com/companies/chatpay",
    "name": "Hubla",
    "headline": "All-in-one platform for creators to sell courses and subscriptions",
    "batch": "S20",
    "description": "Hubla is the Shopify for creators, enabling anyone to build, manage, and grow their online business. We provide powerful tools to create courses, communities, sell products, manage memberships, and deliver content—all in one platform. For example, a fitness coach can charge her audience for a unique digital weight-loss program, turning passion into profit.\r\n\nCreators need simple, flexible tools to succeed. Hubla’s fully customizable platform lets them own their strategy, stand out from competitors, and create unique experiences. This approach works—our top creator earns over $8M annually.\r\n\nHubla is leading the creator economy revolution, empowering individuals to transform their expertise into sustainable, scalable businesses.",
    "activity_status": "Active",
    "website": "https://hub.la",
    "founded_date": 2020.0,
    "team_size": 86.0,
    "location": "Brazil",
    "group_partner": "Michael Seibel",
    "group_partner_yc": "https://www.ycombinator.com/people/michael-seibel",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:saas; industry:payments",
    "founders": [
        {
            "name": "Arthur Alvarenga, Founder",
            "description": "Software engineer and product design.",
            "linkedin": "https://www.linkedin.com/in/arthur-alvarenga-0623b193/"
        },
        {
            "name": "Breno Oliveira, Founder",
            "description": "Breno is co-founder of Hubla (YCombinator S20). Breno has a large experience (since 1993) in product and software development. He was the creator of nFlog (2004) converting more than 15k users in the first month. His project RemotePark, app for finding parking lot available nearby, gave him the StartupFarm award in 2011. Breno also was co-founder of RBM Solutions, a performance marketing company, the first using pay per install (PPI) in Brazil.",
            "linkedin": "https://linkedin.com/in/breno-lima-38a09922"
        },
        {
            "name": "Bernardo Reis, Founder",
            "description": "Always looking for a better way to solve real life problem with software, I'm passionate about creating tools and services that improve people's lives. To do that I'm always looking for the techinical knowledge to create and use good architectures so that systems can grow in a healthy way.\n\nI am an Android, but I also have a wide experience in developing servers in Kotlin, Java and Python. I have also used Flutter for Android and iOS applications and React for web apps.",
            "linkedin": "https://www.linkedin.com/in/bernardo-reis-22255659/"
        },
        {
            "name": "Raphael Capelão, Founder",
            "description": null,
            "linkedin": "https://www.linkedin.com/in/raphael-capel%C3%A3o-052759135/"
        }
    ],
    "status": true,
    "generated_description": "**Hubla** is revolutionizing the creator economy with its all-in-one platform designed specifically for creators wanting to sell courses and subscriptions. Think of it as the Shopify for creators—Hubla helps individuals manage their online businesses efficiently, providing tools to create courses, build communities, sell products, and manage memberships, all in one customizable interface.\n\nFounded in 2020 in Brazil and a proud member of the Y Combinator Batch S20, Hubla was built with the understanding that creators need straightforward yet powerful tools to thrive. Their platform empowers users to tailor their strategies and differentiate themselves from the competition. It’s not just talk; the results speak volumes—some top creators are making over $8 million annually by leveraging what Hubla offers.\n\nWith a team of 86 people led by Michael Seibel as Group Partner, Hubla is positioned at the intersection of fintech and SaaS, also incorporating payment solutions into their offerings. They are committed to enabling creators to transform their passion into sustainable and scalable revenue streams.\n\nThe company runs innovative programs like the **Growth Club**, designed to accelerate digital businesses, supporting clients at various stages of growth with advantages available every quarter. What's particularly novel about their pricing model is their performance-based structure: you only pay when you sell, and the more you sell, the less you pay—which feels refreshing in today's market.\n\nIn just six months, Hubla clients reportedly experience a growth of 79%, indicating a robust potential for creators to thrive using their systems. With innovative features like group management tools, high-performance checkouts with top approval rates, and rich data analytics, Hubla is positioned to be a key partner for anyone serious about their digital business success.\n\nSo if you're a creator eager to monetize your expertise and elevate your online presence, it’s worth checking out Hubla at [hub.la](https://hub.la). They’re not just providing tools; they’re enabling a movement.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/ccc8458997bbdf1034ae09c0e2f9feffc201fd3c.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191423Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=5e320e16bb186e445a3eadde5863f9cc6cc53e53387fc8dc3de34813c50675c5",
    "social_links": [
        "https://github.com/hub-la"
    ],
    "logo_path": "data/logos\\Hubla_logo.png"
}