{
    "links": "https://www.ycombinator.com/companies/human-dx",
    "name": "Human Dx",
    "headline": "The Human Diagnosis Project.",
    "batch": "S12",
    "description": "The Human Diagnosis Project (also referred to as “Human Dx” or “the Project”) is a worldwide effort to build an open medical intelligence system that maps the steps to help any patient. By combining collective intelligence with machine learning, Human Dx intends to enable more accurate, affordable, and accessible care for all",
    "activity_status": "Active",
    "website": "http://humandx.org",
    "founded_date": null,
    "team_size": 11.0,
    "location": "San Francisco",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:health-tech; industry:diagnostics; location:san-francisco-bay-area",
    "founders": [],
    "status": true,
    "generated_description": "**Human Dx: A Brief Overview**\n\nHuman Dx, initially known as The Human Diagnosis Project, is a groundbreaking initiative aimed at reshaping the healthcare landscape. Founded during the Y Combinator Batch S12, this San Francisco-based company is on a mission to create an open medical intelligence system that maps solutions for patient care through collective intelligence and machine learning.\n\n### Mission\n\nThe core mission of Human Dx is to enhance the way healthcare is delivered globally. By leveraging the collective insights of medical professionals and advanced algorithms, Human Dx strives to provide more accurate, affordable, and accessible diagnostic services for everyone. Their goal is to ensure that no patient is left without the appropriate guidance and care.\n\n### Team and Location\n\nWith a compact team of 11 dedicated employees, Human Dx embodies the spirit of innovation typical of start-ups in the tech and health sectors. They are situated in the vibrant San Francisco Bay Area, which is a hub for health-tech and diagnostics advancements.\n\n### Sector Focus\n\nHuman Dx operates within the health-tech and diagnostics fields, reflecting its goal to employ modern technology in solving traditional healthcare challenges. They are part of an exciting wave of companies working to redefine how patients receive care and how medical professionals diagnose conditions.\n\n### Key Technology and Approach\n\nBy melding human expertise with machine learning, Human Dx is creating a scalable model that not only improves assessment accuracy but also democratizes access to medical information. This represents a significant shift in how healthcare could operate, making it more engaged and informed by the contributions of a broader medical community.\n\nFor more information about their mission and innovations, you can check out their website at [Human Dx](http://humandx.org).\n\n### In Summary\n\nHuman Dx is at the forefront of health tech innovation, working towards a holistic and intelligent system that addresses the needs of patients worldwide. Their commitment to affordable and accessible care is both ambitious and necessary in today's healthcare environment.",
    "logo": "/logos/medium/missing.png",
    "social_links": [
        "https://www.crunchbase.com/organization/human-diagnosis-project",
        "https://github.com/humandx"
    ]
}