{
    "links": "https://www.ycombinator.com/companies/humanlayer",
    "name": "HumanLayer",
    "headline": "Human-in-the-Loop for AI Agents",
    "batch": "F24",
    "description": "HumanLayer is an API that enables AI applications to contact humans for help, feedback, and approvals. One customer uses HumanLayer to ship DevOps agents that manage complex and risky workflows like production deployments and database migrations. \r\n\nWe’re building HumanLayer because we know that the future of AI Applications is not gonna be humans sitting at a chat interface, the future is “outer loop” or “headless” agents, and our partners are building AI apps that invert the typical interaction paradigm. Autonomous agents are calling humans, not the other way around.\r\n\nAI Agents are poised to disrupt the $4.6tn global labor market, but in order to make agents reliable today, and train them to be fully autonomous tomorrow, solutions like HumanLayer are an inevitable part of the AI Agent stack.",
    "activity_status": "Active",
    "website": "https://humanlayer.dev",
    "founded_date": 2023.0,
    "team_size": 1.0,
    "location": null,
    "group_partner": "Dalton Caldwell",
    "group_partner_yc": "https://www.ycombinator.com/people/dalton-caldwell",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": null,
    "founders": [
        {
            "name": "Dexter Horthy, Founder",
            "description": "Building HumanLayer | started coding at 17 at NASA JPL. Spent 7 years as Engineer, SE, PM, Exec at Replicated, a series C dev tools startup. I worked on container orchestrators, helped teams like Hashicorp, DataStax, and H2O.ai deliver and ship their on-prem k8s products. Core improvements to developer experience for Replicated.\n\nI stumbled on the Human-in-the-Loop-for-AI problem while building slack-based agents that managed SQL warehouses. In 3 weeks I pivoted to HumanLayer and launched an MVP",
            "linkedin": "https://linkedin.com/in/dexterihorthy"
        }
    ],
    "status": true,
    "generated_description": "**HumanLayer: Integrating Humans into AI Workflows**\n\nFounded in 2023, HumanLayer is an innovative startup that's pushing the boundaries of how AI can collaborate with humans. Currently part of Y Combinator's Batch F24, they’ve developed a robust API and SDK that allows AI applications to contact humans for essential feedback, input, and approvals—what they call a \"Human-in-the-Loop\" system.\n\n### Mission\n\nHumanLayer's mission is crystal clear: they aim to make AI agents more reliable today and fully autonomous tomorrow by bridging the gap between humans and machines. As they envision it, the future of AI won't be about humans initiating interactions through a chat interface—instead, it will be about autonomous agents reaching out to humans for guidance when needed. This paradigm shift is vital, especially as AI agents start to challenge the enormous $4.6 trillion global labor market.\n\n### What They Do\n\nAt its core, HumanLayer is designed for those who need robust oversight in their AI processes. One of their clients leverages HumanLayer to ship DevOps agents critical for managing complex tasks, such as database migrations and production deployments. They offer essential features like:\n\n- **Human Approval for Function Calls**: Certain actions in AI functionality can be held for human approval. This ensures that complex tasks are handled with the necessary oversight.\n- **OmniChannel Contact**: AI agents can seamlessly reach out across various platforms, including Slack, Email, and Discord.\n- **Granular Routing**: Approvals can be directed to specific teams or individuals, maximizing efficiency and clarity.\n\nThis flexibility makes HumanLayer suitable for various industries, from tech to finance.\n\n### Key Features\n\n1. **Approval Workflows**: Ensure human oversight on crucial function calls, adapting based on feedback to improve agent training.\n2. **Multi-Channel Interaction**: Facilitate communication with humans across preferred platforms.\n3. **Advanced Approval Mechanics**: Enable complex workflows, such as team collaboration and time-based escalation of approvals.\n4. **Integration with Existing LLMs**: HumanLayer is designed to work with any language model and major orchestration frameworks, ensuring versatility.\n\n### Pricing\n\nHumanLayer offers a couple of pricing tiers, including a **Starter Plan** at $0/month for hobbyists with limited needs, scaling up to a **Premium Plan** at $500/month for businesses that require robust collaboration tools. Custom enterprise solutions are also available for organizations needing tailored integrations.\n\n### Future Outlook\n\nWith a small team of 1.0 employees and Dalton Caldwell as their Group Partner, HumanLayer is poised to make significant strides in how AI interacts with users. Their approach not only amplifies the capabilities of AI agents but also respects and redirects human expertise. If you’re keen on shaping the next generation of AI workflows, it’s worth checking out [HumanLayer's site](https://humanlayer.dev) and seeing how they integrate execution and feedback seamlessly—because in the world of AI, a little human touch goes a long way.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/5ded2808e229319d9bb19612da5c79cc611bb749.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191424Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=b0f23899d04a2b836579b7a5e754f95bd02738bf823f2d6eaf9786202ecbd227",
    "social_links": [
        "https://www.linkedin.com/company/humanlayer-dev/",
        "https://twitter.com/humanlayer_dev",
        "https://github.com/humanlayer"
    ],
    "logo_path": "data/logos\\HumanLayer_logo.png"
}