{
    "links": "https://www.ycombinator.com/companies/humi",
    "name": "Humi",
    "headline": "Payroll, HR, and Health Benefits for Canada's SMB's",
    "batch": "W17",
    "description": "Humi is building important infrastructure for Canada's economy. Software that helps SMBs employ Canadians. \r\n\nPayroll, HR, and Benefits all together in a single simple to use platform.\r\n\nServing thousands of Canadian companies, Humi’s clients include innovators such as Ada, Hubdoc, LiveCA, AudioBooks.com, Inkbox, and others. \r\n\nwww.Humi.ca",
    "activity_status": "Active",
    "website": "http://www.humi.ca",
    "founded_date": 2016.0,
    "team_size": 141.0,
    "location": "Toronto, Canada",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:payroll",
    "founders": [],
    "status": true,
    "generated_description": "**Humi: Revolutionizing HR and Payroll for Canadian SMBs**\n\nFounded in 2016 and a proud member of Y Combinator's Batch W17, Humi is rapidly becoming essential infrastructure for Canada's economy, specifically tailored for small and medium-sized businesses (SMBs). Based in Toronto, Humi combines payroll, human resources, and health benefits into a single, user-friendly platform.\n\n### Mission and Vision\nHumi's mission is clear: to simplify the employment landscape in Canada. By providing comprehensive solutions in payroll, HR, and benefits, the company enables SMBs to effectively manage their workforce while focusing on growth and innovation. Humi is not just servicing businesses; they're actively empowering them to employ more Canadians.\n\n### Clientele and Impact\nHumi proudly supports thousands of Canadian companies, including notable innovators like Ada, Hubdoc, LiveCA, and Inkbox. These clients appreciate Humi not just for its software solutions but for the substantial time and effort saved in managing employee-related tasks. \n\n### The Team\nWith a dedicated team of 141 employees, Humi emphasizes human support, ensuring that clients receive help whenever needed. Their group partner is none other than Nan, adding a layer of strategic mentorship and collaboration to their endeavor.\n\n### Services Offered\nHumi's platform is robust and multifaceted, offering:\n- **Payroll Administration**: Automated calculations and remittances tackle the complexities of Canada's tax system.\n- **HR Management**: Streamlined processes from hiring to onboarding and offboarding.\n- **Health Benefits**: Simplified administration of employee benefits to boost engagement.\n- **Performance Management**: Tools for tracking employee growth and fostering feedback.\n- **Time Management**: Efficient handling of time-off requests and balances.\n\n### Industry Recognition\nThe company's efforts haven't gone unnoticed; they've been recognized as leaders in the fintech and payroll categories. Their recent acquisition by Employment Hero heralds a new chapter, aimed at further accelerating their innovative vision.\n\n### Current Promotions\nTo encourage new users, Humi offers a limited-time promotion: your first month free if you sign up before December 20, 2024. It’s an attractive incentive to experience firsthand how Humi can transform HR and payroll functions.\n\n### Why Choose Humi?\nThey're built for Canadian businesses, understanding the unique needs across the country. They provide a seamless all-in-one solution that integrates with various tools, eliminating the headache of juggling multiple platforms.\n\nIn summary, Humi stands out as a critical partner for Canadian SMBs looking to navigate the complexities of payroll, HR, and benefits. They’re not just about software; they’re about creating the right environment for businesses to thrive. With Humi, Canada is indeed working better. If you want to discover more about how Humi can help your business, you can visit [Humi's official website](http://www.humi.ca).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/0a73d43852fbee3bfbeca7974bc8573216c07b80.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191424Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=c8c102bd262b2f625e394513fe3236fbfaaa62c4c743e02c2ccd811adb7055a2",
    "social_links": [
        "https://www.linkedin.com/company/humi-hr",
        "https://twitter.com/gethumi",
        "https://www.facebook.com/gethumi/",
        "https://www.crunchbase.com/organization/humi-hr"
    ],
    "logo_path": "data/logos\\Humi_logo.png"
}