{
    "links": "https://www.ycombinator.com/companies/hyper-online",
    "name": "Hyper Online",
    "headline": "Social avatar platform for VTubers",
    "batch": "S20",
    "description": "Hyper is an early stage startup with a mission to build the largest avatar platform in the world. We're starting by targeting consumer use-cases, and our first one is VTubing: an emerging type of content where creators use computer-vision and motion capture to pilot 3D avatars as content creation tools.\r\n\nAvatar content (also known as VTubing) has broken into the multi-billion-view-per-month category on places like Twitch and YouTube. This has given a new group of people the power to tell stories and present themselves on their own terms online while also protecting their IRL identities.  Our goal is to build the largest platform tools for this new movement. We're now  the #1 US VTubing app on iOS. \r\n\nWe also recently announced our seed funding: we're backed by Amazon, Two Sigma Ventures, MakersFund, YCombinator, and other great investors.\r\n\nApp Store: https://hyper.online/download\r\nTechCrunch: https://techcrunch.com/2023/06/12/hyper-raises-3-6m-from-amazon-and-more-for-its-iphone-based-vtuber-friendly-avatar-platform/",
    "activity_status": "Active",
    "website": "https://www.hyper.online/",
    "founded_date": 2021.0,
    "team_size": 7.0,
    "location": "San Francisco",
    "group_partner": "Gustaf Alstromer",
    "group_partner_yc": "https://www.ycombinator.com/people/gustaf-alstromer",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:artificial-intelligence; industry:augmented-reality; industry:entertainment; industry:social; industry:metaverse; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Aaron Ng, Founder/CEO",
            "description": "Building avatar expression tools. Previously worked for companies like DYDX, CashApp, and more. Interested in biohacking, augmented reality, and economics.",
            "linkedin": "https://www.linkedin.com/in/aaronykng"
        }
    ],
    "status": true,
    "generated_description": "Hyper Online is an innovative startup that’s carving out a significant space in the world of virtual content creation. Founded in 2021, Hyper, currently described as Hyper Online, aims to build the largest social avatar platform specifically for VTubers—those creators who use 3D avatars to engage their audiences without revealing their real-life identities.\n\nThis is an exciting time for VTubing, which has surged to the forefront of online entertainment. The trend garners billions of views each month on platforms like Twitch and YouTube, empowering creators to share their stories in a uniquely authentic way. Hyper Online is not just in the market; it's leading it, proudly recognized as the #1 VTubing app on iOS in the United States.\n\nWhat sets Hyper apart is its cutting-edge use of computer vision and motion capture technology, enhancing the user experience and creativity for VTubers. Their vision is big—building robust tools tailored for this emerging digital movement that embraces virtual identities while protecting users’ privacy.\n\nBacked by notable investors like Amazon, Two Sigma Ventures, MakersFund, and YCombinator, Hyper Online recently announced its seed funding of $3.6 million, fueling its ambitions for growth. Located in the vibrant San Francisco Bay Area, the startup operates with a dynamic team of seven and is part of Y Combinator Batch S20.\n\nHyper is tagged under various categories, such as artificial intelligence, augmented reality, social platforms, and, of course, the metaverse—reflecting its deep integration into the digital landscape.\n\nFor more hands-on engagement, users can download the app through their website [hyper.online](https://www.hyper.online/download). The company also maintains an active presence with blog content to guide and update users, keeping the community informed and connected.\n\nIn a nutshell, Hyper Online is not just about avatars—it's about creating a thriving ecosystem for virtual content creators that’s set to attract more storytellers into this engaging and increasingly popular landscape. If you're interested in the future of online identity and interaction, this is one company to watch.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/0e01ece7e5c1a373aeab956e674ca3ba2ed4f0ed.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191426Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=f54e4d088a21144487cc827110dac9b4203fb4953f49b084aeb8f40a28705d4b",
    "social_links": [
        "https://www.linkedin.com/company/72362292",
        "https://www.twitter.com/hyperonline_"
    ],
    "logo_path": "data/logos\\Hyper_Online_logo.png"
}