{
    "links": "https://www.ycombinator.com/companies/ilabservice",
    "name": "iLabService",
    "headline": "AI powered Lab Operation Management SaaS Platform",
    "batch": "S18",
    "description": "We provide SaaS solution to boost your operational efficiency, enhance your safety management. One stop oversight of your lab operation and resource management, such as \" Man, Machine, Material, Method and Health and Safety\".",
    "activity_status": "Active",
    "website": "https://www.ilabservice.com/en",
    "founded_date": 2017.0,
    "team_size": 50.0,
    "location": "Shanghai, China",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:saas; industry:iot; industry:productivity",
    "founders": [
        {
            "name": "Kenny Li, Founder",
            "description": "Kenny is a passionate serial entrepreneur, inspirational leader, and dream chaser. With comprehensive experience in medical & scientific instrument industries, Kenny is excited about creating opportunities for laboratory industrial chain using new technologies.",
            "linkedin": "https://www.linkedin.com/in/kennylee722/"
        },
        {
            "name": "Jing Wang, Founder",
            "description": "Global footprint spanning US, Switzerland, and China; Hack for launching and scaling from inception to operationalization;Navigate the intricacies of business development, governmental negotiations, team building, and implementing IT systems for operation while maintaining total ownership of P&L dynamics. Extensive lab industry acumen was honed during her tenure at Thermo Fisher Scientific in the United States. Currently founder and COO of iLabService (break-even w/140HC)",
            "linkedin": "https://www.linkedin.com/in/jing-wang-5aa8a92b/"
        },
        {
            "name": "Liyang Zhang, Founder",
            "description": "- An Entrepreneur: passionate about innovating new business & products using technology;\n\n- A Consultant: 15+ consulting experiences at AWS, KPMG, PwC for top-tier global companies such as Bank of America, Citi, MetLife, Vanguard, KKR, Moody's, BNY Mellon, State Street, Federal Reserve, FINRA; thinking strategically, then building things and achieving success side by side with customers\n\n- A Technologist: expertise in product and technology strategy & architecture; former global chief applicatio",
            "linkedin": "https://www.linkedin.com/in/liyang-zhang/"
        }
    ],
    "status": true,
    "generated_description": "**iLabService Overview**\n\niLabService is a cutting-edge company specializing in software-as-a-service (SaaS) solutions for laboratory management, harnessing the power of AI to enhance operational efficiency and safety. Founded in 2017 and part of Y Combinator's Summer 2018 batch, this Shanghai-based company has swiftly positioned itself as a leader in digital laboratory transformation, employing around 50 talented individuals.\n\n**Mission and Offerings**\n\nThe core mission of iLabService is to provide an all-inclusive lab operation management platform that integrates software and hardware solutions. Their comprehensive digital ecosystem streamlines oversight of \"Man, Machine, Material, Method,\" and the environment—essentially everything that contributes to effective lab operations. They're helping labs navigate the complexities of resource management with innovative platforms like SciOne OS, SciOne Guardian, SciOne Asset Manager, and more.\n\nThe focus here is on maximizing productivity and safety while ensuring compliance. The platform notably offers a stellar promise—over 200% return on investment within three years of implementation. This sort of assertion speaks volumes in the often conservative laboratory sector, where data-driven decisions can dramatically shift operational outcomes.\n\n**Technology and Clients**\n\nUtilizing IoT, AI, and cloud technologies, iLabService caters to a wide range of sectors, including life sciences, health, and government, alongside testing, inspection, and certification industries. They are dedicated to reducing downtime and improving collaboration by effectively digitizing laboratory environments. \n\nTheir customer base ranges from researchers and lab managers to academic institutions, all benefiting from the smooth digital journey iLabService provides. Their commitment to continuous innovation underpins their solutions, which aim to simplify processes and safeguard outcomes effectively.\n\n**Partnerships and Culture**\n\niLabService fosters professional relationships with notable group partners and has built a culture that encourages innovation and efficiency. This is not just about technology but also about creating smart labs that empower scientists and managers alike—allowing them to focus on what's most critical: research and outcomes.\n\nIn summary, iLabService is not just another SaaS company; it’s a critical player in reimagining laboratory operations for a data-driven, innovative future. If you're interested in elevating your lab's capabilities, [check them out](https://www.ilabservice.com/en).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/a0a8f7e793c87fa93b4905b381beef2ce6d19160.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191427Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=837572085de03d61307a4a285daaa6b5f103c28e35a397a0dc70db2c3a6abe7c",
    "social_links": [
        "https://www.linkedin.com/company/ilabservice",
        "https://www.facebook.com/iLabService/?ref=aymt_homepage_panel",
        "https://www.crunchbase.com/organization/ilabservice",
        "https://github.com/ilabservice"
    ],
    "logo_path": "data/logos\\iLabService_logo.png"
}