{
    "links": "https://www.ycombinator.com/companies/illuminant-surgical",
    "name": "Illuminant Surgical",
    "headline": "We let surgeons project x-rays directly on the patientâ\u0080\u0099s skin",
    "batch": "S22",
    "description": "Illuminant is helping surgeons perform safer and more efficient surgeries by projecting visual guidance directly on the patientâ\u0080\u0099s skin. Using computer vision and low cost hardware, we can display patient-specific anatomical structures from preoperative medical images (e.g. CT scans), pre-operative annotations from planning, and real-time feedback, like needle depth and tool trajectory, as a surgeon operates. Our vision is to expand surgical navigation to underserved health systems and surgical specialties.",
    "activity_status": "Active",
    "website": "https://www.illuminant.ai/",
    "founded_date": 2021.0,
    "team_size": 6.0,
    "location": "Culver City, CA",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": null,
    "founders": [
        {
            "name": "Eldrick Millares, Founder",
            "description": "CEO and Co-Founder at Illuminant Surgical\nStanford BS/MS EE",
            "linkedin": "https://www.linkedin.com/in/eldrickm"
        },
        {
            "name": "James Hu, Founder",
            "description": "Co-Founder, Chief Product Officer @ Illuminant Surgical\nStanford Bioengineering\nUCI Med",
            "linkedin": "http://linkedin.com/in/jameshu7"
        }
    ],
    "status": true,
    "generated_description": "### Illuminant Surgical: Projecting the Future of Surgery\n\n**Overview:**\nFounded in 2021 and part of Y Combinator’s S22 batch, Illuminant Surgical is an innovative startup based in Culver City, California. The company specializes in advanced surgical navigation technologies that allow surgeons to project essential visual guidance directly onto a patient’s skin during surgery. This capability enhances both safety and efficiency in surgical procedures.\n\n**Mission:**\nIlluminant Surgical's mission centers around its commitment to improving surgical outcomes. By utilizing computer vision and affordable hardware, their technology aims to display patient-specific anatomical features derived from preoperative imaging like CT scans. Additionally, the system provides real-time data on aspects like needle depth and tool trajectory, which help surgeons make better-informed decisions during operations.\n\n**Vision:**\nThe company envisions expanding its surgical navigation solutions to underserved healthcare systems and diverse surgical specialties, aiming to uplift the standards of patient care across various environments.\n\n**Team:**\nIlluminant operates with a compact team of six employees, blending engineering talent with clinical insights to meet the high standards required in medical technology.\n\n**Noteworthy Collaborations:**\nThe company has received mentoring and support from renowned institutions, including Stanford University and Houston Methodist, which highlights its credibility and potential within the medical field.\n\n**Recent Achievements:**\nIlluminant won a federal grant from the National Science Foundation that will assist in developing and validating its technology specifically for spine surgery applications. This recognition showcases the potential impact of their innovative solutions on surgical practices.\n\n**Recognition:**\nRecently, TechCrunch named Illuminant Surgical as one of its standout companies from Y Combinator's S22 Demo Day, affirming its place in the forefront of surgical innovation.\n\n**Contact:**\nFor those interested in learning more or getting involved with Illuminant Surgical, they can reach out via their website at [illuminant.ai](https://www.illuminant.ai/) or through email at founders@illuminant.ai.\n\nIn a world where surgery can be unpredictable, Illuminant Surgical is pioneering a path forward, using technology to empower surgeons and improve care. It’s not just a tool; it’s a vision to transform how surgeries are performed and experienced.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/3646bfa960fa9fdb20558197bd269aa6043179d9.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191427Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=68a19e485a2c22f25fc2f681a03206f8ef4181721ba99372e27655ea3a4035f5",
    "social_links": [
        "https://www.linkedin.com/company/illuminant-surgical/"
    ],
    "logo_path": "data/logos\\Illuminant_Surgical_logo.png"
}