{
    "links": "https://www.ycombinator.com/companies/immunity-project",
    "name": "Immunity Project",
    "headline": "The free HIV vaccine.",
    "batch": "W14",
    "description": "We're developing a free vaccine to cure HIV and AIDs.  Immunity Project is a non-profit initiative dedicated to developing an HIV vaccine. We hacked the HIV life cycle to develop a vaccine that gives you the same power as HIV controllers. With success in our clinical trials, our goal is to give our vaccine away to the world for free.",
    "activity_status": "Active",
    "website": "http://immunityproject.org",
    "founded_date": null,
    "team_size": 11.0,
    "location": "San Francisco",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:health-tech; industry:biotech; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Ian Cinnamon",
            "description": "http://linkedin.com/in/iancinnamon",
            "linkedin": "http://linkedin.com/in/iancinnamon"
        },
        {
            "name": "Naveen Jain",
            "description": null,
            "linkedin": "https://www.linkedin.com/in/naveenkjain"
        },
        {
            "name": "Reid Rubsamen",
            "description": null,
            "linkedin": "https://www.linkedin.com/in/reidrubsamenmd"
        }
    ],
    "status": true,
    "generated_description": "**Immunity Project: The Quest for a Free HIV Vaccine**\n\nThe Immunity Project isn’t just another biotech company; it’s a beacon of hope in the fight against HIV and AIDS. Founded during the Y Combinator Batch W14, this San Francisco-based non-profit has set itself an audacious mission: to develop a free vaccine that can cure HIV. Their approach? They’ve ingeniously hacked the HIV life cycle, creating a vaccine designed to empower individuals with the same immunity as those the industry terms “HIV controllers” — people who naturally manage the virus without medical intervention.\n\nWith a compact and dedicated team of 11, Immunity Project is channeling its resources towards turning this vision into a reality. They’ve made significant strides in clinical trials, and the endgame is crystal clear: giving the vaccine away for free to anyone who needs it, breaking down the barriers often associated with access to life-saving medical technology.\n\nSituated in a prime health-tech and biotech hub, Immunity Project taps into the rich ecosystem of innovation that characterizes the San Francisco Bay Area. This location not only supports their mission but connects them with partners and resources that amplify their impact. As they continue their work, they remain committed to their core principle of making healthcare accessible, which stands as a testament to their values.\n\nSo, if you’re looking to see what’s brewing at the intersection of technology and health, the Immunity Project is one to keep an eye on. They embody the spirit of innovation and humanity — driven not just by profits but by a profound desire to eradicate a disease that has plagued society for far too long.\n\nFor more information, you can visit their [website](http://immunityproject.org).",
    "logo": "/logos/medium/missing.png",
    "social_links": [
        "https://www.crunchbase.com/organization/immunity-project"
    ]
}