{
    "links": "https://www.ycombinator.com/companies/impossible-metals",
    "name": "Impossible Metals",
    "headline": "Underwater robotic vehicles that collect  battery metals responsibly",
    "batch": "W22",
    "description": "Impossible mining is building underwater robotics vehicles which collect battery metals from the seabed without harming the environment. We have $500M+ in off-take LoI’s and have signed a partnership with a global offshore logistics company which holds a seabed mining exploration permit. We have also built the 1st PoC underwater robotic arm.\r\n\nPolymetallic nodules are rocks which are rich in critical battery metals. Specially nickel, cobalt, manganese and copper. These metals are the the most expensive part of EVs.",
    "activity_status": "Active",
    "website": "https://impossiblemetals.com",
    "founded_date": 2020.0,
    "team_size": 20.0,
    "location": "Pasadena, CA",
    "group_partner": "Gustaf Alstromer",
    "group_partner_yc": "https://www.ycombinator.com/people/gustaf-alstromer",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:artificial-intelligence; industry:robotics; industry:climate; industry:energy; industry:mining",
    "founders": [
        {
            "name": "Oliver Gunasekara, CEO / Co-Founder",
            "description": "Early employee at Arm. Grew Arm's market share from 0% to 95%. VP, Global Head of Corporate Development. Sponsored and executing the 2006 acquisition of Falanx (Mali GPU) by Arm. Founder of the non-profit MIPI Alliance. Founded and ran NGCodec as its CEO for 7 years till its successful 5x exit to Xilinx in 2019. Founded Impossible Mining and recruited co-founders.\n\nCEO/Co-founder, Entrepreneur, Investor & Advisor in DeepTech/ClimateTech\n30+ years experience.",
            "linkedin": "https://www.linkedin.com/in/gunasekara/"
        },
        {
            "name": "Jason Gillham, Founder",
            "description": "Jason is an achievement driven entrepreneur, driven by seeing positive impact to society. \n\nHis passion is solving customer problems through unique business models, technology and go to market strategies. With a passion for subsea technology, his first company, 2G Robotics (Voyis), developed an underwater laser scanner and imaging product for monitoring in the offshore energy, military and civil infrastructure markets. He led the company to a successful acquisition in January 2020.",
            "linkedin": "https://www.linkedin.com/in/jason-gillham-31b23824/"
        },
        {
            "name": "Renee Grogan, Founder",
            "description": "Renee is a sustainability expert with 16 years' experience in due diligence, pre-feasibility and feasibility, permitting, strategy, risk and community and stakeholder engagement. Her experience includes working in Australasia, the Pacific, the United States, Africa and parts of Europe. Renee has worked predominantly in the extractive resources industry, including consulting to financial institutions, resources companies, government and intergovernmental agencies, NGOs and research institutions.",
            "linkedin": "https://www.linkedin.com/in/renee-grogan-a3646361/"
        }
    ],
    "status": true,
    "generated_description": "**Impossible Metals: Surfacing Innovation in Underwater Mining**\n\nFounded in 2020 and originally known as Impossible Mining, Impossible Metals is on a mission to revolutionize the extraction of critical battery metals from the seabed while keeping environmental stewardship at the forefront. Their focus? Developing cutting-edge underwater robotic vehicles that can efficiently collect polymetallic nodules — rock formations rich in valuable metals like nickel, cobalt, manganese, and copper, which are crucial for manufacturing electric vehicle (EV) batteries.\n\nThe team, based in Pasadena, California, is currently 20 strong and supported by Gustaf Alstromer, a partner at Y Combinator, where Impossible Metals emerged as part of Batch W22. They've made impressive strides, securing over $500 million in off-take Letters of Intent and partnering with a major global offshore logistics company that possesses a seabed mining exploration permit. In their pursuit of innovation, they've already developed and successfully tested their first Proof of Concept underwater robotic arm.\n\nWhat makes Impossible Metals stand out is not just its technology, but its commitment to sustainability and responsible mining practices. They aim to harvest these rare materials without damaging marine ecosystems, addressing one of the most pressing concerns surrounding deep-sea mining. With the EV market booming and the demand for such critical metals increasing, their ethical approach seeks to navigate this complex landscape responsibly.\n\nImpossible Metals engages with the broader community, educating the public through webinars and blogs about deep-sea mining, environmental impacts, and regulatory frameworks. The company is also aligned with numerous UN Sustainable Development Goals, making clear its intent to contribute positively to global challenges like climate action (SDG #13) and responsible consumption and production (SDG #12).\n\nSo, if you’re keen on exploring the future of sustainable mining and the breakthroughs in robotic technology poised to reshape our approach to resource extraction, keep an eye on Impossible Metals. With their blend of innovation, environmental consideration, and strategic partnerships, they're attempting something that seemed impossible—extracting riches from the depths of the ocean without leaving a mark. \n\nFor more information, check out their website: [Impossible Metals](https://impossiblemetals.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/75a19a428428baf30cf3a65f322f561ab5c0b5b8.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191428Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=30ae9720c9c9277bcf43b1ef871592a264d2724a423b053fedc8aeb0b7ac5a87",
    "social_links": [
        "https://www.linkedin.com/company/74093268/admin/",
        "https://twitter.com/ImpossMetals",
        "https://www.crunchbase.com/organization/impossible-mining"
    ],
    "logo_path": "data/logos\\Impossible_Metals_logo.png"
}