{
    "links": "https://www.ycombinator.com/companies/in-the-room",
    "name": "In The Room",
    "headline": "Real-time connections in physical spaces",
    "batch": "W19",
    "description": "In The Room is a hyper-local geospatial social network for IRL real-time connections in shared spaces. Designed to help you vibe with people literally in the same room, it answers the question, \"Who’s here?\" by seamlessly connecting you with others nearby. \r\n\nCurrently focused on dating, friendships and professional networking, it’s perfect for meeting people wherever they gather—restaurants, bars, clubs, lounges, events, or public spaces like Miami Beach. Go outside, vibe, and connect with others in the places you already love to visit.",
    "activity_status": "Active",
    "website": "https://www.intheroom.social",
    "founded_date": 2024.0,
    "team_size": 1.0,
    "location": "Miami, FL",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:artificial-intelligence; industry:dating; industry:social; industry:social-network; industry:location-based",
    "founders": [
        {
            "name": "André Woodley Jr, Founder",
            "description": "I'm a tech entrepreneur with a background in software engineering, growth, and design, specializing in location-based consumer products. Currently, I'm focused on building In The Room.\n\nI started my tech journey in 2010, teaching myself to code while creating a mobile on-demand music platform that gained 500,000 users in just a few months (pre-Spotify). Later, I co-founded a two-person AI startup, scaling it to a projected $36M in revenue within 42 months before exiting.",
            "linkedin": "https://www.linkedin.com/in/andrewoodleyjr"
        }
    ],
    "status": true,
    "generated_description": "**In The Room: Connecting People IRL**\n\nIn The Room (ITR) is a fresh player in the world of social networking, launched in 2024 and based out of Miami, FL. With a mission to foster real-time connections in physical spaces, ITR is designed as a hyper-local geospatial social network that helps people connect with others literally in the same room. Imagine walking into a bar, a conference, or any public gathering and asking, “Who’s here?”—ITR has your back.\n\nThe platform currently focuses on three key areas: dating, friendships, and professional networking. It’s perfect for making connections wherever you are: at a restaurant, club, lounge, or even at an event in a spot like Miami Beach. The idea is simple, yet powerful: go outside, enjoy the vibe, and connect with others nearby.\n\nFounded as part of Y Combinator's Batch W19, ITR embodies the belief that life is richer in person rather than behind a screen. With just one team member at the moment, the company carries the tag of being in the realms of artificial intelligence, dating, social networking, and location-based services. They are committed to turning virtual interactions into meaningful in-person relationships.\n\nThe company's website, [intheroom.social](https://www.intheroom.social), offers users a gateway to explore who’s around them and what’s happening in real-time, encouraging a lifestyle that embraces spontaneity and authentic connections.\n\nIn summary, In The Room taps into the essence of human interaction, transforming ordinary spaces into opportunities for connection. The future looks bright for this innovative app as it paves the way toward more engaging and fulfilling social experiences.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/3de4cdae3138b9c650d18db13925f851ab40b262.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191437Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=0ac4b813f084c3c83b60c8e4f7e6b5656f56ccb1e52591d6cda6329a7c6b062c",
    "social_links": [],
    "logo_path": "data/logos\\In_The_Room_logo.png"
}