{
    "links": "https://www.ycombinator.com/companies/inari",
    "name": "Inari",
    "headline": "Your junior AI product manager",
    "batch": "S23",
    "description": "Inari surfaces customer insights and revenue generating product opportunities from your customer data auto-magically using AI.\r\n\nInstead of sifting through 100’s of user interviews or 1000’s of pieces of customer feedback manually, Inari automates the process of highlighting interesting quotes, identifying trends, uncovering impactful feature requests, and tying helpful prioritization metrics with features so your team can spend less time analyzing and more time building products that customers love.",
    "activity_status": "Active",
    "website": "https://useinari.com",
    "founded_date": 2023.0,
    "team_size": 2.0,
    "location": "San Francisco",
    "group_partner": "Harj Taggar",
    "group_partner_yc": "https://www.ycombinator.com/people/harj-taggar",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:generative-ai; industry:b2b; industry:analytics; industry:enterprise; industry:ai; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Frank Lee, Founder",
            "description": "Cofounder / CEO of Inari. Led product teams building out gamification, marketplace, and economy management on NBA Top Shot and NFL ALL Day while @ Dapper Labs. Worked on ML pricing product and scaled several cities in BizOps between 2016-2020 @ Opendoor. Data became my love language while working @ Amazon. I love all things about startups, product, marathon running, and streetwear.",
            "linkedin": "https://linkedin.com/in/bizfranklee"
        },
        {
            "name": "Eric Kim, Founder",
            "description": "CTO of Inari: Building the AI copilot connected to your workplace data to empower teams to gather context and make decisions quickly.\n\nPreviously at Amazon.com Supply Chain Forecasting and AWS SageMaker as founding tech lead for DataWrangler, owner of the SageMaker XGBoost image, and point of contact for algorithm deployment to secure GovCloud environments.",
            "linkedin": "https://linkedin.com/in/ericangelokim"
        }
    ],
    "status": true,
    "generated_description": "Inari is a brand-new company founded in 2023 and based in the vibrant tech landscape of San Francisco. As a part of the Y Combinator Batch S23, Inari aims to transform how businesses leverage customer data to enhance their product development. Their mission is straightforward: to be your junior AI product manager.\n\nThe company offers an AI-driven platform that automatically surfaces valuable insights and product opportunities from extensive customer feedback, whether it's through user interviews or scattered feedback notes. Instead of diving into the tedious grind of manual analysis, Inari automates the identification of trends, extracts compelling customer quotes, highlights high-impact feature requests, and ties in prioritization metrics. This means product teams can allocate more energy toward building products that resonate with customers—a crucial advantage in today's fast-paced market.\n\nHere’s what you need to know about Inari at a glance:\n\n- **Founded**: 2023\n- **Location**: San Francisco, California\n- **Team**: Currently a small but efficient crew of 2\n- **Funding**: Backed by Y Combinator\n- **Tags**: generative AI, B2B, analytics, enterprise, AI, San Francisco Bay Area\n- **Website**: [useinari.com](https://useinari.com)\n\nInari positions itself as an AI-native feedback analytics platform where customer feedback essentially does the work of analyzing itself, turning raw insights into a prioritized product backlog. This not only streamlines workflows but also helps businesses remain responsive to customer needs while significantly saving time and resources.\n\nThe feedback from initial users has been positive, highlighting Inari's ability to synthesize messy data, automate feedback analysis, and enable product managers to truly focus on what matters. With features designed to enhance continuous feedback analysis and backlog prioritization, Inari is well-poised to help organizations pivot and adjust their strategies based on real-time customer insights.\n\nIn an era where customer-centric development is king, Inari is the tool to help teams stay ahead by turning user feedback into actionable insights. If you're interested in leveraging this approach, you can get started for free and explore their offerings further on their website. Whether you’re a product lead or part of a small research team, Inari might just be the solution you’ve been searching for to enhance product development efficiency and effectiveness.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/486ab8693b26fd62b56acad7b46cab933601ebcd.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191428Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=246f8e53ff47aa8f58bed4235a68ce1dc4fff285f18e765b81a8be7a7cad5819",
    "social_links": [
        "https://www.linkedin.com/company/98071724/",
        "https://twitter.com/useinari"
    ],
    "logo_path": "data/logos\\Inari_logo.png"
}