{
    "links": "https://www.ycombinator.com/companies/index-1",
    "name": "Index",
    "headline": "Powerful planning for Product Management",
    "batch": "W23",
    "description": "Index is the new product planning and discovery tool for Product Managers, built specifically for Linear. Collect ideas, manage feedback, and build product plans.",
    "activity_status": "Active",
    "website": "https://index.inc",
    "founded_date": 2023.0,
    "team_size": 4.0,
    "location": null,
    "group_partner": "Dalton Caldwell",
    "group_partner_yc": "https://www.ycombinator.com/people/dalton-caldwell",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": null,
    "founders": [
        {
            "name": "Simon Kubica, Founder",
            "description": "Simon Kubica is an Australian entrepreneur and the co-founder and CEO of Index, one of the few Australian companies ever accepted into Y Combinator. He has featured in Forbes and Business Insider, and was previously a product leader at Atlassian, working on Jira, Forge, and new products and platforms.",
            "linkedin": "https://www.linkedin.com/in/simonkubica"
        },
        {
            "name": "Christian Iacullo, Founder",
            "description": "Christian Iacullo is an Australian software engineer who is the co-founder and CTO of Index. Before founding Index, Christian was a software engineer at Canva, where he worked on their Editor, Developer Platform, Education and Collaboration products. Christian began his career at Atlassian, where he worked on Confluence.",
            "linkedin": "https://www.linkedin.com/in/christian-iacullo"
        }
    ],
    "status": true,
    "generated_description": "**Company Overview: Index**\n\nFounded in 2023, Index is carving a niche in the realm of product management tools. Think of them as the \"next-gen\" companion specifically crafted for the Linear framework. Their mission? To streamline and amplify the planning phase for product managers, making it more powerful and effective.\n\n### What They Do\n\nIndex acts as a robust product planning and discovery tool that allows product teams to:\n- **Collect Ideas**: Gather valuable insights and suggestions from across the organization.\n- **Manage Feedback**: Keep track of user and stakeholder feedback effectively.\n- **Build Product Plans**: Translate ideas into structured roadmaps, ensuring nothing falls through the cracks.\n\n### Early Days and Growth\n\nHailing from the recent Y Combinator Batch W23, Index successfully secured $3.5 million in seed funding. This capital injection is critical as they expand their operations and roll out new features tailored for teams looking to optimize their product management processes.\n\nWith a lean team of only four employees, they’re agile enough to pivot quickly and adapt their offerings. Dalton Caldwell serves as their Group Partner, adding valuable mentorship and guidance to their journey.\n\n### Features and Functionalities\n\nIndex’s platform offers a plethora of features tailored for modern product management needs:\n- **Flexible Hierarchy**: Allows linkage of all projects to the broader company strategy.\n- **Visualization Options**: Users can switch between canvases, tables, roadmaps, and boards—viewing their data in the way that makes the most sense to their team.\n- **Real-time Collaboration**: Built for dynamic teamwork, it enables multiple users to collaborate in real-time, with instant feedback loops.\n- **Integrations**: Seamlessly integrates with Linear, promoting a smooth workflow for product updates and feedback requests.\n\n### Why Index?\n\nThe competitive edge of Index lies in its intuitive interface and its ability to merge various aspects of product management into a single, user-friendly tool. Notably, they’re drawing comparisons to Linear, which revolutionized issue tracking. As Thomas Paul Mann, CEO of Raycast, puts it, \"Index takes the pain out of planning.\"\n\nIn a rapidly evolving tech landscape, being able to shift from traditional tools like Notion or Jira into a consolidated platform like Index could be game-changing for many product teams striving for efficiency and clarity.\n\nIf you’re curious about testing their platform or want to learn more, you can explore their website at [index.inc](https://index.inc). \n\nIn summary, Index isn’t just about planning; it’s about enhancing the entire product management experience, making it easier and more effective for those at the forefront of development.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/e338cafcac9ce351a6e42c531866dfe40fdbcfae.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191429Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=c0ccd0af64e3dce6ae1014fbbc55063d451e907d0a388a936b71c2ee66303d50",
    "social_links": [
        "https://www.linkedin.com/company/index-planning",
        "https://x.com/indexplan",
        "https://www.crunchbase.com/organization/index-4dfe"
    ],
    "logo_path": "data/logos\\Index_logo.png"
}