{
    "links": "https://www.ycombinator.com/companies/indinero",
    "name": "inDinero",
    "headline": "Financial dashboard for businesses.",
    "batch": "S10",
    "description": "inDinero is on a mission to reinvent small business operations, helping our clients understand their finances like never before.\r\n\nBy combining a full finance team of bookkeepers, accountants, and CPA’s, with real time accounting software, we provide startups and small businesses the knowledge they need to understand their company's financial health and make better decisions with their money. Tax experts work with accountants under one roof to prepare and file our clients'​ taxes and maximize tax savings.\r\n\nWe're a growing company with big ambitions and big opportunities for internal mobility. If you’re interested in one of our open positions and looking for your next big professional adventure, drop us a line at jobs@indinero.com.",
    "activity_status": "Active",
    "website": "http://indinero.com",
    "founded_date": 2010.0,
    "team_size": 250.0,
    "location": "Los Angeles, CA",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:finops; industry:analytics; location:los-angeles",
    "founders": [
        {
            "name": "Andy Su, Founder/CTO",
            "description": "I founded Pry (W21) with Alex, Hayden and Tiffany to solve small business financial planning.\n\nI founded inDinero (S10) with Jessica Mah to automate small business accounting.",
            "linkedin": "https://linkedin.com/in/andydsu"
        }
    ],
    "status": true,
    "generated_description": "**Company Overview: inDinero**\n\nFounded in 2010 and hailing from Los Angeles, California, inDinero was born from a desire to reshape financial management for small businesses. This company, part of Y Combinator's S10 batch, aims to empower startups and small enterprises with an intuitive financial dashboard that simplifies their financial operations.\n\n**Mission and Services**\n\ninDinero's mission is clear: provide a comprehensive financial dashboard that allows businesses to understand their finances like never before. By integrating a full team of bookkeepers, accountants, and CPAs with a robust real-time accounting software, inDinero helps clients track their financial health and make informed, effective decisions.\n\nTheir suite of services includes:\n\n- **Bookkeeping:** Seamless handling of financial records, letting business owners focus on growth.\n- **Accounting:** Keeping day-to-day financial activities accurate and up-to-date.\n- **CFO Services:** Strategic financial guidance tailored for scalability and increased profitability.\n- **Business Taxes:** Expert assistance with tax preparation and compliance.\n- **Payroll:** Timely and accurate payroll processing to ensure employee satisfaction.\n\nWith a team of 250 skilled professionals, inDinero is not just about crunching numbers; it’s about creating meaningful financial strategies tailored to various industries, from tech startups to nonprofits.\n\n**Client-Centric Approach and Cost Efficiency**\n\nWhat sets inDinero apart is its integrated, team-oriented approach. Clients enjoy the benefits of high-level finance expertise without the hefty cost of a full in-house finance department. Pricing for services starts at $750 per month, making it a cost-effective alternative for many businesses.\n\nThe feedback from clients underscores this advantage, as many report significant savings on financial management costs while experiencing improved efficiencies and error reduction in their processes.\n\n**Culture and Careers**\n\nAs a growing company, inDinero fosters an environment of internal mobility and professional growth. They are actively looking for talent, inviting those interested to check out career opportunities directly via their website.\n\nIn summary, inDinero is more than just a financial service provider; it’s a strategic partner for businesses endeavoring to streamline their operations and boost their growth potential. By offering a blend of personalized service, technology-driven insights, and industry-specific expertise, they empower their clients to navigate the financial landscape with confidence. For more details, you can visit [inDinero's website](http://indinero.com).",
    "logo": "/logos/medium/missing.png",
    "social_links": [
        "https://www.linkedin.com/company/indinero/",
        "https://www.crunchbase.com/organization/indinero",
        "https://github.com/inDinero"
    ]
}