{
    "links": "https://www.ycombinator.com/companies/industrial-next",
    "name": "Industrial Next",
    "headline": "Tesla autonomous manufacturing for everyone",
    "batch": "W22",
    "description": "We bring Tesla autonomous manufacturing to every automaker and other producers. At Tesla, we were the core autonomous factory team and we’re now building the smart cameras and robotic guidance tools that provided the main advantages at Tesla",
    "activity_status": "Active",
    "website": "https://www.industrialnext.ai",
    "founded_date": 2021.0,
    "team_size": 9.0,
    "location": "San Francisco",
    "group_partner": "Diana Hu",
    "group_partner_yc": "https://www.ycombinator.com/people/diana-hu",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:hard-tech; industry:robotics; industry:manufacturing; industry:ai; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Lukas Pankau, Founder",
            "description": "Lukas was the lead electrical architect behind Ford’s Global Fusion and Edge platforms, and Tesla’s Model X, 3, and Y. In his five years at Tesla he transitioned to lead next-generation Autopilot hardware architecture and special projects in the Fremont factory focusing on autonomous manufacturing. After Tesla Lukas spend three years defining Waymo’s next-generation sensor and communications architecture. In his spare time he enjoys cooking and reading terrible fiction novels.",
            "linkedin": "https://www.linkedin.com/in/lukaspankau/"
        },
        {
            "name": "Allen Pan, Founder",
            "description": "Telsa autonomous factory lead, GM advanced autonomous control engineer, Neolix chief architect. \nAn Industry veteran in industrial automation, flexible manufacturing, and autonomous driving expert, with more than 10 years of experiances",
            "linkedin": "https://www.linkedin.com/in/allen-pan/"
        }
    ],
    "status": true,
    "generated_description": "**Industrial Next** is on a mission to bring Tesla-level autonomous manufacturing to every automaker and producer out there. Founded in 2021 and part of Y Combinator Batch W22, this San Francisco-based startup comprises nine dedicated employees, including Group Partner Diana Hu.\n\nAt its core, Industrial Next is tasked with transforming manufacturing by leveraging insights gained from developing autonomous vehicles. They've been on the frontier at companies like Tesla, GM, and Ford, and now their focus is on creating smart cameras and robotic guidance tools that make factories more intelligent and efficient.\n\nTheir approach is as innovative as it is practical. They aim to design modular, fully autonomous smart factories that can adapt to the needs of both large manufacturers and smaller players, helping them scale without incurring crippling costs and complexities. \n\nWhat can they do? Think of them as the tech-savvy enablers for a wide range of industries, from automotive OEMs to consumer electronics. Their offerings include smart vision solutions, autonomous factory vehicles, collaborative robotics, and tools that allow for rapid retooling and product changeovers.\n\nThey're tackling the challenge of production efficiency directly—whether enhancing existing production lines or building new ones from the ground up. Their solutions utilize a holistic approach to manufacturing, combining hardware and software to provide run-time data collection and dynamic decision-making. That's about as close to a self-driving car logic as you can get on the factory floor.\n\nBy bridging the gap between product development and manufacturing engineering, they empower companies to meet the demands of today’s fast-paced market without compromising on quality or efficiency. \n\nIf you’re interested in the future of manufacturing—one that is flexible, intelligent, and autonomous—Industrial Next might just be the company to watch. You can learn more through their [website](https://www.industrialnext.ai).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/13b91bf98a0c10bde993488999daa7c10499c9ac.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191430Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=fc579115d6e60dca66f3e662b2b64f34b8b96ff2290e7ec8f326afbf876c70c9",
    "social_links": [
        "https://www.linkedin.com/company/industrial-next/"
    ],
    "logo_path": "data/logos\\Industrial_Next_logo.png"
}