{
    "links": "https://www.ycombinator.com/companies/inevitable-tech",
    "name": "Inevitable Tech",
    "headline": "To make food a renewable resource, for everyone",
    "batch": "W16",
    "description": "Iron Ox is redesigning agriculture to confront its staggering environmental impacts and adapting farming to meet our future needs by making it a precise science that lets plants reach their full potential.",
    "activity_status": "Active",
    "website": "https://inevitabletech.com/",
    "founded_date": 2015.0,
    "team_size": 80.0,
    "location": "San Carlos, CA",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:robotics; industry:climate",
    "founders": [],
    "status": true,
    "generated_description": "**Inevitable Tech: Redefining Agriculture for a Sustainable Future**\n\nFounded in 2015 and rooted in the innovative grounds of Y Combinator's W16 batch, Inevitable Tech (formerly known as Iron Ox) is on a mission to transform food into a renewable resource for all. Based out of San Carlos, California, and with a dedicated team of 80, they are tackling the pressing challenges of modern agriculture: unsustainable practices and the looming impacts of climate change.\n\nAt its core, Inevitable Tech believes in the power of advanced technology to revolutionize farming. They focus on creating conditions that allow plants not just to survive, but to thrive. This approach is encapsulated in their commitment to \"Clean Propagation,\" a method that significantly reduces risk during the growing cycle and maximizes crop yields while minimizing waste. Their vision isn't just about profit; it emphasizes equity and adaptability, aiming to serve farmers across various cultivation methods—be it vertical farms, hydroponics, or traditional field farming.\n\nThe company operates facilities in both California and Texas, utilizing cutting-edge technology and data-driven practices to optimize productivity. Their 283,332 square foot testing facility in Lockhart, Texas, exemplifies their commitment to rigorous product evaluation before it reaches farmers' hands.\n\nLed by a team with extensive experience in technology and plant science, including founder David Lee and CEO Lucianne Kempton, Inevitable Tech is setting a robust example in the agricultural landscape. They collaborate with various partners like Revol Greens and AppHarvest, further exemplifying the growing demand for sustainable farming solutions.\n\nIn a world increasingly aware of environmental impact, Inevitable Tech not only promises a future of sustainable agriculture but is actively building it, ensuring that the food we eat can be renewed, equitable, and resilient. For those interested in learning more or looking to collaborate, Inevitable Tech encourages getting in touch via their [website](https://inevitabletech.com/) or reaching out directly to their inquiry emails. \n\nIn short, the future of farming might look uncertain, but with companies like Inevitable Tech leading the charge, it seems inevitable that positive change is just around the corner.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/cafcedc6134f328fac3564b300a47761d89d710f.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191430Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=aabbe7ae6f6fae6adc5ef8735b46564ca087f5d65f3739d85dfdeec5a92ceb3e",
    "social_links": [
        "https://www.linkedin.com/company/iron-ox/",
        "https://twitter.com/ironoxfarms",
        "https://www.facebook.com/ironoxfarms",
        "https://www.crunchbase.com/organization/iron-ox",
        "https://github.com/iron-ox"
    ],
    "logo_path": "data/logos\\Inevitable_Tech_logo.png"
}