{
    "links": "https://www.ycombinator.com/companies/infinia",
    "name": "Infinia",
    "headline": "Real Time Payments infraestructure",
    "batch": "W23",
    "description": "Infinia is enabling Fintechs, PSPs and Banks to connect to RTP rails both for payins and payouts globally. Ianai, the CEO, is the former Global VP of Partnerships at dLocal and grew the company from $0 to $100M ARR.",
    "activity_status": "Active",
    "website": "https://www.infiniaweb.com/",
    "founded_date": 2022.0,
    "team_size": 3.0,
    "location": null,
    "group_partner": "Harj Taggar",
    "group_partner_yc": "https://www.ycombinator.com/people/harj-taggar",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": null,
    "founders": [
        {
            "name": "Ianai Urwicz, Founder",
            "description": "Former d-local (NASDAQ: DLO) VP Sales and Partnership, I have been working in the Fintech industry for more than 10 years. \nTech early adopter. Half Israeli- half Latino.",
            "linkedin": "https://www.linkedin.com/in/ianai-urwicz-ab0b932/"
        },
        {
            "name": "Alejandro Rettig, Founder",
            "description": "25+ years of experience in the Fintech & Telecom market, including R&D, product management,  project management, and sales.\n\nPassionate about technology, always innovates and improves the processes and the business.\nProven experience managing teams and creating more than 50 products/services, that were deployed in customers across Latin America, Africa and Asia.\n\nSpecialties: Product Creation, Design and Development, Research, Innovation, Team Management, Project Management, Sales and Pre/Sales.",
            "linkedin": "https://www.linkedin.com/in/alejandrorettig"
        }
    ],
    "status": true,
    "generated_description": "Infinia is a fintech startup founded in 2022, currently part of Y Combinator's Winter 2023 batch. At its core, Infinia aims to revolutionize the payments landscape by building a robust real-time payments (RTP) infrastructure tailored for fintechs, payment service providers (PSPs), and banks. With a mission to connect these entities to RTP rails for both payins and payouts on a global scale, Infinia is designed to simplify transactions, whether in local currencies or cryptocurrencies.\n\nThe company is headed by CEO Ianai, who brings impressive credentials to the table as the former Global VP of Partnerships at dLocal, where he successfully scaled the company from zero to $100 million in annual recurring revenue (ARR). Under Ianai’s leadership, Infinia is not only delivering strong technology solutions but is also shaping the future of financial transactions.\n\nDespite being a small team of just three, Infinia packs a punch, offering a variety of services that include efficient payins, reliable payouts, and simplified compliance processes. They cater to diverse industries, from fintech to iGaming, demonstrating flexibility and innovation in addressing complex payment needs. \n\nSome highlights from Infinia's offerings include:\n- **Payins**: Allowing customers to pay using their preferred method, whether fiat or cryptocurrencies, while ensuring quick and secure transactions.\n- **Payouts**: Responsible for the rapid and reliable disbursement of funds to merchants and clients, enhancing overall satisfaction by minimizing delays.\n- **Compliance**: Providing integrated verification processes to help clients navigate regulatory requirements easily.\n\nInfinia's broader vision encompasses smoother money movement across LATAM markets and beyond, creating frictionless opportunities for growth. The company counts on backing from notable partners, including Microsoft for Startups and Mastercard Start Path, establishing a solid foundation for its operations.\n\nFor more details, you can explore Infinia’s website at [Infinia Web](https://www.infiniaweb.com). \n\nIn sum, Infinia is a forward-thinking startup poised to reshape payment infrastructures globally, leveraging deep industry insights and an agile approach to meet the evolving demands of the financial landscape.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/80b3e473861ea5e1798ab611d1038d89c6e3abdd.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191431Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=faf652fe82b60cb630645085bd767f0e14744c81bd5b08b1209e44578b7eb286",
    "social_links": [
        "https://www.linkedin.com/company/82592889/"
    ],
    "logo_path": "data/logos\\Infinia_logo.png"
}