{
    "links": "https://www.ycombinator.com/companies/infina",
    "name": "Infina",
    "headline": "Leading wealth management and investing platform in Vietnam",
    "batch": "S21",
    "description": "Infina is Vietnam's leading wealth management and investing platform (like Groww of Inida and Ajaib of Indonesia).  Its mission is to empower retail investors by make investing accessible, frictionless, and safe.  The platform is multi-asset, offering stock trading, mutual funds, and fixed-income products, with more asset classes to be added.\r\n\nInfina was founded by James L. Vuong, a Silicon Valley engineer turned VC investor (IDG Ventures) and serial entrepreneur with a prior successful exit in Vietnam (Reddit of Vietnam, which was acquired by LINE corporation in 2017).\r\n\nInvesting apps are seeing explosive growth in many markets around the world, including in Vietnam. There is a growing middle class who are hungry to invest in assets like stocks and crypto. We are building Infina to capture this huge opportunity to democratize investing in South East Asia.",
    "activity_status": "Active",
    "website": "http://infina.vn",
    "founded_date": 2021.0,
    "team_size": 50.0,
    "location": "Ho Chi Minh City, Vietnam",
    "group_partner": "Gustaf Alstromer",
    "group_partner_yc": "https://www.ycombinator.com/people/gustaf-alstromer",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:investing",
    "founders": [
        {
            "name": "James Vuong, Founder/CEO",
            "description": "James is a serial tech entrepreneur, angel investor, and former VC.  He has broad experience ranging from engineering to building products, from investing to founding startups, and from Silicon Valley to SE Asia.  Prior to Infina, James was CEO of Lana group, a digital media startup acquired by Japan's LINE Corp.  Prior to that, James was a VC at IDG Ventures, Vietnam’s first VC fund with $100M USD.  James was a Kauffman Fellow selected by the Kauffman Foundation.",
            "linkedin": "https://www.linkedin.com/in/jameslvuong/"
        }
    ],
    "status": true,
    "generated_description": "**Infina: A Game-Changer in Vietnam’s Investment Landscape**\n\nInfina is carving out a significant niche as Vietnam's leading wealth management and investing platform, akin to Groww in India or Ajaib in Indonesia. Launched in 2021, the company is driven by a mission to democratize investing—making it accessible, frictionless, and secure for retail investors. With a diverse array of offerings, Infina allows users to trade stocks, invest in mutual funds, and explore fixed-income products, with plans to expand into more asset classes in the future.\n\nFounded by James L. Vuong, a Silicon Valley engineer turned venture capitalist, Infina benefits from Vuong's extensive experience in the startup ecosystem. He previously achieved a successful exit with a platform in Vietnam often referred to as the \"Reddit of Vietnam,\" which was acquired by LINE Corporation in 2017. Since its inception, Infina has embraced the explosive growth in investing apps, particularly in emerging markets like Vietnam, which boasts a rapidly growing middle class eager to pour capital into investment opportunities, including stocks and cryptocurrencies.\n\nInfina operates out of Ho Chi Minh City with a talented team of 50 employees and is part of the Y Combinator Batch S21—a hallmark of innovation and excellence. Their flagship product, the “Tài khoản sinh lời,” offers competitive interest rates of around 4.9% per annum without a fixed term, appealing to users looking for flexibility and profitability.\n\nThe app has garnered the trust of over two million users across various platforms, partnering with major players like ZaloPay and AppotaPay. This speaks volumes about Infina's commitment to meeting the diverse financial needs of modern Vietnamese investors.\n\nWith its foundation in fintech and investing, and a roadmap for growth, Infina is poised to lead the charge in making wealth management an integral part of everyday life for millions in Vietnam and potentially across Southeast Asia. For those interested in exploring more, their website is [infina.vn](http://infina.vn).\n\nIn essence, Infina isn’t just another app; it’s a movement to empower individuals financially, making investing not only a possibility but a reality for all. If you're ready to dive into the investing world, it only takes a few clicks to get started!",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/4d3111a53d11f751f0838c3e401b38ea4a1e6330.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191430Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=89123bfefab65eed0f08ed310600baa431ef5c1feda259a7aad6a5e286dcab9b",
    "social_links": [
        "https://www.linkedin.com/company/infinavn/mycompany/"
    ],
    "logo_path": "data/logos\\Infina_logo.png"
}