{
    "links": "https://www.ycombinator.com/companies/inri",
    "name": "iNRI",
    "headline": "Wealthfront for Indiaâ\u0080\u0099s 32M expats living abroad",
    "batch": "W23",
    "description": "India is set to be one of the fastest growing major economies and Indian expats have a unique opportunity to invest in this dynamic growing market. As an Indian expat looking to invest in India, investing in India is a daunting experience, with multiple operational hurdles, complex tax and repatriation regulations. \r\nInri solves these challenges by providing a seamless investment platform comprising of personalized wealth advisory and compliance services.",
    "activity_status": "Active",
    "website": "https://goinri.com",
    "founded_date": 2023.0,
    "team_size": 2.0,
    "location": "Mountain View",
    "group_partner": "Brad Flora",
    "group_partner_yc": "https://www.ycombinator.com/people/brad-flora",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:saas; industry:india; industry:investing; industry:neobank; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Hemant Kumar Gangolia, Founder",
            "description": "Building Inri, Wealthfront for India's 32M global expats. Being an Indian expat himself, Hemant has experienced first hand problems when it comes to investing in India. Previously, Hemant has built large scale systems at Meta, Walmart and consulted C-Suite while at McKinsey & Company.",
            "linkedin": "https://www.linkedin.com/in/hemantgangolia/"
        },
        {
            "name": "Nishad Shah, Founder",
            "description": "Nishad has previously grown audio chatrooms in ShareChat from 0 to $15Mn ARR within a year and headed the Commerce team. Previously, he was the first strategy hire in Udaan and consulted top private bank as a part of BCG. Through his friends and family outside, he has seen the problems of investing in India from abroad first-hand and is passionate about solving them.",
            "linkedin": "https://www.linkedin.com/in/nishad-shah-7776897a/"
        }
    ],
    "status": true,
    "generated_description": "### Company Overview: iNRI\n\n**Name:** iNRI  \n**Founded:** 2023  \n**Location:** Mountain View, California  \n**Team Size:** 2  \n**Website:** [goinri.com](https://goinri.com)  \n**Y Combinator Batch:** W23  \n**Group Partner:** Brad Flora\n\n---\n\n#### The Mission\n\niNRI is carved out of a clear need: to simplify investing in India for the 32 million Indian expats living abroad. Think of it as \"Wealthfront for India,\" where navigating the complexities of the Indian investment landscape—especially from afar—can feel overwhelming. \n\n#### The Problem\n\nInvesting in India as an NRI (Non-Resident Indian) involves a slew of challenges: complicated processes for onboarding, tax regulations that differ from other countries, and a general lack of seamless integration into the investment ecosystem. The stakes are high, and the barriers can be daunting.\n\n#### The Solution\n\niNRI is tackling these challenges head-on with a user-friendly platform that excels in:\n\n- **Investment Management:** From mutual funds to GIFT City funds and startups, iNRI positions itself as a one-stop shop for diverse investment options.\n- **Personalized Wealth Advisory:** The platform offers tailored financial advice, guiding users based on their unique investment goals.\n- **Tax and Compliance Services:** With expert tax consultants built into their framework, iNRI ensures users can navigate India's intricate taxation laws without losing sleep over the details.\n\nThe platform guarantees a hassle-free onboarding process, fully compliant with FATCA (Foreign Account Tax Compliance Act) regulations, while eliminating typical pain points like document submission and cross-border taxation issues.\n\n### Key Features \n\n- **Online Onboarding:** Complete your KYC (Know Your Customer) in just five minutes, a far cry from traditional methods plagued by paperwork.\n- **Support for US Tax Filing:** iNRI offers services that help you manage and file your taxes effectively, and assists with the compliance complexities that NRIs face.\n- **Smart Investing Tool:** An AI-driven feature that provides personalized recommendations to help users select the right investments for their financial landscape.\n\n### Current Stats\n\n- **Total Amount Invested:** ₹25 Crore+\n- **NRI Users:** 10,000+\n- **Customer Satisfaction:** Rated excellent on review platforms, with numerous positive testimonials emphasizing ease and efficiency.\n\n### Unique Proposition\n\nWhat differentiates iNRI is its community-centric approach. They aren't just a financial platform, they are building a global community of NRIs that supports each other in their investment journeys, making every user feel less like a lone ranger and more part of a collective.\n\n### The Market Opportunity\n\nWith India poised to be one of the world's fastest-growing economies, the potential for returns on investments is significant. Recent data reveals that while markets elsewhere have struggled, India's growth trajectory remains robust, making it an attractive market for NRIs.\n\n### In Conclusion\n\niNRI is more than just a platform; it's a bridge that connects Indian expats to the opportunities back home. By demystifying the investment process and offering an ecosystem designed specifically for NRIs, they stand to make a meaningful impact in this under-served market. So, if you're an expat looking to invest in India, this is your go-to resource. Check out their offerings [here](https://goinri.com) and see how they can help you navigate the Indian market with ease!",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/e8086b79954dd0446b80d0641757788a3f6cfea1.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191434Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=95d2dc4075d0ccf66f67e7482fb50f24c539dc20f9fda734cb1a99df104d01f1",
    "social_links": [
        "https://www.linkedin.com/company/goinri",
        "https://twitter.com/go_inri"
    ],
    "logo_path": "data/logos\\iNRI_logo.png"
}