{
    "links": "https://www.ycombinator.com/companies/inspectify",
    "name": "Inspectify",
    "headline": "Home Inspections, Simplified",
    "batch": "S20",
    "description": "We founded Inspectify with the goal to make a platform that helps inspectors, real estate professionals and home buyers alike. We see a tremendous opportunity to apply the latest technology to make inspectors more proficient and effective and make home inspections more engaging and value add to home buyers. We are just getting started, but are excited to provide much needed disruption in the space!",
    "activity_status": "Active",
    "website": "http://www.inspectify.com",
    "founded_date": 2019.0,
    "team_size": 55.0,
    "location": "Seattle, WA",
    "group_partner": "Brad Flora",
    "group_partner_yc": "https://www.ycombinator.com/people/brad-flora",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:marketplace; industry:real-estate; industry:proptech; location:seattle",
    "founders": [
        {
            "name": "Josh Jensen, Founder",
            "description": "I have been working in tech startups since graduate work, primarily running operations for Series A start-ups. I spend a couple years at Peach, a food delivery start-up and most recently was the VP of Operations at Flyhomes where I oversaw all brokerage operations. I've had a passion for real estate my entire life and have bought 8 homes over the past decade, primarily as investments. I live in Sherman Oaks (Los Angeles) with my wife, Mary, our two girls and our Siberian Husky.",
            "linkedin": "https://www.linkedin.com/in/joshuajdensen/"
        },
        {
            "name": "Denis Bellavance, Founder",
            "description": "CTO at Inspectify, focused on helping transition eager homebuyers into empowered homeowners through our home ownership platform\n\nPreviously also founded a food delivery startup in Seattle called Peach (Still active in Boston/San Diego and Seattle)\n\nOther Past Experience:\nHead of Engineering, Loftium\nZillow\nAmazon",
            "linkedin": "https://www.linkedin.com/in/denis-bellavance/"
        },
        {
            "name": "Taylor Zwisler, Founder",
            "description": "Experienced Sales Professional with a demonstrated history of working in the Real Estate and tech industries. Skilled in Sales, Customer Relationship Management (CRM), Public Speaking, Business Development and Management. Bachelor of Arts (B.A.) focused in Psychology and Law from University of Southern California.",
            "linkedin": "https://www.linkedin.com/in/taylor-zwisler-373440b5/"
        }
    ],
    "status": true,
    "generated_description": "### Inspectify: Simplifying Home Inspections\n\n**Company Overview**\n\nFounded in 2019 and part of Y Combinator's S20 batch, Inspectify is revolutionizing the home inspection business. Based in Seattle, WA, the company is on a mission to simplify the complex world of home inspections. With a team of 55 passionate employees, Inspectify is not just a service; it's a comprehensive platform designed for home inspectors, real estate professionals, and home buyers. Their goal? To make inspections more engaging and valuable, leveraging the latest technology to enhance efficiency and effectiveness.\n\n**Core Mission**\n\nInspectify's tagline \"Home Inspections, Simplified\" encapsulates their commitment to clarity and accessibility in property assessments. They are keenly aware of the challenges faced in real estate transactions and aim to streamline the inspection process, making it faster and more straightforward for everyone involved.\n\n**Services Offered**\n\nInspectify provides a suite of services tailored to various needs in the real estate landscape, including:\n- **Inspection Services:** Detailed assessments for home buyers, sellers, and property managers.\n- **Inspection Reporting:** Reliable and easy-to-understand data capture that highlights crucial findings.\n- **Rehab Tools:** Practical resources to help buyers plan for repairs based on inspection outcomes.\n- **Warranty Options:** Additional peace of mind for home buyers.\n\nTheir platform offers flexible, customizable solutions that fit the unique requirements of users—whether they are first-time buyers or seasoned investors.\n\n**Unique Selling Proposition**\n\nWhat sets Inspectify apart is its commitment to fast, managed, and cost-effective inspections:\n- **Rapid Scheduling:** Inspections can be booked in as little as 24 hours.\n- **Managed Services:** They handle all the details, negating the hassle of missed calls or lost messages.\n- **Transparent Pricing:** Users only pay the necessary cost of the inspection—no hidden fees.\n\nThis model not only enhances user experience but also fosters trust among clients and partners.\n\n**Market Position and Vision**\n\nThe company operates within the 'proptech' marketplace, targeting a critical area in the real estate sector with significant growth potential. With support from investors like Brad Flora, Inspectify is poised for continued disruption in the industry, targeting an increase in the number of inspections across the U.S. Their partnerships with leading real estate firms signal a strong reputation and a reliable service model.\n\n**Conclusion**\n\nIn a nutshell, Inspectify is more than just an inspection service—it's a movement towards innovation in real estate processes. As they continue to grow and evolve, their practical approach aims to provide better inspections for everyone involved in the property market.\n\nFor more information, you can visit [Inspectify's website](http://www.inspectify.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/e44725e4fb21d5a5c1ce75771c527ee5a49109b4.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191433Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=58fd113a425f3bad003b4208179713f7ef64e27de596df405ceb406896bfac17",
    "social_links": [
        "https://www.linkedin.com/company/getinspectify/",
        "https://www.facebook.com/getinspectify"
    ],
    "logo_path": "data/logos\\Inspectify_logo.png"
}