{
    "links": "https://www.ycombinator.com/companies/intellect",
    "name": "Intellect",
    "headline": "A modern-day mental health company for Asia.",
    "batch": "S21",
    "description": "Intellect is a modern-day mental health company on a mission to make mental healthcare & wellbeing support accessible for everyone in Asia.\r\n\nToday, Intellect is the largest and fastest growing mental health tech company in Asia, serving over 2.5 million members and leading organisations globally through our mental health platform. Intellect was also selected as one of Google’s Best Apps of 2020.\r\n\nIntellect is backed by leading investors including Insignia Ventures Partners, Y Combinator, and an extensive list of family offices, big tech executives & renowned angel investors.",
    "activity_status": "Active",
    "website": "https://intellect.co",
    "founded_date": 2020.0,
    "team_size": 30.0,
    "location": "Singapore, Singapore",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:mental-health-tech; industry:consumer-health-services",
    "founders": [
        {
            "name": "Theodoric Chew, Founder",
            "description": "Theodoric is the co-founder & CEO of Intellect, a mental health company building a new mental healthcare system for Asia. Prior to founding Intellect, Theodoric led marketing and growth teams at various growth stage startups.",
            "linkedin": "https://linkedin.com/in/theodoricchew"
        },
        {
            "name": "Anurag Chutani, Founder",
            "description": "Anurag Chutani is the co-founder & CTO of Intellect, a seasoned full-stack engineer with experience leading engineering teams from early to growth-stage startups including CARS24 and Wadi.",
            "linkedin": "https://www.linkedin.com/in/a7urag/"
        }
    ],
    "status": true,
    "generated_description": "**Company Overview: Intellect**\n\nFounded in 2020 and based in Singapore, Intellect aims to reshape mental health care accessibility across Asia. It has quickly become the largest and fastest-growing mental health tech company on the continent, now serving over 2.5 million members and collaborating with leading organizations through its comprehensive mental health platform. The company has garnered notable recognition, including being selected as one of Google’s Best Apps in 2020.\n\n**Mission and Services**\n\nIntellect’s mission is clear: to provide modern mental health care and well-being support for everyone in Asia. They focus on creating an ecosystem that delivers evidence-based mental health solutions tailored to the needs of each user. They cater primarily to businesses, offering a suite of services including:\n\n- A self-care app and skill-building programs\n- Access to licensed psychologists and 24/7 Employee Assistance Programs (EAP)\n- Certified behavioral health coaches and counselors\n- Mental health first aid training and clinics\n\nTheir innovative approach empowers users by providing direct, on-demand access to mental health support in over 120 languages and 100 countries.\n\n**Growth and Impact**\n\nBacked by investors like Insignia Ventures Partners and Y Combinator, Intellect has established a robust foundation for growth. With a dedicated team of about 30 employees, they have achieved impressive metrics:\n\n- **35%** of employees in partnering organizations signed up for the app within the first year.\n- **93%** reported reduced anxiety after using the platform for 4-6 weeks.\n- An outstanding **4.9/5** user satisfaction rating from over 3 million app users illustrates the platform's effectiveness.\n\n**Client Testimonials**\n\nUsers of Intellect provide compelling endorsements of the service's impact. HR professionals from various organizations have cited significant improvements in employee morale and reductions in mental stress-related turnover. They appreciate the app’s ease of use, the personalization of coaching, and the comprehensive support system that seamlessly integrates into their employees' lives.\n\n**Conclusion**\n\nIntellect stands at the forefront of mental health technology in Asia, making waves in how mental wellness is approached. By fostering a culture of care and continuous support, they are not only transforming individual lives but also enhancing organizational productivity and well-being. The extensive resources and solutions offered by Intellect reflect a true commitment to redefining mental health access, tailored to the diverse needs of Asia’s workforce. \n\nFor more information, visit [Intellect's website](https://intellect.co).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/f6eb665d017e18cbdcb35e9904bc5c9c9bac14c1.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191435Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=a52d296d14cfdae15948a96f3c41bec9f216c26dd2c0b58952de7fc262710944",
    "social_links": [
        "https://www.linkedin.com/company/intellecthq/",
        "https://twitter.com/intellecthq",
        "https://www.facebook.com/intellect.co/",
        "https://www.crunchbase.com/organization/intellect-co"
    ],
    "logo_path": "data/logos\\Intellect_logo.png"
}