{
    "links": "https://www.ycombinator.com/companies/intelline",
    "name": "Intelline",
    "headline": "We make generators that use 40% less fuel, with any fuel.",
    "batch": "W19",
    "description": "Intelline makes industrial power generators that use 40% less fuel. Our first customers are energy sector and alternative fuel production companies. Replacing a 1MW diesel generator with a 1MW Intelline MLG system can save up to $1,000,000/year in fuel costs alone.\r\n\nThere are 200,000 new industrial generators produced per year, and at $85k for the average generator size this is a $17B market opportunity.\r\n\nOur generator can efficiently run emerging fuel types that traditional diesel engines can't use (flare gas, syngas, ammonia, hydrogen), and can switch between fossil fuels and any other liquid/gaseous fuel while running.",
    "activity_status": "Active",
    "website": "https://www.intelline.ca/",
    "founded_date": 2017.0,
    "team_size": 3.0,
    "location": "Waterloo, Canada",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:alternative-battery-tech; industry:hardware; industry:alternative-fuels; industry:climate",
    "founders": [],
    "status": true,
    "generated_description": "### Intelline: Revolutionizing Industrial Power Generation\n\n**Company Overview:**\nFounded in 2017 and part of Y Combinator’s Batch W19, Intelline is a Canadian startup located in Waterloo, Ontario, that’s developing a new kind of industrial power generator. With a compact team of three, they’re tackling a significant market opportunity in the industrial generator sector, valued at around $17 billion with 200,000 new units produced annually, each averaging $85,000.\n\n**Mission:**\nIntelline’s mission is straightforward yet impactful: \"We make generators that use 40% less fuel, with any fuel.\" The goal is to transform how industries power themselves by creating more efficient systems.\n\n**Technology:**\nAt the heart of Intelline's innovation is their Modular Linear Generator (MLG). This advanced system is capable of adapting to a variety of fuel types, including alternatives that traditional diesel engines can’t handle—flare gas, syngas, ammonia, and hydrogen. This means that businesses can switch between different fuel sources seamlessly, mitigating long-term fuel supply risks and reducing carbon emissions.\n\n**Innovation Highlights:**\n- **Fuel Efficiency:** The MLG can lower fuel consumption by up to 40% compared to modern diesel generators. This translates to significant savings; replacing a 1MW diesel generator with an Intelline MLG could save a company up to $1 million annually in fuel costs.\n- **Multi-Fuel Compatibility:** Thanks to its CAVIE™ modules, the generator can switch fuel types on the fly, making it more adaptable and future-ready than traditional generators.\n- **Scalable Power Output:** With a modular design, the system can be stacked up to 2MW in power, allowing users to tailor their energy needs without overcommitting to a fixed power solution.\n\n**Market Position and Vision:**\nIntelline is not just another player in the energy market; they're positioned as a sustainable alternative to traditional diesel options, aligning with the push for greener technologies. Their promise of reliability—being able to run on both fossil fuels and emerging clean energy sources—offers businesses the flexibility to transition without a complete overhaul of their systems.\n\n**Why Choose Intelline?**\nIn a landscape where many companies are depending on battery or fuel cell technology—often limited by infrastructure—Intelline's generators stand out as low-risk, versatile solutions. They empower companies to implement sustainable practices without the fear of inconsistent supply chains that could disrupt operations.\n\n**Get Involved:**\nIntelline is on the lookout for innovative minds to join their small yet impactful team. Interested applicants can visit their careers page to see available positions.\n\nFor more information, check out their website at [Intelline](https://www.intelline.ca).\n\nIn summary, Intelline is paving the way for a new era of industrial power—efficient, adaptable, and ready for the future. If they succeed, they won't just change how we generate power; they'll redefine what we think is possible in the energy sector.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/9498356ed2e6b8831040cdf81ab90f4c236fd1e2.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191436Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=838c6a2790c4eb4203242505fede8f867ed46df6d3e4a1a454f30f64920cf7a1",
    "social_links": [
        "https://www.linkedin.com/company/34746898/admin/",
        "https://www.facebook.com/intelline/",
        "https://www.crunchbase.com/organization/intelline"
    ],
    "logo_path": "data/logos\\Intelline_logo.png"
}