{
    "links": "https://www.ycombinator.com/companies/invofox",
    "name": "Invofox",
    "headline": "INVOFOX is the document processing AI for software companies",
    "batch": "S22",
    "description": "Invofox is the document processing AI for software companies. If you need to process documents such as invoices, receipts, bills of lading and others for your customers, you can easily build a first-in-class service with minimum effort using our technology. Check out our\r\nwebsite and developers portal for more information.",
    "activity_status": "Active",
    "website": "https://invofox.com",
    "founded_date": 2015.0,
    "team_size": 12.0,
    "location": "Madrid, Spain",
    "group_partner": "Tom Blomfield",
    "group_partner_yc": "https://www.ycombinator.com/people/tom-blomfield",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:ai",
    "founders": [
        {
            "name": "Alberto Gimeno, Founder",
            "description": "Computer scientist and mathematician.\nWorked for years as a developer before discovering my true passion in sales.\nReach out if you're intested in literature, crossfit or baseball.",
            "linkedin": "https://www.linkedin.com/in/gimenoalberto"
        },
        {
            "name": "Carmelo Juanes, Founder",
            "description": "Computer scientist and mathematician. Former researcher at CSIC. Full stack developer focused on web technologies. Talk to me about parkour, bouldering and inline skating!",
            "linkedin": "https://www.linkedin.com/in/carmelojuanes/"
        },
        {
            "name": "Adrian Ramirez, Founder",
            "description": "Computer Engineer and Mathematician with a demonstrated history of working in the research industry. Highly skilled in many programming languages with extensive knowledge of ML and DL.\nHobbies include hiking, bouldering, soccer and beer brewing.",
            "linkedin": "https://www.linkedin.com/in/adrian-ramirez-delrio/"
        }
    ],
    "status": true,
    "generated_description": "**Company Overview: Invofox**\n\nFounded in 2015, Invofox is based in Madrid, Spain, and has been making waves in the fintech and AI spaces. As part of Y Combinator's Batch S22, Invofox specializes in document processing AI tailored specifically for software companies. Their mission is straightforward yet ambitious: to streamline the handling of essential documents such as invoices, receipts, and bills of lading, making it easy for developers to build top-tier services effortlessly.\n\n**Why Invofox?**\n\nInvofox offers an intuitive platform where users can upload documents that the AI processes, sorts, and validates in mere seconds. This data can then be exported to spreadsheets or directly integrated into ERPs. The tech is particularly beneficial for companies in the realms of expense management, accounting, and ERP solutions, but its versatility doesn’t stop there. With capabilities to handle a variety of document types and custom fields, Invofox adapts to the unique needs of its clients.\n\n**Team and Support**\n\nThe team is relatively small, with 12 dedicated employees guided by group partner Tom Blomfield. This lean setup allows for agility and focused customer service—key for startups and scale-ups that need robust support as they grow.\n\n**Unique Features**\n\n1. **Human-in-the-loop (HITL)**: Clients can enhance their document processing with human oversight when needed, ensuring higher accuracy.\n2. **Embeddable Program**: Developers can easily integrate Invofox’s UI into their existing platforms without hassle.\n3. **API Access**: Invofox provides developers with comprehensive API capabilities to streamline the integration process further.\n\n**Getting Started**\n\nFor anyone in the fintech space needing to optimize their document processing, Invofox is worth a look. A simple sign-up leads to full API access, allowing seamless implementation into your tech stack. Their robust analytics and customizable features not only help businesses save time but also support them in scaling operations efficiently.\n\n**Looking Ahead**\n\nWith a foundation built on innovation and a clear understanding of user needs, Invofox stands poised for growth in the rapidly evolving landscape of document processing. Their commitment to sustainability, diverse use cases, and user-friendly tech is likely to keep them at the forefront of the industry.\n\nFor more details or to start your journey with Invofox, check out their [website](https://invofox.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/a5c951fa0196ad89304e18417c8781e8eebb4fb0.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191438Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=a44a3f2c546d04790d8f9061bd7efd56515ff470fa6154b85e83ed053d4fb516",
    "social_links": [
        "https://www.linkedin.com/company/invofox/",
        "https://twitter.com/invofoxhq"
    ],
    "logo_path": "data/logos\\Invofox_logo.png"
}