{
    "links": "https://www.ycombinator.com/companies/iollo",
    "name": "iollo",
    "headline": "At-home metabolomics test for healthy lifespan extension",
    "batch": "S22",
    "description": "iollo is an at-home metabolomics test to extend your healthy lifespan. We measure more than 500 biomarkers in blood and use AI to automatically match you with dietary, behavioral, and therapeutic interventions.",
    "activity_status": "Active",
    "website": "https://www.iollo.com/",
    "founded_date": 2022.0,
    "team_size": 3.0,
    "location": "San Francisco",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:generative-ai; industry:health-tech; industry:biotech; industry:enterprise; industry:ai; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Daniel Gomari, Founder/CEO",
            "description": "Daniel Gomari is the founder and CEO of iollo. He was previously a postdoctoral researcher at Stanford University where he led projects on healthy aging and lifespan extension. He received his PhD in Computational Biology, ​​where he built and applied machine learning methods for drug repurposing, with applications in cancer and diabetes patient metabolomics data.",
            "linkedin": "https://www.linkedin.com/in/daniel-gomari/"
        }
    ],
    "status": true,
    "generated_description": "### iollo: A New Frontier in Metabolomics\n\n#### Overview\niollo, founded in 2022 and based in San Francisco, is a pioneering health-tech company that offers an at-home metabolomics test aimed at extending healthy lifespans. With a compact team of just three, it has already made waves as part of Y Combinator's Batch S22.\n\n#### Mission\nThe company's mission is simple yet ambitious: to empower individuals with insights that can help enhance their health and longevity. iollo does this by measuring over 500 biomarkers in blood samples and employing AI to provide personalized recommendations on dietary, behavioral, and therapeutic interventions.\n\n#### What They Offer\niollo simplifies health monitoring by allowing users to collect blood samples from the comfort of their homes. Here’s how it works:\n\n1. **Subscription:** Users sign up and receive a kit with a pain-free collection device.\n2. **Sample Collection:** Users collect a small blood sample and return it using a prepaid label.\n3. **Insights Delivered:** Within 3-5 weeks, they receive personalized health reports, highlighting areas like biological age, metabolic health, heart health, and gut microbiome status.\n4. **Continuous Improvement:** iollo encourages regular testing to track progress and adjust lifestyle changes based on data.\n\n#### The Science Behind It\nWhat sets iollo apart is its commitment to thoroughness. Traditional labs might analyze just 30 molecules, but iollo dives deeper, examining over 500 metabolites. This comprehensive approach enables users to gain a better understanding of their current health status—what's actually happening in their bodies—rather than just predictions based on genetic data.\n\n#### Industry Insights\niollo has garnered attention not just for its innovative product, but also for the impressive background of its founding team, which includes experts from Stanford University. It’s tagged in sectors like generative AI, biotech, and health tech, indicating its broad reach in today's technology-driven health landscape.\n\n#### User Testimonials\nCustomers rave about their experiences, citing tailored health insights that lead to real improvements in energy levels, weight management, and overall metabolic health. iollo is likened to a \"wellness GPS\" that guides users through their health journey with recommendations based on solid data.\n\n#### Conclusion\niollo is more than just a health product; it's a new way of looking at personal health through the lens of metabolomics. As technology advances and awareness of personalized health grows, companies like iollo are poised to lead the charge in transforming how we understand and enhance our well-being. You can learn more about their services and start your journey at [iollo.com](https://www.iollo.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/922fcc9207c276790c905c459bfab7ff92caef40.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191438Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=5c5d0d908ca4ce507b0494a18bc45918038c4cde91cd8d695443b0fbcea64af5",
    "social_links": [
        "https://www.linkedin.com/company/iollo/",
        "https://twitter.com/iollohealth"
    ],
    "logo_path": "data/logos\\iollo_logo.png"
}