{
    "links": "https://www.ycombinator.com/companies/iona-mind",
    "name": "Iona Mind",
    "headline": "Software-based mental health support",
    "batch": "S21",
    "description": "Iona Mind is building the first fully-digital care pathway for common mental health issues. \r\n\nOur products are based on Cognitive Behavioural Therapy (CBT), one of the most effective evidence-based forms of treatment, which is delivered in a fully automated way using a conversational interface. Unlike other wellbeing apps, our exercises and programs are evidence-based, with over 300 peer reviewed journal papers showing the efficacy of CBT in the treatment of many common mental health conditions.",
    "activity_status": "Active",
    "website": "https://ionamind.com/",
    "founded_date": 2019.0,
    "team_size": 5.0,
    "location": "London, United Kingdom",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:mental-health-tech; industry:consumer-health-services",
    "founders": [
        {
            "name": "Jonathan Baker, Founder",
            "description": "Cofounder/COO @ Simudyne (Techstars, Barclays, SwayVC)\nHead of Mathematics GWA\nTrinity College, Cambridge",
            "linkedin": "https://www.linkedin.com/in/jonathan-baker/"
        },
        {
            "name": "Philip Howson, Founder",
            "description": "Previously Philip was a founding partner and head of trading technology at XTX Markets which is now one of the world's largest automated (algorithmic) trading firms. Philip retired from XTX Markets in April 2016. Before XTX, Philip worked at GSA Capital (which XTX span out from), Barclays Capital, UBS and Morgan Stanley predominantly on automated trading.",
            "linkedin": "https://www.linkedin.com/in/philiphowson/"
        }
    ],
    "status": true,
    "generated_description": "**Iona Mind** - Pioneering Mental Health Tech Solutions\n\nIona Mind is an innovative startup focused on providing software-based mental health support, founded in 2019 as part of Y Combinator's Batch S21. Located in London, this compact team of five is driven by the mission to create a fully digital care pathway addressing common mental health issues.\n\n### What They Do\nAt its core, Iona Mind leverages Cognitive Behavioral Therapy (CBT), a proven, evidence-based treatment method backed by over 300 peer-reviewed studies. What sets Iona Mind apart from typical wellness apps is its automated delivery of CBT through a conversational interface, making it accessible and engaging for users.\n\nTheir offerings include tailored psychological support designed to meet the specific needs of diverse populations, including chronic disease sufferers and underrepresented groups. They’re not just building another app; they’re shaping scalable solutions that adapt to the individual, ensuring a more personalized approach to mental wellbeing.\n\n### Why Iona Mind Stands Out\n1. **Market Leadership**: They are at the forefront of low-intensity CBT technologies, which enable users to engage with therapeutic content at their own pace, reducing pressure on both patients and healthcare providers.\n\n2. **24/7 Support**: Iona Mind offers around-the-clock access to their care team via their platform, ensuring immediate assistance for those in need.\n\n3. **Co-Development**: Their products are crafted with direct input from users, ensuring inclusivity and accessibility right from concept to rollout.\n\n### Global Recognition\nIona Mind isn't just a local player; they have established partnerships and initiatives globally, notably working with:\n- The Carbone Cancer Center in Wisconsin to tailor CBT for cancer patients.\n- Unum to enhance employee benefits with accessible psychological support.\n- The Office for Veterans’ Affairs, adapting their platform to fit NHS England’s mental health model.\n\n### Summary\nIn essence, Iona Mind represents a meaningful shift in mental health care, marrying technology with science to create accessible, efficient, and effective support mechanisms. They address the growing demand for personalized mental health solutions, making strides towards not just treating symptoms but fostering holistic, long-term wellbeing. \n\nIf you’re interested in exploring their services, visit their website at [ionamind.com](https://ionamind.com/).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/07729509825952bc1c22de0bd1263a120726a408.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191438Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=f8f348fa539e503a99ef589100c6b39714eeb68144ab567782fe06d7dd8697c7",
    "social_links": [
        "https://www.linkedin.com/company/ionamind/",
        "https://twitter.com/iona_mind?lang=en",
        "https://www.facebook.com/ionamind/",
        "https://www.crunchbase.com/organization/iona-mind"
    ],
    "logo_path": "data/logos\\Iona_Mind_logo.png"
}