{
    "links": "https://www.ycombinator.com/companies/ironclad",
    "name": "Ironclad",
    "headline": "Digital contracting platform for legal teams.",
    "batch": "S15",
    "description": "Contracts are business decisions trapped in administrative tasks. Ironclad is software that does all the administrative work better left for a robot, freeing legal teams to do more substantive work and drive business strategy. By automating contracting processes and extracting intelligence from contracts, Ironclad lets legal teams focus on legal work, rather than paperwork. Legal teams at companies like Gusto, HotelTonight, GoFundMe, Glassdoor, Procore use Ironclad to get their contracts done more efficiently and accurately, and to maintain a single source of truth regarding their contents.\r\n\nHeadquartered in San Francisco, Ironclad is backed by Accel, Greylock, SV Angel, Formation 8, and was incubated in Y Combinator. For more information, visit https://www.ironcladapp.com.",
    "activity_status": "Active",
    "website": "http://ironcladapp.com",
    "founded_date": 2014.0,
    "team_size": 400.0,
    "location": "San Francisco",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:saas; industry:legaltech; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Jason Boehmig, Founder/CEO",
            "description": "Founder @ Ironclad, Inc.",
            "linkedin": "http://www.linkedin.com/in/jboehmig"
        },
        {
            "name": "Cai GoGwilt, Founder/CTO",
            "description": "Cai GoGwilt has always been passionate about building products that make people more effective at their jobs. He is an MIT graduate in Computer Science and Physics, as well as a former software engineer at Palantir Technologies. By day, he’s a celebrated software engineer and thoughtful leader; by night, he’s a concert cellist and karaoke enthusiast.",
            "linkedin": "https://www.linkedin.com/pub/cai-gogwilt/22/18a/77b"
        }
    ],
    "status": true,
    "generated_description": "**Ironclad: Reinventing Contract Management for Legal Teams**\n\nFounded in 2014 and based in San Francisco, Ironclad has become a cornerstone in the legal tech industry by transforming how legal teams manage contracts. It operates on a simple yet powerful premise: contracts are often business decisions buried under administrative tasks. Ironclad's digital contracting platform automates these tasks, allowing legal professionals to focus on substantive work that drives business strategy rather than drowning in paperwork.\n\nImagine a world where drafting, reviewing, and negotiating contracts are streamlined through a user-friendly platform. Ironclad utilizes advanced technologies, including artificial intelligence, to help legal teams efficiently manage their contract lifecycle. With clients like Gusto, GoFundMe, and HotelTonight relying on Ironclad, it’s clear that the solution resonates across industries.\n\nAt the core of Ironclad's suite are features for Contract Management, AI-assisted drafting and review, and an intuitive e-signature service. Users are guided through the full lifecycle of contracts, enabling everything from negotiation to execution—all while maintaining a single source of truth for contract data.\n\nIronclad is backed by prestigious investors like Accel and Greylock and emerged from the Y Combinator accelerator program, which says a lot about its potential and credibility. With a growing team of around 400 employees, the company is not just about software; it's also about building a vibrant community around legal transformation. Whether you’re in legal, sales, or procurement, Ironclad provides tailored solutions to meet various contract management needs.\n\nRecognized as a leader in contract lifecycle management, Ironclad showcases a commitment to excellence through awards and positive client testimonials. They also offer educational resources—from webinars to a detailed resource library—to support users in maximizing their platform experience.\n\nIf you’re tired of the inefficiencies tied to traditional contract management, give Ironclad a look. Their approach unlocks not only the potential of your legal team but also the full capability of your business operations. Check them out at [Ironclad’s Official Website](http://ironcladapp.com) for more details and to request a demo.\n\nIn the world of legal tech, Ironclad stands out by making contracting simple, efficient, and strategically aligned with business goals. It's not just about getting contracts done; it's about enabling teams to focus on what really matters—their work.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/7caf1da5d2539a93354bd5d6e20607ec6b014678.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191438Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=64616c592317799dbea7c501fd93117dfbb71036095b3b262142442765066e6c",
    "social_links": [
        "https://www.linkedin.com/company/ironclad-inc-/",
        "https://twitter.com/ironclad_inc",
        "https://www.facebook.com/ironcladinc/",
        "https://www.crunchbase.com/organization/ironclad",
        "https://github.com/Ironclad"
    ],
    "logo_path": "data/logos\\Ironclad_logo.png"
}