{
    "links": "https://www.ycombinator.com/companies/isono-health",
    "name": "iSono Health",
    "headline": "AI-powered platform for Accessible and Personalized Breast Healthâ\u0080¦",
    "batch": "W16",
    "description": "The iSono Health platform combines automated 3D ultrasound technology with cloud computation and artificial intelligence to empower women and their physicians with early detection and monitoring of breast cancer. Our patented compact ultrasound scanner captures 3D images through automatic scanning of whole breast volume in 1 min. The device connects to a smartphone/tablet/laptop and is controlled by our mobile app. The data is transferred to a secure cloud for image processing and storage. Our machine learning algorithm uses acoustic biomarkers to identify abnormal masses.  Our platformâ\u0080\u0099s automated operation and software expands ultrasound use in point-of-care diagnostics as well as monitoring of breast health at home, walk-in and mobile clinics. \r\n\niSono Health offers women and healthcare providers :\r\nSafety: No Radiation\r\nActionable Feedback with AI\r\nFast: 2min Scan\r\nEasy to Use",
    "activity_status": "Active",
    "website": "http://www.isonohealth.com",
    "founded_date": 2016.0,
    "team_size": 9.0,
    "location": "San Francisco",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:artificial-intelligence; industry:consumer-health-services; industry:medical-devices; location:san-francisco-bay-area",
    "founders": [],
    "status": true,
    "generated_description": "**iSono Health: Revolutionizing Breast Health with AI**\n\nFounded in 2016 and a graduate of Y Combinator's W16 batch, iSono Health is based in San Francisco and specializes in transforming breast health diagnostics. At its core, the company is driven by a clear mission: to make breast health more accessible and personalized through an innovative, AI-powered platform.\n\n**The Technology:**  \n\niSono Health has developed the ATUSA, the world’s first automated 3D breast ultrasound scanner. This device captures entire breast volumes in just two minutes, eliminating the need for trained operators. It works by integrating an automated scanning mechanism with cloud computing and machine learning algorithms to identify abnormal masses using acoustic biomarkers. The compact scanner connects seamlessly to smartphones, tablets, or laptops, with all data securely stored in the cloud for processing.\n\n**Key Benefits:** \n\n1. **Safety First:** There’s no radiation involved with the ATUSA system, making it a safer option compared to traditional imaging methods.\n   \n2. **Speed and Convenience:** The scans take only two minutes, making it ten to fifteen times faster than manual methods. This rapid processing means women can undergo screenings with minimal disruption.\n  \n3. **User-Friendly:** Designed to be operated by healthcare providers at the point of care, the ATUSA system is intuitive enough that it can be utilized even by nurses or medical assistants without extensive training.\n\n4. **AI-Driven Insights:** By leveraging AI, iSono Health provides actionable feedback to both patients and their healthcare providers, enabling early detection and continuous monitoring of breast health.\n\n**The Team:**  \n\niSono Health is driven by a dedicated team of nine employees, including CEO Neda Razavi and Founder/CTO Shadi Saberi. With a strong technical background, they’re committed to improving breast health care accessibility. Their goal is to provide high-risk individuals with regular, personalized monitoring, enhancing patient experience while ensuring peace of mind.\n\n**Market Position and Future:**  \n\nWith a growing emphasis on personalized healthcare, iSono Health is positioned well within the consumer health services and medical device sectors. Supported by key partnerships and innovations, they aim to scale their impact—making breast health screenings and monitoring not just a medical necessity but a simple and routine part of healthcare.\n\nFor more information or to request a demo, visit their website at [iSono Health](http://www.isonohealth.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/476a7bba7339f1354baa8054512984d783355948.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191439Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=f8a5fd75865c75910c82c4dbd260831c3d6626bd98d9a9b1fb197bbdc7b6ade5",
    "social_links": [
        "https://www.linkedin.com/company/isono-health/",
        "https://twitter.com/isonohealth",
        "https://www.crunchbase.com/organization/isono-health"
    ],
    "logo_path": "data/logos\\iSono_Health_logo.png"
}