{
    "links": "https://www.ycombinator.com/companies/ivy-homes",
    "name": "Ivy Homes",
    "headline": "We make instant offers to buy homes in India",
    "batch": "S21",
    "description": "Selling a home is a super stressful affair due to the uncertainties involved. We help smoothen that process by guaranteeing a fair price and offering that value upfront for the seller. We’ve built up an information system that captures the details of all real estate transactions.\r\nWe’ve further developed a pricing model on top of it that helps determine the value of a home. We use this to offer liquidity to the seller by making an instant offer to purchase their house. We then refurb the property as necessary and further sell through our channel partners.",
    "activity_status": "Active",
    "website": "https://ivy.homes",
    "founded_date": 2021.0,
    "team_size": 32.0,
    "location": "Bengaluru, India",
    "group_partner": "Brad Flora",
    "group_partner_yc": "https://www.ycombinator.com/people/brad-flora",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:proptech",
    "founders": [
        {
            "name": "Abhilash Narahari, Founder",
            "description": "I was previously the co-founder/ CEO of Elanic - a C2C e-commerce platform for fashion and lifestyle goods. I led the company for 4 years scaling it to over100k sellers till it was acquired by ShareChat.",
            "linkedin": "https://www.linkedin.com/in/abhilash-narahari-a33284a9/"
        },
        {
            "name": "Pritam Thakur, Founder",
            "description": "Prior to Ivy Homes, I was the Director of Content Operations at ShareChat. I was leading a team of 200+ members, managing multiple verticals including online campaigns, content moderation and creator management. Prior to this, I ran a real estate project in India and before that I was in Rocket Internet in South East Asia.",
            "linkedin": "https://www.linkedin.com/in/pritamthakur/"
        }
    ],
    "status": true,
    "generated_description": "**Ivy Homes: Simplifying Home Selling in India**\n\nIvy Homes is shaking up the real estate game in India. Founded in 2021 as part of Y Combinator's Batch S21, they've made it their mission to take the stress out of selling a home. Selling a house can often feel like navigating a minefield of uncertainty and anxiety. Ivy Homes aims to change that by offering instant cash offers for homes, ensuring sellers receive a fair and guaranteed price upfront.\n\n### How They Work\nTheir process is straightforward:\n\n1. **Get an Offer in Seconds**: Sellers can see their preliminary offer quickly, often in a matter of moments.\n   \n2. **Free House Inspection**: If the offer catches your interest, Ivy sends professionals to inspect the property. They handle all the necessary paperwork, ensuring a hassle-free experience.\n\n3. **Sale Completion**: Once everything is in order, the closing happens, and the seller receives payment—typically within just 15 days.\n\nWhat distinguishes Ivy Homes from traditional methods is its technology-driven approach. They’ve developed a comprehensive information system that captures real estate transaction details, paired with a pricing model that accurately assesses home values. This mix of tech and service leads to a seamless experience for sellers and, importantly, provides necessary liquidity.\n\n### Founders and Team\nWith a team of around 32 employees based in Bengaluru, Ivy Homes is led by notable figures like Group Partner Brad Flora. Under their guidance, Ivy has evolved to facilitate over 3000 offers every month, collectively paying out more than 100 crores to homeowners in the last year alone—without backing out from any of their offers.\n\n### Why Choose Ivy Homes?\nFor homeowners looking to sell quickly and smoothly, Ivy Homes offers:\n- A reliable selling process—get your money within 15 days.\n- Fair and competitive pricing.\n- 100% legal clarity, ensuring peace of mind throughout the transaction.\n\nTheir slogan, \"Sell within 15 days,\" isn’t just a catchy phrase—it's a promise backed by their operational model.\n\n### In Summary\nIvy Homes is not just a proptech company; they are redefining the real estate transaction landscape in India. At Ivy, it isn’t about just selling or buying houses; it’s about transforming the experience into something manageable and human-centric. They’re all about reducing friction, making offers quick, and ensuring sellers feel valued and secure, something that has resonated with thousands across the nation.\n\nVisit their website at [ivy.homes](https://ivy.homes) for more details or to get your free offer today.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/e15846da4df8773fec0421fe1a262ccaad999d45.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191439Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=e0b8144bcf434d28d2975b2e2c8d299729594f3869c5ca9859b431775f71a844",
    "social_links": [
        "https://www.linkedin.com/company/ivy-homes",
        "https://www.facebook.com/IvyHomesIndia",
        "https://www.crunchbase.com/organization/ivy-homes"
    ],
    "logo_path": "data/logos\\Ivy_Homes_logo.png"
}