{
    "links": "https://www.ycombinator.com/companies/jamble",
    "name": "Jamble",
    "headline": "Fashion resale marketplace powered by live streaming and video",
    "batch": "S22",
    "description": "Jamble is the new place to buy & sell secondhand fashion. We empower resellers with video & Live streaming tools to sell more effectively; and buyers with a unique compelling experience. Jamble is designed for the sustainable fashion community to engage, connect and inspire. We’re a mobile-first platform and launched on iOS! 👉 Check us out: https://apple.co/3Pfwran",
    "activity_status": "Active",
    "website": "https://www.jambleapp.com/",
    "founded_date": 2021.0,
    "team_size": 3.0,
    "location": "San Francisco",
    "group_partner": "Brad Flora",
    "group_partner_yc": "https://www.ycombinator.com/people/brad-flora",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:marketplace; industry:sustainable-fashion; industry:consumer; industry:social; industry:creator-economy; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Louis de Jenlis, Founder",
            "description": null,
            "linkedin": "https://www.linkedin.com/in/louis-de-jenlis-373654b8/"
        },
        {
            "name": "Aymar Dumoulin, Founder",
            "description": "Co-founder of Jamble, working on the product. Previous experiences in the consumer space, as a VC analyst at Convivialité Ventures in SF and Private Equity at L Catterton (Paris). Alum of Essec Business School and University Paris-Dauphine.",
            "linkedin": "https://www.linkedin.com/in/aymar-dumoulin/"
        },
        {
            "name": "Jeremy Gozlan, Founder",
            "description": "Hey! I am Jeremy, a tech guy from Paris, France. While originally specialised in AI (computer vision), I always loved developing iOS mobile apps. Sneakerhead for more than 15 years, becoming Jamble CTO was nothing else than my destiny.\nRegarding my studies,\nI recently graduated from Ecole Polytechnique, France most prestigious Engineering School and previously graduated from the University of Bath as a Computer System Engineer.",
            "linkedin": "https://www.linkedin.com/feed/"
        }
    ],
    "status": true,
    "generated_description": "### Jamble: The Live Fashion Resale Marketplace\n\n**Overview**\nFounded in 2021 and based in San Francisco, Jamble is a dynamic online marketplace specifically tailored for secondhand fashion enthusiasts. It blends sustainability with innovation by utilizing live streaming and video tools to create an engaging buying and selling experience. With a small but dedicated team of three and support from Y Combinator's Batch S22, Jamble is pushing the boundaries of how fashion resale works.\n\n**Mission**\nJamble's mission is clear: to empower both resellers and buyers within the sustainable fashion community. By providing robust video and live streaming capabilities, they create a platform where sellers can showcase their items compellingly while buyers receive a unique shopping experience.\n\n**What They Offer**\n- **Live Shopping Experience:** Jamble transforms traditional online shopping into a live event where sellers auction items in real-time, creating a social atmosphere. Buyers can engage, bid, and interact, making the process feel more like a community event than mere commerce.\n  \n- **Vast Product Selection:** With over 700,000 items available from more than 4,000 sellers, shoppers can dive into a treasure trove of fashion gems, from vintage pieces to contemporary styles. \n\n- **Mobile-First Approach:** Designed for on-the-go users, Jamble launched exclusively on iOS, allowing seamless access to the platform via smartphones.\n\n**Community Engagement**\nJamble isn't just about transactions; it's about building a vibrant community. Users often describe it as \"social media for thrifting,\" where creativity thrives and relationships develop. Sellers report enjoying the interactions and friendships they forge while selling, proving that fashion can unite people.\n\n**Getting Started**\nFor those interested in selling, becoming a live seller on Jamble is straightforward. After setting up an account and linking a bank account, users can begin listing their items for sale. Plus, the platform has safeguards in place to ensure product authenticity, giving buyers peace of mind.\n\n**Key Tags**\nJamble is categorized under various hashtags that highlight its core focus areas:   \n- #Marketplace  \n- #SustainableFashion  \n- #Consumer  \n- #Social  \n- #CreatorEconomy  \n- #SanFranciscoBayArea  \n\n**Future Aspirations**\nJamble aims to redefine how people think about fashion consumption. By emphasizing resale, they align with eco-friendly practices that resonate with today's conscious consumers. They believe that fashion should be fun, accessible, and, above all, sustainable.\n\n**Join the Movement**\nWhether you're a passionate reseller eager to share your unique finds or a fashion-conscious buyer looking for that perfect piece at a great price, Jamble invites you to join this growing community. Dive into the future of fashion resale today by exploring their app or their website.\n\n**Check it Out:**  \n- [Download the Jamble App on iOS](https://apps.apple.com/us/app/jamble-live-fashion-shopping/id1599696300?uo=4)  \n- [Visit the Website](https://www.jambleapp.com)  \n\nJamble isn't just a platform; it's a fashion revolution waiting for you to be a part of it.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/a1b829178d653f4d1ea417ec64a9cfd6f26f9bcd.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191439Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=88ab0238bed3a681206b0b2dc12cdeb6c11f163b6127ebfb3669dfa797d58750",
    "social_links": [],
    "logo_path": "data/logos\\Jamble_logo.png"
}