{
    "links": "https://www.ycombinator.com/companies/jamsocket",
    "name": "Jamsocket",
    "headline": "Run compute-intensive apps in a browser",
    "batch": "W22",
    "description": "We are a platform for high-performance browser-based applications. We make it easier for developers to deploy apps that give every user a dedicated backend.\r\n\nThis is a system design that apps like Figma and GitHub codespaces use, but it's currently difficult for others to replicate it. We make it as easy as deploying a traditional web server.",
    "activity_status": "Active",
    "website": "https://jamsocket.com",
    "founded_date": 2021.0,
    "team_size": 5.0,
    "location": "New York",
    "group_partner": "Diana Hu",
    "group_partner_yc": "https://www.ycombinator.com/people/diana-hu",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:cloud-computing; location:new-york",
    "founders": [
        {
            "name": "Paul Butler, Founder",
            "description": "I'm a technical founder building Drifting in Space. My career has straddled the line between engineering and data science, with stints at Google as a software engineer on search, Two Sigma as a quantitative analyst, and botnet detection at an adtech startup.\n\nI'm originally from Halifax, Canada, currently based in Brooklyn, and love running, sailing, and exploring new cities.",
            "linkedin": "https://linkedin.com/in/paulgb"
        },
        {
            "name": "Taylor Baldwin, Founder",
            "description": "Co-founder of Drifting in Space. Was previously a software engineer at Uber and Datadog building WebGL-based data viz applications in the browser. Before becoming a software engineer, I was a classical musician with bachelor and master degrees in piano performance and pedagogy.",
            "linkedin": "https://www.linkedin.com/in/taylor-baldwin-642b4818/"
        }
    ],
    "status": true,
    "generated_description": "**Jamsocket: Powering Compute-Intensive Applications in Your Browser**\n\nJamsocket, founded in 2021 and part of Y Combinator’s Winter 2022 batch, is a game changer for developers creating high-performance, browser-based applications. The company is based in New York and operates with a small team of five, guided by Group Partner Diana Hu.\n\n**Mission and Vision**\nAt its core, Jamsocket enables compute-intensive apps to run efficiently right in the browser. The platform simplifies the complex architecture needed for apps like Figma and GitHub Codespaces, providing developers with a straightforward way to deploy applications that come with a dedicated backend for each user. It's all about making it as easy as deploying a traditional web server.\n\n**Key Features and Offerings**\n- **Real-Time Collaboration**: With Jamsocket, developers can utilize a powerful infrastructure that can scale sync engines seamlessly for real-time applications.\n- **Y-Sweet**: Jamsocket’s Yjs sync engine, Y-Sweet, helps developers add real-time collaboration features in minutes, complete with built-in authentication and options for custom compute resources.\n- **Observability**: Integrated tools allow users to monitor app performance, including memory and CPU usage, directly from the Jamsocket dashboard or command line interface.\n\n**Deployment Flexibility**\nWhether you prefer a fully managed service or want to deploy in your own AWS account, Jamsocket caters to both—making it versatile for startups and enterprises alike. This adaptability is crucial for developers who want control over their infrastructure without the headache of managing every component themselves.\n\n**Noteworthy Compliance**\nJamsocket is SOC 2 compliant, assuring users that their backends are not only powerful but also secure and reliable. This is a huge plus in today’s market where data privacy and security are paramount.\n\n**In Action**\nJamsocket has already made waves in various sectors. Notable clients include:\n- **Rayon**: Uses Jamsocket for real-time data handling in CAD software.\n- **Op**: Leverages Jamsocket's powerful backends for browser-based data analysis.\n- **Athena Intelligence**: Utilizes the platform to create environments for AI agents, illustrating its versatility in both collaborative and data-intensive applications.\n\nCurrently tagged under 'cloud-computing' and 'New York', Jamsocket is positioning itself as an essential platform for the next generation of web applications. Their website, [jamsocket.com](https://jamsocket.com), provides more insights along with options to sign up or learn more about their offerings.\n\nIn a nutshell, Jamsocket isn't just an infrastructure solution; it's an enabler for developers to push the boundaries of what's possible in the browser. If you're building compute-intensive applications or need robust real-time collaboration features, Jamsocket might just be the platform you're looking for.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/5d60688ce766053b3c591bd2eea5b070d5fe4f44.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191440Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=c19b0f36894f95f297d0522b139f56591961cb549aea602def61b6b50545ed36",
    "social_links": [
        "https://www.linkedin.com/company/jamsocket",
        "https://twitter.com/drifting_corp",
        "https://www.crunchbase.com/organization/jamsocket",
        "https://github.com/drifting-in-space"
    ],
    "logo_path": "data/logos\\Jamsocket_logo.png"
}