{
    "links": "https://www.ycombinator.com/companies/jasmine-energy",
    "name": "Jasmine Energy",
    "headline": "Jasmine is a decentralized market for climate assets",
    "batch": "S22",
    "description": "Jasmine makes the buying and selling of renewable energy assets easy, accessible, and transparent.",
    "activity_status": "Active",
    "website": "http://www.jasmine.energy",
    "founded_date": 2022.0,
    "team_size": 6.0,
    "location": "Washington, DC",
    "group_partner": "Gustaf Alstromer",
    "group_partner_yc": "https://www.ycombinator.com/people/gustaf-alstromer",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:marketplace; industry:crypto-web3; industry:climate",
    "founders": [
        {
            "name": "Nathalie Capati, Founder",
            "description": "Forbes 30 under 30 in Energy. Previous apple engineer on special projects. \nPrimary inventor of highly modular, energy storage systems.\n\nBattery systems engineer turned crytpo fanatic during the pandemic - fun story ask me about how I got into it. I'm now obsessed with creating a liquid market for renewable energy credits to help lower the cost of capital for renewable energy projects. \n\nLove to talk about crypto, climate and electric cars.",
            "linkedin": "https://www.linkedin.com/in/nathaliecapati-energy/"
        },
        {
            "name": "T. Dalton Combs, Founder",
            "description": "Minds, Machines, Markets",
            "linkedin": "http://www.linkedin.com/in/TDaltonC"
        },
        {
            "name": "Matt Mayberry, Founder",
            "description": "on a relentless mission to see what man can make of man 🏴‍☠️",
            "linkedin": "http://www.linkedin.com/in/matthewmayberry"
        }
    ],
    "status": true,
    "generated_description": "### Jasmine Energy: Simplifying Climate Assets in a Decentralized Market\n\nFounded in 2022 and nestled in the heart of Washington, DC, Jasmine Energy stands out as a decentralized marketplace dedicated to climate assets. Initially focused on making the buying and selling of renewable energy assets straightforward, Jasmine has evolved into a pivotal platform enabling transparency and accessibility in renewable energy exchanges.\n\nBeing part of Y Combinator's Batch S22 lends credibility, and with a nimble team of six, Jasmine is poised for growth. Leading the charge is Gustaf Alstromer, their Group Partner, who adds significant value to the company's vision.\n\n#### What Jasmine Energy Does\n\nJasmine specializes in managing Renewable Energy Certificates (RECs)—an essential component of the renewable energy ecosystem. They simplify the cumbersome processes involved in registration, data management, and broker transactions of RECs. The platform takes care of the regulatory paperwork and ensures that users get paid smoothly—so much so that all you have to do is register your solar system (for free) and watch the magic happen.\n\nTheir user-friendly approach means you can easily verify generator information, compare prices, and buy or trade any volume of energy credits. Jasmine ensures no hidden fees creep in, offering transparent pricing and straightforward contracting that caters to various capacities.\n\n#### Audience and Services\n\nJasmine Energy tailors its services to three main groups:\n\n1. **Homeowners with Rooftop Solar** - Aimed at maximizing the value of their energy production while managing RECs efficiently.\n2. **Third-Party Owners (TPO)** - For those owning small-scale solar systems, Jasmine offers a way to manage RECs with ease.\n3. **Independent Power Producers (IPP)** - Catering to utility-scale producers by optimizing REC value and handling the bureaucratic load.\n\nEach category has tailored fee structures, designed to ensure that users can capitalize on their contributions to green energy.\n\n#### Why It Matters\n\nAt its core, Jasmine Energy is not just about trading energy certificates; it’s about building a more transparent and inclusive market for climate assets. With a focus on decentralization and accessibility, they aim to democratize the renewable energy landscape.\n\nTheir intuitive platform aligns perfectly with the growing demand for sustainable energy solutions, reflective of a shifting societal mindset toward environmental responsibility. The potential to trade energy credits effectively could pave the way for broader adoption of renewable sources.\n\nIn conclusion, Jasmine Energy is a forward-thinking startup with its finger on the pulse of the renewable energy sector. By leveraging technology to simplify access to climate assets, they're contributing to a more sustainable future—one certificate at a time. Check them out at [www.jasmine.energy](http://www.jasmine.energy) to learn more about joining their mission.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/6f0d1da9260a2b23c0433fbd9b1c81b8789b201c.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191440Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=6c1788f3283d079a27a608b6ad6abfa2090029014af25fb37b0172a5149c80bd",
    "social_links": [
        "https://www.linkedin.com/company/jasmine-energy/",
        "https://www.twitter.com/jasmine_energy",
        "https://github.com/Jasmine-Energy"
    ],
    "logo_path": "data/logos\\Jasmine_Energy_logo.png"
}