{
    "links": "https://www.ycombinator.com/companies/jeeves",
    "name": "Jeeves",
    "headline": "International banking infrastructure for global startups.",
    "batch": "S20",
    "description": "Jeeves is an all-in-one corporate spend and expense management platform for businesses in global markets including North America, Latin America, Europe, and the UK. Cash, corporate cards, and cross-border payments all run on the Jeeves proprietary infrastructure which allows companies to spin up their finance function within minutes. Jeeves can handle multiple currencies for payback. \r\n\nMore than 3,000 companies across the world trust Jeeves with their financial payments tack. Jeeves has raised $380 million from Andreessen Horowitz, CRV, GIC, Tencent, Silicon Valley Bank, Stanford University, and Y Combinator to fuel its international expansion. \r\n\nOur product platform covers the following:\r\n\n1. Jeeves Pay: Do you need to send capital calls between US & LATAM? Need cross-border payments that arrive as soon as the same day? Transfer money internationally to over 150 countries at competitive FX rates with Jeeves Pay. Payments arrive as quickly as the same day between North America, South America, and Europe. Credit line options available depending on region.\r\n\n2. Jeeves Cards: Equip your team with globally-accepted physical cards for in-person purchases. Ship cards overseas for free or create virtual cards in seconds for secure, online purchases. Prepaid & credit options available depending on region.\r\n\n3. Expense Management: Collect receipts through the mobile app, review expenses in real time, and streamline global reporting capabilities - all at no additional cost.\r\n\nBenefits of the Jeeves Payments and Spend Management global platform include:\r\n\n-- Free built-in expense management tools\r\n\n-- No personal guarantees or contracts\r\n\n-- Unlimited cards and users for free\r\n\n-- No monthly fees or software fees\r\n\n-- Competitive cross-border payment pricing\r\n\n-- Spend and pay in your preferred currencies\r\n\n-- Business accepted in Brazil, Canada, Colombia, Mexico, the EU, the UK, and the US.\r\n\nBuilt for global companies. Loved by finance teams, including a large YC contingent. \r\nJoin us today!",
    "activity_status": "Active",
    "website": "http://www.tryjeeves.com",
    "founded_date": 2019.0,
    "team_size": null,
    "location": "Miami, FL",
    "group_partner": "Dalton Caldwell",
    "group_partner_yc": "https://www.ycombinator.com/people/dalton-caldwell",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:payments",
    "founders": [
        {
            "name": "Dileep Thazhmon, Founder",
            "description": "Prior to Jeeves, Dileep was the COO/Co-Founder at PowerInbox (www.powerinbox.com), an email ad server product used by 600+ brands including CNN, Disney etc. Dileep started and grew the company from 3 to 50+ employees, while maintaining a $35M+ARR and profitable business. PowerInbox  was recognized as #2 in Inc. Top 30 List, #3 Deloitte Fast50 List, #4 Crains Top50 List.\n\nHe previously worked in Venture Capital and graduated with honors from Stanford University Graduate School of Business.",
            "linkedin": "https://www.linkedin.com/in/thazhmon/"
        }
    ],
    "status": true,
    "generated_description": "**Jeeves: Simplifying Global Finance for Startups**\n\nFounded in 2019 as part of Y Combinator Batch S20, Jeeves is revolutionizing how startups handle their financial operations on an international scale. Based in Miami, FL, Jeeves aims to provide a robust banking infrastructure for global startups, offering an all-in-one corporate spend and expense management platform.\n\n### What Does Jeeves Offer?\n\n1. **Jeeves Pay**: Need to make cross-border payments? Jeeves makes it simple. You can transfer money to over 150 countries swiftly, with payments arriving as soon as the same day at competitive foreign exchange rates.\n\n2. **Jeeves Cards**: Equip your team with globally accepted physical and virtual cards in seconds. Choose from prepaid or credit options—ideal for secure online purchases or in-person transactions.\n\n3. **Expense Management**: Say goodbye to manual tracking. With Jeeves, easily collect receipts, review expenses in real-time, and streamline global reporting through a free mobile app.\n\n### Unique Selling Proposition\n\nJeeves operates continuously without imposing personal guarantees or contracts, offering unlimited cards and users for free. There are no monthly or software fees, providing a cost-effective solution for startups. Also, Jeeves enables businesses in multiple regions, including Brazil, Canada, Colombia, Mexico, the US, the UK, and many countries across Europe, to spend and pay in their preferred currencies.\n\n### Impressive Growth\n\nSince its inception, Jeeves has gained the trust of over 3,000 global companies and has raised $380 million from notable investors like Andreessen Horowitz, CRV, and Y Combinator, paving the way for international expansion.\n\n### Trusted by Finance Teams\n\nJeeves has quickly become a preferred platform among finance teams, streamlining operations and enhancing efficiency. The product is particularly appealing to startups navigating the complexities of managing finances across different countries and currencies. Users praise the platform for making their financial processes faster and more transparent.\n\n### Summary\n\nJeeves is not just a fintech solution; it's a partner for startups looking to scale effortlessly. By consolidating cards, payments, and expense management into a single platform, Jeeves helps businesses save time and money while allowing them to operate globally with ease. \n\nTo learn more or to get started, check out [tryjeeves.com](http://www.tryjeeves.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/092548f7d00ef7086684ba978c12e2cd72eaa34a.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191440Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=d69f5e5dfe32a41d44140bd4caaa9a9e84d063be90cfe39ab376abfd6c43fbbb",
    "social_links": [
        "https://www.linkedin.com/company/tryjeeves/",
        "https://twitter.com/jeeves_inc"
    ],
    "logo_path": "data/logos\\Jeeves_logo.png"
}