{
    "links": "https://www.ycombinator.com/companies/jenfi",
    "name": "Jenfi",
    "headline": "Jenfi provides revenue-based financing for digital businesses in Asia",
    "batch": "W20",
    "description": "We back growing digital businesses using revenue based financing.\r\n\nMany of growing businesses in Asia are highly \"bankable\" yet 50-70% are unable to obtain capital to grow their business.\r\n\nHaving been business owners ourselves, we experienced firsthand the struggles of funding a business - from expensive equity options to loans that required personal guarantees.\r\n\nWe went live in Singapore first to validate the product/market fit. We plan to expand across the APAC region..\r\n\nOur sweet spot is backing repeatable business spend - expenses that leads to increased revenue. Our financing product allows businesses to keep growing with us over time. Over a third of our advances today are from repeat borrowers.\r\n\nWe created a brand new asset class in Asia - offering flexible repayment options, such as tieing repayment with sales. Business owners LOVE this.\r\n\nOur automated financial technology platform ingests revenue and alternative data sources that gives us a proprietary edge in understanding the behavior of our borrowers. As we collect continuous data, we are able to offer better financial and technology solutions, while mitigating our downside risk.\r\n\nFunds are seamlessly deployed via our virtual Jenfi Wallet and MasterCard solution, giving borrowers flexibility to make payments while giving Jenfi real-time tracking of their spend.\r\n\nRecent coverage: \r\nhttps://techcrunch.com/2020/02/03/jenfi-wants-to-solve-small-business-lending-in-southeast-asia/",
    "activity_status": "Active",
    "website": "http://jenfi.com/",
    "founded_date": 2019.0,
    "team_size": 18.0,
    "location": "Singapore, Singapore",
    "group_partner": "Gustaf Alstromer",
    "group_partner_yc": "https://www.ycombinator.com/people/gustaf-alstromer",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:banking-as-a-service; industry:fintech; industry:b2b",
    "founders": [
        {
            "name": "Jeffrey Liu, Founder",
            "description": "Jeff is the CEO and co-founder of Jenfi.\n\nHe founded GuavaPass, a fitness subscription service, which he ran as CEO from 2015-2018. The company expanded to 12 markets across Asia and the Middle East and was subsequently sold to ClassPass in 2018.\n\nJeff brings a strong operational and financial background from GuavaPass, BeachMint (corporate development), Victory Park Capital (credit hedge fund) and Lehman Brothers (investment banking). He has a MBA from Chicago Booth.",
            "linkedin": "https://www.linkedin.com/in/jeffreykliu/"
        },
        {
            "name": "Justin Louie, Founder",
            "description": null,
            "linkedin": "https://www.linkedin.com/in/nitsujri"
        }
    ],
    "status": true,
    "generated_description": "**Jenfi Overview**\n\nFounded in 2019 and based in Singapore, Jenfi is making waves in the fintech landscape as it champions revenue-based financing specifically tailored for digital businesses in Asia. Their mission is clear: they aim to provide the capital that many growing businesses desperately need but often cannot access through traditional lending channels.\n\n**The Problem and the Solution**\n\nIt's a common scenario—many businesses in Asia are \"bankable\" but still find themselves cut off from vital funding, with up to 70% unable to secure financing. As former business owners, the founders of Jenfi understand this struggle all too well. They sought to eradicate the headache of expensive equity financing and the burdensome requirements of traditional loans.\n\nBy launching first in Singapore, Jenfi validated its product-market fit and is now poised for expansion across the APAC region. They specialize in backing repeatable business expenses that drive revenue growth. Not just a one-time fix, Jenfi’s approach unfolds over time, fostering repeat borrowing relationships—over a third of their advances are from clients who return for more.\n\n**Innovative Financing Model**\n\nJenfi's competitive edge lies in its novel asset class and flexible repayment options—business owners can repay a percentage of their revenue. This model aligns closely with the businesses they serve, particularly digital and e-commerce companies. Made possible through their automated and technology-driven platform, Jenfi processes revenue data and other alternative data sources to assess borrower behavior, which in turn informs better financing solutions.\n\nFunds are managed through a virtual Jenfi Wallet and charged via a MasterCard, ensuring real-time tracking of expenditures—a perfect blend of autonomy and oversight.\n\n**Highlights and Achievements**\n\n- **Team and Growth**: Jenfi consists of a dedicated team of 18 employees and is part of Y Combinator's Batch W20.\n  \n- **Performance**: Companies funded by Jenfi experience impressive growth, averaging 8.1% monthly—a staggering 156% annualized growth.\n\n- **Coverage**: The company has garnered attention from significant outlets like TechCrunch, underscoring its role in transforming small business lending in Southeast Asia.\n\n**Looking Ahead**\n\nJenfi is on a mission to dismantle the barriers to capital that hinder digital businesses from thriving. If you’re a digital entrepreneur in need of capital without the weight of giving up equity, Jenfi’s innovative financing solutions might just be the lifeline you’re looking for.  \n\nIn essence, Jenfi isn't just offering funding; they’re creating a partnership that empowers businesses to leverage growth opportunities while maintaining the freedom to operate independently.\n\n**For more information, visit [Jenfi's website](http://jenfi.com/).**",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/c0e05b65a467bae8161d4056ac316aa967226468.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191440Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=68490745f9a14befba46b890e0f12ce9f545452bb297df4804a4b4d009717bd6",
    "social_links": [
        "https://www.linkedin.com/company/jenfi",
        "https://twitter.com/JenfiCapital",
        "https://www.facebook.com/jenficapital/",
        "https://www.crunchbase.com/organization/jenfi",
        "https://github.com/jenfi-eng"
    ],
    "logo_path": "data/logos\\Jenfi_logo.png"
}