{
    "links": "https://www.ycombinator.com/companies/jerry-inc",
    "name": "Jerry",
    "headline": "Jerry makes it really easy to save time and money on car expenses.",
    "batch": "S17",
    "description": "Jerry makes it really easy to save time and money on car expenses. The car ownership super app first launched its AI- and machine-learning-based car insurance compare-and-buy service in 2019. Today, Jerry serves more than 3 million customers as a licensed insurance broker and an authorized auto refinance provider, while also offering free telematics-based driver safety and repair estimator services.\r\n\nThe fastest, easiest and only automated way to compare and buy car insurance, Jerry gives you customized quotes from more than 55 insurance carriers in 45 seconds. Customers skip all the long forms and unwanted human interaction while Jerry hunts for better rates and completes the transaction, saving more than $800 per year. In 2022, Jerry launched its auto refinancing marketplace, which can help customers lower their monthly car payments, on average, by $118 dollars.\r\n\nJerry is scaling its car insurance and auto refinance products and expanding its marketplace into new categories, removing friction from additional car ownership needs. Jerry will be the only app car owners need to manage all their car expenses.\r\n\nHeadquartered in Palo Alto, the company has offices in Toronto, and Lockport, NY, and has removed physical location from recruiting restraints to attract talent.",
    "activity_status": "Active",
    "website": "https://getjerry.com",
    "founded_date": 2017.0,
    "team_size": 288.0,
    "location": "Palo Alto",
    "group_partner": "Garry Tan",
    "group_partner_yc": "https://www.ycombinator.com/people/garry-tan",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:insurance; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Musawir Shah, Founder/CTO",
            "description": "Hardware/software enthusiast, passionate about building highly usable, highly scalable products. Currently focusing on the art of running an efficient software engineering team, leading with code editor in hand.",
            "linkedin": "https://www.linkedin.com/in/musawirshah"
        },
        {
            "name": "Art Agrawal, Founder/CEO",
            "description": null,
            "linkedin": "https://www.linkedin.com/in/artagrawal"
        },
        {
            "name": "Lina Zhang, Founder/Vice President Operations",
            "description": null,
            "linkedin": "https://www.linkedin.com/in/lina-zhang-47324721"
        }
    ],
    "status": true,
    "generated_description": "**Jerry - Your Go-To Car Ownership Super App**\n\n**Overview:**\nJerry is a fintech company founded in 2017, located in Palo Alto, California. It's part of the Y Combinator S17 batch and has rapidly gained traction in the car ownership space, serving over 3 million users. Jerry aims to simplify the daunting world of car expenses by making it easy to save time and money, all through a single super app.\n\n**Key Services:**\n1. **Insurance Comparison**: Jerry launched as an AI-powered platform for comparing and purchasing auto insurance in 2019. Users can get personalized quotes from over 55 insurance providers in about 45 seconds, without the hassle of long forms and unwanted phone calls. On average, customers save about $800 per year on their car insurance.\n   \n2. **Auto Refinancing**: In 2022, Jerry expanded its offerings to include an auto refinancing marketplace, allowing users to lower their monthly car payments by an average of $118.\n\n3. **Telematics-Based Services**: The app also features programs like GarageGuard, which provides maintenance reminders and repair estimates, and DriveShield, which tracks driving habits and offers incentives for safe driving.\n\n**Growth and Expansion:**\nJerry is on a mission to scale its products while expanding into new categories related to car ownership, positioning itself as the only app that car owners need to manage all their related expenses. \n\n**Company Structure and Culture:**\nWith a team of around 288 employees, Jerry operates offices not just in California but also in Toronto and Lockport, NY, employing a flexible remote work policy to attract top talent. Garry Tan serves as their Group Partner, guiding the firm through its innovative journey.\n\n**Conclusion:**\nIf you're a car owner looking for a simpler way to manage your auto-related financial decisions, Jerry might just be what you're looking for. With a commitment to user convenience and value, Jerry is making car ownership easy, rewarding, and accessible for everyone.\n\nFor more information check their website: [Get Jerry](https://getjerry.com)",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/5033360233b74441dffe22db2237f75898277a8d.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191440Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=58c2b07ec253f49a818a1211ab0720534ebf03fb4c5325c625f8c4e348429536",
    "social_links": [
        "https://www.linkedin.com/company/jerryinc",
        "https://twitter.com/thejerryapp",
        "https://www.facebook.com/thejerryapp",
        "https://www.crunchbase.com/organization/jerry-3",
        "https://github.com/getjerry"
    ],
    "logo_path": "data/logos\\Jerry_logo.png"
}