{
    "links": "https://www.ycombinator.com/companies/jetdocs",
    "name": "Jetdocs",
    "headline": "Collaborative ticketing that integrates into Teams and Slack",
    "batch": "W21",
    "description": "Jetdocs is a collaborative ticketing solution that is integrated into Microsoft Teams and Slack. We allow teams to create no-code workflows that digitize your processes and connect your teams.\r\n\nWe empower IT and Ops teams with the interface, as well as the ability to build out workflows to handle internal tickets, requests and approvals. We eliminate the problems of bloated email chains, group inboxes and long messaging threads.",
    "activity_status": "Active",
    "website": "https://jetdocs.io",
    "founded_date": 2020.0,
    "team_size": 2.0,
    "location": "Toronto, Canada",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:saas; industry:b2b",
    "founders": [
        {
            "name": "Andrew Dolinski, Founder",
            "description": "Co-founder and CEO at Jetdocs. Previously Co-founder and COO at Clutch.ca, the first modern car buying solution in Canada.",
            "linkedin": "https://www.linkedin.com/in/dolinskiandrew/"
        },
        {
            "name": "Alex Kovalev, Founder",
            "description": "Co-founder and CTO at Jetdocs. Full stack web developer. Previously held positions at Ritual, Top Hat and Twitter.",
            "linkedin": "https://www.linkedin.com/in/alex-kovalev-389a7463/"
        }
    ],
    "status": true,
    "generated_description": "Jetdocs is a dynamic startup founded in 2020, right out of Y Combinator's W21 batch, and it’s gearing up to change the game for collaborative ticketing. Based in Toronto, Canada, and sporting a lean team of just two, Jetdocs is tackling the issue of chaotic communication within organizations by integrating ticketing solutions directly into Microsoft Teams and Slack.\n\nThe company's mission is crystal clear: simplify internal communications. Instead of the traditional tangled web of email threads, group inboxes, and lengthy messaging discussions, Jetdocs empowers IT and Ops teams to create no-code workflows. These workflows are designed to automate and streamline processes, allowing teams to efficiently manage internal tickets, requests, and approvals. It’s all about reducing the clutter and increasing the clarity of team interactions.\n\nJetdocs boasts several powerful features, including a smart form builder, an advanced ticketing system with customizable service level agreements (SLAs), and intelligent task distribution through custom views. By allowing teams to operate out of their existing platforms like Teams and Slack, Jetdocs ensures that organizations can maintain their workflow without disrupting their established tech stack.\n\nTheir offering is a Software-as-a-Service (SaaS) solution, and it’s already being trusted by a mix of notable clients, from Fortune 500 companies to educational institutions and non-profits. The ease of setup and versatility of features helps organizations significantly reduce their resolution times by an impressive 45-60%.\n\nIn essence, Jetdocs is here to tackle the growing need for streamlined collaboration and efficient workflows. With their no-code integration capabilities, businesses can quickly adopt Jetdocs to transform their ticketing processes without the overhead typically associated with such changes.\n\nFor more insights on how Jetdocs can redefine team collaboration, check out their website at [Jetdocs.io](https://jetdocs.io).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/594eec249ddcdf74adaf7ecc095d47dcd07d8a58.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191441Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=91c3f94108bbc589a4211b0d7ef9e40442be2213a13402ea310e0f70acda7ecf",
    "social_links": [
        "https://www.linkedin.com/company/jetdocs"
    ],
    "logo_path": "data/logos\\Jetdocs_logo.png"
}