{
    "links": "https://www.ycombinator.com/companies/joinsub",
    "name": "JoinSub",
    "headline": "India's first aggregator and provider of local business subscriptions",
    "batch": "W21",
    "description": "We, at JoinSub, are empowering the Indian small and medium retailers to drive repeat purchases & maximize their revenue by building a subscription-based model. \r\n\nIndia has over 14 million retail outlets, and we are poised to revolutionize the Retail Sector and enhance the buying experience both for retailers and consumers. We are dedicated to co-creating a community of futuristic retailers who are ready to embrace tech for growth.\r\n\nOur Subscription Programs work wonderfully for everyone who is looking to drive repurchases, right from those in the F&B industry, to Salons, Nail Salons, Spas, Gyms, Yoga & Dance Studios, Coffee Shops, Bakeries, Dry Cleaners, Florists, etc. We can help you delight your consumers and accelerate your business, the JoinSub Way!",
    "activity_status": "Active",
    "website": "https://joinsub.com",
    "founded_date": 2021.0,
    "team_size": 8.0,
    "location": "Delhi, India",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:b2b; industry:subscriptions",
    "founders": [
        {
            "name": "Dhruv Goel, Founder/CEO",
            "description": "Engineer by choice and MBA from ESADE Business School, Spain. Repeat founder working on a group buying app for digital consumer goods. Love to drive cars and travel.",
            "linkedin": "https://es.linkedin.com/in/goeldhruv90"
        }
    ],
    "status": true,
    "generated_description": "**JoinSub: Transforming Indian Retail**\n\nJoinSub, founded in 2021 and hailing from the Y Combinator W21 batch, is pioneering in creating a subscription-based model that empowers small and medium retailers across India. With the country boasting over 14 million retail outlets, JoinSub aims to revolutionize the retail sector and enhance the buying experience for both retailers and consumers.\n\n**Their Mission:** \nJoinSub is on a mission to facilitate repeat purchases and maximize revenue for local businesses. They strive to build a community of forward-thinking retailers eager to leverage technology for growth. This vision is rooted in the belief that subscriptions can not only drive profits but also deepen customer loyalty.\n\n**Who They Serve:**\nJoinSub’s subscription programs cater to a diverse array of sectors: from food and beverage establishments, salons, and spas, to gyms, yoga studios, coffee shops, bakeries, dry cleaners, and florists. Their approach is designed to delight consumers and help businesses thrive in a competitive market.\n\n**The Team:**\nBased in Delhi, JoinSub operates with a compact team of eight employees, all of whom are dedicated to bringing this innovative model to life. Their strategic partnership with Nan as their Group Partner fuels their ambition to reshape retail dynamics.\n\n**Why JoinSub?**\nThe company is uniquely positioned in the fintech B2B landscape, offering tailored subscription solutions that meet the needs of modern retailers. By embracing JoinSub, businesses can not only attract new customers but also encourage repeat visits, which is vital for growth in a fast-evolving market.\n\nIf you’re looking to explore how subscription models can drive repeat business and elevate your retail game, JoinSub is where you want to start. Check out their offerings at [joinsub.com](https://joinsub.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/db5e2e6dcf91f978460a6512324388ab355aaf87.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191442Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=6885c89e577d93234313bbfd64eb78b9d633ab35d7d4a3c65756685dbe7d8280",
    "social_links": [
        "https://in.linkedin.com/company/joinsub",
        "https://twitter.com/myjoinsub",
        "https://www.facebook.com/joinsubs"
    ],
    "logo_path": "data/logos\\JoinSub_logo.png"
}