{
    "links": "https://www.ycombinator.com/companies/juni-learning",
    "name": "Juni",
    "headline": "A learning platform helping every student achieve their best future.",
    "batch": "W18",
    "description": "Juni is a membership-driven learning platform designed to help each student discover and pursue their passions with joy. The company offers award-winning curriculums in Computer Science, Math, and English for students 7-18 taught by near-peer instructors from top universities and access to a global community. Through project-centered courses, best-in-class technology, and the power of community, Juni’s varied learning experiences prepare students for their best future.\r\n\nJuni is backed by Forerunner Ventures, Index Ventures, Y Combinator Co-founder Jessica Livingston, Arielle Zuckerberg, and more. The company is headquartered in San Francisco and was recently featured in Forbes, Fortune, WSJ, Fast Company and TechCrunch.",
    "activity_status": "Active",
    "website": "https://junilearning.com",
    "founded_date": 2017.0,
    "team_size": 30.0,
    "location": "San Francisco",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:education; industry:elearning; industry:consumer; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Vivian Shen, Founder/CEO",
            "description": "Vivian Shen holds a B.S in Computer Science from Stanford and a minor in Creative Writing. Previously, she was Director of Product at Operator, a software engineer at Google, and a consultant at McKinsey & Company’s Silicon Valley office. She is also a Bay Area native and graduated from Gunn High School in Palo Alto.",
            "linkedin": "https://www.linkedin.com/in/vivianmshen/"
        }
    ],
    "status": true,
    "generated_description": "Juni is a dynamic learning platform rooted in San Francisco, and it’s all about giving students the tools they need to discover their passions and excel academically. Founded in 2017 as part of Y Combinator’s W18 batch, Juni offers an engaging, membership-driven experience for kids aged 7-18, focusing on subjects like Computer Science, Math, and English.\n\nThe company provides a rich curriculum delivered by near-peer instructors from leading universities. This setup allows for mentorship that's both relatable and impactful, fostering a supportive community of learners. Their courses are project-centered, leveraging best-in-class technology to create a stimulating environment for students. \n\nSome standout offerings include coding courses in various languages, math tutoring tailored for different age groups, and even college prep resources, all designed to meet students at their individual levels and help them thrive. It’s not just about learning; it’s about enjoying the process, too. Juni emphasizes hands-on projects and the joy of learning, which resonates well with both students and parents.\n\nJuni has gained notable traction since its inception and has been backed by influential investors, including venture capital firms like Forerunner Ventures and Index Ventures, as well as individuals like Jessica Livingston and Arielle Zuckerberg. This backing speaks volumes about the potential seen in Juni's vision and execution.\n\nMoreover, they pride themselves on their personalized approach, matching each student to an instructor based on their learning style and goals. With a small, dedicated team of around 30 people, Juni has maintained a level of quality and focus that enhances the learning experience.\n\nRecently, their efforts haven't gone unnoticed, garnering recognition in major publications such as Forbes and TechCrunch, and receiving awards for their innovative tutoring solutions. \n\nIf you're interested in seeing what all the buzz is about, you can explore their offerings at [junilearning.com](https://junilearning.com). This platform is not just shaping learners; it's shaping the future, one student at a time.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/a3b2202ca1e017d13a78818ae3d5da7a8a570240.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191444Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=f1a12629b5eefbdad0f4f08a3052cc72ae0bedbe4df78bc259847eb0030371c6",
    "social_links": [
        "https://twitter.com/junilearning",
        "https://www.crunchbase.com/organization/juni-learning",
        "https://github.com/JuniLearning"
    ],
    "logo_path": "data/logos\\Juni_logo.png"
}