{
    "links": "https://www.ycombinator.com/companies/just-words",
    "name": "Just Words",
    "headline": "Scale hyper-personalized messaging with AI",
    "batch": "W24",
    "description": "AI-first marketing platform that puts companies in a state of continuous experimentation. We let you test 100+ variations within a month, across segments without the need to setup an 'octopus' on your favorite CRM tool. We also automate reporting which takes the grunt work of baby sitting every A/B test out of the way.",
    "activity_status": "Active",
    "website": "https://justwords.ai",
    "founded_date": 2024.0,
    "team_size": 5.0,
    "location": "San Francisco",
    "group_partner": "Michael Seibel",
    "group_partner_yc": "https://www.ycombinator.com/people/michael-seibel",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Neha Mittal, Founder",
            "description": "Neha Mittal is the CEO & Co-founder of just words. She was the head of product for Retention & Growth at Pinterest and at Twitter. She also co-founded CityStructure and was the founding engineer at Sensorflow. She has also held product & engineering roles at the Chan Zuckerberg Initiative and Goldman Sachs.",
            "linkedin": "https://linkedin.com/in/neha01mittal"
        }
    ],
    "status": true,
    "generated_description": "### Just Words: Revolutionizing Marketing with AI-Driven Hyper-Personalization\n\n**Overview:**\nJust Words, founded in 2024 and a proud member of the Y Combinator Batch W24, is an innovative marketing platform based in San Francisco. Their mission? To scale hyper-personalized messaging using AI—taking the guesswork out of marketing and streamlining communication with potential customers.\n\n**What They Do:**\nInitially positioned as an AI-first marketing platform, Just Words enables companies to embrace continuous experimentation. Their software allows businesses to test over 100 content variations in just a month, streamlining the A/B testing process without the need for convoluted integrations with existing CRM tools. With automatic reporting, they relieve marketers from the tedious task of managing tests, allowing them to focus on strategy rather than execution.\n\n**How It Works:**\nJust Words employs a mix of machine learning and data analysis to generate personalized messages tailored to individual user behaviors and preferences. By leveraging data such as purchase history and public information, they create strategic messaging that resonates with diverse customer segments, drastically reducing the time needed for traditional marketing analytics.\n\n- **Speed of Decision Making:** Transform what would typically take years of testing into just a month, enabling businesses to quickly adapt and optimize their marketing strategies.\n- **1:1 Messaging Strategies:** Instead of generic campaigns, Just Words helps organizations transition to personalized messaging, enhancing customer engagement with relevant content.\n- **Continuous Experimentation:** Their platform automatically refreshes content, meaning brands can swap out messaging based on the latest market trends without extra manual labor.\n\n**Client Success:**\nJust Words proudly counts top brands like Grammarly and BeReal among its clientele. They’ve seen significant success and measurable results—like improving BiggerPockets' paid subscription rates by more than 44% and enhancing email engagement for CitizenShipper by 22%. These case studies underscore their effectiveness and value in driving marketing performance.\n\n**Team and Leadership:**\nWith a lean but mighty team of five, Just Words is guided under Michael Seibel, a partner at Y Combinator, known for his role in nurturing startups into successful ventures. Their dedicated approach resonates in customer testimonials that rave about time savings and strategic focus thanks to the platform's capabilities.\n\n**Conclusion:**\nJust Words is not just another marketing tool; it's a game-changer in how companies view copy personalization and strategy execution. With its innovative use of AI, Just Words caters to organizations hungry for streamlined processes and robust customer engagement strategies. If you want to elevate your marketing efforts and leave mundane tasks behind, consider booking a demo with Just Words [here](https://justwords.ai/book-demo).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/0119914ea300d8ad9fc30d6c18d37515c6c3e69a.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191445Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=4ee669caac58b8eb6ccb6bb51ea67bf4a9afb24c5bec91e8a179b68ef6023d1b",
    "social_links": [
        "https://www.linkedin.com/company/justwordsai/",
        "https://twitter.com/justwordsai"
    ],
    "logo_path": "data/logos\\Just_Words_logo.png"
}