{
    "links": "https://www.ycombinator.com/companies/just-appraised",
    "name": "Just Appraised",
    "headline": "Just Appraised makes software for local governments.",
    "batch": "S17",
    "description": "Our goal is to empower local government employees with the tools, technology, and support they need so they can deliver exceptional service to their taxpayers and feel proud of the work they do for their communities. We contribute by building software to streamline local government tax assessors’ workflows using AI. Specifically, we streamline the change of ownership process for real estate and create more seamless ways for tax offices to communicate digitally with their taxpayers.  \r\n\nFor instance, when properties get bought and sold, local governments have to process reams of paper in order to update their systems and perform the analyses necessary to update the tax roll. Our software makes this process 10x faster and much more enjoyable for employees in the tax office to complete, and creates trust and goodwill in the minds of taxpayers.",
    "activity_status": "Active",
    "website": "https://www.justappraised.com",
    "founded_date": 2017.0,
    "team_size": 40.0,
    "location": "Palo Alto",
    "group_partner": "Dalton Caldwell",
    "group_partner_yc": "https://www.ycombinator.com/people/dalton-caldwell",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:saas; industry:govtech; location:san-francisco-bay-area",
    "founders": [],
    "status": true,
    "generated_description": "**Company Overview: Just Appraised**\n\n**Website**: [Just Appraised](https://www.justappraised.com)\n\nFounded in 2017 and part of Y Combinator's S17 batch, Just Appraised is a fascinating example of technology tailored for a critical public sector function. Situated in Palo Alto, California, and with a dedicated team of 40 employees, Just Appraised is on a mission to empower local governments with innovative software solutions.\n\n### Mission and Vision\n\nJust Appraised aims to streamline the complex workflows of local tax assessment offices, focusing on enhancing the experience for both government employees and taxpayers. Their vision is simple yet impactful: provide local government workers with the tools and technology necessary to deliver exceptional service. By harnessing the power of AI, Just Appraised simplifies the change of ownership process in real estate—a huge logistical challenge for many local governments.\n\n### The Problem They Solve\n\nWhen properties change hands, local governments face a daunting task: processing extensive paperwork to update tax rolls and assess property taxes accurately. This process has traditionally been labor-intensive and slow, often dragging on for months. Just Appraised tackles this head-on by cutting down the process time by a staggering tenfold, making it not only faster but also more enjoyable for the tax office employees.\n\n### Key Features\n\nTheir platform offers several critical functionalities:\n\n- **Accurate Identification**: They match transfer documents to parcels with an impressive accuracy rate of over 95%, allowing teams to quickly pinpoint properties needing closer scrutiny.\n\n- **Intelligent Data Entry**: An intuitive online dashboard brings visibility across the team regarding recently sold properties, improving both speed and accuracy in data management.\n\n- **Actionable Insights**: Using advanced algorithms, their software flags important transactions, enabling clerks and appraisers to spend less time on repetitive tasks and more on solving actual issues.\n\n### Impact So Far\n\nThe feedback from local governments has been overwhelmingly positive. One customer mentioned that they went from a six-month backlog on exemption applications to processing them just a week in advance—an extraordinary transformation that demonstrates Just Appraised's value.\n\n### In the Community\n\nBacked by notable partners and situated in the San Francisco Bay Area, Just Appraised operates in the GovTech sector, scaling its operations while making a real difference in local governance.\n\nOverall, Just Appraised is not just developing software; they’re redefining how local governments interact with their communities, fostering trust and goodwill. With a forward-thinking approach and a strong team under the guidance of their Group Partner, Dalton Caldwell, they’re making significant strides in modernizing public sector operations.\n\nIf you're looking to understand more about their offerings or explore potential partnerships, [request a demo](https://www.justappraised.com/) and see how Just Appraised can alter tax assessment workflows for the better.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/f23129831e8ab57328ea3a801cc8b4cc2f508967.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191445Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=2395dc7bc1467bee31918c89d12a312861f7e3fa72a5bc0bdc04c915c14d67b7",
    "social_links": [
        "https://www.crunchbase.com/organization/just-appraised"
    ],
    "logo_path": "data/logos\\Just_Appraised_logo.png"
}