{
    "links": "https://www.ycombinator.com/companies/jutsoo",
    "name": "Jutsoo",
    "headline": "All your corporate bank accounts connected under one platform",
    "batch": "W22",
    "description": "Jutsoo is a modern treasury management platform that helps finance teams work smarter by having efficient, reliable, real-time visibility and control over their financial data across their different banks and bank accounts.\r\n\nWe do this by unifying data from internal systems, integrating directly with banks for your money movements, and reconcile them automatically.\r\n\nMoney movements, reconciliations, cash forecasting, and identifying liquidity trends will be a breeze using us.",
    "activity_status": "Active",
    "website": "https://www.jutsoo.com/",
    "founded_date": 2021.0,
    "team_size": 12.0,
    "location": "Jakarta, Indonesia",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:finops; industry:fintech; industry:saas; industry:b2b; industry:enterprise-software",
    "founders": [
        {
            "name": "Mario Gaw, Founder",
            "description": "Mario Gaw is the co-founder and CEO of Bananas. Together with Kristian Sinaulan, he wanted to change how people do groceries in today's world where spare time is better spent on quality time with family rather than doing weekly grocery shopping. He has extensive experience in e-commerce from his days in Lazada Indonesia (Rocket Internet venture acquired by Alibaba), payments in helloPay Indonesia (merged with Alipay), and building products like Cashbac (an instant rewards loyalty mobile app).",
            "linkedin": "https://www.linkedin.com/in/mariogaw/"
        },
        {
            "name": "Kristian F H Sinaulan, Founder",
            "description": "Kristian Sinaulan is the co-founder and CTO of Bananas. Together with Mario Gaw, he wanted to change how people do groceries in today's world where spare time is better spent on quality time with family rather than doing weekly grocery shopping. He has been building teams and products in several industries ranging from Telcos, E-Commerce, Payments, Loyalty Systems.",
            "linkedin": "https://www.linkedin.com/in/kristian-frits-harris-sinaulan-04610744"
        }
    ],
    "status": true,
    "generated_description": "### Jutsoo: Simplifying Treasury Management for Corporates\n\n**Overview**  \nFounded in 2021 and part of Y Combinator's W22 batch, Jutsoo is based in Jakarta, Indonesia. With a lean team of 12, the company is on a mission: to connect all corporate bank accounts under one seamless platform. The challenge Jutsoo tackles is simple but profound—financial visibility and control across multiple banks and accounts.\n\n**What They Do**  \nJutsoo offers a modern treasury management platform aimed at helping finance teams streamline their operations. By integrating data from internal systems and connecting directly to banks, they automate money movements and reconciliations, providing real-time visibility into cash positions. This means finance teams can manage cash flow, forecast liquidity, and reduce reconciliation errors with minimal manual oversight.\n\n#### Key Features:\n1. **Global Cash Management**: Aggregates accounts for an instant view of total cash and transactions.\n2. **Automated Reconciliation**: Saves valuable hours by matching bank statements with internal records automatically.\n3. **Cash Forecasting**: Helps predict liquidity trends by analyzing historical data, allowing businesses to prepare for future cash needs.\n\n**Products**  \nJutsoo’s services cover several financial needs:\n- Invoicing\n- Payments\n- Payroll\n- Accounting\n- Spending Management\n- Financing\n- Investment Solutions\n\n**Why Choose Jutsoo?**  \n- **User-Friendly**: The platform is designed to be intuitive, ensuring teams can navigate it without hassle.\n- **Transparent Pricing**: No hidden fees and subscription plans tailored to business needs.\n- **Dedicated Team**: The founders are hands-on and committed to customer success, viewing partnerships as integral to their journey.\n\n**In the Market**  \nJutsoo isn’t just operating in a bubble. It’s gaining traction among notable clients like Halodoc and Traveloka, illustrating its effectiveness in reducing operational costs and optimizing treasury activities. \n\n**Final Thoughts**  \nIn an increasingly complex financial landscape, Jutsoo stands out by making treasury management approachable and efficient. If you’re drowning in spreadsheets or struggling with multi-bank reconciliations, it’s worth checking out their demo. Get started [here](https://www.jutsoo.com/). \n\nIn summary, Jutsoo is where smart finance teams go to manage cash like pros—efficiently, effectively, and effortlessly.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/810bd96003a827c4370b4dd621fdc90d89546142.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191445Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=68e68a43e8080c6156d029c12143468e058e71149e10958fbfc7ee42b559c0c1",
    "social_links": [],
    "logo_path": "data/logos\\Jutsoo_logo.png"
}