{
    "links": "https://www.ycombinator.com/companies/juzibot",
    "name": "JuziBot",
    "headline": "Intercom for WeChat, help companies to acquire,  engage, retainâ\u0080¦",
    "batch": "W19",
    "description": "JuziBot is a startup that provides smart marketing and sales services for customers on WeChat platform, the company helps SMBs build secure and stable key opinion customer (KOC) channels, as well as helps corporate clients with customer acquisition and sales conversion. JuziBot currently serves customers in education, insurance, healthcare, and a few other industries, some of the clients include Meituan Dianping, Digital China, Zuoyebang, etc., and 80% of these existing customers have been acquired through word of mouth. JuziBot's products have been known to improve the sales experience for one million sales professionals on a daily basis. \r\n\nThe company is invested by a number of leading VCs including PreAngel, Plug and Play, Y Combinator, TSVC, and Alpha Startups. JuziBot received the CCFA Retail Technology Rising Enterprise Award in 2018. In 2018 and 2019, respectively, the company won the 1st place in both of the task-based human-machine dialogue response naturalness, and the chat-type human-machine dialogue assessment in the SMP Chinese Human-Machine Dialogue Technology Evaluation held by the Chinese Information Processing Society of China (CIPSC).",
    "activity_status": "Active",
    "website": "https://www.juzibot.com/",
    "founded_date": 2019.0,
    "team_size": 20.0,
    "location": "Beijing, China",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:chatbot; industry:analytics; industry:customer-support",
    "founders": [
        {
            "name": "Yuan Gao, Founder",
            "description": "Yuan Gao, co-founder & CTO of BotOrange, one of the founding sponsors of Bot Friday Club. Yuan plays a very active role in the open source community, he is the core contributor of Wechaty, a chatbot SDK open source framework with close to 8,000 stars recognition on Github. Yuan is also the author of wechaty-puppet-padpro and the core contributor of wechaty-puppet-padplus. Yuan has accumulated many years of internet technology development experience.",
            "linkedin": "https://www.linkedin.com/in/yuan-gao--/"
        },
        {
            "name": "Huan Li, Founder",
            "description": "Huan Li is a serial entrepreneur with 20+ years of programming experience. Huan is a widely recognized technical leader in conversational AI and open-source cloud architectures. He co-authored the books \"Chatbot 0 to 1\" and \"Concise Handbook of TensorFlow 2\" and has been recognized by Microsoft and Google as MVP/GDE. Huan is a Chatbot Architect and speaks regularly at technical conferences worldwide. Find out more about his open-source work at https://github.com/huan/",
            "linkedin": "https://linkedin.com/in/zixia"
        },
        {
            "name": "Jiarui Li, Founder",
            "description": null,
            "linkedin": "https://www.linkedin.com/in/%E4%BD%B3%E8%8A%AE-%E6%9D%8E-710277b6/"
        }
    ],
    "status": true,
    "generated_description": "**JuziBot: Simplifying Engagement on WeChat**\n\nFounded in 2019 and based in Beijing, JuziBot is carving out an impressive niche in the marketing and sales ecosystem on WeChat. Their mission? To act as the \"Intercom for WeChat\"—helping companies with customer acquisition, engagement, and retention.\n\nInitially launched as a startup focused on marketing services, JuziBot has rapidly evolved to serve small and medium businesses (SMBs) by developing secure and effective key opinion customer (KOC) channels. This not only enhances the sales experience for their clients but also significantly boosts sales conversions. With a clientele that spans across industries like education, insurance, and healthcare, JuziBot boasts prominent names like Meituan Dianping, Digital China, and Zuoyebang. Remarkably, about 80% of their customers have come through word of mouth—a powerful testament to their service quality.\n\nJuziBot's tools are employed by around one million sales professionals daily, streamlining processes and enhancing sales efficiency. The startup's prowess hasn't gone unnoticed; they have received backing from well-known venture capitalists such as PreAngel, Plug and Play, Y Combinator, TSVC, and Alpha Startups. Their accolades include the CCFA Retail Technology Rising Enterprise Award in 2018, along with top honors in significant dialogue system evaluations by the Chinese Information Processing Society.\n\nWith a lean team of 20, JuziBot is perfectly positioned to continue making waves in the customer support and analytics space. They have a strong foothold in chatbots and possess the expertise to drive impactful conversations on one of the world's largest social platforms.\n\nTo learn more about them, you can visit their website: [JuziBot](https://www.juzibot.com/).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/8f3292c7723ce90b50f9f048e60a30052720f585.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191445Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=e0448a6271979b92f7e8d85b8669b5144cd5ef97caea3d69427448e86330843f",
    "social_links": [
        "https://www.linkedin.com/company/14510851/",
        "https://github.com/juzibot"
    ]
}