{
    "links": "https://www.ycombinator.com/companies/kairo-health",
    "name": "Kairo Health",
    "headline": "The AI healthcare workforce",
    "batch": "S24",
    "description": "Kairo Health builds AI agents that help deliver patient care at a fraction of the cost.\r\n\nThe US has a shortage of nurses, care coordinators, and administrators, all of whom spend a significant portion of their days navigating disparate software systems like their EHR and waiting on hold for hours over the phone. Organizations have little incentive to grow these teams, which leads to burnout and inefficiency.\r\n\nKairo scales this support staff by recording their actions and translating them into instructions for our agents to execute on their own. Organizations can deploy these agents for any care delivery workflow, such as calling patients to check-in on their symptoms, rescheduling a clinician’s panel in case of an emergency, and filling late cancellation slots with other patients.",
    "activity_status": "Active",
    "website": "https://trykairo.com/",
    "founded_date": 2024.0,
    "team_size": 2.0,
    "location": "New York",
    "group_partner": "Gustaf Alstromer",
    "group_partner_yc": "https://www.ycombinator.com/people/gustaf-alstromer",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:digital-health; industry:healthcare-it; industry:ai; location:new-york",
    "founders": [
        {
            "name": "Jake Goldman, Co-founder and CEO",
            "description": "Jake is co-founder and CEO of Kairo Health.\n\nPreviously, Jake was the Founding Engineer and Head of Product at Ophelia (YC W20), a digital psychiatry clinic for opioid addiction. He helped grow the organization to $XXM ARR and >150 employees. Before Ophelia, Jake was on the Founding Team of Forage (YC S21), a payments infrastructure startup for food stamps. \n\nHe studied computer science and business analytics within the M&T program at Penn and hails from Kansas City. Go Chiefs!",
            "linkedin": "https://www.linkedin.com/in/jakeyg/"
        },
        {
            "name": "Ajay Vasisht, Co-Founder and CTO",
            "description": "Ajay is co-founder and CTO of Kairo Health. \n\nPreviously, Ajay was a software engineer at Alchemy and Anduril, and product manager at DocuSign. He was on the founding team of Forage (YC S21).\n\nHe studied computer science and business at the University of Pennsylvania and Wharton School, and is originally from Princeton, New Jersey.",
            "linkedin": "https://www.linkedin.com/in/ajayvasisht"
        }
    ],
    "status": true,
    "generated_description": "Kairo Health is a promising startup born out of necessity in the evolving landscape of healthcare. Founded in 2024, this New York-based company is addressing a critical issue: the scarcity of healthcare workers, particularly nurses and care coordinators. With a mission to build an AI healthcare workforce, Kairo Health is leveraging artificial intelligence to optimize patient care delivery at a significantly reduced cost.\n\nThe healthcare industry is plagued by inefficiencies, largely due to the reliance on outdated software systems and the overwhelming burden on staff to manage patient interactions. This often leads to burnout among professionals who are stretched thin, juggling administrative tasks and patient care. Kairo Health tackles this by creating AI agents that mimic the actions of support staff, learning from their workflows. These agents can handle vital tasks like checking in with patients about symptoms, rescheduling appointments, and filling last-minute cancellations.\n\nThe company is part of Y Combinator's Batch S24, an early endorsement that speaks volumes about its potential. With a lean team of just two, Kairo is already making waves in the digital health, healthcare IT, and AI sectors. Gustaf Alstromer serves as their Group Partner, providing valuable guidance as they navigate this complex domain.\n\nKairo Health emphasizes its dedication to transforming healthcare by streamlining processes and reducing costs through automation. Their website, [trykairo.com](https://trykairo.com/), hints at an exciting future but is still under development. For now, they invite inquiries via email to learn more about their innovative solutions. If you're paying attention to the intersection of AI and healthcare, Kairo Health is definitely a company to watch.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/791582fc23081178e14f726b50817206a615094f.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191446Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=dc542467f1bf20cd8f347bed6f8d31a687338c20f04e208290a0e8c5c4a62a72",
    "social_links": [],
    "logo_path": "data/logos\\Kairo_Health_logo.png"
}