{
    "links": "https://www.ycombinator.com/companies/kamion",
    "name": "Kamion",
    "headline": "Uber for Trucks for Turkey",
    "batch": "S22",
    "description": "Turkey is MENA’s largest economy, with ~850,000 independent truckers and a logistics market of 73 Billion USD. However, in its current state, freight forwarding for trucking relies on many phone calls, emails, and f2f conversations. Trucking is also fragmented, with SME fleets having ~95% market share. \r\n\nKamion is the Uber for Trucks for Turkey. We connect businesses that are looking for trucks, with trucks that are looking for loads. We also utilize technology to do more with fewer people and collect data.",
    "activity_status": "Active",
    "website": "https://www.kamion.co",
    "founded_date": 2020.0,
    "team_size": 35.0,
    "location": "Istanbul, Turkey",
    "group_partner": "Aaron Epstein",
    "group_partner_yc": "https://www.ycombinator.com/people/aaron-epstein",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:marketplace; industry:logistics",
    "founders": [
        {
            "name": "Berkay Adlim, Founder",
            "description": "Berkay is the Founder and CEO of Kamion, the Uber for Trucks for Turkey. His background includes working in logistics from an early age to becoming a published researcher at Columbia. Berkay holds a BS in Industrial Engineering from the University of Illinois at Urbana-Champaign and an MS in Applied Analytics from Columbia University.",
            "linkedin": "https://www.linkedin.com/in/badlim/"
        }
    ],
    "status": true,
    "generated_description": "### Overview of Kamion\n\nKamion is carving out a significant niche in Turkey's logistics sector, often dubbed the \"Uber for Trucks.\" Founded in 2020 and part of Y Combinator’s Batch S22, Kamion seeks to streamline an industry ripe for innovation. With around 850,000 independent truckers and a logistics market valued at $73 billion, Turkey presents a robust opportunity for a digital freight network like Kamion.\n\n### The Problem\n\nIn the current landscape, freight forwarding in Turkey relies heavily on traditional means—numerous phone calls, emails, and face-to-face interactions. The trucking sector is highly fragmented, with small and medium enterprises (SMEs) controlling about 95% of the market share. This inefficiency hampers speed and sustainability, which is precisely where Kamion aims to make a difference.\n\n### The Solution\n\nKamion connects businesses needing trucks with carriers looking for loads, thereby providing an efficient platform for both shippers and carriers. By leveraging technology, they not only reduce the need for human interaction but also gather critical data to optimize logistics operations. Their platform champions visibility, efficiency, and sustainability—helping users minimize carbon emissions and reduce empty miles.\n\n### Team and Support\n\nBased in Istanbul, Kamion operates with a committed team of 35 employees, driving the company's mission forward. Notably, they offer 24/7 phone support with a dedicated logistics team that boasts decades of experience. Their flexible approach has garnered praise from clients such as Evyap Holding and Pepsico for professionalism and operational excellence.\n\n### Market Position and Funding\n\nKamion is well-positioned within the logistics marketplace, having secured backing from elite venture capital funds, including Y Combinator, Soma Capital, and others. This backing not only provides financial support but also lends credibility as Kamion scales its operations.\n\n### User Engagement\n\nThe platform services over 200 happy clients and continues to expand its reach. They provide services that range from spot shipments to contract freight, making it easy for shippers to manage their logistics workflows through a singular platform. Kamion advocates for a greener freight system, aiming to substantially reduce carbon footprints through advanced data analytics.\n\n### Conclusion\n\nIn summary, Kamion is not just another startup; it’s a forward-thinking solution to an outdated logistics system in one of the MENA region's largest economies. With effective technology and a focus on sustainability, they're setting a new standard for how trucking can be done in Turkey and, potentially, beyond. For businesses looking to simplify shipping, reduce operational costs, and embrace greener practices, Kamion presents a compelling option. Check out more at their [website](https://www.kamion.co).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/e995eb30177deac26453b41444c7e0931abe2c82.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191446Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=1654dbff570b40031eae34d6109f8ab377e3577a0897a5703530c3e0bac503fa",
    "social_links": [
        "https://www.linkedin.com/company/kamion/"
    ],
    "logo_path": "data/logos\\Kamion_logo.png"
}