{
    "links": "https://www.ycombinator.com/companies/kanda",
    "name": "Kanda",
    "headline": "Affirm for general contractors",
    "batch": "W21",
    "description": "Kanda is building Affirm for general contractors. We allow contractors to offer financing to homeowners who want to remodel but can’t pay the full price upfront.",
    "activity_status": "Active",
    "website": "https://www.getkanda.com/",
    "founded_date": 2018.0,
    "team_size": 8.0,
    "location": "Birmingham, United Kingdom",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:saas; industry:proptech",
    "founders": [
        {
            "name": "Phil Daneshyar, Founder",
            "description": "CEO @ Kanda - previously PM @11Health & founded @thirsti. Featured on BBC Dragons Den, spent 18 months shipping software products in healthcare.",
            "linkedin": "https://www.linkedin.com/in/phildaneshyar/"
        },
        {
            "name": "Richard Fleeman, Founder",
            "description": "Co-founder and COO at Kanda. I have vast experience in the home remodelling sector after running an electrical contracting business for 10 years. This was the driving force behind the idea for Kanda, after losing out on jobs to bigger companies that could get credit facilities for there customers that just weren't available for my own company.",
            "linkedin": "https://www.linkedin.com/in/richard-fleeman-9539b4166/"
        },
        {
            "name": "Rob Gallagher, Founder",
            "description": "Technical co-founder of Kanda. Started out as an academic, studying Theoretical and Experimental Astrophysics, first completing an MSci at the University of Nottingham, before earning my PhD at the University of Cambridge. Highly proficient in data analysis through Python, having created a bespoke data reduction and analysis pipeline during my PhD. Founded Kanda and took on the CTO role whilst writing my thesis.",
            "linkedin": "https://www.linkedin.com/in/rob-gallagher/"
        }
    ],
    "status": true,
    "generated_description": "Kanda is a UK-based fintech startup that aims to streamline financing for general contractors, empowering them to offer affordable payment plans to homeowners looking to remodel. Founded in 2018 and a product of Y Combinator's W21 batch, Kanda has quickly gained traction with its innovative approach to payment solutions. With a compact team of eight based in Birmingham, they've tailored their platform specifically for tradespeople, allowing them to secure payments efficiently while offering customers flexibility.\n\nThe core mission of Kanda is straightforward: \"Affirm for general contractors.\" They facilitate financing solutions that enable homeowners to manage their renovation costs through monthly installments rather than upfront payments. This is particularly attractive for projects that might otherwise be cost-prohibitive.\n\nKanda integrates seamlessly into contractors' workflows. By using Kanda's platform, contractors can create quotes that include financing options. Once a homeowner accepts the quote, they can apply for financing directly through Kanda, typically receiving approval in about five minutes. When the job is completed, contractors get paid promptly, reducing payment wait times from a dreary 90 days down to just 72 hours.\n\nTheir tool positions itself not only as a financial solution but as a competitive advantage for tradespeople. Kanda claims to have helped over 5,000 UK tradespeople capture more jobs and subsequently increase their revenue. They support finance options that cater to both minor and major project needs, offering zero-interest plans for smaller jobs or longer-term loans for larger renovations.\n\nKanda operates under the tags 'fintech', 'saas', and 'proptech'—a triplet that highlights their novel intersection of technology and traditional trading spaces. The platform is designed to accommodate a variety of trades, from electricians to online retailers, making it a versatile tool for a diverse marketplace.\n\nWhat sets Kanda apart is not just the speed of transactions, but also their commitment to customer satisfaction, illustrated through positive testimonials. Users note a significant increase in conversion rates after adopting Kanda’s solutions, along with enhanced customer experiences due to the available financing options.\n\nIn summary, Kanda stands at the forefront of a vital transformation in the contractor space. By enabling flexible financing and simplifying payment processes, they’re not just making renovations more accessible—they're helping tradespeople thrive in a competitive market. If you’re a contractor looking to elevate your business, Kanda might just be the tool to do it. You can check them out at [getkanda.com](https://www.getkanda.com/).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/a288ee6163e6c1d9fc925be9daa72116d88f074d.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191447Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=5a59cfb1b523f7963ce98c63bc565c96c2f4c22ee89abd0f220dc75cfd30618b",
    "social_links": [
        "https://www.linkedin.com/company/28904094/",
        "https://www.twitter.com/usekanda",
        "https://www.facebook.com/usekanda",
        "https://www.crunchbase.com/organization/kanda-742f"
    ],
    "logo_path": "data/logos\\Kanda_logo.png"
}