{
    "links": "https://www.ycombinator.com/companies/kapacity-io",
    "name": "Kapacity.io",
    "headline": "Reducing energy costs & emissions in buildings.",
    "batch": "S21",
    "description": "Kapacity.io is building the future of smart energy grids with an electricity Load Balancing service focused on buildings.",
    "activity_status": "Active",
    "website": "https://kapacity.io",
    "founded_date": 2020.0,
    "team_size": 7.0,
    "location": "Helsinki, Finland",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:real-estate; industry:climate; industry:renewable-energy",
    "founders": [
        {
            "name": "Jaakko Rauhala, Founder",
            "description": "Before starting Kapacity.io, I worked with energy markets and technologies in the Nordic countries and California. I have a background in energy engineering, but I quickly found myself shifting to the business side of the energy industry. We started Kapacity to get the most out of our abilities to combat climate change.\n\nI also did a stint at the startup conference Slush, working as the head of the largest customer segment, startup companies.",
            "linkedin": "https://www.linkedin.com/in/jaakko-rauhala/"
        },
        {
            "name": "Rami El Geneidy, Founder",
            "description": "I'm technical co-founder of Kapacity.io. I am building the next big thing for the energy and real estate sector so we all could enjoy a less hot and more sustainable future. When I am not doing that, I enjoy runs, hiking and climbing.",
            "linkedin": "https://www.linkedin.com/in/ramielgeneidy/"
        },
        {
            "name": "Sonja Salo, Founder",
            "description": null,
            "linkedin": "https://www.linkedin.com/in/sonja-salo/"
        }
    ],
    "status": true,
    "generated_description": "### Kapacity.io: Making Energy Smarter\n\n**Overview**\nFounded in 2020 and part of Y Combinator's Summer 2021 batch, Kapacity.io is based in Helsinki, Finland. With a team of just seven, they're focusing on an impressive mission: they aim to reduce energy costs and emissions in buildings through innovative technological solutions. Their main offering? A savvy electricity load balancing service designed specifically for smart energy management in residential and commercial properties.\n\n**The Mission**\nKapacity.io is committed to shaping the future of energy by making it more efficient and environmentally friendly. They specialize in smart energy grid technologies, primarily focusing on optimizing how energy is consumed in buildings. This is a smart angle in an era where renewable energy and sustainability are becoming increasingly crucial.\n\n**Key Offerings**\n1. **Smart Energy Management**: Their platform intelligently manages when and how energy is used, allowing customers to leverage the cheapest and cleanest electricity available at any given time.\n   \n2. **Temperature Control**: By utilizing weather forecasts and learning consumption patterns, the system dynamically adjusts settings to save energy without sacrificing comfort.\n\n3. **Dynamic Price Control**: This feature helps consumers avoid spikes in electricity costs by shifting their energy use to times when prices drop.\n\n4. **Easy Integration**: Kapacity.io works with a multitude of devices—no new hardware installations are necessary. Users can connect their existing heat pumps to the platform in mere minutes.\n\n5. **Flexible Pricing**: They offer various pricing tiers, including a free 30-day trial to test their services risk-free. Monthly plans start as low as 4€ for a single heat pump, scaling up for whole-home solutions.\n\n**Collaborations and Partnerships**\nKapacity.io has joined forces with EnergyHub to enhance their flexibility solutions, reaching out to a broader range of energy companies and customers. Their collaborations showcase a commitment to innovation and community in the energy sector.\n\n**Market Positioning**\nKapacity.io appeals to those interested in real estate, climate solutions, and renewable energy sectors. By aligning itself with these focus areas, it positions itself as a forward-thinking company at the forefront of the energy transition.\n\n**Why It Matters**\nIn a world increasingly affected by climate change and rising energy costs, companies like Kapacity.io are crucial. They provide not just a service, but a philosophy of energy consumption that seeks to be both economical and environmentally friendly. By advocating for smart technology in energy management, they not only empower consumers to save money but also contribute to a more sustainable future.\n\nWhether you're a homeowner looking to cut down on energy bills or a larger entity aiming to align with green energy practices, Kapacity.io presents an attractive option in the evolving landscape of energy management. To learn more, you can explore their services at [kapacity.io](https://kapacity.io).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/b9d1ca68bfa8a65bf0b5dae3002f27acbd661c78.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191447Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=9aba3c844d3f65d47ed7ccc3efb279964d33bfa7b1a457bc2a33c31077549107",
    "social_links": [
        "https://www.linkedin.com/company/kapacity-io/"
    ],
    "logo_path": "data/logos\\Kapacity.io_logo.png"
}