{
    "links": "https://www.ycombinator.com/companies/kaya",
    "name": "Kaya",
    "headline": "Marketing agency for startups: 10x cheaper, better and faster",
    "batch": "S21",
    "description": "Kaya is on a mission to help businesses achieve rapid growth through digital advertising. With our cutting-edge technology and experienced marketers, we deliver ad campaigns 10x cheaper, better and faster than traditional agencies. In less than a year, we’ve helped 120+ businesses achieve multiple fold growth on their ad campaigns, without the steep fees typically associated with high-quality marketing services.\r\n\nCheck out what some of our customers have to say here: usekaya.com/reviews",
    "activity_status": "Active",
    "website": "https://www.usekaya.com/",
    "founded_date": 2021.0,
    "team_size": 5.0,
    "location": "London, United Kingdom",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:artificial-intelligence; industry:saas; industry:b2b; industry:analytics; industry:marketing",
    "founders": [
        {
            "name": "Brian Low, Founder",
            "description": "Building @ Kaya",
            "linkedin": "https://www.linkedin.com/in/brianlowzh/"
        }
    ],
    "status": true,
    "generated_description": "### Kaya: The Startup Marketing Agency Disrupting the Landscape\n\n**Overview:**\nFounded in 2021 and part of Y Combinator's Batch S21, Kaya is a UK-based marketing agency that’s laser-focused on serving startups. They’ve rapidly made a name for themselves by offering digital advertising services that claim to be 10x cheaper, faster, and better than traditional agencies.\n\n**Mission:**\nKaya’s mission revolves around propelling businesses to rapid growth through innovative digital marketing strategies. They leverage cutting-edge technology combined with a team of seasoned marketers to craft and execute ad campaigns that deliver impactful results without the exorbitant fees typically associated with high-quality marketing services.\n\n**What They Do:**\nKaya specializes in:\n- **Ads Management:** Across platforms like Google, Meta, YouTube, LinkedIn, and TikTok.\n- **Competitor Ad Intelligence:** Providing insights on how competitors are managing their ads.\n- **Comprehensive Marketing Analytics:** Offering dashboards and alerts that provide crucial data to maximize growth and ROI.\n\nTheir emphasis on agility means they can manage campaigns end-to-end, from strategy formation to optimization, all within a two-week turnaround—a stark contrast to the months-long processes of traditional agencies.\n\n**Team and Location:**\nHailing from London, Kaya operates with a tight team of five. This lean structure allows them to remain agile and responsive, creating solutions tailored to their client's specific needs. Their group partner, Nan, adds to their collaborative strength.\n\n**Customer Success:**\nIn less than a year, Kaya has assisted over 150 businesses, effectively managing around $20 million in ad spend. Clients have celebrated their ability to achieve noteworthy results, such as:\n- **Vault:** 10x return on ad spend (ROAS) while doubling their budget.\n- **Hona Care:** A 62% increase in leads and a 64% reduction in costs within three weeks.\n\nTestimonials are abundant, with many clients praising Kaya for its speed, transparency, and effectiveness—a rare combination that provides a distinct edge in the often convoluted world of marketing.\n\n**Technology and Approach:**\nKaya prides itself on its proprietary AI technology that streamlines the ad management process, ensuring faster and smarter execution. This tech backbone allows them to discover insights promptly, adapting strategies based on real-time data to enhance performance.\n\n**Why Choose Kaya:**\nStartups benefit from Kaya's unique positioning:\n- **Cost Efficiency:** Starting as low as $3,000/month without minimum spends, it's an attractive option for lean teams.\n- **Speed:** Campaigns can be up and running in as little as two weeks.\n- **Low Risk:** With no long-term contracts, clients can explore working together without being locked in.\n- **Transparency:** Regular performance updates ensure clients are kept in the loop.\n\nIn summary, Kaya is more than just a marketing agency; it’s a growth partner for startups that want to break free from the shackles of traditional marketing methods. They bring a powerful blend of technology, expertise, and an agile approach to deliver results that are hard to argue with. If you’re looking to take your marketing to the next level without the usual headaches, Kaya might just be the solution you need. To learn more or get a free proposal, check out their website at [usekaya.com](https://www.usekaya.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/f3e2332872df5a088e9881eee5b6ce3086d022a0.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191448Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=f9f74e76ffeb347f3aee7fca7ec890d9fd0321a3ae33d71bf2f1f343d12e102c",
    "social_links": [
        "https://www.linkedin.com/company/usekaya/",
        "https://twitter.com/growwithkaya"
    ],
    "logo_path": "data/logos\\Kaya_logo.png"
}