{
    "links": "https://www.ycombinator.com/companies/kern-systems",
    "name": "Kern Systems",
    "headline": "Using DNA to store data.",
    "batch": "S19",
    "description": "DNA has emerged as a compelling data storage medium due to its density, longevity, and eternal relevance compared to current memory technologies. However, the high price of synthesizing DNA remains a major bottleneck for adoption of this promising storage solution. We are pioneering new approaches to synthesizing DNA for data storage with enzymes and custom digital codecs. We are building an interdisciplinary team to build the world's most scalable information infrastructure in DNA. \r\n\nWe seek technical experts in enzyme engineering, chemistry, hardware engineering, and information theory. We also seek business development to identify emerging markets for early use cases of our technology.",
    "activity_status": "Active",
    "website": "https://www.kernsystems.com",
    "founded_date": null,
    "team_size": 3.0,
    "location": "Boston",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:genomics; industry:nanotechnology; location:boston",
    "founders": [
        {
            "name": "Henry Lee",
            "description": "Interested in deep-tech. BS-EE@UW, PhD-BioE@BU, and Postdoc-Genetics@Harvard.",
            "linkedin": "https://www.linkedin.com/in/hhlee/"
        }
    ],
    "status": true,
    "generated_description": "### Kern Systems: Revolutionizing Data Storage with DNA\n\n**Mission:** Kern Systems aims to transform the way we think about data storage by using DNA. This isn't just about trendy buzzwords; it's about tackling real-world challenges in data management.\n\n**Why DNA?** Traditional data storage technologies are quickly reaching their limits as we generate an overwhelming amount of data—much of it unstructured and seldom accessed. DNA offers a dense, durable, and energy-efficient method for data archiving. Essentially, we're talking about using the very blueprint of life to store our digital lives.\n\n**The Challenge:** While the potential of DNA as a storage medium is immense, the high cost of synthesizing it has been a significant barrier. Kern Systems is working on pioneering enzymatic approaches and novel digital codecs to make DNA storage more accessible and scalable.\n\n**Team and Expertise:** Based in Boston and part of Y Combinator Batch S19, Kern Systems is a nimble team of three. They are actively building a multidisciplinary group that includes experts in enzyme engineering, chemistry, hardware, and information theory. They are also looking for business development professionals to carve out initial markets for their innovative technology.\n\n**Founders:** \n- **Pradeep Bugga, PhD** - CEO with a robust background in organic chemistry and molecular biology.\n- **George M. Church, PhD** - Co-Founder and Professor at Harvard/MIT, an authoritative figure in DNA sequencing and synthetic biology.\n- **Henry H. Lee, PhD** - Co-Founder and leading expert in systems biology and enzymatic DNA synthesis.\n\n**What They’re Building:** Kern Systems is crafting a cold data storage platform that promises to store more data at a lower cost and with greater longevity than existing solutions. Imagine a hard drive constructed from molecules—this is the future Kern is working towards.\n\n**Current Endeavors:** They've joined the DNA Data Storage Alliance, signaling their commitment to collaboration in this emergent field. Their foundational research has already garnered attention and posits them as serious players in the data storage revolution.\n\nFor more information or to get involved, you can visit their [website](https://www.kernsystems.com) or reach out directly at info@kernsystems.io.\n\n**Location:** 127 Western Ave, Allston, MA 02134\n\n### Summary\nKern Systems is bridging the gap between cutting-edge science and practical data storage solutions. Their vision is ambitious but grounded in a pressing need for innovation in how we store information. With a compact, expert team and strong backing from academic leaders, they are well-positioned to redefine the future of data management.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/c9969747dd3d1b92dc92643d947c282fc0b60aa4.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191449Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=6bc49459737a84281d803a3793fc1e6b97451a3b7c7eee2f5a3a6860d74440d7",
    "social_links": [],
    "logo_path": "data/logos\\Kern_Systems_logo.png"
}