{
    "links": "https://www.ycombinator.com/companies/key-values",
    "name": "Key Values",
    "headline": "Helping software developers find teams that share their values.",
    "batch": "W18",
    "description": null,
    "activity_status": "Active",
    "website": "https://www.keyvalues.com",
    "founded_date": null,
    "team_size": 1.0,
    "location": null,
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:recruiting; industry:careers",
    "founders": [],
    "status": true,
    "generated_description": "### Key Values: Matching Engineers with Aligned Teams\n\n**Website:** [keyvalues.com](https://www.keyvalues.com)\n\n**Mission:** Key Values aims to bridge the gap between software developers and engineering teams that share their core values. Essentially, it's about helping developers find the right cultural fit, making those workplace connections more meaningful.\n\n**Founding & Background:** Key Values is part of the esteemed Y Combinator Batch W18. While the company isn’t divulging details like a founding date or specific location, the emphasis is clearly on nurturing strong cultural foundations within teams.\n\n**Team Composition:** The company operates with a lean structure, having just one employee. This suggests a highly focused approach, where resources are likely allocated towards maximizing impact rather than expanding workforce size.\n\n**Categorization:** It fits neatly into the domains of **recruiting** and **careers**, aligning with its goal of connecting like-minded professionals.\n\n### What Key Values Offers:\n\n- **Value-Centric Matching:** Developers can select their preferred values—like \"Team is Diverse,\" \"Open Communication,\" or \"Creative + Innovative\"—to discover teams that resonate with them. This approach fosters workplaces where shared values can lead to more robust collaboration.\n  \n- **Cultural Insights:** Key Values delves deep into company cultures, cross-examining aspects such as:\n  - **Daily Routines:** Eating lunch together, flexible work arrangements, and light meeting schedules.\n  - **Engineering Standards:** Rigor in code quality, pair programming, and the use of agile methodologies.\n  - **Growth Opportunities:** Internal promotions, support for junior developers, and a strong mentorship ethos.\n\n### Operating Principles:\n\n1. **Engagement with the Community:** Firms listed are committed to community interaction.\n2. **Inclusivity:** A common thread is the emphasis on building diverse teams.\n3. **Employee Wellness:** Key Values highlights companies that are supportive of work/life balance and physical wellness.\n4. **Feedback Culture:** Continuous and constructive feedback mechanisms appear to be a priority.\n\n### Growth Outlook:\n\n- The team is anticipating rapid expansion, expecting to hire at least five more engineers over the next six months. This is a testament to their commitment to growth while maintaining a culture of shared values.\n\n### Business Model:\n\nKey Values operates on a self-funded model, emphasizing profits over external investments. This sustainable approach allows them to prioritize their mission without compromising on their values or becoming beholden to outside pressures.\n\n### Conclusion:\n\nIn the landscape of tech recruitment, Key Values stands out by not only focusing on the job criteria but elevating the conversation to what truly matters: cultural alignment. For developers looking for their next role, this represents an invaluable resource. It’s about finding a workplace where they can thrive—not just as coders, but as integral parts of a team that shares their ethos.\n\nIf you’re eager to explore opportunities with companies that align with your values, Key Values could be your compass in navigating through the myriad of tech job options.",
    "logo": "/logos/medium/missing.png",
    "social_links": [
        "https://www.crunchbase.com/organization/key-values"
    ]
}