{
    "links": "https://www.ycombinator.com/companies/keylika",
    "name": "Keylika",
    "headline": "Redefining the Standard of Care for Iron Deficiency Anemia",
    "batch": "S22",
    "description": "Keylika is an early stage biopharma startup developing metal-based drugs using a platform synthesis technology to treat unmet medical needs. We then administer these drugs using proven delivery technologies to effect the best clinical outcomes. \r\n\nOur first product is a small molecule iron drug (new molecular entity) delivered by a wearable skin patch to treat Iron Deficiency Anemia (IDA), with significantly higher safety, efficacy and tolerability over existing treatments. This is poised to be a best-in-class, potentially breakthrough therapy for treating iron deficiency without any GI side-effects (eg. nausea, constipation, diarrhea, etc.) typically associated with oral iron supplements, and without the risks, costs and side-effects associated with IV iron infusions. When approved, Keylika’s proprietary transdermal iron will be the world's first prescription iron patch. Iron deficiency is a hugely understated problem affecting about 1.6 billion people worldwide and more than 30 million in the US alone, translating to a $17B US market.",
    "activity_status": "Active",
    "website": "https://www.keylika.com",
    "founded_date": 2022.0,
    "team_size": 1.0,
    "location": "Walnut Creek, CA",
    "group_partner": "Jared Friedman",
    "group_partner_yc": "https://www.ycombinator.com/people/jared-friedman",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:ai-powered-drug-discovery; industry:medical-devices; industry:drug-delivery; industry:nanotechnology; industry:therapeutics; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Buddha Chaudhuri, Founder",
            "description": "Buddha spearheaded the technology development of a microneedle-based biosensor from lab-to-fab for a Series B stage medtech startup. Having worked across 3 continents and 6 countries, he has been instrumental in developing novel healthcare technologies in leading global research institutes and biotech companies, for the last 15 years. \n\nBuddha earned his PhD from Imec / KU Leuven in Belgium, in Drug Delivery Microsystems. He also pursued a Postdoc at UC San Francisco (UCSF) / UC Berkeley.",
            "linkedin": "https://www.linkedin.com/in/buddhadevpc"
        },
        {
            "name": "Frederik Ceyssens, Founder",
            "description": "With a deep passion for diverse technologies, Frederik is truly a multi-domain expert. From tiny moving machines to nuclear space rockets, and electrical circuits to medical devices – Frederik has pursued an illustrious scientific career over the last 15 years developing key microtechnologies for lifescience applications. He also founded a venture-backed neurotech startup to cure blindness. \n\nFrederik holds a PhD and a Masters from KU Leuven, Belgium. He also pursued Bachelors of Medicine.",
            "linkedin": "http://linkedin.com/in/frederik-ceyssens-43b6ab5"
        }
    ],
    "status": true,
    "generated_description": "### Keylika: Redefining Iron Deficiency Anemia Care\n\n**Company Overview**  \nFounded in 2022, Keylika is a burgeoning biopharma startup based in Walnut Creek, California. As part of the Y Combinator Batch S22, the company's mission zeroes in on revolutionizing treatment for iron deficiency anemia (IDA) through innovative metal-based drugs and advanced delivery technologies.\n\n**Innovative Approach**  \nKeylika has developed a groundbreaking small molecule iron drug, now formatted as a wearable skin patch, aimed at treating IDA with far greater safety and tolerability compared to existing therapies. This skin patch—the world's first prescription iron patch—delivers iron directly into the bloodstream, steering clear of the gastrointestinal distress often associated with oral supplements, like nausea or constipation. \n\n**Market Need**  \nIron deficiency is a serious, yet frequently understated condition, impacting around 1.6 billion people globally and over 30 million in the United States alone. Current treatments, such as oral iron supplements, have limited efficacy and poor patient compliance due to their side effects. Intravenous iron infusions might be effective but come with their own risks and costs. Keylika is poised to fill this gap with its proprietary transdermal iron solution, NistuFe, combining the convenience of oral intake with the effective delivery found in IV treatments, minus the downsides.\n\n**Technology Backbone**  \nAt the heart of Keylika’s technology is a platform synthesis that allows the creation of metal-based drugs optimized for various therapeutic needs. This innovative method not only enhances drug absorption but also reduces systemic toxicity, providing clinicians and patients a much-needed advancement in IDA treatment.\n\n**Leadership**  \nThe venture is helmed by co-founders Buddhadev P. Chaudhuri and Frederik Ceyssens, both of whom bring extensive expertise in material science, microtechnology, and drug delivery. With a combined 30+ years in research and development, they are committed to ushering in a new era of treatment for iron deficiency.\n\n**Current Status**  \nAs of now, Keylika operates with a small team, pointing to the agility and focused approach of a startup. Their ongoing work positions them at the closest intersection of medical innovation and practical healthcare delivery, a promising indicator of disruption in a stagnant market.\n\nIn summary, Keylika isn't just developing drugs; they're reshaping patient care for millions who silently suffer from iron deficiency anemia. Their innovative, patient-centered solution stands poised to make a significant impact on public health. For more details, visit [Keylika's website](https://www.keylika.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/55c0c5d184be8a93cc6d770768b28cb0d6d8a65d.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191450Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=bdf319579dfc853a928f6707d9e3bd2d6778ca46f1804c3b6e2c4ddee1f6ec8b",
    "social_links": [
        "https://www.linkedin.com/company/keylika/",
        "https://twitter.com/keylika_inc"
    ],
    "logo_path": "data/logos\\Keylika_logo.png"
}