{
    "links": "https://www.ycombinator.com/companies/keynua",
    "name": "Keynua",
    "headline": "E-signatures with identity verification for Latin America",
    "batch": "W19",
    "description": "Keynua is an E-sign platform that uses short video signatures which serve both to approve specific documents and provide the visual identity of the signatory, which is then confirmed using official records and social network profiles. All transactions are \"notarized\" on the Blockchain. Keynua stores encrypted versions of the identities of all signatories so that users may reuse them with other companies affiliated to the Keynua platform.",
    "activity_status": "Active",
    "website": "https://www.keynua.com",
    "founded_date": 2019.0,
    "team_size": 15.0,
    "location": "Lima, Peru",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:legaltech",
    "founders": [
        {
            "name": "Alfredo Granda, Founder",
            "description": "Founder and CTO with experience creating software products and expanding them throughout Latin America to millions of users. Designed and implemented the Cinepapaya platform which eventually was acquired in 2016 by NBC Universal through its Fandango Media LLC division. Then i became the VP of IT for Fandango Latam until i left the company to start Keynua.",
            "linkedin": "https://www.linkedin.com/in/alfredo-granda-02a95992/"
        },
        {
            "name": "Manuel Olguin, Founder",
            "description": "Founder and CEO with experience developing digital products and expanding them throughout Latin America. Co-founded Cinepapaya in 2012 and led its growth for 4 years, taking it to 12 countries and 80% of all movie theaters in the region. The company was acquired in 2016 by NBC Universal through its Fandango Media LLC division.",
            "linkedin": "https://www.linkedin.com/in/manuel-olguin-82a352/"
        },
        {
            "name": "Luis Alban, Founder",
            "description": null,
            "linkedin": "https://www.linkedin.com/in/luis-alban-90a09ab6"
        },
        {
            "name": "Inma Canadas, Founder",
            "description": null,
            "linkedin": null
        }
    ],
    "status": true,
    "generated_description": "**Keynua**: Revolutionizing E-Signatures in Latin America\n\nKeynua is a pioneering legal tech startup based in Lima, Peru, dedicated to providing e-signature solutions complemented by robust identity verification systems tailored for the Latin American market. Founded in 2019 and part of Y Combinator Batch W19, the company is on a mission to streamline the signing process while ensuring security and authenticity.\n\n### What They Do\nKeynua’s innovative platform goes beyond conventional e-signatures by incorporating short video signatures. This unique approach not only authenticates document approvals but also visually confirms the identity of the signatory using official documents and social media profiles. All transactions are securely \"notarized\" on a blockchain, ensuring transparency and immutability.\n\nAdditionally, Keynua securely stores encrypted versions of user identities, enabling signatories to reuse their credentials when interacting with other companies within the Keynua ecosystem.\n\n### Product Offerings\nKeynua provides a range of signature options to meet diverse customer needs:\n- **Video Signatures**\n- **Drawn Signatures**\n- **One-Time Password (OTP) Signatures**\n- **Digital Signatures**\n\nIdentity verification is also a strong focus, featuring:\n- **3D Identification**\n- **Selfie Verification**\n- **Video Verification**\n\nTheir solutions cater to various sectors, including finance, real estate, human resources, and commercial contracts.\n\n### The Team\nWith a compact team of 15, Keynua is nimble and focused, harnessing their collective expertise to push boundaries in legal tech. They partner with notable organizations, striving for excellence and radical innovation within the document signing and verification landscape.\n\n### Why It Matters\nKeynua is not just another tech solution; it embodies a crucial advancement in how businesses in Latin America can adopt digital transformation safely and efficiently. In a region where trust and security in transactions are paramount, Keynua’s approach enhances user confidence, potentially leading to increased conversion rates and smoother operations.\n\n### Contact and Next Steps\nIf you’re intrigued by what Keynua offers, you can explore their solutions further on their [website](https://www.keynua.com). They invite users to experience the platform with a free demo and provide support to anyone ready to join the e-signature revolution.\n\nIn summary, Keynua represents the intersection of technology and trust in Latin America, promising to redefine how industries interact and transact digitally.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/4a01aa2d1a86f413397e1a991c8773e6ce4533ac.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191450Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=7e430959a8f12c8ef00bd796c155748f7cf226b3efbf741df30c32c7e14895c9",
    "social_links": [
        "https://www.linkedin.com/company/keynua/",
        "https://twitter.com/keynuainc",
        "https://www.facebook.com/keynuainc",
        "https://www.crunchbase.com/organization/keynua"
    ],
    "logo_path": "data/logos\\Keynua_logo.png"
}