{
    "links": "https://www.ycombinator.com/companies/kickup",
    "name": "KickUp",
    "headline": null,
    "batch": "IK12",
    "description": "KickUp partners with K-12 organizations to coordinate professional learning efforts, improve decision-making and ensure that great ideas translate into demonstrable outcomes in the classroom.\n\n“The great thing about KickUp is they brought credibility to the professional development work we are doing. It’s challenging to be a ‘prophet in our own land’, but having KickUp’s professional reports presented in clear and compelling ways instantly became a communication tool between our entire curriculum department, the district cabinet, and the school board. I was able to use the resources KickUp created for a board report and now the district is interested in seeing how all of the other departments can benefit from their services. We are in need of someone who can take that step back and see the big picture of what we are trying to accomplish with professional development, effective student learning, and assessment and tie it all together for us in ways that make sense. KickUp has become the connector between departments, helping to lead us all in our common goal, to improve learning for our students.",
    "activity_status": "Active",
    "website": "http://www.kickup.co",
    "founded_date": null,
    "team_size": 9.0,
    "location": "Philadelphia, PA",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": null,
    "founders": [],
    "status": true,
    "generated_description": "KickUp is a Philly-based education tech company that's making waves by streamlining professional development for K-12 organizations. While much of their mission details remain under wraps, their initial premise is clear: they're all about improving professional learning efforts in education. Their approach focuses on harnessing data and insights to drive real outcomes in the classroom, helping educators enhance their skills and effectiveness.\n\nWhat sets KickUp apart? The testimonials say it all. Educators have highlighted how useful KickUp’s professional reports are for communicating critical information across various departmental levels—from curriculum teams to district cabinets and even school boards. This kind of clear communication is crucial when you’re trying to align everyone towards a common goal of boosting student learning.\n\nFounded as part of Y Combinator's Batch IK12, KickUp has a small but mighty team of nine. They’re based in Philadelphia, a city with a rich educational landscape. Their offerings are tailored to the needs of schools, featuring three distinct products:\n\n1. **KickUp Foundations**: This tool bridges data from various professional learning activities—like coaching cycles and learning walks—into a single hub, providing educators with insights to improve their practice.\n\n2. **KickUp Learning**: It connects all forms of professional development, both online and offline, allowing for a consolidated view of educator engagement and effectiveness.\n\n3. **KickUp Growth**: Here, performance evaluations shift from merely a compliance-driven process to a growth-centric one, promoting continuous improvement among educators.\n\nThey work closely with assistant superintendents, directors of professional development, and district leaders, illustrating KickUp’s role as a vital connector within educational institutions. Their platform focuses on data-rich experiences that help make professional learning management straightforward and effective.\n\nFurther fun facts about KickUp: they’re proud to partner with various school districts, showing a steady uptick in interest as more departments recognize the value of their services.\n\nFor those interested in experiencing what KickUp can do for their district, scheduling a demo is just a click away, making it easy to see their tools in action.\n\nWebsite: [KickUp](http://www.kickup.co)\n\nIn short, KickUp is on a mission to turn the often-overlooked professional development in education into a streamlined, impactful process—helping to create great teachers and, ultimately, better student outcomes. If that sounds like something your district could use, you might want to take them for a spin!",
    "logo": "/logos/medium/missing.png",
    "social_links": [
        "https://www.crunchbase.com/organization/kickup"
    ]
}