{
    "links": "https://www.ycombinator.com/companies/kidato",
    "name": "Kidato",
    "headline": "Online school for K12 education in Africa",
    "batch": "W21",
    "description": "Parents in Africa face either public schools with student-teacher ratios as high as 50:1 or private schools with tuition fees as high as $7500 per year, per child. Kidato classes have student-teacher ratios of 5:1 and teach the same rigorous international curriculum as other private schools — but at a fraction of the price. In our second semester, Kidato has enrolled more than 30 students into our learning-from-home program as a replacement for brick-and-mortar schools. We expect to triple this enrollment by our third semester.",
    "activity_status": "Active",
    "website": "https://www.kidato.co",
    "founded_date": 2020.0,
    "team_size": 15.0,
    "location": "Nairobi, Kenya",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:education; industry:elearning",
    "founders": [
        {
            "name": "Sam Gichuru, Founder",
            "description": "Education is extremely disjointed and expensive in Africa, I see an opportunity to change that, by streamlining it and making it affordable.\n\nSoftware engineer, previously founded Nailab, the first Kenyan incubator, and accelerator, co-founded Kuhustle (YC-F3), an African freelance platform, supported over 120 startups in 10 years, 3 exists, worked with Jack Ma / Jack Ma Foundation to structure $10M funding for African SMB's, grew to $100M commitment.",
            "linkedin": "https://www.linkedin.com/in/samgichuru"
        }
    ],
    "status": true,
    "generated_description": "**Kidato: Transforming K-12 Education in Africa**\n\nFounded in 2020 and hailing from Nairobi, Kenya, Kidato is on a mission to innovate the educational landscape in Africa. With a clear focus on K-12 education, Kidato offers a compelling alternative to the public and private school options available to parents. The stark reality they address is a troublingly high student-teacher ratio of 50:1 in public schools and exorbitant tuition fees in private institutions that can soar up to $7,500 per year per child.\n\nWhat makes Kidato stand out? They maintain an impressive student-teacher ratio of 5:1, ensuring that each child receives personalized attention and support. Their educational model is built around delivering a rigorous international curriculum that parallels that of established private schools but comes at a fraction of the cost. This approach is designed to make quality education accessible, even in regions where affordability is a significant barrier.\n\nSince launching their learning-from-home program, Kidato has seen encouraging momentum, enrolling over 30 students in their second semester alone. The future looks bright, as they anticipate tripling that number by their upcoming semester.\n\nAs part of the Y Combinator Batch W21, Kidato is positioned within an influential network of innovators. Their team of 15 dedicated employees is set on making significant strides in the ed-tech space, leveraging technology to bridge educational gaps.\n\nWith a focus on education and eLearning, Kidato is not just a startup; it’s a pivotal player in redefining how children in Africa can access quality education. For more information on their offerings, you can visit their website at [Kidato.co](https://www.kidato.co). \n\nIn a landscape where high-quality education often feels out of reach for many families, Kidato is making strides to change that narrative—one student at a time.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/f259f073e49a6df9b1eb248ec17e434557c0f311.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191452Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=b47f0a41f65d9b3f65b756080ffca3d835c3c9e5e6d88b66f282b8eac513d41b",
    "social_links": [
        "https://twitter.com/kidatorian",
        "https://www.facebook.com/kidatorian"
    ],
    "logo_path": "data/logos\\Kidato_logo.png"
}