{
    "links": "https://www.ycombinator.com/companies/kingdom-supercultures",
    "name": "Kingdom Supercultures",
    "headline": "New foods with microbes",
    "batch": "S20",
    "description": "Kingdom Supercultures designs novel microbial cultures that make it easy for food manufacturers to create exciting new foods.  We've developed the world's first 0-calorie fermented sodas, beers with entirely new flavors, and novel plant-based dairy replacements.",
    "activity_status": "Active",
    "website": "https://kingdomsupercultures.com",
    "founded_date": 2019.0,
    "team_size": 8.0,
    "location": "New York",
    "group_partner": "Michael Seibel",
    "group_partner_yc": "https://www.ycombinator.com/people/michael-seibel",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:food-tech; location:new-york",
    "founders": [
        {
            "name": "Kendall Dabaghi, Founder",
            "description": "I'm a co-founder of Kingdom Supercultures.  Previously, I co-founded two consumer tech startups that were acquired by public companies (ArmorHub in 2014 and A Plus in 2016).  In my life I've dealt with a set of health issues related to my microbiome, and returned to Columbia in 2016 to develop expertise as a microbiome/machine learning researcher.  I deferred my PhD at MIT to co-found Kingdom in 2019.",
            "linkedin": "https://www.linkedin.com/in/kendalldabaghi/"
        },
        {
            "name": "Ravi Sheth, Founder",
            "description": "I'm a co-founder of Kingdom Supercultures. I received my PhD from Columbia supported by Hertz and NSF fellowships, and published 8+ first author papers in the microbiome and genomics fields (Science, Nature Biotech, Nature Methods, and more). I also spent time at the Bill & Melinda Gates foundation working on childhood malnutrition, and co-founded a edtech company in college (STEAMtrax) that was acquired by a public company.",
            "linkedin": "https://www.linkedin.com/in/ravisheth/"
        }
    ],
    "status": true,
    "generated_description": "Kingdom Supercultures is a forward-thinking company in the food-tech space that has been shaking things up since its inception in 2019. Located in New York and part of the Y Combinator Batch S20, they’ve made it their mission to revolutionize food using the power of microbes. You might ask yourself, \"Microbes? Really?\" Well, they’re not just any microbes—they’re novel microbial cultures that help food manufacturers craft innovative edible creations.\n\nTheir offerings include the world’s first 0-calorie fermented sodas, unique beers bursting with new flavors, and plant-based dairy alternatives. Kingdom Supercultures specializes in what they call Superculture® ingredients—an exciting new class of ingredients designed to harness natural microbes. This range is especially aimed at enhancing the food experience for companion animals, delivering functional benefits through live cultures or fermentates.\n\nNow, how does all this out-of-the-box innovation come to life? It starts with isolating tens of thousands of unique natural strains from food. With advanced automation and analytical techniques, they reassemble these microbes into Superculture blends that pack functionalities unlike anything currently available on the market. This means businesses can create next-gen products, such as lower-alcohol but full-flavor wines and yogurts that mimic the creaminess of dairy.\n\nSo far, they’ve made impressive strides, raising $25 million in Series A funding to expand their suite of non-GMO microbes and partnering with high-profile eateries like Eleven Madison Park for their plant-based menu. With a small but dedicated team of eight, including Group Partner Michael Seibel from Y Combinator, Kingdom Supercultures is set up for significant growth in an ever-evolving food landscape.\n\nIf you’re intrigued by the intersection of food and technology—or simply want to reach a new level of taste—check them out at [Kingdom Supercultures](https://kingdomsupercultures.com) and explore how their unique microbial innovations can elevate your food experiences.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/7dc9ede0d0b8d269470f47f13bd4ee884e90928b.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191451Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=bc30a170a8699306f236305d86ed740e1665aebee0634587f45c2225d916d203",
    "social_links": [],
    "logo_path": "data/logos\\Kingdom_Supercultures_logo.png"
}