{
    "links": "https://www.ycombinator.com/companies/kodable-education",
    "name": "Kodable Education",
    "headline": "Kodable Education teaches kids how to code before they can read.",
    "batch": "IK12",
    "description": "Kodable Education was founded to fill a gap in education currently affecting over 250 million kids around the world.  Our mission is to help prepare kids for success in the 21st century by making programming education accessible to everyone.\r\n\nWe make awesome games that not only teach kids about programming, but help develop soft skills like grit, perseverance, and problem solving. Kids journey through the Smeeborgian Universe with a family of furry aliens and learn about programming logic, JavaScript, and game design. Kodable also includes a curriculum for elementary school teachers so they can feel confident teaching along side the game. \r\n\nKodable is already used in over 50% of US schools, and in over 190 countries. Help us continue our mission and expose millions more kids to the wonderful world of computer science!",
    "activity_status": "Active",
    "website": "https://www.kodable.com",
    "founded_date": 2013.0,
    "team_size": 17.0,
    "location": "San Diego, CA",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:education; industry:gaming",
    "founders": [
        {
            "name": "Jon Mattingly, Founder/CEO",
            "description": null,
            "linkedin": "https://www.linkedin.com/in/jonmattingly/"
        },
        {
            "name": "Grechen Schumacher",
            "description": "I'm great at understanding users, early product design, and I enjoy solving problems for people. I'm currently interested in solving problems for women, families, small businesses, and the environment.",
            "linkedin": "https://www.linkedin.com/in/grechen-huebner/"
        }
    ],
    "status": true,
    "generated_description": "**Kodable Education Overview**\n\nFounded in 2013 and based in San Diego, California, Kodable Education is on a mission to fill the significant gap in coding education for kids globally—currently impacting over 250 million children. Their mantra? Teach kids to code before they can read. This pitch isn't just noble; it's practical. In an increasingly tech-driven world, early exposure to programming equips children with essential skills to thrive in the 21st century.\n\n**What They Do:**\n\nKodable crafts engaging educational games designed for children, leveraging an interactive universe populated by quirky extraterrestrials called Smeeborgs. Through play, kids learn coding fundamentals, problem-solving techniques, and important soft skills like grit and perseverance. The platform embraces concepts ranging from programming logic to JavaScript and game design—all wrapped in a fun package that's used in over 50% of schools across the U.S. and in more than 190 countries.\n\nFor educators, Kodable offers a comprehensive curriculum that empowers teachers with the resources they need to facilitate coding education alongside these games. This level of integration makes it a favorite among both students and teachers.\n\n**Current Endeavors:**\nKodable is actively promoting their “Hour of Code” activities, providing opportunities for kids to create and code their own games. The games cater to various grades, starting from kindergarten (K+) all the way up to grade three (3+), showcasing that coding and play can go hand in hand.\n\n**Why It Matters:**\nKodable believes that the future will be shaped by those who can code. By making this complex field approachable and fun for the youngest learners, they're not just teaching kids to code—they're fostering a generation of problem solvers and creative thinkers.\n\nWith a team of 17 and the backing of Y Combinator's IK12 batch, Kodable is positioned as a key player in educational technology, championing coding as a fundamental skill for kids worldwide. \n\nFor more information, check out their website: [Kodable](https://www.kodable.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/d1d50c4c5923952570320ab3539a9f083a0f3bef.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191454Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=34f378b370531973a4d83cb70091838f2310808cfef791ca872f0bde50fa4557",
    "social_links": [
        "https://www.linkedin.com/company/kodable/",
        "https://www.twitter.com/kodable",
        "https://www.facebook.com/kodable",
        "https://www.crunchbase.com/organization/kodable"
    ],
    "logo_path": "data/logos\\Kodable_Education_logo.png"
}