{
    "links": "https://www.ycombinator.com/companies/kopra-bio",
    "name": "Kopra Bio",
    "headline": "Genetically engineered viruses that teach your immune system to killâ\u0080¦",
    "batch": "S24",
    "description": "Kopra Bio makes genetically engineered viruses that teach your immune system to kill cancer using tech we developed at UCSF. Weâ\u0080\u0099re making the next Keytruda ($25B/yr cancer drug blockbuster) starting with the most aggressive form of brain cancer, glioblastoma. In the most challenging brain cancer model, we improve survival from 0% with the current FDA approved treatment to 90% with our treatment.",
    "activity_status": "Active",
    "website": "https://kopra.bio",
    "founded_date": 2024.0,
    "team_size": 2.0,
    "location": "San Francisco",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:gene-therapy; industry:synthetic-biology; industry:biotech; industry:therapeutics; industry:oncology; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Andrew Bartynski, Founder",
            "description": "Serial Biotech Entrepreneur and repeat YC founder. Built medical devices as CEO @ AesculaTech (YC W18). Developed the contraceptive pill for men as COO @ YourChoice Therapeutics (YC W19). Founded a COVID antiviral company that went from founding to Phase II/III clinical trial in 6 months and was acquired by a publicly traded biotech in less than a year as COO @ ANA Therapeutics. Made next generation Psychedelics for mental health @ ASRI. Now curing cancer @ Kopra Bio",
            "linkedin": "https://www.linkedin.com/in/andrewbartynski/"
        },
        {
            "name": "Alexander Haddad, Founder",
            "description": "Neurosurgery resident @ UCSF, scientific co-founder @ Kopra Bio. Published over 70 peer-reviewed publications as a neurosurgery resident at UCSF. Alex is particularly interested in the delivery of cell and gene therapies to the central nervous system and neuro-oncology. Kopra Bio is a serial biotech entrepreneur and a UCSF Neurosurgery resident on a mission to revolutionize cancer treatment.",
            "linkedin": "www.linkedin.com/in/alexander-haddad-49b484305"
        }
    ],
    "status": true,
    "generated_description": "Kopra Bio is a captivating biotech startup based in San Francisco that is diving headfirst into the realm of cancer treatment. Founded in 2024 and part of Y Combinator’s S24 batch, their mission is bold yet clear: to harness genetically engineered viruses to teach the immune system to target and obliterate cancer cells.\n\nStarting with glioblastoma, one of the most aggressive forms of brain cancer, Kopra Bio aims to disrupt the current treatment landscape. They’ve developed a technology that dramatically improves survival rates—taking them from a dismal 0% with existing FDA-approved treatments to an impressive 90% with their innovative approach. This level of transformation mirrors what drugs like Keytruda have achieved, which have generated a staggering $25 billion a year.\n\nThe company operates with a lean team of two, demonstrating the belief that great innovation doesn’t always need a large workforce. They are at the intersection of gene therapy, synthetic biology, and oncology, and they’re tagged as disruptors in these fields as well as therapeutics and biotech.\n\nIn their own words, Kopra Bio describes its work as “cancer immunotherapy that turns cancer cells into biofactories minting their own destruction.” This encapsulates their strategy of utilizing the cancer itself as a weapon against the disease.\n\nIf you’re curious to know more or want to reach out, their website is [kopra.bio](https://kopra.bio). Here’s a company that is not just aiming for the next big thing in medicine, but potentially rewriting how we approach cancer treatment altogether. Keep an eye on this one—great things could be on the horizon.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/66e7fda2357e164bfab35afb682b5ef1c95a9d08.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191454Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=2a8dfbdb3968cf367725e02b336e6e40bdc99f8ae0a5f1d08cabe057d6e5c569",
    "social_links": [
        "https://www.linkedin.com/company/kopra-bio"
    ],
    "logo_path": "data/logos\\Kopra_Bio_logo.png"
}