{
    "links": "https://www.ycombinator.com/companies/kubesail",
    "name": "KubeSail",
    "headline": "The Self-Hosting Company",
    "batch": "S19",
    "description": "KubeSail is the home hosting company.\r\n\nWe make it easy to take back your privacy, fix the internet, and de-google all at once: host apps at home!\r\n\nPlug in a spare PC or buy our custom home-hosting hardware https://pibox.io, install apps like PhotoPrism, NocoDB, and Minecraft, and enjoy complete ownership of your data. We build everything you need to make hosting at home viable and fun.\r\n\nFor companies, we make it easy to deploy software on-demand for your customers (either in the cloud, or by physically shipping them pre-configured hardware) to your users. Companies like ChatWoot use KubeSail Platform to deploy instances of their software dynamically, the moment a user pays.",
    "activity_status": "Active",
    "website": "https://kubesail.com",
    "founded_date": 2018.0,
    "team_size": 2.0,
    "location": "Pasadena, CA",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:hardware; industry:community; industry:kubernetes",
    "founders": [],
    "status": true,
    "generated_description": "### KubeSail: The Self-Hosting Company\n\nFounded in 2018 and part of Y Combinator's S19 batch, KubeSail is stirring up the self-hosting revolution from Pasadena, California. With just a two-person team, the company operates under a clear mission: to empower users to reclaim their privacy by hosting applications at home. They’re not just a tech company; they’re advocates for a more accountable internet.\n\n#### What They Offer\n\nKubeSail simplifies self-hosting, making it accessible and enjoyable. Whether you plug in a spare PC or invest in their custom-designed hardware, known as the PiBox, you can install a variety of apps—think PhotoPrism for photos, NocoDB for database management, or even Minecraft for gaming. This gives you total control over your data, elevating personal and organizational privacy.\n\nFor businesses, KubeSail is a game-changer. They provide rapid, on-demand software deployment—whether in the cloud or through physical, pre-configured servers. Companies like ChatWoot leverage KubeSail to dynamically deliver software to paying users, streamlining operations in real-time.\n\n#### Why Self-Host?\n\nLet’s break down the allure of self-hosting:\n1. **Ownership**: You're in control of your data without relying on third-party clouds.\n2. **Customization**: Choose from a wide range of self-hosted applications, creating a personalized tech ecosystem.\n3. **Accessibility**: Access your hosted applications from anywhere, mimicking the benefits of paid cloud services without the hefty bills.\n\nKubeSail's offerings include comprehensive support, educational resources, and a commitment to making self-hosting beginner-friendly and powerful.\n\n#### Pricing Structure\n\nKubeSail has a tiered pricing model catering to different needs:\n- **Free Tier**: Good for beginners wanting to dip their toes in self-hosting.\n- **Standard Plan**: At $7 per month, it includes custom domains and tech support.\n- **Business Plan**: Starting at $49, this tier is tailored for more extensive operations, featuring dedicated support and the ability to ship plug-and-play hardware.\n\nEach plan aims to deliver value while respecting your right to privacy and ownership of your digital environment.\n\n#### In Summary\n\nKubeSail isn't just about hosting; it's a movement advocating for data ownership in an era dominated by corporate cloud giants. With a strong emphasis on community, support, and education, KubeSail empowers individuals and organizations to take back control with fun, flexible self-hosting solutions. Their commitment is clear: they want to help you “fix the internet” and de-google your life—all while enjoying the process. \n\nTo dive into hosting on your own terms, check out their offerings at [kubesail.com](https://kubesail.com) and discover a world where you control your data instead of the other way around.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/9ef64e7885b51859f13380e8814bbc9467115b38.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191455Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=d2b1cd4ec5011c89205419e224c504f0ff38d313ff9a053bb070ee491559194d",
    "social_links": [
        "https://twitter.com/kubesail",
        "https://www.crunchbase.com/organization/kubesail",
        "https://github.com/kubesail"
    ],
    "logo_path": "data/logos\\KubeSail_logo.png"
}