{
    "links": "https://www.ycombinator.com/companies/kular",
    "name": "Kular",
    "headline": "Replacing 20 Million Salespeople With AI",
    "batch": "W22",
    "description": "Hey! We're Kular. We believe human salespeople will be replaced by AI, and we’re working to build that future. \r\n\nOur growth rate has rocketed up (reach out for specific numbers). We're now hiring to keep up with demand.\r\n\nKular is being built by a team of MIT, IIT, Cambridge and Oxford grads, backed by some of the best investors in the world, including Y-Combinator, Entrepreneur First, Acequia Capital and angel investors behind companies like Ironclad, OpenSea and Stripe.",
    "activity_status": "Active",
    "website": "https://www.kular.ai",
    "founded_date": 2021.0,
    "team_size": 19.0,
    "location": "London, United Kingdom",
    "group_partner": "Harj Taggar",
    "group_partner_yc": "https://www.ycombinator.com/people/harj-taggar",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:saas; industry:b2b",
    "founders": [
        {
            "name": "Nelson Jones, Founder",
            "description": "Nelson is the cofounder of Kula and an entrepreneur by background, having started a profitable business in his last year of university. Before Kula, he sold software to top lawyers at Luminance, and studied law at Oxford University.",
            "linkedin": "https://www.linkedin.com/in/nelson-jones-238487194/"
        },
        {
            "name": "Saaras Mehan, Founder",
            "description": "Saaras Mehan is the cofounder and CTO of Kular. Saaras leads the technical team and single-handedly built an MVP used by over 100 lawyers. Saaras competed in international chess as a child, before patenting a machine learning algorithm as a teenager, and joining Microsoft Research’s Azure Sphere team as a young adult. He earned a degree in computer science from the University of Cambridge.",
            "linkedin": "https://www.linkedin.com/in/saaras-mehan"
        }
    ],
    "status": true,
    "generated_description": "### Company Overview: Kular\n\n**Mission:** Kular aims to replace 20 million salespeople with AI, fundamentally transforming how businesses handle sales processes. The belief here is clear: as human roles in sales evolve, AI can take over and improve efficiency.\n\n**Foundation & Growth:** Founded in 2021 and part of Y Combinator's W22 batch, Kular kicked off its journey with the bold statement, \"Hey! We're Kular.\" Since then, the company has seen a significant growth trajectory, and they're in a phase of expansion, actively hiring to meet increased demand.\n\n**Team & Backing:** The Kular team boasts a solid academic pedigree, featuring graduates from prestigious institutions like MIT, IIT, Cambridge, and Oxford. They’ve also garnered backing from notable investors including Y-Combinator, Entrepreneur First, Acequia Capital, and angel investors behind well-known companies like Ironclad, OpenSea, and Stripe.\n\n**Location:** Kular is headquartered in London, UK, and operates with a dedicated team of 19 employees.\n\n**Target Market:** The company primarily caters to the SaaS and B2B sectors, focusing on optimizing sales outreach for its clients.\n\n### What Kular Offers\n\nKular’s platform harnesses cutting-edge AI to automate and enhance the lead generation process. Here’s how it works:\n\n1. **Audience Targeting:** Users define their target audience, and Kular’s AI sifts through an extensive database of over 200 million contacts worldwide to identify potential clients.\n  \n2. **Messaging Optimization:** The platform drafts messages for outreach that you can edit, ensuring that they bypass spam filters and maximize email deliverability—twice the industry standard.\n\n3. **Continuous Learning:** Kular's AI learns from warm email responses, optimizing for conversion rates over time. Users only need to invest about an hour a month to manage their campaigns.\n\n4. **Performance-Based Pricing:** The pricing model is straightforward—you only pay for results. If Kular doesn’t deliver a qualified lead or a booked meeting, you don't pay. This risk-free model ensures that businesses can control their budgets without any minimum commitments.\n\n### Impressive Testimonials & Partnerships\n\nKular has established trust with over 1,000 firms, including notable brands like Ferrari, P&G, H&M, and IKEA, emphasizing its effectiveness in generating high-quality leads. Many clients have reported substantial returns on investment, such as Abbott Consulting securing a $20k deal during the free trial.\n\n### The Bottom Line\n\nKular is positioning itself as a revolutionary player in the sales and lead generation arena. By replacing traditional sales models with AI-driven solutions, they are not just aiming to enhance efficiency; they are redefining what it means to engage with potential clients. If you’re ready to elevate your sales strategy with cutting-edge technology, Kular might just be the answer.\n\nFor more information, check out their [website](https://www.kular.ai) and consider starting a free trial.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/87f9cc7f9c3f8ca6169b3e0090443ef5415c0938.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191455Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=632e157cb7e208f4c1410ce662cf09cbf35baf54385db6af6bdd09afcd1f75d0",
    "social_links": [
        "https://www.linkedin.com/company/joinkular/"
    ],
    "logo_path": "data/logos\\Kular_logo.png"
}