{
    "links": "https://www.ycombinator.com/companies/kurios",
    "name": "Kurios",
    "headline": "Cohort-based online courses for professionals in Latin America",
    "batch": "S21",
    "description": "Kurios is cohort based online courses for professionals in Latin America. Our instructors are professionals coming out of tech companies like Google, Amazon, Stripe and more. \r\n\nOur course completion rate is 90% and annual customer retention rate is 100%.\r\n\nWe have 65 B2B customers and we up-skill their employees in product management, growth and data analytics, just to start with.\r\n\nSome customers: Walmart Mexico, Banorte (2nd bank in Mexico), Mercado Libre, BCP (#1 bank in Peru), Alicorp (leading CPG in Latam), Sura (leading pension fund), etc.",
    "activity_status": "Active",
    "website": "https://www.kurios.la/",
    "founded_date": 2019.0,
    "team_size": 10.0,
    "location": "Lima, Peru",
    "group_partner": "Gustaf Alstromer",
    "group_partner_yc": "https://www.ycombinator.com/people/gustaf-alstromer",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:elearning; industry:latin-america",
    "founders": [
        {
            "name": "Carlos Lau, Founder",
            "description": "Co-founder & CEO @ KURIOS. Ex-Uber Latam early stage employee. Contributed to the 60x growth in the Peruvian operations, as a Growth and Operations Manager. Launched and scaled UberDost in Latam (Brasil, Mexico, Colombia and Peru), a supply growth app. Ex-Amazon USA Product Marketing Manager Intern. Squash addict. Father of two. Alumni - University of Texas at Austin.",
            "linkedin": "https://www.linkedin.com/in/carloslauv/"
        },
        {
            "name": "Luis Ubillas Door, Founder",
            "description": "Co-founder and COO at KURIOS. I started my career in investment management at BCP (Peru's largest bank). After my MBA program, I transitioned to Tech working at Amazon as financial controller in the North America ecommerce business. I've also worked as an independent consultant in Product & Growth Strategy for +$1B dollar companies in the consumer, financial and insurance sectors.",
            "linkedin": "https://www.linkedin.com/in/lubillas/"
        }
    ],
    "status": true,
    "generated_description": "Kurios is shaking things up in Latin America's professional learning landscape. Founded in 2019 and part of Y Combinator’s S21 batch, this Lima-based startup specializes in cohort-based online courses tailored for professionals in the region. The courses are led by seasoned experts from tech giants like Google, Amazon, and Stripe. \n\nTheir mission is compelling: bridge knowledge gaps for professionals eager to up-skill in critical areas like product management, growth strategy, and data analytics. It's working—Kurios boasts a breathtaking 90% course completion rate and an impressive 100% annual customer retention rate.\n\nThe company’s clientele is diverse and illustrious, including major players such as Walmart Mexico, Banorte (the second-largest bank in Mexico), Mercado Libre, BCP (the top bank in Peru), and Alicorp (a leading consumer packaged goods company in Latin America). Currently, they serve 65 B2B customers, helping to cultivate a skilled workforce ready to tackle contemporary challenges.\n\nKurios offers a variety of courses, such as a **Growth Strategy course** that kicks off March 5th, and a **Digital Product Management course**, starting March 4th—there's something for everyone looking to gain cutting-edge skills. Their focus on industry insights means that learners engage with relevant, actionable content, delivered in a dynamic, collaborative environment. \n\nThe team, although small with just ten employees, is robustly supported by experts who possess over a decade of experience in their fields. Gustaf Alstromer, a notable Y Combinator partner, is on board as their group partner, adding an extra layer of credibility and guidance.\n\nKurios isn’t just another e-learning platform; it's a strategic partner in the growth of companies and professionals in Latin America. Whether you’re looking for a fractional team to execute your initiatives or specialized training to elevate your team's capabilities, they can provide the insights and frameworks that have powered some of the largest tech companies in the world.\n\nFor more information, you can visit their website at [kurios.la](https://www.kurios.la/). If you're in Latin America and seeking to enhance your professional skills, Kurios is a resource worth exploring.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/c9f56d5871f5646ac2cecfd99549f1621952b06b.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191456Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=2e881ceb1830038182352743df07617bff2dfc3f7ca780d4782e6831faa26f9d",
    "social_links": [
        "https://www.linkedin.com/school/kurios-la",
        "https://www.facebook.com/kurios.la",
        "https://www.crunchbase.com/organization/kurios-technologies"
    ],
    "logo_path": "data/logos\\Kurios_logo.png"
}