{
    "links": "https://www.ycombinator.com/companies/labdoor",
    "name": "Labdoor",
    "headline": "Labdoor is building the trusted online drugstore.",
    "batch": "W15",
    "description": "Labdoor is a marketplace where consumers research, find, and buy the best supplements.\r\n\nTo verify the purity and potency of these products, Labdoor first buys and tests actual dietary supplement samples:\r\n• We send each product to an FDA-registered laboratory for a detailed chemical analysis.\r\n• Our scientists then collect the laboratory results and use internal algorithms to translate this data into simple grades and rankings for consumers.\r\n• Find a product you love? Click \"buy it now\" to activate in-app purchases.",
    "activity_status": "Active",
    "website": "https://labdoor.com",
    "founded_date": 2012.0,
    "team_size": 11.0,
    "location": "San Francisco",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:marketplace; industry:consumer-health-services; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Rafael Ferreira, Founder/CMO",
            "description": "Co-founded and helped build Labdoor from the ground up, transforming it into one of the largest supplement review websites in the world.\n\nWorked as an Art Director for several agencies, helping deliver impactful work for global brands like Warner Bros., Proctor & Gamble, Johnson & Johnson, STP, HTH, DHL, Phillip Morris, and others.\n\nTwo-time shortlist nominated for the Webby Awards.",
            "linkedin": "https://www.linkedin.com/in/rafafferreira"
        },
        {
            "name": "Helton Souza, Founder/CTO",
            "description": "CTO and Head of the Labdoor Certifications Program.",
            "linkedin": "https://www.linkedin.com/in/heltonsouza"
        },
        {
            "name": "Neil Thanedar, Founder/Chairman",
            "description": "Founding CEO of Labdoor (W15), Avomeen (acq. 2016), and Air to All (501(c)3 nonprofit).\n\nNow: Launching new startup, angel investing, advising politicians, writing book.",
            "linkedin": "https://www.linkedin.com/in/thanedar"
        }
    ],
    "status": true,
    "generated_description": "**Labdoor: Your Trusted Online Drugstore for Supplements**\n\nFounded in 2012 and based in San Francisco, Labdoor emerged from the Y Combinator Batch W15 as a marketplace dedicated to helping consumers find and purchase the best dietary supplements. The company's mission is straightforward: to serve as a trusted online resource that empowers customers to make informed choices when it comes to their health.\n\n**How Labdoor Operates**\n\nLabdoor is not just another e-commerce site; it's grounded in rigorous science. To ensure the purity and potency of the supplements, Labdoor employs a meticulous testing process:\n1. They purchase actual product samples from retail stores.\n2. These samples are sent to FDA-registered laboratories for detailed chemical analysis.\n3. Their scientists then consolidate the testing results and use proprietary algorithms to provide consumers with easy-to-understand grades and rankings.\n\nThis commitment to transparency means customers can skip the marketing gimmicks, user reviews, and celebrity endorsements. Instead, they shop based on hard facts about what’s really in their supplements.\n\n**Quality Over Hype**\n\nConsumer health is at the forefront of Labdoor’s operations. They focus on providing insights that highlight not only the efficacy of supplements but also their accountability. Labdoor emphasizes that “more science, less marketing” is the way to go, ensuring their testing is free from manufacturer bias. Each purchase helps fund further research, allowing the company to continuously update and publish their reports free of charge.\n\n**Engagement and Support**\n\nLabdoor's team consists of 11 dedicated employees. They foster a strong connection with their audience through various online platforms, encouraging users to engage and share their experiences. Their website features extensive resources to help shoppers navigate categories like Fish Oil, Probiotics, Multivitamins, and more, effectively allowing them to \"shop smart\" and stay informed.\n\nWith backing from their group partner, Nan, and a focus on community-oriented consumer health, Labdoor is positioned not just as a seller, but as a valuable ally in the pursuit of health and wellness.\n\n**Conclusion**\n\nLabdoor is redefining the supplement shopping experience by marrying scientific rigor with consumer empowerment. If you want to know what stuff your supplements truly contain, Labdoor is the go-to platform. Visit them at [Labdoor.com](https://labdoor.com) to explore their rankings and make informed choices that support your health.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/9d99833a1a39bc35455d980f7cae3429898b5c29.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191457Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=ae8b357d5e7db0281f6e6d1f7785ad05e6f6587c42ee0a1f83093322b71c43d0",
    "social_links": [
        "https://www.linkedin.com/company/labdoor",
        "https://twitter.com/labdoor",
        "https://www.facebook.com/labdoor/",
        "https://www.crunchbase.com/organization/labdoor"
    ],
    "logo_path": "data/logos\\Labdoor_logo.png"
}