{
    "links": "https://www.ycombinator.com/companies/lamar-health",
    "name": "Lamar Health",
    "headline": "Scaling Intelligence for Healthcare Automations",
    "batch": "W21",
    "description": "$1 T is spent today on back office tasks such as patient triaging, intake, eligibility checks, prior auths and claims. Specialized knowledge is required to complete these tasks making them prone to errors and bottlenecked by staffing. \r\n\nLamar Health takes the burden off of providers and intelligently automates these tasks. Starting with specialty medications.",
    "activity_status": "Active",
    "website": "http://www.lamarhealth.com",
    "founded_date": 2022.0,
    "team_size": 6.0,
    "location": "San Francisco",
    "group_partner": "Jared Friedman",
    "group_partner_yc": "https://www.ycombinator.com/people/jared-friedman",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:health-tech; industry:ai; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Eesha Sharma, Founder",
            "description": "Eesha is CEO of Lamar Health, helping intelligently automate healthcare workflows. \n\nEesha is a Ph.D. in Genetics and has consulted for the government and biotech companies on precision medicine and AI. Her research work included working on the AI model used to optimize the COVID Pfizer vaccine and a state of the art model for DNA energy hybridization. \n\nAt Lamar Health, Eesha and the team are applying data science and AI to scale staff expertise for. specialty medication workflows.",
            "linkedin": "https://www.linkedin.com/in/eesha-sharma-50a99119a?trk=people-guest_people_search-card&challengeId=AQEVcjyf9X53gwAAAXTvXJu4ysPfAnEIQuq9UU2czR-m2CEZacafjf4Y_3BsXL9287GEXIePQDDHzPNCJWdgMqiIg2N04PXs1w&submissionId=757336c6-5e89-3a16-4091-740f31f76b2e"
        }
    ],
    "status": true,
    "generated_description": "# Lamar Health: Automating Healthcare with Intelligence\n\nLamar Health is a relatively fresh player in the healthcare technology arena, having been founded in 2022 and making waves from its base in San Francisco. The company is driven by a powerful mission: **“Scaling Intelligence for Healthcare Automations.”** This is a statement that captures the essence of what they are trying to achieve in a sector burdened by inefficiencies.\n\n## The Challenge\n\nToday, a staggering **$1 trillion** is funneled into back-office tasks across healthcare, encompassing essential functions like patient triaging, intake, and claims processing. These are tasks that require specialized knowledge, and unfortunately, they are rife with potential for error. The bottlenecks created by staffing shortages only exacerbate the issue. This is where Lamar Health steps in.\n\n## The Solution\n\nLamar Health is all about relieving healthcare providers from the grind of administrative burdens. Their intelligent automation platform specifically targets the intricate workflows surrounding **specialty medications.** By employing sophisticated technology, Lamar Health streamlines processes, significantly reducing the time and errors associated with tasks such as prior authorizations and eligibility checks. In fact, users have reported impressive outcomes: **90% decrease in staff time**, **95% reduction in errors**, and **50% decrease in time to fill prescriptions.**\n\nHere's how it works:\n\n1. **Data Integration**: The platform pulls data directly from faxes or emails and integrates it into Electronic Health Records (EHRs), while simultaneously verifying patient eligibility.\n2. **Clinical Review Automation**: It automatically identifies issues related to dosages, missing documentation, and uncommon medical codes tailored to each medication and payer.\n3. **Prior Authorization Optimization**: Prior authorization processes are auto-populated, allowing providers to focus on review rather than grunt work. Users gain real-time feedback on payer policies from a single dashboard.\n\n## The Team Behind Lamar Health\n\nWith a compact team of just six employees, Lamar Health is a part of Y Combinator’s Batch W21—a good sign that they have the backing and mentorship to grow and succeed. Jared Friedman serves as a Group Partner, ensuring that this innovative startup is well-positioned for the future.\n\n## Why It Matters \n\nIn a healthcare landscape often bogged down by inefficiency, solutions like Lamar Health's are not just valuable; they are essential. By automating the complexities of specialty medication workflows, Lamar Health allows providers to focus on what truly matters: patient care.\n\nIf you’re intrigued by the prospect of automating your own healthcare workflows, you might want to check them out further at [Lamar Health's website](http://www.lamarhealth.com). Given the burdens healthcare providers face today, Lamar Health is timely and necessary, making healthcare not just smarter, but also more ethical by reducing the strain on clinical teams and improving patient outcomes. \n\nIn a world that will undoubtedly keep evolving, Lamar Health is one of those rare startups that seems to have nailed both the problem and its solution right out of the gate.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/2dd54c3461fb76f029f1ebbae1491461b13acd7d.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191457Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=3336569444350aeccf6e539c916473565d81001672b68ed35670cf84d24fe7e1",
    "social_links": [
        "https://www.linkedin.com/company/lamarhealth?trk=public_profile_topcard-current-company"
    ],
    "logo_path": "data/logos\\Lamar_Health_logo.png"
}