{
    "links": "https://www.ycombinator.com/companies/landeed",
    "name": "Landeed",
    "headline": "Landeed is India's fastest property title search engine",
    "batch": "S22",
    "description": "Landeed is building India's (then for rest of the world)  fastest and most comprehensive property title search engine. More than 84% of Indian household wealth is stored in real estate, property and land. However, with 2/3rds of all court cases in India dealing with land-related disputes, it is essential that people have accessible public records to both protect themselves against litigation and provide appropriate documentation for facilitating transactions.",
    "activity_status": "Active",
    "website": "https://www.landeed.com/",
    "founded_date": 2022.0,
    "team_size": 35.0,
    "location": "Hyderabad, India",
    "group_partner": "Harj Taggar",
    "group_partner_yc": "https://www.ycombinator.com/people/harj-taggar",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:documents; industry:fintech; industry:civic-tech; industry:proptech; industry:insurance",
    "founders": [
        {
            "name": "Sanjay Mandava, Founder",
            "description": "2x YC founder. First time with GoLorry and now Landeed. Before startups, I worked as proprietary trader/investment analyst at Knight Vinke (Activist Hedge Fund) and as a real estate developer. Currently, I am CEO and Founder of Landeed with focus on building India's (later for the developing world) fastest and most comprehensive property title search engine.",
            "linkedin": "https://www.linkedin.com/pub/sanjay-mandava/24/6aa/206"
        },
        {
            "name": "ZJ Lin, Founder",
            "description": "Co-founder and CPO of GoLorry (YC W16): 2015 - 2022\nCo-founder and CPO of Landeed (YC W22): 2022 - present",
            "linkedin": "https://www.linkedin.com/in/zjlin/"
        },
        {
            "name": "J Richards, Founder",
            "description": null,
            "linkedin": "https://www.linkedin.com/in/jonathan-richards-26259bb6/"
        }
    ],
    "status": true,
    "generated_description": "### Landeed: Revolutionizing Property Title Search in India\n\n**Company Overview**  \nFounded in 2022 and part of Y Combinator's S22 batch, Landeed is blazing a trail as India's fastest property title search engine. Based in Hyderabad and boasting a team of 35 dedicated professionals, Landeed is addressing a major pain point: the pervasive land-related disputes in India, where two-thirds of court cases revolve around property issues.\n\n**Mission and Vision**  \nLandeed's mission is straight to the point: making property title searches fast, efficient, and accessible. In a country where over 84% of household wealth is tied up in real estate, having reliable access to property records is not just useful; it's essential for protecting individuals from litigation and ensuring smooth transactions.\n\n**Key Offerings**  \nLandeed provides a robust platform for various stakeholders in the property market, including developers, banks, lawyers, and individuals looking to manage their real estate documents. Here’s a glimpse of their offerings:\n\n- **For Developers**: Seamless registration processes with comprehensive support for paperwork.\n- **For Banks**: AI-driven solutions to speed up loan approvals and enhance regulatory compliance.\n- **For Legal Professionals**: Simplified legal agreements and registration processes.\n- **For Individuals**: Efficient management of property documents through their integration, LEX.\n\n**Funding and Growth**  \nRecently, Landeed raised $5 million in a Series X funding round to enhance its AI and machine learning capabilities through Landeed Labs. This investment is set to solidify its position as a leader in property tech within India.\n\n**User Engagement**  \nThe platform is user-friendly, featuring over 50 lakh successful searches across 20+ states. Customers can find over 100 types of documents, from encumbrance certificates to sale deeds, all vetted against the latest government records.\n\n**Why It Matters**  \nWith digital resources like Landeed, navigating property ownership and legal parameters becomes less daunting, fostering a more informed society. The company stands on the frontlines of a sector pivotal to economic stability in India, balancing innovation with customer need.\n\n**Conclusion**  \nFor anyone looking to manage property in India efficiently, Landeed is a vital ally. They are not just a tech company; they are making significant strides in transforming how property transactions are handled, ensuring resources are at the fingertips of users. Check out Landeed [here](https://www.landeed.com/) to learn more and get started with your property documents!",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/8825bb12d7e2eeacce099c49bf4572474f6a888f.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191500Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=338a3cc92b41912728e3b0764c6dd056de11ac3b584a7e8ef3221b745f791669",
    "social_links": [
        "https://www.linkedin.com/company/landeed/",
        "https://twitter.com/LandeedInc",
        "https://www.facebook.com/LandeedIND/"
    ],
    "logo_path": "data/logos\\Landeed_logo.png"
}