{
    "links": "https://www.ycombinator.com/companies/leaders-in-tech",
    "name": "Leaders In Tech (formerly InnerSpace)",
    "headline": "Helping founders improve themselves, their companies, and the world.",
    "batch": "S15",
    "description": "Leaders In Tech Fellows is a 10-month program limited to 72 hand-picked founders nominated by the tech community for their commitment to building high-performing and culturally-healthy organizations.\r\n\nThe Fellows program is based on the legendary Interpersonal Dynamics (\"Touchy Feely\") class at the Stanford Graduate School of Business and is led by Carole Robin former faculty director and matriarch of that program. \r\n\n146 Fellows alumni now run companies valued at over $50B that employ thousands of people.",
    "activity_status": "Active",
    "website": "http://leadersintech.org",
    "founded_date": null,
    "team_size": 1.0,
    "location": "San Francisco",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:community; location:san-francisco-bay-area",
    "founders": [],
    "status": true,
    "generated_description": "**Leaders In Tech: A Focus on Founders and Culture**\n\nLeaders In Tech, formerly known as InnerSpace, is on a mission to help founders enhance their personal development, improve their companies, and positively impact the world. Founded in 2017 as Leaders In Tech Fellows, the organization boasts a selective 10-month program designed for 72 extraordinary founders, handpicked from the tech startup community for their commitment to building high-performing and culturally healthy organizations.\n\nThe Fellows program draws inspiration from the acclaimed Interpersonal Dynamics class at Stanford's Graduate School of Business and is led by Carole Robin, the program's former faculty director. It's essentially a learning lab where startup leaders can explore new ideas, challenge one another, and take crucial interpersonal risks, fostering rapid personal and professional growth.\n\nWith 146 alumni now overseeing companies collectively valued at over $50 billion, the impact is profound. Located in San Francisco and part of Y Combinator's Batch S15, this organization operates with a small team and has already crafted a tight-knit community of current leaders and alumni committed to mutual growth.\n\n**What They Offer:**\n\n1. **Fellows Program**: A flagship 10-month training course for startup founders.\n2. **Grove Fellows**: Programs aimed at pre-seed and seed-stage founders.\n3. **Retreats**: Intensive 4-day workshops for founders and executives to engage deeply with leadership principles.\n4. **Alumni Forums** and **Corporate Programs**: Providing an opportunity for past participants to continue their growth and foster networking.\n\n**Why It Matters**: \nIn an era where discussions around workplace culture are intensifying, Leaders In Tech aims to be part of the solution, promoting positive leadership and an inclusive work environment. They believe that leaders who focus on integrity and values can drive better financial results and create a healthier ecosystem in tech.\n\nIn summary, Leaders In Tech isn't just developing better founders; they're hard at work reshaping the tech landscape one leader at a time. The goal is clear: greater cultural health in organizations leads to a sustainable future. Want to dive deeper into their offerings or get involved? Check out their [website](http://leadersintech.org) for more information.",
    "logo": "/logos/medium/missing.png",
    "social_links": [
        "https://www.crunchbase.com/organization/innerspace-2"
    ]
}