{
    "links": "https://www.ycombinator.com/companies/leafpress",
    "name": "Leafpress",
    "headline": "AI Copilot for Energy Data",
    "batch": "S23",
    "description": "Leafpress helps large enterprises manage mission-critical energy data.",
    "activity_status": "Active",
    "website": "https://www.leafpress.ai",
    "founded_date": 2023.0,
    "team_size": 2.0,
    "location": null,
    "group_partner": "Gustaf Alstromer",
    "group_partner_yc": "https://www.ycombinator.com/people/gustaf-alstromer",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": null,
    "founders": [
        {
            "name": "Devishi Jha, Founder",
            "description": "Devi dropped out from Harvard with a degree in Computer Science. She worked on the early ESG teams of Sephora, Spotify, and P&G. She is also an ESG mentor at Techstars.",
            "linkedin": "https://linkedin.com/in/devishijha"
        },
        {
            "name": "Jianna Liu, Founder",
            "description": "Jianna graduated from MIT with a degree in computer science. She has worked on the software teams at Meta, DoorDash, Nvidia, and the MIT School of Architecture and Planning.",
            "linkedin": "https://linkedin.com/in/jianna-liu-90747413b"
        }
    ],
    "status": true,
    "generated_description": "**Leafpress: Simplifying Energy Data Management with AI**\n\nFounded in 2023 and now a proud member of Y Combinator's Batch S23, Leafpress is making waves in the energy sector with its mission to be the AI Copilot for Energy Data. The company aims to help large enterprises efficiently manage their mission-critical energy data, a need that has grown exponentially in today’s data-driven world.\n\n### What It Does\n\nLeafpress offers an AI-powered platform that specializes in optimizing energy consumption. The platform not only reduces costs but also ensures that organizations can rely on their energy data like never before. What sets Leafpress apart is its ability to read utility data from virtually any format, including handwritten notes and over 75 languages, which opens up a world of possibilities for data integration.\n\n### Key Features\n\n1. **Seamless Data Handling**: Leafpress allows users to sync data from any utility account, ensuring comprehensive coverage for all energy metrics.\n2. **AI-Driven Insights**: Its advanced analytics can detect anomalies and spikes in energy consumption, providing actionable insights to drive efficiency.\n3. **Automated Reporting**: The platform integrates with popular systems like Energy Star Portfolio Manager to simplify compliance and reporting processes.\n\n### Success Stories\n\nLeafpress has already garnered the trust of prominent organizations like Johnson Controls and Singerman Real Estate, demonstrating its practical impact in real-world applications. The company boasts impressive statistics, such as saving users 90% of the time spent on data management and achieving a 50% reduction in energy costs.\n\n### Future Horizon\n\nLeafpress isn’t resting on its laurels. With innovations like a Business Management System (BMS) integration and enhanced analytics capabilities on the horizon, the company is setting itself up for sustained growth and success. It’s currently invite-only for new features—suggesting that they’re gearing up for big things ahead.\n\n### Meet the Team\n\nLed by a compact yet talented team of two and backed by Group Partner Gustaf Alstromer, Leafpress exhibits agility and a strong vision in the tech startup ecosystem.\n\n### Conclusion\n\nIf you’re managing energy data and feeling overwhelmed, Leafpress is your answer. The future of energy management is here, packed with AI innovation that ensures you’re not just keeping up with data but mastering it. Check out more on their website [Leafpress.ai](https://www.leafpress.ai) or book a demo to see the magic for yourself. \n\nIn a world that’s increasingly data-driven, Leafpress is making it easier, smarter, and more efficient for enterprises to consume and manage energy.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/bbc1915224757ce3ca606c052f4abc9ada46ca18.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191502Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=760b638d6085e502bf9b17f06a78c88c098a2f0b368eecfc66f701aa2c191f96",
    "social_links": [],
    "logo_path": "data/logos\\Leafpress_logo.png"
}