{
    "links": "https://www.ycombinator.com/companies/ledger-investing",
    "name": "Ledger Investing",
    "headline": "Marketplace for insurance securitization.",
    "batch": "W17",
    "description": "Ledger Investing provides an exciting opportunity for asset managers, pension funds, hedge funds, family offices and other institutions interested in earning a great return through insurance investing.\r\n\nThe company deploys proprietary software and data analytics covering many types of insurance risk portfolios. The technology enables insurers to securitize risk more efficiently while providing investors, asset managers, pension funds, hedge funds, family offices, and other institutions an opportunity to invest in a new and growing asset class.\r\n\nLedger Investing was founded by Julien Brissonneau, Aymeric Rabot and Samir Shah in 2016.",
    "activity_status": "Active",
    "website": "https://ledgerinvesting.com/",
    "founded_date": 2016.0,
    "team_size": 85.0,
    "location": null,
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:insurance; industry:investing",
    "founders": [],
    "status": true,
    "generated_description": "Ledger Investing is carving out a unique niche in the world of finance, focusing on insurance securitization. Think of them as a marketplace where serious capital meets innovative risk management. Founded in 2016 by Julien Brissonneau, Aymeric Rabot, and Samir Shah—who cut their teeth in Y Combinator’s Batch W17—this New York-based firm is on a mission to create a robust ecosystem for insurance-linked securities (ILS).\n\nWhat does that mean? For asset managers, pension funds, hedge funds, and family offices, it’s about tapping into an asset class that’s gaining traction. Ledger provides these investors with the tools and insights to deploy their capital strategically within various types of insurance risk portfolios. Their proprietary software and data analytics streamline the process, allowing insurers to securitize risks more effectively. This efficiency creates compelling investment opportunities.\n\nLedger is not shy about their growth. They've securitized over $2 billion in premiums and secured more than $400 million in capital. Their partnerships include some of the largest managing general agents (MGAs) in the U.S., showcasing their prominence in the field.\n\nThe company has developed an impressive suite of products. This includes Connect, which lays the groundwork for risk data infrastructure; an analytics suite for modeling; and a monitoring system that provides real-time alerts and reports. There’s even a forthcoming Bordereau feature aimed at automating certain reporting processes.\n\nTheir website is a treasure trove of resources - from an industry database to an insurance library filled with articles on market dynamics and casualty insurance methodologies. They’re keen on educating their audience, proving that they’re more than just a financial service; they’re a knowledge hub.\n\nWith a dynamic team of around 85 employees working to connect risk to capital, Ledger Investing is at the forefront of fintech innovation in the insurance sector. They are engaging the most forward-thinking investors and underwriters, forging partnerships that elevate their business.\n\nIf you’re looking to diversify your portfolio, engage with unique risk profiles, and delve into an evolving market, Ledger Investing could be the platform that reinvigorates your approach to investment. You can check them out at [Ledger Investing's website](https://ledgerinvesting.com/).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/8e76887900e32b263973788d1b886ede7d3158c0.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191502Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=76409c5127b19d63724ef16b01f46169006aeba65753b60938c7fef3f20a6149",
    "social_links": [
        "https://www.linkedin.com/company/ledger-investing",
        "https://twitter.com/LedgerInvesting",
        "https://www.crunchbase.com/organization/ledger-investing",
        "https://github.com/LedgerInvesting"
    ],
    "logo_path": "data/logos\\Ledger_Investing_logo.png"
}