{
    "links": "https://www.ycombinator.com/companies/legacy",
    "name": "Legacy",
    "headline": "Legacy helps you test, improve, and freeze your sperm",
    "batch": "S19",
    "description": "**TL;DR:** \r\n\nLegacy (YC S19) is a startup focused on the fast-growing field of fertility and family planning. Founded at Harvard, the company has now raised $40M from leading investors like FirstMark Capital, Bain Capital Ventures, Section 32, Tribe Capital, and even celebrities like Justin Bieber, The Weeknd, and others. \r\n\n**What we're doing**\r\n\nWe aim to change the outdated view that fertility is a \"women's issue\" by creating an accessible, affordable product for men & people with sperm. This includes everything from a mail-in kit for sperm testing & sperm freezing, personalized sperm improvement products, tele-health, DNA fragmentation analysis, supplements, and more.\r\n\n**Why are we the leader?** \r\n\nThe company was founded at Harvard by a team of healthcare and fertility experts. We obsess about talent density and have out-executed our competitors over the past few years. Beyond our D2C channel, we've also unlocked:\r\n\n1. Nationwide insurance coverage (10M+ lives)\r\n2. Military contracts (Including the Navy SEALs and 15M+ veterans)\r\n3. Employer offerings (Working with the top fertility benefit providers)\r\n\n**Tell me about the team** \r\n\nWe're a team of about 30, extremely diverse (majority female, majority immigrants, strong LGBQTIA+ representation, age range of 25-65), and very values driven. Our 5 values are customer centricity, reliability, kindness, openness, and winning. \r\n\nLearn more about our values here:\r\nhttps://khaled-legacy.medium.com/legacys-values-and-why-they-matter-db116539d3da\r\n\nLearn more about our workplace here:\r\nhttps://khaled-legacy.medium.com/how-and-why-legacy-is-reinventing-workplace-benefits-9e5fda6cb863\r\n\nRead about our mission to humanize the path to parenthood:\r\nhttps://khaled-legacy.medium.com/how-and-why-legacy-is-reinventing-workplace-benefits-9e5fda6cb863\r\n\nLearn more about sperm and why it matters here:\r\ndocsend.com/view/zkgk7ws",
    "activity_status": "Active",
    "website": "https://www.givelegacy.com",
    "founded_date": 2019.0,
    "team_size": 35.0,
    "location": "New York",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fertility-tech; industry:consumer-health-services; industry:digital-health; industry:healthcare; industry:health-&-wellness; location:new-york",
    "founders": [
        {
            "name": "Khaled Kteily, Founder",
            "description": "CEO of Legacy (YC S19), which has now raised almost $50M from investors like FirstMark Capital, Bain Capital Ventures, Section 32, and even celebrities like Justin Bieber to change outdated views of fertility as a \"women's issue\" while helping rebalance the responsibilities of family planning.",
            "linkedin": "http://www.linkedin.com/in/kteily"
        },
        {
            "name": "Sarah Steinle, Founder",
            "description": null,
            "linkedin": "https://www.linkedin.com/in/sarah-steinle-66142a3b/"
        }
    ],
    "status": true,
    "generated_description": "**Company Overview: Legacy**\n\n**TL;DR:** Legacy, a Y Combinator startup from Batch S19, is disrupting the fertility landscape with innovative sperm testing and freezing solutions. Founded in 2019 at Harvard, they’ve raised $40M from top-tier investors and celebrities, aiming to put men and people with sperm at the forefront of fertility and family planning.\n\n---\n\n**Mission**\n\nLegacy’s mission is to challenge the outdated notion that fertility issues are solely a \"women's issue.\" They aim to empower individuals with sperm by providing accessible and affordable solutions, ranging from sperm testing and freezing kits available for home use to personalized improvement products and telehealth services.\n\n---\n\n**Why They Lead the Market**\n\nLegacy stands out due to its deep expertise and rapid execution. Founded by healthcare and fertility specialists, they offer:\n\n1. **Comprehensive Coverage**: Partners with major insurance providers affecting over 10 million lives.\n2. **Military Contracts**: Serving military personnel, including Navy SEALs, and over 15 million veterans.\n3. **Corporate Offerings**: Collaborating with leading fertility benefit providers to enhance employee wellness.\n\n---\n\n**The Team**\n\nLegacy boasts a diverse workforce of around 30 employees, emphasizing values of customer-centricity, reliability, kindness, openness, and winning. This team representation brings a wealth of perspectives, enhancing their mission to provide effective and empathetic services.\n\n---\n\n**Current Offerings**\n\n- **At-Home Testing Kits**: Customers can easily order a sperm analysis kit online, collect their samples privately, and ship them to Legacy's lab.\n- **Sperm Freezing**: Their services include storing sperm safely for future use, with rates starting at just $145 annually, making family planning much more accessible.\n- **Health Insights**: Beyond fertility, they provide insights about sperm health as a critical aspect of overall wellness, which can indicate potential health risks.\n\n---\n\n**Why the Fuss?**\n\nFertility rates have decreased drastically, with factors like environmental toxins contributing to a 50% drop in sperm counts since the 1970s. Traditional fertility clinics can be awkward and costly, but Legacy leverages technology to provide a more comfortable, discreet, and efficient solution. They promise results faster than traditional clinics—often within 48 hours.\n\n---\n\n**User Experiences**\n\nTestimonials suggest that Legacy's approach is not just effective but also transformative. Users highlight the ease of the process, responsive customer service, and the significant impact on their family planning journeys.\n\n---\n\n**Conclusion**\n\nLegacy is not merely a company; it's a movement towards redefining how we view and handle fertility issues. By putting control back into the hands of individuals with sperm, they are reshaping the narrative of family planning and fertility in modern society. To learn more or to get started, check out their website at [Give Legacy](https://www.givelegacy.com).\n\n--- \n\nAt its core, Legacy invites you to consider: why should family planning be left to chance?",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/34e6a9516e60cb431d1b1746389cc6e8923e400e.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191502Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=8f9bcb2c58f418715eaf3da4f83dac4d1f3516cdb76c864aaff31ac0edfdbc39",
    "social_links": [
        "https://www.linkedin.com/company/29006005/",
        "https://www.twitter.com/legacy",
        "https://www.facebook.com/givelegacyinc",
        "https://www.crunchbase.com/organization/legacy"
    ],
    "logo_path": "data/logos\\Legacy_logo.png"
}