{
    "links": "https://www.ycombinator.com/companies/legionfarm",
    "name": "Legionfarm",
    "headline": "We connect gamers with training and assistance from Pro players",
    "batch": "W20",
    "description": "LegionFarm lets gamers pay to play with professional players, helping customers have more fun playing, learn to be a better gamer, and conquer difficult parts of video games.\r\n\nLegionfarm Pros want to monetize their skills by turning their hobbies into real careers. They are the top 1% of players. They have a massive impact on the success of gaming companies - and we want to allow these top players to hold their dream jobs in virtual worlds.\r\n\nOver the past year, Legionfarm organized over 400,000 gaming sessions with our 7,000 Pros.\r\n\nLegionfarm provides access to unique entertainment on a global scale while creating new jobs in virtual worlds at the same time",
    "activity_status": "Active",
    "website": "https://legionfarm.com/",
    "founded_date": null,
    "team_size": 75.0,
    "location": "San Francisco",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:gaming; industry:esports; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Aleksei Beliankin-Bauer, Founder",
            "description": "I'm a serial entrepreneur. Founder & Board member at Legionfarm (YC W20). Stepped down as a CEO of Legionfarm earlier in 2024. Over 150k customers have used our two web marketplaces and five messenger bots to hire pro players in video games. The company is now breakeven, having reduced from 140 employees to 18. We replaced 74 customer service roles with LLMs and began full CS automation in March 2023. I have strong experience in enhancing CS in marketplaces with AI agents",
            "linkedin": "https://www.linkedin.com/in/alex-beliankin/"
        }
    ],
    "status": true,
    "generated_description": "**Legionfarm: Connecting Gamers with Pros**\n\nLegionfarm is a trailblazer in the gaming industry, marrying the thrill of gameplay with opportunities for improvement through professional coaching. Their mission? To link gamers with top-tier players who offer the training and assistance needed to enhance the gaming experience. Founded in 2020 as part of Y Combinator’s W20 batch and anchored in San Francisco, the company has grown swiftly, organizing over 400,000 gaming sessions with around 7,000 elite professionals.\n\n### What They Do\n\nInitially, Legionfarm offered a platform for gamers to pay to play alongside professionals, making it more enjoyable to tackle challenging sections of games. This model has evolved into a robust service that not only enhances gameplay but also empowers exceptional players—the top 1%—to monetize their skills. These players can now pursue careers in the virtual realm while positively impacting the gaming industry's success.\n\n### Services Offered\n\nLegionfarm excels in offering personalized coaching and boosting services for popular titles like Call of Duty. Whether you need to improve your kill/death ratio, master weapon handling, or hone strategic skills, Legionfarm provides a tailored experience. Their coaching sessions are not just about generic advice; they focus on actionable insights that can significantly accelerate your progress in the game.\n\n### Why Choose Legionfarm?\n\n1. **Elite Coaches**: Legionfarm boasts a team of the best players available, each with extensive experience. They know the ins and outs of the games and can provide targeted advice that leads to real improvements.\n   \n2. **Customizable Sessions**: Recognizing that each gamer has unique needs, Legionfarm tailors its coaching sessions to fit those, ensuring that every player gets exactly what they require to advance.\n   \n3. **Safety First**: They prioritize the security of your gaming account, employing secure methods to ensure a hassle-free experience.\n   \n4. **Rapid Results**: Many users report noticeable improvements after just one session, making Legionfarm a swift path to success in your favorite games.\n\n### The Bigger Picture\n\nLegionfarm isn’t just about boosting individual scores; it’s about creating jobs in the gaming industry and enhancing the overall entertainment landscape globally. With a dedicated team of 75 employees working to connect gamers and pros, Legionfarm is standing at the forefront of the gaming evolution, making experiences richer and more rewarding for everyone involved.\n\nIf you're looking to turn frustration into triumph in your gaming endeavors, checking out Legionfarm’s offerings could be the game-changer you need. You can explore more about their services on their website: [Legionfarm](https://legionfarm.com/).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/29f4f852e9512d5d921a5c04bdc00acfd1c231bc.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191502Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=92136c86c2e7479e3dc3641944fd5018536de37f05a35fac8d559bd85a9ddaad",
    "social_links": [],
    "logo_path": "data/logos\\Legionfarm_logo.png"
}