{
    "links": "https://www.ycombinator.com/companies/lendtable",
    "name": "Lendtable",
    "headline": "We give employees cash advances for their 401k match and ESPP",
    "batch": "S20",
    "description": "1 in 4 Americans do not get their full 401(k) match. That means 25 million workers are leaving $24 billion on the table in free employer contributions. The primary reason these workers cannot get their match is because they do not have enough to both cover living expenses and invest. \r\n\nLendtable helps workers get thousands in additional income by giving them a cash advance to cover their living expenses so they can finally begin earning their employer match. Once their money has vested we take some of the match money earned in order to cover our expenses. \r\n\nWorkers now have thousands of dollars more without putting any money down, and we make money helping them do so -- we win if they win.",
    "activity_status": "Active",
    "website": "http://lendtable.com",
    "founded_date": 2020.0,
    "team_size": 20.0,
    "location": "San Francisco",
    "group_partner": "Brad Flora",
    "group_partner_yc": "https://www.ycombinator.com/people/brad-flora",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Sheridan Clayborne, Founder",
            "description": "I was the youngest person to get into Northwestern at age 15, where I was a Computer Science and Econ Major. Dropped out of Northwestern to pursue my startup full-time. I spent time working at JP Morgan and Goldman Sachs on their private equity teams and was the youngest PM to come to Dropbox at 19\n\nI have worked on many startups in the past, with my passion always being around fintech and financial inclusion. To date, I have raised over $5mil and done over $10mil in sales across my businesses",
            "linkedin": "https://www.linkedin.com/in/sheridan-clayborne-77723a119/"
        },
        {
            "name": "Mitchell Jones, Founder",
            "description": "I am a founder with the goal of helping all people to better save and invest for their financial future. I believe that with the right nudge (and a little help from software) we can help people do the right thing and make money a bit less stressful. Ex Facebook and Dropbox, product manager, a Yale University graduate, and a proud Ohioan by origins.\n\n\"Our lives begin to end the day we become silent about the things that matter\" - MLK",
            "linkedin": "https://www.linkedin.com/in/mitchell-jones-333559a2/"
        }
    ],
    "status": true,
    "generated_description": "Lendtable is a fintech startup founded in 2020 and is part of Y Combinator's Summer 2020 batch. Based in San Francisco, it operates with a small team of 20 dedicated employees. The company addresses a critical issue faced by many American workers: about 25 million people miss out on $24 billion in employer 401(k) contributions simply because they can’t afford to invest while covering living expenses. \n\nLendtable's mission is straightforward yet impactful: they provide cash advances to employees, allowing them to tap into their employer's 401(k) match and Employee Stock Purchase Plans (ESPP) without needing to put their own money upfront. This means workers can access thousands of dollars in additional income, enabling them to finally reap the benefits of employer contributions. \n\nHere’s how it works: when employees receive a cash advance to cover their living costs, they can start contributing to their 401(k) matches. Once those contributions vest, Lendtable takes a portion of the match as payment for the advance. This creates a win-win scenario—employees get the financial boost they need, and Lendtable profits only when the employees succeed. \n\nWith a solid backing from Y Combinator and an innovative approach to financial wellness, Lendtable is redefining how employees think about and access their retirement benefits. Check them out at [lendtable.com](http://lendtable.com). \n\nIn summary, Lendtable is trying to solve a huge problem in the American workforce by transforming how people access retirement contributions—one cash advance at a time.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/d3f37d258fad9ae7e9752b2c2b8fddb97298b437.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191505Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=e9ac44ab72fe3a293be4e14f1262a0af658dd4a70d3f0c8b058286652cecde48",
    "social_links": [
        "https://www.linkedin.com/company/lendtable/about/",
        "https://twitter.com/Lendtable",
        "https://www.facebook.com/lendtable/",
        "https://github.com/Lendtable"
    ],
    "logo_path": "data/logos\\Lendtable_logo.png"
}