{
    "links": "https://www.ycombinator.com/companies/level-frames",
    "name": "Level Frames",
    "headline": "Software eats custom framing",
    "batch": "W15",
    "description": "Level Frames is making it more convenient, affordable and intuitive to custom frame posters, prints, photos and more. By bringing the entire experience online and offering amazing support, we can help make your walls in your home or office look amazing at a fraction of the price and turnaround time of a traditional frame shop. \r\n\nLevel was founded in 2014 and is based in New York, United States.",
    "activity_status": "Active",
    "website": "http://levelframes.com",
    "founded_date": 2014.0,
    "team_size": 5.0,
    "location": "NY",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:e-commerce",
    "founders": [
        {
            "name": "Josh Hubball, Founder/CEO",
            "description": "Building @Levelframes. Fan of music, tech, analog photography, being a dad and the Sawx.",
            "linkedin": "https://www.linkedin.com/in/joshhubball"
        },
        {
            "name": "Damian Sowers, Founder",
            "description": "Founder & CTO @levelframes",
            "linkedin": "http://www.linkedin.com/pub/damian-sowers/22/a8b/178"
        }
    ],
    "status": true,
    "generated_description": "### Level Frames: Framing Reimagined\n\n**Company Overview**  \nLevel Frames is a New York-based e-commerce company that revolutionizes custom framing by bringing it entirely online. Founded in 2014 and a proud member of Y Combinator's W15 batch, Level Frames is on a mission to make custom framing more convenient, affordable, and intuitive. With a small but dedicated team of five, the company is committed to transforming walls in homes and offices with beautifully framed artwork.\n\n**Mission**  \nAt its core, Level Frames believes that \"software eats custom framing.\" The goal is straightforward: to enhance the framing experience by seamlessly integrating technology, thus eliminating the inefficiencies of traditional frame shops. Their offering enables customers to frame anything from posters and photos to prints—all while delivering a premium product at a fraction of both the cost and turnaround time seen in conventional framing.\n\n**What They Offer**  \nLevel Frames empowers users to create custom frames with ease, whether it’s for artwork, personal photos, or unique items like vinyl records. Their website allows customers to:\n- **Frame a Photo**: Simply upload an image, choose your frame, and have it delivered.\n- **Custom Frames**: Design frames for art prints and other works on paper.\n- **Gallery Walls**: Curate a stunning arrangement with framed artworks.\n- **Framing Tips & DIY**: Guidance for those who prefer a hands-on approach.\n\nThe materials used are of museum quality, ensuring that each piece not only looks incredible but also stands the test of time—because your memories deserve to be displayed elegantly.\n\n**Unique Selling Proposition**  \nWhat sets Level Frames apart is their 100% Happiness Guarantee, reflecting confidence in their craftsmanship. They also promote a positive customer journey with outstanding support available via chat, email, or phone.\n\n**Community and Culture**  \nThough a compact team, Level Frames shares a clear vision of excellence and customer satisfaction. They engage with the artistic community, supporting not just individual customers but also partnerships with artists, photographers, and interior designers, showing their commitment to both craftsmanship and creativity.\n\n**Conclusion**  \nIn a world where every image can be digitized and shared, Level Frames brings those memories back into the physical realm where they belong—on the walls of our lives. With their effective blend of technology and artistry, framing doesn’t have to be a daunting task anymore; it can be a delightful experience. For those looking to bring some of their own art to life, Level Frames offers a noticeable step up from the ordinary framing shop.\n\nVisit [Level Frames](http://levelframes.com) to get started on framing your memories today!",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/93722b0727c0f59e30a4a2813cdb07817eb5b459.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191505Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=fb8b881a36197d170faae35e585e41e94f072ca47d32903acf06aea019fb4e31",
    "social_links": [
        "https://www.linkedin.com/company/level-frames",
        "https://twitter.com/levelframes",
        "https://www.facebook.com/levelframes",
        "https://www.crunchbase.com/organization/level-4"
    ],
    "logo_path": "data/logos\\Level_Frames_logo.png"
}