{
    "links": "https://www.ycombinator.com/companies/levers",
    "name": "Levers",
    "headline": "Automating collection and boosting cashflow for B2B companies",
    "batch": "S22",
    "description": "Levers is an accounts receivable management SaaS that helps B2B companies reduce overdue payments, accelerate cash collection, and boost cashflow. Our software integrates with your accounting system and streamlines your AR process using personalized reminders, cross-team collaboration tools, collection performance analytics, and more.",
    "activity_status": "Active",
    "website": "https://uselevers.com/",
    "founded_date": 2022.0,
    "team_size": 8.0,
    "location": "Jeddah, Saudi Arabia",
    "group_partner": "Gustaf Alstromer",
    "group_partner_yc": "https://www.ycombinator.com/people/gustaf-alstromer",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:saas; industry:finance",
    "founders": [
        {
            "name": "Ammar Alkhouli, Founder",
            "description": "Co-founder at Levers. Prior to that, I spent ~3 years working at a $500m VC fund in MENA. As one of the first hires, I wore many hats beyond investment and portfolio work including strategy, compliance, financial reporting, marketing, and HRM. I received my Bachelor's in Mathematics and Philosophy from Yale. \n\nI am a tinkerer at heart and love to seek out new experiences. I feel most at home by the sea, so you'll often find me looking for new diving spots, fishing, or trying to catch some waves",
            "linkedin": "https://www.linkedin.com/in/ammaralkhouli/"
        },
        {
            "name": "Motasim Zawawi, Founder",
            "description": "Co-founder at Levers. Previously I was a Product Manager at Mozn, where I built a SaaS AML/KYC product for financial institutions from scratch and led product strategy, sales, and marketing. Before that, I received my Bachelors in Mechanical Engineering from Stanford University in 2018. \n\nI enjoy building delightful products and love the outdoors, especially scuba and free diving 🤿",
            "linkedin": "https://www.linkedin.com/in/motasim-zawawi-0a6b78b2/"
        }
    ],
    "status": true,
    "generated_description": "Levers is a dynamic startup based in Jeddah, Saudi Arabia, focusing on automating collections and boosting cash flow for B2B companies. Founded in 2022 as part of Y Combinator's Batch S22, Levers offers a robust accounts receivable management SaaS that helps businesses streamline their financial operations by effectively managing overdue payments, accelerating cash collections, and improving overall cash flow.\n\n### What Makes Levers Tick\n\nAt its core, Levers lives by the mission to simplify and enhance the accounts receivable process. It does this by integrating seamlessly with existing accounting systems, providing features like personalized reminders, cross-team collaboration tools, and collection performance analytics. This means that finance teams can finally say goodbye to manual tracking of invoices and the headache of follow-ups, all while gaining insight into their collection processes.\n\n### Key Offerings\n\nLevers operates a platform with several prominent features:\n- **Automated Collection:** Scale customer communications and minimize manual follow-ups.\n- **Bank Reconciliation:** Quickly match bank transactions with outstanding invoices.\n- **B2B Payments:** Simplify the collection of online payments.\n- **Invoicing:** Automatically generate compliant recurring invoices.\n\nThese capabilities help businesses save over a thousand hours annually on manual tasks, significantly reducing payment delays and freeing up teams to focus on core business activities.\n\n### Benefits of Using Levers\n\nBy adopting Levers, businesses can experience:\n- Accelerated cash flow through automated reminders.\n- Increased operational efficiency and reduced Days Sales Outstanding (DSO).\n- Improvement in customer experience with seamless payment processes.\n\n### The Levers Advantage\n\nWhat sets Levers apart from traditional ERPs is its unique focus on enhancing collections. It adds advanced functionalities that lead to quicker payment collections and improved cash flow, offering a practical solution for finance teams that need to manage high volumes of receivables efficiently.\n\nLevers currently has a dedicated team of eight and has garnered favorable insights from clients who appreciate its streamlined processes and enhanced operational clarity. The company stands out in the SaaS and finance sectors, making waves in the automation of collections for modern finance teams.\n\nTo learn more and get started, visit [Levers](https://uselevers.com/).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/26a42e06d398427d1154404898c9a04c5812b96a.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191506Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=34c8fe5a93da260d31a21fb332c190f37477eb787a5322d1d11cd5ff785338e3",
    "social_links": [
        "https://www.linkedin.com/company/uselevers/"
    ],
    "logo_path": "data/logos\\Levers_logo.png"
}