{
    "links": "https://www.ycombinator.com/companies/levro",
    "name": "Levro",
    "headline": "Multicurrency account & international payments for businesses",
    "batch": "S21",
    "description": "Levro is a multicurrency account and global payments platform for businesses. We help US & international companies hold, convert, and pay 30+ currencies. Our exchange at rates are 40-90% lower than banks and FX services like Wise. We also offer free currency risk management, recipient onboarding, automated multicurrency reconciliation, and wire tracking.\r\n\nIf you have international customers, employee payroll, vendors, or bulk payouts to different countries please send us a note! founders@levro.com",
    "activity_status": "Active",
    "website": "https://www.levro.com",
    "founded_date": 2021.0,
    "team_size": 12.0,
    "location": "San Francisco",
    "group_partner": "Dalton Caldwell",
    "group_partner_yc": "https://www.ycombinator.com/people/dalton-caldwell",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:payments; industry:finance; industry:b2b; industry:international; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Cathy Han, Founder",
            "description": "Cathy Han is the Co-founder & CEO of Levro, a multicurrency neobank for businesses. Levro provides US accounts that hold up to 34 currencies to help companies pay teams, vendors, and receive revenue from customers internationally.\n\nPrior to Levro, Cathy co-founded 42 Technologies (YC W14), a big data company with retail customers around the globe. Cathy holds a Finance degree from the University of British Columbia & MBA from Harvard Business School.",
            "linkedin": "https://www.linkedin.com/in/cathyhan/"
        },
        {
            "name": "Abeer Agrawal, Founder",
            "description": "Prior to Levro, Abeer was the Co-founder & CTO of Theorem (YC W14), a machine learning enabled hedge fund which he built to over $1bn+ in AUM. Abeer holds degrees in Electrical & Computer Engineering and Computational Finance from Carnegie Mellon University.",
            "linkedin": "https://www.linkedin.com/in/abeera/"
        }
    ],
    "status": true,
    "generated_description": "### Levro: Simplifying International Payments for Businesses\n\n**Overview**  \nLevro is a financial technology company that launched in 2021 and quickly found its footing as a member of Y Combinator's Batch S21. Based in San Francisco, Levro specializes in providing multicurrency accounts and global payments solutions tailored for businesses. With a lean team of 12, Levro is on a mission to revolutionize how companies make international payments.\n\n**Core Offering**  \nLevro allows businesses to hold, convert, and pay in over 30 currencies. They proudly claim that their exchange rates are significantly more favorable—40-90% lower—than traditional banks and renowned FX services like Wise. This means businesses can save substantial costs while managing their global transactions. \n\nIn addition to competitive rates, Levro also offers:\n- **Currency Risk Management**: Free tools to mitigate against currency fluctuations.\n- **Recipient Onboarding**: Streamlining the process of getting recipients set up to receive payments.\n- **Automated Multicurrency Reconciliation**: Keeping financial records organized without the manual hassle.\n- **Wire Tracking**: Transparency at each step of the payment process.\n\n**Why Choose Levro?**\nFor businesses with international customers, employees, or vendors, Levro offers a seamless experience. Their platform is not just about payments; it’s built around automation and integration, designed to simplify workflows and allow you to focus on what really matters—growing your business.\n\n**Unique Selling Points**  \n1. **Significantly Reduced Costs**: Levro's lower exchange rates can translate into massive savings for companies that operate globally.\n2. **User-Friendly Interface**: Automation features make it easy to send bulk payments, ensuring all processes are user-friendly.\n3. **Simple Onboarding**: Levro's setup process is designed to be quick and straightforward, enabling companies to begin using their services within days.\n4. **Security and Compliance**: Built on industry security standards like SOC 2 and ISO 27001, Levro prioritizes customer data and funds security.\n\n**Integration and Support**  \nLevro integrates seamlessly with accounting software like Quickbooks and Xero, helping businesses maintain accurate financial records without extra effort. They provide extensive resources, including a blog and case studies showcasing how they make life easier for companies of all sizes.\n\n**Team and Vision**  \nWith Dalton Caldwell as their Group Partner at Y Combinator, Levro brings considerable expertise to the fintech space. The team, though small, is driven by a clear mission: to make multicurrency accounts and international payments not just accessible but valuable for businesses across the globe.\n\n**Contact and More Information**  \nIf you’re curious about how Levro can streamline your business payments and help you save costs, head to their website at [levro.com](https://www.levro.com) or reach out directly at founders@levro.com.  \n\nIn a world where international transactions can be a hurdle, Levro is here to remove the barriers, letting you focus on conquering new markets instead of wrestling with currency exchange.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/c4f7158e5dacf203bfb99f2f5319458286dcf8c8.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191506Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=78fc1547863f73e0923839ee345358e87df71dcf26e13615d6a90e684fb6a797",
    "social_links": [
        "https://www.linkedin.com/company/levro/"
    ],
    "logo_path": "data/logos\\Levro_logo.png"
}