{
    "links": "https://www.ycombinator.com/companies/lifeat",
    "name": "LifeAt",
    "headline": "One tool to supercharge your productivity.",
    "batch": "W22",
    "description": "LifeAt is your space to focus and complete tasks. Our mission is to help the 100M+ knowledge workers get into their flow state with video content and task management. Our customers get through their daily tasks twice as fast while feeling great at the end of the day!\r\n\nWell funded by Meta (Facebook), Line, Y Combinator, Goodwater, and other top VCs. Loved by over 1M+ users across the world and shared by over 500K+ followers across Tiktok/Instagram/Twitter. Come shape the future of focus and productivity!",
    "activity_status": "Active",
    "website": "https://lifeat.com",
    "founded_date": 2021.0,
    "team_size": 6.0,
    "location": "Seattle, WA",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:consumer; industry:productivity; location:seattle",
    "founders": [
        {
            "name": "Devin Ajimine, Founder/CEO",
            "description": "Created productivity and prosumer products that have been used by over 10+ million users. Built a following on my personal account to 30K+ and companies accounts to 300K+. \n\nAs a creator I worked with brands like Google, Dropbox, The Browser Company, Notion, Canva, and more leading to 100M+ views on my videos.\n\nSurfer dude from Hawaii. Forbes 30u30.",
            "linkedin": "https://www.linkedin.com/in/devinajimine/"
        }
    ],
    "status": true,
    "generated_description": "**Company Overview: LifeAt**\n\nLifeAt is a productivity tool founded in 2021, aimed squarely at knowledge workers. It's a sort of digital sanctuary—one that combines task management and immersive ambiance to help users tap into their focus flow.\n\n### Mission\nLifeAt’s mission is clear: to supercharge productivity for the 100 million-plus knowledge workers out there. By providing both a task management system and a visually appealing workspace, it helps folks complete their daily tasks faster and with greater satisfaction.\n\n### Background\nOriginally conceived as a space to help users focus and tackle tasks, LifeAt quickly garnered attention and launched into wider markets. Backed by notable investors including Meta (formerly Facebook), Y Combinator, and others, LifeAt has rapidly scaled, attracting over 1 million users globally and enjoying a vibrant community of over 500,000 followers across platforms like TikTok and Instagram.\n\n### Key Features\n- **Focus Mode**: Designed to immerse you in your work, removing distractions and encouraging deep focus.\n- **Virtual Spaces**: Offers customizable environments where users can choose work ambiances that suit their tasks.\n- **Pomodoro Timer**: A time management tool that leverages the Pomodoro Technique to boost productivity.\n- **Task and Calendar Management**: Users can manage both work and personal tasks seamlessly.\n- **Synced Co-working**: An innovative feature allowing real-time collaboration with others, enhancing accountability and collective productivity.\n\n### Team & Culture\nBased in Seattle, WA, LifeAt operates with a small team of six employees, cherishing a startup culture that encourages creativity and innovation. Their approach is supported by the science of Attention Restoration Theory (ART), asserting that a well-designed workspace can significantly enhance focus and productivity.\n\n### The Appeal\nLifeAt isn’t just another tool; it’s a movement towards a more productive and satisfying work life. Users swear by its capabilities, expressing a profound appreciation for how it transforms their workspace into something that cultivates happiness and focus, especially during low-energy moments like the post-lunch slump.\n\n### Call to Action\nFor those looking to elevate their productivity game, LifeAt promises not just tools, but a complete ecosystem designed to help you thrive. Whether you’re a freelancer, student, or part of a larger organization, LifeAt positions itself as your partner in creating a more organized, enjoyable, and productive work experience.\n\nJoin the movement and learn more at [LifeAt](https://lifeat.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/cca2a4358311d5012559ed6006270423f9de7dc3.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191507Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=43e0b407e86b1cec3f5adc06f3265b4366e96484b9e8427833ce4565c89c65eb",
    "social_links": [
        "https://www.linkedin.com/company/lifeat",
        "https://twitter.com/lifeatspaces",
        "https://www.crunchbase.com/organization/lifeat"
    ],
    "logo_path": "data/logos\\LifeAt_logo.png"
}