{
    "links": "https://www.ycombinator.com/companies/lifestylerx",
    "name": "LifestyleRx",
    "headline": "Virtual Care for Type 2 Diabetes Reversal",
    "batch": "S23",
    "description": "LifestyleRx delivers insurance-covered virtual care for Type 2 Diabetes reversal.  Our doctors guide patients through lifestyle changes to reverse the underlying process of diabetes.",
    "activity_status": "Active",
    "website": "https://lifestylerx.io/",
    "founded_date": 2022.0,
    "team_size": 9.0,
    "location": "White Rock, Canada",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:health-tech; industry:telehealth; industry:healthcare; industry:health-&-wellness",
    "founders": [
        {
            "name": "Jason Kerkvliet, Founder",
            "description": "Founder and CEO, LifestyleRx.  \nRecovering EMR founder, Princeton grad, delivering Type 2 Diabetes reversal to thousands of patients!",
            "linkedin": "https://linkedin.com/in/jason-kerkvliet-292685107"
        },
        {
            "name": "Brendan Byrne, Founder",
            "description": "Founder and Chief Medical Officer, LifestyleRx.\nLifestyle medicine physician and serial entrepreneur.\nHusband, father (x3), runner, skier and outdoors enthusiast.",
            "linkedin": "https://linkedin.com/in/brendan-byrne-17274b"
        },
        {
            "name": "Jack Hilliard, Founder",
            "description": "Seasoned CPA with years of experience growing, scaling and exiting tech-based companies.",
            "linkedin": "https://linkedin.com/in/jackmhilliard"
        },
        {
            "name": "Daniel Pfingstgraef, Founder",
            "description": "Founder and CTO at LifestyleRx.\nBuilt my first EMR when I was 14 for my parent's audiology practice. Studied Computer Science at Western University (London, ON).",
            "linkedin": "https://linkedin.com/in/pfingstgraef"
        }
    ],
    "status": true,
    "generated_description": "### LifestyleRx Overview\n\n**LifestyleRx** is a health-tech company founded in 2022, based in White Rock, Canada, and part of the Y Combinator Batch S23. Its mission centers around providing virtual care aimed at reversing Type 2 Diabetes through lifestyle changes guided by medical professionals. With a small but dedicated team of nine employees, LifestyleRx has quickly established itself in the telehealth and healthcare sectors as a promising solution for managing and potentially reversing diabetes.\n\n#### Approach to Diabetes Reversal\nAt the core of LifestyleRx's program is a structured, physician-led, fully virtual 12-week course. Patients across British Columbia, Alberta, and Ontario can access this program at no cost, fully covered by provincial health plans. The program emphasizes the **4+2 Diabetes Reversal Strategy**, focusing on six key lifestyle changes involving diet, light exercise, sleep, and stress management. Notably, the approach avoids calorie counting and extreme dietary restrictions, relying instead on sensible eating and moderate physical activity tailored to individual capabilities.\n\n#### How It Works\n- **Virtual Group Sessions**: Patients participate in weekly group sessions with a physician, discussing struggles and successes in a supportive environment.\n- **Personalized Support**: Each participant receives individual consultations with a doctor from their province to tailor the program to their health history and goals.\n- **Educational Resources**: The program includes video lessons, self-assessments, and personal health reports to help patients understand their progress.\n\nLifestyleRx is anchored in clinical evidence that suggests Type 2 Diabetes progression can be reversed by altering lifestyle factors. The emphasis on gradual, sustainable changes encourages participants to adopt healthier habits that stick long after the program concludes.\n\n#### Impact and Testimonials\nPatients like Bob, age 73, and Alicia, age 57, have shared their success stories, highlighting dramatic improvements in blood sugar levels and overall health after participating in the program. Feedback emphasizes a wealth of newfound knowledge about diabetes management that many had not encountered in traditional medical settings.\n\n#### Community and Professional Outreach\nBeyond direct patient care, LifestyleRx actively engages with health professionals, providing resources for primary care providers and pharmacists to refer patients into their program. This collaborative approach extends their reach and potentially enhances patient outcomes across the community.\n\n#### Conclusion\nLifestyleRx is paving the way for a new model of care, leveraging technology to provide accessible and effective treatment options for those battling Type 2 Diabetes. With its evidence-based approach, virtual setup, and focus on lifestyle modifications, it represents a promising shift towards preventive healthcare that could inspire a broader revolution in chronic disease management. For more information, visit their website at [lifestylerx.io](https://lifestylerx.io/).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/1c9c3578067bbf5a171040466b603d0f05aae7a4.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191507Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=82c894a4f7aa8cdf5dfd0e75ed6e24a1d1e70bc8dafeb3ee893a9541de539830",
    "social_links": [],
    "logo_path": "data/logos\\LifestyleRx_logo.png"
}