{
    "links": "https://www.ycombinator.com/companies/lifted",
    "name": "Lifted",
    "headline": "Smartwatch powered coaching to improve teams sustainable performance",
    "batch": "W22",
    "description": "NudgeLabs is a service that helps enterprises improve team performance and employee retention. We pair each employee with an online coach and use smart watch data to improve their physical and mental health.",
    "activity_status": "Active",
    "website": "https://www.lifted.work",
    "founded_date": 2021.0,
    "team_size": 9.0,
    "location": "Stockholm, Sweden",
    "group_partner": "Gustaf Alstromer",
    "group_partner_yc": "https://www.ycombinator.com/people/gustaf-alstromer",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:mental-health-tech; industry:biometrics",
    "founders": [
        {
            "name": "Magnus Liungman, Founder",
            "description": "My purpose in life is to improve health and wellbeing. Prior to founding NudgeLabs I was CEO and founder of Doctrin.com. Unfortunately, three years in as CEO I had a burnout despite working with doctors and reporting as a promoter in our engagement tool. NudgeLabs is sort of my answer to the question: what could have prevented my burnout. \n\nBefore Doctrin I was Country Manager for a Swedish Healthtech company in the UK and an engagement manager at McKinsey & Co",
            "linkedin": "https://www.linkedin.com/in/magnus-liungman/"
        }
    ],
    "status": true,
    "generated_description": "### Lifted: Revolutionizing Workplace Health and Performance\n\nFounded in 2021 and originally known as NudgeLabs, Lifted is making waves in the realm of workplace wellness. Nestled in Stockholm, Sweden, this innovative company has a mission: to enhance team performance and employee retention through smart, wearable technology combined with professional coaching. They became a part of Y Combinator's Batch W22, which attests to their potential to disrupt the market.\n\n#### The Concept\n\nLifted leverages data from smartwatches to underpin their coaching services. Imagine each team member paired with a personal coach who not only provides motivation but also tailors strategies based on biometric data—like sleep quality, stress levels, and overall activity. This holistic approach isn't just about pushing employees harder; it's about fostering a more sustainable, healthy work environment where individuals can thrive both mentally and physically. \n\nThe company's current offerings—dubbed PeakPath—focus on personalized coaching, stress management, and better sleep, all powered by insights from wearables. Whether it’s helping consultants enhance their performance through improved sleep or reducing workplace stress, Lifted is tackling a fundamental issue: productivity 101 relies on health 101.\n\n#### How It Works\n\nHere's a simplified breakdown of their process:\n\n1. **Assessment**: Employees complete a self-assessment and wear an Oura ring to gather data about their health.\n2. **Personal Coaching**: After review, an assigned coach collaborates with each employee to devise a personalized plan targeting sleep and stress management.\n3. **Tracking Progress**: Employees use an app to track their habits, gaining insights into how daily choices impact their wellbeing.\n4. **Ongoing Support**: Coaches check in weekly, helping employees stay aligned with their wellness goals.\n\nThis method proves effective. Lifted boasts an impressive adoption rate—80% on average, with some teams reaching nearly 100%. Retention after six months is high, at 93%.\n\n#### Achievements and Future Outlook\n\nLifted’s commitment to enhancing mental health has pegged it as a key player in the mental health tech sector, appealing to a variety of organizations—from Fortune 500 companies to private equity firms. Their approach is not just anecdotal; metrics show a substantial increase in employees’ mental wellbeing, with those reporting \"very high mental wellbeing\" rising from 7% to 25% in just six months.\n\nWith a dedicated team of nine and acted upon the governance of partners like Gustaf Alstromer, Lifted is poised to grow rapidly. They are not just offering coaching; they are fostering cultures that prioritize health at work, making them necessary stakeholders in the new age of employment.\n\nIn sum, Lifted is proving that the future of work shouldn’t just revolve around grind culture; it should focus on balance, health, and sustainable performance. Discover more about them at [Lifted’s website](https://www.lifted.work).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/23fdb047b12743e1b0e21011bc6603fb38847799.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191506Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=88c939ea64d123476a356b36b712868ce46640a640921296ef00c4603f4ce185",
    "social_links": [
        "https://www.linkedin.com/company/nudge-labs/",
        "https://twitter.com/LabsNudge"
    ],
    "logo_path": "data/logos\\Lifted_logo.png"
}