{
    "links": "https://www.ycombinator.com/companies/lightmeter",
    "name": "Lightmeter",
    "headline": "Managed Sales Email Delivery For Cold Outreach",
    "batch": "W22",
    "description": "Lightmeter is turn-key email outreach infrastructure for startups, combining network, platform, and expert advice. It integrates with sales tools like Apollo, replacing Google and Microsoft for email delivery. No change in tooling or workflow required. Lightmeter gets mail into inboxes, scalably and sustainably, while transparently reporting on performance. Plans from 50 to 7,500 outreach emails per day.",
    "activity_status": "Active",
    "website": "https://lightmeter.io",
    "founded_date": 2022.0,
    "team_size": 5.0,
    "location": "London, United Kingdom",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:delivery; industry:sales; industry:email",
    "founders": [
        {
            "name": "Sam Tuke, Founder",
            "description": "Sam Tuke is Founder and CEO of Lightmeter, the sales email delivery platform. He founded his first Open Source software business age 17, shipping Linux computers he assembled himself. From 2015-2019 he was CEO of phpList, the Open Source Mailchimp alternative, building a base of 10k SaaS customers, and sending 28 bn emails yearly. In 2019 he created mailserver automation app Lightmeter, and two years later used it to launch the first dedicated sales email delivery service of the same name.",
            "linkedin": "https://www.linkedin.com/in/sam-tuke/"
        }
    ],
    "status": true,
    "generated_description": "Lightmeter is a promising startup founded in 2022, based in London and part of Y Combinator's Winter 2022 batch. Their mission is straightforward yet essential: to manage sales email delivery specifically for cold outreach. In essence, they provide a turn-key email outreach infrastructure that integrates seamlessly with existing sales tools—think Apollo—while replacing the traditional reliance on platforms like Google and Microsoft.\n\nWhat sets Lightmeter apart is its unique, independent email delivery network tailored purely for sales purposes. This means that companies can engage in email outreach without the risks of getting their main office emails flagged or suspended. They allow users to scale their outreach efforts significantly with plans ranging from 50 to 7,500 emails per day, all while offering transparent reporting on performance.\n\nLightmeter's key advantages include maintaining high deliverability rates, preventing spam issues, and ensuring a strong domain reputation through sophisticated warmup processes. Their analytics platform provides insights into where emails land and helps users optimize their outreach strategies effectively.\n\nThe company employs a small team of five but punches above its weight in client success, showcased by testimonials highlighting significant increases in email open and response rates after switching to Lightmeter. Clients span various sectors, including B2B startups, marketplaces, and go-to-market agencies, all looking for scalable solutions to boost their outreach.\n\nGiven its strong foundation and backing from Y Combinator, Lightmeter is well-positioned to redefine how startups approach email outreach, bringing in expertise that goes beyond mere promises. For anyone interested in maximizing their email outreach efforts without changing existing workflows, Lightmeter might just be the partner to consider. \n\nFor more information, you can visit their website at [lightmeter.io](https://lightmeter.io).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/93329c1e6bc488632ea3ab4d45f22e9e0ba12898.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191507Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=a8684724becb2aba93c3d4bf9f9ba0e5f1579dfb43db1d989c017ca0dc99c3e6",
    "social_links": [
        "https://www.linkedin.com/company/lightmeter",
        "https://twitter.com/getlightmeter",
        "https://www.crunchbase.com/organization/lightmeter"
    ],
    "logo_path": "data/logos\\Lightmeter_logo.png"
}