{
    "links": "https://www.ycombinator.com/companies/litnerd",
    "name": "Litnerd",
    "headline": "Reading + Writing Club App for Kids",
    "batch": "S21",
    "description": "Litnerd is a kids reading + writing club app that grew by 14x this past school year. Think of us as a modern-day Scholastic, with a heavy IP play. We create original IP with our community + partner brands -> turn them into books, media and learning curriculum, layered with an AI personalized tutor to help kids learn to read and write in a personalized and engaging way.\r\n\nOur product format is a Social and Gamified - with a live weekly community meetup and monthly e-tournaments. \r\n\n- And it works! Litnerd 4x improved the pass rate of students on their annual state Reading (ELA) exam.\r\n- STICKY: Kids spend 10-20 minutes on the Litnerd app OUTSIDE of classroom time.\r\n- KID AUTHORS: Kids are the authors of the books and Litnerd AI helps illustrate + publish the book.\r\n- Built on the Science of Reading\r\n- Original IP: all books, media and courseware is original content created and published by Litnerd.",
    "activity_status": "Active",
    "website": "https://litnerd.com/",
    "founded_date": 2021.0,
    "team_size": 6.0,
    "location": "New York",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:education; industry:saas; industry:media; industry:kids; location:new-york",
    "founders": [
        {
            "name": "Anisa Mirza, Founder/CEO",
            "description": "CEO & Founder at Litnerd. Building the next gen Scholastic (reading + writing club app for kids, where the books are written by kid authors!)\n\n- Anisa Mirza is a two-time Y Combinator and venture-backed founder. \n- She is also a Forbes 30 Under 30 honoree. \n- As an immigrant to America, running a women and minority owned business, Anisa takes special pride in seeing the impact Litnerd has in producing superior learning outcomes for kids.\n- Bootstrapped first startup from 0 to 2Mill ARR (exited)",
            "linkedin": "https://www.linkedin.com/in/anisa-mirza-2781a045/"
        }
    ],
    "status": true,
    "generated_description": "**Litnerd: Sparking Creativity and Learning in Young Minds**\n\nFounded in 2021 and part of Y Combinator's S21 batch, Litnerd is an innovative educational platform based in New York that’s revolutionizing the way kids engage with reading and writing. With the mission of being a modern-day Scholastic, Litnerd has grown impressively—by 14x over the last school year. Yet what distinguishes them is not just their growth; it's their approach that combines literacy with creativity, technology, and fun.\n\n**Unique Approach to Learning:**\nLitnerd creates original intellectual property (IP) alongside its community and partner brands. From this collaboration, they develop books, media, and learning curriculums, all enhanced by an AI-driven personalized tutor designed to make reading and writing not just educational but engaging.\n\n**How It Works:**\nThe Litnerd app is a gamified, social platform where kids actively participate in the reading process. The app incorporates live weekly community meetups and monthly e-tournaments, turning learning into a dynamic experience. Kids aren't just passive consumers; they become \"Kid Authors,\" co-creating and publishing their books with the help of Litnerd’s AI.\n\n**Proven Impact:**\nThe results have been significant—students using Litnerd showed a fourfold increase in the pass rate on annual state Reading (ELA) exams. On average, kids engage with the app for 10-20 minutes outside of classroom time, underscoring its stickiness. The curriculum is firmly grounded in the Science of Reading, aligned with Common Core Standards, and aims to advance key skills like comprehension, vocabulary, phonics, and fluency.\n\n**Community and Connectivity:**\nLitnerd actively connects with schools and families, offering programs like the Young Authors Program that includes live assemblies, guided writing sessions, and real publishing opportunities for students. Over 14,000 students have already benefited from Litnerd in their classrooms, and the feedback is overwhelmingly positive—92% of kids reported that Litnerd made reading fun.\n\n**A Bright Future:**\nWith a compact team of six, Litnerd is not just building an app; it's cultivating a community of young readers and writers. The blend of education and entertainment, backed by a solid foundation of research-based practices, showcases Litnerd's commitment to transforming literacy education. \n\nIf you're interested in leveling up your child's reading experience, check out their offerings at [Litnerd.com](https://litnerd.com).\n\n**Contact Information:**\n- **Phone**: (929) 203 - 4608\n- **Email**: contact@litnerd.com\n\nWhether you're a parent looking to enrich your child's education or an educator seeking innovative tools for your classroom, Litnerd is paving the way for the future of learning.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/fc7092000f00e9e9f6d9dc5e8b7bea11cf0cbdf5.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191509Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=18bc3459fd4a4ad34d4cf02234f791115d16890934538241d951e7fda207b3b2",
    "social_links": [
        "https://www.linkedin.com/company/getlitnerd/",
        "https://twitter.com/getlitnerd",
        "https://www.facebook.com/getLitnerd/",
        "https://www.crunchbase.com/organization/litnerd"
    ],
    "logo_path": "data/logos\\Litnerd_logo.png"
}