{
    "links": "https://www.ycombinator.com/companies/liv-labs-inc",
    "name": "Liv Labs",
    "headline": "Solutions for continence self-care",
    "batch": "S21",
    "description": "Liv Labs is a consumer healthtech company making modern solutions for incontinence. 29 million American women worry about leaking pee in public: an $8B market. Liv Labs is developing convenient self-care versions of proven-effective clinical treatments, including adaptive health coaching software and a novel continence pessary. Device inventor, Carly Price, reimagined the humble pillow for Casper and now leads digital retail design at Walmart. Company CEO, Melody Roberts, incubated digital service experiences now scaling globally at McDonald’s and Panera. We’ve raised $2.6M, including NIH and NSF grants, based on stellar effectiveness data and user feedback like, “With this, surgery is off the table.” US, European and Hong Kong utility patents have issued; Australia will soon. Our FDA-reviewed clinical trial launched at Northwestern University and continues at the OSU and UAB.",
    "activity_status": "Active",
    "website": "http://www.livlabsfitness.com",
    "founded_date": 2017.0,
    "team_size": 3.0,
    "location": "Chicago, IL",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:consumer-health-services; industry:health-tech; industry:medical-devices; industry:digital-health; industry:women's-health",
    "founders": [
        {
            "name": "Melody Roberts, Founder",
            "description": "Melody is a career innovator of consumer conveniences. She is an optimist with a lifelong passion for improving daily life through better, more affordable products and services. Formerly: Panera, McDonald's, IDEO, Smart Design, Cooper-Hewitt. Education: Illinois Tech (MDes) and Yale University (BA). Colorado native.",
            "linkedin": "https://www.linkedin.com/in/melodyannroberts/"
        },
        {
            "name": "Carly Price, Founder",
            "description": "Highly accomplished innovation leader and champion of human-centered design, with a passion for creating delightful products, services, and brand experiences. Has a proven track record of using insight-driven processes to uncover opportunities, drive concept generation and prototyping, and bring award-winning, iconic, useful, and beautiful consumer products and experiences to market.",
            "linkedin": "https://www.linkedin.com/in/pricecarly/"
        }
    ],
    "status": true,
    "generated_description": "### Liv Labs: Redefining Continence Self-Care for Women\n\nFounded in 2017, Liv Labs is a Chicago-based consumer health tech company dedicated to empowering women through innovative solutions for incontinence—a significant yet often overlooked issue that affects around 29 million American women. With the incontinence market valued at approximately $8 billion, Liv Labs is stepping in to alleviate the embarrassment and challenges women face daily.\n\n**Mission**  \nLiv Labs aims to make self-care for incontinence both simple and effective. Their approach revolves around developing modern solutions that are not just clinically proven but also convenient for everyday use. The company’s flagship offerings include adaptive health coaching software and a novel continence pessary, designed to help women regain control without the stigma traditionally associated with such medical conditions.\n\n**Leadership**  \nThe team behind Liv Labs brings rich expertise to the table. Carly Price, the device inventor and a visionary behind Liv Labs, previously revolutionized the pillow industry with Casper. She now leads the digital retail design efforts at Walmart. Meanwhile, CEO Melody Roberts has a history of incubating successful digital service experiences on a global scale with brands like McDonald’s and Panera. Their combined expertise fuels Liv Labs' innovation.\n\n**Progress and Validation**  \nLiv Labs has garnered considerable attention, raising $2.6 million through prestigious grants from the NIH and NSF. Their robust clinical trial, reviewed by the FDA, is currently underway at Northwestern University with further trials at Ohio State University and the University of Alabama at Birmingham. They hold several utility patents in the US, Europe, and Hong Kong, with more pending in Australia.\n\n**Services Offered**  \nLiv Labs primarily revolves around their **K+ Training Intensive**, a comprehensive 21-day self-care program that combines:\n- Three private online consultations with pelvic health experts\n- Access to tailored exercise videos \n- Daily tips and motivation from assigned coaches\n\nThe ongoing support helps participants address the underlying issues of continence while easily fitting into their daily routines—no invasive tests or clinic visits necessary.\n\n**Community and Resources**  \nThe company's community initiative, dubbed \"The Nobody Talks Club,\" is designed to break the silence surrounding incontinence, allowing women to share experiences and foster a supportive environment. Liv Labs also provides an array of resources, including product offerings and self-care literature, all directed at helping women manage their health confidently.\n\nIn essence, Liv Labs is more than just a health tech startup; it's a movement aimed at transforming a traditionally sensitive topic into a matter of public discussion and personal empowerment. For women who wish to \"skip, hop, lift, run, and laugh without a second thought,\" Liv Labs is a welcome ally.\n\nFor more on their solutions, visit [Liv Labs](http://www.livlabsfitness.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/58c52cf4c93473ed359b26c94413c6aa0e75d422.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191510Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=c72c2a6d269ec992a49fe16cad2c1b2d0035a87854d0322ffb5269f9d0e89a3b",
    "social_links": [
        "https://www.linkedin.com/company/liv-labs/",
        "https://twitter.com/livlabsfitness",
        "https://www.facebook.com/livlabsfitness",
        "https://www.crunchbase.com/organization/liv-labs"
    ],
    "logo_path": "data/logos\\Liv_Labs_logo.png"
}