{
    "links": "https://www.ycombinator.com/companies/lively-inc",
    "name": "Lively, Inc.",
    "headline": "Modern employee benefits & health savings account (HSA) provider",
    "batch": "W17",
    "description": "Out-of-pocket healthcare costs are skyrocketing and every day, people all across America are forced to make difficult decisions about their health. \r\n\nLively is the benefits solutions provider that gets it right. We designed our solutions to take the guesswork out of managing benefits. And our innovative features are built to simplify benefits administration and evolve with your business. Managing wellness and wealth takes more than a series of transactions. By combining robust features with unparalleled service, we make benefits administration effortless, even when time and energy are limited. Experience benefits administration as it should be with Lively.\r\n\nGo to www.livelyme.com to learn about how HSAs other modern employee benefits can help you and your team.",
    "activity_status": "Active",
    "website": "https://livelyme.com",
    "founded_date": 2016.0,
    "team_size": 195.0,
    "location": "San Francisco",
    "group_partner": "Dalton Caldwell",
    "group_partner_yc": "https://www.ycombinator.com/people/dalton-caldwell",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:health-tech; industry:hr-tech; location:san-francisco-bay-area",
    "founders": [],
    "status": true,
    "generated_description": "Lively, Inc., founded in 2016 as part of Y Combinator's Batch W17, is shaking up the employee benefits space with a focused mission to simplify health savings accounts (HSAs) and modern employee benefits. Based in San Francisco with a team of 195, Lively understands the burden of rising out-of-pocket healthcare costs faced by many Americans. Their approach isn’t just about transactions; it’s about seamlessly integrating benefits management into the lives of employees and employers alike.\n\nLively offers a suite of solutions that includes HSAs, Flexible Spending Accounts (FSAs), Health Reimbursement Arrangements (HRAs), and more, all delivered with a tech-forward, user-friendly platform. They aim to eliminate guesswork in benefits administration, ensuring that companies can efficiently manage wellness and financial health without additional hassle. Their technology is built for today’s needs—flexible, adaptive, and straightforward.\n\nWhat sets Lively apart is not just their robust offerings, but also their commitment to outstanding customer support. They boast customer satisfaction ratings that are three times higher than the industry average, reflecting their focus on user experience and service. Over 98% of employers who choose Lively continue to partner with them, underscoring their effectiveness and reliability.\n\nLively also champions transparency in pricing. For individuals, their HSA comes with zero fees—a rarity in the industry. For businesses, the cost is just $2.95 per employee per month (with a minimum monthly fee), making it an excellent value for comprehensive benefits management.\n\nIn a world where employee benefits are rapidly evolving and becoming increasingly essential, Lively offers a reliable solution that's designed to enhance satisfaction for both employees and employers. \n\nTo dive deeper into how Lively can align with your health savings and benefits strategy, visit their website at [Lively](https://livelyme.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/2fbb12cbc79d4d2cf8e503155a004663897f182e.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191510Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=c1ded363ddcf3f04190f267510422f88c425004ce3b56ae31758158a6a0196bd",
    "social_links": [
        "https://www.linkedin.com/company/livelyhsa",
        "https://twitter.com/Livelyhsa",
        "https://www.facebook.com/livelyhsa/"
    ],
    "logo_path": "data/logos\\Lively,_Inc._logo.png"
}