{
    "links": "https://www.ycombinator.com/companies/liveflow",
    "name": "LiveFlow",
    "headline": "LiveFlow empowers finance leaders with real-time insights into everyâ\u0080¦",
    "batch": "W21",
    "description": "LiveFlow turns your Google Sheets and Excel spreadsheet into a live FP&A dashboard in minutes.",
    "activity_status": "Active",
    "website": "https://www.liveflow.com",
    "founded_date": 2021.0,
    "team_size": 47.0,
    "location": "New York",
    "group_partner": "Dalton Caldwell",
    "group_partner_yc": "https://www.ycombinator.com/people/dalton-caldwell",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:saas; industry:analytics; location:new-york",
    "founders": [
        {
            "name": "Lasse Kalkar, Founder",
            "description": "I'm Lasse - I love to build companies. Before LiveFlow, I was Head of Growth, Nordics at Revolut where I led Growth and Market Launches in the Nordics. I also worked at Nova Founders Capital where we built an executive conference and last, I built a micro-investing app that allowed you to round up your spare change and invest it in crypto (Acorns for crypto), but that failed :)",
            "linkedin": "https://www.linkedin.com/in/lassekalkar/"
        },
        {
            "name": "Anita Koimur, Founder",
            "description": "Anita is the COO at LiveFlow. Before starting the venture, Anita was in charge of Business Development at Revolut Rewards. She consolidated the position of Rewards as a data-driven customer acquisition platform for partners and a customer engagement solution for Revolut. Anita led the product rollout to thirteen markets across EMEA, the United States, and APAC.",
            "linkedin": "https://www.linkedin.com/in/anitakoimur/"
        }
    ],
    "status": true,
    "generated_description": "LiveFlow is a promising fintech startup founded in 2021, nestled in the bustling heart of New York City and part of the prestigious Y Combinator Batch W21. With a mission to empower finance leaders, LiveFlow harnesses the power of real-time insights, allowing teams to navigate their financial landscapes with unprecedented clarity.\n\nInitially, LiveFlow set out to transform static Google Sheets and Excel spreadsheets into dynamic FP&A dashboards in mere minutes. Fast forward to today, and the company has raised a robust $13.5 million in Series A funding led by Valar Ventures, pushing innovation further with the launch of **LiveFlow Next**—aimed specifically at revolutionizing the financial reporting process.\n\nComprising a skilled team of 47, LiveFlow develops solutions that tackle the inefficiencies prevalent in finance workflows. Their product suite includes tools designed for Google Sheets, Excel, consolidation of multiple entities, and professional dashboards. This flexibility allows finance teams to automate manual tasks, thereby speeding up the financial closing process from days to mere minutes, a change that nearly every CFO would welcome.\n\nFeedback from clients underscores LiveFlow’s impact, with testimonials highlighting significant time savings—like reducing monthly consolidation from ten days to just three. Their platform not only enhances the accuracy of data but also enables finance departments to focus on what truly matters: analysis and strategic insights rather than getting bogged down in cumbersome data management.\n\nIn a world where the demand for agility in finance has never been higher, LiveFlow positions itself as the go-to solution for finance teams looking to streamline operations and heighten decision-making efficiency. For those interested in seeing this product in action, LiveFlow offers demos on their website, where you can also find a wealth of resources, including case studies, product guides, and a library of reporting templates.\n\nIn summary, if you’re a finance leader looking to ditch the headaches of traditional financial management for a more agile, automated, and insightful approach, LiveFlow might just be the tool you’ve been searching for. Check them out at [liveflow.com](https://www.liveflow.com) and see how they can transform your financial processes today.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/cedab3492bce0a3c4136886fdfa570a2e9fa2e07.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191511Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=e2cf38eed891449db91672c8694eefa0d0489d34547c10a909bd4a7f65c418a6",
    "social_links": [
        "https://www.linkedin.com/company/liveflow",
        "https://twitter.com/LiveFlow_com",
        "https://www.crunchbase.com/organization/liveflow"
    ],
    "logo_path": "data/logos\\LiveFlow_logo.png"
}