{
    "links": "https://www.ycombinator.com/companies/living-carbon",
    "name": "Living Carbon",
    "headline": "Plants that capture and store more carbon.",
    "batch": "W20",
    "description": "Public benefit company on a mission to fight climate change by genetically enhancing CO2 capture and storage in plants.",
    "activity_status": "Active",
    "website": "https://www.livingcarbon.com",
    "founded_date": 2019.0,
    "team_size": 40.0,
    "location": "Charleston, SC",
    "group_partner": "Gustaf Alstromer",
    "group_partner_yc": "https://www.ycombinator.com/people/gustaf-alstromer",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:synthetic-biology; industry:biotech; industry:climate; industry:agriculture",
    "founders": [],
    "status": true,
    "generated_description": "### Living Carbon: Pioneering Carbon Capture Through Enhanced Plants\n\nFounded in 2019 and hailing from Charleston, SC, Living Carbon is on a mission to combat climate change by genetically enhancing plants to capture and store more carbon dioxide (CO2). This innovative approach positions the company at the intersection of synthetic biology, biotechnology, climate science, and agriculture—their work is both cutting-edge and crucial for our planet's future.\n\nLiving Carbon initially started as a public benefit corporation, emphasizing its commitment to positive environmental impact. With a diverse and dedicated team of 40 employees, they are actively engaged in a range of initiatives aimed at restoring degraded land through innovative reforestation projects. Notably, they are now enrolling landowners to participate in these efforts to restore abandoned mineland and improve agricultural lands. By offering financial incentives to landowners, Living Carbon helps to rejuvenate ecosystems, support biodiversity, and generate sustainable income streams.\n\nOne of the standout components of Living Carbon’s strategy is their development of fast-growing poplar trees that significantly enhance biomass accumulation compared to traditional varieties. These custom-grown biomass feedstocks not only serve their carbon capture goals but also can be tailored to meet corporate supply chain needs.\n\nAdditionally, the company is advancing high-quality carbon removal projects across the United States, ensuring genuine benefits through rigorous methods known as true additionality with minimal leakage. This is complemented by their efforts to procure carbon credits, providing a market-based approach to incentivize carbon reduction.\n\nSupported by their participation in Y Combinator's W20 batch, Living Carbon is positioned to leverage key partnerships—including one with Gustaf Alstromer, a Group Partner at Y Combinator—to escalate their impact and reach within the biotech landscape. \n\nAs climate change continues to loom large, the work of Living Carbon represents a beacon of hope, demonstrating that with innovative thinking and effective application of genetic technologies, we can enlist nature itself as a solution to one of humanity's greatest challenges. For more insights and updates on their transformative work, you can visit their website at [Living Carbon](https://www.livingcarbon.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/bd51161782562af54e54337304752c6a85427836.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191510Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=d11342a352a2334dd586ac0ce4ad3db7fbbe268a708dee6f746577c977dc23e9",
    "social_links": [
        "https://www.linkedin.com/company/living-carbon",
        "https://twitter.com/living_carbon",
        "https://www.facebook.com/Living-Carbon-100323281604633/"
    ],
    "logo_path": "data/logos\\Living_Carbon_logo.png"
}