{
    "links": "https://www.ycombinator.com/companies/lofty",
    "name": "Lofty",
    "headline": "Building the NASDAQ for Real Estate.",
    "batch": "S19",
    "description": "Lofty is a marketplace that let's anyone sell a house to investors online. Instead of the typical real estate transaction where one seller sells to one buyer, Lofty is much more flexible.\r\n\nSellers fractionalize their equity ownership in the property into smaller units, so that anyone can buy a portion for as little as $50, allowing access to one of the best asset classes for people who have previously been locked out. Sellers can also sell a portion of their equity (starting at just 10%) instead of the entire property or create customized HELOC structures.\r\n\nInvestors can browse a variety of individual real estate properties ranging from commercial strip malls, a HELOC in someone's house, Airbnbs, to a single-family rental properties, and directly purchase ownership in these properties in under 5 minutes. There is no lockup period. Users can constantly trade these ownerships with others on the marketplace.\r\n\nInvestors truly legally own the properties they invested in and co-manage it with other investors through an online governance program. Owners have so far voted on how to handle various repairs, delinquent tenants, the sale of the underlying property, and much more.\r\n\nLofty never custodies or handles user funds or assets. Through smart-contracts on the blockchain, all transactions are directly peer-to-peer.\r\n\nIf we succeed, we'll have built the NASDAQ for real estate and transformed how real estate is bought and sold in the USA.",
    "activity_status": "Active",
    "website": "https://www.lofty.ai/",
    "founded_date": 2018.0,
    "team_size": 7.0,
    "location": "Miami, FL",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:crypto-web3; industry:real-estate; industry:investing",
    "founders": [
        {
            "name": "Max Ball, Founder",
            "description": "Co-Founder at Lofty (YC S19)",
            "linkedin": "https://www.linkedin.com/in/maxball/"
        },
        {
            "name": "Jerry Chu, Founder",
            "description": "USC alum, former Barclays Risk Management Analyst, and self-taught full-stack developer. I'm currently the CEO.\n\nYC Badge: 0xbc2e7da603f3dec73f658971c045c3023fb8975a",
            "linkedin": "https://www.linkedin.com/in/jerry-chu/"
        }
    ],
    "status": true,
    "generated_description": "**Lofty: The NASDAQ for Real Estate**\n\nFounded in 2018 and part of Y Combinator's S19 batch, Lofty is on a mission to democratize real estate investing. Based in Miami, FL, with a nimble team of just seven employees, Lofty operates a marketplace that allows anyone to buy into real estate starting at just $50. It’s a game-changer for investors looking to enter what has traditionally been a high-barrier market.\n\n### How It Works\n\nLofty’s model breaks away from conventional one-to-one real estate transactions. Sellers can fractionalize their properties, allowing multiple investors to own shares. This flexible structure lets investors co-manage real estate assets via an online governance system. Participants have a real say in property management decisions, from handling repairs to deciding on selling the asset.\n\nInvestors access a diverse portfolio of properties, which could include everything from single-family homes to commercial properties and Airbnbs, all at the tip of their fingers. There's no lockup period; ownership can be traded directly between users through smart contracts over blockchain technology—meaning Lofty doesn’t handle or store any funds or assets, which enhances security and trust.\n\n### A Community-Driven Approach\n\nWhat’s particularly notable about Lofty is its commitment to community. Investors are not just passive participants; they interact and make decisions together about their investments. This dynamic opens a pathway for people who couldn't envision joining the real estate market—think millennials, working professionals, and even those simply seeking additional income streams.\n\n### The Financial Upside\n\nLofty promises quick returns. Investors begin earning rental income immediately, often within the same day of investment, and benefit from the appreciation of property values over time. This unique model not only fosters wealth-building but also ensures that the everyday person has the tools to build a sustainable financial future without the burdens typically associated with real estate ownership, such as expensive down payments or property management hassles.\n\n### Why Lofty Matters\n\nIn a world where rising property prices and stringent lending conditions have kept many from investing in real estate, Lofty stands out as a solution that seeks to change that narrative. Their vision of building the “NASDAQ for real estate” is ambitious, but with their distinctive approach, they might just reshape how we think about investment in this crucial asset class.\n\nWhether you’re an experienced investor or a novice looking to dip your toes in the real estate waters, Lofty offers an innovative pathway to not just observe, but actively participate and grow in this lucrative market. \n\nYou can explore more about their unique offerings on their website: [Lofty.ai](https://www.lofty.ai).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/3b51b67b09c38eb509c3d6bccb300a10d50c2db1.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191511Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=41d8b24f2fb3709f675a7dc333c877d1de46d0189ce9d3756c4fbdef380922bc",
    "social_links": [
        "https://www.linkedin.com/company/loftyai/",
        "https://twitter.com/lofty_ai"
    ],
    "logo_path": "data/logos\\Lofty_logo.png"
}