{
    "links": "https://www.ycombinator.com/companies/logica",
    "name": "Logica",
    "headline": "Visual, collaborative financial modeling software",
    "batch": "W21",
    "description": "Logica helps finance teams with forecasting & budgeting.  The software provides a drag and drop interface for building financial models that can be updated and shared in real time and connects with accounting and analysis tools for comparing plan vs actual.",
    "activity_status": "Active",
    "website": "https://logica.cloud",
    "founded_date": 2020.0,
    "team_size": 2.0,
    "location": "Omaha, NE",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:finops; industry:fintech; industry:saas",
    "founders": [
        {
            "name": "Carissa Castro, Founder",
            "description": "Carissa Castro is the co-founder and CEO of Logica, a visual, collaborative financial modeling platform for dynamic planning and forecasting.  Prior to this, she spent 10 years at Cargill in management and operations roles, and has extensive experience with financial modeling & analysis.  She graduated from the University of Nebraska-Lincoln with a BS in Chemical Engineering, and more recently completed an online certification in software development.",
            "linkedin": "https://www.linkedin.com/in/carissa-castro-3a6174b0/"
        },
        {
            "name": "Leandro Castro, Founder",
            "description": "Leandro is the co-founder and CPO of Logica, a software startup for visual financial modeling (YC-W21). Leandro was the co-founder and CEO of a deep tech engineering software company that was acquired by Siemens. He became an advisor to Anzu Partners, a VC/PE firm focused on breakthrough industrial and life sciences technology companies, and a member of Pipeline, a network of high-performing, midwestern, entrepreneurs.",
            "linkedin": "https://www.linkedin.com/in/lsdcastro/"
        }
    ],
    "status": true,
    "generated_description": "Logica, founded in 2020 and part of the Y Combinator Batch W21, is a nimble startup based in Omaha, Nebraska. With a small team of just two employees, Logica aims to revolutionize the way finance teams engage in forecasting and budgeting. Their mission centers on creating a visual, collaborative platform for dynamic financial modeling.\n\nThe software boasts an intuitive drag-and-drop interface that allows users to seamlessly build and update financial models in real time. This not only enhances collaboration but also ensures easy integration with key accounting and analytical tools for comparing projected finances against actual results. \n\nLogica serves a varied clientele, including mid-market finance teams, small to medium-sized businesses, and accounting firms needing fractional CFO services. They also accommodate project resource planning—an increasingly vital area in today's complex business landscape.\n\nKey features of Logica’s software include:\n\n- **Visual Modeling**: An innovative, patent-pending technology that helps users craft custom models quickly.\n- **Scenario Analysis**: Provides capabilities to create and assess multiple financial scenarios efficiently.\n- **Collaborative Planning**: Enables multiple team members to work together securely by sharing access to models and reports.\n\nTheir product offerings are structured in tiered subscription plans that cater to different business sizes—ranging from individual users and small teams to large enterprises, ensuring scalable solutions for all.\n\nLogica operates under tags like 'finops', 'fintech', and 'SaaS', indicating its position within the modern financial technology ecosystem. With backing from Y Combinator, the company is positioned well for growth, focusing on empowering businesses to tell their stories through data visualization and insightful analysis.\n\nFor more detailed insights on their offerings or to sign up for a trial, you can visit their [website](https://logica.cloud).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/3eca32d3e21180c8190bcfb858cac5f8fa3c252c.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191512Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=205a0323981eedff9d2f7fae6770a8c16a42a7dde16dc9ecc2e1c47b366b365c",
    "social_links": [
        "https://www.linkedin.com/company/logica-app",
        "https://twitter.com/logica_app",
        "https://www.facebook.com/logica.cloud.software/"
    ],
    "logo_path": "data/logos\\Logica_logo.png"
}