{
    "links": "https://www.ycombinator.com/companies/lollipuff",
    "name": "Lollipuff",
    "headline": "Online Auctions for Authentic (Women's) Designer Goods",
    "batch": "W13",
    "description": "Lollipuff is the only online auction site that pre-screens each and every item to guarantee the authenticity of its high-end, pre-owned designer apparel and accessories.\n\nBuyers can be confident they're getting the real deal, and sellers never have to worry about listing their luxury pieces alongside counterfeits. Combining the buyer security of an upscale boutique with the amazing prices of an online auction, Lollipuff is the go-to site for authentic, affordable and on-trend designer fashion.",
    "activity_status": "Active",
    "website": "http://lollipuff.com",
    "founded_date": null,
    "team_size": 11.0,
    "location": "Mountain View",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:marketplace; industry:e-commerce; industry:fashion; location:san-francisco-bay-area",
    "founders": [],
    "status": true,
    "generated_description": "**Lollipuff** is an innovative online auction platform specializing in authentic women's designer goods. Founded as a unique marketplace, Lollipuff's mission is straightforward: to provide buyers with the confidence that every item is verified for authenticity, ensuring they get the real deal without the shadow of counterfeits.\n\nLocated in Mountain View, California, and a proud member of Y Combinator Batch W13, Lollipuff operates with a small, dedicated team of 11 employees. The platform combines the personal touch of an upscale boutique with the competitive pricing of an online auction, making luxury fashion accessible to a broader audience. Their website, [lollipuff.com](http://lollipuff.com), is the go-to destination for anyone looking to buy or sell high-end, pre-owned designer clothing and accessories. \n\nEvery item on Lollipuff undergoes a thorough pre-screening process to ensure authenticity. This not only protects buyers but also gives sellers peace of mind, knowing their luxury goods won't be listed alongside knock-offs. Users can utilize Lollipuff's authentication services for a range of items—from handbags to shoes to jewelry—making it a trusted partner for many consignment and online marketplaces globally.\n\nLollipuff is known for its responsiveness and efficiency. Their authentication service is touted for being incredibly quick, often providing results in under an hour. Customers have shared glowing testimonials about the reliability and speed of the service, emphasizing how it empowers them to make online purchases with confidence. \n\nThis marketplace is more than just about transactions; it's about community and trust. With a clear focus on authenticity and customer satisfaction, Lollipuff is carving out a significant space in the e-commerce fashion landscape. If you're seeking fashionable designer pieces without the fear of fakes, Lollipuff is the answer. \n\nFor more information or to start your luxury shopping experience, visit [lollipuff.com](http://lollipuff.com).",
    "logo": "/logos/medium/missing.png",
    "social_links": [
        "https://www.crunchbase.com/organization/lollipuff"
    ]
}