{
    "links": "https://www.ycombinator.com/companies/long-term-stock-exchange",
    "name": "Long Term Stock Exchange",
    "headline": "LTSE is an ecosystem for visionary business.",
    "batch": "S17",
    "description": "LTSE partners with companies across their lifecycle to help them grow and scale from formation through IPO. The Long-Term Stock Exchange (LTSE) is an SEC-regulated national securities exchange designed to align great companies and long-term investors with the shared goal of value creation. They have assembled a world-class team of experts and advisors with deep expertise in finance, regulation, law, and technology.\r\n\nAt every stage, from private investment into the public markets, strategically managing equity and a company's cap table has an outsized impact on long-term success. So in addition to the exchange, LTSE also built LTSE Equity, a full-lifecycle cap table management solution for planning, managing, and collaborating on startup equity.\r\n\nEric Ries, an entrepreneur and author of the New York Times bestseller, The Lean Startup, is the founder of the LTSE. Eric is the creator of the Lean Startup methodology, a global movement and management philosophy practiced by companies large and small. He founded a number of startups, including IMVU, where he served as CTO, and has advised on business and product strategy for startups, venture capital firms, and large companies, including GE, partnering with them on the FastWorks program.",
    "activity_status": "Active",
    "website": "http://ltse.com",
    "founded_date": 2012.0,
    "team_size": 68.0,
    "location": "San Francisco",
    "group_partner": "Michael Seibel",
    "group_partner_yc": "https://www.ycombinator.com/people/michael-seibel",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:b2b; location:san-francisco-bay-area",
    "founders": [],
    "status": true,
    "generated_description": "The Long-Term Stock Exchange (LTSE) was founded in 2012 by Eric Ries, a notable entrepreneur and author known for his influential book, *The Lean Startup*. Headquartered in San Francisco and part of Y Combinator's Batch S17, LTSE operates as an SEC-regulated national securities exchange dedicated to fostering long-term growth for companies and their investors. \n\nAt the core of LTSE's mission is its commitment to creating an ecosystem where visionary businesses can thrive. This involves supporting companies throughout their lifecycle—from initial formation to going public via an IPO. The LTSE not only facilitates this growth through its trading platform but also offers LTSE Equity, a cap table management solution that helps startups strategically manage their equity and financial structure.\n\nOne of the unique aspects of LTSE is its focus on long-term value creation, diverging from the short-term profit mentality pervasive in many aspects of today's financial markets. LTSE has put forth five SEC-approved principles guiding companies to measure success over years, align compensation with long-term performance, and actively engage with long-term shareholders. This framework encourages a deeper stakeholder engagement and governance practices aimed at sustainable success.\n\nWith a team of 68 employees and backed by prominent investors, including Andreessen Horowitz and Greylock Partners, LTSE positions itself as a valuable partner for companies striving for principled profitability. Their trading platform emphasizes efficiency, reliability, and a straightforward fee structure tailored for long-term investment strategies.\n\nFor those looking to understand more or see if their business could benefit from what LTSE has to offer, you can visit their website at [ltse.com](http://ltse.com). In a world increasingly distracted by fleeting metrics, LTSE is making a case for a return to what truly matters—building enduring, impactful businesses.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/24387f4e158b580b4697b3e555bb989b5431d1a6.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191512Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=488ffb1ffb1844c52f2b42e86672b825ca097046950311a886b1e597632b0e41",
    "social_links": [
        "https://www.linkedin.com/company/ltse",
        "https://twitter.com/ltse",
        "https://www.crunchbase.com/organization/long-term-stock-exchange"
    ],
    "logo_path": "data/logos\\Long_Term_Stock_Exchange_logo.png"
}