{
    "links": "https://www.ycombinator.com/companies/loop-health",
    "name": "Loop Health",
    "headline": "Modern & comprehensive health insurance plan for employees in India",
    "batch": "W20",
    "description": "Loop Health is a new type of healthcare provider in India combining high-quality primary care and insurance for employers. Employees get unlimited primary care visits at our asset-light clinics, alongside traditional hospitalization insurance.\r\n\nDuring YC, we grew from 0 to $85,000 ARR with 200% MoM growth. We serve 22 companies and 5500 members across Pune. \r\n\nEmployers pay us $15/member/year and we make an additional $25 on prescriptions, lab tests, and hospitalization referrals. Our total gross margins are 70%.\r\n\n200MM Indians are covered with employer-funded health insurance, representing a $8 billion dollar market opportunity, growing at 27% CAGR.\r\n\nIndian employers are dissatisfied with their health benefits today because insurance in India only covers hospital stays, not doctor visits – and only 8% of their employees will ever use the benefit in the year. With Loop, employers can offer a more engaging health benefit that includes doctor visits and telemedicine, alongside traditional hospital coverage, for about the same price. Because their employees have better access to doctors, we can also offer lower insurance premiums.",
    "activity_status": "Active",
    "website": "http://www.loophealth.com",
    "founded_date": 2017.0,
    "team_size": 27.0,
    "location": "India",
    "group_partner": "Michael Seibel",
    "group_partner_yc": "https://www.ycombinator.com/people/michael-seibel",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:healthcare; industry:insurance; industry:primary-care",
    "founders": [
        {
            "name": "Ryan Singh, Founder",
            "description": "COO and co-founder of Loop Health, a modern primary care plan for India. We're a team of 18 in Pune, India. \n\nBefore Loop, I led programs in entrepreneurship education at the University of Illinois at Urbana-Champaign (UIUC), co-founding the iVenture Accelerator, the campus’s accelerator for top student startups.\n\nI studied Finance and Marketing at the University of Illinois at Urbana-Champaign and was a Watson University Social Enterprise Fellow.",
            "linkedin": "https://www.linkedin.com/in/ryanpreetsingh"
        },
        {
            "name": "Mayank Kale, Founder",
            "description": null,
            "linkedin": "https://www.linkedin.com/in/kalemayank/"
        }
    ],
    "status": true,
    "generated_description": "**Company Overview: Loop Health**\n\nLoop Health is revolutionizing employee health insurance in India with a modern and comprehensive approach. Founded in 2017 and part of the Y Combinator Batch W20, Loop Health integrates high-quality primary care with traditional hospitalization insurance, creating a unique healthcare model tailored for employers. The goal? To provide employees with unlimited access to primary care at asset-light clinics while reducing overall insurance costs through preventative care strategies.\n\n**Business Model and Growth**\n\nDuring its stint at Y Combinator, Loop Health skyrocketed from zero to an impressive $85,000 in annual recurring revenue (ARR), achieving a jaw-dropping 200% month-over-month growth rate. As of now, they serve 22 companies and cater to about 5,500 members, primarily in Pune. Employers pay a competitive rate of $15 per member per year, complemented by additional revenues from prescriptions, lab tests, and referrals to hospitalization, culminating in total gross margins of 70%.\n\n**Market Opportunity**\n\nIn India, approximately 200 million people are covered by employer-funded health insurance, which represents an $8 billion market opportunity growing at a 27% CAGR. Employers are increasingly dissatisfied with traditional insurance schemes, as only 8% of employees typically utilize hospital coverage each year. Loop Health addresses this gap by offering a more engaging health benefits package that includes doctor visits and telemedicine, thereby increasing utilization and enabling lower premiums.\n\n**Why Loop Health?**\n\nLoop Health’s innovative model not only covers hospital stays but also facilitates unlimited consultations with healthcare professionals. This empathetic approach to healthcare ensures that employees remain engaged and proactive about their health, as the service integrates wellness sessions and chronic care programs tailored to individual needs.\n\n**Team and Leadership**\n\nThe team comprises 27 talented individuals, led by experienced professionals, including Michael Seibel as a Group Partner, fostering an environment that stresses innovation and member welfare.\n\n**Key Features and Services**\n- Unlimited primary healthcare with 24/7 virtual consultations.\n- Weekly wellness sessions, offering yoga, pilates, and more.\n- A health index that reviews employees' health data, aiding in personalized care plans.\n- Employee Assistance Programs (EAP) focusing on chronic care solutions.\n- Seamless integration with HR systems to manage claims effectively, leading to improved efficiency and reduced administrative burdens.\n\n**Performance Metrics**\nLoop Health has garnered notable acclaim:\n- Over 500,000 happy members.\n- Collaboration with more than 1,000 companies.\n- 80,000 claims processed.\n- A stellar app rating of 4.8/5.\n\n**Vision for the Future**\n\nThrough the utilization of technology and data, Loop Health ensures a people-centric healthcare experience that not only alleviates the stresses of traditional health insurance but actively works to keep employees healthy. It’s a transformative approach that not only looks at insurance, but genuinely cares for the well-being of employees.\n\nFor more information, visit [Loop Health](http://www.loophealth.com).\n\n---\n\nIn short, Loop Health is tackling the inefficiencies of the traditional health insurance model in India by blending comprehensive care with the genuine intent of fostering health, demonstrating that insurance can indeed work beyond just the basics.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/c92f8af1d005d592c4a5315906e6f0a2219fb95b.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191512Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=0eea99d7be6a06f12bb031b9839a8f8439e6a64baca84d349964e62779ac2030",
    "social_links": [
        "https://www.linkedin.com/company/loop-health",
        "https://www.facebook.com/loophealthindia",
        "https://github.com/loophealth"
    ]
}