{
    "links": "https://www.ycombinator.com/companies/luable",
    "name": "Luable",
    "headline": "Latin America's Deposits Marketplace for Banks",
    "batch": "S21",
    "description": "Luable is an Bank Deposits Marketplace in Latin America where Banks can get faster and cheaper funding from Retail users compared to opening traditional branch offices or hiring more Sales Representatives.\r\n\nLuable's Marketplace features all banks in one place so retail users can choose for their best needs, and enables upcoming banks to provide a full digital experience with no fixed costs. \r\n\nSince Launching in 2021, Luable has processed over USD $30M in deposits for many banks and its currently expanding its operations from Colombia to Mexico and the Caribbean.",
    "activity_status": "Active",
    "website": "https://mejorcdt.com/",
    "founded_date": 2021.0,
    "team_size": 40.0,
    "location": "Bogotá, Colombia",
    "group_partner": "Harj Taggar",
    "group_partner_yc": "https://www.ycombinator.com/people/harj-taggar",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech",
    "founders": [
        {
            "name": "Charlie Correa, Founder",
            "description": "Early Uber employee, launched UberX in Colombia, Dominican Republic and Argentina, and led DiDi Chuxing expansion in Colombia as Head of Ops building a team of 50 people and capturing 30% of market share in 3 months. \n\nNow building Luable, a fintech that allows Banks get faster and cheaper funding from Retail users, that already has USD $30M+ in deposits, from thousands of Retail users.",
            "linkedin": "https://www.linkedin.com/in/carloscorreavega/"
        },
        {
            "name": "David Susa, Founder",
            "description": "Colombian. Systems and Computing Engineer. Msc on Information Security. \nIn God I trust, all others must bring data.\n+8 years working on software development, serving thousands of customers on a SaaS platform for real state in LATAM.",
            "linkedin": "https://www.linkedin.com/in/davidsusa"
        }
    ],
    "status": true,
    "generated_description": "**Luable: Revolutionizing Banking in Latin America**\n\nFounded in 2021, Luable is carving out a unique niche in the financial technology landscape of Latin America. Operating from Bogotá, Colombia, Luable positions itself as a marketplace for bank deposits, providing a streamlined solution for banks to access funding more efficiently and affordably. Instead of the traditional route of opening branch offices or ramping up sales teams, banks can tap into Luable’s marketplace to connect with retail users looking for the best deposit options.\n\nAt the heart of Luable's mission is an inclusive and user-friendly platform that democratizes access to banking services. For the retail customer, this means the ability to choose from a variety of banks all in one place, finding options that best suit their financial goals. Luable not only caters to established banks but also empowers emerging financial institutions, enabling them to offer a complete digital banking experience without the heavy burden of fixed costs.\n\nSince its inception, Luable has made significant strides, processing over $30 million in deposits and amassing a loyal user base of over 300,000 people. As the company expands its reach from Colombia into Mexico and the Caribbean, they’re poised to reshape how banking operates in the region.\n\nThe company has gained substantial backing from Y Combinator, a major U.S. investment fund, which lends credibility and resources to their burgeoning enterprise. Their association with networks like Colombia Fintech exemplifies their commitment to digital transformation in the finance sector, promoting collaboration, trust, and inclusivity.\n\nSecurity is also a priority for Luable. Through partnerships with institutions like Fogafín, they assure customers that their investments are safeguarded, promising refunds of up to 50 million pesos in the event of a bank closure.\n\nWith a team of 40 dedicated employees, Luable is in a robust position to innovate further within the fintech space. They’ve already established a reputation for helping customers maximize their savings by fostering competition among banks, ensuring consumers get the best returns on their investments.\n\nIn sum, Luable stands as a beacon of modern banking in Latin America, leveraging technology to create a marketplace that not only connects banks with consumers but also heralds a new age of financial accessibility and efficiency. For users looking for a seamless way to open, compare, and manage their bank deposits, Luable is the go-to platform.\n\nFor more information, visit their website at [mejorcdt.com](https://mejorcdt.com/).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/6f77881e7e8605df6f12b797587839b7781bc2bb.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191513Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=25feb5af0a51a2e5a394e44b748f15a91aa23c0dd5e8348f71e6956f30ecaa81",
    "social_links": [
        "https://www.facebook.com/MejorCDT/"
    ],
    "logo_path": "data/logos\\Luable_logo.png"
}