{
    "links": "https://www.ycombinator.com/companies/lucy-goods-inc",
    "name": "Lucy Goods, Inc",
    "headline": "Lucyâ\u0080\u0099s mission is to reduce tobacco-related harm to zero. We provideâ\u0080¦",
    "batch": "W18",
    "description": "If it isnâ\u0080\u0099t bad enough that smokers donâ\u0080\u0099t realize the scientific facts about nicotine, most non-tobacco nicotine products are poorly designed and unappealing to use. The leading gum is sold like a pharmaceutical drug, with flavoring and packaging to match. Vapes provide a cumbersome, over-the-top experience â\u0080\u0094 with use as tightly restricted as cigarette smoking itself, but more juvenile, conspicuous, and highly addictive. People want, and deserve, a better way.\r\n\nTherefore, we want to deliver nicotine users a superior experience, and at the same time give them a way to transition out of feeling dependent. In a better society, people wouldnâ\u0080\u0099t carry around the sensation that theyâ\u0080\u0099re stuck with an involuntary habit. Our mission isnâ\u0080\u0099t to encourage nicotine use among people who havenâ\u0080\u0099t started. Unlike certain vapes or other products, ours isnâ\u0080\u0099t the sort coveted by underage users on social media. Our mission is to alleviate the harm related to tobacco â\u0080\u0094 first and foremost, by switching people away from the most harmful products.\r\n\nSo, at Lucy, we take an evidence based view of nicotine. Nicotineâ\u0080\u0099s pleasurable properties make it an inevitable part of modern society. Therefore, minimizing harm in all nicotine products is key, in addition to giving people products and strategies for cessation. We feel that, as 1,300 people are dying of tobacco related illnesses every day in the US, the most important and immediate step toward a better society is giving nicotine consumers products they enjoy using that will cause less harm.\r\n\nOur first product is designed to appeal to smokers and encourage them to switch. And, looking ahead, we hope to secure approval in the future as a clinically proven smoking cessation aid, while continuing to participate in the FDAâ\u0080\u0099s public hearings around how NRTs are best regulated. Our goals are simple: because harm reduction is a better strategy around nicotine delivery than abstinence or prohibition, we want to help improve public health â\u0080\u0094 and reduce its costs â\u0080\u0094 through a superior pure nicotine product.",
    "activity_status": "Active",
    "website": "https://lucy.co/",
    "founded_date": 2016.0,
    "team_size": 7.0,
    "location": "Los Angeles, CA",
    "group_partner": "Dalton Caldwell",
    "group_partner_yc": "https://www.ycombinator.com/people/dalton-caldwell",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:3d-printed-foods; industry:biotech; industry:e-commerce; location:los-angeles",
    "founders": [
        {
            "name": "John Coogan, Founder",
            "description": "Entrepreneur typically focused on the technology side of consumer packaged goods. Based in Los Angeles. Interested in computer graphics, deep learning, and marketing. Occasional angel investor. \n\nFollow me on YouTube: https://www.youtube.com/c/johncooganplus",
            "linkedin": "http://www.linkedin.com/in/jacoogan"
        },
        {
            "name": "Samy Hamdouche, Founder",
            "description": null,
            "linkedin": "https://www.linkedin.com/in/samy-hamdouche-6aa24738/"
        },
        {
            "name": "David Renteln, Founder",
            "description": null,
            "linkedin": "https://www.linkedin.com/in/drenteln"
        }
    ],
    "status": true,
    "generated_description": "**Company Overview: Lucy Goods, Inc.**\n\nFounded in 2016 and hailing from the heart of Los Angeles, Lucy Goods, Inc. is on a mission to eliminate the harmful effects of tobacco. The company emerged from the understanding that many nicotine products on the market are far from appealing—think of the pharmacy-style packaging of nicotine gum or the cumbersome aspects of vaping. Smokers deserve a better option, and that's where Lucy comes in.\n\n### Mission and Vision\n\nLucy aims to tackle tobacco-related harm head-on. Their goal is not to promote nicotine use among newcomers but to provide a satisfactory alternative for those already using it. Their philosophy hinges on an evidence-based approach, recognizing nicotine’s enjoyment potential while prioritizing harm reduction over abstinence.\n\nEvery day, over 1,300 individuals die from tobacco-related illnesses in the U.S. Lucy believes it’s crucial to give nicotine consumers a more enjoyable, less harmful choice. By transitioning users to better-designed products, they hope to ease the burden of nicotine dependency and improve public health outcomes.\n\n### Product Offerings\n\nLucy’s product lineup includes:\n\n- **Breakers**: Innovative nicotine pouches that offer a unique hydrating experience.\n- **Pouches**: High-capacity nicotine pouches available in various flavors.\n- **Gum**: A revamped classic, this gum features improved flavor and texture that cater to a new generation of users.\n- **Lozenges**: Small yet effective, these lozenges deliver nicotine satisfaction without burden.\n\nThe organization plans to seek approval for its offerings as clinically validated smoking cessation aids, participating in ongoing FDA discussions about nicotine replacement therapies. \n\n### Team and Affiliations\n\nWith a nimble team of just seven, Lucy Goods is part of Y Combinator's Winter 2018 batch, benefitting from the mentorship and networking opportunities that the accelerator provides. Dalton Caldwell serves as their Group Partner, guiding them in strategic directions as they grow.\n\n### Culture and Branding\n\nLucy positions itself at the intersection of science and consumer health, often referring to its team as \"scientists, not cowboys.\" They emphasize an intelligent, adult-focused approach to nicotine—a refreshing alternative in a market crowded with skimpily designed and marketed products.\n\n### Conclusion\n\nIn summary, Lucy Goods, Inc. is redefining the nicotine experience, shifting the landscape from harmful habits to informed choices. Whether through innovative packaging, effective marketing, or evidence-backed efficacy, they’re striving toward a world where nicotine can be enjoyed with significantly less risk. Interested in exploring their products or learning more? Check out their website at [Lucy.co](https://lucy.co).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/688b5780c92ea7f5e3a0f66e6052a01c0a241502.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191514Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=183506d74ead866fe0f643bb915da36218f44c013026c6a0e002b4c37bd504cc",
    "social_links": [
        "http://www.twitter.com/lucynicotine",
        "http://www.facebook.com/lucynicotine"
    ],
    "logo_path": "data/logos\\Lucy_Goods,_Inc_logo.png"
}