{
    "links": "https://www.ycombinator.com/companies/luminai",
    "name": "Luminai",
    "headline": "Luminai helps automate repetitive manual work away from your missionâ\u0080¦",
    "batch": "S20",
    "description": "Luminai helps automate repetitive manual work away from your mission critical business processes. We're serving customers across insurance, healthcare, financial services, and more. Visit our website and see our customer case studies below:\r\n\nhttps://luminai.com\r\n\nGrateful to be backed by General Catalyst, Craft Ventures, Y Combinator, Moxxie Ventures, Caffeinated Capital, Unshackled Ventures, Scribble Ventures, Shrug Capital, Underscore VC, Weekend Fund, Liquid 2 Ventures, Nikhil Basu Trivedi, Yuri Sagalov, Chris Golda, Basement Fund, the founders and CEOs of Dropbox, Flexport, Notion, Deel, Front, Ramp, Coda, Rappi, Twitch, Lever, Algolia, Thredup, Pagerduty, Sendbird, the COO's of Stitchfix/Rippling, and the former heads of product of Twitter, Instagram, and Uber. Weâ\u0080\u0099ve raised $20 million till date. \r\n\nWeâ\u0080\u0099re hiring across all roles!",
    "activity_status": "Active",
    "website": "https://www.luminai.com",
    "founded_date": 2019.0,
    "team_size": 31.0,
    "location": "San Francisco",
    "group_partner": "Aaron Epstein",
    "group_partner_yc": "https://www.ycombinator.com/people/aaron-epstein",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:saas; industry:b2b; industry:enterprise; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Kesava Kirupa Dinakaran, Founder",
            "description": "Kesava is the CEO of Luminai. He's survived off hackathon prize money in Silicon Valley and also holds two world records solving Rubik's cubes.",
            "linkedin": "https://www.linkedin.com/in/kesavakirupa/"
        }
    ],
    "status": true,
    "generated_description": "Luminai is a San Francisco-based startup founded in 2019 that focuses on automating repetitive manual tasks so businesses can concentrate on their mission-critical processes. It’s essentially your turbocharger for operations, transforming the way companies, particularly in the insurance, healthcare, and financial services sectors, handle workflow bottlenecks.\n\nThe problem it's tackling is huge. Many enterprises are bogged down by inefficient manual processes—think excessive data entry, context switching, and cumbersome workflows. Luminai streamlines this with its self-sustaining system that leverages advanced AI to manage and automate these tedious tasks seamlessly. Users simply upload their Standard Operating Procedures (SOPs), and Luminai interprets and executes these processes. It’s like having a digital assistant that doesn’t just take notes but actually gets stuff done.\n\nBacked by notable investors like General Catalyst, Y Combinator, and Craft Ventures, Luminai has raised $20 million to date and is part of Y Combinator’s Summer 2020 batch. With a team of 31, they’re ramping up their operations aggressively and are on the lookout for new talent across all roles.\n\nLuminai is particularly appealing because it requires no heavy integration efforts, ensuring that companies can maintain their existing systems while benefiting from enhanced operational efficiency. Their solutions range from automating operations in healthcare—like patient scheduling and claims processing—to optimizing financial services operations such as loan processing and disputes.\n\nIf you find your team swamped with manual tasks, Luminai is worth a look. They promise a swift onboarding in as little as 2-3 weeks and focus on keeping your data secure. This kind of innovation is key to fostering a more efficient workplace in the evolving digital landscape.\n\nFor a deep dive into their offerings or to see how they’ve helped other businesses, check out their customer case studies and demos at [Luminai's Website](https://luminai.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/12d81bbb7ceb0aebdc8803415740771310551e19.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191515Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=108e357b85625510c22276f8b727e3f85f31165932f5236dfaba53f4c552aaab",
    "social_links": [],
    "logo_path": "data/logos\\Luminai_logo.png"
}