{
    "links": "https://www.ycombinator.com/companies/luminate-medical",
    "name": "Luminate Medical",
    "headline": "We build medical devices to stop the side effects of cancer treatment.",
    "batch": "S21",
    "description": "We make devices that help cancer patients prevent the side effects of cancer treatment, including hair loss, neuropathy and infertility. Our first product, Lily, is a wearable cap that enables chemotherapy patients to prevent hair loss in a comfortable, portable way, while our second product, Lilac, is the world's first device to prevent the peripheral nerve damage caused by cancer treatment.",
    "activity_status": "Active",
    "website": "http://www.luminatemed.com",
    "founded_date": 2019.0,
    "team_size": 36.0,
    "location": "Galway, Ireland",
    "group_partner": "Jared Friedman",
    "group_partner_yc": "https://www.ycombinator.com/people/jared-friedman",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:hard-tech; industry:consumer-health-services; industry:medical-devices",
    "founders": [
        {
            "name": "Aaron Hannon, Founder",
            "description": "Co-Founder and CEO of Luminate Medical. Software and electronic engineer with a passion for medical devices and a better citizen experience of medicine. Thiel Fellowship, Class of 2020.",
            "linkedin": "https://www.linkedin.com/in/aaronhannon/"
        },
        {
            "name": "Barbara Oliveira, Founder",
            "description": "Co-Founder and Clinical Lead of Luminate Medical, a start up medical device company based in Galway, Ireland working on empowering patients during their cancer & chemotherapy journey. Biomedical Engineer by background, with experience in leading first-in-human medical device clinical trials, and a passion for quality of life applications of medicine!",
            "linkedin": "https://www.linkedin.com/in/barbaralolive/"
        }
    ],
    "status": true,
    "generated_description": "### Luminate Medical: Innovating Cancer Care\n\n**Company Overview**\nFounded in 2019 and located in Galway, Ireland, Luminate Medical is on a mission to mitigate the distress caused by cancer treatments. They're doing this by creating medical devices designed to prevent the harsh side effects of chemotherapy such as hair loss, neuropathy, and infertility. The company, which is a product of the Y Combinator Batch S21, has a team of 36 employees working to revolutionize cancer care.\n\n**Core Products**\n- **Lily:** This portable, wearable cap is a game-changer for chemotherapy patients, allowing them to prevent hair loss—a significant concern for many undergoing treatment.\n  \n- **Lilac:** This innovative device stands as the first of its kind aimed at preventing peripheral nerve damage (neuropathy) associated with cancer treatments, which is a leading cause of treatment discontinuation. \n\n**The Problem They Address**\nCancer treatment comes with a laundry list of unpleasant side effects. These often lead to treatment withdrawal, with up to 28% of patients in antibody-drug conjugate trials ceasing due to neuropathy. For many, hair loss is not just a minor inconvenience—it's one of the most traumatic parts of their experience with cancer.\n\n**Vision for the Future**\nLuminate Medical isn't just about existing products. They’re exploring more ways to enhance patients' quality of life through research into conditions like lymphedema and post-treatment fertility issues. Their ultimate vision is to transform cancer care, enabling therapies to be administered at home, thereby making it more accessible and comfortable for patients.\n\n**Why It Matters**\nThe financial burden of cancer care is staggering, with Medicare spending significantly more on treatment services than on therapeutic costs. Luminate’s focus on at-home solutions could not only alleviate patient stress but could also lead to substantial cost savings in cancer care by reducing the reliance on in-hospital services.\n\nWhether you’re a patient, a healthcare professional, or just someone interested in the future of medical technology, Luminate Medical intends to lead the way in compassionate cancer care. They’re not just treating cancer; they're taking care of people living with it.\n\nFor more information, check out their website at [Luminate Medical](http://www.luminatemed.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/6da84f6939e17eb111d0e011a01e4a4dff847af6.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191515Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=c60c0ce917fbe323db664efaf56feb9c6816b42ebb540514bd62c7182ac4244a",
    "social_links": [
        "https://www.linkedin.com/company/luminate-medical",
        "https://twitter.com/luminatemed"
    ],
    "logo_path": "data/logos\\Luminate_Medical_logo.png"
}