{
    "links": "https://www.ycombinator.com/companies/lumina",
    "name": "Lumina",
    "headline": "AI+human powered automation on job-community platform with 1.5Mâ\u0080¦",
    "batch": "W22",
    "description": "ð\u009f\u009a\u0080 Luminað\u009f\u0092§ (YC W22) is a fast growing job platform in Southeast Asia with 1.5 million workers, helping 30k companies recruit and optimize at scale.\r\n\nð\u009f¤\u0096 We are now expanding globally with Lumibot, a bespoke AI+human-powered automation service. We help companies automate mundane, repetitive processes with AI and human-in-the-loop catering for various use cases in data ops and complex workflows. This allows your business to focus on your core and grow faster, better and cheaper.\r\n\nð\u009f\u0091\u008cOur AI-powered automation start with USD 13/hour, supplemented with human-in-the-loop at USD 2-6/hour. Our services are managed based on SLAs by dedicated service managers under a prepaid credit system without arduous contracts for optimum flexibility. No minimum commitment with fully-refundable deposit from as low as USD 500^.\r\n\nð\u009f\u009b ï¸\u008f We currently support the following use cases:\r\n1) operations support\r\n2) revenue operations support\r\n3) web and social media management\r\n4) email management\r\n5) content moderation\r\n6) AI training and verification\r\n7) AI text humanization\r\n8) custom process automation\r\n... with more to come ...\r\n\nð\u009f\u0091¥ï¸\u008fï¸\u008f Lumibot (by Lumina) is backed by Y-Combinator, Monk's Hill Ventures, Alpha JWC, Goodwater Capital, SWC Global and January Capital.\r\n\nMore information about us:\r\n* ð\u009f\u0092¬ WA: https://wa.me/message/SEMGBRM22MDYK1\r\n* ð\u009f\u0093\u0085 CAL: https://usemotion.com/meet/aswin-andrison/global\r\n* ð\u009f\u008c\u0090 WEB: https://www.lumibot.com\r\n\n^ Reach out to us on special deals ONLY for YC companies!",
    "activity_status": "Active",
    "website": "https://www.lumibot.com",
    "founded_date": 2022.0,
    "team_size": 12.0,
    "location": "Singapore, Singapore",
    "group_partner": "Gustaf Alstromer",
    "group_partner_yc": "https://www.ycombinator.com/people/gustaf-alstromer",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:aiops; industry:marketplace; industry:saas; industry:community; industry:automation",
    "founders": [
        {
            "name": "Aswin Andrison, Founder",
            "description": "Aswin co-founded TazkerAI on the back of Lumina (YC W22), an autonomous AI+human-powered workflow automation for the physical industry. Prior to that, he co-founded STOQO, a pioneer fresh-produce supplier for 40,000 restaurants with 1,500-strong workforce and USD 13M raised from top investors (Accel, Monk's Hill and AlphaJWC, etc). Before startups, Aswin consulted at McKinsey, IBM and Honeywell. He graduated computer science / chemical eng. from UNSW and MBA from London Business School and MIT.",
            "linkedin": "https://www.linkedin.com/in/aandrison"
        },
        {
            "name": "Tri Ahmad Irfan, Founder",
            "description": "Before Lumina, I built GudangAda engineering team to revolutionize FMCG logistics and supply chain (with $135m+ raised from Sequoia Capital).\n\nBefore, I was founding team at STOQO (with $10m+ raised from Accel & Monk's Hills Ventures) where I built the core products and scaled the engineering team from 1 to 40.\n\nI also worked at Twitter in SF and several top startups in Indonesia (GDP Labs, Dekoruma, Cermati). In school, I was a competitive programmer & coach.",
            "linkedin": "https://www.linkedin.com/in/triahmadirfan/"
        }
    ],
    "status": true,
    "generated_description": "**Lumina: Empowering Automation with a Human Touch**\n\nFounded in 2022 and backed by Y Combinator's Batch W22, Lumina has quickly positioned itself as a rising star in the Southeast Asian job market—boasting a community of 1.5 million workers and assisting over 30,000 companies in their hiring and operational needs. Based in Singapore, the company is focused on leveraging AI and human capabilities to automate mundane tasks, making work not only more efficient but also more meaningful.\n\n### What They Offer\n\nLumina's core product, Lumibot, is an innovative AI+human-powered automation service tailored to streamline various business processes. Think of it as the friendly robot that takes over repetitive tasks so that you and your team can concentrate on what truly matters. From operations support to social media management, Lumibot is designed to handle a wide array of use cases, including:\n\n1. Operations support\n2. Revenue operations support\n3. Web and social media management\n4. Email management\n5. Content moderation\n6. AI training and verification\n7. AI text humanization\n8. Custom process automation  \n\nAnd they promise even more features are on the horizon.\n\n### Pricing Model\n\nTheir pricing is incredibly straightforward: AI-powered automation starts at an attractive USD 13/hour. If you need the human touch to complement the automation, that’s an additional USD 2-6/hour. There's no long-term commitment required—just a flexibility-driven prepaid credit system complemented by dedicated service managers to ensure everything runs smoothly. You can get started with a fully refundable deposit as low as USD 500, making it accessible for various business sizes.\n\n### Backed by Industry Leaders\n\nLumina has garnered support from notable investors, such as Monk's Hill Ventures, Alpha JWC, Goodwater Capital, SWC Global, and January Capital. This backing not only lends credibility but also fuels their ambition to expand globally.\n\n### The Future is Here\n\nAt its heart, Lumina is about simplification—making it easier for businesses to harness the power of automation without needing extensive technical expertise. They promise that if it works on Chrome, it works on Lumibot. Say goodbye to manual workflow building and hello to a future where automation unlocks new possibilities for productivity and growth.\n\n### Get in Touch\n\nIf you're curious about how you can elevate your business processes with Lumina, they’re just a click away:\n- [WhatsApp](https://wa.me/message/SEMGBRM22MDYK1)\n- [Calendar](https://usemotion.com/meet/aswin-andrison/global)\n- [Website](https://www.lumibot.com)\n\nWith a small yet impactful team of 12, Lumina is ready to help you embrace the future of work. So why not take that leap into the world of efficient automation? After all, the future of work starts here.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/d06d44d903cd0adf8e96751874590e7521659668.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191515Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=017dc73ee80c1542ae7e56fe829d0ecebff39e2375b3b1757de95e6e992c4544",
    "social_links": [
        "https://www.facebook.com/lumina.mba/",
        "https://www.crunchbase.com/organization/lumina-6a60"
    ],
    "logo_path": "data/logos\\Lumina_logo.png"
}