{
    "links": "https://www.ycombinator.com/companies/lumona",
    "name": "Lumona",
    "headline": "AI-enabled search engine featuring insights from social media.",
    "batch": "W24",
    "description": "Lumona is an AI-enabled search engine featuring insights from social media. When you’re looking to buy a new phone, instead of adding reddit to the end of your search and opening tabs of threads that take forever to get through, you can search on Lumona to get all of that processed for you on one page so you can make the best decision while saving time.",
    "activity_status": "Active",
    "website": "https://www.lumona.ai",
    "founded_date": 2023.0,
    "team_size": 2.0,
    "location": "San Francisco",
    "group_partner": "Michael Seibel",
    "group_partner_yc": "https://www.ycombinator.com/people/michael-seibel",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:generative-ai; industry:consumer; industry:search; industry:ai; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Dylan Walker, Founder",
            "description": "Dylan is the co-founder and CEO of Lumona. He is from Ventura, CA and studied computer science and engineering at MIT. He gained insights into how systems and APIs at scale work with experience at Google and Stripe. Not having exposure to traditional avenues of applying to elite colleges, he relied on Reddit and Google to learn about how to maximize his chances of being admitted. Since then, he's been focused on enabling everyone to pursue their goals and equalize the playing field.",
            "linkedin": "https://linkedin.com/in/dawalker-24"
        },
        {
            "name": "Qiong Zhou Huang, Founder",
            "description": "Qiong is the Co-Founder and CTO of Lumona. \n\nHe previously studied Computer Science at MIT, where he conducted Machine Learning research at the McGovern Institute of Brain and Cognitive Science. He was also co-president of MIT web.lab, a group that teaches web development to hundreds of MIT students over the winter semester.\n\nQiong has extensive experience building products that prioritize user experience, working at startups in diverse areas including computer vision, remote work, and edtech.",
            "linkedin": "https://linkedin.com/in/qiong-zhou-huang-627243141"
        }
    ],
    "status": true,
    "generated_description": "### Lumona: Streamlining Your Searches with AI\n\n**Overview**  \nFounded in 2023 and currently part of the Y Combinator Batch W24, Lumona is an innovative AI-driven search engine based in San Francisco. With a compact team of just two employees, including the guidance of Group Partner Michael Seibel, Lumona aims to revolutionize the way users gather insights, particularly utilizing data from social media.\n\n**Mission**  \nThe core mission of Lumona is to simplify your search experience. Imagine you’re on the hunt for a new phone: instead of juggling multiple tabs and threads from Reddit, you can turn to Lumona. This platform consolidates social media insights and presents them neatly on one page, making it easier for you to make informed decisions quickly—all while saving precious time.\n\n**What They Do**  \nLumona processes information from various social media channels and presents it in user-friendly search results. Whether you’re curious about the best places for onsen in Japan, the top Thai food spots in San Francisco, or tips for getting back into an exercise routine, Lumona curates this wisdom for easy access.\n\n**Community Engagement**  \nLumona invites users to join their Discord channel, where they can engage directly with the founders and suggest new features. This emphasis on community interaction demonstrates their commitment to improving their service based on user feedback.\n\n**Get Started**  \nFor anyone eager to explore what Lumona has to offer, you can visit their website at [lumona.ai](https://www.lumona.ai). It's a fresh take on how we approach searching for information online—one that harnesses the power of AI to better connect us with the vast resources of social media.\n\nIn summary, Lumona is not just another search engine; it’s a tool designed to enhance user decision-making by leveraging the vast landscape of social media insights. As they grow, we can expect even more features and improvements that will redefine how we search for and consume information.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/f6cae9b843090f0bdcaa428acf8c3cb8ce93407f.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191516Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=74f4dc11744239e3b23db20dddba08639378dcc562672d8f90ac62f248ad346b",
    "social_links": [
        "https://www.linkedin.com/company/lumona-ai",
        "https://twitter.com/LumonaAI"
    ],
    "logo_path": "data/logos\\Lumona_logo.png"
}