{
    "links": "https://www.ycombinator.com/companies/lunajoy",
    "name": "LunaJoy",
    "headline": "Precision mental health care for women",
    "batch": "W22",
    "description": "LunaJoy is a precision mental health platform that is specialized in women's mental health through all phases of life including adolescence, pregnancy, postpartum, infertility, miscarriage, loss, perimenopause, and aging. We deliver care by creating a specialized workforce to provide targeted psychotherapy, medication management + genetic testing, coaching, and holistic wellness. LunaJoy utilizes technology and data science to provide intelligent touchpoints that decrease costs and accelerate outcomes. We are increasing our in-network footprint to provide truly accessible care for all. \r\n\nWomen are twice as likely to experience mental health difficulties. Rates are even higher for women of color and LGBTQ+ folks. Women are 3x more likely to experience sexual, physical, emotional trauma which is a predictor for mental illness. This is just the tip of the iceberg! Physiologically, women experience hormonal fluctuations which make them more vulnerable to mental health issues during times of transition such as puberty, pregnancy, postpartum, and menopause. We also face unique stressors as the emotional bedrock of our homes, supporting young families, elderly adults, and a huge part of the workforce. The downstream effects of this gap in care are far-reaching into our ecosystems. Currently, mental health care is expensive, inconvenient, and generalist where a specialized approach is needed. When we attend to women’s mental health, we all shine brighter!",
    "activity_status": "Active",
    "website": "http://HelloLunaJoy.com",
    "founded_date": 2021.0,
    "team_size": 6.0,
    "location": "Atlanta, GA",
    "group_partner": "Nicolas Dessaigne",
    "group_partner_yc": "https://www.ycombinator.com/people/nicolas-dessaigne",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:mental-health-tech; industry:digital-health; industry:femtech",
    "founders": [],
    "status": true,
    "generated_description": "**Company Overview: LunaJoy**\n\nLunaJoy, founded in 2021, is a groundbreaking mental health platform specifically designed for women, addressing a spectrum of unique life phases—from adolescence to menopause. Based in Atlanta, Georgia, the company emerged as a part of Y Combinator’s Batch W22. They’ve assembled a team of six passionate individuals determined to make mental health care more precise, especially for women who experience mental health challenges at significantly higher rates than their male counterparts.\n\n**Mission and Services**\n\nAt its core, LunaJoy’s mission is to provide precision mental health care tailored for women. This covers key life transitions such as pregnancy, postpartum challenges, infertility, and beyond. The platform employs a specialized workforce offering various services including targeted psychotherapy, medication management enhanced by genetic testing, holistic wellness, and coaching, all wrapped up in a user-friendly digital format.\n\nThey leverage technology and data science to create intelligent touchpoints that not only cut costs but also streamline outcomes, making mental health care more accessible and effective. Women's mental health is especially critical since studies show that women are twice as likely to struggle with mental health issues—this gap becomes even more pronounced among women of color and LGBTQ+ individuals.\n\n**What They Offer**\n\n- **Therapy and Counseling:** Virtual therapy specifically for women navigating complex emotional landscapes.\n- **Medication Management:** Personalized medication plans that account for genetic factors, ensuring better outcomes.\n- **Coaching and Holistic Wellness:** Comprehensive support assisting women not just in mental health but in overall wellness.\n- **Insurance Coverage:** Clients can access services through various major insurance plans, making it financially viable for many.\n\n**Why it Matters**\n\nLunaJoy is not just another telehealth platform. It recognizes that women's mental health care is often overlooked, and aims to fill that gap with its specialized approach. They tackle common but serious issues, from postpartum depression to anxiety and grief, catering to every woman’s needs with empathy and expertise.\n\n**Future and Growth**\n\nThis startup is on a growth trajectory, expanding its in-network footprint to ensure that all women have access to the care they need. With the right mix of innovation and compassion, LunaJoy is well-equipped to make a substantial impact in the digital health space.\n\n**Connect and Explore**\n\nFor more information or to book an appointment, visit their website [HelloLunaJoy.com](http://HelloLunaJoy.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/3eba200bf8b019d23d441fa47b5860f658318fc2.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191516Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=fd3a362bbcd45c5b81e56e50001f04409bd73ef043a07ab05f3f43a7830af7d8",
    "social_links": [
        "https://www.linkedin.com/company/lunajoy",
        "https://www.facebook.com/LunaJoyHealth"
    ],
    "logo_path": "data/logos\\LunaJoy_logo.png"
}