{
    "links": "https://www.ycombinator.com/companies/lus-brands",
    "name": "LUS Brands",
    "headline": "Hair care products for curly hair.",
    "batch": "W18",
    "description": "LUS (Love Ur Self) Brands is a \"non-beauty\"​ beauty brand startup based in Toronto, Canada. Launched as an e-Commerce brand in Jan 2017, LUS aims to create innovative products that help consumers embrace their own natural and unique features, instead of altering or masking them.\r\n\nOur first product line, Love Ur Curls, consists of a simplified 3-step system for consumers with naturally curly/textured hair. Our innovative styling products are water-activated and customized for different hair types: wavy, curly, and kinky-coily.",
    "activity_status": "Active",
    "website": "http://lusbrands.com",
    "founded_date": null,
    "team_size": 20.0,
    "location": "Toronto, Canada",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:beauty",
    "founders": [],
    "status": true,
    "generated_description": "### LUS Brands: Embrace Your Curls\n\n**Overview**  \nLUS Brands, originally known as Love Ur Self Brands, is a Toronto-based startup focused on creating hair care products specifically designed for people with curly hair. Launched in January 2017, LUS is not your typical beauty brand; instead, it aims to celebrate individuality by offering effective solutions that emphasize maintaining and loving your natural textures rather than hiding them.\n\n**Mission**  \nAt its core, LUS Brands is dedicated to crafting hair care products that empower individuals to embrace their unique textures. They’ve developed a range of innovative, easy-to-use products that cater to various curl types, allowing users to simplify their hair care routines and feel confident in their natural beauty.\n\n**Key Product Line**  \nTheir flagship line, *Love Ur Curls*, introduces a simplifying three-step system: Cleanse, Condition, and Style. This system is tailored specifically for different curl types—wavy, curly, and kinky-coily—making it easier for consumers to achieve the hair of their dreams without the clutter of countless products. Each product within the line is specially formulated to activate with water, providing a straightforward approach to hair care.\n\n**Growth and Impact**  \nLUS Brands is a member of Y Combinator's W18 batch and has quickly built a dedicated team of 20 employees, serving a loyal customer base of over 1.5 million curly-haired enthusiasts worldwide. Their success is not just seen in sales but in the glowing testimonials from users who have transformed their hair care routines.\n\n**Community and Educational Resources**  \nLUS does more than just sell products; they actively engage with their community through hair care resources, including a *Curl Quiz* to help customers identify their curl type and find the best products for their needs. This educational aspect demonstrates their commitment to not just selling, but teaching and empowering consumers.\n\n**Where to Find Them**  \nYou can explore their products and resources on their website at [lusbrands.com](http://lusbrands.com). The website offers a seamless shopping experience, showcasing their product lines along with various educational materials and a blog dedicated to hair care tips and tricks.\n\nIn summary, LUS Brands stands as a refreshing voice in the beauty industry, transforming the narrative around curly hair and helping customers not just love, but celebrate their natural beauty. It's a brand that invites you to stop fixing your hair and start loving it—one curl at a time.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/be01c30507cf1c2c158bbc166e7f147e01796fc9.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191516Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=e0488399154534bc24b756217e18a440c4242d9cd7fbf1a1801d6a88cf130783",
    "social_links": [
        "https://www.facebook.com/lusbrands"
    ],
    "logo_path": "data/logos\\LUS_Brands_logo.png"
}