{
    "links": "https://www.ycombinator.com/companies/luthor",
    "name": "Luthor",
    "headline": "AI Copilot for Marketing Compliance",
    "batch": "F24",
    "description": "Luthor is an AI-powered copilot for marketing compliance. We scan all your marketing content in real-time to flag risky language and suggest fixes, ensuring you adhere to regulations from agencies like the FTC, FDA, and SEC. With Luthor, you can manage your marketing efforts confidently, knowing your content remains compliant.",
    "activity_status": "Active",
    "website": "https://luthor.ai",
    "founded_date": 2024.0,
    "team_size": 2.0,
    "location": null,
    "group_partner": "Garry Tan",
    "group_partner_yc": "https://www.ycombinator.com/people/garry-tan",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:artificial-intelligence; industry:b2b; industry:marketing",
    "founders": [
        {
            "name": "Glenn Espinosa, Founder",
            "description": "Glenn is a software engineer who previously built AI tooling at Square. At Square the AI tooling he built enabled SMBs to compete in an increasingly crowded digital marketing space. He's seen SMBs go from 50 to 50k monthly visitors using the marketing tools he built.",
            "linkedin": "https://www.linkedin.com/in/glennespinosa"
        },
        {
            "name": "John Espinosa, Founder",
            "description": "John is a software engineer who was previously a senior engineer at Legal.io, a legal tech company where he developed tools to improve workflows for enterprise lawyers and counsel. He also built the backend system for the largest local print marketing provider in the U.S., coordinating thousands of designers, copywriters, and editors to deliver over 100k custom content pieces per month.",
            "linkedin": "https://www.linkedin.com/in/johnespinosa1988/"
        }
    ],
    "status": true,
    "generated_description": "Luthor is a fresh startup that has entered the scene as an AI-powered copilot designed specifically for marketing compliance. Founded in 2024 and part of Y Combinator Batch F24, Luthor resides in the vibrant tech scene of the Bay Area. With a compact team of just two, they’re already making waves by helping businesses navigate the complex waters of regulatory compliance with ease and confidence.\n\nTheir core mission? To scan marketing content in real-time to identify and flag potentially risky language. Whether dealing with guidelines from the FTC, FDA, or SEC, Luthor ensures your marketing efforts stay on the right side of the law. You can think of it like having a vigilant co-pilot who keeps an eye on your marketing assets, reducing the risk, effort, and time it typically takes to maneuver through compliance.\n\nWith AI at the helm, Luthor is streamlining the compliance process, allowing businesses to focus on creativity rather than worrying about regulatory pitfalls. This remarkable approach is already being trusted by notable clients, including tech giants and educational institutions. \n\nTheir website, [luthor.ai](https://luthor.ai), serves as a portal for companies looking to ensure their marketing doesn't run afoul of the law. And in true startup fashion, they’re actively requesting access inquiries, hinting at a solid growth strategy.\n\nAs an agile player in the artificial intelligence and B2B marketing landscape, Luthor is well-positioned to carve out a substantial role in the future of compliant marketing strategies. It’s exciting to see how this duo will lever their backing from seasoned investors, including Group Partner Garry Tan, to scale their impact rapidly. If you’re in the marketing space and compliance is on your mind, you might want to keep an eye on Luthor.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/67f57e3b28f5cb03021bb117282e6c7f5fafc52a.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191516Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=54816d9ce85fff90c53847520421d6d6c366083c59602ff764f9790615de17fe",
    "social_links": [
        "https://www.linkedin.com/company/luthor",
        "https://x.com/luthorai",
        "https://www.crunchbase.com/organization/luthor-ai"
    ],
    "logo_path": "data/logos\\Luthor_logo.png"
}