{
    "links": "https://www.ycombinator.com/companies/lyra",
    "name": "Lyra",
    "headline": "Spend crypto anywhere online",
    "batch": "S22",
    "description": "Lyra is a crypto-native virtual card provider that allows users to easily create cards and fund them with cryptocurrency. Create virtual cards directly from your browser through our Chrome extension for all your purchases and subscriptions.",
    "activity_status": "Active",
    "website": "https://paywithlyra.com/",
    "founded_date": 2021.0,
    "team_size": 3.0,
    "location": "New York",
    "group_partner": "Dalton Caldwell",
    "group_partner_yc": "https://www.ycombinator.com/people/dalton-caldwell",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:crypto-web3; industry:consumer; industry:nft; location:new-york",
    "founders": [
        {
            "name": "Griffin Wheeler, Founder",
            "description": "Software developer turned serial entrepreneur.\n\nPreviously: Founder & Lead Developer of a seven-figure software development company with a community of over 12,000 users\n\nCurrently: Building Lyra, a crypto payment solution",
            "linkedin": "https://www.linkedin.com/in/griffintwheeler/"
        }
    ],
    "status": true,
    "generated_description": "**Lyra: The Crypto Payment Revolution**\n\nFounded in 2021 and part of Y Combinator’s Summer 2022 batch, Lyra is a New York-based startup on a mission to make spending cryptocurrency as seamless as traditional currency. The team, currently at three members, is leveraging innovative technology to help users spend their crypto anywhere online, essentially making it a one-stop solution for those eager to integrate digital currencies into everyday purchases.\n\n### What Does Lyra Do?\n\nLyra provides users with the ability to create virtual prepaid cards that can be loaded with various supported cryptocurrencies, including Bitcoin (BTC), Ethereum (ETH), Solana (SOL), and more. It’s like having your digital wallet be your shopping companion. Users can generate these cards directly from their browser through a handy Chrome extension.\n\n### Key Features:\n\n- **Instant Card Creation**: Users can create virtual cards in seconds, fund them with any of Lyra’s 10+ supported cryptocurrencies, and start shopping at millions of online merchants instantly.\n  \n- **Manage Spending**: The platform offers a dashboard to track previous transactions, set spending limits, and self-custody your crypto, all with no hidden fees.\n\n- **Free to Use**: That's right—Lyra is entirely free. They thrive on a model where they share revenue with card merchants instead of charging users.\n\nThis solution opens doors for daily interactions with crypto, whether for subscriptions, one-time purchases, or simply indulging in online shopping.\n\n### The Support and Backing\n\nLyra stands out as a product backed by the prestigious Y Combinator, signifying trust and potential within the notoriously fickle startup ecosystem. Dalton Caldwell, as their Group Partner, adds a layer of guidance that can be invaluable for any startup navigating the challenges ahead.\n\n### Target Market & Community Engagement\n\nAs the company surges forward, it’s tagged with keywords like ‘crypto-web3’ and ‘consumer’—all pointing to its role in democratizing crypto. For early adopters or anyone intrigued by the intersection of traditional finance and innovative technologies, sign-ups for early access indicate Lyra’s commitment to engaging with its community directly.\n\n### Why It Matters\n\nIn a rapidly evolving financial landscape, Lyra represents an essential step toward integrating cryptocurrency into everyday financial activities—turning a complex and often intimidating ecosystem into something accessible and user-friendly.\n\n### Conclusion\n\nSo, if you’re looking to spend your cryptocurrency more freely and easily, consider giving Lyra a shot. They’re not just a service; they’re crafting the future of how we interact with our digital currencies, making personal financial autonomy a reality rather than just a dream.\n\nFor more about Lyra or to get started, check out their [website](https://paywithlyra.com/).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/3ed56696e199c445e93a984c52e67a2d7105fb34.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191517Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=68ba8c64825072e380b8e7c37057d51a9663e308164c209fb11ea9a46842b703",
    "social_links": [
        "https://twitter.com/lyrapay_"
    ],
    "logo_path": "data/logos\\Lyra_logo.png"
}