{
    "links": "https://www.ycombinator.com/companies/machine26",
    "name": "Machine26",
    "headline": "Marketplace for construction machines",
    "batch": "W21",
    "description": "Machine26 is a marketplace that helps construction machine owners to sell their machines without any effort. Our inspection app collects all relevant data on the machine condition so that our customers can receive the best offer from international used dealers within a few days.",
    "activity_status": "Active",
    "website": "https://www.machine26.com/",
    "founded_date": 2019.0,
    "team_size": 12.0,
    "location": "Berlin, Germany",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:marketplace; industry:construction",
    "founders": [],
    "status": true,
    "generated_description": "**Machine26: Simplifying the Marketplace for Construction Equipment**\n\nFounded in 2019 and based in Berlin, Germany, Machine26 is a revolutionary online marketplace designed specifically for the construction industry. Initially conceived to streamline the selling process for construction machinery owners, it has grown into a vital tool for anyone looking to trade heavy equipment efficiently.\n\nThe core mission here is straightforward: to enable construction machine owners to sell their equipment effortlessly. Through their inspection app, Machine26 gathers comprehensive data on each machine's condition, allowing sellers to receive optimal offers from a network of international used dealers—all within a matter of days. This makes it not just easy, but also secure, as sellers maintain full control over their transactions.\n\nBeing part of Y Combinator's batch W21 has undoubtedly propelled Machine26 forward, offering them mentorship and exposure to a wider audience. The company operates with a lean team of 12 dedicated individuals, all passionate about revolutionizing the construction marketplace. With notable partnerships, including support from various industry leaders and institutions, Machine26 is swiftly gaining traction.\n\nTheir website, which you can explore [here](https://www.machine26.com), offers various resources including a login for returning users, a registration page for new dealers, and detailed insights into the marketplace's operations.\n\n**Key Features:**\n1. **Buyer Network Expansion**: Users can either introduce their existing buyer group or tap into Machine26's verified network, expanding their sales horizons.\n2. **Dynamic Bidding Options**: Sellers can choose from multiple bidding methods to secure the best market price for their equipment.\n3. **Inspection App**: A tool highly praised for its ease of use, the inspection app allows quick checks and documentation of machine conditions, enhancing transparency and efficiency in sales.\n4. **Control and Flexibility**: Sellers can choose to accept or reject purchase bids without pressure, fostering a fair and straightforward selling environment.\n\n**Voices from the Field**: \nLeading companies in the construction sector have already benefited from Machine26. For instance, Julian Langowski from Eurovia GmbH states, “With Machine26, we have professionalized our sell off. This saves us valuable time & costs and creates a fair process for buyers.”\n\nTo encapsulate Machine26 in a nutshell: it's bridging the gap between machine owners and buyers in an efficient and modern way. The number \"26\" represents iron in the periodic table, emblematic of the vital component that construction machinery relies upon. This clever branding resonates with their focus on the construction industry.\n\nSo, if you're in the construction world and looking to optimize how you buy or sell machinery, Machine26 is poised to be your go-to platform. Check them out, and who knows? You might find the process is easier and more advantageous than you ever imagined.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/976418153f7dbe3dc69501b2217cb26586e7e297.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191518Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=c37008ed29fc1eba1dc06c0f4187a5bb965eae3153b4bc98ceeb1d4757d76956",
    "social_links": [
        "https://www.linkedin.com/company/machine26-gmbh/",
        "https://www.facebook.com/machine26gmbh"
    ],
    "logo_path": "data/logos\\Machine26_logo.png"
}