{
    "links": "https://www.ycombinator.com/companies/magnaplay",
    "name": "MagnaPlay",
    "headline": "AI-powered game translation.",
    "batch": "W23",
    "description": "MagnaPlay is game translation simplified into SAAS. Every game needs to be translated - a process which currently consists of finding freelancers, verifying their quality, negotiating prices, building contracts and waiting months for them to deliver. \r\n\nWith MagnaPlay, game developers cut out the middleman and get results 5x faster, at half the price and with more reliable quality. Our combination of AI, expert translators and SAAS fully integrates translation into the gamedev workflow, ensuring games are translated and reach the worldwide audiences that love them so much.",
    "activity_status": "Active",
    "website": "https://magnaplay.com",
    "founded_date": 2023.0,
    "team_size": 5.0,
    "location": null,
    "group_partner": "Dalton Caldwell",
    "group_partner_yc": "https://www.ycombinator.com/people/dalton-caldwell",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": null,
    "founders": [
        {
            "name": "Paulo Rodrigues, Founder",
            "description": "Paulo is co-founder and CTO at MagnaPlay, an AI-powered game localization service. He recently dropped out of the University of Chicago and is working towards democratizing game development by making it a frictionless development experience.",
            "linkedin": "https://www.linkedin.com/in/rossirpaulo"
        },
        {
            "name": "Eugenio Sánchez Rabiella, Founder",
            "description": "2nd time founder leading Product and Operations in Magnaplay. Previously founded and led revenue in Flint (W18, Acquired by Grin in 2019), led research in Grin (S18), and product in Origin Financial. \n\nFull stack product leader experienced in research, ideation, design and implementation.",
            "linkedin": "https://www.linkedin.com/in/cesrabiella/"
        }
    ],
    "status": true,
    "generated_description": "**MagnaPlay - Revolutionizing Game Translation**\n\nFounded in 2023 and backed by Y Combinator’s W23 batch, MagnaPlay is on a mission to simplify game localization with AI-powered translation services tailored for game developers. The company emerged from the recognition that the traditional game translation process is riddled with inefficiencies—think finding freelancers, vetting their quality, negotiating contracts, and then playing the waiting game for months.\n\nWith MagnaPlay, game developers can skip these hurdles. The platform promises to deliver translations five times faster, at half the cost, and with a side of reliability that’s often hard to find. By fusing AI technology with expert human translators, MagnaPlay ensures that game localization integrates smoothly into the game development workflow. After all, every game deserves to be experienced by a global audience.\n\n**The Heart of MagnaPlay**\n\nThe platform is designed specifically for game developers and publishers, offering various features to enhance the localization process:\n\n1. **Complete Transparency**: Localization doesn’t have to be a black box. MagnaPlay provides tools that keep developers informed throughout the translation process.\n  \n2. **Expert Oversight**: Traditional localization services involve a lot of guesswork. With MagnaPlay, expert linguists oversee the localization, ensuring cultural nuances are respected and quality is maintained.\n\n3. **UI Quality Assurance**: Nobody enjoys quality assurance, but MagnaPlay simplifies it by checking strings across languages to catch potential issues early on.\n\n4. **Translation Copilot**: It’s like having a co-pilot for translation—automating glossary creation, maintaining translation memories, and offering guidelines that enhance efficiency.\n\n5. **Flexible Solutions**: Whether you’re in need of traditional linguist localization or fast-turnaround AI/MT localization, MagnaPlay adapts to your project needs.\n\n**Pricing and Accessibility**\n\nMagnaPlay offers a range of pricing plans to suit different development teams, starting with a platform subscription at $250/month, which includes essential tools like state-of-the-art machine translation and full API access. For those needing dedicated support, the Linguist Localization plan is available at a competitive rate per word.\n\n**The Team Behind the Innovation**\n\nCurrently, MagnaPlay operates with a small team of five, emphasizing agility and focus. Their Group Partner, Dalton Caldwell, lends his expertise to guide their innovative journey.\n\n**Wrapping it Up**\n\nFor game developers looking to break free from the traditional, convoluted localization process, MagnaPlay stands as a beacon of simplicity and speed. It’s about putting power back into the hands of developers and ensuring that games can resonate with players around the globe without all the typical hassle. If you want to learn more or dive in, check out [MagnaPlay's website](https://magnaplay.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/05c5f0f38dc1a7aac632d5b11efca6f5640f1095.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191519Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=44936cb10d2a4a83bf00bd0a43c26f91673c8672f43db5442971ccadb9183ad0",
    "social_links": [
        "https://www.linkedin.com/company/magnaplay/"
    ],
    "logo_path": "data/logos\\MagnaPlay_logo.png"
}