{
    "links": "https://www.ycombinator.com/companies/mahaana-wealth",
    "name": "Mahaana Wealth",
    "headline": "Mahaana is first & only licensed digital wealth manager in Pakistan",
    "batch": "W22",
    "description": "Pakistan has 401K style schemes for retirement but only 0.02% people have retirement accounts. Previously unallowed, Digital onboarding & KYC was adopted by the regulator in late 2021. We are the first & only licensed digital investment advisor and looking to take advantage of this regulatory tailwind. We are now licensed to create our own retirement funds & ETFs just like Vanguard",
    "activity_status": "Active",
    "website": "http://mahaana.com",
    "founded_date": 2021.0,
    "team_size": 6.0,
    "location": "Islamabad, Pakistan",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech",
    "founders": [
        {
            "name": "Muhammad Shamoon Tariq, Founder",
            "description": "Before starting his startup in Pakistan, Mahaana, Shamoon has been working as a Partner in a Swedish based Investment manager & ranked as top 3 global investment manager in Frontier markets space. He is a CFA and FDP charter holder.",
            "linkedin": "https://www.linkedin.com/in/muhammad-shamoon-tariq-cfa-24b40a80/"
        }
    ],
    "status": true,
    "generated_description": "**Mahaana Wealth: Pioneering Digital Wealth Management in Pakistan**\n\nFounded in 2021 and based in Islamabad, Mahaana Wealth is making waves as Pakistan's first and only licensed digital wealth manager, operating under the regulation of the Securities and Exchange Commission of Pakistan (SECP). With a team of six ambitious professionals and the backing of notable sponsors, including Tundra Fonder from Sweden, Mahaana is on a mission to transform the investment landscape in Pakistan.\n\n**What Sets Mahaana Apart?**\n\nMahaana Wealth started with a focus on retirement savings, addressing a staggering statistic: only 0.02% of the Pakistani population currently has retirement accounts. This gap presents a massive opportunity. Leveraging the regulatory changes from late 2021, which allowed for digital onboarding and simpler KYC processes, Mahaana intends to democratize access to wealth management. They have positioned themselves to create custom retirement funds and ETFs, similar to what Vanguard offers in the West.\n\n**Investment Philosophy and Offerings**\n\nMahaana combines cutting-edge technology with expertise in financial management to provide tailored investment solutions. Their approach is rooted in understanding individual risk and return targets, optimizing management for higher yields at lower costs, and ensuring transparency through a personalized client portal. \n\nThey offer various products like the Mahaana Islamic Cash Fund (MICF) and the Mahaana Islamic Index Exchange Traded Fund (MIIETF), which is set to start trading in March 2024. The company prides itself on handling Shariah-compliant assets, making it a viable option for investors concerned about ethical investment practices.\n\nMahaana invites clients to simplify their experience by allowing them to sign up and fund their accounts online in under ten minutes, starting with as little as PKR 1,000 (about $4). They employ an auto-invest strategy that adjusts to market conditions and client preferences, reducing the burden of active management for their customers.\n\n**Looking Ahead**\n\nAs Mahaana Wealth continues to navigate the evolving investment climate in Pakistan, it stands ready to empower individuals with the tools they need to build wealth and secure their financial futures. By bridging the gap in retirement planning and investment accessibility, Mahaana represents not just a business, but a shift in how wealth is managed in the region.\n\nIn a market ripe for disruption, Mahaana’s commitment to innovation, transparency, and client-centric solutions positions it uniquely as a trailblazer in the fintech sector. As the first digital asset management company in Pakistan, it’s only the beginning for this forward-thinking firm. \n\nFor more information, visit their website at [Mahaana Wealth](http://mahaana.com).",
    "logo": "/logos/medium/missing.png",
    "social_links": []
}