{
    "links": "https://www.ycombinator.com/companies/mailtime",
    "name": "MailTime",
    "headline": "Emails as quick and easy as text messaging.",
    "batch": "W16",
    "description": "MailTime Email Messenger: Mobile email client that makes emails as quick and easy as texting.\r\n\nMailTime AI: Draft and proofread emails using generative AI.",
    "activity_status": "Active",
    "website": "http://mailtime.com",
    "founded_date": 2014.0,
    "team_size": 18.0,
    "location": "Hong Kong, Hong Kong",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:productivity; industry:consumer-products; industry:email",
    "founders": [],
    "status": true,
    "generated_description": "**MailTime: Revolutionizing Email Communication**\n\nMailTime is at the intersection of emails and messaging, simplifying the way we communicate through emails, making them as easy and quick to use as text messaging. Founded in 2014 and part of the prestigious Y Combinator Batch W16, MailTime has positioned itself as a significant player in the productivity and consumer products sectors, specifically focusing on email solutions.\n\n**What They Do**\n\nInitially launched as the MailTime Email Messenger, the company developed a mobile email client designed to streamline email communication. Users can view their emails as conversations rather than threaded chains, cutting through the clutter of metadata, which makes reading and responding to emails more intuitive. \n\nRecently, MailTime has expanded its capabilities with **MailTime AI**, a generative AI feature that helps users draft and proofread their emails, enhancing their writing efficiency. \n\n**Team and Location**\n\nOperating out of Hong Kong, MailTime has a dedicated team of 18 employees, underscoring its commitment to innovation and user satisfaction. The group is led by knowledgeable partners, including their Group Partner, Nan, who bring valuable experience to the table.\n\n**User Experience**\n\nMailTime supports all major email services—Gmail, Yahoo, Outlook, iCloud, and even corporate email systems. This versatility allows users to manage all their communications from a single, user-friendly app.\n\nPrivacy matters too: MailTime is fully compliant with GDPR regulations, offering users control over their data sharing preferences directly within the app. \n\n**Recognition and Awards**\n\nMailTime has received accolades for its intuitive design and functionality, including being recognized in the App Store Best of 2015. They have been featured in several prominent publications, such as TechCrunch, CNBC, and Lifehacker, drawing attention to the way they enhance productivity.\n\n**How to Connect**\n\nIf you're ready to experience email as simply as texting, download the MailTime app available on both the [App Store](http://mailtime.com/<https:/mailtime.onelink.me/euvx/websiteiOSbutton>) and [Google Play](http://mailtime.com/<https:/mailtime.onelink.me/euvx/websiteAndroidbutton>). \n\nFor further information, inquiries, or support, you can visit their website at [MailTime.com](http://mailtime.com) or reach out via email at support@mailtime.com.\n\nIn a world where communication is key, MailTime is a refreshing approach to transforming one of our oldest digital tools into a more dynamic and engaging experience. By merging the familiarity of texting with email, it's carving out a niche that feels both innovative and essential.",
    "logo": "/logos/medium/missing.png",
    "social_links": [
        "https://www.crunchbase.com/organization/mailtime"
    ]
}