{
    "links": "https://www.ycombinator.com/companies/mailmodo",
    "name": "Mailmodo",
    "headline": "No-code email marketing platform to send forms & widgets within emails",
    "batch": "S21",
    "description": "Mailmodo is an email marketing software that helps marketers create app-like experiences in email by adding forms, shopping cart, calendar, NPS and more widgets within the email. Our interactive emails reduce the number of steps for users, thereby increasing email conversions. You can use it to collect feedback from your users, book meetings with prospects, recover abandon carts, generate leads, and more all within emails.",
    "activity_status": "Active",
    "website": "https://www.mailmodo.com/",
    "founded_date": 2020.0,
    "team_size": 70.0,
    "location": "San Francisco",
    "group_partner": "Michael Seibel",
    "group_partner_yc": "https://www.ycombinator.com/people/michael-seibel",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:saas; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Apurv Gupta, Co-founder, CPO",
            "description": "Apurv Gupta is a seasoned technology leader and serial entrepreneur with over 13 years of experience in building and scaling B2B SaaS startups. As the Co-founder and Chief Product Officer of Mailmodo, he has led product strategy and planning, served a variety of customers across industries, and built high-performing engineering teams. Previously, he co-founded Flick2Know, where he led the development of FieldAssist, scaling it to $3M ARR without external funding.",
            "linkedin": "https://www.linkedin.com/in/apurvgpt/"
        },
        {
            "name": "Aquibur Rahman, Co-founder, CEO",
            "description": "Aquibur Rahman is a growth-focused entrepreneur and marketing leader, currently building Mailmodo, a B2B SaaS platform that helps businesses achieve 3x higher conversions through interactive, app-like widgets inside emails. As the CEO and Co-founder, he has led the company’s vision, driving product adoption and customer growth. Previously, he headed marketing at Cleartax, growing organic traffic 5x in one year, scaling CleartaxGST to 600,000+ signups, and driving multi-crore AUM in mutual funds.",
            "linkedin": "https://www.linkedin.com/in/aquibur/"
        }
    ],
    "status": true,
    "generated_description": "**Mailmodo: Transforming Email Engagement with Interactivity**\n\nFounded in 2020 and part of Y Combinator’s Summer 2021 batch, Mailmodo is an innovative no-code email marketing platform based in San Francisco. With a team of 70 talented individuals, the company is on a mission to redefine how we interact with emails.\n\n### What is Mailmodo all about?\n\nAt its core, Mailmodo empowers marketers to create app-like experiences right within emails. Gone are the days of rigid, static messages. With Mailmodo, you can embed forms, shopping carts, calendars, NPS surveys, and other interactive widgets directly into your emails. This approach reduces the number of steps for users, leading to higher conversion rates—from collecting feedback to booking meetings or recovering abandoned carts, it’s all possible right from the inbox.\n\n### Key Features\n\nMailmodo’s platform comes packed with practical features:\n\n- **Drag & Drop Editor:** Design stunning emails effortlessly, no coding required.\n- **Interactive AMP Emails:** Utilize AMP (Accelerated Mobile Pages) to enhance engagement and deliver dynamic content.\n- **Mailmodo AI for Email:** Get assistance with composing subject lines, writing pre-headers, and reviewing email copy, leveraging AI to optimize your email campaigns.\n- **Smart Segmentation:** Tailor campaigns based on user engagement and behavior for precise targeting.\n- **Managed Deliverability:** Trust that your emails will land in inboxes, thanks to expert monitoring of your domain and IP reputation.\n- **Automated Email Journeys:** Set up automated workflows with prebuilt templates for various marketing scenarios.\n\n### Use Cases\n\nCompanies are seeing tangible success using Mailmodo’s interactive emails:\n- **Foundit** achieved a 400% increase in registrations via interactive forms.\n- **BluSmart** experienced a 35% boost in engagement by integrating interactive quizzes.\n- **Razorpay** collected 257% more feedback through surveys embedded in emails.\n\n### Global Footprint\n\nMailmodo has established itself as a trusted platform, serving over 5,000 businesses across 20 countries. Supported by significant backing, it continues to broaden the scope of what email marketing can achieve on a global scale.\n\n### Why Mailmodo?\n\nAs traditional email marketing platforms struggle to keep up with rising user expectations for interactivity, Mailmodo not only meets the challenge but excels. The platform is designed with user-friendliness as a priority, allowing marketers to create highly engaging content without the need for technical knowledge.\n\nYou can explore their offerings and see how Mailmodo can elevate your email marketing game [here](https://www.mailmodo.com/). Whether you're looking to drive engagement, capture leads, or simply make your emails more enjoyable for your audience, Mailmodo is a no-brainer choice for fast-growing companies aiming to stand out in an overcrowded inbox.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/48f191a45bc29f42fc86c7bffe54cb83844f8ddf.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191520Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=2ec9249577ebbee899a54aad14c955793b7abd786d13e270e40733b7b3bd4fcf",
    "social_links": [
        "https://www.linkedin.com/company/mailmodo/",
        "https://twitter.com/mailmodo"
    ],
    "logo_path": "data/logos\\Mailmodo_logo.png"
}