{
    "links": "https://www.ycombinator.com/companies/makani-science",
    "name": "Makani Science",
    "headline": "Reinventing respiration monitoring",
    "batch": "S21",
    "description": "Makani Science is a medical device company based in Irvine, California. We have created the world's first wireless patch that can accurately and continuously monitor breathing. The company is co-founded by Dr. Michelle Khine and Dr. Michael Chu, two experts in the wearable monitoring space from the University of California, Irvine. \r\n\nThe Makani Science system will collect unique breathing waveforms from patients in everyday environments to create the first large database of respiratory patterns associated with different diseases. Data will be collected through systems sold to our initial beachhead market, where we will help improve monitoring safety in patients being sedated for medical procedures. Our long-term goal is to combine machine learning with this database to identify and predict respiratory complications for different patient populations. \r\n\nWe have a highly experienced team and will be FDA cleared in our beachhead market within a year.",
    "activity_status": "Active",
    "website": "http://makaniscience.net/",
    "founded_date": 2018.0,
    "team_size": 2.0,
    "location": "Irvine, CA",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:health-tech; industry:medical-devices",
    "founders": [
        {
            "name": "Michael Chu, Founder",
            "description": "Michael graduated, PhD, from the Department of Biomedical Engineering at the University of California Irvine, where he worked in Dr. Michelle Khine’s lab. His research focused on developing and using soft wearable sensors for noninvasive monitoring of physiologic vital signs. Michael has helped author over 10 peer reviewed papers and is also inventor of 3 patents submitted by the lab. His dissertation work served as the foundation for the Makani Science technology.",
            "linkedin": "https://www.linkedin.com/in/mchu8/"
        },
        {
            "name": "Michelle Khine, Founder",
            "description": "Professor of Biomedical Engineering and Serial Entrepreneur",
            "linkedin": "https://www.linkedin.com/in/michelle-khine-a7111315/"
        }
    ],
    "status": true,
    "generated_description": "**Makani Science: Reinventing Respiration Monitoring**\n\nMakani Science is a medical device company based in Irvine, California, founded in 2018. Co-founded by Dr. Michelle Khine and Dr. Michael Chu—experts in wearable monitoring from the University of California, Irvine—Makani aims to transform how we monitor respiration. They’ve developed the world’s first wireless patch designed for accurate and continuous breathing monitoring.\n\nThe mission? To create a comprehensive database of respiratory patterns linked to various diseases by collecting unique breathing waveforms from patients in everyday environments. Starting with a focus on improving safety in patients undergoing sedation during medical procedures, Makani's technology promises to usher in an era of smarter healthcare. The goal is to leverage machine learning on this database to identify and predict respiratory complications across different patient demographics.\n\nCurrently part of Y Combinator’s Batch S21, Makani Science consists of a small but highly experienced team of two employees. They are on a fast track to receiving FDA clearance for their initial market within the year, establishing a solid foundation for future growth.\n\nWith health-tech and medical devices as their core tags, Makani Science shows immense potential in addressing a crucial aspect of patient care—monitoring respiration. Their cutting-edge approach not only meets a pressing healthcare need but also opens avenues for advanced predictive analytics in respiratory health.\n\nFor more information, you can check their website at [Makani Science](http://makaniscience.net/).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/033a6da2804b5b1c1c3d466ecebb21545042a1f6.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191521Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=6fddc777f8f4551da0000e3690c5796e65af19b74e1b474477cf753f7c7a8b8b",
    "social_links": [],
    "logo_path": "data/logos\\Makani_Science_logo.png"
}