{
    "links": "https://www.ycombinator.com/companies/malama-health",
    "name": "Malama Health",
    "headline": "Doula-led holistic support during and after pregnancy",
    "batch": "S22",
    "description": "Malama offers doula-led holistic support during and after pregnancy at no cost to patients. Malama is in-network with Aetna, UnitedHealthcare, Anthem, Kaiser, and several Medicaid Managed Care Plans. \r\n\nMalama is backed by the Stanford d.school, Y Combinator (S22), Alpine Investors and more.",
    "activity_status": "Active",
    "website": "https://www.heymalama.co",
    "founded_date": 2022.0,
    "team_size": 3.0,
    "location": "Stanford, CA",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:health-tech; industry:digital-health; industry:healthcare; industry:femtech; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Mika Eddy, Founder",
            "description": "Mika is the co-founder and CEO of Malama Health, a maternal health company that delivers tech-enabled care for high risk perinatal conditions. Prior to Malama, Mika was the Director of Clinical Product Innovation at UnitedHealthcare, the largest health insurer in the world. There, she worked on achieving cost savings of $200M through digital health initiatives. Mika received her BA in human biology and MS in management from Stanford University, where she met her co-founders, Orlando and Daniela.",
            "linkedin": "http://www.linkedin.com/mikawang"
        },
        {
            "name": "Orlando Li, Founder",
            "description": "Orlando is the co-founder and CTO of Malama Health. Prior to Malama, he was a senior software engineer at Airbnb working on experiences. Orlando met his co-founder Mika 10 years ago while he was pursuing MS at UCLA.",
            "linkedin": "https://www.linkedin.com/in/orlandoli/"
        }
    ],
    "status": true,
    "generated_description": "**Malama Health: A Snapshot**\n\nFounded in 2022 and based in Stanford, California, Malama Health is a promising startup dedicated to doula-led holistic support for families during and after pregnancy. Imagine a world where every expecting mother has personalized, comprehensive support—well, that’s what Malama is striving for.\n\nTheir mission is clear: they aim to provide critical support without any cost to patients. Malama is in-network with major insurance providers like Aetna, UnitedHealthcare, and Anthem, along with various Medicaid Managed Care Plans, ensuring that their services are accessible to many.\n\n**The Essence of Malama Health**\n\nAt its core, Malama Health is about focusing on the entire journey of motherhood. They offer:\n\n- **Personalized Pregnancy Support**: From finding the right doula to tailored education on pregnancy health, Malama meets mothers where they are.\n- **Postpartum Wellness**: Understanding that the journey doesn't stop once the baby arrives, they provide ongoing support to new parents as they transition into parenthood.\n- **Tech-Enhanced Care**: Their app tracks various metrics, making it easier for mothers to manage their health and communicate with healthcare providers.\n\n**Backed by the Best**\n\nMalama has distinguished itself not just through its innovative approach but also with backing from recognized institutions like the Stanford d.school and Y Combinator (Batch S22). This sort of endorsement speaks volumes about their potential.\n\n**Keeping it Small but Mighty**\n\nWith a lean team of just three employees, Malama balances a startup energy with a dedication to quality service. Each team member plays a pivotal role in providing comprehensive care, which shows that you don’t need a large team to make a significant impact.\n\n**Community-Centric Approach**\n\nMalama understands the importance of community, with support teams consisting of OB/GYNs, dietitians, and experienced doulas. This integrated approach ensures that families receive the full spectrum of care tailored to their unique situations.\n\n**Conclusion**\n\nIn a landscape where healthcare can often feel impersonal and transactional, Malama Health sets itself apart by infusing humanity into the maternal health experience. They are building a community of healthy mamas and babies—over 50,000 strong—as they pave the way to better maternal health outcomes. For anyone navigating the often challenging path of pregnancy and early motherhood, Malama Health could be a crucial ally. \n\nExplore more about their services at [Malama Health's Website](https://www.heymalama.co).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/06db2ffe3e940f9f8166f9e637da6d45a6c88dd9.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191521Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=8a862acf3f05f1dffbd43f327928c2d12300a3561c3c27aa79b0c0af2b4f79bb",
    "social_links": [
        "https://www.linkedin.com/company/malama-health/",
        "https://www.twitter.com/heymalama",
        "https://www.instagram.com/heymalama/",
        "https://www.crunchbase.com/organization/malama-health"
    ],
    "logo_path": "data/logos\\Malama_Health_logo.png"
}