{
    "links": "https://www.ycombinator.com/companies/malibou",
    "name": "malibou",
    "headline": "the first all-in-one payroll and HR software for French SMBs",
    "batch": "W24",
    "description": "malibou is a web application helping French SMBs to manage employees, run payroll and track compliance in a single app.\r\n\nWhen processing payroll in France, you either have the choice between an accountant with good advice but no way to connect an HRIS with him, or a good HRIS that does not include payroll services. It was time for a change, to finally bring payroll and HR at the same place. \r\n\nDue to increasing competition in the space, French payroll engines have just opened their APIs. This allows us to offer a unified payroll and HR solution, which wasn't possible before.",
    "activity_status": "Active",
    "website": "https://www.malibou.co",
    "founded_date": 2023.0,
    "team_size": 2.0,
    "location": "Paris, France",
    "group_partner": "Brad Flora",
    "group_partner_yc": "https://www.ycombinator.com/people/brad-flora",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:b2b; industry:productivity; industry:hr-tech; industry:payroll; industry:smb",
    "founders": [
        {
            "name": "Maxence Drummond, Founder",
            "description": "Co-founder and CEO @malibou 🌴. Graduated from Science Po in Paris, France. After school, I started working in SF helping French tech startups to land in the U.S.. Then joined a VC fund in Paris called Breega, went from associate to Partner, stayed there 5 years and opened their office in the U.K.. Wanted to go to the other side of the table, this time as an entrepreneur!",
            "linkedin": "https://linkedin.com/in/maxence-drummond-485057b4"
        },
        {
            "name": "Alexandre Pernin, Founder",
            "description": "Co-founder and CTO @malibou 🌴. Spent my college days studying Maths and Computer Sc. at CentraleSupelec, followed by a second master at the Paris School of Economics. After school, I co-founded a first YC startup in the data space, then joined Theodo (Thoughtworks equiv.) to build various B2B tech products. Now I'm back at YC for round #2, this time as CTO in the HR & Payroll space.",
            "linkedin": "https://linkedin.com/in/alexandre-pernin-602308a3"
        }
    ],
    "status": true,
    "generated_description": "**Company Name:** Malibou\n\n**Mission:** Malibou aims to be the first all-in-one payroll and HR software tailored specifically for French Small and Medium-sized Businesses (SMBs). \n\n**Company Overview:** Founded in 2023, Malibou originated as a web application designed to simplify the management of employees, streamline payroll processes, and ensure compliance—all from a single platform. The impetus for Malibou stemmed from the frustrating reality that in France, businesses often have to choose between an accountant—who may provide sound advice but lacks integration with HR systems—or a competent HR information system that doesn't handle payroll. This disconnect was something that needed addressing. \n\n**Opportunities:** With the recent opening of APIs from French payroll engines, Malibou can now offer a unified payroll and HR solution, which is a game-changer in the landscape of SMB services.\n\n**Location and Team:** Based in Paris, France, Malibou currently operates with a lean team of just two employees and is backed by Brad Flora as a Group Partner. \n\n**Product Offering:** Malibou's software provides a plethora of features designed to alleviate headaches associated with payroll and HR management. Some key capabilities include:\n- Instant payroll processing and compliance checks\n- Time management to oversee working hours and compensation\n- Centralized management for absences and remote work\n- Structured interview campaigns with templates\n- Expense tracking and reimbursements\n- Direct chat support with a dedicated payroll expert\n\n**Target Market:** The software caters to various company sizes, be it 5-20 employees, 20-50 employees, or over 50 employees, making it suitable for a wide range of SMBs in France.\n\n**Tags:** Malibou is tagged as B2B, productivity, HR-tech, payroll, and SMB.\n\n**Funding:** The company is a part of Y Combinator Batch W24, indicating a solid foundation and support structure for scaling its operations.\n\n**Website:** For more details, you can check Malibou's website at [Malibou](https://www.malibou.co).\n\nIn short, Malibou is redefining how payroll and HR are managed in the French SMB landscape by providing a comprehensive, integrated solution that simplifies these critical business functions.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/f048b366fbd9ead8c862e5dcde966d2143f89918.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191522Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=6f20405912c414e0dfda3a998fead2d70ddd25bd5c180a72b14d8bef0ff8a7f7",
    "social_links": [
        "https://www.linkedin.com/company/malibou-hr/"
    ],
    "logo_path": "data/logos\\malibou_logo.png"
}