{
    "links": "https://www.ycombinator.com/companies/malloc",
    "name": "Malloc",
    "headline": "AI-driven startup focused on mobile and app security.",
    "batch": "S21",
    "description": "Malloc aims to help people companies and organisations protect their apps, their devices and their data. The Malloc app available in AppStore and PlayStore helps you stay safe and private online by blocking spyware and online threats. Malloc App Security is an SDK library that other app owners can use to protect their app from hacking attempts.",
    "activity_status": "Active",
    "website": "https://mallocprivacy.com/",
    "founded_date": 2021.0,
    "team_size": 7.0,
    "location": "Nicosia, Cyprus",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:machine-learning; industry:saas; industry:consumer; industry:security",
    "founders": [
        {
            "name": "Maria Terzi, Founder",
            "description": "Maria Terzi is the co-founder and CEO of Malloc. Maria holds a Ph.D. in Machine Learning and Recommender Systems. During her Ph.D., she won two Google hackathons and has previously worked at Google. Maria holds extensive experience in R&D in the areas of data analysis, machine learning, secure and private AI.",
            "linkedin": "https://www.linkedin.com/in/maria-terzi/"
        },
        {
            "name": "Liza Charalambous, Founder",
            "description": "Liza Charalambous is a Digital Security expert with 8+ years of experience in the ideation and implementation of (cyber) security projects. Liza holds a PhD in machine learning, as well as academic titles in signal processing and AI and digital communications. Over the years, she collaborated with various privately owned and public organizations to provide solutions that improve users’ quality of life.",
            "linkedin": "https://www.linkedin.com/in/lzcharalambous/"
        }
    ],
    "status": true,
    "generated_description": "Malloc is a promising AI-driven startup specializing in mobile and app security. Founded in 2021 and hailing from Nicosia, Cyprus, Malloc is part of the Y Combinator Batch S21, a testament to its innovative approach and potential for impact.\n\nAt its core, Malloc aims to empower individuals and organizations to safeguard their apps, devices, and personal data. This is particularly crucial in today's digital landscape, where online threats are increasingly prevalent. Their flagship product, the Malloc app, is designed to enhance online safety by blocking spyware and various cyber threats, available for download on both the App Store and Play Store. \n\nFurthermore, Malloc provides an SDK library known as Malloc App Security, which app developers can integrate into their applications to fortify them against hacking attempts. This dual offering caters effectively to both consumers looking for personal security and businesses aiming to protect their applications from vulnerabilities.\n\nWith a compact team of seven and supported by Group Partner Nan, Malloc is making strides in the fields tagged as machine learning, SaaS, consumer security, and more. If you want to learn more about what Malloc has to offer, you can visit their website at [mallocprivacy.com](https://mallocprivacy.com/) where you'll find resources on their products, business opportunities, and support services.\n\nIn essence, Malloc represents a thoughtful step towards making the ever-expanding mobile ecosystem safer for everyone, proving that strong security can, and should, be accessible to all.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/9fe2543ae83c4800fa16cc071492aaadbd71442e.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191523Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=c53a95d17c166c2f7a0acdcbd39a2786acd3be14d1441c06abdc8cd0e4bcf8a1",
    "social_links": [
        "https://www.linkedin.com/company/68859929/",
        "https://twitter.com/MallocPrivacy",
        "https://www.facebook.com/mallocprivacy",
        "https://www.crunchbase.com/organization/malloc-05ff"
    ],
    "logo_path": "data/logos\\Malloc_logo.png"
}