{
    "links": "https://www.ycombinator.com/companies/mango-health",
    "name": "Mango Health",
    "headline": "AI Therapy for OCD",
    "batch": "W24",
    "description": "Mango Health delivers AI-powered therapy for OCD, offering personalized care that adapts to your experience, credibility backed by expert input, and complete anonymity—your data stays private.\r\n\nStart today at TheMangoHealth.com :)",
    "activity_status": "Active",
    "website": "https://themangohealth.com",
    "founded_date": 2023.0,
    "team_size": 2.0,
    "location": "San Francisco",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:health-insurance; industry:mental-health; industry:ai; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Jamison Mercurio, Founder",
            "description": "Co-founder and CEO at Mango Health. Former Meta iOS and web engineer (Messenger Video Chat + Facebook News). Princeton CS Class of 2020. Have shadowed and interviewed 160+ PCPs & therapists, and am building the future of healthcare with Zach Gittelman.",
            "linkedin": "https://linkedin.com/in/jamison-mercurio"
        },
        {
            "name": "Zachary Gittelman, Founder",
            "description": "Co-founder and CTO at Mango Health. A proud Michigan and Cornell CS alum, I have experience at multiple healthcare start-ups - integrating into insurance billing platforms at Medly, optimizing scheduling automation for Mount Sinai, and building a medical supplies marketplace at Tomorrow Health. Creating the future of primary care with Jamison Mercurio.",
            "linkedin": "https://linkedin.com/in/zachary-gittelman-02229a9a"
        }
    ],
    "status": true,
    "generated_description": "### Mango Health: Redefining OCD Treatment with AI\n\nMango Health is here to tackle a pressing mental health issue: Obsessive-Compulsive Disorder (OCD). Founded in 2023 and part of Y Combinator Batch W24, this San Francisco-based startup is on a mission to deliver personalized, AI-powered therapy specifically designed for those grappling with OCD. With a small team of just two, co-founders Jamie and Zach are combining clinical expertise and personal experience to reshape how we approach OCD treatment.\n\n#### The Approach\nMango Health offers a unique blend of technology and therapeutic techniques. Their platform is built around **Evidence-Based Treatment**, particularly focusing on Exposure and Response Prevention (ERP), recognized as the gold standard for OCD management. This system was developed with input from over 20 specialists in the field, ensuring that the care provided is not only reliable but tailored to individual needs.\n\n#### How It Works\nMango Health’s offering is straightforward yet profound:\n\n1. **Interactive Lessons**: Engage with five-minute lessons that teach you proven techniques to manage OCD.\n2. **AI Therapy Sessions**: Work through ERP exercises guided by an AI therapist, helping to diminish the impact of intrusive thoughts.\n3. **Progress Tracking**: Monitor your starting OCD score and track your progress over time, aiding you in reclaiming control over daily activities.\n\nThe beauty of Mango is in its personalization. The platform adapts to each user’s unique experience by learning from interactions, considering factors like OCD subtype and the strategies that resonate most with you. \n\n#### Privacy and Accessibility\nConfidentiality is paramount at Mango Health. Regardless of your OCD subtype—be it related to harm, relationships, or psychosis—you can find support without fear of judgment. No personal information is required, ensuring your data remains completely private.\n\n#### Meet the Team\n- **Jamie**: Co-founder and CEO, a Princeton grad with a background in engineering at Facebook, bringing technical expertise to the forefront of AI therapy.\n- **Zach**: Co-founder and CTO, a Cornell alum who uniquely understands the trials of OCD treatment, ensuring the app speaks to the real challenges users face.\n\n#### Why It Matters\nMango Health is more than just a therapy app; it's a step toward making specialized OCD treatment accessible for everyone, especially those who struggle to access or afford traditional therapy methods. \n\nSo if you're ready to take control of your OCD, start your journey with Mango Health. Visit [TheMangoHealth.com](https://themangohealth.com) to try it for free and embark on a path toward recovery with the support you deserve. \n\nIn a world where mental health solutions may often seem one-size-fits-all, Mango Health is here to offer personalized, private, and effective care tailored just for you.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/8a1ed4eadd459e5b5e281639c3306e42106dc56b.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191522Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=dfbfcfd1cdbdf9f23b1596b7ec1bb45b2ca765131fbc45e79468bda915b3ee5e",
    "social_links": [
        "https://www.linkedin.com/company/97872692/admin/feed/posts/"
    ],
    "logo_path": "data/logos\\Mango_Health_logo.png"
}