{
    "links": "https://www.ycombinator.com/companies/manifold-freight",
    "name": "Manifold Freight",
    "headline": "Aggregating Spot Freight Opportunities for Carriers",
    "batch": "W24",
    "description": "Manifold is revolutionizing the spot freight procurement process for Carriers, Brokers, and Shippers. Our inaugural product transforms the booking process for spot shipments, significantly reducing empty miles and increasing revenue.  We do this by aggregating spot shipment opportunities from a variety of shipper and brokerage sources into a single location.\r\n\nAndrew and Oliver bring deep domain expertise of freight from their pivotal roles at Convoy, where they were engineering leaders automating processes that were scaled to handle over 10,000 weekly shipments. This background has been instrumental in shaping Manifold's innovative approach.\r\n\nIn just two months since launching Manifold has achieved $5,100 in monthly revenue, showcasing the pressing demand for our product. Manifold is poised to transform this $100+ billion industry. Not only will we streamline spot freight procurement operations but we will also redefine the industry's cost structure for the better.",
    "activity_status": "Active",
    "website": "https://www.manifoldfreight.com/",
    "founded_date": 2024.0,
    "team_size": 3.0,
    "location": "Seattle, WA",
    "group_partner": "Dalton Caldwell",
    "group_partner_yc": "https://www.ycombinator.com/people/dalton-caldwell",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:b2b; industry:logistics; industry:automation; industry:ai; location:seattle",
    "founders": [
        {
            "name": "Oliver Jones, Founder",
            "description": "I am the CEO and co-founder of Manifold. Previously, I spent years in startup life at Convoy, learning firsthand about growing teams, pivoting and launching new products. Most importantly, learned a great deal about the logistics space and the problems that need to be solved there.",
            "linkedin": "https://linkedin.com/in/oliver-jones-936a0a58"
        },
        {
            "name": "Andrew Huff, Founder",
            "description": "I am the CTO and co-founder of Manifold Freight.\n\nMost recently I worked as a software engineer and engineering manager at Convoy - a digital freight brokerage. Specifically working on tools to automate cumbersome freight logistics processes.",
            "linkedin": "https://linkedin.com/in/andrew-huff-222b2a21"
        }
    ],
    "status": true,
    "generated_description": "### Manifold Freight: Innovating Spot Freight Procurement\n\n**Mission:** Manifold Freight is on a mission to aggregate spot freight opportunities for carriers, aiming to revolutionize the procurement process for carriers, brokers, and shippers.\n\n**Overview:** Founded in 2024 and part of Y Combinator's W24 batch, Manifold is redefining how spot shipments are booked. Their flagship product significantly cuts down on empty miles, enhancing revenue generation by consolidating spot freight opportunities from various sources into a single, streamlined platform. Based in Seattle, WA, the company has quickly generated a monthly revenue of $5,100 just two months post-launch, underlining the urgent need for their innovative solution in a $100+ billion industry.\n\n**Core Team:** Manifold was initiated by Andrew and Oliver, who both have deep-rooted experience in the freight sector as engineering leaders at Convoy, where they automated processes for more than 10,000 weekly shipments. Their expertise is crucial in shaping Manifold's cutting-edge approach to freight procurement.\n\n**Product Offering:** Manifold's platform allows users to **find**, **bid**, and **analyze** spot freight all in one place. It effectively ingests data from various sources, including emails and TMS, organizing it for intelligent and efficient bidding. By doing so, shippers can make better decisions that maximize profitability, reduce erroneous bids, and derive actionable insights from performance data.\n\n**Performance Metrics:** Early metrics are promising, showcasing a potential increase of 11% in spot revenues, an 8% reduction in load planning costs, and a candor that indicates zero fraudulent loads for users.\n\n**Partnerships and Support:** They are backed by notable partners and have strong support from Y Combinator, which is indicative of their potential in transforming logistics.\n\nIf you're looking to streamline your spot freight operations, check out their website at [Manifold Freight](https://www.manifoldfreight.com/). \n\n**Tags:** B2B, logistics, automation, AI, Seattle\n\n**Final Thoughts:** Manifold Freight is not just another startup; it represents a significant evolution in freight logistics. By leveraging advanced technology and industry expertise, they're well-equipped to tackle the inefficiencies that plague the traditional freight procurement process. Keep an eye on them; they seem poised to make waves in the freight world.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/6cd54960abd585192e94d75c0c1ab4f8ff73833f.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191522Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=d867125eea8e7f06f4e58fa3addc93b78344fd151c02d26d8d82403d91826d74",
    "social_links": [
        "https://www.linkedin.com/company/manifold-freight/"
    ],
    "logo_path": "data/logos\\Manifold_Freight_logo.png"
}