{
    "links": "https://www.ycombinator.com/companies/marathon-education",
    "name": "Marathon Education",
    "headline": "We provide live after-school tutoring to K-12 students in Vietnam",
    "batch": "W22",
    "description": "Marathon Education provides live interactive tutoring classes to K-12 students in Vietnam, we're the fastest-growing edtech player disrupting the $5bn offline tutoring market by allowing students to learn online with the best teachers in large-class or small-class format.\r\n\nThe company is founded by Duc, former education private equity investor at TPG Capital - where Duc invested in K-12 education and edtech businesses in Vietnam & Southeast Asia. Duc co-founded Marathon with Tung - serial tech entrepreneur in Vietnam who grew his last startup - Christina's to 500 employees across 8 cities.",
    "activity_status": "Active",
    "website": "https://www.marathon.edu.vn",
    "founded_date": 2021.0,
    "team_size": 20.0,
    "location": "Ho Chi Minh City, Vietnam",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:education",
    "founders": [
        {
            "name": "Duc Pham, Founder",
            "description": "Chief jogger at Marathon - we are building Vietnam's after-school metaverse, one live class at a time",
            "linkedin": "https://sg.linkedin.com/in/duc-pham-b22b21101"
        },
        {
            "name": "Tung Tran, Founder",
            "description": null,
            "linkedin": "https://www.linkedin.com/in/tranviettung/"
        }
    ],
    "status": true,
    "generated_description": "**Marathon Education: Revolutionizing Tutoring in Vietnam**\n\nFounded in 2021, Marathon Education is an innovative player in the Vietnamese education landscape, providing live after-school tutoring for K-12 students. Headquartered in Ho Chi Minh City, the company aims to disrupt the traditional, $5 billion offline tutoring market by offering high-quality, interactive online tutoring.\n\n**Mission and Vision**  \nMarathon's mission is simple yet powerful: to provide accessible, high-quality tutoring to students in Vietnam. The unique aspect of Marathon Education is its focus on connecting students with top educators through both large and small class formats. The approach allows for personalized learning experiences that adapt to the student's needs.\n\n**Founders**  \nMarathon was co-founded by Duc, a former private equity investor specializing in education at TPG Capital, and Tung, a seasoned tech entrepreneur who previously scaled his startup, Christina's, to over 500 employees. Their combined expertise in finance and technology serves as the backbone for Marathon's growth.\n\n**Key Features and Offerings**  \nMarathon offers a comprehensive range of educational services, which include:\n- **Live Interactive Classes:** Students can engage in real-time lessons with top 1% instructors in Vietnam.\n- **Diverse Course Offerings:** The programs align with Vietnam's national curriculum and cover various subjects, including mathematics, science, and English—particularly IELTS courses, designed to help students excel in their language assessments.\n- **Personalized Learning Paths:** Marathon is dedicated to ensuring student success with tailored study plans, regular assessments, and a commitment to delivering measurable outcomes.\n\n**Growth and Recognition**  \nSince its inception, Marathon has quickly established itself as a leading edtech startup. It was part of Y Combinator’s Batch W22, underscoring its potential for significant growth. Recently, it was recognized as one of Vietnam's top brands in 2023, and it’s the first Southeast Asian education startup backed by a Microsoft co-founder’s investment fund.\n\n**Team and Impact**  \nThe company has a dedicated team of 20 employees, all working towards one common goal: transforming the educational experience for Vietnamese students. Marathon Education distinctly emphasizes student engagement and improvement, as reflected in testimonials from students and parents alike, praising their effective teaching methods and the supportive learning environment.\n\n**Explore More**  \nTo dive deeper into Marathon Education’s offerings, visit their website: [Marathon Education](https://www.marathon.edu.vn).\n\nIn conclusion, Marathon Education isn't just another tutoring platform; it's a forward-thinking solution that leverages technology to enhance education in Vietnam, making quality learning accessible for all students.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/46799e564ccb1c0559e154e122182b249629cd67.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191523Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=9bc5796020c4185dc679b1b3494e3f9e05d59692a48a127926e01d3b024fa235",
    "social_links": [
        "https://www.linkedin.com/company/marathon-education/?viewAsMember=true"
    ],
    "logo_path": "data/logos\\Marathon_Education_logo.png"
}