{
    "links": "https://www.ycombinator.com/companies/marketfeed",
    "name": "marketfeed",
    "headline": "Helps affluent Indians invest in automated options trading strategies",
    "batch": "S21",
    "description": "marketfeed offers an automated trading platform that helps users earn returns through sophisticated options trading strategies. By connecting their broker's account, users can automate expert-developed strategies. The platform automatically executes trades, providing the potential for periodic earnings without the need for constant monitoring.",
    "activity_status": "Active",
    "website": "https://marketfeed.com",
    "founded_date": 2020.0,
    "team_size": 55.0,
    "location": "Bengaluru, India",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:trading; industry:stocks",
    "founders": [
        {
            "name": "Sharique Samsudheen, Founder",
            "description": "Teaching people in India how to trade stocks",
            "linkedin": "https://www.linkedin.com/in/shariquesamsudheen/"
        },
        {
            "name": "Sooraj Elamana, Founder",
            "description": "Building India's Largest Community of Financially Independent & Responsible Individuals.",
            "linkedin": "https://www.linkedin.com/in/sooraje/"
        }
    ],
    "status": true,
    "generated_description": "**Marketfeed: Simplifying Options Trading for Affluent Indians**\n\nFounded in 2020 and part of Y Combinator’s Batch S21, Marketfeed is an innovative fintech company based in Bengaluru, India. It operates under the mission of helping affluent Indians engage in automated options trading strategies—essentially a way to let your money work for you without the daily grind of active management.\n\nThe platform allows users to connect their broker accounts and automate trading strategies designed by experts, which can lead to potentially lucrative returns without constant oversight. The sweet spot? You can withdraw your profits anytime, seamlessly.\n\n**Key Features:**\n- **Minimum Investment:** To get started, users need a minimum capital of ₹4 lakhs. This threshold is set to ensure that clients have sufficient funds to harness the power of sophisticated trading algorithms while minimizing risk.\n- **Automated Trading:** Marketfeed offers intelligent options trading strategies developed by SEBI-registered research analysts, executed directly in your own brokerage account. This means users retain control over their funds while benefiting from professional advice.\n- **Flexibility:** Unlike traditional investment vehicles like mutual funds or fixed deposits, which might tie your money up for extended periods, Marketfeed allows for instant access to your profits without any lock-in periods.\n\n**User-Friendly Approach:**\nMarketfeed emphasizes simplicity—it’s for individuals who might not have extensive trading knowledge but still wish to capitalize on the markets. Whether you’re a doctor, a PhD student, or a busy executive, the platform tailors to those with time constraints and a desire to diversify their investment portfolios.\n\nThey’ve successfully garnered more than ₹230 Crores in investments from users, and with a growing community of over 2 million followers (an impressive feat in the fintech space), it’s clear that their approach resonates with those looking to enhance their financial future.\n\n**Growth and Culture:**\nWith a dedicated team of 55 employees, the culture at Marketfeed seems rooted in a commitment to client success and transparency. Users rave about the support they receive, which makes navigating the trading landscape much more approachable.\n\nIn a nutshell, if you’re an affluent individual looking to step into the world of options trading without the hassle of day-to-day management, Marketfeed could very well be the partner you didn’t know you needed. Check out their services at [marketfeed.com](https://marketfeed.com) and take the first step towards supercharging your investment portfolio today!",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/7091531594563b1438bd8ce243b34f7ae6658789.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191523Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=7e37f9020d1c92a190fa1d3e9589e2ebb8fb71354b132325b84537d30866ab43",
    "social_links": [
        "https://www.linkedin.com/company/marketfeed-com",
        "https://mobile.twitter.com/marketfeedapp",
        "https://www.facebook.com/marketfeedapp"
    ],
    "logo_path": "data/logos\\marketfeed_logo.png"
}