{
    "links": "https://www.ycombinator.com/companies/mark-cuban-cost-plus-drug-company-pbc",
    "name": "Mark Cuban Cost Plus Drug Company, PBC",
    "headline": "Making low cost versions of high cost generic drugs.",
    "batch": "S18",
    "description": null,
    "activity_status": "Active",
    "website": "http://www.costplusdrugs.com",
    "founded_date": null,
    "team_size": null,
    "location": null,
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": null,
    "founders": [],
    "status": true,
    "generated_description": "**Mark Cuban Cost Plus Drug Company, PBC: An Overview**\n\nThe Mark Cuban Cost Plus Drug Company (often shortened to Cost Plus Drugs) is on a mission to revolutionize access to medications by making high-cost generic drugs affordable. Founded by billionaire entrepreneur Mark Cuban, this online pharmacy aims to eliminate the price-markup tactics of traditional pharmacies by operating transparently and directly with manufacturers.\n\n### Mission and Operations\n\nCost Plus Drugs is focused on creating low-cost versions of expensive generic drugs. The company operates through its website, [costplusdrugs.com](http://www.costplusdrugs.com), where it lists hundreds of medications, many of which are essential for managing chronic conditions and improving overall health. The goal is simple: “Everyone should have safe, affordable medicines with transparent prices,” Cuban emphasizes. \n\n### How It Works\n\nHere's how it works:\n\n1. **Find Your Medication**: Patients can browse or search for their required medication on the website.\n2. **Get a Prescription**: Users must reach out to their healthcare providers to send prescriptions directly to Cost Plus Drugs.\n3. **Receive Your Medications**: Once received, prescriptions are processed, and medications are shipped to the customer's home.\n\nBy negotiating directly with manufacturers, Cost Plus Drugs can offer medications at prices significantly lower than retail rates. For example, Abiraterone Acetate, a generic for Zytiga, costs $23.69 on their site compared to a retail price of $1,093.20. This kind of savings speaks volumes about the company's commitment to affordability.\n\n### Transparency in Pricing\n\nThe company prides itself on its transparent pricing model, which breaks down costs for customers so they can understand exactly what they’re paying for. There are no hidden markups, and patients can see a clear cost structure including manufacturer prices, a small markup, and shipping fees.\n\n### A Public Benefit Corporation\n\nCost Plus Drugs is structured as a public-benefit corporation (PBC). This means it has a social mission at its core—a commitment to improving public health and making sure more people can afford their medication without going bankrupt. Cuban’s involvement adds significant visibility, as he is well-known for challenging the status quo in various industries.\n\n### Headlines and Impact\n\nSince its inception, the company has made waves in the press, highlighting the struggle many Americans face regarding prescription drug prices. It stands at the intersection of healthcare and e-commerce, and has been noted as a potential solution in government discussions about lowering drug costs on a national scale.\n\n### Conclusion\n\nThe Mark Cuban Cost Plus Drug Company, PBC is a disruptive force in the pharmaceutical industry, challenging traditional pricing models and advocating for transparent pricing. By directly connecting consumers with high-quality, low-cost medications, it embodies a significant shift in how people can access essential health products. In a time when healthcare costs are spiraling, the company’s mission couldn't be more crucial.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/b2d12096926b4ef26e0b80e4a76ad4596cab4a7d.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191524Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=a7989d13ccf6adebf245d03ff8c2d664a4ba52f80100a074b426b788174346c3",
    "social_links": [
        "https://www.crunchbase.com/organization/osh's-affordable-pharmaceuticals-fremont-california"
    ],
    "logo_path": "data/logos\\Mark_Cuban_Cost_Plus_Drug_Company,_PBC_logo.png"
}