{
    "links": "https://www.ycombinator.com/companies/markaz-technologies",
    "name": "Markaz Technologies",
    "headline": "Reselling marketplace for social media entrepreneurs in Pakistan",
    "batch": "W22",
    "description": "We enable WhatsApp, Facebook, and Instagram-based micro-entrepreneurs to source wholesale products from across Pakistan. Our marketplace enables these micro-entrepreneurs to start their business without any investment while we facilitate them by offering their customers a great experience. We do this by taking care of their delivery operations, payments, and customer services. \r\n\nPakistan is one of the youngest populations globally and is expected to become the 7th largest consumer market by 2030. Our vision is empowering 5 M + people, especially women, to start their businesses while working from home and supercharging the eCommerce rails of Pakistan.",
    "activity_status": "Active",
    "website": "https://www.markaz.app",
    "founded_date": 2021.0,
    "team_size": 55.0,
    "location": "Islamabad, Pakistan",
    "group_partner": "Nicolas Dessaigne",
    "group_partner_yc": "https://www.ycombinator.com/people/nicolas-dessaigne",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:marketplace; industry:e-commerce",
    "founders": [
        {
            "name": "Shoaib Khan, Founder",
            "description": "Solving problems in the developing world through building products for masses!",
            "linkedin": "https://www.linkedin.com/in/shoaib-khan-51254b23/"
        },
        {
            "name": "Umair Aslam, Founder",
            "description": "12+ years of hardcore PLG experience. Have worked on leading Fintech products of Pakistan and Myanmar. Love to work on products that create real impact and disrupt how societies work.",
            "linkedin": "https://www.linkedin.com/in/umairsandhu/"
        },
        {
            "name": "Sameel Hayat, Founder",
            "description": "Co-Founder,  Operations at Markaz Technologies.",
            "linkedin": "https://linkedin.com/in/sameelhayat"
        },
        {
            "name": "Fawad Hussain, Founder",
            "description": "Fawad is a hands-on technologist and an entrepreneur with 12+ years of multi-continent experience in development and architecture of modern IT solutions. He has helped some of the major Telecommunication operators across south and southeast Asia regions in accelerating their digital journey and adoption of cloud technology. He has a dream to put Pakistan on the map for highly skilled technology experts and in achieving this goal, he has been an active contributor in the local tech communities.",
            "linkedin": "https://www.linkedin.com/in/fawad-hussain-80124032"
        }
    ],
    "status": true,
    "generated_description": "**Markaz Technologies**: Redefining E-Commerce in Pakistan\n\nFounded in 2021 and proudly part of Y Combinator’s Batch W22, Markaz Technologies represents a bold step into the future of e-commerce in Pakistan. With its headquarters in Islamabad, the company focuses on empowering micro-entrepreneurs, particularly women, to thrive in the online marketplace. \n\n**Mission and Vision**  \nMarkaz is no ordinary marketplace; it’s a reselling platform designed explicitly for social media entrepreneurs. The goal is clear: make it easy for over 5 million individuals to start and manage their businesses from the comfort of their homes, tapping into Pakistan’s burgeoning consumer market, projected to be the 7th largest by 2030.\n\nThe platform enables these entrepreneurs to source wholesale products across various categories, leveraging social media channels like WhatsApp, Facebook, and Instagram without the burden of initial investments. This model removes financial barriers, allowing anyone with a smartphone to dive into e-commerce.\n\n**How it Works**  \nMarkaz simplifies the dropshipping process by offering a centralized dashboard via its user-friendly mobile app and web interface. Entrepreneurs can browse over 150,000 locally curated products, set prices, manage orders, and optimize their operations—all while Markaz handles logistics, payments, delivery, and customer service.\n\nTestimonials from users like Ayesha Khan and Rajesh Sharma highlight the platform's effectiveness, emphasizing the ease of use and the variety of products available. Many have managed to create significant income streams, with reports suggesting earnings can exceed PKR 100,000 monthly.\n\n**The Future is Bright**  \nWith a team of 55 dedicated employees and a community exceeding 3 million users, Markaz is poised for growth. The company aims to further enhance the e-commerce landscape in Pakistan, making it a hub for entrepreneurship and innovation. Their commitment is to empower potential business owners while building a robust logistics network that ensures rapid delivery.\n\nFor those ready to embark on their entrepreneurial journey, Markaz is more than just a platform; it’s a gateway to financial independence. \n\nTo learn more, explore the offerings, or join the community, visit [Markaz Technologies](https://www.markaz.app).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/4a41b833e184eeca96775e3a556cc0a56a1429d1.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191523Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=b7f2f307b9d48a237bec3346335a82eb6727bad596fc66e581002103007e7686",
    "social_links": [
        "https://www.linkedin.com/company/markaz-tech",
        "https://twitter.com/markaz_app",
        "https://www.facebook.com/app.markaz",
        "https://www.crunchbase.com/organization/markaz-technologies"
    ],
    "logo_path": "data/logos\\Markaz_Technologies_logo.png"
}