{
    "links": "https://www.ycombinator.com/companies/marketforce",
    "name": "MarketForce",
    "headline": "The SuperApp for neighbourhood merchants in Africa.",
    "batch": "S20",
    "description": "MarketForce empowers neighbourhood merchants in Africa to source, order and pay for inventory digitally and conveniently, access a banking wallet with credit facilities, collect digital payments and earn extra income by offering agency baking services and reselling digital financial services such as airtime, electricity tokens and bill payments in their communities. \r\n\nIncorporated in 2019, MarketForce is a fast-growing company running an asset-light business model and is currently operational in 5 markets in Sub-Saharan Africa, with over 200,000 merchants and 180 consumer brands trading on the platform.",
    "activity_status": "Active",
    "website": "https://marketforce.io",
    "founded_date": 2019.0,
    "team_size": 400.0,
    "location": "Nairobi, Kenya",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:marketplace; industry:b2b",
    "founders": [
        {
            "name": "Mesongo Sibuti, Founder",
            "description": "A Forward-thinking Techprenuer and Software Architect specializing in the design, development, and scaling of technology-enabled platforms with a special interest in the field of B2B Services, Last Mile Distribution, and Data Science.",
            "linkedin": "https://linkedin.com/in/mesongo"
        },
        {
            "name": "Tesh Mbaabu, Founder",
            "description": "Tesh is a creative and strategic thinker from both a product and commercial perspective; experienced in business process automation and building startups in the African scene, where I focus on business development, growth and partnerships.",
            "linkedin": "https://linkedin.com/in/teshmbaabu"
        }
    ],
    "status": true,
    "generated_description": "**MarketForce Overview**\n\nMarketForce is on a mission to become the SuperApp for neighborhood merchants across Africa. Founded in 2019 and based in Nairobi, Kenya, MarketForce aims to empower local businesses by providing a streamlined digital platform where they can easily source, order, and pay for inventory. The company also offers features like a banking wallet with credit facilities, digital payments, and opportunities for merchants to earn additional income through agency banking and reselling digital financial services such as airtime, electricity tokens, and bill payments. \n\nIn just a few short years, MarketForce has seen impressive growth. The company operates in five markets within Sub-Saharan Africa, boasting a network of over 200,000 merchants and collaborating with 180 consumer brands. This expansion is significant for an asset-light business model, showcasing how effectively it taps into the local merchant ecosystem.\n\nWith a solid team of 400 employees, MarketForce is part of Y Combinator's Batch S20, which highlights its credibility in the startup ecosystem. The company is focused on leveraging technology to meet the needs of everyday merchants, making commerce more accessible and efficient.\n\nIn terms of industry classification, MarketForce is positioned at the intersection of fintech, marketplaces, and B2B services—a sweet spot for driving value in emerging markets. The company's vision and operational capabilities suggest it is well-poised for further growth and impact in Africa's vibrant commercial landscape.\n\nFor more information, check out their website at [marketforce.io](https://marketforce.io).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/55a1bc53e0e521be293eecb22d4dd84ebcb87bc6.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191523Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=82b97386de3aa123dbc5e3d38ff927dbfafab2429ea3f5a5ea426136fcea0607",
    "social_links": [
        "https://www.linkedin.com/company/marketforcehq",
        "http://twitter.com/marketforcehq",
        "http://facebook.com/marketforcehq",
        "https://www.crunchbase.com/organization/marketforce360"
    ],
    "logo_path": "data/logos\\MarketForce_logo.png"
}