{
    "links": "https://www.ycombinator.com/companies/marr-labs",
    "name": "Marr Labs",
    "headline": "AI-voice agents that are indistinguishable from humans.",
    "batch": "W24",
    "description": "Marr Labs is making AI-voice agents that are indistinguishable from humans. Han and Dave previously created speech tech company Vlingo that powered the first Siri app and was acquired for $225M. \r\n\nNow they are taking voice to the next level by making AI-voice agents that can handle virtually any phone-based job, from answering calls to schedule appointments to call center sales and support jobs—all at a fraction of the cost of a human agent.\r\n\nIn the US alone, businesses handle 17 billion calls a year at an average cost of $5 per call–an $85 billion addressable market.",
    "activity_status": "Active",
    "website": "https://www.marrlabs.com/",
    "founded_date": 2023.0,
    "team_size": 9.0,
    "location": "San Francisco",
    "group_partner": "Gustaf Alstromer",
    "group_partner_yc": "https://www.ycombinator.com/people/gustaf-alstromer",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:artificial-intelligence; industry:conversational-ai; industry:ai-assistant; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Dave Grannan, Founder",
            "description": "Dave is the co-founder and CEO of Marr Labs. Previously, Dave was the founding CEO of speech recognition company Vlingo that provided speech recognition for the first Siri products and was acquired for $225M by Nuance Communications. Dave was also Chairman of the Board of NLP and speech recognition company Maluuba that was acquired for $160M by Microsoft. Prior to founding Marr, Dave was co-founder and CEO of machine vision company Light, acquired by John Deere.",
            "linkedin": "https://linkedin.com/in/grannan"
        },
        {
            "name": "Han Shu, Founder",
            "description": "Han is the co-founder & CTO of Marr Labs, an AI/ML pioneer and 2X entrepreneur. As co-founder of Vlingo(acquired by Nuance for $225M), he built Speech Recognition & Natural Language Understanding stacks, and supplied ASR to Siri. As co-founder of Wyth(acquired by Airbnb), he developed mobile personal assistant technology for collaborative productivity applications. Han led the ML and AI groups at both Airbnb and DoorDash. Han holds PhD, MEng, and BS degrees from MIT, and 25 patents.",
            "linkedin": "https://linkedin.com/in/hanshu"
        }
    ],
    "status": true,
    "generated_description": "**Marr Labs: Redefining AI Voice Interactions**\n\nFounded in 2023, Marr Labs is on a mission to create AI voice agents so human-like they’re practically indistinguishable from a real person. This San Francisco-based startup, part of Y Combinator's Batch W24, is spearheaded by Han and Dave, the visionary team behind Vlingo, the technology that powered the first Siri app—acquired for a cool $225 million. They've taken their deep expertise in speech technology and turned their sights on transforming voice interactions in business.\n\n### What They Do\n\nAt the core of Marr Labs’ offering is **Vox**, an AI voice agent designed to manage a wide range of phone-based tasks. From answering customer calls and scheduling appointments to handling sales and customer service inquiries, Vox can do it all at a fraction of the cost of human agents. This system taps into a massive opportunity: businesses in the U.S. handle around **17 billion calls** annually, costing an average of **$5 per call**, which translates into an **$85 billion** market. That's a big pie, and Marr Labs aims to grab a generously sized slice.\n\n### What Makes Vox Special?\n\nVox is equipped with **Symphonia**, Marr Labs' proprietary conversational intelligence platform. Symphonia enhances Vox’s capabilities, enabling it to learn and adapt to specific business needs. Think of it as Vox's brain, embedded with advanced features like **ML Turbo** and **ML Reason**—the very components that allow Vox to converse naturally while essentially holding an “instant PhD” in Sales, Support, and Scheduling.\n\n### Target Industries\n\nInitially focusing on the **mortgage sector**, where speed and responsiveness can be the difference between landing a deal or losing it to competitors, Vox promises to accelerate lead conversions and streamline processes with its human-like interactions.\n\nBut Marr Labs isn't stopping there. They're also eyeing the **healthcare sector**, hinting at future applications that could further push the boundaries of conversational AI.\n\n### The Team Behind the Magic\n\nMarr Labs edges ahead not just because of technology but also thanks to its powerhouse team that boasts a rich background in AI and conversational tech. This collaboration is pivotal for driving operational excellence and innovative product execution.\n\n### Why It Matters\n\nIn a world overwhelmed with digital interactions, Marr Labs is pioneering a significant shift in how businesses engage with customers. By effectively melding AI with human-like interaction, they're not just enhancing operational efficiency but also reshaping customer experiences.\n\nIf you’re intrigued by how Marr Labs can elevate your operations and customer communication, **[check out their website](https://www.marrlabs.com/)** and consider scheduling a demo to see Vox in action. After all, who wouldn’t want to experience the future of conversational AI today?",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/ae38baa345d785a0b16c12dceb9a7089620d0f69.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191525Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=1c3ffcf8d442ceddfc0021c69b9e3f52d21c93e0140dc9ac078b284714d8078b",
    "social_links": [
        "https://www.linkedin.com/company/marrlabs",
        "https://twitter.com/marrlabs"
    ],
    "logo_path": "data/logos\\Marr_Labs_logo.png"
}