{
    "links": "https://www.ycombinator.com/companies/mason",
    "name": "Mason",
    "headline": "Mason is the fastest way to take smart devices from idea to end user",
    "batch": "W16",
    "description": "Mason is the fastest way to take smart devices from idea to end user. Whether building a single-use device from scratch or scaling a line of smart products, with Mason it’s 20x faster and 10x less costly to build, deploy and scale. Digital transformation is a modern requirement but operating a hardware-dependent initiative is hard – thousands of hours and millions of dollars are at stake.\r\n\nThe Mason Smart Device Platform is the only fully managed infrastructure for developing and delivering dedicated devices. It offers flexible usage-based pricing for fleets of devices and manages the underlying complexity of all associated backend services, making software delivery on a smart product line—whether it’s a tablet, wearable or new form factor—as simple as delivering software in the cloud. This frees innovators to focus on what matters: application development, feature specification and UX. Granular access to add, remove or lock down capabilities makes it possible for highly customized products to be built as envisioned.\r\n\nMason offloads hardware investment risks and logistics, including inventory procurement, warehousing and supply chain management. With options like zero-touch provisioning, devices can work perfectly out of the box without end user intervention. Remote fleet management, troubleshooting and automated software updates by Mason ensure security and positive end user experiences. Organizations of all sizes rely on Mason to bring innovations and hundreds of use cases to market without reinventing the wheel. Smarter from start to finish with Mason.™\r\n\nAWARDS\r\n* 2023: Best Places to Work & Best Startups to Work For, Built In Seattle\r\n* 2022: Best Places to Work & Best Small Places to Work, Built In Seattle\r\n* 2022: IoT Health & Wellness Innovation of the Year, IoT Breakthrough\r\n* 2022: Bronze Stevie® Award - Emerging Technology, The 2022 American Business Awards®\r\n* 2021: Deloitte Technology Fast 500™, Deloitte\r\n* 2019: Tech Impact Awards, Mobile - Silver, Seattle Business magazine\r\n\nFollow us on LinkedIn | https://www.linkedin.com/company/mason-america/",
    "activity_status": "Active",
    "website": "http://www.bymason.com",
    "founded_date": 2015.0,
    "team_size": 65.0,
    "location": "Seattle, WA",
    "group_partner": "Michael Seibel",
    "group_partner_yc": "https://www.ycombinator.com/people/michael-seibel",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:hardware; industry:saas; industry:logistics; location:seattle",
    "founders": [
        {
            "name": "Jim Xiao, Founder/President",
            "description": "Past experience at Microsoft, VC, and wireless. Currently at Mason, working on letting anyone create their own smart hardware product like Peloton or Square.",
            "linkedin": "https://www.linkedin.com/in/jimxiao"
        }
    ],
    "status": true,
    "generated_description": "Mason is a startup headquartered in Seattle, WA, founded in 2015 and part of Y Combinator's Batch W16. They're on a mission to simplify the process of getting smart devices from concept to consumer, making it up to **20 times faster** and **10 times less expensive** to develop, deploy, and scale hardware initiatives. This is especially crucial as digital transformation becomes an industry necessity, given the challenges and costs tied to hardware.\n\nAt the heart of Mason's offering is the **Mason Smart Device Platform**. Think of it as a fully managed infrastructure that handles the complexities of device deployment—like backend services—just as easily as cloud software solutions. This setup gives innovators the freedom to focus on what they do best: application development and user experience design. Businesses can easily customize their devices without getting bogged down in logistics or hardware investments.\n\nMason also mitigates the risks associated with hardware. They take care of inventory procurement, supply chain management, and even provide zero-touch provisioning, meaning devices can be operational straight out of the box, minimizing user intervention. With remote fleet management, troubleshooting, and automated software updates, Mason prioritizes security and ensures users have a positive experience.\n\nTheir clientele spans various industries, leveraging Mason’s capabilities to bring hundreds of unique use cases to market without the need for reinventing the wheel.\n\n**Awards and Recognition:**\nMason's commitment to excellence hasn't gone unnoticed. They've been recognized as one of the **Best Places to Work** and **Best Startups to Work For** in Seattle for multiple years (2022-2023), and their innovations have earned them industry accolades, such as:\n- 2022: IoT Health & Wellness Innovation of the Year (IoT Breakthrough)\n- Bronze Stevie® Award - Emerging Technology (2022 American Business Awards)\n- Featuring in the Deloitte Technology Fast 500™ (2021)\n\nWith a team of 65 under the guidance of Group Partner Michael Seibel, Mason is well-positioned for continued growth. They create tailored devices such as wearables for frontline workers, monitoring kits, and secure communication solutions—demonstrating their diverse capabilities.\n\nFor anyone looking to innovate in the hardware space, Mason offers an efficient, risk-reducing path to implementation that turns ideas into reality faster and more affordably than traditional methods. \n\nFor more information, you can explore their [website](http://www.bymason.com) or connect on [LinkedIn](https://www.linkedin.com/company/mason-america/).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/ce00e79ff1c7370daa3cd2a1ba5a22031669cf2d.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191525Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=bdaff678f0ea93fd50a1c00eb1b2c65bb34512ef77335826418a3f74f3ae1a22",
    "social_links": [
        "https://www.linkedin.com/company/mason-america/",
        "https://twitter.com/buildwithMason",
        "https://www.facebook.com/buildwithmason/",
        "https://www.crunchbase.com/organization/mason"
    ],
    "logo_path": "data/logos\\Mason_logo.png"
}