{
    "links": "https://www.ycombinator.com/companies/matagora",
    "name": "matagora",
    "headline": "Instant physical presence for any online brand.",
    "batch": "S19",
    "description": "We’re on a mission to enable collaborative commerce for independent retailers to flourish. Matagora allows independent retailers to automate the manual work of retail collaborations to make their operations refreshingly simple. Discover new retail partners, onboard and import all product information in one click, sync with a retail partner's inventory in real-time, and never worry about a manual invoice or payment. Stores are instantly transformed into real-time scalable marketplaces while keeping their product curation exciting for their customers. Brands get access to infinitely more distribution channels, and ensure they always get paid on time. We simplify collaborative commerce from end-to-end so retailers can sell better, together.",
    "activity_status": "Active",
    "website": "https://www.matagora.com",
    "founded_date": 2016.0,
    "team_size": 5.0,
    "location": "Montreal, Canada",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:marketplace; industry:collaboration; industry:marketing; industry:retail-tech; industry:retail",
    "founders": [
        {
            "name": "Chris Kyras, Founder",
            "description": "Co-founder at Matagora, super passionate about empowering independent retail.\nCurrently building the future of collaborative retail; it should be easier for a store to onboard a new brand and test them out at no risk.",
            "linkedin": "https://www.linkedin.com/in/chris-s-kyras/"
        },
        {
            "name": "Wenjun Zhu, Founder",
            "description": null,
            "linkedin": "https://www.linkedin.com/in/kilaju/"
        }
    ],
    "status": true,
    "generated_description": "Matagora is a Montreal-based startup that has a clear mission: to create \"instant physical presence for any online brand.\" Founded in 2016 and a member of Y Combinator's Spring 2019 batch, Matagora specializes in enabling independent retailers to thrive through collaborative commerce.\n\nInitially, Matagora focused on simplifying the complexities of retail partnerships. They provide tools and solutions that automate manual tasks associated with retail collaborations. With just a click, retailers can discover new partners, import product information, and synchronize inventories in real-time. This makes it easier for independent retailers to transform their stores into scalable, dynamic marketplaces while delivering an exciting shopping experience for customers.\n\nHere's how they accomplish this: Matagora optimizes product details, boosts SEO, offers marketing support, and conducts seamless migrations to more effective point-of-sale systems. All of this is backed by a team rich in retail expertise — over 20 years, in fact. Their services operate on a subscription model and include unlimited support for various e-commerce needs, effectively acting as an on-demand e-commerce department.\n\nWith a small but efficient team of five employees, Matagora ensures its partners have access to diverse distribution channels while guaranteeing timely payments. It's all about simplifying collaborative commerce from end to end so that retailers can focus on what they do best: selling.\n\nIf you’re an independent retailer looking for a partner to help elevate your business with less hassle, Matagora is worth checking out. You can find more on their [website](https://www.matagora.com).",
    "logo": "/logos/medium/missing.png",
    "social_links": [
        "https://www.linkedin.com/company/matagora",
        "https://www.facebook.com/matagora"
    ]
}