{
    "links": "https://www.ycombinator.com/companies/mathos",
    "name": "Mathos",
    "headline": "Ultimate AI Math Problem Solver to Revolutionize Personalized Learning",
    "batch": "W24",
    "description": "Mathos AI (Formerly MathGPTPro) is the leading AI math solver that enables academic performance and productivity of both students and teachers. It has empowered over 1M students from over 200 countries in the past year, which turns the previously mission-impossible personalized learning into real. Our advanced math AI model achieves roughly 20% higher accuracy in mathematical and quantitative problem-solving capabilities then GPT4o. \r\n\nAs we move forward, we will tackle the hardest problems in the educational sector, personalization, adaptive learning, and shortages of teachers, with our trial runs in schools. By automating grading, providing insightful analytics, and generating adaptive assignments, our model empowers teachers to understand what their students need and what should be provided accordingly.",
    "activity_status": "Active",
    "website": "https://info.mathgptpro.com/",
    "founded_date": 2023.0,
    "team_size": 5.0,
    "location": "Santa Clara, CA",
    "group_partner": "Nicolas Dessaigne",
    "group_partner_yc": "https://www.ycombinator.com/people/nicolas-dessaigne",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:ai-enhanced-learning; industry:education; industry:generative-ai; industry:edtech; industry:ai; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Tianwei Yue, Founder",
            "description": "AI since 2015. RL & Robotics recently. Building language agents since 2022. Love research but ended up as boring MLE in tech companies (???).\n\nI feel only doing research or building startups make me excited. If one more, milk tea. \nAdmitted to college at age 14.",
            "linkedin": "https://linkedin.com/in/tianwei-yue-8a3337141"
        },
        {
            "name": "Qi Lyu, Founder",
            "description": "AI/LLM + Full Stack Architect + Product.\n\n1st Prize in China National Math Competition.",
            "linkedin": "https://linkedin.com/in/quinnlyu"
        }
    ],
    "status": true,
    "generated_description": "### Mathos: Revolutionizing Personalized Learning Through AI\n\n**Overview:**  \nFounded in 2023 and based in Santa Clara, CA, Mathos—originally known as MathGPTPro—aims to transform education with its advanced AI math problem-solving capabilities. The company's mission is to create the ultimate AI math tutor, designed to personalize learning experiences for students while boosting the productivity of teachers. \n\n**Key Accomplishments:**  \nIn just one year, Mathos has supported over **1 million students** across **200 countries**, proving that personalized learning isn’t just a dream—it’s a reality. Their AI model outperforms competitors, achieving approximately **20% higher accuracy** than the renowned GPT-4 in math and quantitative problem-solving. \n\n**Educational Impact:**  \nMathos's vision is ambitious: tackling critical issues in education, such as personalization, adaptive learning, and teacher shortages. They’re piloting their technology in schools, focusing on automating grading, offering insightful analytics, and tailoring assignments to meet individual student needs. Imagine every student receiving the attention they require, with teachers equipped to guide their progress effectively.\n\n**Product Features:**  \n1. **On-Demand Tutoring:** The AI provides instant hints and employs Socratic questioning to encourage critical thinking.\n2. **Learning Tracking:** It keeps tabs on each student's learning journey by creating knowledge graphs, identifying where they struggle, and recommending relevant problems.\n3. **Teacher Tools:** Mathos helps teachers by grading homework and suggesting resources when students encounter difficulties, ensuring no one falls behind.\n4. **Personalized Profiles:** The system develops profiles based on a student's learning history, strengths, and interests, enabling teachers to act more as mentors.\n\n**Vision for the Future:**  \nMathos believes that education should be accessible and engaging for everyone. By dismantling barriers with technology, they envision a world where high-quality, affordable education is within reach for all learners. Their goal? To encourage an environment where both students and teachers can thrive, leveraging AI as a powerful ally in the learning process.\n\n**Team and Backing:**  \nWith a lean team of **five employees** and supported by Y Combinator's **Batch W24**, Mathos is well-positioned to make an impact in the edtech space. Nicolas Dessaigne serves as a group partner, further enriching their expertise.\n\n**Join the Journey:**  \nIf you’re curious about how AI can reshape education, Mathos invites you to explore their [website](https://info.mathgptpro.com/) or try their offerings today.\n\nIn short, Mathos isn't just about solving math problems—they're about solving the future of education. And that’s something worth paying attention to.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/5ff1f20727fd61ddb5c69984608c28fd6bc03214.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191526Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=0f3b96b011d788e77ac40e487fbab3955632cd579e1301859ec7b10864d3c596",
    "social_links": [
        "https://www.linkedin.com/company/mathgptpro",
        "https://twitter.com/MathGPTPro"
    ],
    "logo_path": "data/logos\\Mathos_logo.png"
}