{
    "links": "https://www.ycombinator.com/companies/mathdash",
    "name": "MathDash",
    "headline": "Turning Math into a Sport",
    "batch": "W24",
    "description": "MathDash is an online live math-competition platform that gets students addicted to learning. Our target audience already spends thousands of hours doing math questions competitively, and we've *already* gotten the best of the best to switch to doing problems on our site - an average of 65 minutes a day among our 200 most active users, and a total of over 150,000 arithmetic questions solved in just the last week! Why? Because it is more thrilling and exciting to compete live, see yourself on a leaderboard, and improve your 'ELO' rating. \r\n\nWe are USA Math Olympians, and have been the top power users on every single product marketed towards competitive math learners. What's missing is the math game that allows anyone at any level to play with math on demand and compete live at their level, whether it's in the back of an Uber or while training for a math competition.",
    "activity_status": "Active",
    "website": "https://mathdash.com",
    "founded_date": 2024.0,
    "team_size": 2.0,
    "location": null,
    "group_partner": "Dalton Caldwell",
    "group_partner_yc": "https://www.ycombinator.com/people/dalton-caldwell",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": null,
    "founders": [
        {
            "name": "Daniel Sun, Founder",
            "description": "Daniel is the co-founder and CEO of MathDash.\n\nHe was a math competition champion in high school, qualifying for the Math Olympiad Summer Program, which opened doors to MIT and Jane Street. Daniel is now creating MathDash to create an online playground for math games and to get students addicted to learning.",
            "linkedin": "https://linkedin.com/in/daniel-sun-440493171"
        },
        {
            "name": "Akshaj Kadaveru, Founder",
            "description": "Akshaj is the co-founder and CTO of MathDash. \n\nHe is a former serial math competition participant (two-time top-12 finisher in the ESPN nationally broadcasted MATHCOUNTS Countdown Round) who spent thousands of hours of his childhood playing an online math game. He studied CS at MIT, and built (with Daniel) a MIT class comparison site with 2000 users, a guess-the-song game with 6000 players, and worked at Gather, Jump Trading, and Wormhole Labs as a software engineer.",
            "linkedin": "https://linkedin.com/in/akshaj-kadaveru"
        }
    ],
    "status": true,
    "generated_description": "**MathDash: Turning Math into a Sport**\n\nFounded in 2024 and part of Y Combinator's Winter 2024 batch, MathDash is an innovative platform reinventing math education by presenting it as a competitive sport. With a mission to get students addicted to learning math, MathDash allows users to compete in live math competitions, making practice feel more like play.\n\nIn just a short time, MathDash has attracted a dedicated community of math enthusiasts, including USA Math Olympians. The platform boasts impressive engagement metrics with its top 200 users average spending 65 minutes a day solving problems—resulting in over 150,000 arithmetic questions tackled in a single week. The thrill of live competitions, leaderboards, and ELO ratings motivates users, enabling them to challenge themselves and interact with peers in real-time.\n\nMathDash caters to everyone from beginners to elite competitors. It's designed for flexibility: users can practice anywhere, whether it's in an Uber or during downtime, allowing them to harness the power of math competition whenever inspiration strikes. Theirs is a world where math learning transcends textbooks, creating an engaging, interactive experience.\n\nThe platform features various elements:\n\n1. **Contests with Prizes**: Engaging competitions simulate the excitement of in-person math contests. \n2. **Training Tools Available**: A built-in training platform offers instant hints and guidance from expert coaches, complemented by a high-quality curriculum tailored to specific contests.\n3. **Personalized Coaching**: Step-by-step feedback from knowledgeable mentors ensures students improve and feel supported every step of the way.\n4. **Rating System**: Users can track their progress and earn ratings as they compete, helping them connect with relevant challenges and peers.\n\nFeedback from the community highlights how MathDash has transformed enthusiasm around math. Parents appreciate that their children find joy in learning math, and students express eagerness for competitions, illustrating MathDash's impact on nurturing new math lovers.\n\nIn essence, MathDash is not just a platform; it’s a vibrant community and a movement aimed at making math fun, competitive, and universally accessible. The underlying philosophy is simple: the best way to master math is not simply through passive study but through active engagement and competition. If you’re ready to see how math can be exhilarating, explore MathDash [here](https://mathdash.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/845d8bc1a64fe9459ff72a58789e4ec94a756f0d.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191526Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=74fd234e144e4e2aea171ca6d91144694be0308c1351844371fc19bdce691c03",
    "social_links": [
        "https://www.linkedin.com/company/102834223/admin/feed/posts/"
    ],
    "logo_path": "data/logos\\MathDash_logo.png"
}