{
    "links": "https://www.ycombinator.com/companies/matidor-com",
    "name": "Matidor.com",
    "headline": "Project management on a live map",
    "batch": "S21",
    "description": "Matidor.com is a project management software for projects where you need to see what's happening live on a map. Natural resources companies such as energy operators and consultants manage their environmental activities across thousands of locations. Instead of switching between spreadsheets, they need to visualize their projects on a map and zoom into each one of them for details such as site drawings, tasks, costs and communications.\r\n\nhttps://matidor.com",
    "activity_status": "Active",
    "website": "https://matidor.com/",
    "founded_date": 2019.0,
    "team_size": 6.0,
    "location": "Vancouver, Canada",
    "group_partner": "Harj Taggar",
    "group_partner_yc": "https://www.ycombinator.com/people/harj-taggar",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:saas; industry:geographic-information-system; industry:b2b",
    "founders": [
        {
            "name": "Vincent Lam, Founder",
            "description": "Vincent is a visionary and technologist at heart, with 20 years of experience of delivering world-class software. He specializes in product strategy and development, as well as technology transformation for SMBs and enterprises. Vincent previously led large-scale projects at Google and Dassault Systems, and has created a number of award-winning start-ups since 2011.  He currently held an MBA from the University of Ottawa, and a BASc in Computer Engineering from the University of BC.",
            "linkedin": "https://www.linkedin.com/in/lamvincent/"
        },
        {
            "name": "Sean Huang, Founder",
            "description": "A Vancouver-based serial entrepreneur who has founded three startups and has more than 10 years of experience in sales and business development. From door-to-door sales with Telus to handling enterprise accounts, Sean was one of the fastest salesmen in his marketing firm to get promoted to senior sales manager for B2B campaigns. Sean has gone on to build startups in the VRAR space as well as having cross-border experience from his time spent in Shanghai.",
            "linkedin": "https://www.linkedin.com/in/sean-huang/"
        }
    ],
    "status": true,
    "generated_description": "Matidor.com is a Vancouver-based startup that entered the tech scene in 2019 and quickly made waves as part of Y Combinator's Batch S21. With a tight-knit team of six, Matidor’s mission is straightforward yet innovative: to revolutionize project management using live mapping technology. \n\nImagine you’re an energy operator or an environmental consultant juggling numerous projects across various locations. Instead of getting lost in spreadsheets and outdated software, Matidor places everything on an intuitive map interface. This allows users to visualize their projects in real time, offering insights into site specifics like drawings, budgets, tasks, communications, and more—all from a single platform.\n\n### What Makes Matidor Stand Out?\n\n1. **Live Maps for Collaboration**: Instead of disjointed updates, Matidor enables teams to visualize projects seamlessly on maps, promoting better communication and data sharing among owners, consultants, and contractors.\n\n2. **Integrated Project Management**: From budget tracking to field data collection, Matidor integrates all project elements into one cohesive tool. This helps streamline workflows, reduce inefficiencies, and ultimately boost productivity.\n\n3. **Flexibility with Integrations**: Whether you’re using ArcGIS, Slack, or various financial software, Matidor can work with your existing tools, transforming data into actionable insights.\n\n4. **Industry-Specific Solutions**: Matidor caters specifically to sectors like oil and gas, environmental services, and renewables. Its use cases range from environmental site assessments to vegetation management, proving its versatility in distinct project scenarios.\n\n5. **User-Friendly Onboarding**: The platform offers seamless setup processes and ongoing support, ensuring that organizations can switch to this live mapping system without a hitch.\n\n### Current Focus and Future Plans\n\nMatidor aims to simplify field-based project management, an area often burdened by multiple tools and miscommunication. With its real-time capabilities, it is poised to reshape how managers and teams approach project tracking and collaboration across the field.\n\nIf you’re intrigued (and you should be), check them out on their [official website](https://matidor.com/) or even better, book a demo to see how this software can enhance your project oversight.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/728184210d6b4dd13b60ae3a79d4a01faaa98391.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191526Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=1ec7a6d66c09c225ca0a47d264d7e2406d86a9ce429ae4d1611cb24d0305addf",
    "social_links": [
        "https://www.linkedin.com/company/matidorapp/",
        "https://twitter.com/matidor_com",
        "https://www.facebook.com/matidorapp",
        "https://www.crunchbase.com/organization/matidor"
    ],
    "logo_path": "data/logos\\Matidor.com_logo.png"
}