{
    "links": "https://www.ycombinator.com/companies/mattermost",
    "name": "Mattermost",
    "headline": "Secure Collaboration for Technical Teams",
    "batch": "S12",
    "description": "Mattermost provides secure collaboration for technical and operational teams that work in environments with complex nation-state level security and trust requirements. We serve technology, public sector, national defense and financial services industries with customers ranging from tech giants, to the world’s largest banks, to the U.S. Department of Defense and governmental agencies around the world. \r\n\nOur self-hosted and cloud offerings provide team messaging, file sharing, integrations, audio and screen share, workflow automation and project management on an open source platform deployed by the world’s most secure and mission critical organizations. We co-build the future of collaboration with over 4,000 open source project contributors who’ve provided over 30,000 code improvements towards our shared product vision, which is translated into 20 languages.",
    "activity_status": "Active",
    "website": "http://mattermost.com",
    "founded_date": 2016.0,
    "team_size": 120.0,
    "location": "Palo Alto",
    "group_partner": "Michael Seibel",
    "group_partner_yc": "https://www.ycombinator.com/people/michael-seibel",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:devsecops; industry:collaboration; industry:security; industry:open-source; location:san-francisco-bay-area",
    "founders": [],
    "status": true,
    "generated_description": "**Company Summary: Mattermost**\n\n**Overview:**\nFounded in 2016 and part of Y Combinator Batch S12, Mattermost is a collaboration platform designed for technical teams in high-stakes environments that demand top-level security. With its headquarters in Palo Alto, California, the company boasts a talented team of 120 employees. Mattermost aims to deliver secure collaboration solutions specifically tailored for technology, public sector, national defense, and financial services industries. Its clientele includes big names like tech giants, major banks, military organizations, and government agencies worldwide.\n\n**Mission:**\nMattermost’s mission is straightforward: to facilitate secure collaboration among technical teams. This focus on security is vital, considering the sensitive nature of its clientele, particularly in sectors like national defense and finance.\n\n**Key Features:**\nMattermost offers a versatile communication platform that encompasses:\n- **Team Messaging**: Efficient and secure messaging for teams to stay connected.\n- **File Sharing**: Seamless sharing of files within a controlled environment.\n- **Integrations**: Connects with existing tools and workflows.\n- **Audio and Screen Sharing**: Facilitating remote collaboration effortlessly.\n- **Workflow Automation**: Streamlining processes to improve efficiency.\n- **Project Management**: Tools designed to help teams manage tasks effectively.\n- **Open Source Platform**: Enables customization and flexibility, with contributions from over 4,000 open-source project contributors resulting in over 30,000 code improvements.\n\n**Security:**\nGiven its clientele, security is at the forefront of Mattermost's offerings. The platform is built to support stringent security protocols and can be deployed in highly regulated environments or air-gapped networks, ensuring users retain full control over their data.\n\n**Market Position:**\nMattermost has positioned itself uniquely in the market by being a collaboration hub specifically designed for mission-critical use cases. This includes integrated security operations, command and control processes, and facilitating real-time DevSecOps collaboration.\n\n**Current Activities:**\nMattermost is actively enhancing its offerings with new solutions tailored for markets that require high security and resilience. The platform's ability to integrate with tools like Microsoft Teams, Atlassian, and GitLab emphasizes its adaptability and ease of use for organizations already entrenched in these ecosystems.\n\n**Customer Base:**\nSome notable clients using Mattermost include:\n- United States Air Force (USAF)\n- Fujitsu\n- CERN\n- RTE (Réseau de Transport d'Électricité)\n- NRI (Nomura Research Institute)\n- Others from various sectors, solidifying its presence across critical industries.\n\n**The Future:**\nBy co-building the future of collaboration with its community and partners while focusing on innovation and security, Mattermost is set to continue leading the charge for collaboration tools that cater to environments where trust and resilience are paramount.\n\n**Website:** [Mattermost Website](http://mattermost.com)\n\nIn summary, Mattermost represents a critical shift in collaboration paradigms, employing advanced security and integration capabilities to meet the needs of its clients, particularly in high-stakes industries. Its combination of flexibility, security, and adaptability makes it a standout choice for teams aiming to enhance their collaborative efforts while maintaining rigorous standards.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/53fac4885294f7282c987d0db9f55abe5676d231.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191527Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=64b91c1b09c1a434627482e7010d97b74d149c800ff5b517253d7030fa89a784",
    "social_links": [
        "https://www.linkedin.com/company/mattermost",
        "https://twitter.com/Mattermost",
        "https://www.facebook.com/MattermostHQ/",
        "https://www.crunchbase.com/organization/mattermost",
        "https://github.com/mattermost"
    ],
    "logo_path": "data/logos\\Mattermost_logo.png"
}