{
    "links": "https://www.ycombinator.com/companies/may-mobility",
    "name": "May Mobility",
    "headline": "Transforming cities and rural areas through AV transit and technology",
    "batch": "S17",
    "description": "May Mobility is a leader in autonomous vehicle technology development and deployment. With more than 300,000 autonomous rides to date, May Mobility is committed to delivering safe, efficient and sustainable shuttle solutions designed to complement today’s public transportation options. The company’s ultimate goal is to realize a world where self-driving systems make transportation more accessible and reliable, the roads safer, and encourage better land use in order to foster more green, vibrant, and livable spaces.",
    "activity_status": "Active",
    "website": "http://maymobility.com",
    "founded_date": 2017.0,
    "team_size": 260.0,
    "location": "Ann Arbor, MI",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:artificial-intelligence; industry:robotics",
    "founders": [
        {
            "name": "Edwin Olson, Founder/CEO",
            "description": "Edwin Olson is the co-founder and CEO of May Mobility, Inc., an Ann Arbor-based startup that develops self-driving shuttles.  Olson earned his PhD from MIT in 2008 for work in robot mapping.  \n\nOlson has worked on autonomous vehicles for over a decade, including work on the 2007 DARPA Urban Challenge and vehicles for Ford and Toyota Research Institute. Most recently, he was named \"Entrepreneur of the Year\" in the Michigan and Northwest Ohio region by EOY Awards.",
            "linkedin": "https://www.linkedin.com/in/edwin-olson-6644387/"
        }
    ],
    "status": true,
    "generated_description": "### May Mobility: Pioneering the Future of Autonomous Transit\n\n**Overview**\nFounded in 2017 and based in Ann Arbor, Michigan, May Mobility is a trailblazer in the field of autonomous vehicle (AV) technology. As part of Y Combinator's S17 cohort, it brings fresh innovation to the urban and rural transport sectors, aiming to transform mobility options worldwide.\n\n**Mission**\nMay Mobility's mission is simple yet impactful: to transform cities and rural areas through autonomous vehicle transit and technology. The company seeks to enhance transportation accessibility, reliability, and sustainability, while fostering safer, greener, and more livable spaces for everyone.\n\n**Achievements**\nWith an impressive record of over 300,000 autonomous rides, May Mobility emphasizes safety and efficiency in its shuttle solutions, which are designed to complement existing public transport systems. Its flagship technology, the Multi-Policy Decision Making (MPDM) system, utilizes real-time reinforcement learning to adapt constantly, making it a leader in the AV industry.\n\n**Team and Culture**\nThe company boasts a dedicated team of around 260 employees who are passionate about rethinking transportation. They understand that successful AV deployment requires collaboration with various stakeholders, including cities, transit agencies, and local organizations. May Mobility values inclusivity, offering ADA-compliant services to ensure accessibility for all.\n\n**Cutting-Edge Technology**\nThe MPDM system allows May Mobility's vehicles to learn on the fly—adjusting to new scenarios every 200 milliseconds. This adaptability is crucial for safely navigating complex environments. By continuously generating training scenarios relevant to their current surroundings, the vehicles enhance their decision-making capabilities without being limited by pre-collected data.\n\n**Recent Developments**\nIn recent news, May Mobility has launched its first driverless commercial ride-hail service, marking a significant milestone in its operational expansion. Recognized for its innovative approach, the company is positioning itself against established players like Waymo by introducing self-driving vehicles that cater to broader transport needs.\n\n**Future Directions**\nAs May Mobility continues to grow, it is keen on partnering with communities to identify and fill transportation gaps. The company is eager to expand its services, including the introduction of an autonomous minibus expected to debut in 2026, which reflects its commitment to innovative public transit solutions.\n\nIn essence, May Mobility is not just another tech startup; it embodies a vision for the future of transportation—one where cities are smarter, greener, and where getting around is as easy as hailing a ride. You can learn more about their vision and technology at [May Mobility's website](http://maymobility.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/db99e2047caafb9cc85dcfe602783bf7afd5e11b.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191528Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=a2073e311cbfd544940d34161a00378184624e07652c06ebb73702b0b9a9d251",
    "social_links": [
        "https://www.linkedin.com/company/18036611/",
        "https://twitter.com/may_mobility",
        "https://www.facebook.com/maymobility",
        "https://www.crunchbase.com/organization/may-mobility",
        "https://github.com/maymobility"
    ],
    "logo_path": "data/logos\\May_Mobility_logo.png"
}