{
    "links": "https://www.ycombinator.com/companies/mecho-autotech",
    "name": "Mecho Autotech",
    "headline": "On-demand  auto maintenance & repairs",
    "batch": "S21",
    "description": "It is cumbersome to maintain/repair vehicles in Africa. Vehicle owners currently have 2 options to choose from; very expensive and geographically limited branded mechanic garages (less than 1% of the supply pool) or unvetted roadside mechanics (about 99% of the supply pool). \r\n\nAbout 95% of vehicle owners cannot afford branded garages where quality and reliable service delivery can be guaranteed and thus rely on roadside mechanics. However, low quality and transparency are typical issues associated with roadside mechanics. \r\n\nWe created a network of vetted mechanics, spare part vendors and an app that enables easy booking, payment and mechanic matching process. Via the mecho app, a customer or business can make a request for any automobile service (repairs or regular servicing) or part.",
    "activity_status": "Active",
    "website": "https://mechoautotech.com/",
    "founded_date": 2021.0,
    "team_size": 35.0,
    "location": "Lagos, Nigeria",
    "group_partner": "Michael Seibel",
    "group_partner_yc": "https://www.ycombinator.com/people/michael-seibel",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:auto-commerce; industry:marketplace; industry:e-commerce",
    "founders": [
        {
            "name": "Olusegun Owoade, Founder",
            "description": "I’m Olusegun Owoade, a brief about my work experience and education,\n\n•       10+ years’ experience in Actuarial and Risk consulting across top tier consulting firms.\n\n•       Former Chief Risk Officer (CRO) at Kobo360 Inc\n\n•       Former Risk Advisory services Manager at Ernst & Young\n\n•       Former Senior Actuarial Consultant at HR Nigeria Ltd (Formerly Hymans Robertson Nigeria Ltd)\n\n•       PGD Actuarial Science, University of Leicester, UK\n\n•       B.Tech Statistics, LAUTECH, Nigeria",
            "linkedin": "https://www.linkedin.com/in/olusegun-owoade-0437a916/"
        }
    ],
    "status": true,
    "generated_description": "**Mecho Autotech: Revolutionizing Auto Maintenance in Africa**\n\nFounded in 2021 and part of Y Combinator's Batch S21, Mecho Autotech is based in Lagos, Nigeria, on a mission to streamline on-demand auto maintenance and repairs. The impetus for Mecho came from the challenges vehicle owners face in Africa. With less than 1% of the service options being reliable branded garages—which most can't afford—about 99% of the market is tied to unvetted roadside mechanics, often resulting in poor service quality and a lack of transparency.\n\nTo bridge this gap, Mecho has developed a robust network of vetted mechanics and spare part vendors, complemented by a convenient app that simplifies booking, payments, and matching customers with the right service providers. This tech-driven solution offers private vehicle owners and enterprises a streamlined approach to maintaining their vehicles, keeping track of repair history, and managing fleet activities effortlessly.\n\nWith a team of 35, Mecho is not just about repairs; they provide a comprehensive digital infrastructure that connects various stakeholders in the vehicle lifecycle—including automobile workshops, vehicle part manufacturers, and fleet management services. This integration fosters collaboration and workflow efficiency, allowing businesses and individual users to monitor repairs in one centralized platform.\n\nOn the financial end, Mecho offers a credit access feature enabling users to maintain fleet health even with cash flow fluctuations. The results speak for themselves: over 58,980 vehicles have been maintained through Mecho, leading to impressive savings exceeding ₦129 million for enterprises. \n\nTheir branding includes partnerships with notable companies like AXA Mansard, showcasing the trust and reliance placed in their services. \n\nIn essence, Mecho Autotech is reshaping the automotive service landscape in Africa by prioritizing quality, efficiency, and transparency. With their cutting-edge solutions, they're not just keeping vehicles running; they're powering the future of auto maintenance across the continent.\n\nTo learn more about their services or to book an appointment, visit [Mecho Autotech](https://mechoautotech.com/).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/9f872e985c0bd6e11fe5f5e9b40f5c361e939a0b.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191528Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=7ac9d320790b7a5fec8f0d2b12434f39db9150c251af7bf61991ca11a2e9364a",
    "social_links": [
        "https://www.linkedin.com/company/mechoautotech",
        "https://www.facebook.com/mechoautotec",
        "https://www.crunchbase.com/organization/mecho-autotech"
    ],
    "logo_path": "data/logos\\Mecho_Autotech_logo.png"
}