{
    "links": "https://www.ycombinator.com/companies/mederva-health",
    "name": "Mederva Health",
    "headline": "Medical expertise for everyone.",
    "batch": "W22",
    "description": "Mederva Health extends the doctor's clinic by providing medically-prescribed lifestyle interventions between visits. Our mobile app and care team help reduce risk factors for diseases like diabetes, heart disease, and strokes. We enhance patient outcomes, save time, and boost revenue at no added cost so doctors can provide better care for their patients.",
    "activity_status": "Active",
    "website": "https://medervahealth.com/",
    "founded_date": 2021.0,
    "team_size": 2.0,
    "location": "San Francisco",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:consumer-health-services; industry:telehealth; industry:digital-health; industry:healthcare; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Sabih Mir, Founder",
            "description": "I studied cognitive psych and mechanical engineering (Human Factors) at Tufts (as well as English, Philosophy) and have been in Product and UX Design for 20+ years. I was the first designer at Ginger (now Headspace Health). Born and raised just north of NYC to Kashmiri and Pakistani immigrants, I spent ~15 years in Boston and now live in Oakland, CA.\n\nMy goal is to collaborate with folks that care about people and want to shape the impact technology has on humanity for the greater good.",
            "linkedin": "http://linkedin.com/in/sabihmir"
        },
        {
            "name": "Mohammed Kaleel, Founder",
            "description": "Hacker turned Physician turned Founder.\n\nI grew up in the US Virgin Islands. Family is from Palestine. \n\nI studied Comp Sci & Math in undergrad, was an early engineer at two failed startups in mid 2000s. I went to medical school. Created a viral iOs app that was #1 in the Health category with 5M+ users. Finished training and joined as Faculty at Stanford in Musculoskeletal Radiology. Met my cofounders playing basketball in the Mission in SF. We started Mederva Health to help people at scale.",
            "linkedin": "https://www.linkedin.com/in/drkaleel/"
        }
    ],
    "status": true,
    "generated_description": "**Mederva Health: Bridging the Gap in Healthcare**\n\nFounded in 2021 and part of Y Combinator's Winter 2022 batch, Mederva Health is a San Francisco-based startup with a mission: \"Medical expertise for everyone.\" With a compact team of just two employees, Mederva has ambitious goals to empower patients by extending the care provided in doctors' offices through innovative lifestyle interventions.\n\n**What They Do**\n\nMederva Health facilitates medically-prescribed lifestyle changes that occur between patient visits. Their intuitive mobile app, combined with a dedicated care team, plays a central role in helping patients manage their health risks related to conditions like diabetes, heart disease, and strokes—ultimately enhancing patient outcomes and reducing the time burden on doctors. This mix of personalized care and technology aims to support chronic conditions while allowing physicians to focus on providing top-quality care without extra costs.\n\n**The Approach**\n\nTheir model emphasizes personalized health plans tailored to individual patient needs. Mederva pairs patients with a mix of healthcare professionals, including doctors, nutritionists, health coaches, and behavioral therapists, ensuring 24/7 support. By utilizing the latest behavioral therapy techniques and AI-powered tools, Mederva makes health management accessible and effective.\n\n**Conditions Addressed**\n\nMederva Health targets a wide range of health conditions, including:\n- Diabetes\n- Heart Disease\n- Hypertension\n- Stress\n- Sleep Disorders\n- And many more...\n\nBy carefully selecting US board-certified specialists from prestigious institutions like Stanford, Johns Hopkins, and Yale, they ensure that expert care is always within reach.\n\n**Why Choose Mederva Health?**\n\nThe company's model not only enriches patient care but also supports doctors by providing additional resources. This creates a win-win situation where patients have better chances of health transformation, and doctors gain back precious time to focus on their practice.\n\nWith Mederva Health, better health truly starts here. If you're looking to supercharge your healthcare experience, check them out at [MedervaHealth.com](https://medervahealth.com/).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/89de18f4c69bc3952ca783902e2054844a067d6b.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191529Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=0b5d49c329189b3160b4ff1bc0d2e20407045c386f69a11a22d20cd3a38b5f4b",
    "social_links": [
        "https://www.linkedin.com/company/mederva-health/",
        "https://twitter.com/mederva",
        "https://facebook.com/mederva"
    ],
    "logo_path": "data/logos\\Mederva_Health_logo.png"
}