{
    "links": "https://www.ycombinator.com/companies/meesho",
    "name": "Meesho",
    "headline": "Democratizing internet commerce for everyone in India",
    "batch": "S16",
    "description": "Meesho is India’s only true online marketplace, altering the status quo to make e-commerce inclusive and accessible for the next billion users. With a vision to enable 100 million small businesses, including individual entrepreneurs, to succeed online, Meesho is democratising internet commerce and bringing a range of products and new customers online. The Meesho marketplace provides sellers access to millions of customers, selections from over 30 categories, pan-India logistics, payment services and customer support capabilities to efficiently run their businesses.",
    "activity_status": "Active",
    "website": "http://www.meesho.com",
    "founded_date": 2015.0,
    "team_size": 1450.0,
    "location": "Bengaluru, India",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:e-commerce; industry:retail",
    "founders": [],
    "status": true,
    "generated_description": "**Meesho: Democratizing E-commerce in India**\n\nFounded in 2015 and emerging from Y Combinator's S16 batch, Meesho has carved out a unique niche as India's true online marketplace. Its mission? To democratize internet commerce for every Indian. By focusing on inclusivity and accessibility, Meesho empowers an array of small businesses and individual entrepreneurs to thrive online.\n\n### Key Features:\n- **Marketplace Model**: Meesho connects sellers with millions of customers across India, offering access to over 30 product categories. The platform provides comprehensive services including logistics, payment processing, and customer support, enabling sellers to focus on growth.\n  \n- **Wide Product Range**: From traditional attire like sarees and kurtas to electronics and home goods, Meesho boasts a staggering selection that caters to various tastes and budgets. This breadth not only empowers local artisans but also meets consumers' needs across the board.\n\n- **User-Friendly Experience**: With a clean interface and features like cash on delivery, easy returns, and a mobile app, Meesho is designed for convenience. Customers can find products, make purchases, and manage their orders with ease.\n\n### Vision:\nMeesho aims to enable 100 million small businesses in India, reinforcing its commitment to inclusivity in e-commerce. The platform’s broad appeal lies in its understanding of India's diverse consumer base, delivering products that resonate at local levels while facilitating access to the global market for sellers.\n\n### Team and Operations:\nBased in Bengaluru, Meesho operates with a dynamic team of approximately 1,450 employees. The company is backed by robust partnerships, notably with Nan, to enhance its operational and strategic effectiveness.\n\n### Join Meesho:\nWhether you’re seeking a way to shop affordably or looking to become a supplier and earn through your product offerings, Meesho provides exciting opportunities on both fronts. \n\n**Website**: [Meesho](http://www.meesho.com)  \n**App**: Download the Meesho app for a seamless shopping experience.\n\nIn summary, Meesho isn't just another e-commerce platform; it’s a movement towards greater economic empowerment within India, and this mission is what sets it apart in the bustling world of online retail.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/55f65e74439c3542451db4aea92332fa3edd7bca.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191530Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=876c3aad34c5e47104b2e0eae12ecda4df76dd49535573e71cc14c7014c18380",
    "social_links": [
        "https://www.linkedin.com/company/meesho/",
        "https://twitter.com/Meesho_Official",
        "https://www.crunchbase.com/organization/meesho",
        "https://github.com/Meesho"
    ],
    "logo_path": "data/logos\\Meesho_logo.png"
}