{
    "links": "https://www.ycombinator.com/companies/mentalhappy",
    "name": "MentalHappy",
    "headline": "Group-Therapy Platform for Providers and Health Systems",
    "batch": "S18",
    "description": "MentalHappy is a secure and compliant platform that leverages AI and data-driven analytics to enhance the group-based therapy experience and boost client/patient engagement. Our platform streamlines administrative tasks for providers, improves group participant self-management capabilities, automates group participant check-ins, and identifies group members who may be at risk. Additional features on the platform allow providers to schedule and host virtual sessions, engage members in secure chat, and share health resources, and offer support groups",
    "activity_status": "Active",
    "website": "http://www.MentalHappy.com",
    "founded_date": 2016.0,
    "team_size": 7.0,
    "location": "San Francisco",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:mental-health-tech; industry:consumer-health-services; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Tamar Blue, Founder/CEO",
            "description": "Tamar's personal experience with finding effective therapies for her anxiety fueled her passion for helping people live more fulfilled lives. Tamar has appeared in major publications such as Reader's Digest, TechCrunch, Silicon Valley Business Journal, Creative Mornings. Tamar earned her MBA after graduating from Florida State University with a degrees in Sociology and Economics.",
            "linkedin": "https://www.linkedin.com/in/tamarlucienblue/"
        },
        {
            "name": "Kwame Ampem",
            "description": "I grew up in the United States. I believe technology when applied rightfully has the potential to positively influence our human experience. I've started a few startups myself so I'm very familiar with the startup world.",
            "linkedin": "https://www.linkedin.com/in/ampemk/"
        }
    ],
    "status": true,
    "generated_description": "**MentalHappy: Reinventing Group Therapy**\n\nFounded in 2016 and a proud member of Y Combinator's Batch S18, MentalHappy is headquartered in San Francisco, leveraging cutting-edge AI and data analytics to enhance group therapy experiences. With a tight-knit team of seven, their mission is crystal clear: to provide a secure, compliant platform tailored for mental health providers and systems that facilitates group therapy more effectively.\n\n**What They Offer**\n\nMentalHappy’s platform simplifies the logistics involved in mental health support by automating various tasks. Providers can manage group participation more seamlessly, automate participant check-ins, and identify members who may need extra attention. The platform supports secure chats, resource sharing, and scheduling both virtual and in-person sessions. Simply put, it’s designed to maximize engagement while minimizing the stress of administrative work. \n\nThey understand the pressing need for accessible mental health resources, especially as the U.S. faces a projected shortage of 250,000 mental health professionals by 2025. With MentalHappy, therapists can support more clients simultaneously through expertly facilitated support groups.\n\n**Security and Privacy**\n\nWhile digital platforms can often feel unsecured, MentalHappy is committed to creating a safe environment tailored for discussing sensitive mental health issues. They allow for precise privacy settings, ensuring that group spaces remain confidential and secure.\n\n**Engagement and Flexibility**\n\nThe platform isn’t just about logistics; it focuses on engagement. MentalHappy provides AI-driven tools for individual check-ins and metrics that help therapists gauge group member participation and overall morale. This data-driven approach is critical as it allows for real-time adjustments to enhance participant experience.\n\n**Accessibility and Community**\n\nWhether online or on their app (available on iOS and Android), MentalHappy ensures users can connect with their groups anytime, anywhere. Their website also features extensive resources for both participants and mental health organizations, making support more accessible.\n\n**A Need for Change**\n\nTestimonials from professionals highlight how MentalHappy has transformed their practices. Users emphasize the platform's ease of use and its significance in building community among clients—essentially, it's a game changer in providing supplemental care between sessions.\n\nIn summary, MentalHappy is not just about therapy; it's about reshaping how mental health support is delivered in a group setting—making it efficient, secure, and genuinely human-centered. If you're in the mental health space looking to streamline your practice while improving client engagement, MentalHappy is worth a look. \n\n**Check it out:** [MentalHappy Website](http://www.MentalHappy.com)",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/ffea212fd32efbf165a6b4a6d6e0c9059eb32f24.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191531Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=88c8a4edf95eceb54076f904aff3dd10eeec082a9fee84a0baaed400ece83631",
    "social_links": [
        "https://www.linkedin.com/company/mentalhappy",
        "https://twitter.com/mentalhappy",
        "https://www.facebook.com/MentalHappyHumans/",
        "https://www.crunchbase.com/organization/mentalhappy"
    ],
    "logo_path": "data/logos\\MentalHappy_logo.png"
}