{
    "links": "https://www.ycombinator.com/companies/mentorcam",
    "name": "Mentorcam",
    "headline": "Mentorship from leaders of the world's best companies",
    "batch": "S21",
    "description": "Mentorcam is a marketplace for 1:1 business and career advice.",
    "activity_status": "Active",
    "website": "https://mentor.cam/",
    "founded_date": 2019.0,
    "team_size": 9.0,
    "location": "Los Angeles, CA",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:education; industry:marketplace; location:los-angeles",
    "founders": [
        {
            "name": "Rune Hauge, Founder",
            "description": "Rune Hauge is the CEO of Mentorcam and has 10+ years of experience building and scaling startups. He previously founded apparel brand Hardhaus (acquired) and video shopping software startup Preplay. An avid skier, he can often be found on a remote mountaintop somewhere in the Rockies when he's not working on Mentorcam.",
            "linkedin": "https://www.linkedin.com/in/runelohrhauge/"
        }
    ],
    "status": true,
    "generated_description": "### Mentorcam: Unlocking Access to Mentorship\n\n**Overview**  \nFounded in 2019 and currently part of Y Combinator's Batch S21, Mentorcam is based in Los Angeles and operates as a marketplace for 1:1 business and career mentorship. The platform connects individuals with leaders from top companies, providing tailored advice from industry veterans. With a team of nine passionate employees, Mentorcam is dedicated to transforming the mentorship landscape.\n\n**Mission**  \nAt its core, Mentorcam aims to democratize mentorship by bridging the gap between aspiring entrepreneurs and seasoned professionals. Their mission, encapsulated in the phrase “Mentorship from leaders of the world's best companies,” reflects their commitment to providing high-quality guidance.\n\n**How It Works**  \nUsers can browse an extensive network of mentors across various expertise and industry sectors, including B2B sales, fundraising, growth marketing, and more. Mentorcam allows individuals to book video calls with mentors who have proven track records in their respective fields. This setup not only fosters personalized learning experiences but also enables users to discuss industry-specific challenges in real time.\n\n**Benefits of Using Mentorcam**  \n- **Personalized Guidance:** Users can receive customized advice tailored to their specific needs and sectors.\n- **On-Demand Mentorship:** With an elite network of vetted mentors, users can connect with experienced professionals whenever they need insight.\n- **Real-Time Communication:** The platform supports 1:1 video calls, allowing for immediate discussions of pressing business issues.\n- **Continuous Interaction:** Users can message mentors before and after sessions to maintain continuity in their learning journeys.\n\n**Diverse Mentoring Opportunities**  \nMentorcam covers a wide array of industries including artificial intelligence, healthcare, fintech, e-commerce, and more. Their mentors come from highly regarded companies such as TikTok, Google, and Y Combinator, ensuring that users gain insights from the best.\n\n**Client Testimonials**  \nUsers have reported significant positive outcomes from their mentorship sessions, including improved fundraising capabilities, enhanced operational strategies, and accelerated business growth. For example, one founder mentioned that their mentor played a crucial role in raising $1.42 million for their startup.\n\n**Getting Started**  \nInterested individuals can easily sign up on [Mentorcam's website](https://mentor.cam/) to start booking sessions with mentors. They often offer discounts on first-time sessions to encourage new users to experience the benefits of mentorship.\n\n**Conclusion**  \nMentorcam isn’t just another educational platform; it’s a valuable resource for anyone looking to deepen their understanding of business practices and accelerate their professional growth. With access to mentors who have been there and done that, users can carve out their paths to success with confidence. This blend of technology and mentorship has the potential to unlock countless opportunities for aspiring entrepreneurs and seasoned professionals alike.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/411ef5640dd275db3d5402d98fd197d35d468980.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191531Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=e20a066668b69cbeabd2f126b5a4c00b117b6a59151935fea4c840d4ab48e2e0",
    "social_links": [
        "https://www.linkedin.com/company/mentorcam/",
        "https://twitter.com/getmentorcam",
        "https://www.facebook.com/mentorcam",
        "https://www.crunchbase.com/organization/mentorcam"
    ],
    "logo_path": "data/logos\\Mentorcam_logo.png"
}