{
    "links": "https://www.ycombinator.com/companies/mesh-2",
    "name": "Mesh",
    "headline": "Automate outsourced accounting work with AI",
    "batch": "W25",
    "description": "Mesh builds domain-specific AI agents to automate repetitive accounting tasks like cash reconciliation, expense wires, and inter-company transactions. Whatever tasks accounting firms are currently outsourcing abroad for reduced labor costs, we automate entirely.\r\n\nAt Carta, we spent 5+ years working together to automate accounting. We helped grow Carta's fund accounting business from $20M to $100M, transformed offline excel tasks into automated workflows, and increased customer satisfaction score by over 50% by creating an internal workspace for task coordination. \r\n\nUntil now, the only way to scale accounting firms was to hire more employees and outsource more work. With Mesh, accountants can save time on each task, save money on hiring additional resources, and use their extra capacity to exponentially grow their business.\r\n\nWith a current shortage of 340,000 accountants in the US, along with the alarming statistic that 75% of certified public accountants (CPAs) will reach retirement within the next 15 years, AI has a critical role to play. And we want to be the ones to automate this $63bn outsourced accounting and finance industry.\r\n\nOur AI agents work long hours, so accountants don't need to.",
    "activity_status": "Active",
    "website": "http://www.usemesh.com",
    "founded_date": 2024.0,
    "team_size": 2.0,
    "location": "San Francisco",
    "group_partner": "Michael Seibel",
    "group_partner_yc": "https://www.ycombinator.com/people/michael-seibel",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:finance; industry:productivity; industry:enterprise-software; industry:ai; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Erin Kim, Founder",
            "description": "Co-Founder + CEO @ Mesh\n\nAutomating outsourced accounting with AI, one task at a time. Previously at Carta, Barclays IB, and Econ at WashU.",
            "linkedin": "https://www.linkedin.com/in/erinkim720/"
        },
        {
            "name": "Nandini Ramakrishnan, Founder",
            "description": "Co-Founder + CTO @ Mesh\n\nDeveloping AI-driven automations for back-office accounting, admin and outsourced CFO shops. Previously at Carta, eBay, ECE at CMU.",
            "linkedin": "https://www.linkedin.com/in/nandiniramakrishnan/"
        }
    ],
    "status": true,
    "generated_description": "**Mesh: Transforming Accounting with AI**\n\nFounded in 2024 and nestled in the heart of San Francisco, Mesh is on a mission to fundamentally change the way outsourced accounting is handled. With a sharp focus on automating repetitive tasks—think cash reconciliation, expense wires, and inter-company transactions—Mesh is here to disrupt the $63 billion outsourced accounting and finance industry. They’re harnessing the power of AI to streamline processes that most firms currently offload overseas, creating a more efficient and cost-effective solution.\n\nBefore establishing Mesh, the founders were instrumental at Carta, where they helped propel a $20 million fund accounting business to $100 million over five years. Their experience in converting tedious, offline Excel tasks into automated workflows not only boosted revenue but also significantly elevated customer satisfaction.\n\nThe pressing challenge in the accounting sector is the current shortage of accountants—340,000 to be exact—coupled with the worrying statistic that 75% of CPAs are expected to retire within 15 years. In this landscape, Mesh positions itself as a critical enabler, allowing accounting firms to scale without merely hiring more personnel.\n\nWith just a team of two and backed by Y Combinator (Batch W25), Mesh is rapidly innovating in the productivity space. Their AI agents work tirelessly so accountants can focus on strategic growth rather than getting bogged down in manual reconciliations.\n\nWhether you’re a small business owner or running a larger firm, the practical benefits are clear. No more hours spent categorizing transactions; with Mesh, you sync your bank accounts and general ledger, and the AI takes care of the rest. Companies can enjoy real-time visibility into their cash flow and quickly get answers to important questions instead of waiting days for manual reports.\n\nIn a world where accounting must adapt quickly to a fast-paced business environment, Mesh's automated bookkeeping promises to save time, reduce errors, and enhance decision-making. Ready to see what an AI-driven future looks like for your accounting needs? Join their waitlist at [Mesh](http://www.usemesh.com) and be part of the revolution—because it’s high time your bookkeeping went on autopilot.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/24460ecdfaa99beeb67c68a80d12acbbd0897136.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191533Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=0f95f8e07362db73dc7ad458e3133c99d52f7cf1524a397a4bbacbc4a6031acc",
    "social_links": [
        "https://www.linkedin.com/company/usemesh"
    ],
    "logo_path": "data/logos\\Mesh_logo.png"
}