{
    "links": "https://www.ycombinator.com/companies/metriport",
    "name": "Metriport",
    "headline": "Open-Source Universal API for Healthcare Data",
    "batch": "S22",
    "description": "Metriport helps healthcare organizations access and manage comprehensive patient medical data.\r\n\nThrough a single integration, Metriport ensures clinical accuracy and completeness of medical information to providers, delivering comprehensive consolidated patient clinical data at the point-of-care. By standardizing, de-duplicating, consolidating, and hydrating the data with medical code crosswalking, providers get a rich understanding of their patients' medical histories through Metriport.\r\n\nMetriport is the only open-source solution of its kind that offers all these integrations in a single platform, and standardizes complex data formats into industry standards such as FHIR and C-CDA.\r\n\nAs a developer-first, HIPAA and SOC 2 Type II compliant interoperability solution, Metriport is powering the next wave of innovators in healthcare, creating an internet for healthcare data.",
    "activity_status": "Active",
    "website": "https://metriport.com/",
    "founded_date": 2022.0,
    "team_size": 7.0,
    "location": "San Francisco",
    "group_partner": "Nicolas Dessaigne",
    "group_partner_yc": "https://www.ycombinator.com/people/nicolas-dessaigne",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:developer-tools; industry:b2b; industry:digital-health; industry:healthcare; industry:api; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Dima Goncharov, Founder",
            "description": "Dima Goncharov is a Co-Founder & CEO of Metriport, which he started with Colin Elsinga in 2021. Dima is a software engineer by trade with professional industry experience building everything from aerospace systems, to highly available cloud database services.",
            "linkedin": "https://www.linkedin.com/in/dimagoncharov/"
        },
        {
            "name": "Colin Elsinga, Founder",
            "description": "Colin Elsinga is the co-founder and COO of Metriport, which he started with Dima Goncharov in 2021. Colin is a software engineer and designer with professional experience building consumer health apps.",
            "linkedin": "https://www.linkedin.com/in/colin-elsinga/"
        }
    ],
    "status": true,
    "generated_description": "**Meet Metriport: The Open-Source API Revolutionizing Healthcare Data**\n\n**Overview**  \nFounded in 2022 and born out of Y Combinator's Batch S22, Metriport is trailblazing the healthcare tech landscape from the heart of San Francisco. The company has a lean team of seven dedicated employees, driving its mission: to create an Open-Source Universal API for Healthcare Data. The goal? Simplifying access to comprehensive patient medical data for healthcare organizations.\n\n**What They Do**  \nMetriport emerged initially to help healthcare providers access and manage detailed patient medical histories. Through a single integration point, it ensures clinical accuracy and completeness, delivering a consolidated view of patient data right at the point-of-care. They standardize and de-duplicate data, and even \"hydrate\" it with medical coding crosswalks, so healthcare providers truly understand their patients' medical backgrounds.\n\nHere’s the kicker: Metriport is the only open-source solution that combines all these capabilities in one platform. They transform complex data formats into industry standards, specifically FHIR and C-CDA, making the integration process smoother than ever.\n\n**Developer-Centric Approach**  \nMetriport is crafted with developers in mind. It's HIPAA and SOC 2 Type II compliant, which is critical for today’s healthcare landscape. The platform empowers innovators by effectively creating an \"internet for healthcare data,\" ultimately streamlining access to patient information and paving the way for new healthcare advancements.\n\n**Current Offerings**  \nMetriport currently features three main products:  \n1. **Medical API**: Access comprehensive patient data in seconds. This API is FHIR-native and ensures interoperability with the largest health information networks.\n2. **Provider Dashboard**: A no-code dashboard designed for healthcare providers to manage all their patient documents and gain insights without needing engineering expertise.\n3. **FHIR Converter**: Simplifies the integration of different healthcare data formats.\n\nIn addition to its core tools, Metriport boasts seamless integration with major EHR systems like athenaOne and Elation, ensuring that patient data is always available when needed.\n\n**Privacy & Security**  \nMetriport takes security seriously. Being HIPAA compliant and SOC 2 Type II verified, they're dedicated to upholding the highest standards for data safety. With advanced measures—like multi-factor authentication and encryption—they ensure that both organizations and patients can trust their data is secure.\n\n**Why Open-Source?**  \nMetriport believes that open-source is the way forward for healthcare technology. By fostering transparency, reliability, and collaboration, the platform invites community contributions and allows organizations to self-host its code. This freedom means no vendor lock-in, ensuring that innovative solutions can grow organically.\n\n**Future Outlook**  \nAs Metriport continues to develop its offerings, it's positioning itself as an indispensable tool for healthcare organizations seeking to become more agile and data-driven. This isn't just about having a slick API; it's about reshaping how patient data is accessed, managed, and utilized across the healthcare ecosystem.\n\nFor more details, check out [Metriport's website](https://metriport.com/) and see how they’re making waves in the healthcare data space. If you're a developer or healthcare provider looking to simplify your data needs, a demo might be just what you need. \n\nIn a world where timely access to healthcare data can significantly impact patient outcomes, Metriport is poised to lead the charge toward a more integrated, efficient future.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/ca3f92ea54dc8cdabcaf691d1a29ddbe6011756e.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191535Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=425207f0b2e0681c518247bdf22d6606355a992c0bc111b4b6e7bc9cd93ac368",
    "social_links": [
        "https://www.linkedin.com/company/80365638",
        "https://twitter.com/metriport",
        "https://www.crunchbase.com/organization/metriport",
        "https://github.com/metriport/metriport"
    ],
    "logo_path": "data/logos\\Metriport_logo.png"
}