{
    "links": "https://www.ycombinator.com/companies/mezmo",
    "name": "Mezmo",
    "headline": "Observability platform to control all of your log data",
    "batch": "W15",
    "description": "Mezmo, formerly LogDNA, is an observability platform to manage and take action on your data. It ingests, processes, and routes log data to fuel enterprise-level application development and delivery, security, and compliance use cases.\r\n\nMezmo was brought to life by three-time co-founders Chris Nguyen and Lee Liu and included in the Winter 2015 batch of Y Combinator. In 2018 the company partnered with tech giant, IBM, to become the sole logging provider for IBM Cloud.\r\n\nMezmo is on a mission to empower people who build solutions that shape the world. We’re doing this by delivering a platform that enables enterprises to get more value from their observability data in real time, regardless of source, destination, use case, or scale. We’re not the only ones working on this problem but we have a few things the others don’t.\r\n\nWe’re cloud-native and know how to make the most of modern technology like Kubernetes.\r\nWe have scaled a solution from zero to petabyte scale in a short amount of time, while supporting thousands of active users across multiple environments.\r\nWe are hungry for change and are surrounded by enterprises telling us they’re hungry, too.\r\nWe have a kick-ass group of people who are thinking about the problem analytically and are excited to change the observability world for the better.\r\nMezmo has helped some of the world’s most innovative companies transform how they manage their systems and applications. Still, we know that we can help them get more value from their observability data by providing more flexibility and control over how they use it. This will enable teams to spend less time switching between data silos so they can focus on shipping better, more resilient, and secure products.\r\n\nWe have momentum on our side. Last year we saw triple digit revenue growth and added 800 new customers to our roster. Recent accolades include being named to YC’s Top Companies, CRN’s 10 Hottest DevOps Startups, and EMA’s Top 3 Observability Platforms.",
    "activity_status": "Active",
    "website": "https://www.mezmo.com/",
    "founded_date": 2015.0,
    "team_size": 172.0,
    "location": "San Jose, CA",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:developer-tools; industry:devsecops; industry:saas; industry:kubernetes; industry:data-engineering; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Chris Nguyen, Founder",
            "description": null,
            "linkedin": "https://linkedin.com/in/christophernguyen"
        },
        {
            "name": "Lee Liu",
            "description": "Co-founder at Shuttle",
            "linkedin": "https://www.linkedin.com/in/leeliu"
        }
    ],
    "status": true,
    "generated_description": "### Mezmo: Elevating Observability with Data Control\n\n**Overview:**\nFounded in 2015 as LogDNA and later rebranded to Mezmo, the company has emerged as a leading observability platform, centered on managing and leveraging log data for enterprises. With its roots in Silicon Valley, Mezmo is positioned in San Jose, CA, housing a dedicated team of about 172 employees.\n\n**Mission:**\nMezmo is on a mission to empower developers and engineers by providing a robust platform that transforms data into actionable insights. This platform supports companies by enhancing their application development, delivery processes, security protocols, and compliance measures.\n\n**Founders and Background:**\nThe company was co-founded by Chris Nguyen and Lee Liu, notable figures in the tech startup landscape. Their journey began with their inclusion in the Winter 2015 Y Combinator batch, a prestigious accelerator known for launching successful tech companies. In 2018, Mezmo solidified its standing when it partnered with IBM to become the exclusive logging provider for IBM Cloud.\n\n**Key Offerings:**\n1. **Telemetry Pipeline:** Mezmo's Telemetry Pipeline aggregates, profiles, and routes telemetry data from various sources to optimize usage and reduce costs. It allows seamless integration with popular observability platforms like Splunk, Datadog, and Grafana.\n   \n2. **Log Management:** The platform provides next-gen log management capabilities, enabling users to simplify log ingestion, create custom alerts, and analyze data in real-time.\n   \n3. **Data Profiling and Recipes:** Mezmo offers tools to profile data effectively, allowing users to identify repetitive patterns and recommend optimizations, which can lead to significant cost reductions.\n\n4. **Responsive Pipelines:** These adaptive pipelines automatically adjust to changing telemetry conditions, enhancing incident response times and minimizing downtime.\n\n**Recent Achievements:**\n- Mezmo has experienced phenomenal growth, including triple-digit revenue increases and the addition of 800 new clients within the past year.\n- The company was recognized among Y Combinator’s Top Companies and featured in lists like CRN’s 10 Hottest DevOps Startups and EMA’s Top 3 Observability Platforms.\n\n**Culture and Team:**\nMezmo fosters a culture driven by innovation and a commitment to client success. The team is described as passionate thinkers eager to fundamentally improve how organizations handle observability challenges. Their cloud-native approach, combined with advanced technologies like Kubernetes, allows Mezmo to offer scalable solutions that adapt to enterprise needs.\n\n**Conclusion:**\nIn a world overwhelmed by data, Mezmo stands out by granting enterprises the power and flexibility to harness their observability insights. By focusing on reducing log volumes and maximizing data effectiveness, they enable teams to concentrate on building secure, resilient products.\n\nFor more information, visit their official website at [Mezmo](https://www.mezmo.com/).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/8c4886a631df1d968768a270b665f8a0c0b0f7b7.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191535Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=5a6640759d37579055abae88f00091ed33356402d9842461661ebe5fbf8d8073",
    "social_links": [
        "https://twitter.com/mezmo",
        "https://www.crunchbase.com/organization/logdna"
    ],
    "logo_path": "data/logos\\Mezmo_logo.png"
}