{
    "links": "https://www.ycombinator.com/companies/middesk",
    "name": "Middesk",
    "headline": "We make it easier for B2B companies to transact with one another",
    "batch": "W19",
    "description": "Middesk's mission is to enable every business to access the products and services they need to grow and thrive. We believe that if we can make it easy for a business to access financial products, hire new employees, and transact with other businesses, that we increase the odds of success for that business to contribute to its community and the broader economy.\r\n\nOur Identity provides accurate, complete information that financial services companies need to make efficient onboarding decisions. Our Agent product makes it easy for employers to file with the state and federal agencies needed to establish their business across the country. Our customers include Affirm, Brex, Plaid, Mercury, Divvy, Rippling, Gusto, and others.\r\n\nBased in San Francisco, CA, Middesk is backed by Sequoia Capital, Accel Partners, and Y Combinator.",
    "activity_status": "Active",
    "website": "http://www.middesk.com",
    "founded_date": 2019.0,
    "team_size": 85.0,
    "location": "San Francisco",
    "group_partner": "Michael Seibel",
    "group_partner_yc": "https://www.ycombinator.com/people/michael-seibel",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:saas; industry:b2b; location:san-francisco-bay-area",
    "founders": [],
    "status": true,
    "generated_description": "**Company Overview: Middesk**\n\nMiddesk was founded in 2019 as part of Y Combinator's W19 batch and is based in San Francisco, CA. The company operates with a clear mission: \"We make it easier for B2B companies to transact with one another.\" This mission is rooted in the belief that simplifying access to financial products and services not only helps individual businesses thrive but also positively impacts their communities and the broader economy.\n\n**What They Do**\n\nMiddesk specializes in providing identity verification solutions aimed specifically at B2B transactions. Their core products include:\n\n- **Business Verification**: Helps companies verify their commercial customers for Know Your Business (KYB) compliance.\n- **Credit Assessment**: Streamlines the process of evaluating borrowers for credit decision-making.\n- **Entity Management**: Facilitates payroll tax account registrations and other business compliance needs.\n\nSome of their notable clients include Affirm, Brex, Plaid, Mercury, Divvy, Rippling, and Gusto, demonstrating the trust that the fintech community places in their offerings.\n\n**Team and Backers**\n\nMiddesk boasts a dedicated team of around 85 employees and is supported by prominent investors, including Sequoia Capital, Accel Partners, and Y Combinator. Michael Seibel serves as their Group Partner, bringing significant experience from the startup ecosystem.\n\n**Industry Focus**\n\nMiddesk positions itself at the intersection of fintech, SaaS, and B2B solutions. Their products cater to various sectors such as banking, lending, payments, and fintech, making them a versatile choice for companies seeking reliable identity verification and compliance solutions.\n\n**The User Experience**\n\nMiddesk emphasizes user-friendly interfaces and APIs, making their technology easy to integrate. They provide a seamless onboarding experience that accelerates processes for businesses looking to verify identities and manage their customer data efficiently.\n\n**Final Thoughts**\n\nIn a world where business dealings are increasingly digital and compliance is non-negotiable, Middesk stands out as a vital resource for companies looking to streamline identity verification and enhance trust in their B2B transactions. By making data more accessible and usable, they're not just simplifying processes—they're contributing to a more connected and compliant business landscape.\n\nIf you want to explore Middesk further, check out their website at [Middesk.com](http://www.middesk.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/909a9c0374b90f1faa3ae3baeddc60b2553c5eef.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191536Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=8d9e1ccc613cac1ac4ad73b88897c89abd00e6de1a244e8bb53fa7f8eb725801",
    "social_links": [
        "https://www.linkedin.com/company/middesk/",
        "https://twitter.com/MiddeskHQ",
        "https://www.crunchbase.com/organization/middesk",
        "https://github.com/middesk"
    ],
    "logo_path": "data/logos\\Middesk_logo.png"
}