{
    "links": "https://www.ycombinator.com/companies/miden",
    "name": "Miden",
    "headline": "Card issuer processor and banking stack for businesses in Sub-â\u0080¦",
    "batch": "W24",
    "description": "Miden is building a modern infrastructure that facilitates the launch of card programs and various financial products for businesses in Sub-Sahran Africa. Just by reducing integration time, card fraud, improving stability, and being customer focused we quickly rose to top 5 in TPV among card issuing Fintechs in Sub-Saharan Africa within 8 months of launch.\r\n\nWeâ\u0080\u0099re going to build the first comprehensive fintech and banking software stack for Africa, based on modern technology. Weâ\u0080\u0099re starting with a card issuer-processor.",
    "activity_status": "Active",
    "website": "http://www.miden.co",
    "founded_date": 2023.0,
    "team_size": 19.0,
    "location": "Ikeja, Nigeria",
    "group_partner": "Tom Blomfield",
    "group_partner_yc": "https://www.ycombinator.com/people/tom-blomfield",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:payments; industry:b2b; industry:apis",
    "founders": [
        {
            "name": "Okiemute Avworhokai, Founder",
            "description": "Okiemute brings more than a decade of experience in managing financial institutions within commercial banking and the fintech sector. As a former founder of a credit firm focused on student loans, he successfully disbursed over $1.5 million within 18 months. He is now dedicated to developing Miden, aiming to address challenges he has encountered over the past ten years.",
            "linkedin": "https://www.linkedin.com/in/okiemuteavworhokai/"
        },
        {
            "name": "Ini Udoh, Founder",
            "description": "Chief Technology Officer (CTO) at Tyrus Technologies, a B2B fintech specializing in virtual cards and embedded finance solutions. With over 12 years of experience in the banking and fintech sectors, I previously contributed to major financial institutions like First Bank of Nigeria and Heritage Bank, as well as fintech firm Mukuru. I have expertise in developing innovative banking solutions have been crucial in driving Tyrus Technologies' success.",
            "linkedin": "https://linkedin.com/in/iudoh"
        }
    ],
    "status": true,
    "generated_description": "### Company Overview: Miden\n\nMiden is a fast-rising fintech company founded in 2023, headquartered in Ikeja, Nigeria. Within just eight months of launching its card issuer processor and banking stack, Miden quickly climbed into the top five in total payment volume (TPV) among card issuing fintechs in Sub-Saharan Africa. This achievement underscores their mission: to create a modern financial infrastructure that facilitates the launch of card programs and various financial products specifically tailored for businesses in the region.\n\n### Vision and Mission\n\nMiden aims to address the unique banking and payment challenges faced by businesses in Sub-Saharan Africa. Their focus is on reducing integration times, minimizing card fraud, and enhancing system stability while maintaining a customer-centric approach. The long-term vision involves building the first comprehensive fintech and banking software stack for the continent, leveraging the latest technologies to create robust financial solutions.\n\n### Products and Services\n\nMiden offers a diverse range of solutions for businesses, including:\n\n- **Card Issuing**: Businesses can issue physical and virtual cards, with real-time visibility and control over organizational spending.\n- **Banking as a Service (BaaS)**: This service allows companies to embed banking functionalities into their existing applications or workflows seamlessly.\n- **Wallet as a Service**: A solution for managing digital wallets effectively.\n- **Bill Payments**: Simplifying and automating payments for services and invoices.\n- **Expense Management**: Tools for tracking and managing company expenditures through virtual corporate cards.\n  \nTheir current performance showcases:\n- **0K+ cards issued.**\n- **0% system downtime.**\n- **0+ countries served.**\n- **0% customer retention.**\n\n### Team and Notable Backing\n\nThe company boasts a team of 19 individuals, guided by Tom Blomfield as a group partner—a prominent figure in the fintech space. Furthermore, Miden is a part of the prestigious Y Combinator Batch W24, which adds significant credibility and support.\n\n### Commitment to Security and Compliance\n\nMiden places a strong emphasis on security with bank-grade measures in place, including compliance with PCI-DSS standards. They have established strict compliance procedures to ensure legitimacy in business transactions. Their aim is to provide a secure and reliable platform for users dealing with real money.\n\n### Conclusion\n\nMiden is positioning itself as a key player in the African fintech landscape, aimed at transforming how businesses interact with banking and payments. With innovative solutions, a robust infrastructure, and a focus on security, they are well-equipped to tackle the nuanced financial challenges in Sub-Saharan Africa.\n\nFor more information, visit [Miden's website](http://www.miden.co).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/77ce19abbcdba9bfc231988cf7c1ab75749692c8.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191536Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=4212bb4b26e4599e463902a587e826435ec8cbb6275cb025d11e3ab78cbfe17b",
    "social_links": [
        "https://www.linkedin.com/company/tyrus-technologies/",
        "https://twitter.com/TyrusTechHQ",
        "https://www.facebook.com/TyrusTechnologies?mibextid=LQQJ4d",
        "https://github.com/Tyrus-Technologies"
    ],
    "logo_path": "data/logos\\Miden_logo.png"
}