{
    "links": "https://www.ycombinator.com/companies/midship",
    "name": "Midship",
    "headline": "Extract, search and analyze data in your documents",
    "batch": "S24",
    "description": "We extract and organize structured data from documents, such as PDFs, excel sheets for non-engineers. A CRE firm uses us to pull data from several deals to populate their underwriting spreadsheets in 5 minutes, instead of hours.",
    "activity_status": "Active",
    "website": "https://midship.ai/",
    "founded_date": 2024.0,
    "team_size": 3.0,
    "location": "San Francisco",
    "group_partner": "Diana Hu",
    "group_partner_yc": "https://www.ycombinator.com/people/diana-hu",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:documents; industry:b2b; industry:ai; industry:ai-assistant; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Kieran Taylor, Co-Founder",
            "description": "Co-founder of Midship - Extract, search and analyze data in your documents.\n\nSpent 7 years building data platforms at Instacart, Amazon & Deloitte. Experienced every pain point possible working with data-focused teams.\n\nFrom the UK, avid traveller, mediocre tennis player, competitive vimmer.",
            "linkedin": "https://www.linkedin.com/in/kieranctaylor"
        },
        {
            "name": "Aahel Iyer, Founder",
            "description": "Former indie rock guitarist turned product designer. Shaped user experiences at Lyft, Faire, and Dashworks, specializing in financial products, and gen AI. Moved from India to the US at 18. Now using diverse insights to build user centric products.",
            "linkedin": "https://www.linkedin.com/in/aahel-iyer-221999120/"
        },
        {
            "name": "Max Maio, Co-Founder",
            "description": "Shipped software loaning billions at PayPal; built an AI-powered app from zero to one at Dashworks. Snowboarder, surfer, and espresso machine fixer.",
            "linkedin": "https://www.linkedin.com/in/max-maio-897514195/"
        }
    ],
    "status": true,
    "generated_description": "Midship is a fresh player in the tech scene, founded in 2024 and hailing from the bustling tech hub of San Francisco. It's part of Y Combinator’s Batch S24, which isn’t just a badge of honor; it’s a seal of validation that this startup is onto something valuable.\n\nThe mission here is straightforward: Midship aims to extract, search, and analyze data within documents, mainly targeting the often cumbersome process of handling financial audits. Think about it. Traditionally, extracting relevant data from piles of PDFs and Excel documents would eat up hours of an auditor's time. Midship is flipping that script. In just five minutes, they can pull critical data, allowing auditors to focus on the insights rather than the grunt work. \n\nTheir technology acts as an AI-augmented assistant, turning the laborious audit process into something far more efficient—a sort of GPS for auditors navigating through data. It organizes and structures documents, runs key audit tests, and automatically generates ready-to-submit Excel work papers, all while ensuring every AI decision is traceable back to relevant evidence. Plus, human oversight remains a core part of their process, ensuring that nothing gets rubber-stamped without thorough review.\n\nWith a lean team of three and a dedicated Group Partner in Diana Hu, Midship is positioned to make a significant impact on how audit firms work, promising to cut traditional audit times by 50% by 2026. And did I mention they’re offering a demo? If you're curious about leveraging AI to optimize audit workflows, there’s a clear pathway to see it in action.\n\nVisit [Midship's website](https://midship.ai/) to explore their offerings, secure a demo, or dive deeper into their plans for revolutionizing the auditing landscape. It might just be the audit assistant you didn’t know you needed.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/831e6b6cf204a619317da016d60f29358aa74b60.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191536Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=7c2b5c6ac6da29393864102c83303910163febffce895c72d3e479e11840d0f3",
    "social_links": [
        "https://www.linkedin.com/company/midshipinc/"
    ],
    "logo_path": "data/logos\\Midship_logo.png"
}