{
    "links": "https://www.ycombinator.com/companies/mighty-buildings",
    "name": "Mighty Buildings",
    "headline": "3D printing beautiful, high-quality, and sustainable homes.",
    "batch": "W18",
    "description": "Mighty Buildings is an innovative construction technology company based in Oakland, CA creating beautiful, sustainable, and high-quality homes using 3d-printing, robotics, and automation. Their mission is to have a positive impact on the environment, local communities, and the housing crisis through their sustainable approach.\r\n\nMighty Buildings' technology has the potential to unlock the needed productivity for large scale construction alongside the opportunity for reduced emissions, leading to a more sustainable product and future. Mighty Buildings was founded by a team of physicists and robotics engineers with extensive experience solving hard R&D problems and building successful engineering firms. They started by inventing a new material that is a 3D printing tech that enabled printing of an entire building, not just walls, in a single cycle. Unlike concrete, Mighty Buildings’ material is lighter, can be uniquely treated (trimmed and cut) by robotic arms, and features high thermal insulation properties. This allows them to produce prefab housing with up to 80% of operations automated.\r\n\nMighty Buildings has a near-zero waste production process, preventing 1,100 - 2,000 kg of CO2 emission per 3D-printed home. They are committed to achieving Net-Zero by 2028 - making the company 22 years ahead of the construction industry.\r\n\nThe company is certified under California's Factory Built Housing program to build units using 3D-printing, but they are also the first company to achieve certification under the UL 3401 standard for evaluating building structures and assemblies.",
    "activity_status": "Active",
    "website": "https://www.mightybuildings.com",
    "founded_date": 2017.0,
    "team_size": 200.0,
    "location": "Oakland, CA",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:robotics; industry:construction; industry:3d-printing; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Slava Solonitsyn",
            "description": "Slava is an accomplished investor, and entrepreneur (top YC company Mighty Buildings - W18, Socap.ai - W23). At Mighty Buildings, he commercialized the 3D printing tech that enabled the printing of an entire building, not just walls, in a single cycle, to address the dearth of affordable housing in Silicon Valley, California, and the rest of the world. Now he is focused on helping founders & investors to grow their network and fundraise better with a new YC company Socap.ai",
            "linkedin": "https://www.linkedin.com/in/solonitsyn/"
        },
        {
            "name": "Dmitry Starodubtsev",
            "description": "Dmitry Starodubtsev is a serial entrepreneur, inventor, and technologist that has developed over 50 new products including 20 US and international patents. Dmitry is also CTO and co-founder of Mighty Buildings, a construction technology company creating beautiful, affordable, and sustainable homes using 3D printing and robotic automation. Mighty Buildings is backed by reputable VCs such as Khosla Ventures, Bold Capital, and Y Combinator.",
            "linkedin": "https://www.linkedin.com/in/dimastar/"
        }
    ],
    "status": true,
    "generated_description": "Mighty Buildings is a trailblazing construction tech company, based in Oakland, CA, that’s shaking up the housing industry using 3D printing and automation. Founded in 2017, as part of Y Combinator's W18 batch, their mission is straightforward: create beautiful, high-quality homes while having a positive impact on the environment and addressing the ongoing housing crisis. \n\nThe genius behind Mighty Buildings comes from a diverse team of physicists and robotics engineers who tackled tough R&D hurdles before venturing into construction. They developed an innovative material that allows for the 3D printing of entire buildings in a single go—a game-changer when compared to traditional concrete approaches. This material is not just lightweight; it can be finely manipulated by robotic arms and boasts excellent thermal properties, making it ideal for prefab housing.\n\nTheir production process is strikingly efficient, generating near-zero waste and preventing up to 2,000 kg of CO2 emissions for each home they build. Mighty Buildings is committed to achieving Net-Zero by 2028, which puts them way ahead of their competitors in the construction sector.\n\nCurrently, they’re certified under California's Factory Built Housing program and notably, they were the first to achieve UL 3401 certification for their building structures. With approximately 200 employees and their Group Partner Nan, they are making waves in the fields of robotics, construction, and 3D printing.\n\nMighty Buildings has rolled out their \"Mighty Homes\" for sale, particularly in Desert Hot Springs, CA. Their latest offering includes the Mighty Kit System™, which is a complete wall system designed to accelerate building speed and enhance resilience against external forces like fire, wind, and earthquakes.\n\nBeyond just building, they’re actively involved in shaping a sustainable future. It’s evident they believe in fusion—where robust design, modern tech, and environmental responsibility coexist, providing better homes for people and a cleaner planet.\n\nIf you’d like to explore further, you can visit their website at [Mighty Buildings](https://www.mightybuildings.com) and stay updated through their social media channels. They're definitely a company to keep an eye on as they push the boundaries of construction technology.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/ba885690e8638b0cd18b00feb9253647bb3994ca.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191537Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=3a6a2a47345893ecc4c90982d4b11615ea02267d18f663d609005fc1c8e9a4da",
    "social_links": [
        "https://www.linkedin.com/company/mightybuildings/",
        "https://twitter.com/mightybuildings",
        "https://www.facebook.com/mightybuildings/",
        "https://www.crunchbase.com/organization/mighty-buildings"
    ],
    "logo_path": "data/logos\\Mighty_Buildings_logo.png"
}