{
    "links": "https://www.ycombinator.com/companies/mindely",
    "name": "Mindely",
    "headline": "The first GenAI interviewer for skills assessment interviews",
    "batch": "S24",
    "description": "Mindely is the first AI interviewer designed for skills assessment interviews. \r\n\nHiring for high volume, high turnover roles (e.g., consultants, analysts, sales & customer representatives) is time-consuming, inconsistent, and prone to unconscious bias. Managers spend valuable time on lengthy skill-based interviews instead of focusing on building candidate relationships or on driving company revenue. \r\n\nTraditional AI interviewers don’t solve these issues – their rigid Q&A formats and one-size-fits-all approach can’t handle complex skill assessments. Mindely changes the game as the first AI interviewer built for in-depth case study, technical and role-play interviews. It: \r\n- Simulates human interaction with real-time dialogue \r\n- Challenges candidates with dynamic, adaptive responses \r\n- Eliminates interviewer bias to create a fair, inclusive hiring process \r\n- Works 24/7 to free up senior staff and widen talent pool \r\n\nWith Mindely, companies can rapidly customize and deploy human interviews at AI scale to test specific on-the-job skills.",
    "activity_status": "Active",
    "website": "http://www.mindely.ai",
    "founded_date": 2024.0,
    "team_size": 4.0,
    "location": "San Francisco",
    "group_partner": "Nicolas Dessaigne",
    "group_partner_yc": "https://www.ycombinator.com/people/nicolas-dessaigne",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:generative-ai; industry:saas; industry:recruiting; industry:hr-tech; industry:talent-acquisition; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Joseph Thalinjan, Founder/CEO",
            "description": "Joseph is the Co-Founder & CEO of Mindely.\nBefore, he was a consultant at McKinsey & Company for 3 years, focusing on improving the global strategy of software and tech companies.\nHe holds a Master of Science from CentraleSupelec Engineering School and a Master in Management from ESCP Europe Business School.",
            "linkedin": "https://www.linkedin.com/in/joseph-thalinjan"
        },
        {
            "name": "Alix Maurin, Founder/COO",
            "description": "Alix is the Co-Founder and COO of Mindely. She was a consultant at McKinsey & Company for three years, focusing on improving the global strategy of digital companies. Before joining McKinsey, Alix worked at Uber EMEA and interned at Amazon. She holds a Master’s in Management from ESSEC Business School.",
            "linkedin": "https://www.linkedin.com/in/alix-maurin-850610148/"
        }
    ],
    "status": true,
    "generated_description": "**Mindely: Revolutionizing Skill Assessments with GenAI**\n\nFounded in 2024 and based in San Francisco, Mindely is breaking new ground in the hiring process by being the first generative AI interviewer specifically designed for skills assessment interviews. Part of the coveted Y Combinator Batch S24, Mindely aims to tackle the exhaustive challenges that come with hiring for high-volume, high-turnover roles—like consultants, analysts, and customer representatives.\n\n**The Problem with Traditional Hiring**  \nHiring can be a cumbersome process filled with bias and inefficiency. Traditional AI interviewers often lean on rigid Q&A formats that don't accurately gauge a candidate’s capabilities. Mindely addresses these issues head-on. \n\n- **Dynamic Interactions**: Unlike standard interviewers, Mindely simulates human-like conversations with real-time dialogue, enabling a more organic and adaptive assessment process.\n- **Personalized Assessments**: The AI can customize interviews to test specific skills relevant to the job at hand, whether that involves case studies, technical prowess, or role-playing exercises.\n- **Eliminating Bias**: By providing consistent evaluations and removing human biases, Mindely ensures a fair and inclusive hiring process.\n- **24/7 Availability**: Managers can free up valuable time, conducting thousands of interviews with ease—essentially extending the reach to a broader talent pool.\n\n**How It Works**  \nMindely's robust platform allows companies to craft tailored interviews tailored at scale. They leverage technology that not only challenges candidates but also provides feedback and insights grounded in over 200 fine-tuned metrics. This empowers businesses to make informed hiring decisions efficiently.\n\nThe potential formats are:\n- **Case Study Interviews**: For assessing problem-solving and communication skills.\n- **Technical Interviews**: To evaluate quantitative reasoning.\n- **Role-Play Interviews**: Focusing on client interaction and problem-solving abilities.\n- **Expert Interviews**: Drawing from specialized knowledge.\n\n**Equipped for the Future**  \nMindely is not just about replacing human interaction; it enhances it by ensuring that the hiring managers can spend their time where it matters most—building relationships with the best candidates. This is particularly crucial in the fast-paced hiring environments that characterize modern workforce needs.\n\n**Team and Vision**  \nWith a lean team of four and backed by notable figures in the startup ecosystem like Nicolas Dessaigne as a group partner, Mindely is positioning itself as the go-to solution for companies that aim to modernize their hiring processes with generative AI technology.\n\n**Connect and Engage**  \nExplore Mindely’s offerings or book a demo through their [website](http://www.mindely.ai). As they pave a new route in HR tech, the potential for smarter, fairest hiring is limitless. \n\n**In Summary**, if you're tired of traditional hiring's inefficiencies and the biases that come with it, Mindely represents a significant leap forward—a smarter, more human-like way to assess skills that meets both employers' and candidates' needs alike.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/0c4edcb85a852af6aabbbab251e4eba58955c21b.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191537Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=ab3b9655c6c5761fabb9ad62e9785cd6de773215a2de37f35cd8f636be7cc2fd",
    "social_links": [
        "https://www.linkedin.com/company/mindelyai/"
    ],
    "logo_path": "data/logos\\Mindely_logo.png"
}