{
    "links": "https://www.ycombinator.com/companies/mindset-health",
    "name": "Mindset Health",
    "headline": "Hypnosis-based digital therapeutics for chronic conditions like IBSâ\u0080¦",
    "batch": "S19",
    "description": "Mindset Health is on a mission to empower a billion people to manage their health by unlocking the power of their mind. We're building a digitally native â\u0080\u0098pharmaâ\u0080\u0099 company that allows us to quickly turn hypnotherapy research into highly effective, consumer-friendly mobile apps.\r\n\nMindset Health makes hypnotherapy accessible for people suffering from irritable bowel syndrome, menopause, chronic pain, depression, and more - who no longer have to pay thousands of dollars and wait months for in-person support. By digitizing a previously stigmatized therapeutic tool, we make it accessible and help it achieve the same efficient scalability, consistency, instant availability, and ease-of-use of drugs but with the feedback loop of an app.",
    "activity_status": "Active",
    "website": "https://www.mindsethealth.com",
    "founded_date": 2018.0,
    "team_size": 30.0,
    "location": "Melbourne, Australia",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:mental-health-tech; industry:sleep-tech; industry:consumer-health-services",
    "founders": [
        {
            "name": "Alex Naoumidis, Founder",
            "description": "Co-Founder of Mindset Health, helping people manage chronic health issues with app-based hypnotherapy. Y Combinator & Startmate alum.",
            "linkedin": "https://www.linkedin.com/in/alexnaoumidis/"
        },
        {
            "name": "Chris Naoumidis, Founder",
            "description": null,
            "linkedin": "https://www.linkedin.com/in/chris-naoumidis-0589b7122/"
        }
    ],
    "status": true,
    "generated_description": "**Mindset Health: Transforming Wellness Through Hypnotherapy**\n\nFounded in 2018 and hailing from Melbourne, Australia, Mindset Health is a pioneering force in the realm of digital therapeutics. This company stands out in the health tech landscape with a singular mission: to empower a billion people to manage their health by unlocking the full potential of the mind. Think of them as a ‘digitally native pharma’ company that’s turning traditional hypnotherapy research into user-friendly mobile applications.\n\n**What They Do**\n\nMindset Health leverages the power of hypnotherapy to provide effective, accessible, and evidence-based solutions for chronic ailments like Irritable Bowel Syndrome (IBS), menopause, chronic pain, and even conditions such as depression. This isn’t just about convenience; it’s about making a once-stigmatized therapeutic approach available to anyone who needs it, without the hefty price tag and long waits associated with in-person therapy. Their apps focus on treatment where it’s most needed, delivering tailored support right to users’ phones.\n\n### Core Products\n- **Nerva**: Specifically designed for IBS management, using hypnotherapy to help users self-regulate their symptoms.\n- **Claria**: Aimed at mental health, helping manage anxiety and stress through structured programs.\n- **Relio**: Focusing on chronic back pain with science-backed digital therapy.\n- **Evia**: Supporting women through menopause with educational resources and hypnotherapy.\n- **Finito**: A program to assist with smoking cessation, helping users quit with structured hypnotherapy techniques.\n\n### The Team and Achievements\n\nMindset Health is currently powered by a dynamic team of around 30 individuals and was selected for the Y Combinator Batch S19, which showcases their potential from the outset. They are making waves, backed by reputable experts in the field—Dr. Michael Yapko, Dr. Simone Peters, and Dr. Gary Elkins among them—who guide their research and methodology.\n\nTo date, they boast over 201,120 members and partnerships with over 6,000 healthcare practitioners. This success is a testament to the demand for accessible health solutions and the effectiveness of their unique offerings.\n\n### Why It Matters\n\nIn a world grappling with the rising costs and accessibility issues in healthcare, Mindset Health stands out by democratizing treatment. They not only expand access but do so in a way that maintains the rigor and efficacy of traditional medical practices through technology. Their focus on mental wellness, combined with the accessibility of a mobile app, reshapes how individuals can approach their health.\n\nFor those interested in exploring these innovations, the website [Mindset Health](https://www.mindsethealth.com) is a goldmine of information and resources.\n\nWhether you’re looking to manage a chronic condition or simply improve your mental health, Mindset Health might just be the missing piece you’ve been searching for.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/181cc52fc8d27fd6789ca4257fcb564521ba05c5.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191538Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=3b16160a43682fe62e5e446e9efabd34a0b53cb6a3ec232fe3cb20f3e9ad77e7",
    "social_links": [
        "https://www.linkedin.com/company/mindsethealth",
        "https://twitter.com/mindsethealth",
        "https://www.facebook.com/mindsethealthapp"
    ],
    "logo_path": "data/logos\\Mindset_Health_logo.png"
}