{
    "links": "https://www.ycombinator.com/companies/mindportal",
    "name": "MindPortal",
    "headline": "Thought-to-Language AI Models",
    "batch": "W21",
    "description": "MindPortal is a pioneering AI research company advancing human-AI interaction by enabling people to communicate with computers and AI assistants purely through thought. As an AI company, we focus exclusively on model development rather than hardware. Our models are designed to be general-purpose, adaptable across a wide range of applications. Our flagship development, MindSpeech, is the first supervised AI model to translate imagined speech into text, enabling direct thought-to-language communication. MindSpeech has earned endorsements from leading experts, including Neuralink's former technical strategy head and DARPA’s N3 program lead scientist. Our thought-to-language AI models have the potential for transformative applications in fields such as healthcare, education, and VR/AR and our work has been featured in major publications such as Forbes, The Times, The Telegraph, and Business Insider. MindPortal has over 11 patents filed in the field and is backed by prominent investors such as Y Combinator.",
    "activity_status": "Active",
    "website": "https://www.mindportal.com",
    "founded_date": 2019.0,
    "team_size": 10.0,
    "location": "London, United Kingdom",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:artificial-intelligence; industry:neurotechnology; industry:ai",
    "founders": [
        {
            "name": "Ekram Alam, Founder",
            "description": "Co-founder of MindPortal",
            "linkedin": "https://www.linkedin.com/in/ekram-alam-9b7869179/"
        },
        {
            "name": "Jack Baber, Founder",
            "description": "Co-founder of MindPortal",
            "linkedin": "https://www.linkedin.com/in/jack-baber-489960168/"
        }
    ],
    "status": true,
    "generated_description": "### MindPortal: Pioneering Thought-to-Language AI Models\n\nFounded in 2019 and rooted in the innovative environment of Y Combinator (Batch W21), **MindPortal** is an AI research company based in London, UK. The company's mission is clear-cut: to create advanced Thought-to-Language AI models that facilitate seamless communication between humans and machines.\n\nAt the heart of MindPortal's innovations is **MindSpeech**, its flagship technology. This model is particularly groundbreaking as it translates imagined speech straight into text, allowing for direct communication rooted in thought. It's like moving the conversation from your mind to the computer without ever having to speak a word. This capability is not just theoretical; it's been greeted with enthusiasm from industry experts, including the former technical strategy head at Neuralink and a leading scientist from DARPA.\n\nMindPortal isn't just about creating cool tech; it's about changing the game across various sectors such as healthcare, education, and virtual/augmented reality (VR/AR). With over 11 patents filed and recognition in major publications like Forbes and Business Insider, the company is building a formidable presence in the realm of AI and neurotechnology.\n\nWith a compact team of 10 employees, MindPortal leverages its deep research focus while being strategically backed by notable investors like Y Combinator. Their work is tagged under key areas including artificial intelligence, neurotechnology, and AI, reflecting their commitment to pushing boundaries in these fields. \n\nAs they continue to develop their models, MindPortal stands at the intersection of technology and human experience, ready to lead us into a future where thinking and communicating with AI feels as natural as talking to someone next to you. For more information, you can check out their website at [MindPortal](https://www.mindportal.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/c73987cab0424a48b7cb357baceee7c5a567b3d0.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191538Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=a162722904ba700922638e3aa5ecd237112652f3c6ab2927a90cfe03086883d7",
    "social_links": [
        "https://www.linkedin.com/company/37420648/"
    ],
    "logo_path": "data/logos\\MindPortal_logo.png"
}