{
    "links": "https://www.ycombinator.com/companies/miso",
    "name": "Miso",
    "headline": "We make booking services as easy as buying products online.",
    "batch": "S16",
    "description": "Miso makes booking services as easy as buying products online. We offer over 70 different services ranging from cleaning to moving to interior remodeling, repair and installation. We have fulfilled more than 4 million bookings and operate at over a $140 million GMV run rate.",
    "activity_status": "Active",
    "website": "http://miso.kr",
    "founded_date": 2016.0,
    "team_size": 60.0,
    "location": "South Korea",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:marketplace",
    "founders": [
        {
            "name": "Victor Ching, Founder/CEO",
            "description": "Founder of Miso since 2016. Miso is the app for booking home services in South Korea. Prior to Miso, I ran Product & Engineering for Delivery Hero in Korea, which is one of Korea's largest food delivery apps serving 10's of millions of orders every month.",
            "linkedin": "http://www.linkedin.com/in/victorching"
        }
    ],
    "status": true,
    "generated_description": "Miso is a South Korean startup that aims to simplify the booking of home services, making the process as easy as purchasing any product online. Founded in 2016, Miso initially focused on this mission and has since expanded to offer over 70 different services, including cleaning, moving, interior remodeling, and installation. With a track record of more than 4 million bookings and a gross merchandise volume (GMV) run rate exceeding $140 million, it's clear they have tapped into a significant market need.\n\nMiso is a proud participant in Y Combinator's S16 batch, which speaks volumes about its potential and innovative approach. The company operates with a team of 60 dedicated employees and is strategically partnered with nan.\n\nThe company prides itself on its user-friendly platform that allows customers to book services effortlessly. Whether it's household cleaning or office maintenance, Miso ensures clients receive quality service at reasonable rates. They've even branched out into providing Internet subscriptions and appliance rentals, reflecting a broad spectrum of services aimed at enhancing everyday life.\n\nAccording to customer feedback, about 9 out of 10 users express satisfaction with Miso’s services. The testimonials reveal a recurring theme: Miso not only alleviates the burden of daily chores but also gives clients the freedom to focus on what they enjoy most. They are often praised for their effective communication and ease of use, which is important in fostering trust within the service industry.\n\nThe platform allows users to compare quotes from different service providers, helping them make informed decisions without the hassle of manual research. This functionality makes the booking process transparent and straightforward.\n\nNow, you can access Miso’s services through their app, available on both iOS and Android platforms, further enhancing their accessibility. This move aligns with modern consumer behavior—people want services at their fingertips, and Miso delivers.\n\nIn summary, Miso is not just another name in the marketplace; it represents a growing trend in the service industry where ease of access meets high-quality service delivery, making the everyday lives of its users not just more convenient but also more enjoyable. For more information about their wide range of services, you can visit their official website [here](http://miso.kr).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/d2d37ab57793e7842e61647fff42ac3b22e2158e.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191542Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=1567dd04088e78e98e30d2b243b25e664c67816e470802e06f875cc40471e056",
    "social_links": [
        "https://www.crunchbase.com/organization/miso-2"
    ],
    "logo_path": "data/logos\\Miso_logo.png"
}