{
    "links": "https://www.ycombinator.com/companies/misprint",
    "name": "Misprint",
    "headline": "Misprint is a data-driven marketplace for graded collectibles",
    "batch": "W25",
    "description": "Misprint is an all-in-one marketplace that solves the biggest pain point in the collectibles world: opaque pricing. Collectors, investors, and hobbyists currently rely on scattered data from auction houses, online forums, and reseller platforms, making it difficult to know the true value of their items. Misprint streamlines the process by combining accurate pricing analytics with a seamless buy/sell marketplace, making it easier than ever to understand and monetize collectible assets.\r\n\nExisting marketplaces lack robust, real-time analytics because accurate valuations require deep expertise in both the collectibles domain and advanced pricing algorithms. Misprint’s unique blend of insider trading card knowledge and machine learning allows us to fill this gap.\r\n\nBuilding these pricing models requires extensive data infrastructure, deep domain expertise, and cutting-edge ML. Recent surges in the trading card market show that collectors crave transparent valuations.\r\n\nThe global collectibles market is worth tens of billions of dollars. Eva has experienced the scale of this industry firsthand, generating $500k ARR within three months of taking her Pokemon card-selling side hustle full-time. With additional segments like sports cards, comics, and emerging collectible categories, the growth runway is immense.\r\n\nCo-founders Eva and Jon have been best friends since Exeter, combining finance expertise, a passion for collectibles, and mathematical rigor. By merging Goldman Sachs-level financial analytics with top-tier mathematical talent, Misprint is uniquely positioned to become the go-to platform for fair, transparent pricing in the collectibles space.",
    "activity_status": "Active",
    "website": "https://www.misprint.com",
    "founded_date": 2025.0,
    "team_size": 2.0,
    "location": null,
    "group_partner": "Aaron Epstein",
    "group_partner_yc": "https://www.ycombinator.com/people/aaron-epstein",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:marketplace; industry:consumer; industry:e-commerce",
    "founders": [
        {
            "name": "Eva Herget, Founder",
            "description": "Eva is the Co-Founder and CEO of Misprint.\n\nShe left her role as an Equity Analyst at Goldman Sachs to follow her lifelong passion for trading cards, reaching over $500k ARR within three months just by selling Pokemon cards. An alum of the University of Chicago, she studied Economics and East Asian Languages & Civilizations. Eva has published articles in PSA Pop Culture Magazine and TCGplayer Infinite, and also hosts a trading card-focused YouTube channel, Eva’s Binder.",
            "linkedin": "https://www.linkedin.com/in/eva-herget/"
        },
        {
            "name": "Jonathan Jenkins, Founder",
            "description": "Cofounder/CTO, Misprint (YC W25)\n\nJon, a mathematician turned card enthusiast, holds a BS and MS in Mathematics from Carnegie Mellon. While pursuing his PhD, he pivoted to theoretical machine learning, publishing numerous papers and studying high dimensional machine learning problems. Jon left his PhD program to join YC and focus on Misprint, where he applies his technical expertise to build cutting-edge pricing models and analytics, driving innovation in the graded card marketplace.",
            "linkedin": "https://www.linkedin.com/in/jtjenkins18/"
        }
    ],
    "status": true,
    "generated_description": "**Company Overview: Misprint**\n\nFounded in 2025 and part of Y Combinator's W25 batch, Misprint is a forward-thinking marketplace focused on delivering transparent pricing for graded collectibles, particularly in the trading card sector. Co-founders Eva and Jon, long-time friends with backgrounds in finance and mathematics, recognized a significant gap in the collectibles market: the lack of reliable and accessible price information. \n\n**The Mission**\n\nAt its core, Misprint aims to demystify the pricing of collectibles. Collectors and investors have traditionally relied on fragmented data—auction results, online forums, and inconsistent reseller platforms—that often leads to uncertainty about the true value of their items. Misprint consolidates this data into a seamless buying and selling experience, underpinned by robust pricing analytics and machine learning models.\n\n**The Problem and the Solution**\n\nCurrent marketplaces often lack the real-time analytics collectors need, primarily due to the complex nature of valuation that's both domain-specific and algorithmically driven. Misprint's solution combines the insider knowledge of trading cards with sophisticated machine learning methods to offer real-time, transparent pricing. As we’ve seen with the recent trading card market surges, collectors have a strong desire for transparent and accurate valuations.\n\n**Market Potential**\n\nThe collectibles market is massive, estimated to be worth tens of billions. Eva's experience speaks to this potential: she generated $500k in annual recurring revenue (ARR) by scaling her Pokémon card-selling side hustle. With Misprint's focus on other segments like sports cards and comics, the pathway to growth appears not only promising but exciting.\n\n**Team and Expertise**\n\nDespite its small size—currently just two core team members—Misprint leverages exceptional talent with backgrounds at Goldman Sachs and advanced mathematical expertise. Aaron Epstein, serving as Group Partner, adds further credibility and direction to the team.\n\n**Key Features**\n\n- **Marketplace for Graded Cards**: A dedicated platform for buying and selling graded collectibles that adjusts offers based on community-driven pricing.\n- **Data-Driven Insights**: Utilizing machine learning to provide accurate pricing guidance.\n- **Broad Range of Collectibles**: Currently focused on Pokémon cards, with plans to expand into more collectible categories, hinting at a diverse product offering.\n\nIn sum, Misprint is tackling a common pain point for collectors: pricing transparency. With its innovative approach and strong market potential, it promises to reshape how enthusiast investors engage with their treasured collectibles. For more, check out their site [here](https://www.misprint.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/ca75fc56cdf1a107bf557cebcb2be497772001d7.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191542Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=5557cdc070247495bf2b78333d40a51bc70a05096d56a4f522994a6d3208f99e",
    "social_links": [
        "https://x.com/MisprintInc"
    ],
    "logo_path": "data/logos\\Misprint_logo.png"
}