{
    "links": "https://www.ycombinator.com/companies/mobot",
    "name": "Mobot",
    "headline": "Mobot is a QA-as-a-service platform using actual mechanical robots",
    "batch": "W19",
    "description": "Mobot (YC W19) is a QA-as-a-service platform using actual mechanical robots to automate testing of repetitive functions on real mobile devices. Mobot's human-supervised robots make it possible to automate mobile app tests that emulators, virtual devices, and existing frameworks can't. This approach eliminates thousands of hours of manual testing, increases testing efficiency and physical device coverage, and captures more bugs in-app before app store launches than software can do alone.",
    "activity_status": "Active",
    "website": "https://www.mobot.io",
    "founded_date": 2018.0,
    "team_size": 40.0,
    "location": "New York",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:developer-tools; industry:hardware; industry:b2b; location:new-york",
    "founders": [],
    "status": true,
    "generated_description": "**Mobot: Revolutionizing Mobile App Quality Assurance**\n\nFounded in 2018 and part of Y Combinator Batch W19, Mobot is a New York-based startup with a mission: to redefine quality assurance (QA) in mobile app development. They leverage real mechanical robots to automate testing processes, tackling the repetitive tasks that traditionally bog developers down. \n\n**What Does Mobot Do?**\nAt its core, Mobot is a QA-as-a-service platform. While many QA solutions rely on emulators and virtual devices, Mobot’s approach hinges on actual physical devices being tested by human-supervised robots. This innovative methodology dramatically increases testing efficiency, broadens physical device coverage, and helps find bugs before apps hit the app stores. The result? Freed-up time for developers, improved product reliability, and a boost in user satisfaction.\n\n**The Team and Operations**\nWith a team of about 40, Mobot is steered by a single group partner, Nan. Their diverse talent pool focuses on various aspects of mobile app testing and quality assurance. The emphasis is on blending engineering finesse with cutting-edge AI technology to deliver a seamless user experience.\n\n**Current Offerings**\nMobot has several products designed for different stakeholders in the app ecosystem:\n- **Mobot Managed:** A fully-managed mobile testing service.\n- **Mobot Live:** A self-service platform allowing teams to run their testing.\n- **Mobot Insights:** A tool for monitoring mobile campaign effectiveness.\n\n**Why Choose Mobot?**\nThe advantages Mobot brings to the table are hard to ignore. They claim:\n- Over a 30% increase in QA efficiency for their clients.\n- The ability to automate over 600 test cases weekly.\n- Significant improvements in app store ratings for users who implement their solutions.\n\n**A Word on Future Growth**\nMobot is not just looking at immediate solutions; they're geared towards future-proofing mobile app testing. The juxtaposition of hardware with software in their tests enables them to tackle complex use cases whether it's managing multi-device interactions, assessing Bluetooth features, or optimizing deep-link capabilities.\n\n**Engage with Mobot**\nTheir website, [mobot.io](https://www.mobot.io), provides a wealth of resources, including customer case studies, product offerings, and insights into how their robots operate. If you’re in the mobile app development space and looking to streamline your QA processes, Mobot could quite possibly be the partner you need.\n\nIn the realm of mobile QA, where speed and reliability are paramount, Mobot seems to be paving the way with its innovative, robot-powered solutions. It's worth keeping an eye on what they will achieve next.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/82c63d7e688c9975459b97deef3ac829f325291e.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191544Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=b5cf1be584aa40af85f4a2027792df1216c5ea5e1f0416600b5ce6446b0f5b91",
    "social_links": [
        "https://www.linkedin.com/company/team-mobot",
        "https://twitter.com/teammobot",
        "https://www.facebook.com/MobotQA",
        "https://www.crunchbase.com/organization/team-mobot"
    ],
    "logo_path": "data/logos\\Mobot_logo.png"
}