{
    "links": "https://www.ycombinator.com/companies/modern-health",
    "name": "Modern Health",
    "headline": "A mental health benefits platform for employers.",
    "batch": "W18",
    "description": "Modern Health is the leading mental wellness platform that combines clinically validated assessments, personalized stress management support, an international network of certified behavioral health coaches, and licensed therapists to deliver mental health support across a broad range of individual needs. Modern Health empowers employers to lead the charge in helping their employees be less stressed, more engaged, and happier through evidence-based technology and professional support.  Modern Health has raised over $170M from top investors Battery Ventures, Kleiner Perkins, Founders Fund, and John Doerr and supports over 200 companies globally including Lyft, Pixar, SoFi, Credit Karma, Electronic Arts, Cooley, and Okta.",
    "activity_status": "Active",
    "website": "https://www.modernhealth.com/",
    "founded_date": null,
    "team_size": 375.0,
    "location": "San Francisco",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:mental-health-tech; industry:health-tech; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Alyson Watson, Founder/CEO",
            "description": "Alyson Friedensohn is the founder and CEO of Modern Health, the mental health platform that combines clinically validated assessments, evidence-based digital tools and content, and an international network of certified coaches and licensed therapists available in over 30 languages all within a single app. Founded in 2017, Modern Health serve the needs of 200+ global companies including Pixar, SoFi, Lyft, Nextdoor, EA, Okta, and Rakuten.",
            "linkedin": "https://www.linkedin.com/in/alyson-friedensohn-58317b27/"
        }
    ],
    "status": true,
    "generated_description": "### Modern Health: Revolutionizing Mental Wellness\n\n**What They Do**  \nModern Health is redefining how companies think about mental health by offering a comprehensive benefits platform aimed at improving employee well-being. They blend technology with human touch, providing a suite of services that includes clinically validated assessments and access to certified behavioral health coaches, in addition to licensed therapists. The platform is designed to support various individual needs, enabling organizations to cultivate a happier, more engaged, and ultimately more productive workforce.\n\n**Mission**  \nTheir mission is clear: to empower employers to tackle mental health challenges facing their employees today. By leveraging evidence-based technology and professional support, Modern Health enables companies to become leaders in promoting mental wellness.\n\n**Funding & Reach**  \nFounded in the Y Combinator W18 batch, Modern Health has gained significant traction, raising over $170 million from prestigious investors including Battery Ventures, Kleiner Perkins, and Founders Fund. They cater to over 200 global companies such as Lyft, Pixar, SoFi, and Electronic Arts, demonstrating their extensive market presence.\n\n**Team & Location**  \nBased in San Francisco, Modern Health boasts a robust team of about 375 employees, dedicated to delivering world-class mental health solutions.\n\n**Current Services**  \nModern Health is not just about talk therapy; they offer a range of solutions focusing on mental resilience, operational efficiency, and employee attraction and retention. They cater to employers, consultants, members, providers, and health plans with a customizable approach that truly meets diverse needs. Their unique model promotes a sustainable, inclusive support system, distinguishing them from traditional Employee Assistance Programs (EAPs), which tend to underreach.\n\n**The Impact**  \nBy implementing Modern Health’s platform, businesses can expect higher productivity, reduced burnout, and improved employee morale. The company’s holistic approach to mental wellness sets a new standard in the industry by addressing not just immediate needs, but long-term mental health care.\n\nWhether you're an HR leader, a benefits consultant, or someone in need of personal support, Modern Health opens up a pathway to effective, personalized mental health care. They invite companies to rethink how they support their employees, aiming for a workplace that thrives on mental well-being.\n\n**Website**  \nFor more information, you can visit their [website](https://www.modernhealth.com/).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/eb4e26b8fff0866c7ef28f0fb58faf81cbd1ada2.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191544Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=ec2d7b0ff0118cad568aaae34225d10be2e70e01931e87c7596fb6e022274e1d",
    "social_links": [
        "https://www.linkedin.com/company/modern-health/",
        "https://twitter.com/modernhealthco",
        "https://www.facebook.com/modernhealthco",
        "https://www.crunchbase.com/organization/modern-health",
        "https://github.com/modernhealth"
    ],
    "logo_path": "data/logos\\Modern_Health_logo.png"
}