{
    "links": "https://www.ycombinator.com/companies/modernloop",
    "name": "ModernLoop",
    "headline": "ModernLoop helps teams automate and streamline recruiting operations",
    "batch": "W21",
    "description": "ModernLoop helps every company automate and streamline recruiting operations to deliver the best candidate experience. In 2022, the Department of Labor estimates there is a global talent shortage of 40 million workers, and that number is expected to grow to over 85 million by 2030. In order for companies to win the war for talent, they need to provide a best-in-class candidate experience to recruit top talent, and our product aims at doing just that!\r\n\nOur founders Lydia Han (CEO) and Chris Triolo (CTO) both founded ModernLoop in December of 2020 after they saw the challenges recruiting teams had when it came to coordinating hundreds of interviews across various teams, all while making sure both hiring managers and candidates had the best experience possible. After spending 15+ combined years at companies like Facebook, Slack, Brex and Salesforce, they understood what it took to enable talent teams do their best work, and are building a product to scale alongside them as they grow.\r\n\nWe created ModernLoop to serve companies of all sizes in every industry to help Talent teams interview candidates quicker, easier, and enhance productivity of teams as they continue their search for top talent!",
    "activity_status": "Active",
    "website": "http://modernloop.io",
    "founded_date": 2020.0,
    "team_size": 15.0,
    "location": "San Mateo, CA",
    "group_partner": "Harj Taggar",
    "group_partner_yc": "https://www.ycombinator.com/people/harj-taggar",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:b2b; industry:recruiting; industry:productivity; industry:hr-tech; industry:remote-work; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Lydia Han, Founder",
            "description": "Previously PM Lead at Brex, Senior PM at Slack (shipped Google Calendar and O365 Slack app + led Zoom partnership), PM at Facebook, PM at Salesforce. I particularly like building SaaS products with great user experiences.",
            "linkedin": "https://www.linkedin.com/in/lydiajhan/"
        },
        {
            "name": "Christopher Triolo, Founder",
            "description": "I've been at Facebook building product for the last 8 years, being an Engineering Manager for the last 2. I built the first donation product at Facebook (US Patent number: 10032194) as part of a 2-day hackathon project, ultimately leading to the creation of the Charitable Giving org. For the past 5 years, I led teams that shipped donation products across FB + IG generating over $5B for non profits and personal causes.",
            "linkedin": "https://www.linkedin.com/in/ctriolo/"
        }
    ],
    "status": true,
    "generated_description": "### ModernLoop: Revolutionizing Recruitment Processes\n\n**Overview**  \nModernLoop is a startup on a mission to streamline and automate recruiting operations, offering teams the tools they need to enhance the candidate experience. Founded in December 2020 by Lydia Han (CEO) and Chris Triolo (CTO), the company emerged from a shared frustration with the complexities of scheduling interviews and ensuring a smooth process for both hiring managers and candidates.\n\n**The Challenge**  \nWith a global talent shortage that the Department of Labor estimates could reach 85 million by 2030, companies are in a fierce battle to attract top talent. ModernLoop's product addresses this need by simplifying the recruitment process, thereby allowing firms to present a best-in-class experience that sets them apart from the competition.\n\n**The Solution**  \nModernLoop's platform offers a suite of features designed to automate interview scheduling and improve productivity for talent teams across all types of organizations. By focusing on automating menial tasks, recruiting coordinators can devote more energy to delivering exceptional experiences and securing top candidates. Key features include:\n\n- **Automated Interview Scheduling**: Sync calendars and manage workloads for optimal interviewer selection.\n- **Customizable Candidate Experiences**: Adapt interview panels and cadences to fit each candidate’s profile.\n- **Performance Metrics**: Clear reporting tools help track and improve hiring efficiency.\n\n**Team and Growth**  \nThe growing ModernLoop team includes 15 dedicated employees, backed by Group Partner Harj Taggar as part of the Y Combinator W21 batch. Their product is scalable and designed for companies of all sizes, lending support to the increasing demand for productivity in recruitment.\n\n**Impact**  \nCompanies that adopt ModernLoop report significant improvements in their recruiting operations. Not only does this enhance the candidate experience, but it also allows organizations to manage their interview processes with greater efficiency and less hassle.\n\n**Final Thoughts**  \nIn a landscape where securing the right talent is more crucial than ever, ModernLoop stands out as a vital ally for talent teams. Their commitment to innovation simplifies scheduling and enhances the overall hiring process—because in recruitment, timing and experience matter as much as qualifications. For more information, check out their website: [ModernLoop](http://modernloop.io).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/b9764a36419f3fca4a9268e53bff460e904780b8.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191544Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=c258a57bfc592e499586deefbaa298e4de9f44a99986aa68a097ee974786bf5f",
    "social_links": [
        "https://www.linkedin.com/company/modernloop",
        "https://www.crunchbase.com/organization/modernloop",
        "https://github.com/ModernLoop"
    ],
    "logo_path": "data/logos\\ModernLoop_logo.png"
}