{
    "links": "https://www.ycombinator.com/companies/modus",
    "name": "Modus",
    "headline": "Unlock revenue per employee with AI-powered headcount management",
    "batch": "S24",
    "description": "Modus helps companies hire and retain only the people they need instead of becoming bloated messes. Modus connects your HRIS, ATS, and analyzes extensive data across your organization so leaders can detect, inspect, and correct their workforce plans - without relying on spreadsheets or complex systems. \r\n\nLin experienced these challenges firsthand as a VP BizOps at HashiCorp, scaling from 100 employees to IPO, while Chris and Amar faced similar issues scaling 40+ person teams as a fractional CTO. They’re motivated by the belief that companies should have the least number of employees possible.",
    "activity_status": "Active",
    "website": "https://himodus.com",
    "founded_date": 2024.0,
    "team_size": 3.0,
    "location": null,
    "group_partner": "Garry Tan",
    "group_partner_yc": "https://www.ycombinator.com/people/garry-tan",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:artificial-intelligence; industry:finance; industry:b2b; industry:hr-tech; industry:operations",
    "founders": [
        {
            "name": "Lin Ling, Founder",
            "description": "Lin is Co-founder and CEO of Modus. Before Modus, she was a VP BizOps at HashiCorp and helped scale from 100 to 2500 employees to IPO (rang the bell in NY). \n\nPrior to that, she implemented ERP systems at five Fortune 500 companies as a Deloitte Consultant. The clunky nature of these tools led her to appreciate the flexibility of spreadsheets but also the craft in modern software. \n\nLin received her Bachelor's in Econ, Comp Sci, and Math at NYU Stern.",
            "linkedin": "https://www.linkedin.com/in/linling1"
        }
    ],
    "status": true,
    "generated_description": "### Modus: Revolutionizing Workforce Management with AI\n\n**Overview:**\nFounded in 2024 and part of Y Combinator's Batch S24, Modus is a small but mighty company located in the Bay Area, boasting a team of three dedicated professionals. The company's mission is clear: Unlock revenue per employee by utilizing AI-powered headcount management. You can check them out at [himodus.com](https://himodus.com).\n\n**The Problem:**\nTraditional workforce management often leads to bloated teams that either over-hire or underutilize talent. This inefficiency not only saddles businesses with excess costs but also stifles optimal performance. Co-founders Lin, Chris, and Amar know this all too well from their prior experiences in scaling teams. Lin scaled HashiCorp from 100 employees to IPO, while Chris and Amar faced similar challenges flexibly leading teams of 40+.\n\n**The Solution:**\nModus emerges as a beacon of change, designed to help organizations hire and retain only as many employees as they need to thrive. Their approach is a data-driven one, leveraging AI to analyze workforce data and streamline processes—eliminating the old reliance on cumbersome spreadsheets and clunky systems.\n\nThe technology integrates seamlessly with existing HR and ATS systems, enabling businesses to detect, inspect, and correct workforce plans in real-time. Imagine effortlessly mapping resources against performance metrics, tight budgeting, and accurate forecasting—all under one roof. \n\n**Key Features:**\n- **AI-Powered Insights:** Modus provides complete visibility into workforce data, allowing companies to avoid over-hiring and stay aligned with revenue goals.\n- **Scenario Planning:** It lets businesses simulate and adjust workforce configurations based on predicted outcomes, ensuring they're always prepared for various market conditions.\n- **Cost Efficiency:** The platform has reportedly saved companies $6 million from over-hiring and helped them reduce time spent reconciling data by 30%.\n- **Protection Against Variance:** Maintain budget variance within 5% with proactive management tools that help track hiring patterns, attrition, and overall utilization.\n\n**The Philosophy:**\nAt the core of Modus is the belief that companies should function like meritocracies, where resources and performance align directly with revenue generation. They advocate for a lean workforce strategy, suggesting that organizations can, and should, achieve more with fewer employees.\n\nIn a world where efficiency is king, Modus stands out by transforming how we think about workforce management. They challenge the status quo and make managing headcount not just easier, but smarter and more enjoyable.\n\nIf your company is ready to explore the potential of AI-driven workforce management, consider booking a demo to experience the Modus approach firsthand. After all, the era of efficiency is not just coming; it's already here.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/6fb5dfa3bd749f824e740c79db8741172939dd37.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191546Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=571750b7c8e60cb5ded937291cacc162dafadd645542aa508dfbd9fd1e6694b5",
    "social_links": [
        "https://www.linkedin.com/company/himodus/",
        "https://x.com/HiModus"
    ],
    "logo_path": "data/logos\\Modus_logo.png"
}