{
    "links": "https://www.ycombinator.com/companies/modulari-t",
    "name": "Modulari-T",
    "headline": "We teach your immune system to attack and cure cancer",
    "batch": "W23",
    "description": "Cell and gene therapy promises to one day cure any disease; Modulari-T’s Platform produces the tools to fulfill that promise.\r\n\nModulari-T has designed a new family of synthetic genes that can reprogram cells to better sense their environment and modify their behavior accordingly. This can be used to engineer immune cells to efficiently recognize and kill cancer cells or to create stem cells able to regenerate any tissue.\r\n\nModulari-T looks to expand its technology to reach every area of cell therapy and become the platform of reference for cell engineering.",
    "activity_status": "Active",
    "website": "https://modularit.bio",
    "founded_date": 2021.0,
    "team_size": 4.0,
    "location": "Montreal, Canada",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:gene-therapy; industry:cell-therapy; industry:synthetic-biology; industry:biotech; industry:oncology",
    "founders": [
        {
            "name": "David White, Founder",
            "description": "David is the CEO and cofounder of Modulari-T. His expertise spans multiple areas and he is driven by a passion for pushing the boundaries of technology.\n\nDuring his PhD he discovered how protein receptors form complex structures that allow them to alter cells’ behavior. He then took this knowledge and the novel technology that was developed to build Modulari-T.\n\nWhen he’s not thinking up a new way to engineer cells he can be spotted biking or running up a mountain.",
            "linkedin": "https://www.linkedin.com/in/david-white-modulari-t/"
        },
        {
            "name": "Stephanie Mok, Founder",
            "description": "Co-founder and COO at Modulari-T. PhD in chemical engineering. Technical background in synthetic biology, advanced 3D cell culture systems, and biomaterials in the context of the cellular cancer microenvironment. Fascinated by the innovations cell-based therapies, food products, and the scale up of their manufacturing. Gave the unconference talk \"Lessons learned and mistakes made growing the world's hottest peppers\".",
            "linkedin": "https://www.linkedin.com/in/stephmok/"
        }
    ],
    "status": true,
    "generated_description": "**Company Overview: Modulari-T**\n\n- **Founded:** 2021\n- **Location:** Montreal, Canada\n- **Team Size:** 4 employees\n- **Y Combinator Batch:** W23\n- **Website:** [modularit.bio](https://modularit.bio)\n  \n**Mission Statement:**  \nModulari-T's core goal is straightforward yet ambitious: to teach your immune system to effectively attack and cure cancer.\n\n**The Vision:**  \nInitially focused on gene and cell therapy, Modulari-T aspires to leverage the groundbreaking potential of these technologies to create comprehensive tools for treating various diseases. The company’s innovative platform is designed to produce synthetic genes that reprogram cells, enabling them to better interact with their environment. This technology is particularly aimed at engineering immune cells for enhanced cancer recognition and eradication, as well as developing stem cells to regenerate diverse types of tissues.\n\n**Technology Highlights:**  \nModulari-T has introduced a pioneering technology called Modular Actuation Receptor Cells (MARC). This is a next-generation synthetic biology solution that offers several advantages:\n- **Safer and More Potent Treatments:** MARC technology maximizes the potential of CAR-T therapy while minimizing toxicity and enhancing therapeutic durability, especially important in solid tumors.\n- **Persistent Immune Response:** It provides a lasting immune response that reduces the risk of disease relapse.\n- **Customizable and Optimized:** The modular receptors can be tailored for specific applications, offering complex logic-gated signals.\n- **Broad Compatibility:** Tested across various immune cells (T cells, NK cells, etc.) and stem cells, allowing the regeneration of the complete immune system.\n- **Cost-Effective:** Scalable solutions that make it accessible for wider use.\n\n**Strategic Outlook:**  \nModulari-T is set on becoming the leading reference platform in cell engineering and therapy, aiming to expand its technology to encompass every conceivable area of cell therapy.\n\n**Partnerships and Collaboration:**  \nWith a focus on synergy and growth, Modulari-T welcomes collaborative opportunities that could further enhance its innovative capabilities.\n\n**Tags:**  \nThe company is classified under key sectors including gene therapy, cell therapy, synthetic biology, biotechnology, and oncology. \n\nIn conclusion, Modulari-T is not just another biotech firm; it’s a company poised at the intersection of cutting-edge science and practical application, ready to redefine how we approach cancer and disease therapy. If you want to learn more or explore possibilities for collaboration, visit their website and get in touch!",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/e7870b2e700beae3a4b109877fe5c74a5fac4656.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191545Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=6e4fed8e4c16cb6d11e8d0128666436dbb626ff6c654370c795b415739d51233",
    "social_links": [
        "https://www.linkedin.com/company/modulari-t-bio/"
    ],
    "logo_path": "data/logos\\Modulari-T_logo.png"
}