{
    "links": "https://www.ycombinator.com/companies/moneco",
    "name": "Moneco",
    "headline": "Neobank for African migrants in Europe",
    "batch": "S22",
    "description": "Moneco is a neobank targeting the migrant communities in Europe, starting with the African diaspora. We are making banking easier and more affordable for underserved communities, starting with a current account, a payment card and free remittances. The long term vision is to turn Moneco into a one-stop-shop where all of their financial needs will be addressed.",
    "activity_status": "Active",
    "website": "https://moneco.app/",
    "founded_date": 2022.0,
    "team_size": 8.0,
    "location": "Paris, France",
    "group_partner": "Dalton Caldwell",
    "group_partner_yc": "https://www.ycombinator.com/people/dalton-caldwell",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:neobank",
    "founders": [
        {
            "name": "Shams Radjabaly, Founder",
            "description": "Born and raised in Madagascar, educated in France, lived in Singapore and the US, worked in Morocco, I thrive in an international setting.\nI have worked in the financial markets and in management consulting, and want to make the best use of my experiences to build an outstanding banking product for the African diaspora.\nApart from that, I am passionate about food (both cooking and eating it !)",
            "linkedin": "https://www.linkedin.com/in/shams-radjabaly/"
        },
        {
            "name": "Bilal Dahlab, Founder",
            "description": "My name is Bilal Dahlab, I have a multicultural background (Algeria, England, Italia) and grew up in a popular neighborhood in Geneva. \n\nI have a business profile with some knowledge in technology, gathered some experience in strategic consulting, finance, energy and blockchain. Today, my goal is to financially serve African communities in Europe, and then in Africa where we have bigger challenges!\n\nI spend most of my freetime with my friends, I like rap/hip-hop, football (soccer) and boxing.",
            "linkedin": "https://www.linkedin.com/in/bilal-dahlab-3a98a243/"
        },
        {
            "name": "Kuassi Jimmy Kumako, Founder",
            "description": "I’m Jimmy, I was born in Benin, grew up in several countries across West Africa.  I’ve worked with some great startups like Paystack, co-founded some (CoinAfrique…) and also with larger institutions such as IFC. \nMy main focus is to build products to solve some of the most challenging issues African communities are facing in and beyond Africa",
            "linkedin": "http://linkedin.com/in/jkumako"
        }
    ],
    "status": true,
    "generated_description": "### Moneco: Simplifying Banking for African Migrants in Europe\n\n**Overview**\nMoneco is a nascent neobank, founded in 2022 and based in Paris, France. It’s part of the Y Combinator Batch S22. Catering specifically to African migrants in Europe, Moneco’s mission is clear: make banking easier and more economical for underserved communities. Initially, it offers a current account, payment card, and free remittance services, but the long-term goal is to transform into a comprehensive financial services provider for its customers.\n\n**Key Features**\nMoneco leverages technology to streamline the banking experience, focusing on:\n\n- **Easy Account Setup:** Users can open an account with just their phone, passport, and a French residency address.\n- **International Payment Features:** The neobank provides a VISA debit card that works globally, allowing customers to send money throughout Europe and back home to various African nations.\n- **Zero-cost Remittances:** Moneco eliminates traditional transaction fees, ensuring migrants can send money home without the usual delays and costs associated with banks.\n\n**Target Audience**\nMoneco aims to serve a diverse clientele from various African countries including Morocco, Senegal, Algeria, Côte d'Ivoire, and Madagascar, among others. It not only addresses their banking needs but aids in their integration process while living in Europe.\n\n**Security and Compliance**\nMoneco takes the safety of its users seriously. Registered as a payment service provider with the French regulator ACPR, it ensures compliance and protection of customer funds up to €100,000. Advanced security measures, including biometric verification and encryption, protect user data from fraud.\n\n**Building a Community**\nMoneco is not just about banking; it’s about creating a supportive community for African migrants. By providing essential banking services alongside tailored support for immigration procedures, Moneco positions itself as a partner in navigating the complexities of life in Europe.\n\n**Conclusion**\nWith a small but dedicated team of eight, Moneco is committed to reshaping the banking landscape for African migrants in Europe. As it continues to grow, the focus remains on empowering users through accessible and affordable financial services while nurturing a community that thrives together. For more information, visit their [website](https://moneco.app).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/b700cb4279b358d8bda4c50363ba33438d86af8a.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191546Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=e05e37eadc515177b154e48a8d7d315a815ee8a9118f42c0afb66156a105ff9e",
    "social_links": [
        "https://www.linkedin.com/company/monecohq/"
    ],
    "logo_path": "data/logos\\Moneco_logo.png"
}