{
    "links": "https://www.ycombinator.com/companies/moni",
    "name": "Moni",
    "headline": "Group Financing for small businesses across Africa.",
    "batch": "W22",
    "description": "Moni finances small businesses in groups across Africa. The collective responsibility of the group serves as a collateral on the loan while the social pressure from the members ensures on-time repayment. There are over 44million SMBs in Africa. \r\n\nWe launched 7 months ago and we already have $72k MRR growing at 50% MoM. We achieved 99% repayment on 11,000 units of loans with over $5M disbursed. This is 15 times higher than most financial services in Africa.\r\n\nFemi (CEO) worked previously with the World Bank with a focus on financial services while Dapo (CTO) led the development of the technology for one of the largest digital lending apps\r\n\nWe are also backed by Y Combinator(W22), Magic Fund, Ventures Platform, Voltron Capital and more.",
    "activity_status": "Active",
    "website": "https://www.moni.africa/",
    "founded_date": 2021.0,
    "team_size": 20.0,
    "location": "Lagos, Nigeria",
    "group_partner": "Michael Seibel",
    "group_partner_yc": "https://www.ycombinator.com/people/michael-seibel",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:banking-as-a-service; industry:fintech; industry:neobank",
    "founders": [
        {
            "name": "Femi Iromini, Founder",
            "description": "Cofounder & CEO at Moni. Previously worked with The World Bank Group.",
            "linkedin": "https://www.linkedin.com/in/femiiromini/"
        },
        {
            "name": "Adedapo Sobayo, Founder",
            "description": "Co-founder Moni Africa. Passion for Digital Product, Technology, Block Chain and Financial Inclusion",
            "linkedin": "https://www.linkedin.com/in/adesobayo"
        }
    ],
    "status": true,
    "generated_description": "**Meet Moni: Pioneering Community Financing in Africa**\n\nMoni is a vibrant fintech startup born out of a necessity to empower small businesses across Africa through community-driven financing. Founded in 2021 and located in Lagos, Nigeria, Moni leverages the power of group dynamics, where collective responsibility acts as collateral for loans, making it a unique player in the financial sector.\n\n**The Mission and Model**\n\nMoni's mission is simple yet profound: to foster group financing for small businesses. With over 44 million small and medium-sized businesses (SMBs) in Africa, Moni enables groups of entrepreneurs to support one another. It works by granting loans to collective groups, underpinned by social pressure that encourages timely repayments. This innovative approach has yielded remarkable results, boasting a 99% repayment rate across 11,000 loans with more than $5 million disbursed — a success rate that dwarfs typical financial services in the region by a factor of fifteen.\n\n**Early Success and Growth Trajectory**\n\nIn just seven months post-launch, Moni has achieved an impressive Monthly Recurring Revenue (MRR) of $72,000, growing at 50% month-over-month. This trajectory not only underscores the demand for their service but also highlights the potential for scalability in a largely untapped market.\n\n**The Team Behind Moni**\n\nCEO Femi, with his background at the World Bank focusing on financial services, brings significant expertise to the table. CTO Dapo has previously led technology development for one of Africa’s largest digital lending apps. The duo's complementary skills position Moni advantageously within the competitive fintech landscape.\n\n**Backing and Recognition**\n\nMoni has garnered attention and support from prominent entities, including Y Combinator’s Winter 2022 batch, Magic Fund, Ventures Platform, and Voltron Capital. This backing not only provides crucial resources but also adds credibility to their mission.\n\n**Unique Offerings**\n\nMoni is tagged as a ‘banking-as-a-service’ provider, a fintech venture, and a neobank. Their offerings include high-yield savings options, business loans, and tailored insurance products designed to suit the financial needs of entrepreneurs. Users can access these services quickly, often in under five minutes, making Moni a go-to platform for SMB financing.\n\n**Community-Centric Financial Solutions**\n\nAt its core, Moni is about building community finance for Africa. They emphasize the idea of community trust as the bedrock of their financing model, presenting a refreshing departure from traditional banking systems that often alienate small business owners.\n\n**Connecting to Moni**\n\nIf you’re interested in learning more about Moni or exploring their offerings, you can visit their website at [www.moni.africa](https://www.moni.africa). Whether you’re a small business owner looking for financial solutions or just curious about innovative fintech startups in Africa, Moni represents a compelling case study in community-driven financial empowerment. \n\nIn summary, Moni is not just another fintech startup; it's a beacon of hope for countless small businesses, driving growth, fostering community ties, and reshaping how financing works in Africa.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/89306a574cc919e103bcb8ab5802edab00d80094.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191546Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=8afa917fa29bf97a102ec82e73e7e765a618a967b20fe8d059a89eb62d23aadf",
    "social_links": [
        "https://www.linkedin.com/mwlite/company/moni-africa",
        "https://twitter.com/mymoniapp",
        "https://www.facebook.com/MyMoniApp",
        "https://www.crunchbase.com/organization/moni-africa"
    ],
    "logo_path": "data/logos\\Moni_logo.png"
}