{
    "links": "https://www.ycombinator.com/companies/mozper",
    "name": "Mozper",
    "headline": "A debit card and app designed for kids and parents in Latin America",
    "batch": "S20",
    "description": "Mozper is bringing the weekly allowance into the digital era in Latin America. About 70% of the population in the region has never received formal financial education, and do not have the right tools to teach their children. In Brazil and Mexico alone, parents give more than $10B each year in pocket money to kids. Currently, parents must choose between giving their kids cash or handing over their own credit/debit cards. Mozper is a debit card and app where parents can give their kids an allowance, set spending rules (so they can't blow it all on video games), assign chores and even create and track savings goals. Mozper is currently available in Mexico.",
    "activity_status": "Active",
    "website": "https://www.mozper.com/",
    "founded_date": 2019.0,
    "team_size": 6.0,
    "location": "Mexico City, Mexico",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:education; industry:fintech",
    "founders": [
        {
            "name": "Yael Israeli, Founder",
            "description": "Yael is an authentic, energetic and caring leader, relentlessly focused on delivering results. She started her career in investment banking in New York at Lehman Brother and Barclays Capital. Moving to Panama, she set up a boutique finance and strategy consultancy which eventually gained her expertise in startups. Yael is CFO of Mozper, a Fintech targeting the pre-banked youth population. She is also the Treasurer of Mujeres Brillando, a NFP helping women entrepreneurs develop their businesses.",
            "linkedin": "https://www.linkedin.com/in/yaelisraeli1/"
        },
        {
            "name": "Gabriel Roizner, Founder",
            "description": "Gabriel Roizner holds a B.Sc. in Information Systems Engineering from Ben Gurion University, Israel, and an M.Sc. in Computer Science from INP de Grenoble, France. Before embarking on his entrepreneurial journey, he worked in the Business Intelligence team at Despegar.com. He was the co-founder & CEO of TiZKKA, the leading fashion community in Latin America with 1.5M users and over 1M followers on social media, which was acquired in March 2018. Currently, he serves as co-founder & CEO of Mozper.",
            "linkedin": "https://www.linkedin.com/in/gabrielroizner/"
        }
    ],
    "status": true,
    "generated_description": "### Overview of Mozper\n\n**Name:** Mozper  \n**Founded:** 2019  \n**Location:** Mexico City, Mexico  \n**Team Size:** 6 employees  \n**Y Combinator Batch:** S20  \n**Website:** [Mozper](https://www.mozper.com/)  \n**Group Partner:** Nan\n\n---\n\n**Mission:**  \nMozper exists to modernize how families in Latin America manage pocket money and education around finances. By offering a debit card and a companion app, Mozper enables parents to teach their children financial responsibility in a safe and controlled manner.\n\n---\n\n**The Problem:**  \nIn a region where about 70% of the population lacks formal financial education, the traditional means of giving pocket money—whether in cash or using parents' debit/credit cards—just isn’t cutting it. Brazilian and Mexican parents alone allocate over $10 billion annually to their children as allowances. Yet, how do parents give money without risking overindulgence on things like video games?\n\n---\n\n**The Solution:**  \nEnter Mozper’s debit card and app, specifically designed for kids and teenagers:\n\n- **Allowance Management:** Parents can automate weekly or monthly allowances directly to their kids’ Mozper accounts.\n- **Spending Restrictions:** They can set specific spending rules to control how and where their children use their funds—be it online or in stores.\n- **Chores and Rewards:** Parents can assign chores and provide financial rewards to foster a sense of achievement and responsibility regarding money.\n- **Savings Goals:** Children are encouraged to save by setting financial goals that yield interest, turning every penny saved into a learning experience.\n\nCurrently, Mozper operates in Mexico, with plans for future expansions.\n\n---\n\n**Key Features:**\n1. **Automatic Allowance:** Funds can be sent to kids automatically, helping them budget more effectively.\n2. **Savings with Returns:** Children can earn funds on their savings, bringing the fun of money management to a new level.\n3. **Task-Based Rewards:** By completing chores, kids can earn money, teaching them the value of work.\n4. **Spending Categories:** Parents determine categories where their children can spend, ensuring they're instilled with financial discipline.\n5. **Security Measures:** Cards are restricted from spending in age-inappropriate places (e.g., alcohol or tobacco).\n\nIn a digital era where many kids are already savvy with technology, Mozper empowers them with real-world financial skills while keeping parents in the loop.\n\n---\n\n**Conclusion:**  \nWith over 500,000 families using the service, Mozper isn't just another fintech product; it's a stepping stone toward creating financially responsible adults. The blend of education, technology, and parental supervision makes Mozper a compelling option for modern families navigating the complexities of finance in a digital age. The bottom line? Mozper is more than a card—it's a tool for teaching the importance of money management from a young age.\n\n---\n\nWith Mozper, families are no longer just handing down cash; they’re building a foundation for financial literacy that can last a lifetime.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/f2cab6ca005b83c9894c131eaa7af270f2b755db.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191549Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=d203bc0d05e299ca2131fcadd0cc55c7a702695e3c404e550744c3f91ad9dec1",
    "social_links": [
        "https://www.linkedin.com/company/mozper/",
        "https://twitter.com/mozper_mx",
        "https://www.facebook.com/mozper/",
        "https://www.crunchbase.com/organization/mozper"
    ],
    "logo_path": "data/logos\\Mozper_logo.png"
}