{
    "links": "https://www.ycombinator.com/companies/mth-sense",
    "name": "Mth Sense",
    "headline": "We're a mobile on-device profiling and ad-serving platform initiallyâ\u0080¦",
    "batch": "S12",
    "description": "mth sense focuses on finding solutions to \"blind\" ads. mth sense offers its users an audience library to target certain demographics and psychographics.",
    "activity_status": "Active",
    "website": "http://www.mthsense.com/",
    "founded_date": null,
    "team_size": 11.0,
    "location": "San Jose, CA",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:privacy; industry:advertising; location:san-francisco-bay-area",
    "founders": [],
    "status": true,
    "generated_description": "### Mth Sense: A Glimpse Into the Future of Ad Tech\n\n**Company Overview**  \nMth Sense is an innovative platform based in San Jose, California, primarily focusing on mobile on-device profiling and ad-serving. Founded as part of Y Combinator's Batch S12, Mth Sense emerged with a mission to tackle the inefficiencies of \"blind\" ads—those that lack targeting and relevance for the intended audience.\n\n**What They Offer**  \nAt the heart of Mth Sense’s offerings is **RevSense**, a sophisticated system that leverages machine learning, big data, and automation to optimize programmatic advertising revenue. With the potential to boost revenue by 20% to 100%, RevSense automatically adjusts ad setups in real-time, optimizing parameters like price floors and frequency caps without manual intervention.\n\n#### Key Features:\n1. **Yield Optimization**: The platform claims to guarantee a significant increase in overall programmatic revenue.\n2. **Unified Data**: Mth Sense aggregates data from various demand partners into a single reporting interface, simplifying analytics and decision-making.\n3. **Automated Tag Management**: It automates the creation and management of ad tags, which streamlines operations for publishers and reduces everyday hassles in ad management.\n\n**By the Numbers**  \n- **100 billion** impressions optimized  \n- **36%** average increase in revenue reported by users  \n- Over **100 publishers** on the platform  \n\n**The Team**  \nMth Sense is a lean operation with a team of 11 dedicated employees, all working together to push the boundaries of ad tech. Although specific partnerships are not disclosed, they have a robust group partner network to enhance their capabilities.\n\n**Tags**: Their core focus areas include **privacy**, **advertising**, and improving efficiencies within the **San Francisco Bay Area** digital landscape.\n\n**Conclusion**  \nIn a world flooded with automated ad solutions, Mth Sense stands out by putting the power of machine learning and automation directly into the hands of publishers. Their approach to giving advertisers a clearer view into their demographic targeting capabilities—while ensuring profitability—could redefine how brands connect with their audiences. If you're involved in programmatic advertising or looking to enhance your ad revenue, it's worth checking out what Mth Sense has to offer on their [website](http://www.mthsense.com/).",
    "logo": "/logos/medium/missing.png",
    "social_links": [
        "https://www.crunchbase.com/organization/mth-sense"
    ]
}