{
    "links": "https://www.ycombinator.com/companies/myria",
    "name": "Myria",
    "headline": "A marketplace of luxury services for the ultra-wealthy",
    "batch": "W22",
    "description": "Myria is a private community and concierge for off-market goods & services — the things you can't Google. \r\n\nUltra-high net worth individuals spend $390 billion per year ($1.3 million each) on lifestyle, but they still struggle to find everything they want. Why?\r\n\nBecause the best of any category — homes, boats, restaurant reservations — the best stuff is never listed online. Likewise, the best people don’t need the internet to find a new client or job. \r\n\nThe best is always off-market.  Myria is the Off-Marketplace. \r\n\nMyria helps off-market sellers reach the nicest and wealthiest buyers. In turn, we help the world’s most successful people access the best of everything, give back, and get the most out of life. \r\n\nIf it’s off-market, it’s on Myria!",
    "activity_status": "Active",
    "website": "https://myria.us",
    "founded_date": 2021.0,
    "team_size": 7.0,
    "location": "Los Angeles, CA",
    "group_partner": "Michael Seibel",
    "group_partner_yc": "https://www.ycombinator.com/people/michael-seibel",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:marketplace; industry:consumer; industry:community; location:los-angeles",
    "founders": [
        {
            "name": "Rey Flemings, Founder",
            "description": "Rey Flemings is co-founder and CEO of Myria. \n\nIn 4 years, Rey bootstrapped off-market services firm, The Blue, from $0 to $16 million of GMV. The Blue's 48 clients enjoyed a combined net worth exceeding $370 billion. Before The Blue, Rey also spent 11 yrs in family office for global celebrities (8 yrs with Justin Timberlake). \n\nFormerly, Rey was CEO of Particle (acquired by Apple in 2012).and the Commissioner of Music in his home state of Tennessee.",
            "linkedin": "http://linkedin.com/in/reyflemings/"
        }
    ],
    "status": true,
    "generated_description": "**Myria: The Off-Marketplace for the Ultra-Wealthy**\n\nFounded in 2021 and a proud member of Y Combinator’s Winter 2022 batch, Myria is based in Los Angeles and operates with a focused team of just seven employees. Its mission? To create a luxurious marketplace dedicated to the ultra-wealthy, offering exclusive services and experiences that you simply can’t Google. \n\nUltra-high net worth individuals—those with assets exceeding $30 million—spend a staggering $390 billion annually on lifestyle expenses (that’s about $1.3 million per person). Despite this lavish spending, they often find themselves struggling to access the very best in luxury offerings. This is where Myria steps in. It addresses the reality that the finest goods, whether they’re upscale homes, rare boats, or coveted restaurant reservations, typically linger off the public listings and online searches. The wealthiest sellers and service providers don’t need to advertise; they rely on exclusive networks to find their clientele.\n\nMyria serves as a bridge connecting these off-market sellers to the world’s most affluent buyers. It's about leveraging a network of extraordinary people who can access the best of everything—whether for personal pleasure, philanthropic pursuits, or simply to enrich their lives beyond material wealth. To sum it up: if it’s off-market, it’s on Myria.\n\n### What Makes Myria Stand Out:\n- **Exclusive Access:** By tapping into a rich network of fortune 500 CEOs, Nobel laureates, Oscar winners, and leading restaurateurs, Myria ensures that its members are not just beneficiaries of luxury services but part of a vibrant community of achievers. \n- **Luxury Lifestyle:** Myria isn’t just about transactions; it’s about creating lasting experiences that bring joy and a sense of accomplishment to its members. When success is redefined as more than just money, Myria helps its clientele measure their achievements by the depth of their happiness and connections.\n- **Simplicity and Ease:** The platform offers a seamless experience for users to discover, request, and obtain the extraordinary services they desire without the clutter of the typical online marketplace.\n\nIf you’re seeking experiences and services that resonate with true luxury—and you’re tired of searching in vain through generic listings—Myria is your answer.\n\nFor more information or to join the community, visit Myria at [myria.us](https://myria.us).\n\nIn essence, Myria isn’t just a marketplace; it’s a lifestyle enhancer and a gateway to the ultimate in luxury living for those who truly have it all.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/374246fb474afa52b53771c698f9be503abb2bf3.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191552Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=87f6de4dd54229caa13d278e9958660f001a82822c4a4af870c185e803009f5b",
    "social_links": [
        "https://www.linkedin.com/company/itonmyria",
        "https://twitter.com/itsonmyria",
        "https://www.crunchbase.com/organization/myria-6245"
    ],
    "logo_path": "data/logos\\Myria_logo.png"
}