{
    "links": "https://www.ycombinator.com/companies/nabis",
    "name": "Nabis",
    "headline": "Nabis is the largest licensed cannabis wholesale platform.",
    "batch": "W19",
    "description": "Nabis is the #1 licensed cannabis wholesaling platform in California, supporting over 300 exclusive brands and supplying the entire network of state-licensed dispensaries with top-tier products. Nabis offers clients lightning-fast fulfillment, warehousing, payment processing, financing, data analytics, sales and marketing services to enable more brands and retailers to innovate, launch and scale.",
    "activity_status": "Active",
    "website": "https://www.nabis.com/",
    "founded_date": 2018.0,
    "team_size": 300.0,
    "location": "San Francisco",
    "group_partner": "Michael Seibel",
    "group_partner_yc": "https://www.ycombinator.com/people/michael-seibel",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:marketplace; industry:b2b; industry:cannabis; industry:analytics; location:san-francisco-bay-area",
    "founders": [],
    "status": true,
    "generated_description": "Nabis is carving a name for itself as the largest licensed cannabis wholesale platform, originating as the top contender in California. Founded in 2018 and part of Y Combinator’s Batch W19, Nabis now stands tall in the industry by supporting over 300 exclusive brands. They supply a comprehensive network of state-licensed dispensaries with premium cannabis products, ensuring their clients receive lightning-fast fulfillment alongside a multitude of services.\n\nLocated in the vibrant tech hub of San Francisco, Nabis employs around 300 team members, spearheaded in part by Michael Seibel, a prominent Group Partner at Y Combinator. Their platform serves as a one-stop shop for brands and retailers, offering warehousing, payment processing, financing, data analytics, and marketing services. This ecosystem is designed to empower brands to innovate, launch, and scale in an increasingly competitive market.\n\nNabis provides its partners with a marketplace housing over 9,000 SKUs, alongside features like order tracking, automated invoice factoring through Nabis Capital, and robust analytical tools for performance tracking. They've recently begun operations in New York and Nevada, expanding their reach beyond California.\n\nWhat’s interesting about Nabis isn’t just their vast inventory and rapid distribution capabilities; it's also how they leverage data and analytics to provide insights that are critical in this fast-paced industry. They have 133,000 square feet of warehouse space and operate more than 90 delivery vehicles, ensuring that they maintain a quick turnaround time to serve their clients efficiently.\n\nSo why does Nabis stand out? It’s their unique blend of technology and customer service, making it easier for brands and dispensaries to connect and thrive. With backing from notable investors and an extensive partner network, Nabis is not just about cannabis; it’s about redefining wholesale distribution in a burgeoning market.\n\nFor more information, you can visit their website at [Nabis](https://www.nabis.com/).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/cf8595cd1c3f69a8e4eba7d7f0aa0017d9cf5523.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191553Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=7b2e7f1c90e6f911d0e8d0cc2b8726904407284856228a2b9ce6cf5c8cb5e21a",
    "social_links": [
        "https://www.linkedin.com/company/nabishq/",
        "https://www.crunchbase.com/organization/nabis"
    ],
    "logo_path": "data/logos\\Nabis_logo.png"
}