{
    "links": "https://www.ycombinator.com/companies/nabla-bio",
    "name": "Nabla Bio",
    "headline": "We use AI to design antibodies for intractable diseases",
    "batch": "S20",
    "description": "Our mission is to enable pharmaceutical and biotech companies to bring more antibody therapies to patients. Using AI and massively parallel experimentation, we design antibodies that precisely bind the disease target at the right location, while minimizing manufacturability and toxicity risks. We are a well-funded, revenue-generating, bilingual company of wet- and dry-lab scientists, and are founded by AI and protein design experts from Harvard University.",
    "activity_status": "Active",
    "website": "https://www.nabla.bio",
    "founded_date": 2020.0,
    "team_size": 8.0,
    "location": "Boston",
    "group_partner": "Jared Friedman",
    "group_partner_yc": "https://www.ycombinator.com/people/jared-friedman",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:ai-powered-drug-discovery; location:boston",
    "founders": [
        {
            "name": "Surge Biswas, Founder",
            "description": "Currently building Nabla Bio.\n\nI'm a scientist with 10+ years of experience with using synthetic biology and machine learning to engineer everything from the microbiome to proteins. I recently completed my PhD from George Church's lab at Harvard.",
            "linkedin": "https://www.linkedin.com/in/surge-biswas-a8b61270/"
        },
        {
            "name": "Frances Anastassacos, Founder",
            "description": "Currently building Nabla Bio!\nI've spent the last 8 years applying my chemistry training to problems in biology and specifically synthetic biology. I did my PhD at Harvard (Class 2019, BBS) and spent some time in biotech VC.",
            "linkedin": "https://www.linkedin.com/in/frances-anastassacos"
        }
    ],
    "status": true,
    "generated_description": "**Nabla Bio Overview**\n\nFounded in 2020 and hailing from Boston, Nabla Bio is making waves in the pharmaceutical and biotech industries. They have a clear mission: to harness the power of AI to design antibodies targeting intractable diseases. The founders, experts in AI and protein design from Harvard University, led the charge with a promising vision to improve drug therapies for patients.\n\nWith a well-rounded team of eight, Nabla Bio is both bilingual and revenue-generating, showcasing the potential for solid growth. They participated in the Y Combinator Batch S20, which is a testament to their innovation and ambition.\n\n**What They Do**\n\nNabla Bio’s approach is unique—combining generative drug design with massively parallel experimentation. They focus on creating antibodies that can precisely bind to disease targets while minimizing risks related to manufacturability and toxicity. Their process hinges on close integration between AI-guided designs and empirical measurements. \n\nThey are currently expanding the horizons of druggable targets, moving towards drug design with atomic precision. By employing AI, they aim to tackle diseases that have historically been difficult to treat. The fusion of advanced AI techniques with laboratory-driven experiments is core to Nabla's mission.\n\n**Collaborations and Community**\n\nNabla places significant importance on partnerships, working with leading pharmaceutical companies to maximize their platform's impact. This commitment not only enhances their technological capabilities but also drives their efforts to bring innovative therapies to patients more effectively.\n\n**Get Involved**\n\nTheir website invites collaborations and careers. If you’re interested in being part of broader drug design advancements, Nabla could be an exciting place to explore career opportunities.\n\nCurious to learn more? Check out their [website](https://www.nabla.bio) for technical reports and information about their ongoing work.\n\nIn summary, Nabla Bio is at the intersection of technology and healthcare, pushing the boundaries of drug discovery with an intelligent blend of AI and experimental science. They're a company to watch as they navigate the complexities of human biology to develop next-generation therapies.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/2edfcdfb101c0867084fab0c0ab67e07693803c7.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191553Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=9bc5ad4da1cc9f45de996077d2dc7ab79a345578ad8ae702bc20557ca79cdca6",
    "social_links": [],
    "logo_path": "data/logos\\Nabla_Bio_logo.png"
}