{
    "links": "https://www.ycombinator.com/companies/nash",
    "name": "Nash",
    "headline": "The easiest way for any business to offer delivery",
    "batch": "S21",
    "description": "Nash makes it easy for businesses to offer same-day delivery. We do this by building business workflows on top of delivery APIs (like Doordash, Uber, Skipcart). For example, a local dry-cleaning business can start offering pickup and dropoff service at a customer’s desired time without operating their own fleet.",
    "activity_status": "Active",
    "website": "https://www.usenash.com/",
    "founded_date": 2021.0,
    "team_size": 31.0,
    "location": "San Francisco",
    "group_partner": "Michael Seibel",
    "group_partner_yc": "https://www.ycombinator.com/people/michael-seibel",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:marketplace; industry:b2b; industry:delivery; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Mahmoud Ghulman, Founder",
            "description": "Co-founder at Nash. Prior to Nash, I founded a gig-worker parking logistics company and led Business Development at Mozn - where we developed AI solutions in AML, stock-market fraud, and credit scores in finance & insurance. I received my Bachelors in Physics from MIT.\n\nI love spending time with family at the beach, scuba-diving with Aziz, and playing tennis.",
            "linkedin": "https://www.linkedin.com/in/mahmoudghulman/"
        },
        {
            "name": "Aziz Alghunaim, Founder",
            "description": "Co-founder at Nash. Prior to Nash, I spent a couple of years building Tarjimly (YC W18), a mobile application to connect refugees with real, volunteer translators all over the world. Before that, I was a software engineer at Palantir working on a number of high-volume data problems. I received my Bachelors and Masters in Computer Science in 2015 from MIT.\n\nI love mission-driven work that is coupled with great technical execution. I am in the Bay Area, and love meeting new people, so say hello :)",
            "linkedin": "https://www.linkedin.com/in/azizkag"
        }
    ],
    "status": true,
    "generated_description": "Nash is a San Francisco-based company founded in 2021 and a proud member of Y Combinator’s S21 batch. Their mission? It’s straightforward—Nash aims to be the easiest way for businesses to offer delivery services, initially focusing on same-day delivery.\n\nAt its core, Nash operates by creating business workflows that integrate with existing delivery APIs like DoorDash, Uber, and Skipcart. This means that businesses, such as local dry cleaners, can effortlessly provide pickup and drop-off services without the need to manage their own delivery fleet. They’re taking the complexity out of logistics, allowing businesses to focus on what they do best.\n\nWith a team of 31 employees and under the guidance of Group Partner Michael Seibel, Nash has positioned itself as a leader in last-mile logistics. Their platform includes various solutions such as workflow optimization, fleet management, orchestration of deliveries, and customer engagement analytics. These tools are designed to streamline delivery operations and improve performance at every touchpoint, from internal processes to customer experiences.\n\nNash supports a range of businesses—from grocery and retail to restaurants and pharmacies—enabling them to scale their delivery operations effectively. The company touts a hefty network of over 500 delivery fleets globally, providing them the flexibility to meet their unique fulfillment needs. It’s not just about improving delivery; it's about transforming how logistics operate at a foundational level.\n\nMoreover, Nash has introduced AI logistics agents to assist businesses in refining their delivery workflows further. They emphasize the importance of data-driven insights and performance metrics for businesses looking to excel in the competitive delivery space.\n\nIn essence, Nash is powering millions of deliveries across multiple markets and is committed to providing security and compliance at its core. If you’re in the business of delivery, you might want to check out what Nash offers—it's designed to be the last piece of the puzzle in the last-mile logistics landscape.\n\nFor more information, visit their website: [Nash](https://www.usenash.com/).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/80432510efe3639eb8e61bcd007e1b4c211e0bd2.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191553Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=64096113af0b84ad4e3c943680409269aba26edeade804abfc2f75af1795935a",
    "social_links": [
        "https://www.linkedin.com/company/usenash",
        "https://twitter.com/usenash"
    ],
    "logo_path": "data/logos\\Nash_logo.png"
}