{
    "links": "https://www.ycombinator.com/companies/nephrogen",
    "name": "Nephrogen",
    "headline": "Curative gene therapies for kidney diseases",
    "batch": "S20",
    "description": "We're building curative gene therapies for kidney diseases. Our initial focus is on polycystic kidney disease (PKD), which affects 600,000 Americans and has no effective treatment or cure.",
    "activity_status": "Active",
    "website": "http://www.nephrogenbiotech.com",
    "founded_date": 2020.0,
    "team_size": 1.0,
    "location": "New York",
    "group_partner": "Jared Friedman",
    "group_partner_yc": "https://www.ycombinator.com/people/jared-friedman",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:gene-therapy; industry:crispr; industry:biotech; location:new-york",
    "founders": [
        {
            "name": "Demetri Maxim, Founder",
            "description": "Stanford B.S. '20 (Biology), Founder of Nephrogen",
            "linkedin": "https://www.linkedin.com/in/demetri-maxim"
        }
    ],
    "status": true,
    "generated_description": "### Nephrogen: Pioneering Gene Therapies for Kidney Diseases\n\n**Overview**\nNephrogen is an innovative biotech company founded in 2020 and based in New York, specializing in curative gene therapies for kidney diseases. Initially launched as part of Y Combinator's Summer 2020 batch, the company aims to tackle autosomal dominant polycystic kidney disease (ADPKD), a genetic condition affecting around 600,000 Americans currently without an effective treatment or cure.\n\n**Mission**\nAt Nephrogen, the mission is clear: to revolutionize treatment for life-threatening kidney diseases through advanced gene therapy technologies. Their commitment is to provide tangible solutions for patients impacted by kidney ailments, marking a significant shift in therapeutic approaches. \n\n**Technology**\nNephrogen’s therapeutic platform aggressively combines CRISPR-Cas genome editing with cutting-edge delivery methods like adeno-associated viruses (AAVs) and lipid nanoparticles (LNPs). This innovative design allows them to target kidney diseases with high precision and efficacy:\n- **Maximum Therapeutic Effect:** A novel, non-invasive method for localized delivery of gene therapy.\n- **Precision Delivery:** Enhanced AAVs optimized through directed evolution to significantly improve targeting efficiency.\n- **Personalized Approach:** Focus on distinct gene targets responsible for ADPKD.\n\nThey also integrate modern technologies like computer vision and high-throughput screening to accelerate drug discovery for other cystic kidney diseases.\n\n**The Team**\nNephrogen operates with a small, yet highly capable team led by CEO Demetri Maxim, whose personal connection to kidney health drives his dedication. The team includes experts well-versed in both clinical and research environments, such as Dr. Vivek Bhalla, their Chief Medical Advisor, who is also an Associate Professor at Stanford University. The company also boasts a robust advisory team filled with prominent figures in genetics and nephrology.\n\n**Advisors and Collaborations**\nThe advisory board includes esteemed scientists, such as Dr. George Church from Harvard Medical School and Dr. Mark Kay, who has made significant advancements in gene therapy research. Their expertise strengthens Nephrogen's research and development pipeline and opens doors to potential collaborations.\n\n**In Summary**\nNephrogen is not just developing treatments; they're reimagining how kidney diseases are approached on a genetic level. With a potent blend of innovative technology, a passionate team, and a compelling mission, Nephrogen stands at the forefront of a potentially transformative shift in kidney care. It’s a bold leap towards curing what was once deemed incurable, making this company one to watch as it forges a new path in biotech. \n\nFor more information, check out their website at [Nephrogen Biotech](http://www.nephrogenbiotech.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/150824b1dc21dbcb208fdfed8e2662703a131dc4.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191556Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=5b9ce6b8649613c846c29ecb7801d79ad73eb52184d1c9ac75648dba770837a9",
    "social_links": [
        "https://www.linkedin.com/company/nephrogen",
        "https://www.crunchbase.com/organization/nephrogen"
    ],
    "logo_path": "data/logos\\Nephrogen_logo.png"
}