{
    "links": "https://www.ycombinator.com/companies/nestor",
    "name": "Nestor",
    "headline": "Skills-based talent management solutions for a dynamic workforce.",
    "batch": "S18",
    "description": "Nestor is a Skills-based talent management platform that helps HR and managers identify, activate, and strategically deploy skills in their organization to drive peak performance, innovation, and growth.\r\n\nWith a market library of over 20,000 skills enhanced by Nestor’s AI skills suggestions, you gain unprecedented visibility into your people’s capabilities and dynamic mapping of their skills.\r\n\nOur leading platform combines the tools, insights, and decision-making support you need to understand people's strengths and skill gaps and effectively guide them with personalized upskilling and reskilling initiatives aligned with career goals and company business priorities.\r\n\nNestor’s Talent and Opportunity Marketplace helps connect talent with gigs, projects, or new open roles based on AI smart-matching, ensuring people with the right skills are in the right place at the right time.\r\n\nUsing the capabilities of the Nestor platform, HR and business leaders can benefit from:\r\n- Skills Mapping\r\n- Increased Performance\r\n- Upskilling & Reskilling\r\n- Talent Deployment\r\n- Growth & Retention\r\n- Internal Hiring\r\n- Succession Planning\r\n- Workforce Agility\r\n- Optimized learning ROI\r\n- Emerging Skills\r\n\nNestor is trusted by HR and people leaders in mid-to-large enterprises, including F500 companies, across the US, Latin America, Europe, and the Middle East.\r\n\nNestor is rated the #1st Easiest to Use Skills Management Software on G2.\r\n\nRequest a demo here: https://nestorup.com/demo.",
    "activity_status": "Active",
    "website": "https://nestorup.com",
    "founded_date": 2018.0,
    "team_size": 20.0,
    "location": "San Jose, CA",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:saas; industry:hr-tech; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Bogdan Apostol, Founder/CEO",
            "description": "Bogdan is the CEO and co-founder of Nestor, the People Intelligence Platform that helps hybrid organizations develop and retain talent. Bogdan previously co-founded Marionette Studio and has a Ph.D. in computer science with research work referenced by Intel and LG. Bogdan leads our business development and is responsible for the company’s direction.",
            "linkedin": "https://ro.linkedin.com/in/bogdanapostol86"
        },
        {
            "name": "Raluca Apostol, Founder/CPO",
            "description": "Raluca Apostol is co-founder and Chief Product Officer at Nestor. With a Ph.D in machine learning, she leads the research and product development at Nestor. Raluca has over eight years of experience in team management and people development. She deeply cares about customer success and makes sure that every employee using the product is becoming better every day.",
            "linkedin": "https://www.linkedin.com/in/constantinaralucamihalache/"
        }
    ],
    "status": true,
    "generated_description": "Nestor is a forward-thinking company established in 2018 as part of Y Combinator’s Batch S18. Located in San Jose, CA, and consisting of a dynamic team of 20 employees, Nestor specializes in skills-based talent management solutions for a rapidly evolving workforce.\n\nThe mission is straightforward: to help HR and managers strategically identify, activate, and deploy their organization's skills to enhance performance, innovation, and growth. Nestor boasts a comprehensive skills library with over 20,000 skills, augmented by AI-driven suggestions, granting users unparalleled visibility into employee capabilities and intricate skill mapping.\n\nWhat differentiates Nestor is its integration of cutting-edge features, which include:\n\n- **Skills Mapping** - Allows organizations to understand employee strengths and gaps.\n- **Upskilling & Reskilling Initiatives** - Personalized training aligns with employees’ career aspirations and business needs.\n- **Talent and Opportunity Marketplace** - An AI smart-matching system that connects talent with appropriate gigs, projects, or roles to ensure optimal placement of skills at any given time.\n- **Performance Management Tools** - Helps track and enhance organizational agility and competitiveness by aligning workforce capabilities with strategic goals.\n\nNestor’s platform is particularly beneficial for HR and business leaders in mid-to-large enterprises, including Fortune 500 companies across various regions, including the US, Latin America, Europe, and the Middle East. It's rated as the easiest skills management software on G2, reflecting its user-centric design and effectiveness.\n\nMoreover, Nestor provides a community and resources for HR professionals to foster networking and continuous learning. With a focus on operational effectiveness and talent growth, Nestor is building a skills-centric landscape that addresses modern workforce challenges head-on.\n\nIf you’re interested in seeing what Nestor can do for your organization, feel free to [request a demo](https://nestorup.com/demo) or explore their [website](https://nestorup.com) for more insights.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/73f49bc4f891bfde72b40b51f5cec5cfc5029746.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191556Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=d80bb4f8c53428984fae908f0e2602e999b64f34d190b6dd3d43f792389188a4",
    "social_links": [
        "https://www.linkedin.com/company/nestorup",
        "https://twitter.com/NestorUpHQ",
        "https://www.facebook.com/NestorUp",
        "https://www.crunchbase.com/organization/nestor-cc61"
    ],
    "logo_path": "data/logos\\Nestor_logo.png"
}