{
    "links": "https://www.ycombinator.com/companies/netomi",
    "name": "Netomi",
    "headline": "Self-Driving Customer Care",
    "batch": "W16",
    "description": "Welcome to Netomi AI, where we are revolutionizing the world of customer experiences through cutting-edge artificial intelligence. Our mission is clear: to create AI that not only solves mission-critical problems for the world's largest brands but also fosters genuine customer love. Backed by industry titans like Y-Combinator, Index Ventures, Jeffrey Katzenberg, and Greg Brockman, Netomi AI is at the forefront of defining the future of AI-driven customer engagement.\r\n\nAt Netomi, we embody our core values in everything we do:\r\n\nPassion: We love what we do, genuinely. We persevere, creatively problem solve, and grow from adversity.\r\n\nCustomer Focus: We obsess over creating a positive impact and deliver experiences that meet or exceed the needs of our customers, and their customers.\r\n\nOne Team: We believe in working collaboratively as One Team to meet shared objectives and goals.\r\n\nJoining Netomi AI means being part of a dynamic, fast-growing team that values innovation, creativity, and hard work. As a key player in the Generative AI revolution, you'll have the opportunity to significantly impact our success while developing your skills and career in the ever-evolving field of AI.\r\n\nNetomi AI is not just a workplace; it's a community of visionaries shaping the future of customer engagement. If you're ready to be part of something extraordinary, where your passion aligns with our values and vision, we invite you to explore opportunities with us. Your journey to redefine customer experiences with brand-safe AI starts here.\r\n\nMission\r\nTo empower the highest quality customer experiences with brand-safe AI.\r\n\nVision\r\nBuilding Brand and Customer Love",
    "activity_status": "Active",
    "website": "https://netomi.com",
    "founded_date": 2015.0,
    "team_size": 104.0,
    "location": "San Mateo, CA",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:deep-learning; industry:customer-service; industry:ai; location:san-francisco-bay-area",
    "founders": [],
    "status": true,
    "generated_description": "**Netomi: Revolutionizing Customer Engagement with AI**\n\nFounded in 2015 and part of Y Combinator's W16 batch, Netomi is on a mission to transform customer care into a self-driving experience. Located in San Mateo, California, the company has assembled a talented team of 104 employees, all committed to redefining how brands interact with their customers through AI-powered solutions.\n\n**The Vision**\n\nNetomi’s vision is to empower brands to foster genuine customer love by utilizing advanced AI technology. They aim to deliver the highest quality customer experiences that are both responsive and brand-safe. Their platform integrates seamlessly with existing systems, allowing businesses to respond to customer needs quickly and effectively.\n\n**Core Values**\n\n1. **Passion:** Netomi lives and breathes innovation, tackling challenges creatively and growing stronger through adversity.\n   \n2. **Customer Focus:** The company is deeply committed to creating positive, impactful customer experiences, consistently aiming to meet or exceed expectations.\n\n3. **One Team:** Collaboration is key. Netomi fosters a team-centric environment where shared goals drive collective success.\n\n**What They Do**\n\nAt the heart of Netomi’s offerings is its full-stack Agentic Operating System, which includes features such as:\n\n- **Sanctioned Generative AI:** This allows brands to handle customer queries while maintaining brand integrity and security.\n- **Proactive Customer Care:** Netomi anticipates customer needs, offering preemptive support that enhances engagement and drives revenue.\n- **Omnichannel Intelligence:** Conversations can take place across various channels—email, chat, SMS, and more—through a single AI interface.\n- **Integration Capabilities:** The technology integrates seamlessly with existing customer communication systems and backend infrastructure, streamlining operations significantly.\n\nThe results speak for themselves. With Netomi, companies have reported:\n- 50% reductions in support costs\n- 90% resolution rates for customer inquiries \n- A fivefold increase in support team capacity\n\n**Looking Forward**\n\nBacked by notable investors, including Y Combinator and industry leaders like Jeffrey Katzenberg, Netomi is not just about technology; it's about fostering a community of innovators. They’re inviting talent to join their ranks, promising a dynamic workplace that values creativity and hard work.\n\nIn a world where customer expectations are ever-increasing, Netomi stands at the forefront, leveraging AI to not only meet but exceed them. Whether you’re a business looking to enhance your customer interactions or a professional eager to make an impact in the AI space, Netomi offers a unique opportunity to be part of something extraordinary.\n\nFor more info, check out their website at [Netomi](https://netomi.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/93ead3e65ca331e42504e1f81e9a4c96285d1eb0.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191556Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=10e86d4985d38fbfdb9c0ed9da6511b91a9f61078a4c34dd8ab232e46c72aedb",
    "social_links": [
        "https://www.linkedin.com/company/netomi/",
        "https://twitter.com/netomi_official",
        "https://www.crunchbase.com/organization/msg-ai",
        "https://github.com/msgai"
    ],
    "logo_path": "data/logos\\Netomi_logo.png"
}