{
    "links": "https://www.ycombinator.com/companies/new-story",
    "name": "New Story",
    "headline": "We pioneer solutions to end the global housing crisis by empoweringâ\u0080¦",
    "batch": "S15",
    "description": "Since its inception, NS has raised over $80 million to build thousands of homes across Latin America and impact ~20,000 individuals. In 2021, NS launched a venture capital fund, Hometeam Ventures, focused on early-stage construction and housing innovations. NS graduated from Y Combinator and is a 4x recipient of Fast Companyâ\u0080\u0099s Most Innovative Company.",
    "activity_status": "Active",
    "website": "http://newstoryhomes.org",
    "founded_date": 2014.0,
    "team_size": 30.0,
    "location": "Atlanta, GA",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:nonprofit; industry:housing",
    "founders": [
        {
            "name": "Brett Hagler, Founder/CEO",
            "description": "Co-Founder and CEO at New Story.",
            "linkedin": "http://www.linkedin.com/in/rbhagler/"
        },
        {
            "name": "Matthew Marshall, Founder",
            "description": "Co-founder and Chief Business Officer of New Story.Â \n\nNew StoryÂ pioneers solutions to end global homelessness through a market-driven approach and since starting 8 years ago we've raised over 50M+ and built 37 communities (100-150 homes per project) in Latin America. Our goal is to house 1M individuals by 2030 through sustainable and scalable affordable housing models by blending a mixture of philanthropy, impact investment, and technical expertise.",
            "linkedin": "http://linkedin.com/in/jamesmatthewmarshall"
        }
    ],
    "status": true,
    "generated_description": "### New Story Overview\n\n**Founding and Vision**  \nFounded in 2014 and hailing from Atlanta, Georgia, New Story is a nonprofit organization on a bold mission: to end the global housing crisis through innovative solutions. With over $80 million raised and thousands of homes built across Latin America, they've directly impacted approximately 20,000 lives. The mantra here is empowering families—not merely as recipients of charity but as participants in a transformative journey toward homeownership.\n\n**Innovation and Impact**  \nNew Story has made waves since its inception. They graduated from Y Combinator and have been recognized multiple times as one of Fast Company's Most Innovative Companies. In 2021, they launched Hometeam Ventures, a venture capital fund aimed at boosting early-stage innovations in construction and housing. They're not just about erecting walls; they're about creating scalable, sustainable solutions that respond to the real needs of communities.\n\n**Approach to Housing**  \nWith 1.8 billion people lacking adequate housing, New Story focuses on making land and financing accessible for families in vulnerable situations. This innovative, market-based approach allows families to build credit, invest in property, and cultivate wealth over time. For instance, families who secured land in Mexico saw their net worth grow twofold in just four years. This isn't your traditional charity model; it's an investment in potential.\n\n**Empowering Women**  \nParticularly enlightening is their initiative in Etzatlán, Mexico, where over 941 low-income families became landowners, 60% of whom are led by women—significantly above the national average. This empowerment doesn't just unlock homes but enhances household security, proving that when women own property, they uplift entire communities.\n\n**Getting Involved**  \nNew Story operates on the foundation of collaboration and community support. Interested individuals can get involved through donations, becoming impact investors, or corporate partnerships. Not only is this about giving—it's about building a sustainable model that thrives on shared value and collaboration.\n\n**Final Thoughts**  \nAs the global housing crisis continues to loom, New Story stands out with a pragmatic and innovative approach to one of humanity's most pressing issues. They invite everyone to join a journey that transforms not just houses but lives, focusing on empowerment and systemic change. If you're interested in more details, check out their website: [New Story](http://newstoryhomes.org).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/e735ea07b00ee16cc77023047d2396a94154e33d.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191557Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=f1edbdd8f1c00af1629e910817e4912e4f79edf030297856345600aeeca0acd2",
    "social_links": [
        "https://www.linkedin.com/company/new-story-homes/",
        "https://mobile.twitter.com/NewStoryHomes",
        "https://www.facebook.com/newstoryhomes"
    ],
    "logo_path": "data/logos\\New_Story_logo.png"
}