{
    "links": "https://www.ycombinator.com/companies/nextpay",
    "name": "NextPay",
    "headline": "The digital bank for small businesses in the Philippines.",
    "batch": "W21",
    "description": "NextPay is a digital bank for small businesses and entrepreneurs in The Philippines. They use us to send invoices, collect payments, do payroll, and pay their bills.\r\n\nNextPay is the best alternative to bank accounts for small businesses and entrepreneurs in the Philippines. We help them similarly to how Brex helps companies in the US, but in a way that is more locally nuanced. We manage their finances and remove the steep barriers that Filipino banks and financial institutions typically require; no setup fees, maintaining balances, or ridiculous requirements. \r\n\nView the full context on our Launch Bookface post: \r\nhttps://bookface.ycombinator.com/posts/51999",
    "activity_status": "Active",
    "website": "https://nextpay.world",
    "founded_date": 2019.0,
    "team_size": 65.0,
    "location": "Makati, Philippines",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:banking-as-a-service; industry:fintech; industry:b2b",
    "founders": [
        {
            "name": "Don Pansacola, Founder",
            "description": "Don is the CEO and Co-founder of NextPay.ph, a fast, simple, and affordable digital banking suite for small Filipino businesses. \n\nHis background in software engineering, blockchain, distributed technologies, and digital product design made him integral to the growth and success of a major tech startup, OpenDNS. He was part of the early core product team who saw its eventual acquisition by Cisco Systems, a Fortune 100 company.",
            "linkedin": "https://www.linkedin.com/in/donpansacola/"
        },
        {
            "name": "Aldrich Tan, Founder",
            "description": "Aldrich is the CXO and Co-founder of NextPay.ph, a fast, simple, and affordable digital banking suite for small Filipino businesses, and the Managing Director UXPH, largest non-profit design organization and community in the Philippines.\n\nHe is a Sr. Experience Architect (UX) and Design Leader who has led teams in some of the most successful tech companies throughout the US, Canada, and the Philippines such as BlackBerry, Getty Images, Artefact, and Remitly.",
            "linkedin": "https://www.linkedin.com/in/aldricht/"
        }
    ],
    "status": true,
    "generated_description": "**NextPay: Empowering Small Businesses in the Philippines**\n\n*Founded: 2019  \nLocation: Makati, Philippines  \nTeam Size: 65  \nBatch: Y Combinator W21*\n\nNextPay is on a mission to revolutionize financial services for small businesses and entrepreneurs in the Philippines. Think of it as a digital banking alternative tailored to the local context, much like Brex for U.S. companies but without the bureaucratic red tape many Filipino banks impose. \n\n**What Makes NextPay Special?**\n\n1. **Ease of Use**: NextPay enables businesses to send invoices, collect payments, manage payroll, and pay bills—all without the hassle of setup fees or ridiculous minimum balance requirements.\n\n2. **Features**:\n   - **Send Money**: Pay suppliers, process bulk payouts, and manage employee salaries conveniently to any major bank or e-wallet.\n   - **Manage Money**: Generate payslips and reports for bookkeeping, maintain a business directory for easy reference, and utilize developer APIs to customize workflows.\n   - **Affordable Pricing**: Transparent subscription plans help businesses choose what works for them, along with a savings calculator to see potential savings.\n\n3. **Security and Regulations**: Regulated by the Bangko Sentral ng Pilipinas (BSP), NextPay ensures transactions are safe and secure.\n\nAs of now, over 4,200 businesses trust NextPay, processing more than PHP 10 billion in transactions. Their customer testimonials speak volumes—clients describe the platform as “unbelievably easy” and a game-changer for handling payments and disbursements without the need for traditional corporate bank accounts.\n\nFor those interested in modernizing their financial processes, NextPay may just be the tool that transforms the way businesses in the Philippines operate.\n\n*To learn more, visit [NextPay's website](https://nextpay.world) and start a free trial today!*",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/2f9fc107f865fc60d6abfafa791a2468cfc6600e.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191600Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=c6f99bef7ec53bc6789121036fcfba4ff32956c2fdbeba068c36b0d23268665b",
    "social_links": [
        "https://www.linkedin.com/company/nextpayph",
        "https://twitter.com/nextpayph",
        "https://www.facebook.com/nextpayph"
    ],
    "logo_path": "data/logos\\NextPay_logo.png"
}