{
    "links": "https://www.ycombinator.com/companies/nino-foods",
    "name": "Nino Foods",
    "headline": "Building India's fast food empire",
    "batch": "S21",
    "description": "Nino Foods builds and operates fast food restaurants in India. We own 3 brands- Nino Burgers, Francesco's Pizzeria and KHA-Fried Chicken. We operate QSR and cloud kitchen formats and have industry leading payback period per store (<1 year). We are tripling in size yearly and are profitable. We have 25 Locations in Mumbai and service 40K orders per month. The founding team has Nishant - an Insead MBA, and Pranav-who led online revenue for Disney and Conde Nast India.",
    "activity_status": "Active",
    "website": "https://eatnino.com/",
    "founded_date": 2020.0,
    "team_size": 250.0,
    "location": "India",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:ghost-kitchens; industry:delivery; industry:e-commerce; industry:food-&-beverage",
    "founders": [
        {
            "name": "Nishant Jhaveri, Founder",
            "description": "Nishant is an Insead MBA and Babson college alum with retail operations experience in India. Previously he worked on Growth at the CEO's Office at India's largest Auto Dealership Group. There he worked closely with the investors from TPG on company strategy, and with large brands like Mercedes Benz on new location launches.",
            "linkedin": "https://www.linkedin.com/in/nishantjhaveri23/"
        },
        {
            "name": "Pranav Mehra, Founder",
            "description": "Pranav Mehra is the Co Founder of Nino Foods. You can catch Pranav deeply studying his customers wants, needs and behaviours to better their food experiences. Pranav is the go to for all things marketing, branding and business development. \nPreviously, Pranav founded a talent placement platform for the Film and Entertainment Industry and also led online revenue for Disney UTV and Condenast in India. \nPranav is an Indiana Alumni with a BA in Telecommunications and Psychology",
            "linkedin": "https://www.linkedin.com/in/pranav-mehra/"
        }
    ],
    "status": true,
    "generated_description": "**Nino Foods: Building India’s Fast Food Empire**\n\n**Overview**  \nFounded in 2020 and propelled by the Y Combinator Batch S21, Nino Foods is on a mission to dominate India’s fast food landscape. With a sleek operation combining quick-service restaurants (QSR) and cloud kitchens, Nino Foods has established itself as a profitable player with an impressive growth trajectory—tripling in size every year.\n\n**What They Offer**  \nNino Foods operates three main brands:\n- **Nino Burgers**\n- **Francesco's Pizzeria**\n- **KHA-Fried Chicken**\n\nTogether, these brands service over 40,000 orders per month across 25 locations in Mumbai and boast industry-leading payback periods on their investments (less than one year).\n\n**Leadership**  \nThe company is helmed by co-founders Nishant, an INSEAD MBA graduate, and Pranav, who has a background in driving online revenue for heavyweights like Disney and Conde Nast in India. Their combined expertise positions Nino Foods at the forefront of innovation and quality in the food service sector.\n\n**Growth & Market Reach**  \nWith a robust team of 250 employees and a firm foothold in the Mumbai market, Nino Foods has already garnered over 1 million happy customers. Their focus on maintaining high service standards has earned them a staggering number of positive reviews. The combination of quality food and strategic locations has made them a go-to choice among fast food enthusiasts in the region.\n\n**Franchise Opportunities**  \nNino Foods is actively looking to expand its franchising opportunities. If you’re interested in joining their fast-growing network, they invite potential franchise partners to reach out via their website.\n\n**Website**: [Nino Foods](https://eatnino.com)  \n**Tags**: Ghost kitchens, Delivery, E-commerce, Food & Beverage\n\nIn a nutshell, Nino Foods is not just a name in the fast food industry; it's a rapidly evolving empire ready to reshape how India eats. If you love burgers, pizzas, or fried chicken, their brands are definitely worth a try.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/9ca09c4d351ed06389c86b6071d4f0267d021b71.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191600Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=9172d91f145d387834ef31f0b7bbeb7be88b6f27f74b058b1b2066fcf3a5f1b5",
    "social_links": [],
    "logo_path": "data/logos\\Nino_Foods_logo.png"
}