{
    "links": "https://www.ycombinator.com/companies/nomic-bio",
    "name": "Nomic Bio",
    "headline": "Nomic is doing for proteins what Illumina has done for DNA",
    "batch": "W20",
    "description": "Nomic is doing for protein profiling, what Illumina did for DNA sequencing. Our core technology, the nELISA, is a next-gen immunoassay platform that transforms the ELISA into a high-throughput, high-content, and high-versatility tool. \r\n\nToday we developed the nELISA for high-throughput drug discovery scientists, enabling them profile 100s of proteins at 10x higher throughput and 10x lower cost compared to existing solutions. We're offering the nELISA through early access programs to HTS groups in top pharmas as well as pioneering biotechs in the space.\r\n\nOur goal is to create a ubiquitous technology that consolidates the broad range of legacy immunoassay toolkits that scientists use today with a single platform that can carry the science end-to-end, from discovery all the way to the clinic. \r\n\nWe're a team of engineers, biologists, and highly-skilled lab operators that are looking to grow quickly to keep up with customer demand but also to continue developing our core technology, scale our multiplexing/throughput, and build our software stack. We're hiring on a number of positions including engineering, software, biology, and ops. Come talk to us!",
    "activity_status": "Active",
    "website": "http://www.nomic.bio",
    "founded_date": 2017.0,
    "team_size": 24.0,
    "location": "Montreal, Canada",
    "group_partner": "Jared Friedman",
    "group_partner_yc": "https://www.ycombinator.com/people/jared-friedman",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:nanotechnology",
    "founders": [],
    "status": true,
    "generated_description": "**Nomic Bio: A New Era in Protein Profiling**\n\nFounded in 2017 and hailing from the vibrant city of Montreal, Canada, Nomic Bio is carving a niche in the proteomics space—basically, it’s doing for proteins what Illumina accomplished for DNA. With a motto that echoes this ambition, Nomic Bio is on a mission to revolutionize protein profiling through its innovative nELISA platform. \n\n### The nELISA Revolution\n\nThe core of Nomic’s technology is the nELISA, a next-generation immunoassay platform that elevates traditional ELISA (enzyme-linked immunosorbent assay) into a high-throughput, cost-effective, and versatile powerhouse. Imagine being able to profile hundreds of proteins at a staggering 10 times the throughput and with 10 times the cost efficiency compared to older methods. That's what Nomic offers—and they're not just talking the talk. Their technology has already caught the attention of major pharmaceutical companies and pioneering biotechs who are eager to participate in their early access programs.\n\n### Transforming the Laboratory Landscape\n\nNomic Bio aims to unify the disparate immunoassay tools currently in use, creating a single platform that can streamline the entire journey from discovery in the lab to application in the clinic. This is a game changer for high-throughput drug discovery scientists, who can now harness a seamless process to deepen their insights into the proteome.\n\n### Growing Talent for Expanding Needs\n\nAs a company that's scaling rapidly to meet the growing demand, Nomic is actively hiring across various roles including engineering, software development, biology, and operations. This attention to talent reflects their commitment not only to customer satisfaction but also to the continuous development and enhancement of their technology and software.\n\n### The Data, the Team, and the Vision\n\nNomic is backed by a skilled team of engineers, biologists, and lab operators, all united under the leadership of their Group Partner, Jared Friedman. As of now, they boast a nimble team of around 24 employees who are passionate about expanding access to protein profiling while pushing the boundaries of what’s possible in the realm of proteomics. \n\nIf you’re interested in exploring cutting-edge technology or even considering joining their mission, Nomic is on the lookout for fresh talent. Check out their opportunities and learn more about their vision of transforming drug discovery and clinical diagnostics on their website: [Nomic Bio](http://www.nomic.bio).\n\nIn a nutshell, Nomic Bio is not just a company; it's a wave of innovation aimed at unlocking the secrets of the proteome, making high-throughput protein analysis accessible and efficient. They are set to redefine how science is done in this arena, ensuring that what’s been locked in the legacy systems can now be explored with unprecedented ease.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/0a2a5d5688ae206159cf9c0986d576e48e443940.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191600Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=283c322a73c2cbd5b4a7d07584ffd9185a09abeae765650da0161c3da7fbef63",
    "social_links": [
        "https://www.linkedin.com/company/nomicbio",
        "https://twitter.com/nomicbio",
        "https://github.com/nplexbio"
    ],
    "logo_path": "data/logos\\Nomic_Bio_logo.png"
}