{
    "links": "https://www.ycombinator.com/companies/nomod",
    "name": "Nomod",
    "headline": "The payment links app to sell anything, anywhere",
    "batch": "S21",
    "description": "Nomod is a financial services software business based in London. Our payment processing apps replace legacy card terminals allowing merchants to process in-person and online payments on their iOS or Android device with no extra hardware. Our differentiated approach directly serves the merchant and scales rapidly across geographies and verticals.",
    "activity_status": "Active",
    "website": "https://nomod.com",
    "founded_date": 2019.0,
    "team_size": 25.0,
    "location": "London, United Kingdom",
    "group_partner": "Brad Flora",
    "group_partner_yc": "https://www.ycombinator.com/people/brad-flora",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:payments",
    "founders": [
        {
            "name": "Omar Kassim, Founder",
            "description": "Omar is the Founder and CEO of Nomod. Omar previously founded and exited JadoPado, a highly regarded MENA e-commerce technology platform, to Noon.com in 2017. Omar has a BsC in Electronics Engineering and Business Studies from the University of Warwick, UK",
            "linkedin": "https://www.linkedin.com/in/okassim/"
        }
    ],
    "status": true,
    "generated_description": "**Nomod: Revolutionizing Payments Globally**\n\nFounded in 2019 and based in London, Nomod has quickly positioned itself as a key player in the fintech space, specifically focusing on payment solutions. Part of Y Combinator's S21 batch, Nomod aims to provide merchants with a seamless way to process payments anywhere, anytime—whether online, in-person, or through mobile devices. \n\n### Mission\nNomod's mission is clear: to enable businesses to sell anything and accept payments anywhere through user-friendly payment links.\n\n### Solution Overview\nNomod replaces traditional card terminals with a financial services software solution that operates solely through smartphones—no extra hardware is necessary. This approach allows merchants to accept payments using their iOS or Android devices, which is not only more convenient but also scalable across diverse business verticals and geographical locations. \n\n### Key Features\nNomod offers a myriad of features designed to simplify payment processing for merchants:\n- **Payment Links**: Create easy-to-share links for online payments.\n- **Multi-Currency Support**: Accept payments in over 135 currencies, letting customers pay in their native currency.\n- **In-Person Payments**: Use tap-to-pay technology or simply scan cards to process transactions.\n- **Two-Day Payouts**: Quick access to funds, improving cash flow.\n- **Team Functionality**: Allow multiple team members to process transactions via their phones.\n- **Seamless Reporting**: Monitor transactions and manage customer relationships effortlessly.\n\n### Team and Leadership\nNomod operates with a compact yet effective team of 25 people, showcasing an agile structure that can adapt quickly to market needs. The company is supported by Group Partner Brad Flora, whose insights and guidance are instrumental in its growth.\n\n### Target Industries\nNomod serves a broad range of industries, including:\n- **Retail**\n- **Food & Beverage**\n- **Healthcare**\n- **Beauty & Wellness**\n- **Events**\n- **Travel**\n\nThis versatility underscores Nomod’s ability to cater to various business types, from a local café to a large event management company.\n\n### Competitive Edge\nNomod stands out in the crowded fintech landscape with its hyper-competitive pricing model, straightforward user interface, and fast onboarding process. It emphasizes a commitment to transparency, ensuring users understand their costs without hidden fees.\n\n### Conclusion\nNomod is positioned to disrupt traditional payment systems by providing adaptable, smartphone-based solutions that empower merchants to thrive in an increasingly digital economy. With its innovative approach, Nomod is ready to capture the next billion businesses, proving that technology can simplify the complexities of payment processing.\n\nFor more information or to start using Nomod, visit their website: [Nomod.com](https://nomod.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/ff48c246b1ff1846180db3cba7e6d7597a425afa.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191600Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=c133fc0e443dc2352c8b95ce39b0157aba9dc446c23cc715dfbf140b41af9d2e",
    "social_links": [
        "https://www.linkedin.com/company/nomod/",
        "https://twitter.com/nomod"
    ],
    "logo_path": "data/logos\\Nomod_logo.png"
}