{
    "links": "https://www.ycombinator.com/companies/noredink",
    "name": "NoRedInk",
    "headline": null,
    "batch": "IK12",
    "description": "NoRedInk builds stronger writers through interest-based curriculum, adaptive exercises, and actionable data. We're in over 10,000 schools, and students have answered over 2 billion questions on our platform.\n\nBased in San Francisco, NoRedInk was founded in 2012 and is backed by top-tier investors, including: True Ventures, Google Ventures, Learn Capital, Kapor Capital, Social Capital and ImagineK12.\n\nWe are a team of ~50 people with a deep commitment to unlocking every writer’s potential. We have a strong remote culture; many of our jobs are remote-friendly. Check out our current openings at: https://www.noredink.com/jobs",
    "activity_status": "Active",
    "website": "http://www.noredink.com",
    "founded_date": null,
    "team_size": 11.0,
    "location": "San Francisco",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "location:san-francisco-bay-area",
    "founders": [],
    "status": true,
    "generated_description": "**NoRedInk: Cultivating Strong Writers Through Engaging Technology**\n\nFounded in 2012 and based in San Francisco, NoRedInk is on a mission to foster strong writing skills across the education system. With backing from prominent investors like True Ventures, Google Ventures, and Y Combinator’s ImagineK12, the company has made impressive strides in the realm of educational technology. \n\nThe platform is already making waves in over 10,000 schools, where students have tackled over 2 billion questions. At its core, NoRedInk builds its curriculum around student interests, utilizing adaptive exercises and actionable data to engage learners from Grades 3 to 12. This helps educators tailor their instruction to meet individual needs—crucial given the diverse learning styles in today's classrooms.\n\nA standout feature is their AI-powered Grading Assistant, which streamlines the grading process for teachers, reportedly cutting grading time by 40%. This frees up valuable time for instructors to either focus on personalized instruction or engage with students more directly. \n\nWith a compact team of about 50 members, NoRedInk embraces a robust remote culture, prioritizing flexibility and adaptability in its workforce. They aim to unlock every writer's potential, proving that learning can be both enjoyable and effective.\n\nThe platform's recent updates include Originality Insights, which helps educators monitor student writing habits, ultimately fostering creativity and academic integrity. With engaging, personalized content that reflects students' interests—be it their favorite celebrities or hobbies—learning grammar and writing becomes a more dynamic experience.\n\nFor teachers and students alike, NoRedInk represents a significant leap forward in writing education. It combines robust technology with a keen understanding of pedagogical needs, ensuring that students are not just learning but mastering essential skills. You can find more about NoRedInk and explore their offerings by visiting their [website](http://www.noredink.com) or checking out their [career opportunities](https://www.noredink.com/jobs).",
    "logo": "/logos/medium/missing.png",
    "social_links": [
        "https://www.crunchbase.com/organization/noredink",
        "https://github.com/NoRedInk"
    ]
}