{
    "links": "https://www.ycombinator.com/companies/novatr",
    "name": "Novatr",
    "headline": "Online cohort based courses for architects, engineers and designersâ\u0080¦",
    "batch": "S21",
    "description": "Novatr (YC S21) offers online cohort-based courses for architects, engineers and designers in the AEC industry to advance their professional growth. We serve learners from 45+ countries including India, MENA, USA, Europe, and SEA. Our courses are delivered by professionals from global firms like Autodesk, BIG, Google, UNStudio, AECOM, and graduates are placed at top-tier architecture firms, construction companies and real estate companies.\r\n\nProject-based learning and peer-to-peer interaction in cohort makes learning enriching and increases the completion rates to 84%. Learners work in groups of 2-6 on live projects and create significant outputs from scratch.\r\n\nThe company is led by alumni of SPA Delhi and IIT Madras.",
    "activity_status": "Active",
    "website": "https://www.novatr.com",
    "founded_date": 2021.0,
    "team_size": 180.0,
    "location": "Gurugram, India",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:education; industry:elearning",
    "founders": [
        {
            "name": "Harkunwar Singh, Founder",
            "description": "Founder | CEO | Romanticist\n\nâ\u0097\u008b Second-generation architect, passionate about design, technology, the future of learning\nâ\u0097\u008b High Jump Athlete\nâ\u0097\u008b Go-getter",
            "linkedin": "https://www.linkedin.com/in/harkunwar-oneistox/"
        },
        {
            "name": "Vipanchi Handa, Founder",
            "description": "Founder | COO | Frugal Innovator \n\nâ\u0097\u008b Passionate about the intersection of design and technology.\nâ\u0097\u008b Part of the IIM B Goldman Sachs 10K Cohort 6 and Lead Tribe by Blume Ventures.\nâ\u0097\u008b Certified workaholic who is always up for a game of basketball.",
            "linkedin": "https://in.linkedin.com/in/vipanchi-handa"
        },
        {
            "name": "Chaithanya Murali, Founder",
            "description": "Founder | CMO | Empathetic\n\nâ\u0097\u008b Architect by degree with proven experience in scaling early stage startups. \nâ\u0097\u008b Passionate about career development. Established placement cell at my grad school.\nâ\u0097\u008b Rover and a proactive monopoly player.",
            "linkedin": "https://www.linkedin.com/in/chaithanya-murali-23b235139/"
        }
    ],
    "status": true,
    "generated_description": "**Novatr: Empowering the Next Generation of AEC Professionals**\n\nFounded in 2021, Novatr (originally Oneistox) is an innovative startup from Y Combinator Batch S21 based in Gurugram, India. Its mission? To deliver transformative online, cohort-based courses for architects, engineers, and designers in the Architecture, Engineering, and Construction (AEC) sector. With a global reach, Novatr serves learners from over 45 countries, including India, MENA, the USA, Europe, and Southeast Asia.\n\n### Learning with Purpose\n\nAt Novatr, education isn’t just theoretical. They focus on project-based learning and peer interaction, which boosts completion rates to an impressive 84%. Small groups of 2-6 participants tackle live projects, simulating real-world situations to create substantial outputs from scratch. This hands-on approach prepares learners effectively for the complexities of the AEC industry.\n\n### Courses Offered\n\nNovatr offers various courses designed to equip professionals with essential skills:\n\n- **BIM for Architects** – Understanding Building Information Modeling for architects.\n- **Master Computational Design** – Advanced computational skills for design.\n- **BIM for Civil Engineers** – Specializing in BIM for civil engineering practices.\n- **Advanced Interior Design with AI** – Integrating artificial intelligence into interior design.\n- **BIM Professional Course for MEP Engineers** – Specialized training for mechanical, electrical, and plumbing (MEP) engineers.\n\n### Strong Industry Ties\n\nThe courses are delivered by seasoned professionals from leading firms like Autodesk, Google, and AECOM. Graduates of the programs find themselves well-placed, landing jobs at top-tier architecture and construction companies.\n\n### Excellent Placement Assistance\n\nWith a staggering 93% placement rate, Novatr doesn't just stop at teaching. They help learners network with industry giants, preparing them for interviews and guiding them toward lucrative job offers. Graduates see significant salary hikes, averaging around 60%.\n\n### A Tech-First Approach\n\nNovatr is here to reshape AEC education through tech-first methodologies. They employ gamified learning experiences that engage learners in ways traditional methods can’t. From interactive live sessions to personalized feedback, every aspect of Novatr's education model is built to maximize student engagement and success.\n\n### Leadership and Team\n\nThe company is led by alumni from respected institutions like SPA Delhi and IIT Madras, boasting a dedicated team of 180 employees poised to make an impact in the education industry.\n\n### Closing Thoughts\n\nWhether you're an aspiring architect, a civil engineer, or a design professional, Novatr is your ally in navigating the complexities of the AEC landscape. By offering tailored courses taught by industry veterans, Novatr prepares you not just to compete, but to thrive in your career.\n\nFor anyone looking to elevate their skills and step into a promising future within the AEC industry, Novatr is worth exploring. Visit their website at [novatr.com](https://www.novatr.com) to learn more and get started on your journey today.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/5c9924975c9ff7bb66786df023bcc3cfe04d0386.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191602Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=539398d1f379bc752d9512a8a03102c51763d07ec6ce444204b9abe488e3a8fc",
    "social_links": [
        "https://www.linkedin.com/company/novatr",
        "https://twitter.com/oneistox_",
        "https://www.facebook.com/novatr/",
        "https://github.com/oneistox"
    ],
    "logo_path": "data/logos\\Novatr_logo.png"
}