{
    "links": "https://www.ycombinator.com/companies/nova-credit",
    "name": "Nova Credit",
    "headline": "Bridging a world of consumer-permissioned credit data",
    "batch": "S16",
    "description": "Nova Credit is a consumer-permissioned credit bureau with two products that help businesses make more fair and informed decisions on millions of ‘thin file’, no credit history, or new-to-country applicants. The Credit Passport® unlocks cross-border credit bureau data to help businesses underwrite new-to-country newcomer populations. The Cash Atlas™ provides greater insight into the cash flows of any applicant, including verifying their income with greater precision than alternatives. Businesses use these products to approve more applicants without taking on more risk, and consumers are empowered to put their best foot forward in their applications. The company’s differentiated data sources and proprietary analytics are used by leading organizations like American Express, Verizon, HSBC, SoFi, and Yardi. Nova Credit is backed by investors including Kleiner Perkins, General Catalyst, Index Ventures, and Canapi as well as executives from Goldman Sachs, JPMorgan, and Citi. Learn more at www.novacredit.com or reach out to connect@novacredit.com.",
    "activity_status": "Active",
    "website": "http://www.novacredit.com/",
    "founded_date": 2016.0,
    "team_size": 100.0,
    "location": "San Francisco",
    "group_partner": "Jared Friedman",
    "group_partner_yc": "https://www.ycombinator.com/people/jared-friedman",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; location:san-francisco-bay-area",
    "founders": [],
    "status": true,
    "generated_description": "**Nova Credit: Bridging the Credit Gap for Newcomers**\n\nFounded in 2016 and hailing from the San Francisco Bay Area, Nova Credit has been carving out a niche in the financial technology (fintech) space. Its mission? To bridge the gap created by fractured credit histories, especially for those who are new to the U.S. market. Think of Nova as a modern-day credit bureau, but with a twist—it's consumer-permissioned, meaning individuals can share their credit data on their own terms.\n\nAt the heart of Nova’s offering are a couple of standout products: \n1. **Credit Passport®** - This tool allows companies to tap into cross-border credit data, providing a pathway for newcomers to be underwritten fairly based on their financial histories, no matter where they came from.\n2. **Cash Atlas™** - It delves deeper into applicants' cash flows, enhancing income verification and giving businesses a clearer picture of an individual's financial health.\n\nThese tools enable businesses—ranging from banks to fintech companies—to widen their applicant pools without exposing themselves to undue risk. It’s a win-win; businesses can approve more applications, and consumers have the opportunity to showcase their creditworthiness right from the outset.\n\nSince its inception, Nova Credit has teamed up with big names like American Express, HSBC, and SoFi, leveraging its unique data sources and analytics. The company has also garnered impressive backing from investors such as Kleiner Perkins and General Catalyst, which shines a light on its potential.\n\nWith a team of 100 talented employees led by Jared Friedman, Nova Credit is making strides in a space that desperately needs innovation. They are part of Y Combinator's Batch S16, a clear indicator of their startup spirit and ambition.\n\nIf you’re a newcomer to the U.S. or a business looking to assess credit risk more accurately, Nova Credit might just be the solution you’ve been searching for. The future of inclusive finance is knocking, and Nova is ready to answer the door. For more information or inquiries, visit their website at [novacredit.com](http://www.novacredit.com/) or connect with them at connect@novacredit.com.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/8f4123cffc768f629243e2e3380945a2b37b8a28.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191602Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=0d0a69440a536d151172e2cefccd86e1abeaef4b5a9c46bd0a5e927208d2c8a8",
    "social_links": [
        "https://www.linkedin.com/company/nova-credit-inc./",
        "https://twitter.com/nova_credit",
        "https://www.facebook.com/novacredit",
        "https://www.crunchbase.com/organization/nova-credit",
        "https://github.com/neednova"
    ],
    "logo_path": "data/logos\\Nova_Credit_logo.png"
}