{
    "links": "https://www.ycombinator.com/companies/nowports",
    "name": "Nowports",
    "headline": "The core engine of supply chain in LATAM",
    "batch": "W19",
    "description": "Nowports is the first digital Freight Forwarder shipping ocean containers to and from Latin America. One out of every two containers gets lost or delayed due to miscommunication and lack of management. The platform reduces human mistakes to 0% and saves up to 40% of delays with Nowports models and algorithms. Nowports assist companies so moving ocean containers is fast, simple and secure.",
    "activity_status": "Active",
    "website": "https://nowports.com/",
    "founded_date": 2018.0,
    "team_size": 550.0,
    "location": null,
    "group_partner": "Dalton Caldwell",
    "group_partner_yc": "https://www.ycombinator.com/people/dalton-caldwell",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": null,
    "founders": [
        {
            "name": "Maximiliano Casal, Founder",
            "description": "Co-founder & COO Nowports\nBachelor Computer Engineering",
            "linkedin": "https://www.linkedin.com/in/maxcasal/"
        },
        {
            "name": "Alfonso de los Rios Villareal, Founder/CEO",
            "description": null,
            "linkedin": "https://www.linkedin.com/in/alfonso-de-los-rios-24a3a713a/"
        }
    ],
    "status": true,
    "generated_description": "Nowports is carving out a unique niche in the logistics landscape of Latin America. Founded in 2018 and a proud member of Y Combinator Batch W19, Nowports has positioned itself as the first fully-digital freight forwarder in the region, specifically handling ocean containers. The company's mission is ambitious: to streamline and centralize the supply chain processes across Latin America, addressing a significant pain point in the industry—communication failures and delays that often lead to containers getting lost or delayed. In fact, about 50% of containers face such issues due to inefficiencies.\n\nThe platform employs advanced models and algorithms, effectively eliminating human errors and reducing delays by up to 40%. It’s not just about moving containers; Nowports provides a comprehensive solution that includes expedited transport options—air, sea, and land—as well as cargo insurance and real-time tracking, ensuring that shipments are always protected and visible.\n\nLocated in Mexico and boasting a team of over 550 employees, Nowports leverages technology to enhance operational visibility, offering services that not only centralize logistics operations but also assist businesses in their supply chain management. The platform provides functions such as document management, alerts for shipment updates, and tracking capabilities that dramatically improve the logistics experience.\n\nBeyond just transportation, Nowports also recognizes the financial hurdles businesses face. They offer various financial products, including inventory financing and factoring, making it easier for companies to manage cash flow while scaling their operations.\n\nThe feedback from clients is overwhelmingly positive. Businesses appreciate the personalized service, operational flexibility, and technological support provided by Nowports. From real-time tracking to efficient documentation processes, the forwarder is enabling companies in Latin America to navigate international trade with greater confidence and reduced friction.\n\nIn sum, Nowports isn't just simplifying the logistics process; it's redefining it for an entire region that has been traditionally bogged down by fragmentation and inefficiency. With their focus on technology and customer service, they are well-positioned to empower the next generation of businesses in Latin America. If you're in the logistics game and want to elevate your operations, you might want to check out what they offer at [Nowports](https://nowports.com/).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/92cdcb4cc6afba74c5c37329ab1e82ed033c0e80.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191602Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=bcc77448c89077ea3c45c4012c72187d250aa34e78a769df0ce69c82d3271ea7",
    "social_links": [
        "https://www.linkedin.com/company/nowports/",
        "http://twitter.com/nowports",
        "https://www.facebook.com/Nowports/",
        "https://www.crunchbase.com/organization/nowports"
    ],
    "logo_path": "data/logos\\Nowports_logo.png"
}