{
    "links": "https://www.ycombinator.com/companies/oda",
    "name": "Oda",
    "headline": "AI Agent for Home Design",
    "batch": "W20",
    "description": "Oda is an AI agent for home design. Homebuyers and renters alike can use Oda to discover their interior design preferences, apply those preferences to their new home, and then find the best furniture, décor, and appliances aggregated from many different online retailers. Oda distributes its product to homebuyers and renters through partnerships with real estate companies and platforms. Real estate partners add Oda AI iFrames to their websites to showcase listed homes with AI-generated designs. Each AI iFrame is directly linked to an Oda board, allowing consumers to transition from an iFrame to Oda to further personalize the designs and create their dream home.",
    "activity_status": "Active",
    "website": "https://www.odastudio.ai/?ref=yc",
    "founded_date": 2019.0,
    "team_size": 9.0,
    "location": "Los Angeles, CA",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:machine-learning; industry:computer-vision; industry:e-commerce; industry:ai-assistant; location:los-angeles",
    "founders": [],
    "status": true,
    "generated_description": "**Oda: AI-Driven Home Design Made Simple**\n\nFounded in 2019 and hailing from Los Angeles, Oda has quickly emerged as a pivotal player in the intersection of artificial intelligence and home design. Imagine an AI agent that not only helps you figure out your interior design preferences but also empowers you to bring those ideas to life in your new space. That’s Oda in a nutshell—your AI companion in transforming a house or apartment into your dream home.\n\nOda's mission centers on simplifying home design for anyone—from homebuyers to renters. By leveraging AI, the platform helps users discover and refine their unique design aesthetics, sourcing furniture, décor, and appliances from various online retailers. This means no more endless searching across multiple sites to find the perfect couch.\n\nA significant part of Oda's strategy involves partnerships with real estate companies. They embed Oda's AI iFrames into their websites, showcasing AI-generated designs for listings. This seamless integration allows potential buyers or renters to visualize their future homes with personalized designs. Transitioning from the iFrame to Oda allows for deeper customization, making it feel tailored to you.\n\nOperating as a part of Y Combinator’s W20 batch, Oda is currently on a mission to expand its offerings to enterprise customers interested in custom image generation models. It's a bold step that signals their vision for growth and collaboration within the industry.\n\nCurrently, the team consists of nine dedicated individuals, all working to reshape the home design landscape with a blend of machine learning, computer vision, and e-commerce solutions. With a thriving online community, Oda has generated over 1 million designs, attracting more than 10,000 active users who are keen to express their style, inspired largely by platforms like Pinterest.\n\nIf you’re in the market for a new home or simply want to refresh your current space, Oda's approach promises a unique experience. By infusing AI into home design, they are making the pursuit not just easier but enjoyable.\n\nFor those wanting to learn more, check out Oda's offerings at [Oda Studio](https://www.odastudio.ai/?ref=yc). Here’s to building your perfect space, one pixel at a time!",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/5d3fbaa2cbf64a945b713a818c9a011ac9cb4127.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191605Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=16d2e37b128b252c687dfd651cdba1708f970913b610f0e0157a4b2859dfb7a1",
    "social_links": [
        "https://www.linkedin.com/company/odastudioapp",
        "https://twitter.com/odastudioapp",
        "https://www.instagram.com/odastudioai/"
    ],
    "logo_path": "data/logos\\Oda_logo.png"
}