{
    "links": "https://www.ycombinator.com/companies/odys-aviation",
    "name": "Odys Aviation",
    "headline": "Vertical takeoff and landing aircraft for major airlines",
    "batch": "S21",
    "description": "Odys Aviation (formerly Craft Aero) builds vertical take-off and landing aircraft for major airlines. We cut travel time in half on the world’s busiest routes by using city helipads and local airports.  The company founders are electric propulsion and automotive manufacturing experts who have spent their careers electrifying transportation systems at Virgin Hyperloop, GoogleX, Volvo, and Fisker Automotive. We’ve won two USAF Agility Prime contracts, have pre-orders and options for more than 1,000 aircraft.",
    "activity_status": "Active",
    "website": "https://www.odysaviation.com/",
    "founded_date": 2019.0,
    "team_size": 11.0,
    "location": "Los Angeles, CA",
    "group_partner": "Michael Seibel",
    "group_partner_yc": "https://www.ycombinator.com/people/michael-seibel",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:hard-tech; industry:airplanes; industry:climate; location:los-angeles",
    "founders": [
        {
            "name": "James Dorris, Founder",
            "description": "Prior to founding Odys Aviation (formerly Craft Aero), James held leadership roles at GoogleX, Virgin Hyperloop One, and Arrivo. He started his career in Fusion Energy Research at the MIT PSFC and has long been passionate about improving sustainability and efficiency of transportation systems. As employee 20 at Virgin Hyperloop One, he was responsible for building & leading the propulsion and levitation teams & tech.",
            "linkedin": "https://www.linkedin.com/in/jdorris3/"
        },
        {
            "name": "Axel Radermacher, Founder",
            "description": "Axel Radermacher has spent his career advancing transportation by bringing together technology, design, and business.  At Odys, his core mission is assuring the product and the company exceed the needs of the customer and the market.  Previously, as Karma's Chief Vehicle Engineer for EV Platforms, he found the perfect balance between technology, comfort, and beauty.  In other roles, he electrified and redefined sports cars, trucks, and off-road vehicles.",
            "linkedin": "https://www.linkedin.com/in/axel-radermacher/"
        }
    ],
    "status": true,
    "generated_description": "**Odys Aviation: Redefining Vertical Air Travel**\n\nFounded in 2019, Odys Aviation, previously known as Craft Aero, is pioneering a new wave of air travel with its innovative vertical takeoff and landing (VTOL) aircraft designed specifically for major airlines. The company is based in Los Angeles, California, and its mission is clear: cut travel time in half on some of the world's busiest routes by utilizing city helipads and local airports. This approach not only revolutionizes the travel experience but also significantly reduces carbon emissions.\n\n### The Team Behind the Vision\n\nOdys Aviation's team is a blend of electric propulsion and automotive manufacturing experts, boasting experience from industry giants like Virgin Hyperloop, GoogleX, Volvo, and Fisker Automotive. Their combined expertise has already garnered impressive traction, with two USAF Agility Prime contracts and pre-orders exceeding 1,000 aircraft. The team currently consists of 11 dedicated employees and is supported by Y Combinator's Batch S21, with Michael Seibel as their Group Partner.\n\n### What Makes Odys Unique\n\nOdys Aviation stands out not just as another air-taxi service. Their aircraft is capable of covering distances up to 750 miles and can operate at speeds approaching 345 miles per hour—on par with the fastest jets in its class. This capability means that their operations cover over 52% of domestic US air routes, enhancing connectivity while drastically reducing wait times typically associated with traditional flights.\n\nOne of the key features of Odys' aircraft is its advanced hybrid-electric propulsion system, which allows for fully electric operations for short journeys up to 200 miles, producing zero CO2 emissions. For longer trips, sustainable aviation fuel is used.\n\n### A Sustainable Future\n\nOdys Aviation is committed to sustainability, boasting a staggering 76% reduction in CO2 emissions compared to traditional aircraft. The aircraft employs a blown-wing design for seamless vertical takeoff and landing, offering better control and efficiency without the visual disruption caused by tilting wings or rotors.\n\nThe company is currently gearing up for full-scale prototype test flights by late 2024, aiming for type-certification by late 2026 and commercial operations to commence in 2027. It's a thrilling time for aviation enthusiasts and those advocating for greener alternatives.\n\n### Conclusion\n\nOdys Aviation is at the forefront of a paradigm shift in air travel, looked at not just through the lens of convenience but also sustainability. Their vision of a world where passengers can travel effortlessly and more sustainably is drawing closer to reality. If you’re intrigued by this innovator in aviation, you can check out more on their [website](https://www.odysaviation.com/) and follow their journey. \n\nThe future truly is airborne.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/8378516efb268f70566cb742114372eaff42292c.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191606Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=705fa150bb0720d1a69fccd7e4a748931eb27ad0868cc812e592b1f9fc6b980f",
    "social_links": [
        "https://www.linkedin.com/company/odys-aviation/",
        "https://twitter.com/OdysAviation"
    ],
    "logo_path": "data/logos\\Odys_Aviation_logo.png"
}