{
    "links": "https://www.ycombinator.com/companies/offdeal",
    "name": "OffDeal",
    "headline": "AI-native investment bank for small businesses",
    "batch": "W24",
    "description": "OffDeal is an AI-native investment bank, offering small business owners a faster, cheaper way to sell their companies at premium prices. Our AI technology automates most of the grunt work typically done by analysts at larger Wall Street banks, enabling our in-house M&A advisors to focus more on strategic client interactions, leading to better outcomes for both sellers and buyers.",
    "activity_status": "Active",
    "website": "https://offdeal.io",
    "founded_date": 2023.0,
    "team_size": 2.0,
    "location": "New York",
    "group_partner": "Nicolas Dessaigne",
    "group_partner_yc": "https://www.ycombinator.com/people/nicolas-dessaigne",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:artificial-intelligence; industry:fintech; industry:b2b; industry:smb; location:new-york",
    "founders": [
        {
            "name": "Ori Eldarov, Founder",
            "description": "Founder / CEO @ OffDeal \n\nbuilding an AI-native investment bank for buying and selling small businesses. \nprev. mba @ harvard + couple of startup stints. \nlover of carbs and espresso martinis. avid runner and cyclist.",
            "linkedin": "https://linkedin.com/in/eldarov"
        },
        {
            "name": "Alston Lin, Founder",
            "description": "Founder / CTO @ OffDeal.\n\nPreviously, \nFounder / CTO @ Bizwise, \nSWE / SWE Intern @ Meta, Google, Yelp, PagerDuty, IBM, and Encircle. \nSoftware Engineering @ University of Waterloo.",
            "linkedin": "https://linkedin.com/in/alstonlin"
        }
    ],
    "status": true,
    "generated_description": "**OffDeal: Revolutionizing Small Business Sales with AI**\n\nFounded in 2023 and based in New York, OffDeal is an innovative player in the financial tech landscape, operating as an AI-native investment bank specifically tailored for small businesses. As part of the Y Combinator Batch W24, OffDeal aims to provide small business owners with a streamlined, efficient, and cost-effective way to sell their companies, maximizing sale prices while minimizing traditional headaches.\n\n### Mission\n\nOffDeal’s mission is straightforward: to empower small business owners with the tools to sell their companies quickly and at premium prices. By leveraging advanced AI technology, OffDeal automates the grunt work typically associated with larger Wall Street banks, freeing their M&A advisors to engage more meaningfully with clients. This not only enhances the selling experience but also improves outcomes for both sellers and buyers.\n\n### The Approach\n\nOffDeal utilizes a custom AI algorithm that analyzes over 25,000 past mergers and acquisitions (M&A) transactions to identify the best potential buyers for your business. This results in several key advantages:\n\n- **Higher Sales Prices**: Their AI identifies strategic buyers who appreciate the true value of your business.\n- **Faster Transaction Times**: OffDeal aims to close deals within six months, often securing Letters of Intent (LOIs) in under 60 days.\n- **Increased Confidentiality**: They focus outreach only on vetted, curated buyers, ensuring your privacy is maintained throughout the process.\n\n### The Team and Leadership\n\nWith a lean team of just two members, OffDeal is guided by industry expertise and the leadership of Nicolas Dessaigne as their Group Partner. This compact but skilled team ensures that clients receive personalized attention and strategic guidance.\n\n### Fee Structure and Services\n\nOffDeal operates on a success-based fee model, meaning clients pay only when their business is sold. This aligns the interests of the advisory team with those of the sellers, motivating them to secure the best possible exit value. Their services include:\n\n- **Free Discovery & AI Matching**: Initial evaluations and buyer lists are provided quickly.\n- **Comprehensive Evaluations**: Data-driven insights help prepare businesses for sale.\n- **Expert Guidance**: Ongoing support ensures a smooth transition throughout the selling process.\n\n### Target Market\n\nOffDeal specializes in businesses with annual revenues ranging from $5 million to $100 million and serves various industries through its AI-driven approach. Their focus on small to mid-sized businesses (SMBs) sets them apart from traditional M&A advisors who often cater to larger corporations.\n\n### Conclusion\n\nIn today’s dynamic market, OffDeal offers a fresh approach to business sales, integrating technology with expert human insight. Their commitment to higher offers, quicker sales, and enhanced confidentiality positions them as a reliable partner for small business owners looking to maximize their exit value.\n\nFor more information or to start your journey towards a seamless business sale, check them out at [OffDeal.io](https://offdeal.io).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/4233af156a4768b559f2215dd821c7762927c01e.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191606Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=db59d311307c918740461fd3126c90afbce085cb50d83de5e55f03569c15d5de",
    "social_links": [
        "https://www.linkedin.com/company/offdeal/",
        "https://twitter.com/tryoffdeal"
    ],
    "logo_path": "data/logos\\OffDeal_logo.png"
}