{
    "links": "https://www.ycombinator.com/companies/okcredit",
    "name": "OkCredit",
    "headline": "Simple and secure bookkeeping for Indian businesses.",
    "batch": "S18",
    "description": "Today, over 50 million SMBs issue informal credit in India, This is a hugely manual process which they spend hours tracking, reconciling, and collecting! \r\n\nThe 50M SMBs in India account for 40% of the nation’s GDP. As much as 60% of their sales happen on credit. That’s ~24% of the country’s GDP (500B$) lying on paper!\r\n\nOKCREDIT as a company came into existence to start solving the most important problem of credit recovery in MSMEs. We as first movers developed a bookkeeping app that would help any merchant sitting at the remotest corner of the country with internet connectivity to record his transactions digitally. We helped them track the credit given to their customers and suppliers. With our Okcredit app a merchant can track the amount of credit given, monitor credit limit, send reminders and eventually can collect faster from their customers. So as a company our vision was to bring the data dark merchants onto the digital platform. We have changed the way the MSMEs record the transactions and eased their life today.",
    "activity_status": "Active",
    "website": "https://www.okcredit.in",
    "founded_date": 2017.0,
    "team_size": 70.0,
    "location": "Bengaluru, India",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:finops; industry:fintech; industry:payments; industry:finance; industry:india; industry:smb",
    "founders": [],
    "status": true,
    "generated_description": "**OkCredit: Simplifying Credit Management for Indian SMBs**\n\nFounded in 2017 and based in Bengaluru, OkCredit is on a mission to revolutionize bookkeeping for small and medium-sized businesses (SMBs) in India. The company emerged to tackle a critical issue that impacts around 50 million SMBs, which account for 40% of India’s GDP. The challenge? A cumbersome manual process of managing informal credit that wastes countless hours on tracking and collecting dues.\n\nIn India, around 60% of sales occur on credit, translating to about $500 billion of the economy tied up in informal transactions. This is where OkCredit steps in, offering an innovative digital ledger application that puts credit management right at the fingertips of merchants—no matter where they are in the country.\n\n### How It Works:\n\nThe OkCredit app allows users to digitally record transactions, seamlessly tracking the credit extended to customers and suppliers. Once a merchant sets up their account—something that’s as easy as downloading the app—they can monitor amounts owed, set credit limits, send payment reminders via SMS or WhatsApp, and streamline recovery processes. This makes it an essential tool for any merchant looking to bring their bookkeeping into the digital age without the stress of traditional ledgers.\n\n### Features:\n\n- **User-Friendly Interface**: Designed to be intuitive, even for individuals not well-versed in tech.\n- **Mobile Accessibility**: Available in 11 local languages, ensuring inclusivity across diverse merchants in the country.\n- **Secure and Reliable**: Data safety is paramount, with automatic backups to safeguard information.\n- **Free to Use**: There's no monthly fee, making it accessible to all business owners.\n- **Integrated Collection Reminders**: Automated notifications enhance the chances of timely repayments.\n\n### Growth and Impact:\n\nWith just a team of 70 passionate professionals, OkCredit is making waves across 2,800 cities in India. They’re not just helping merchants digitize their bookkeeping; they are democratizing access to credit management tools, allowing even the smallest businesses to modernize their operations.\n\n### The Founders:\n\nOkCredit was co-founded by Harsh Pokharna (CEO), Aditya Prasad (CTO), and Gaurav Kumar (CPO). Their journey began in the Y Combinator Batch S18, and they have since built a company that deeply understands the stakes and struggles of MSMEs in India.\n\n### Why It Matters:\n\nIn a country where many businesses still operate on informal credit systems, OkCredit is bridging the gap, offering a solution that leverages technology to bring transparency, efficiency, and ease to financial management. They are not only impacting individual merchants' profitability but also contributing positively to the broader economy by enabling better cash flow management.\n\nIn summary, OkCredit is an empowering tool for countless SMBs throughout India—transforming the way they handle credit and fostering greater financial literacy and stability in this dynamic economy.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/ca5fced294843122c1f0876f4c11a7154578b15b.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191607Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=d762a207c90ab3fce453809b67b3eb5dca92e8a28b77fc80998d7e7fedd4a11f",
    "social_links": [
        "https://www.linkedin.com/company/okcredit/mycompany/?viewAsMember=true",
        "https://twitter.com/_okcredit",
        "https://www.crunchbase.com/organization/okcredit-india",
        "https://github.com/okcredit"
    ],
    "logo_path": "data/logos\\OkCredit_logo.png"
}