{
    "links": "https://www.ycombinator.com/companies/omnidock",
    "name": "omnidock",
    "headline": "OS for global e-commerce expansion of brands & manufacturers",
    "batch": "S24",
    "description": "Expanding to other geographies and marketplaces is a massive growth lever for brands and manufacturers, but it’s complex and resource-intensive.\r\n\nOmnidock makes it effortless for merchants to sell on multiple marketplaces by acting as their merchant of record. \r\n\nBrands simply plug into our operating system, which reads their catalog, assesses marketplace eligibility, and auto-launches their products through our pre-vetted marketplace accounts. We handle all transactions on their behalf, removing the challenges and complexities of multi-marketplace selling",
    "activity_status": "Active",
    "website": "https://www.omnidock.com",
    "founded_date": 2024.0,
    "team_size": 3.0,
    "location": "Berlin, Germany",
    "group_partner": "Nicolas Dessaigne",
    "group_partner_yc": "https://www.ycombinator.com/people/nicolas-dessaigne",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:b2b; industry:e-commerce",
    "founders": [
        {
            "name": "Shayan Zakerzadeh, Founder",
            "description": "CEO of omnidock and prior employee #3 and VP Expansion at Razor Group, a Berlin based e-com unicorn. \nI started selling online when I was 15 years old and never stopped after that.",
            "linkedin": "https://linkedin.com/in/shayan-zakerzadeh"
        },
        {
            "name": "Christian Kohrs, Founder",
            "description": "Christian is COO at omnidock. Previously, he led the global logistics team at Razor Group, the world's largest Amazon FBA aggregator. He joined Razor as employee #3 and built the logistics backbone to scale the business across more than 20 online marketplaces, while implementing highly customized ERP and WMS solutions across more than 100 entities and 18 warehouses.",
            "linkedin": "https://linkedin.com/in/christian-kohrs-a760b2117"
        },
        {
            "name": "Sebastian Rödling, Founder",
            "description": "Co-Founder @ omnidock, with a technical background in Computer Science focused on AI and Causality. Previously worked at Lufthansa Industry Solutions, and deeply passionate about tech, programming, and machine learning.",
            "linkedin": "https://www.linkedin.com/in/SebRoe"
        }
    ],
    "status": true,
    "generated_description": "**Omnidock: Simplifying Global E-Commerce Expansion for Brands**\n\nOmnidock is a Berlin-based startup founded in 2024 and has quickly made its mark within the Y Combinator Batch S24. Their mission? To serve as the operating system for brands and manufacturers looking to navigate the complex waters of global e-commerce expansion.\n\nIn a world where selling across multiple marketplaces is often a tangled web of bureaucracy and logistical challenges, Omnidock offers a streamlined solution. They position themselves as the merchant of record, allowing brands to effortlessly sell on multiple platforms. By simply plugging into Omnidock’s operating system, brands can have their catalog assessed for marketplace eligibility and auto-launch their products via pre-vetted accounts—all without the heavy lifting that usually comes with global e-commerce.\n\nWith a small but agile team of just three employees, Omnidock is making it easier for merchants to focus on what they do best: creating great products. They handle all the nuances of multi-marketplace transactions, eliminating the headaches that often accompany expansion efforts. \n\nThe company fits neatly into the B2B and e-commerce categories, addressing the critical need for brands to simplify their selling processes as they scale globally. With Nicolas Dessaigne as their Group Partner, it’s clear they have guidance from experienced hands in the tech and startup scenes.\n\nIn short, Omnidock is poised to be a game-changer for brands looking to broaden their reach without getting bogged down by complexities. For more information, check out their website at [omnidock.com](https://www.omnidock.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/21c1b8f8e6238f248ca9e1b450b415bbad52dcc0.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191608Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=95bb65ecb4390c0e6305fa883487766a2cc554a73163fd578d113ed19adbefdb",
    "social_links": [
        "https://www.linkedin.com/company/omnidock-ycs24"
    ],
    "logo_path": "data/logos\\omnidock_logo.png"
}