{
    "links": "https://www.ycombinator.com/companies/one-degree",
    "name": "One Degree",
    "headline": "One Degree is a nonprofit organization that makes it easy forâ\u0080¦",
    "batch": "W14",
    "description": "One Degree is a technology driven nonprofit organization that helps individuals and families access the resources they need to improve their lives and achieve social and economic mobility. \r\n\nOne Degree's mission is to empower people to create a path out of poverty for themselves and for their communities. Our core product is a web and mobile platform makes it easy for low-income families to find, manage, and review nonprofit and government services. \r\n\nOur platform has become the go-to tool for help-seekers â\u0080\u0093 and the people who support them, such as case managers and social workers â\u0080\u0093 throughout the San Francisco Bay Area and Los Angeles County in California, and in Gainesville, Florida.\r\n\nWe currently operate three major products: the One Degree website and Android and iOS apps. Thousands of people in the Bay Area and Los Angeles rely on One Degreeâ\u0080\u0099s website and apps to access health care, food banks, employment services, and much more. We also support communities around the country to start their own One Degree chapters.",
    "activity_status": "Active",
    "website": "http://1degree.org",
    "founded_date": 2012.0,
    "team_size": 14.0,
    "location": "San Francisco",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:nonprofit; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Rey Faustino, Founder/CEO",
            "description": "Rey Faustino, founder and CEO of One Degree, is committed to ensuring that everyone has access to the vital, life-saving resources they need to achieve social and economic mobility. Rey launched One Degree to ensure that all families have access to services they need to overcome poverty. Rey began his career as a teacher and later was the site director at BUILD, a college access nonprofit organization that propels low-income minority youth to attain a college education.",
            "linkedin": "https://www.linkedin.com/in/reyfaustino/"
        }
    ],
    "status": true,
    "generated_description": "### One Degree: Bridging Resources for Economic Mobility\n\n**Overview**\n\nFounded in 2012 and backed by Y Combinator Batch W14, One Degree is a nonprofit organization based in San Francisco. With a team of 14 dedicated individuals, One Degree strives to ensure that low-income families can easily access essential resources that pave the way for improved social and economic mobility.\n\n**Mission**\n\nThe heart of One Degree's mission is to empower individuals and families in their fight against poverty. They do this by providing a technology-driven platform that connects users to a vast array of nonprofit and government services designed to support personal growth and uplift communities. \n\n**What They Do**\n\nOne Degree operates a web and mobile platform that serves as a critical tool for help-seekers and those who assist them, such as case managers and social workers. The platform, accessible across the San Francisco Bay Area, Los Angeles County, and Gainesville, Florida, features over 26,000 free resources, including healthcare access, food banks, childcare services, and employment assistance. Users can search for resources by area or category for easy navigation.\n\nHere are some resources available through their platform:\n\n- **Health Services**\n- **Food Assistance**\n- **Housing Solutions**\n- **Educational Resources**\n- **Employment Services**\n\nFor those in need, One Degree also offers a unique feature: **text-based resource searches**, allowing users to find help simply by sending a keyword to **844-833-1334**.\n\n**Community Impact**\n\nOne Degree isn't just a resource directory; it is a community-building platform that enables users to share resources with family and friends. It has become the go-to solution for many seeking assistance as they work to improve their circumstances. By supporting communities nationwide to launch their own chapters, One Degree extends its reach and impact beyond California.\n\n**Conclusion**\n\nIn a world where navigating social services can feel overwhelming, One Degree demystifies the process. They’ve built a user-friendly solution that is not only free but also constantly updated, ensuring that people receive accurate information when they need it most. If you’re looking for resources or want to make a difference, check out [One Degree's website](http://1degree.org) and join their mission to uplift communities, one resource at a time.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/c1192873247a9cce3da3566e7a9430e97ec1a0de.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191610Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=d33caebdecbe2d169d12d4e8947ada335bc9a2e5fd524c44e58bb09ccf5989d3",
    "social_links": [
        "http://linkedin.com/company/one-degree-inc-",
        "https://twitter.com/1Deg",
        "https://www.facebook.com/1degree.org/",
        "https://www.crunchbase.com/organization/1degree",
        "https://github.com/1deg"
    ],
    "logo_path": "data/logos\\One_Degree_logo.png"
}