{
    "links": "https://www.ycombinator.com/companies/onebrief",
    "name": "Onebrief",
    "headline": "Onebrief makes military headquarters run seamlessly",
    "batch": "S21",
    "description": "Virtually everything in the military requires a plan—from everyday operations to war-time missions. With a rigorous process, many stakeholders, and rudimentary software (PowerPoint!!), planning is very slow. \r\n\nOnebrief is a collaborative software designed to make military planning fast. It turns every input into reusable building blocks and automatically keeps all planning artifacts in sync.",
    "activity_status": "Active",
    "website": "https://onebrief.com",
    "founded_date": 2019.0,
    "team_size": 11.0,
    "location": "Austin, TX",
    "group_partner": "Brad Flora",
    "group_partner_yc": "https://www.ycombinator.com/people/brad-flora",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:saas; industry:govtech; location:austin",
    "founders": [
        {
            "name": "Grant Demaree, Founder",
            "description": "Before I moved to Austin to co-found Onebrief (https://onebrief.com), I spent 5 years as an Army officer. I was part of the Army's counter-Ebola efforts in Liberia and counter-ISIS campaign in Iraq. I studied Nuclear Engineering and International Relations at West Point.",
            "linkedin": "https://www.linkedin.com/in/gkdemaree/"
        },
        {
            "name": "Rafa Pereira, Founder",
            "description": "As a kid, my dream was to become an inventor. I realized that dream through software engineering and entrepreneurship. I started working early, while I was still a teenager. The first app I built for money was a CGI/Perl website, in 1999.  After that, I never stopped. Somehow, I still managed to finish my BS and MBA degrees along the way. Before founding Onebrief, I was Director of Product Engineering at data.world/TX and VP of Engineering at IAC/NY.",
            "linkedin": "https://linkedin.com/in/rflprr"
        }
    ],
    "status": true,
    "generated_description": "### Onebrief: Revolutionizing Military Planning\n\n**Overview**  \nFounded in 2019 and hailing from the Y Combinator Batch S21, Onebrief is on a mission to streamline military operations through innovative planning software. Based in Austin, Texas, this SaaS startup is tackling a serious problem: the military's historically cumbersome planning processes, often bogged down by outdated tools like PowerPoint. By transforming military planning into a collaborative, efficient workflow, Onebrief is bringing modern solutions to a critical need.\n\n**The Problem**  \nMilitary operations, whether day-to-day or in times of conflict, rely heavily on meticulous planning. Unfortunately, traditional methods can be slow and arduous, requiring coordination among multiple stakeholders and clunky software that doesn’t lend itself to quick adjustments or real-time updates.\n\n**The Solution**  \nOnebrief is designed to flip the script. Their platform turns planning input into reusable building blocks, ensuring that all planning artifacts are always in sync. This means faster decision-making and more effective collaboration among teams. The software enables military personnel to draft, modify, and finalize plans in hours, not days.\n\n**Key Features**  \n- **Real-Time Collaboration**: Gone are the days of endless emails and file shuffling. Onebrief allows users to work together effortlessly.\n- **Data Visualization and Analysis**: Users can quickly identify trends and insights from structured data, leading to more informed decisions.\n- **Creative Support Tooling**: The platform helps solve unstructured problems, speeding up the ideation phase.\n- **Efficient Planning Hub**: Users can execute all workflows from a single interface, drastically reducing turnaround times.\n\n**User Testimonials**  \nThe response from military officials has been overwhelmingly positive:\n- A senior NSC official labeled it a “game-changer.”\n- Users report completing tasks at least twice as fast as before.\n- Feedback from various command staff highlights Onebrief's drastic improvement over traditional planning methods.\n\n**Team and Vision**  \nWith a dedicated team of 11 employees guided by their Group Partner, Brad Flora, Onebrief is not just building software; they are redefining how military strategies are crafted and executed. Their vision extends beyond mere efficiency; they aim to empower military staff across all levels to make decisions rapidly and effectively—at the speed of war.\n\n**Conclusion**  \nIn a world where rapid response can make all the difference, Onebrief is positioning itself as a crucial ally to military planners everywhere. If you’re looking to help transform military operations, this is one platform that promises real impact.\n\nTo dive deeper or see the platform in action, check out their website at [Onebrief](https://onebrief.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/07b4d25810c6a1ffab7a3f3e3942f040932d89ce.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191608Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=8980442422a7cb835061ddcffe5250186581543bd019b35df850e504e7e78a5c",
    "social_links": [
        "https://www.linkedin.com/company/onebrief/",
        "https://twitter.com/onebriefapp",
        "https://www.facebook.com/onebrief",
        "https://github.com/Onebrief"
    ],
    "logo_path": "data/logos\\Onebrief_logo.png"
}