{
    "links": "https://www.ycombinator.com/companies/onechronos",
    "name": "OneChronos",
    "headline": "The Smart Market for Institutional Investors",
    "batch": "S16",
    "description": "OneChronos is a U.S. equities ATS designed bottom-up to fundamentally address the growing gap between how trading venues match orders and how traders need to execute.",
    "activity_status": "Active",
    "website": "https://www.onechronos.com/",
    "founded_date": null,
    "team_size": 35.0,
    "location": "New York",
    "group_partner": "Jared Friedman",
    "group_partner_yc": "https://www.ycombinator.com/people/jared-friedman",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:marketplace; industry:ai; location:new-york",
    "founders": [],
    "status": true,
    "generated_description": "**OneChronos: Revolutionizing Trading for Institutional Investors**\n\nOneChronos is like a breath of fresh air in the crowded fintech landscape, presenting itself as \"The Smart Market for Institutional Investors.\" Founded in New York and part of Y Combinator's S16 batch, this innovative U.S. equities alternative trading system (ATS) is tackling the persistent challenges faced by traders in executing their orders. The company, which boasts a lean team of 35 employees under the guidance of Group Partner Jared Friedman, is on a mission to bridge the gap between traditional trading venues and the execution needs of traders.\n\n### What They Do\n\nAt its core, OneChronos employs advanced mathematical optimization to facilitate a new kind of smart market where transactions can happen at a scale and speed previously thought impossible. This isn't your typical ATS. OneChronos conducts point-in-time auctions every 100 milliseconds, enabling innovative features like Expressive Bidding. This allows traders not only to participate but to express their specific execution goals—think of it as bringing the personal touch of voice trading into the fast-paced electronic world.\n\n### Key Features\n\n- **Smart Markets:** By leveraging Nobel Prize-winning auction techniques, OneChronos optimizes order matches to deliver better price improvement, increased liquidity, and fairer trading conditions across all participants.\n  \n- **Expressive Bidding:** This feature grants users the ability to set custom constraints for their trades. Picture a portfolio manager who can buy and sell interconnected assets in a single auction—this reflects the sophistication and security today's data-driven investors demand.\n\n- **Proven Effectiveness:** The use of sophisticated techniques in various industries demonstrates that aiming for mutually beneficial outcomes while reducing agency problems can unlock new trading opportunities. With AI enhancing order matching, OneChronos stands at the forefront of efficiency in financial markets.\n\n### Market Impact\n\nRather than competing on merely price or speed, OneChronos focuses on the underlying principles of fairness and efficiency—providing institutional customers with a trading venue that tailors to their nuanced needs. Their service can adapt to various trading goals, whether it's managing market impact, executing complex multi-security strategies, or finding unique liquidity opportunities that traditional setups might miss.\n\n### Conclusion\n\nIn a world where trading is often perceived as a race to the bottom, OneChronos invites institutional investors to rethink their approach. By embracing cutting-edge technology, they have crafted a platform that promises not only improved execution outcomes but also a more intelligent and customizable trading experience. \n\nIf you're interested in exploring this revolutionary platform further, check out [OneChronos’ website](https://www.onechronos.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/5bf18ceb59cefd8b03f36404b4b44671da76febb.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191609Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=74ae557c35fd38162194fa241b5198f0b226d8f44711d74dbf17ad97d4bf60f1",
    "social_links": [
        "https://www.linkedin.com/company/onechronos/",
        "https://twitter.com/onechronos",
        "https://www.crunchbase.com/organization/one-chronos",
        "https://github.com/onechronos"
    ],
    "logo_path": "data/logos\\OneChronos_logo.png"
}