{
    "links": "https://www.ycombinator.com/companies/onefin",
    "name": "OneFin",
    "headline": "Shopify for Financial Services",
    "batch": "W17",
    "description": "Building a plug-and-play suite of APIs to enable financial inclusion. OneFin is backed by marquee investors from Silicon Valley like Y Combinator, Khosla Ventures, etc. Leading NBFC, SFB and fintech companies in India are our users.\r\n\nWe have enabled loan disbursement/migration of more than $600M in last few years across more than 1 million loans across education loans, EV financing, business loans, credit line, 2 wheeler financing, personal loans, invoice discounting, and various other credit products.",
    "activity_status": "Active",
    "website": "https://www.onefin.in",
    "founded_date": null,
    "team_size": 40.0,
    "location": "Bengaluru, India",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech",
    "founders": [],
    "status": true,
    "generated_description": "**OneFin: Streamlining Financial Services with Flexible Tech**\n\nAt its core, OneFin is like Shopify for financial services. Founded in 2017 and part of the Y Combinator Batch W17, this innovative startup is based in Bengaluru, India. Its mission? To enhance financial inclusion through a robust, plug-and-play suite of APIs that empower banks, NBFCs (Non-Banking Financial Companies), and fintech startups.\n\n**Impressive Track Record**\n\nBacked by notable Silicon Valley investors such as Y Combinator and Khosla Ventures, OneFin has made significant strides in the financial landscape. It has facilitated over $600 million in loan disbursements across more than a million loans. Their diverse offerings span education loans, EV financing, business loans, personal loans, and more, demonstrating their versatility in catering to various financial needs.\n\n**Innovative Products**\n\nOneFin offers an end-to-end system that includes a Loan Origination System (LOS), Loan Management System (LMS), and a powerful API suite that integrates seamlessly with over 70 external services. This flexibility allows clients to customize their workflows on a low-code platform, adapting processes to their specific needs without cumbersome code changes.\n\nSecurity is a top priority, with OneFin implementing bank-grade protocols and robust infrastructure to ensure client data is always protected.\n\n**Why Choose OneFin?**\n\n- **Comprehensive Software Solutions:** Whether it’s loan origination, management, or accounting, OneFin provides all the tools necessary for financial institutions to thrive.\n- **API Integrations:** Over 70 external integrations enable clients to leverage additional services like credit bureaus, KYC verification, and payment gateways.\n- **Client Trust:** With a track record of managing over ₹14,000 crore worth of loans and an annual API call volume exceeding 100 million, OneFin is trusted by leading financial institutions in India.\n\n**Team and Culture**\n\nWith a team of 40, OneFin promotes a culture of collaborative innovation and flexibility, attracting talent from diverse backgrounds, including those with robust fintech experience and educational credentials from top institutions. They emphasize a supportive environment that fosters growth, offering perks like food coupons, travel allowances, and regular appraisals.\n\n**Final Thoughts**\n\nAs OneFin continues to innovate and expand its offerings, it’s clear that the company is reinventing the way financial services operate in India. For those looking to digitize their financial operations, OneFin’s robust technology stack might just be the perfect solution. If you’re interested in exploring their services, you can request a demo at [OneFin's website](https://www.onefin.in).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/761781a984b2bbddb1981e6115c7faa4a615f89f.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191609Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=d38c8da93b9cfe643bcd53ed16c3403ea7eda9be54ebac62defdfbf1bbbcbb49",
    "social_links": [
        "https://www.linkedin.com/company/onefinin/",
        "https://twitter.com/onefindotin",
        "https://www.crunchbase.com/organization/onefin"
    ],
    "logo_path": "data/logos\\OneFin_logo.png"
}