{
    "links": "https://www.ycombinator.com/companies/oneleet",
    "name": "Oneleet",
    "headline": "YC's most popular security compliance platform (SOC 2, ISO 27001,â\u0080¦",
    "batch": "S22",
    "description": "Oneleet helps companies become secure and compliant through an all-in-one solution that combines automated tools and human expertise.\r\n\nOneleet has built the second generation of security compliance automation software, providing tools that go beyond what is classically provided for just compliance alone. Tools like a code security scanner, attack-surface management, access reviews and trust portal are all built in.\r\n\nAs the most popular, highest rated and most frequently used platform in the YC community, Oneleet has quickly established itself as the preferred and superior alternative to other incumbents.\r\n\nThe founder behind Oneleet has spent the past 10+ years helping companies become more secure by performing penetration tests.",
    "activity_status": "Active",
    "website": "https://oneleet.com",
    "founded_date": 2022.0,
    "team_size": 50.0,
    "location": null,
    "group_partner": "Nicolas Dessaigne",
    "group_partner_yc": "https://www.ycombinator.com/people/nicolas-dessaigne",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:saas; industry:b2b; industry:compliance; industry:security; industry:ai",
    "founders": [
        {
            "name": "Bryan Onel, Founder",
            "description": "Penetration Tester with 10+ years of experience helping companies become more secure by simulating advanced attacks. Has experience leading security teams and architecting offensive and defensive security solutions.\n\nBefore pursuing a career in hacking, Bryan studied AI and Medicine.",
            "linkedin": "https://nl.linkedin.com/in/bryan-onel/"
        },
        {
            "name": "Ora Onel, Founder",
            "description": "I have a background in medical genetics. I developed a passion for cybersecurity and decided to start a security company together with my husband.",
            "linkedin": "https://www.linkedin.com/in/ora-touitou/"
        }
    ],
    "status": true,
    "generated_description": "**Oneleet: Simplifying Security Compliance**\n\nFounded in 2022 as part of Y Combinator’s Batch S22, Oneleet has rapidly carved its niche as a leading full-stack cybersecurity platform. The mission? To transform the complex, often frustrating world of security compliance into a manageable, seamless experience for businesses. No one wants to deal with compliance headaches—Oneleet is here to help you focus on what truly matters: your customers.\n\nWhat sets Oneleet apart? It’s not just another compliance tool; it’s the most popular and highest-rated security compliance platform in the Y Combinator community. Leveraging a unique blend of automated tools and human expertise, Oneleet assists companies in achieving compliance with various standards, including SOC 2, ISO 27001, HIPAA, and GDPR, to name just a few.\n\nThe founder, who has over a decade of experience in penetration testing, leads a dynamic team of 50 employees. This breadth of experience informs the development of Oneleet's second-generation compliance automation software. Within this platform, users gain access to innovative tools that stretch beyond mere compliance requirements—like code security scanners, attack-surface management, access reviews, and a comprehensive Trust Center to showcase security posture. \n\nOneleet truly embodies an “all-in-one” philosophy, integrating services such as penetration testing, custom security programs via virtual Chief Information Security Officers (vCISOs), and third-party audits. This makes it easy for startups and growing businesses to navigate their compliance journey without the traditional panic that often accompanies security audits.\n\nWhether you’re a fast-growing startup or an established company, Oneleet's approach is straightforward and effective. They simplify the path to compliance while ensuring real-world security controls are in place, allowing businesses to build trust with stakeholders without succumbing to what some call \"security theater.\"\n\nTo see what Oneleet can do for you, visit their website at [oneleet.com](https://oneleet.com). Here’s the bottom line: effective cybersecurity doesn’t have to be a pain; with Oneleet, it can actually be a smooth, efficient process.\n\nIf you’re ready to get started, book a consultation today, and join the ranks of hundreds of startups trusting Oneleet for their security compliance needs.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/b1d60998f0ef102b447db9dcb24170ddf0fb01d9.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191610Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=4d81b19edd5351672c5cb8b82f96bde3e353677e7c9e992c5a336316899b085c",
    "social_links": [
        "https://linkedin.com/company/oneleet",
        "https://x.com/oneleet"
    ],
    "logo_path": "data/logos\\Oneleet_logo.png"
}