{
    "links": "https://www.ycombinator.com/companies/onestopkitchen",
    "name": "OneStopKitchen",
    "headline": "AI-Driven Tech & Space Optimization to Scale Restaurants",
    "batch": "S21",
    "description": "OneStopKitchen (OSK) offers advanced technology and an innovative model which allows any restaurant to scale to multiple locations at zero cost. OSK offers an entire suite of AI powered advanced restaurant inventory, ops and logistics tech to scale quickly with limited risk. OSK operationalizes underperforming restaurant space and staff to run OSK kitchens which are located in prime downtowns and high walk-in areas. Think of AirBnB for restaurants. OSK is a preferred restaurant partner due to its innovative hyper scalable model. Consumers can mix & match multiple cuisines in a single order for dine in, pick up or delivery.",
    "activity_status": "Active",
    "website": "https://onestopkitchen.com/",
    "founded_date": 2021.0,
    "team_size": 10.0,
    "location": "Sunnyvale, CA",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:ghost-kitchens; industry:e-commerce; industry:ai; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Vijayaraj Gopinath, Founder",
            "description": "Co-Founder of OneStopKitchen.\n\nExperienced X-Google SWE (7+ years), Developed the research Google Maps safety feature which adds safety score (based on crime and other signals) as another weight in the world's road network. X-Nvidia - Project Shield.\n\nCo-Founder of VirtualQueue - GeoFenced dynamic appointment system for job fairs to eliminate long queues.\n\nCo-Founder of HungryGift - Tech enabled merchandising service.\n\nNow building platform which will allow any restaurant to scale at zero cost.",
            "linkedin": "https://linkedin.com/in/vijayarajgopinath"
        },
        {
            "name": "Viggnesh Kandasamy, Founder",
            "description": "Co-Founder of MayaEats.\n\nEngineering Manager with 10+ years of experience in scaling small tech teams to large teams.\n\nCo-Founder of TrackYoga - Successful Yoga app with more than half million downloads. \n\nNow building AI-Driven Tech & Space Optimization to Scale Restaurants",
            "linkedin": "https://linkedin.com/in/viggnesh"
        }
    ],
    "status": true,
    "generated_description": "**OneStopKitchen: Revolutionizing Restaurant Scaling with AI and Space Optimization**\n\nFounded in 2021 and nestled in Sunnyvale, CA, OneStopKitchen (OSK) is on a mission to innovate the restaurant industry through AI-driven technology and space optimization. Imagine a model similar to Airbnb, but for restaurants: OSK empowers eateries to scale effortlessly, allowing them to expand to multiple locations without incurring upfront costs. \n\nAt its core, OSK provides a suite of advanced, AI-powered technology that streamlines restaurant inventory, operations, and logistics. This suite not only minimizes risk but also enables restaurants to operate efficiently from prime locations, turning underperforming restaurant spaces into thriving kitchens. This clever approach means that restaurants can optimize their space and staff in a way that drives performance, much like how a tech startup optimizes its resources.\n\nOne of the standout features of OSK is its flexibility for consumers. Diners can enjoy the unique experience of mixing and matching cuisines in a single order, whether they're dining in, picking up, or having their meal delivered. This kind of convenience aligns perfectly with the evolving expectations of modern eaters.\n\nWith a compact but dynamic team of 10, OSK was part of Y Combinator Batch S21, and the guidance from this premier accelerator speaks to the potential they have unlocked. Their strategic group partner is Nan, which likely aids in navigating the complexities of this innovative business model. \n\nIn the rapidly evolving landscape of the San Francisco Bay Area, OSK is at the forefront, tagged under relevant categories such as 'ghost-kitchens', 'e-commerce', and 'AI'. This positions them as a preferred partner for restaurants aiming to leverage technology in their growth strategy.\n\nIn a nutshell, OneStopKitchen is redefining how restaurants can operate and scale in a market that demands flexibility and efficiency. It’s an exciting time to watch this company as they continue to innovate and expand their footprint in the culinary world. For more information, check out their website: [OneStopKitchen](https://onestopkitchen.com/).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/c350c143f0531abdbbbbad3a564822090c2d1197.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191610Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=31a41c14e6bc50ab5963509c79fe5ed0f58c9cb19ca0fa529327e56d45164947",
    "social_links": [
        "https://www.crunchbase.com/organization/mayaeats"
    ],
    "logo_path": "data/logos\\OneStopKitchen_logo.png"
}