{
    "links": "https://www.ycombinator.com/companies/onetext",
    "name": "OneText",
    "headline": "Frictionless payments via SMS",
    "batch": "W23",
    "description": "OneText is disrupting SMS marketing and payments. We win incremental sales for direct to consumer brands by making every purchase as effortless as paying with your hotel room number. OneText shoppers literally reply and buy with one text.\r\n\nIn our first year, we’ve onboarded 50 fast-growing e-commerce brands and have added as much as 14% in incremental revenue to their bottom lines. In March, we generated $597,000 dollars in payments. In April, we’ll book $50,000 dollars in revenue. \r\n\nFounders Jonathan Fudem/CEO and Daniel Brain/CTO met at PayPal Checkout where we designed and launched some of the world’s best checkout experiences. We left PayPal to build a payments company that actually helps merchants acquire customers and win sales.\r\n\nThe CMO of our largest customer, a $90M clothing brand, says we have revolutionized marketing for his company, and are, quote: “the best thing that’s happened to SMS marketing in forever.”\r\n\nWe are excited to share what you can do with OneText.",
    "activity_status": "Active",
    "website": "https://onetext.com",
    "founded_date": 2021.0,
    "team_size": 6.0,
    "location": "San Jose, CA",
    "group_partner": "Jared Friedman",
    "group_partner_yc": "https://www.ycombinator.com/people/jared-friedman",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:payments; industry:consumer; industry:b2b; industry:e-commerce; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Jonathan Fudem, Founder",
            "description": "Building frictionless payments by SMS @ OneText\n- 🌁San Francisco native\n- 🧱 Previously worked in product at PayPal Checkout\n- ⚔️ Once broke into windmill with a sword\n- 🚀 Future space tourist",
            "linkedin": "http://linkedin.com/in/jonathanfudem/"
        },
        {
            "name": "Daniel Brain, Founder",
            "description": "I'm an engineer, I write code, sometimes that code works!",
            "linkedin": "https://www.linkedin.com/in/bluepnume/"
        }
    ],
    "status": true,
    "generated_description": "OneText is a fintech startup founded in 2021, based in San Jose, CA, and part of Y Combinator Batch W23. Its mission? To revolutionize payments through SMS, turning the checkout process into a frictionless experience that feels as easy as charging something to your hotel room. The founders, Jonathan Fudem (CEO) and Daniel Brain (CTO), previously worked at PayPal Checkout, where they designed some of the world’s most efficient checkout experiences. They left to create a platform that not only simplifies payments but also helps merchants engage with their customers more effectively.\n\nIn just its first year, OneText has made impressive strides, onboarding 50 fast-growing e-commerce brands and contributing up to 14% in additional revenue for these companies. In March alone, they facilitated $597,000 in payments, and have projected $50,000 in revenue for April. It’s no wonder that the CMO of a $90M clothing brand calls them “the best thing that’s happened to SMS marketing in forever,” highlighting their impact in the space.\n\nWhat distinguishes OneText is its unique and straightforward approach: shoppers can literally reply to a text message to make a purchase. The platform integrates smoothly with popular e-commerce solutions like Shopify and WooCommerce, enabling seamless payment processing through methods like PayPal and Stripe. Their tools provide features like \"text-to-buy,\" shopper-specific recommendations, eye-catching campaigns, and AI-powered responses, all designed to increase conversion rates significantly.\n\nCurrently, OneText operates with a lean team of just six employees, but they are backed by notable investors, including partners from Sterling Road, Good Friends (founders of Warby Parker, Allbirds, and Harry's), Helium-3, and Khosla Ventures. They guarantee a 20% increase in revenue per campaign, presenting a compelling proposition for brands looking to enhance their marketing efforts.\n\nIf you're curious about how OneText can work for you, their website [OneText](https://onetext.com) offers features, pricing information, and the option to book a demo. As this company continues to expand its capabilities, it’s clear that the future of shopping and payments is becoming ever more integrated and effortless, thanks to innovations like OneText.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/c377aa470ac2779de3b71970de4ef16494d54de9.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191610Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=d9fcd67bfcf4bac86fe52a6de39cae1e20c14cb8b76d1c04f9853395afc24f7d",
    "social_links": [
        "https://www.linkedin.com/company/shop-with-onetext/",
        "https://twitter.com/OneText"
    ],
    "logo_path": "data/logos\\OneText_logo.png"
}