{
    "links": "https://www.ycombinator.com/companies/onsite-pro",
    "name": "Onsite Pro",
    "headline": "Revolutionizing digital selling within HVAC",
    "batch": "S21",
    "description": "We make contractor proposal creation as simple as checking out of e-commerce. We equip HVAC distributors (who sell HVAC equipment to contractors) with digital catalogs preloaded with pricing, product details, and templates that allow contractors to create a professional proposal in under 10 minutes and sell in-person.",
    "activity_status": "Active",
    "website": "https://onsitepro.co",
    "founded_date": 2021.0,
    "team_size": 3.0,
    "location": "San Francisco",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:construction; industry:b2b; industry:climate; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Gautam Jayaraman, Founder",
            "description": "I co-founded Onsite Pro (S21, formerly known as Greenwork), which is at the intersection of climate and construction.\n\nIn the recent past I've worked on marketplaces with SMBs and local workers (DoorDash, Rickshaw), and experimented with how the marketplace evolves when software/robotics are added in.\n\nI also co-founded Rickshaw (W14) and Jamglue (S06).\n\nFun fact: since 2006, I've worked at five YC-backed companies, and zero non-YC-backed companies.",
            "linkedin": "https://www.linkedin.com/in/gautamj/"
        }
    ],
    "status": true,
    "generated_description": "**Onsite Pro: Revolutionizing HVAC Sales**\n\nFounded in 2021 and based in San Francisco, Onsite Pro is on a mission to revolutionize digital selling in the HVAC sector. Initially designed to simplify contractor proposal creation, Onsite Pro has quickly grown into a vital tool for HVAC distributors, equipping them with digital catalogs that include comprehensive pricing and product information. This enables contractors to generate professional proposals in less than ten minutes, paving the way for more efficient in-person sales.\n\n### What They Do\nAt the core of Onsite Pro’s offering is a platform that transforms how HVAC distributors and their dealers interact with their product catalogs. Here's what makes them standout:\n\n- **Digital Pricebooks:** Onsite Pro eliminates outdated pricing methods (Excel sheets, anyone?) by providing mobile-friendly online pricebooks. This feature not only streamlines the process but also provides a single source of truth for product details, pricing, and availability.\n  \n- **Integrated Proposal Builder:** The proposal creation process is incredibly straightforward. Dealers can quickly assemble their proposals without extensive training, complete with automated data, robust margin controls, upsells, and flexible payment options.\n\n- **Real-Time Insights:** By providing analytics on how a catalog is performing, Onsite Pro allows distributors to understand dealer engagement and sales patterns, allowing for data-driven decision-making.\n\n### Customer Impact\nOnsite Pro's customers are reaping significant benefits. Dealers report boosting their win rates and overall sales performance by leveraging Onsite's user-friendly tools.\n\nLaura Gatza from Gatza Heating & Air exclaimed, \"Onsite enabled our business to create proposals about 1000x faster! It offers us confidence in accuracy and profit margins.\" That's a glowing endorsement, to say the least.\n\n### Team and Background\nWith a lean team of just three employees and backed by Y Combinator's Batch S21, Onsite Pro is making waves in the HVAC landscape. The company is focused on building solid partnerships with HVAC distributors, which not only enhances the tool’s value but also strengthens industry relationships.\n\n### Conclusion\nIf you’re in the HVAC game and looking for a competitive edge, checking out Onsite Pro is a no-brainer. Their platform doesn't just simplify the sales process; it empowers dealers, improves productivity, and ultimately boosts profitability. Interested? You can book a demo on their [website](https://onsitepro.co) and see firsthand how they can transform your business.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/edd502a8229bd03abc8be2a82aedba81677e5db9.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191611Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=270b043c958caa4954215311124e0dbda3307d9af3442344491c3eb1f020c961",
    "social_links": [
        "https://linkedin.com/company/onsiteproco/"
    ],
    "logo_path": "data/logos\\Onsite_Pro_logo.png"
}