{
    "links": "https://www.ycombinator.com/companies/onyx-private",
    "name": "Onyx Private",
    "headline": "A modern and more accessible private bank for the new generation",
    "batch": "W22",
    "description": "Onyx is a modern, accessible private bank for the next generation of affluent young professionals. We offer a unified digital-native premium banking and wealth management experience tailored for the overlooked groups of young high-earners and illiquid entrepreneurs, investors, and tech employees. Onyx aims to be the next-generation UBS.",
    "activity_status": "Active",
    "website": "https://www.onyxprivate.com",
    "founded_date": 2021.0,
    "team_size": 10.0,
    "location": "Miami, FL",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech",
    "founders": [
        {
            "name": "Victor Santos",
            "description": "Serial fintech entrepreneur. UC Berkeley graduate and ex-Googler recognized as a Forbes 30 Under 30 Social Entrepreneur and MIT Technology Review 35 Under 35 Innovator in LATAM for founding Airfox later renamed  banQi - a neobank unlocking more affordable financial services and accelerating financial inclusion to low-income Brazilian families.",
            "linkedin": "https://www.linkedin.com/in/victorsantosd"
        },
        {
            "name": "Douglas Lopes",
            "description": "Doug spent time at Monitor Group, Bain & Co and large multinational companies in Brazil. Most recently, he helped grow Airfox / banQi to millions of users and assisted with the company’s acquisition. He is a MBA grad from MIT Sloan and Mechanical Engineer from USP in Brazil.",
            "linkedin": "https://www.linkedin.com/in/douglasclopes/"
        },
        {
            "name": "Tiago Passinato",
            "description": "Prior to Onyx, Tiago was the Principal Architect of Airfox / banQi, helping to implement a highly scalable banking platform. He has over 20 years of experience as a Full Stack Software Engineer, working for big companies in the US and Latin America.",
            "linkedin": "https://www.linkedin.com/in/tiagopassinato/"
        }
    ],
    "status": true,
    "generated_description": "Onyx Private is a Miami-based fintech startup launched in 2021, born out of Y Combinator's Batch W22. They are on a mission to redefine private banking, making it more modern and accessible for the next generation—specifically targeting affluent young professionals, overlooked high-earners, and illiquid entrepreneurs.\n\nThis innovative private bank positions itself as the next-generation UBS, merging a premium banking experience with a digital-native approach. Onyx offers a suite of services that includes digital banking, investment portfolios, and wealth management designed to cater to individuals often sidelined by traditional banking experiences.\n\nTheir platform supports not only individual consumers but also small and medium-sized businesses (SMBs). Onyx’s offerings come equipped with features like seamless digital onboarding, multiple virtual accounts, and advanced security measures. Their investment services incorporate robo-advisory features with low fees and personalized tax-loss harvesting options, as well as access to diverse asset classes, including private equity and venture capital strategies.\n\nOnyx is also focused on partnerships with banks and credit unions, offering a white-labeled solution that allows financial institutions to integrate modern private banking capabilities without overhauling their existing infrastructure.\n\nWith a small but focused team of ten, including their group partner, nan, Onyx is making waves in a space that desperately needs disruption. As they gear up for appearances at events like Money20/20 USA, they invite financial institutions and potential clients to explore their offerings.\n\nIf you're curious to learn more or to see how Onyx fits within the modern banking landscape, their website is a treasure trove of information: [Onyx Private](https://www.onyxprivate.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/f3ec94b962749558be94c112099f4dff4790d299.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191611Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=4da265a3c1f5043c66133e38af003ff72b452d782e828431749e011c5df541ed",
    "social_links": [
        "https://www.linkedin.com/company/onyx-card",
        "https://www.crunchbase.com/organization/onyx-card"
    ],
    "logo_path": "data/logos\\Onyx_Private_logo.png"
}