{
    "links": "https://www.ycombinator.com/companies/opencurriculum",
    "name": "OpenCurriculum",
    "headline": "Helping K-12 teachers and school administrators build awesomeâ\u0080¦",
    "batch": "W14",
    "description": "A library of community curated teaching and learning materials, free to the entire world. Come collaborate; we can teach better together.\r\n\nOpenCurriculum, Inc. is a California based technology nonprofit organization with a mission to bring openness and innovation to K12 education around the world",
    "activity_status": "Active",
    "website": "https://opencurriculum.org",
    "founded_date": 2011.0,
    "team_size": null,
    "location": "Mountain View",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:artificial-intelligence; industry:education; location:san-francisco-bay-area",
    "founders": [],
    "status": true,
    "generated_description": "**OpenCurriculum: Revolutionizing K-12 Education**\n\nOpenCurriculum is a California-based nonprofit that aims to innovate and democratize K-12 education. Founded in 2011 and a proud member of Y Combinator's Batch W14, it has its roots in community-curated teaching resources meant to be freely accessible worldwide. The mission? Helping teachers and school administrators create engaging, effective education experiences. Their slogan encapsulates this ethos—“Come collaborate; we can teach better together.” \n\n### What They Offer\n\nOpenCurriculum serves as a comprehensive curriculum planning tool that provides a vast library of high-quality, ready-to-use ideas for lesson and unit planning. It’s like having a collaborative workspace tailored for educators, where they can pull together diverse resources effortlessly. Imagine a space that doesn’t just template-ize your creativity but enhances it! \n\nWith an intuitive editor, educators can quickly gather assessments, links, multimedia, and more, into coherent lesson plans. They also facilitate collaboration among colleagues, allowing teachers to share, edit, and track plans with Google Docs-style permissions, ensuring that everyone stays aligned and engaged.\n\n### Key Features\n\n1. **Engaging Content**: Discover a wealth of lessons, assessments, and instructional strategies crafted by experts. The platform curates the best ideas to save teachers hours of research.\n\n2. **Visual Planning Tools**: Plan your curriculum with easy-to-navigate views—whether you prefer a weekly planner or a calendar format. Track your progress and visual layout at a glance.\n\n3. **Standard Alignment**: Align your curriculum with national or state standards seamlessly using an easy-to-navigate standards picker. The platform is designed to keep your educational goals coherent and connected.\n\n4. **Professional Development**: OpenCurriculum isn’t just a tool; it's a resource for continuous professional growth. With free training materials and instructional videos, it equips educators with practical, relevant pedagogical strategies.\n\n5. **Unmatched Accessibility**: The core features of OpenCurriculum are free for individual teachers and small school departments. They also have provisions to serve schools in crisis—making all paid features available to those who need it most, at no cost.\n\n### Why It Matters\n\nEducation needs transformation, and OpenCurriculum is committed to addressing the gaps in traditional educational tools. By making high-quality educational resources accessible and easy to use, they empower educators to elevate student outcomes. And in a world where educational equity is often a dream rather than a reality, OpenCurriculum stands as a beacon of hope, bringing together innovation, collaboration, and passion for teaching to the fore.\n\nIf you’re part of the educational landscape in K-12, whether as a teacher or administrator, exploring OpenCurriculum is well worth your time. They aspire to share the best educational ideas with every teacher globally, and they’re well on their way to making that aspiration a reality.\n\nFor more information, visit their website at [OpenCurriculum.org](https://opencurriculum.org).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/7faa80f23079b258526484f8a04028c8f1e7b31a.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191611Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=5f2a9b7d56ece9d8e136543d53e1455ea7e19629172d6da384cf9ad368fd1325",
    "social_links": [
        "https://www.crunchbase.com/organization/opencurriculum"
    ],
    "logo_path": "data/logos\\OpenCurriculum_logo.png"
}