{
    "links": "https://www.ycombinator.com/companies/openfunnel",
    "name": "OpenFunnel",
    "headline": "Personalised Agents for AI-First GTM Teams",
    "batch": "F24",
    "description": "OpenFunnel builds personalized AI Agents for GTM teams. These agents understand their product, scour through the internet, and find prospects that have shown intent for their product.\r\n\nToday, GTM teams at B2B SaaS companies, burn through cold prospects from intent data providers like Demandbase and Zoominfo using some AI SDR tools and get conversions < 1%.\r\n\nOur customers have a steady pipeline of prospects daily and get 20x more meetings booked by reaching out to prospects when they show intent.",
    "activity_status": "Active",
    "website": "https://openfunnel.dev",
    "founded_date": 2024.0,
    "team_size": 2.0,
    "location": "San Francisco",
    "group_partner": "David Lieb",
    "group_partner_yc": "https://www.ycombinator.com/people/david-lieb",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:generative-ai; industry:b2b; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Fenil Suchak, Founder",
            "description": "I have a background in Computer Science and Economics from BITS Pilani. I have 4 years of experience in Cloud+AI and have scaled Oracle's 23ai Cloud DB to multiple clouds like GCP, Azure and AWS the direct consequence of this was a 20% uptick in Oracle's stock. I have built and sold software to offline English Learning Classes in India. I have experience in doing door to door software sales. I have done things that don't scale and have the experience to scale them when traction hits.",
            "linkedin": "https://linkedin.com/in/fenilsuchak"
        },
        {
            "name": "Aditya Lahiri, Founder",
            "description": "I am building OpenFunnel where we use Personalized AI Agents that act on real time high intent signals from across the internet to help our customers keep a steady stream of warm prospects that are in the market for their product.\nPreviously, I built AI Agents for Leasing in PropTech, did Graduate Research on Controlled Generation of Large MultiModal Models, and helped build distributed large-scale Machine Learning Models at American Express AI Labs.",
            "linkedin": "https://www.linkedin.com/in/aditya-lahiri-0b33261a/"
        }
    ],
    "status": true,
    "generated_description": "### Company Overview: OpenFunnel\n\n**Founded**: 2024  \n**Location**: San Francisco  \n**Team Size**: 2  \n**Y Combinator Batch**: F24  \n**Partner**: David Lieb  \n\n---\n\n**Mission**: OpenFunnel is on a mission to provide personalized AI agents tailored for AI-first Go-To-Market (GTM) teams. \n\n**Core Offering**: Initially, OpenFunnel specialized in creating personalized AI agents for GTM teams. These agents not only understand a company’s products but also actively track and pinpoint prospects showing intent for those products across the internet.\n\n### The Problem\nGTM teams at B2B SaaS companies are often stuck with outdated practices, focusing on cold prospects from intent data providers like Demandbase and ZoomInfo. The result? Conversion rates of less than 1%. \n\n### The Solution\nOpenFunnel changes the game by giving its customers a reliable influx of warm prospects. Users can expect up to **20 times more meetings booked** by reaching out when prospects display genuine purchasing intent. \n\n### Key Features\n- **Personalized Agents**: These AI agents are designed to deeply understand a company's offerings, digesting documents, blogs, and other resources to refine prospecting efforts.\n- **Real-Time Prospecting**: The agents capture intent signals from various channels—including social media platforms, blogs, and even job boards—delivering leads just when they are most receptive.\n- **No Setup Time**: Quick integration via Slack ensures that teams can start getting warm prospects immediately.\n- **Self-Improving**: The agents utilize user feedback for constant refinement, making them smarter with each interaction.\n\n### Testimonials\nOpenFunnel's effectiveness speaks through customer feedback:\n- “You guys save me hours a week—it's like I have an up-to-the-minute pulse on exactly what AI dev communities are thinking about.”\n- “I did not expect it to work this well within a few hours after onboarding.”\n\n### Tags\n- **Generative AI**\n- **B2B**\n- **San Francisco Bay Area**\n\nFor those looking to ditch cold leads and move to a more intelligent, intent-focused prospecting approach, OpenFunnel offers a fresh perspective where AI meets actionable insights. If you're part of a GTM team eager to boost conversions, consider reaching out for a demo at [OpenFunnel's website](https://openfunnel.dev).\n\n---\n\nLet’s face it: in an age where data is abundant, the key is not just finding leads, but finding the **right** leads at the **right** time. OpenFunnel is here to ensure that your sales efforts resonate with potential buyers, not just echo into the void.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/f2af864e1b3847603615996d8146a1231b66061c.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191612Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=78b8636e2625d7aa80889c12ca88e722320ad1bad6fa5c4925f9f5fd1af473c1",
    "social_links": [
        "https://www.linkedin.com/company/openfunnel/about/",
        "https://x.com/openfunnel"
    ],
    "logo_path": "data/logos\\OpenFunnel_logo.png"
}