{
    "links": "https://www.ycombinator.com/companies/openbiome",
    "name": "OpenBiome",
    "headline": "A nonprofit stool bank enabling access to fecal transplants.",
    "batch": "W20",
    "description": "We are a nonprofit stool bank, expanding safe access to fecal transplants and catalyzing research on the human microbiome.",
    "activity_status": "Active",
    "website": "http://openbiome.org",
    "founded_date": 2013.0,
    "team_size": 70.0,
    "location": "Cambridge, MA",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:nonprofit",
    "founders": [
        {
            "name": "Majdi Osman",
            "description": "Co-founder, OpenBiome. Physician scientist researching the role of the microbiome in human health.",
            "linkedin": "https://www.linkedin.com/in/majdi-osman-17b47a39/"
        },
        {
            "name": "Carolyn Edelstein",
            "description": "Carolyn Edelstein is OpenBiome’s Executive Director. She previously worked at Development Innovation Ventures, a program at USAID designed to fund ideas that could improve millions of lives in more cost-effective ways than standard international development approaches. Carolyn helped launch the Global Innovation Fund, a $200M multilateral development fund built on the DIV model, before co-founding OpenBiome.",
            "linkedin": "https://www.linkedin.com/in/carolyn-edelstein-8465519/"
        }
    ],
    "status": true,
    "generated_description": "OpenBiome is a pioneering nonprofit organization established in 2013 and based in Cambridge, Massachusetts. With a mission centered around expanding safe access to fecal transplants, OpenBiome operates as a stool bank and plays a crucial role in catalyzing research focused on the human microbiome.\n\nHaving emerged from Y Combinator's Batch W20, OpenBiome is equipped with a dedicated team of approximately 70 employees. They aim to improve health outcomes by promoting the use of fecal microbiota transplantation (FMT) to treat conditions such as Clostridium difficile infection and other microbiome-related diseases.\n\nTheir website, [openbiome.org](http://openbiome.org), offers a wealth of resources for both clinicians and patients, including updates on investigational FMT, access to research materials, and ongoing initiatives in global health. Currently, they are involved in various programs that not only distribute investigational FMT but also contribute to microbiome conservation and health research on a global scale.\n\nOne striking aspect of OpenBiome's work is its commitment to ethical practices in microbiome science and the notable impact they've achieved over the last decade. They've helped thousands of patients receive necessary FMT treatments and fostered clinical trials exploring the microbiome as a treatment avenue for numerous health issues.\n\nMoreover, OpenBiome has partnered with significant organizations like the CDC and the Bill & Melinda Gates Foundation, underscoring their broad influence in health advancements. Their latest initiatives include a focus on combating malnutrition and exploring mental health through microbiome therapies—big challenges that require innovative biotherapeutic approaches.\n\nIn summary, OpenBiome is not just a stool bank; it’s a hub of microbiome knowledge and a critical player in the effort to harness our world of microbes for better health solutions. Their proactive approach to research, treatment, and ethical responsibility sets a benchmark in health innovation.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/0d6c89cce3b85bc9d429f96204646ad0496559d5.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191611Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=113e2ddb151222ee5cde7c35ffbf6520e9b53860f7cca7e07258cc2ded1f3225",
    "social_links": [
        "https://twitter.com/openbiome",
        "https://www.crunchbase.com/organization/openbiome",
        "https://github.com/openbiome"
    ],
    "logo_path": "data/logos\\OpenBiome_logo.png"
}