{
    "links": "https://www.ycombinator.com/companies/ophelia",
    "name": "Ophelia",
    "headline": "Medication & support to beat opioid addiction from home",
    "batch": "W20",
    "description": "Ophelia helps people quit opioids without going to rehab. We offer online doctor’s visits, withdrawal medication prescriptions, and support for long-term recovery, using a protocol 6x more effective than most rehabs (2/3rds of which don't have doctors).\r\n\nMore than 3 million Americans are addicted to opioids, but 80% are not getting help, due to jobs, families, and privacy concerns. Meanwhile, there's a proven treatment that increases survival rates by 600%, and it's low cost, discreet, and convenient. It's called MAT, and it looks like treatment for anxiety or depression: medication plus therapy. However, doctors need a special waiver to prescribe the medication, which fewer than 5% of them have, so it's difficult to get, and most people are buying it on the street. Sadly, drug dealers aren't doctors: every 11 minutes another American dies of an opioid overdose, now the #1 cause of death for Americans under 50.\r\n\nOphelia is replacing rehab with telemedicine, using proven science and a consumer-first approach. The opioid treatment market in the U.S. is $15B, and 85% of opioid addicts have insurance that pays for it. We're treating roughly 400 patients with thousands more waiting.\r\n\nZack started Ophelia after losing his girlfriend to an opioid overdose, who found it easier to get medication from a drug dealer than a doctor. We are raising money to help patients in waiting, grow our footprint, save lives, and earn venture-level returns for investors.",
    "activity_status": "Active",
    "website": "https://ophelia.com",
    "founded_date": 2019.0,
    "team_size": 130.0,
    "location": "New York",
    "group_partner": "Michael Seibel",
    "group_partner_yc": "https://www.ycombinator.com/people/michael-seibel",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:mental-health-tech; industry:healthcare; industry:telemedicine; location:new-york",
    "founders": [
        {
            "name": "Mattan Griffel, Founder",
            "description": "Mattan is an award-winning faculty member at Columbia Business School and a two-time Y Combinator-backed entrepreneur. He co-founded Ophelia, a company that helps people quit opioids without having to go to rehab. Mattan is also an Innovation Fellow at the Lang Center for Entrepreneurship at Columbia Business School and was selected as one of Forbes' 30 Under 30 in Education.\n\nI studied Philosophy and Finance at New York University and wrote my thesis on the metaphysics of consciousness.",
            "linkedin": "https://www.linkedin.com/in/mattangriffel/"
        },
        {
            "name": "Zack Gray, Founder",
            "description": null,
            "linkedin": "https://www.linkedin.com/in/zack-gray-58437936/"
        }
    ],
    "status": true,
    "generated_description": "### Ophelia: A Modern Approach to Opioid Addiction Treatment\n\nFounded in 2019 and part of Y Combinator’s Winter 2020 batch, Ophelia is on a mission to provide effective, discreet treatment for opioid addiction right from the comfort of home. With over 3 million Americans struggling with opioid addiction—yet 80% not seeking help due to logistical and privacy concerns—Ophelia is stepping in to bridge that gap. Founded by Zack after the tragic loss of his girlfriend to an overdose, the company aims to make recovery more accessible through telemedicine.\n\n#### What They Offer\nOphelia offers a comprehensive treatment protocol for opioid addiction which is *six times* more effective than traditional rehab facilities, many of which lack proper medical oversight. They combine medication-assisted treatment (MAT) with ongoing support—all served through virtual appointments. MAT integrates medication like Suboxone (buprenorphine + naloxone) with therapy, boasting a survival rate increase of up to 600%. \n\n#### The Problem They Address\nThe opioid crisis is stark. Every 11 minutes, an American dies from an overdose, making opioids the leading cause of death for individuals under 50. Traditional treatments often require patients to navigate uncomfortable environments, which can deter many from seeking help. Ophelia's model emphasizes a *consumer-first* approach by delivering treatment that is low-cost, confidential, and easy to access.\n\n#### Their Impact\nOperating from New York with a team of 130, Ophelia currently treats around 400 patients, with a waiting list eager for their service. The company taps into a $15 billion opioid treatment market, of which 85% of potential patients have insurance that can cover their costs. Most patients end up spending less than $10 a month for comprehensive care, including video consultations and medication management. \n\n#### The Vision Ahead\nBacked by Michael Seibel from Y Combinator and fueled by their own stories of loss and resilience, Ophelia is actively raising funds to expand their capacity and reach. They’re dedicated to saving lives while providing a worthwhile opportunity for investors looking at venture-level returns. \n\nDon't let the stigma surrounding addiction hinder you or your loved ones—Ophelia is here to help. Their streamlined process ensures you can begin treatment in just a few steps, all while receiving compassionate, judgment-free support.\n\nFor more information or to get started, visit their website at [Ophelia.com](https://ophelia.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/212ab692e93c6766f350530846e7f00604546aab.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191613Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=cfa3c02af8f26c91d1a40386634ce128236977db15bc93bac3ea2ec5419523dd",
    "social_links": [
        "https://www.linkedin.com/company/opheliahealth/",
        "https://twitter.com/meetophelia",
        "https://www.facebook.com/opheliahealth"
    ],
    "logo_path": "data/logos\\Ophelia_logo.png"
}