{
    "Links": "https://www.ycombinator.com/companies/opine",
    "Name": "Opine",
    "Headline": "AI-Native Social Media App",
    "Batch": "W25",
    "Description": "Opine is an AI native social media app. Users can create characters with a custom face, voice, and outfit. They can overlay these characters onto any videos of themselves and share them on our platform.",
    "Activity_Status": "Active",
    "Website": "https://opine.cool",
    "Founded_Date": "2024",
    "Team_Size": "2",
    "Location": "San Francisco",
    "Group_Partner_YC": "https://www.ycombinator.com/people/tom-blomfield",
    "Group_Partner": "Tom Blomfield",
    "Company_Linkedin": "https://www.linkedin.com/company/opine-cool",
    "Company_Twitter": "",
    "Tags": "industry:artificial-intelligence; industry:consumer; industry:social-media; location:san-francisco-bay-area",
    "social_links": [
        "https://www.linkedin.com/company/opine-cool",
        "https://x.com/opine_cool"
    ],
    "logo_path": "data\\logos\\Opine.png",
    "Active_Founders": [
        {
            "Name": "Manuj Mishra, Founder",
            "Description": "CEO @ Opine. \nPrev 2nd ML hire at unicorn defence startup, Rebellion. Ranked #1 in BEng Maths and CS @ Imperial. MSc CS @ Oxford. First-author publication in UAI 2024.",
            "LinkedIn": "https://linkedin.com/in/manuj-mishra"
        },
        {
            "Name": "Diogo Valdivieso, Founder",
            "Description": "CTO @ Opine. \nPreviously built 1M user original game, Battle Arena. Bachelor's in Computer Science from EPFL. Master's drop-out.",
            "LinkedIn": "https://www.linkedin.com/in/diogo-vddc/"
        }
    ],
    "crawl_status": true,
    "generated_description": "### Opine: Craft Your Digital Persona\n\nOpine is an ambitious startup that stepped into the limelight in 2024, emerging from the seedbed of Y Combinator's W25 batch. Based in San Francisco, this tiny team of just two employs cutting-edge artificial intelligence to revolutionize social media. Their mission? To create an AI-native social media app that allows users to explore and express their identities in a vivid, captivating way.\n\nImagine this: you can design your own character with a unique face, voice, and outfit. Once you're satisfied with your creation, overlay it onto your own videos, and share it with the world on the Opine platform. This innovative approach isn’t just about sharing thoughts or opinions; it’s about embodying a persona that resonates with who you are—or who you wish to be.\n\nOpine is more than just a social media app; it’s a playful, interactive way for users to craft their digital identities. With a straightforward call-to-action encouraging potential users to “Who do you want to be?” they are poised to make a splash in the consumer tech space.\n\nFor those eager to jump in, Opine offers a beta signup and is currently building its user base via a waitlist. They also maintain transparency with clear Terms and Conditions and a Privacy Policy, giving users peace of mind as they embrace this new social frontier.\n\nWith Tom Blomfield as their Group Partner, Opine is well-positioned in the vibrant San Francisco Bay Area, tagged under crucial themes like artificial intelligence and social media. If you're intrigued by the idea of creating and sharing in this new dimension, keep an eye on Opine—they're just getting started.\n\nWebsite: [Opine](https://opine.cool)"
}