{
    "links": "https://www.ycombinator.com/companies/orange-health-labs",
    "name": "Orange Health Labs",
    "headline": "India's Fastest Diagnostics Service",
    "batch": "S20",
    "description": "Orange Health Labs offers at-home collection of samples on-demand within 60 minutes and delivers test results twice as fast as the industry norm, across the top cities in India.\r\n\nWith an on-demand service, patients can now avoid visiting crowded and potentially infectious collection centers. At the same time, they can get diagnosed much faster and get better treatment remotely from their own doctor",
    "activity_status": "Active",
    "website": "http://www.orangehealth.in",
    "founded_date": 2020.0,
    "team_size": 900.0,
    "location": "Bengaluru, India",
    "group_partner": "Dalton Caldwell",
    "group_partner_yc": "https://www.ycombinator.com/people/dalton-caldwell",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:consumer-health-services; industry:healthcare; industry:diagnostics",
    "founders": [
        {
            "name": "Tarun Bhambra, Founder",
            "description": "Professional with over 10 years of experience across sectors as an operator, investor, consultant, product leader, and business head. Wants to make healthcare easier to access and patient-friendly.",
            "linkedin": "https://www.linkedin.com/in/tarun-bhambra-a2ba104/"
        },
        {
            "name": "Dhruv Gupta, Founder",
            "description": "Consumer tech entrepreneur with successful exits to Practo & HT Media. Product focused leader, built businesses in healthcare, commerce, and social networks, serving over 150M users every year. \nMore: www.dhruvg.com",
            "linkedin": "https://www.linkedin.com/in/dhruvgupta1/"
        }
    ],
    "status": true,
    "generated_description": "**Orange Health Labs: Revolutionizing Diagnostics in India**\n\nFounded in 2020 and hailing from Bengaluru, Orange Health Labs brings the convenience of rapid diagnostic services right to your doorstep. Part of the Y Combinator S20 batch, this forward-thinking company emphasizes speed and efficiency in healthcare. Their mission is crystal clear: to provide India's fastest diagnostics service by offering at-home sample collection within 60 minutes and delivering test results at lightning speed—typically twice as fast as the industry standard.\n\nPicture this: instead of trekking to crowded collection centers, patients can sit back at home while certified professionals (let's call them eMedics) come to them. This approach not only enhances convenience but also minimizes the risk of exposure to infections—something we’ve all become acutely aware of recently.\n\nWith a robust team of around 900 employees, Orange Health Labs focuses on high-quality patient care, employing state-of-the-art technology to ensure the accuracy and safety of each test. Their labs boast cutting-edge automation and certified standards, all aimed at providing reliable results. Patients have appreciated this responsiveness, as evidenced by a staggering average Google rating of 4.9, indicating satisfaction across multiple touchpoints—from booking to report delivery.\n\nOrange Health offers a wide array of services, including full-body checkups starting as low as ₹1,099, drawing in more than 1 million customers to date. They’ve tapped into the burgeoning \"on-demand\" market, making it simpler for individuals to prioritize their health without the hassles of traditional lab visits.\n\nIf you’re looking to book a test, the process is user-friendly: just visit their website or use the dedicated app. Enter your details, select your desired service, and an eMedic will arrive promptly at your preferred time. Results are typically delivered via WhatsApp and can also be accessed through the app within hours.\n\nAs for their offerings? You can explore numerous tests, from thyroid functions to complete blood counts. With ongoing promotions like 15% off for orders above ₹500, there’s always a reason to take charge of your health.\n\nSo, why choose Orange Health Labs? In a landscape where healthcare can often feel daunting, they’ve carved a niche by making diagnostics accessible, fast, and reliable—all while ensuring exceptional customer experience. For more information, you can visit their website at [www.orangehealth.in](http://www.orangehealth.in).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/90bf2b9b8c49a4ef61c226bb6d87e11143c6d565.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191615Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=600c35f597eb3ce87a8dd7c9b6c788abe07a4f47526f9999e51ffc496237d295",
    "social_links": [
        "https://www.linkedin.com/company/orange-health/",
        "https://twitter.com/OrangeHealth_",
        "https://play.google.com/store/apps/details?id=in.orangehealth.patient&hl=en_IN&gl=US&pli=1",
        "https://www.youtube.com/c/OrangeHealthLab",
        "https://apps.apple.com/in/app/orange-health-labs-blood-test/id1534689588"
    ],
    "logo_path": "data/logos\\Orange_Health_Labs_logo.png"
}