{
    "links": "https://www.ycombinator.com/companies/orbillion-bio",
    "name": "Orbillion Bio",
    "headline": "Premium cultivated meat at low cost",
    "batch": "W21",
    "description": "Intro to Orbillion Bio: https://www.youtube.com/watch?v=wAf21WXxnhw\r\n\nOrbillion is making cultivated beef at scale using advanced computational models to rapidly optimize the bioprocess and reduce cost. With Orbillion’s proprietary bioware, they can precisely control the microenvironment that the meat cells need. This supercharges cell growth without the need for GMO, serum, or expensive growth factors, enabling a cost of $4 per kg at commercial scale.\r\n\nOrbillion’s technology addresses the industry's two main challenges: cost and scale-up. Its integrated bioprocess platform allows Orbillion to  produce at a commercial level  anywhere globally within two weeks in an asset-light fashion. Partnerships with two global food companies of combined $280B revenue, and a European partner have fast-tracked commercialization in the $211B ground beef market. Founders Dr. Patricia Bubner and Samet Yildirim are the only industry founders with scale-up experience in mammalian cells from the biopharma industry. Orbillion is backed by The Venture Collective, Y Combinator, At One Ventures, Venture Souq, and Metaplanet among others.",
    "activity_status": "Active",
    "website": "https://www.orbillion.com/",
    "founded_date": 2019.0,
    "team_size": 7.0,
    "location": "San Francisco",
    "group_partner": "Gustaf Alstromer",
    "group_partner_yc": "https://www.ycombinator.com/people/gustaf-alstromer",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:cultured-meat; industry:climate; industry:food-tech; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Patricia Bubner, Founder",
            "description": "Patricia is a scientist and engineer with a background in high-throughput screening, automation, process analytics and development. She has a broad industry experience in biopharma and clean energy (Boehringer Ingelheim, Sila Nanotechnologies). She has an MSc and PhD in chemistry and biotechnology. During her postdoc at UC Berkeley, she co-founded themilletproject.org, that aimed at diversifying agriculture and our diet through cultivation and consumption of lesser-known grains such as millets.",
            "linkedin": "https://www.linkedin.com/in/patriciabubner/"
        },
        {
            "name": "Samet Yildirim, Founder",
            "description": "Samet has 10+ years of experience in commercializing biotechnologies. Samet was the Global Head of Innovation in the Boehringer Ingelheim's Biopharma Business Unit where he led the development and commercialization of biomanufacturing technologies. Prior to that, Samet held various positions within responsibilities for product innovation and business development in life science companies.  He received a BSc in Biology and an MSc in Biophysics and business masters (MBS) in bioprocessing.",
            "linkedin": "https://www.linkedin.com/in/ssyildirim/"
        }
    ],
    "status": true,
    "generated_description": "**Orbillion Bio: Redefining Cultivated Meat**\n\nFounded in 2019 and hailing from the innovative ecosystem of Y Combinator’s Batch W21, Orbillion Bio is on a mission to make premium cultivated meat accessible at a low cost. Based in San Francisco, this agile startup is driven by a simple yet potent idea: revolutionize the way we produce meat to address the pressing challenges of cost and scale in the food industry.\n\nAt the heart of Orbillion's approach is advanced computational modeling and proprietary bioware that control the microenvironments necessary for optimal meat cell growth. This means they're able to produce cultivated beef for around $4 per kilogram at commercial scales—no GMO, serum, or pricey growth factors needed. With this breakthrough, they’re not just making meat; they're making it in a way that's smarter and more sustainable.\n\nThe company has made significant strides in the cultivated meat sector by integrating a unique bioprocess platform that enables them to produce at scale anywhere in the world within just two weeks. This flexibility is key in an industry projected to be worth $211 billion in the ground beef market alone.\n\nOrbillion's rapid progress is bolstered by strategic partnerships with two major global food companies, whose combined revenue tops $280 billion, and a collaboration with a European partner. This not only fast-tracks their path to commercialization but also solidifies their position in the marketplace.\n\nThe founders, Dr. Patricia Bubner and Samet Yildirim, bring invaluable experience from the biopharmaceutical field, uniquely equipping them to tackle the intricacies of scaling mammalian cell production. Supported by notable investors including The Venture Collective, Y Combinator, At One Ventures, Venture Souq, and Metaplanet, Orbillion is well-positioned for growth.\n\nWith a lean team of just seven, including Group Partner Gustaf Alstromer, Orbillion is a testament to how a motivated group can innovate in the cultivated meat space—combining cutting-edge technology with a focus on climate and sustainability.\n\nFor more details on their journey, check out [Orbillion Bio's website](https://www.orbillion.com/) and their introductory video [here](https://www.youtube.com/watch?v=wAf21WXxnhw). This is a fascinating time to watch Orbillion Bio as they aim to reshape the landscape of food tech and contribute to a more sustainable future.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/5c3b23811fa9c826c71bfcd4408ef603c2187d05.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191615Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=76e4ad48f1ff7fd55849c4f1069e86249662a8b89064b54b6fe40be959d186c0",
    "social_links": [
        "https://www.linkedin.com/company/orbillion/",
        "https://twitter.com/Orbillion1",
        "https://www.facebook.com/Orbillion-109686784161881/"
    ],
    "logo_path": "data/logos\\Orbillion_Bio_logo.png"
}