{
    "links": "https://www.ycombinator.com/companies/orbital-operations",
    "name": "Orbital Operations",
    "headline": "Moving customers in space with a reusable, high thrust vehicle",
    "batch": "W25",
    "description": "Orbital Operations is developing a high thrust space vehicle that is refuellable and stays in orbit to ferry customers beyond low earth orbit (LEO). This allows satellite customers to take advantage of the low cost, low lead time, and low effort launches to LEO and have us rendezvous with them in space to transport them to their final destination.\r\n\nOur high thrust and high efficiency is made possible by a unique cryogenic fuel management system being implemented on the vehicle to keep propellants cold so they don't boil. This allows us to use the same propulsion systems that have been developed by launch vehicles over the last few decades (NASA, SpaceX, Blue Origin, Relativity Space, ect.).\r\n\nBen and Ross met while working together at Relativity Space, where they qualified the cryogenic flight termination valves for the Terran 1 rocket and continued working together on the heat exchangers and turbomachinery for the AeonR engine.\r\n\nWe are currently working on the first demo of our unique cryo management system and intend to launch an operational vehicle by 2027.",
    "activity_status": "Active",
    "website": "https://www.orbitalops.tech/",
    "founded_date": 2024.0,
    "team_size": 2.0,
    "location": "Huntington Beach, CA",
    "group_partner": "Michael Seibel",
    "group_partner_yc": "https://www.ycombinator.com/people/michael-seibel",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:hard-tech; industry:space-exploration; industry:aerospace",
    "founders": [
        {
            "name": "Ross Doherty, Co-Founder & COO",
            "description": "Ross is the Co-founder and COO of Orbital Operations.\n\nHe has spent his entire career in the aerospace industry, from Aerojet Rocketdyne, to Blue Origin, and most recently Relativity Space, where he owned all turbomachinery manufacturing and assembly for the Aeon-R engine. He was also responsible for the Flight Termination System test and qualification program for the TM-1 rocket.\n\nRoss has deep expertise in complex manufacturing processes, assembly, test, and chemical propulsion development.",
            "linkedin": "https://www.linkedin.com/in/ross-doherty-992a2790"
        },
        {
            "name": "Ben Schleuniger, Founder",
            "description": "Ben Schleungier is the Co-founder and CEO of Orbital Operations.\n\nHe started his career at NASA in propulsion before moving on to SpaceX and then as an early employee at Relativity Space. He owned the fluid systems for the TM1 rocket, the complex heat exchangers on the AeonR engine, and built the Components team and the Integrated Design and Analysis teams from the ground up.\n\nBen has an deep understanding of rocket engine design and analysis and building high performance engineering teams.",
            "linkedin": "https://www.linkedin.com/in/bschleuniger/"
        }
    ],
    "status": true,
    "generated_description": "### Summary of Orbital Operations\n\n**Company Name:** Orbital Operations  \n**Founded:** 2024  \n**Location:** Huntington Beach, CA  \n**Team Size:** 2 employees  \n**Y Combinator Batch:** W25  \n\n#### Mission\nOrbital Operations aims to revolutionize space transport by creating a reusable, high-thrust vehicle designed to ferry customers beyond Low Earth Orbit (LEO). This solution not only enhances cost efficiency but also reduces lead times and operational efforts associated with space launches. \n\n#### Background\nOriginally focused on developing a high-thrust space vehicle, Orbital Operations leverages a unique cryogenic fuel management system to keep propellants cold, thus preventing them from boiling. This technology allows them to utilize established propulsion systems from top players in the space industry, like NASA, SpaceX, and Blue Origin. The co-founders, Ben and Ross, previously collaborated at Relativity Space, where they contributed to the development of vital components for rocket engines.\n\n#### Current Projects\nOrbital Operations is currently working on a demo for their cryogenic management system and plans to launch an operational vehicle by 2027. Their technology is set to enable transportation from LEO to Medium Earth Orbit (MEO), Geostationary Orbit (GEO), and even the Moon. Their capabilities also position them well for rapid threat assessment in orbit.\n\n#### Unique Selling Proposition\nBy operating a vehicle that can stay in orbit and offer rendezvous capabilities with satellite customers, Orbital Operations is working to redefine logistics in space. Their focus on high thrust and efficiency is expected to set them apart from competitors.\n\n**Website:** [Orbital Operations](https://www.orbitalops.tech/)  \n**Group Partner:** Michael Seibel  \n\n#### Keywords\n- **Tags:** Hard-Tech, Space Exploration, Aerospace  \n- **Vision:** Deliver logistics for space, from space.  \n\nIn a nutshell, Orbital Operations is gearing up to change the way we think about space travel logistics, and its unique technology has the potential to play a significant role in the future of aerospace operations.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/5590c24df99220947c188e59d6646aa5788d8b7d.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191615Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=234a7ce110056e33271f1ed383298ab117e769a322c9f18c80f9ee87cf5e6c13",
    "social_links": [
        "https://www.linkedin.com/company/orbital-operations/"
    ],
    "logo_path": "data/logos\\Orbital_Operations_logo.png"
}