{
    "links": "https://www.ycombinator.com/companies/orbio-earth",
    "name": "Orbio Earth",
    "headline": "Tracking methane emissions with satellites",
    "batch": "S23",
    "description": "Orbio uses satellite imagery to track methane emissions from the oil & gas industry. We sell the data to financial companies that want to invest into the best performing energy companies.\r\n\nUntil today, oil & gas companies use excel-based emission factors to calculate and report their emissions. As these excel-based emission factors underestimate actual emissions by ~70%, the finance companies that invest into oil & gas can’t mitigate against incoming risks from new regulations, \r\n\nWe have built a technology that can for the first time use satellite images to track methane from every single oil & gas facility on the planet, replacing emission factors and allowing finance companies to make the best bets on oil & gas companies that will withstand a wide avalanche of incoming regulation. In the summer 2023 our satellite-based technology got ranked #1 both in terms of accuracy and sensitivity of methane emission events by Stanford University in a peer-reviewed study, beating a range of multi-bn dollar competitors like Maxar.\r\n\nLearn more at https://orbio.earth",
    "activity_status": "Active",
    "website": "https://www.orbio.earth/",
    "founded_date": 2021.0,
    "team_size": 14.0,
    "location": null,
    "group_partner": "Gustaf Alstromer",
    "group_partner_yc": "https://www.ycombinator.com/people/gustaf-alstromer",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:artificial-intelligence; industry:satellites; industry:analytics; industry:climate; industry:energy",
    "founders": [
        {
            "name": "Robert Huppertz, Founder",
            "description": "Co-Founder Orbio Earth GmbH; Ex-ML Engineer NASA Harvest; Ex-Cervest",
            "linkedin": "https://linkedin.com/in/robert-huppertz-6536a0122"
        },
        {
            "name": "Jack Angela, Founder",
            "description": "Climate optimist building out product and commercial strategy @ Orbio Earth",
            "linkedin": "https://linkedin.com/in/jack-angela-bab326a5"
        }
    ],
    "status": true,
    "generated_description": "### Orbio Earth: Pioneering Methane Emission Tracking\n\n**Founding Mission**  \nOrbio Earth launched in 2021 with a clear mission: to track methane emissions from the oil and gas industry using satellite technology. This initiative seeks to redefine how emissions data is reported and utilized, particularly as the world faces increasing regulatory pressure.\n\n**The Problem**  \nTraditionally, oil and gas companies have relied on outdated, excel-based emission factors that often underestimate methane emissions by around 70%. This lack of accurate data hinders financial companies from making informed investments or understanding the risks associated with new regulations—especially with a wave of new rules looming on the horizon.\n\n**The Solution**  \nOrbio has developed cutting-edge technology that uses satellite imagery to monitor methane emissions from every oil and gas facility globally. This capability, recognized as the most accurate in a peer-reviewed Stanford University study, allows companies to replace outdated methods and make data-driven decisions about their investments. By providing detailed asset-level insights, Orbio empowers financial firms and operators to prioritize emission reduction opportunities and stay ahead of compliance demands.\n\n**Key Achievements**  \n- **Industry Recognition**: In summer 2023, Orbio's satellite-based technology was ranked #1 for accuracy and sensitivity in tracking methane emissions, outperforming established competitors like Maxar.\n- **Financial Backing**: Orbio recently secured $4 million in a funding round to enhance its mission of global methane emissions reduction.\n\n**Market Focus**  \nOrbio serves two primary markets:\n1. **Oil and Gas Operators**: Aiding them in reducing emission risks and managing compliance.\n2. **Private Equity and Financial Companies**: Helping them understand portfolio exposure to methane emissions and navigate regulatory landscapes effectively.\n\n**Why Choose Orbio?**  \nOrbio stands out because of its high-resolution data, which allows for precise attribution of emissions to specific assets, a step beyond what current methane-monitoring satellites provide. This granularity is crucial for tackling the complexities of methane emissions, which are often random and widespread.\n\n**The Team**  \nHeadquartered remotely and part of Y Combinator Batch S23, Orbio operates with a lean team of 14. Their strategic partnerships and collaborations enhance their technological capabilities and market reach.\n\n**In Summary**  \nOrbio Earth isn’t just changing how methane emissions are tracked; they’re enabling a proactive approach to climate impact and risk management in the energy sector. As regulations tighten, those who can leverage precise emissions data will have a competitive edge in navigating the evolving landscape. If you’re interested in learning more or getting involved, check out [Orbio Earth](https://www.orbio.earth).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/4d2138a735e9375a24f59ebf59f86738682338a0.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191615Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=9488e258b6639a57ad70fa2d0a82a7085993c5cbe3086afbeccc0d530c86f3d4",
    "social_links": [
        "https://www.linkedin.com/company/orbioearth/",
        "https://www.crunchbase.com/organization/orbio"
    ],
    "logo_path": "data/logos\\Orbio_Earth_logo.png"
}