{
    "links": "https://www.ycombinator.com/companies/orderli",
    "name": "Orderli",
    "headline": "Square for Europe",
    "batch": "S21",
    "description": "Orderli is tableside ordering for bars and pubs in Europe. Orderli works without downloading an app, guests can scan a QR code on the table, browser the menu and order what they want. \r\n\nFor the staff we provide a simple app which gives them a better overview who is ordering and control of the orders that are sent to the kitchen.\r\n\nIn the backend we use predictions to recommend restaurant owners what to purchase and make changes to the menu in real-time.",
    "activity_status": "Active",
    "website": "https://orderli.com/en",
    "founded_date": 2020.0,
    "team_size": 6.0,
    "location": "Utrecht, Netherlands",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:saas; industry:b2b; industry:e-commerce",
    "founders": [
        {
            "name": "Dorus van den Oord, Founder",
            "description": "Dorus is the CEO and co-founder of Orderli. He has a degree in Strategic Product Design from Delft University of Technology and is a self-taught front-end developer.",
            "linkedin": "https://linkedin.com/in/dorusvandenoord"
        },
        {
            "name": "Maurits Franken, Founder",
            "description": "Hi, I'm Maurits, one of the founders of Orderli. Before Orderli I did learned selling to people by selling lottery tickets near stations and selling cider to restaurants. At Orderli I handle the marketing, sales and support side. Love to learn new people and learn new things, so let's meet up!",
            "linkedin": "https://www.linkedin.com/in/maurits-franken"
        }
    ],
    "status": true,
    "generated_description": "### Orderli: Revolutionizing Ordering in the Hospitality Industry\n\n#### Company Overview\nOrderli, founded in 2020 and based in Utrecht, Netherlands, is a forward-thinking startup that aims to become \"Square for Europe,\" focusing on delivering seamless ordering experiences for bars, pubs, hotels, and restaurants across Europe. As part of Y Combinator's Batch S21, Orderli is a testament to innovation in hospitality technology.\n\n#### How It Works\nOrderli simplifies the ordering process for guests. There's no need to download an app; instead, patrons can scan a QR code at their table, browse the menu, and place their orders quickly and efficiently. This self-service model minimizes wait times and enhances the dining experience, allowing customers to order at their own pace.\n\nFor staff, Orderli provides a straightforward dashboard app. This gives them real-time visibility into orders placed by guests, enabling efficient communication with the kitchen. The system not only speeds up service but also empowers staff to focus on customer interaction rather than taking orders.\n\nOn the backend, Orderli harnesses predictive analytics. This helps restaurant owners make informed decisions about inventory and menu adjustments, ensuring they serve what customers want while minimizing waste.\n\n#### Target Audience\nOrderli caters specifically to:\n- **Bars and Pubs**\n- **Restaurants**\n- **Hotels**\n- **Festivals**\n\nIts technology is adaptable, making it suitable for various types of hospitality environments. \n\n#### Key Features\n1. **No App Needed:** Guests simply scan a QR code to access the menu and order.\n2. **Real-time Order Management:** Staff can view orders on a tablet, ensuring smooth service.\n3. **Predictive Analytics:** Provides insights to operators for better inventory and menu management.\n4. **Seamless POS Integration:** Orderli integrates smoothly with existing point-of-sale systems.\n\n#### Team and Growth\nThe current team consists of six dedicated employees, all working to refine and promote the platform. The company is scaling up its operations and reaching out to hospitality businesses eager for innovative solutions that enhance efficiency and guest satisfaction.\n\n#### Conclusion\nOrderli is positioned to change how hospitality operates in Europe. With its keen focus on user experience for both guests and staff, along with leveraging smart technology, it holds the potential to become a staple in modern dining and nightlife. If you're in the hospitality business and looking to improve service delivery, give Orderli a try—after all, the first two weeks are free!\n\nFor more information, visit [Orderli’s official website](https://orderli.com/en) or call them at +31 85 303 07 23.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/e1e1a7fbea88e323879b04e368c305a0b59ab1ad.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191615Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=20323c17d7d4fe212d59b3be4e3e1b00cb98c6309d8cee99abeb1c52aa889882",
    "social_links": [
        "https://www.linkedin.com/company/orderli",
        "https://twitter.com/OrderliNL",
        "https://www.facebook.com/Orderli.nl/",
        "https://www.crunchbase.com/organization/orderli"
    ],
    "logo_path": "data/logos\\Orderli_logo.png"
}