{
    "links": "https://www.ycombinator.com/companies/orgorg",
    "name": "OrgOrg",
    "headline": "Organizational productivity suite for companies",
    "batch": "S24",
    "description": "OrgOrg is a suite of apps that keeps teams productive and healthy regardless of the size of your organization. Founded by the creator of Zenter (YC 07, acquired by Google and became Google Slides), OrgOrg is designed to be a natural extension of Google Workspace Apps to help run organizations collaborate better leading to higher productivity.\r\n\nToday the suite includes apps like:\r\n\n• Go links: Go links allows anyone in the org to easily name any link so team members can jump directly to the information that matters most: go/sales, go/production, go/anything-you-want.\r\n• Profiles with Personality: OrgOrg profiles are as insightful as they are delightful. They not only show you the expected org chart data, but also highlight accomplishments, how you like to work, and who you are as a person.\r\n• Goal tracking: Track, share, and collaborate on \"big rock\" goals on the cadence that makes sense for your team from daily to annually.\r\n• Branded New Tab: Keep the team focused the next major milestone, broadcast announcements, and keep important links top of mind every time a new browser tab is opened.\r\n• All Hands Q&A: Crowdsource questions, anonymously if desired, for large team meetings to make sure everyone's voice is heard, and the most top of mind questions are answered and recorded.\r\n• Smart Groups: Create rules based groups of people and use them to make sure the right people are in the right conversations and have the right access. For example, anyone with the title of \"Software Engineer\" should be in the #eng slack channel and eng@ google group.\r\n• On-call: Schedule smart rotations that take into account balancing the load and using signals from calendar schedules to make sure you don't waste time figuring out who can cover what in a fair way. Easily page the on-call from slack, API, or OrgOrg directly.\r\n• And more...\r\n\nAll the tools you need so you can spend more time focusing on your core business, and less time focusing on the complexity that comes from running an organization.",
    "activity_status": "Active",
    "website": "https://orgorg.com",
    "founded_date": 2024.0,
    "team_size": 2.0,
    "location": "Los Altos, CA",
    "group_partner": "Jared Friedman",
    "group_partner_yc": "https://www.ycombinator.com/people/jared-friedman",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:b2b; industry:productivity; industry:collaboration; industry:operations; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Wayne Crosby, Founder/CEO",
            "description": "Wayne is the CEO and founder of OrgOrg, an Organizational Productivity Suite. His first startup, Zenter (W07), was acquired by Google and became Google Slides. Wayne spent 10 years at Google building GSuite, Sign-In with Google, Google+, Applied Machine Intelligence, and more. In 2016, Wayne founded Humu, a company focused on making work better by using software and behavioral change. Humu was acquired by Perceptyx in 2023. Wayne has also been a visiting partner at YC for S23 & W24 batches.",
            "linkedin": "https://www.linkedin.com/in/wcrosby/"
        }
    ],
    "status": true,
    "generated_description": "### OrgOrg: Organizing for Tomorrow\n\n**Overview**  \nLaunched in 2024 and part of the Y Combinator Batch S24, OrgOrg is a fresh entrant from Los Altos, CA, aiming to transform the productivity landscape for organizations of all sizes. Founded by Jared Friedman, the mind behind Google Slides, OrgOrg is a productivity suite built to address the challenges teams face, whether they're just two people or ballooning to hundreds.\n\n**Mission**  \nAt its core, OrgOrg seeks to streamline organizational productivity through its suite of intuitive applications. The mission is simple yet crucial: enhance collaboration and keep teams productive and healthy. \n\n**The Suite of Apps**  \nOrgOrg is not just another tool; it's a comprehensive ecosystem designed to help teams navigate the complexity of modern collaboration. Here are some standout features:\n\n- **Go Links**: Create memorable shortcuts to vital information across the organization. Want to access your sales document? Just type `go/sales`.\n  \n- **Profiles with Personality**: Go beyond basic org chart data. Highlight not just what people do, but who they are—showcasing accomplishments and work preferences. It’s about adding depth to employee profiles.\n\n- **Goal Tracking**: Set, track, and collaborate on big goals. Whether they’re daily targets or annual milestones, everyone stays aligned.\n\n- **Branded New Tab**: Keep focus on upcoming milestones and important announcements right from the start of each browser session.\n\n- **All Hands Q&A**: Foster inclusivity in large team meetings by crowdsourcing questions, ensuring everyone has a platform to voice their thoughts.\n\n- **Smart Groups**: Automatically manage user groups based on rules to ensure the right people are in the right conversations without manual intervention.\n\n- **On-call Management**: Fairly distribute on-call duties by automatically managing schedules based on availability, so your team can focus on their primary tasks instead of logistical hassles.\n\n**Catering to Diverse Needs**  \nWith tools designed to improve both individual productivity and team dynamics, OrgOrg resonates with a range of users—from startups to larger enterprises. The suite integrates seamlessly with existing Google Workspace apps, aligning with the workflows teams already use.\n\n**Cost-Efficiency & Scalability**  \nThe beauty of OrgOrg is in its potential for growth. As businesses expand, they often face rising costs from multiple subscriptions. OrgOrg aims to streamline this by providing an all-in-one solution that minimizes complexity while maximizing utility.\n\n**User Experience**  \nFeedback reflects a positive user experience. Users have highlighted how easy it is to implement the suite and how it enhances day-to-day operations—saving time and increasing effectiveness.\n\n**Conclusion**  \nUltimately, OrgOrg is about simplifying the structure of organizations and making processes transparent and accessible. It champions the idea that productivity shouldn’t come at the expense of employee wellness. With OrgOrg, companies can focus on their core missions, not just the chaos that can come with organizational growth.\n\n**Explore Further**  \nSo, if you’re intrigued, join the productivity revolution at [OrgOrg.com](https://orgorg.com) and see how their tools can empower your team to thrive!",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/08c22a8b24fb3d6fb349b0c4906124b23d3ac57a.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191615Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=bdd709392f9327c11f86a62a0b609fcc0ccef2471a8bbcfaeff42d6271f65725",
    "social_links": [
        "https://www.linkedin.com/company/93273339"
    ],
    "logo_path": "data/logos\\OrgOrg_logo.png"
}