{
    "links": "https://www.ycombinator.com/companies/origami-therapeutics-inc",
    "name": "Origami Therapeutics, Inc.",
    "headline": "Oral drugs to halt neurodegeneration",
    "batch": "W22",
    "description": "Origami Therapeutics, Inc. is a biotech company developing novel protein degraders with potential to delay or halt disease progression by eliminating toxic proteins from the body. Our drug discovery platform leverages our proprietary human disease models developed to select the small molecules with the best chance of clinical success. Our first indication is Huntington’s disease, a debilitating, progressive and ultimately fatal disorder caused by a genetic mutation. We have already identified small molecules that reduce the toxic mutated protein, suppress mutant protein-induced toxicities in human disease neurons and get into the brain. We anticipate that this approach will be broadly applicable to traditionally “undruggable” targets in other neurological diseases.",
    "activity_status": "Active",
    "website": "http://origamitherapeutics.com",
    "founded_date": 2015.0,
    "team_size": 4.0,
    "location": "San Diego, CA",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:biotech; industry:therapeutics; industry:drug-discovery",
    "founders": [
        {
            "name": "Beth Hoffman, Founder",
            "description": "At Origami Therapeutics, Dr. Hoffman is creating a new approach to drug discovery for neurodegenerative diseases. Prior to Origami, she was a Research & Development executive at Vertex Pharmaceuticals, Amgen and Eli Lilly. She has made major contributions to >30 clinical programs in neurology, pain and psychiatry and to four marketed drugs for Cystic Fibrosis. Dr. Hoffman received her A.B. in Molecular Biology from Wellesley College and a Ph.D. in Cell Biology from the Johns Hopkins University.",
            "linkedin": "http://www.linkedin.com/in/bethhoffman"
        }
    ],
    "status": true,
    "generated_description": "**Origami Therapeutics, Inc.** is a San Diego-based biotech company on a mission to combat neurodegeneration through innovative oral drugs. Founded in 2015 and part of Y Combinator’s W22 batch, Origami is raising the bar in drug discovery with its proprietary platform that focuses on developing small molecules designed to selectively eliminate toxic proteins linked to devastating neurological disorders.\n\nAt the core of their approach is a groundbreaking method of protein degradation. The company's science is particularly noteworthy; they’re targeting Huntington’s disease as their first indication. Huntington’s, a genetic disorder marked by the progressive degeneration of nerve cells in the brain, desperately needs more effective treatments. Origami has already identified promising small molecules that not only reduce the levels of the harmful mutated protein but also diminish its toxic effects in human neurons—essentially, they're working on how to fix a problem that many thought was “undruggable.”\n\nWhat sets Origami apart is its focus on “disease-modifying” therapies rather than just symptomatic relief. Their technology aims to tackle multiple neurodegenerative conditions, including Alzheimer’s and Parkinson’s diseases, suggesting that what they build today might help a wide range of patients tomorrow.\n\nThe company operates with a compact yet dedicated team of four employees, reflecting a lean startup ethos that often leads to agile decision-making and creative solutions. They’re leveraging a robust group of partners and advisors to enhance their scientific and commercial strategies, ensuring that they have the guidance necessary to navigate the complex landscape of biotech innovation.\n\nAs Origami Therapeutics pushes forward, they're not just developing drugs; they’re reshaping the future of treatment for neurodegenerative diseases. If you're intrigued, their website is a fantastic resource to learn more about their mission and progress ([Origami Therapeutics](http://origamitherapeutics.com)). \n\nIn essence, Origami is a promising beacon of hope for those affected by neurodegenerative disorders, demonstrating that with bold thinking and solid science, even the toughest challenges can be confronted head-on.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/4b81b31131a670e9a0e73cb954a73b65e91ec3e7.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191615Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=790025011cbafc88e3568a2c763e56d0dda5bac71cac5c554f99293f95d111c0",
    "social_links": [
        "https://www.linkedin.com/company/origami-therapeutics/?viewAsMember=true",
        "https://twitter.com/origamitx",
        "https://www.facebook.com/origamitherapeutics/"
    ],
    "logo_path": "data/logos\\Origami_Therapeutics,_Inc._logo.png"
}