{
    "links": "https://www.ycombinator.com/companies/osmind",
    "name": "Osmind",
    "headline": "Platform for breakthrough mental health research and treatment",
    "batch": "S20",
    "description": "Osmind is the premier platform for clinicians and researchers advancing new life-saving mental health treatments. Today, mental health disorders are one of the leading causes of death worldwide, especially among young adults, and are tied to shortening lifespans. While there have been developments in new psychiatric medications since the first FDA approval in 1954, today there is a growing movement among clinicians, patients, and researchers who are recognizing the need to accelerate new science.\r\n\nThe Osmind treatment platform is the first and only solution that solves specific challenges faced by neuropsychiatric clinics, spanning general psychiatry and interventional psychiatry (transcranial magnetic stimulation, ketamine, SPRAVATO®, psychedelic medicine, electroconvulsive therapy). The core electronic health record (EHR) technology is precisely developed for interventional treatment workflows and designed to support a strong therapeutic alliance, including journaling tools and assistance with health plan reimbursement, which is a significant access hurdle for millions of patients.\r\n\nResearch from our platform is already helping to set new standards for mental health interventions. For example, in the largest published real-world analysis of ketamine infusion therapy for depression, we teamed up with Stanford University School of Medicine to share findings in the Journal of Affective Disorders (March 2022). We have multiple ongoing research studies leveraging our proprietary real-world data, including an even larger ketamine analysis leveraging machine learning to predict treatment outcomes.\r\n\nOsmind is a San Francisco–based public benefit corporation led by scientists, technologists, and psychiatrists. We are backed by top investors including DFJ Growth, General Catalyst, Future Ventures, Tiger Global, and Y Combinator.",
    "activity_status": "Active",
    "website": "https://osmind.org/",
    "founded_date": 2020.0,
    "team_size": 55.0,
    "location": "San Francisco",
    "group_partner": "Jared Friedman",
    "group_partner_yc": "https://www.ycombinator.com/people/jared-friedman",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:mental-health-tech; industry:saas; industry:health-tech; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Lucia Huang, Founder",
            "description": "Lucia Huang is co-founder and CEO of Osmind, which provides software and data for precision mental health. Previously, she ran business and operations at Verge Genomics (S15) and helped scale the company from seed to A. She started her career in healthcare investment banking and investing. Lucia graduated with an MBA from Stanford and a B.S. Chemistry degree from Yale, where she first began to explore her passion for healthcare. She is a proud Californian and loves surfing, cycling, and hiking.",
            "linkedin": "https://www.linkedin.com/in/luciayhuang/"
        },
        {
            "name": "Jimmy Qian, Founder",
            "description": null,
            "linkedin": "https://www.linkedin.com/in/jimmyjqian/"
        }
    ],
    "status": true,
    "generated_description": "**Osmind: Pioneering Mental Health Solutions**\n\nFounded in 2020 and based in San Francisco, Osmind is a public benefit corporation dedicated to transforming mental health care through cutting-edge research and digital solutions. With a team of 55 employees and backed by top-tier investors like Y Combinator, General Catalyst, and Tiger Global, Osmind is at the forefront of addressing one of the most pressing health crises of our time—mental health disorders.\n\n### Mission\n\nOsmind's mission is simple yet profound: create a platform that accelerates breakthrough research and treatment options for mental health issues, which are now leading causes of death globally, particularly among young adults. While new psychiatric medications have emerged since the mid-20th century, Osmind recognizes the urgent need to hasten scientific advances in this field.\n\n### Unique Offerings\n\nWhat sets Osmind apart is its tailored treatment platform designed specifically for neuropsychiatric clinics. It caters to various treatment modalities, including:\n\n- **Transcranial Magnetic Stimulation (TMS)**\n- **Ketamine Therapy**\n- **SPRAVATO®**\n- **Psychedelic Medicine**\n- **Electroconvulsive Therapy (ECT)**\n\nThe platform incorporates a specialized electronic health record (EHR) system, optimized for interventional psychiatry workflows. This technology is not just about data; it’s about enhancing the therapeutic relationship through features like journaling tools and support for health plan reimbursements—a critical barrier for many seeking care.\n\n### Research Collaborations\n\nOsmind is actively engaged in transformative research, including groundbreaking studies in collaboration with Stanford University. One of their significant contributions is the largest real-world analysis of ketamine infusion therapy for depression, which was published in the *Journal of Affective Disorders*. Ongoing research efforts leverage machine learning to analyze real-world data, helping predict treatment outcomes and set new standards in mental health interventions.\n\n### Community and Growth\n\nOsmind is more than just a tech company; it's a network of over 800 independent psychiatry practices committed to advancing mental health treatment and research. This community collaborates to stay ahead of the curve in evidence-based practices, enhancing both clinician success and patient outcomes.\n\n### Vision and Values\n\nAt its core, Osmind is driven by the belief that mental health care needs a quantum shift. Their user-friendly EHR system and robust support network aim to close the gap between scientific innovation and everyday care. For those looking to understand what’s next in mental health, Osmind is a beacon of insight and change.\n\n### Conclusion\n\nIn a world where mental health challenges are increasingly recognized, Osmind stands out as a forward-thinking leader dedicated to advancing the field. If you’re a clinician looking to enhance your practice or a researcher eager to participate in groundbreaking studies, Osmind provides both the technology and community support to help you succeed.\n\n**Check them out at [Osmind.org](https://osmind.org).**",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/56b002f578fbcbc626bafde8b83d4cf406671232.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191616Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=9f05fc6e575b4880d84f54a09f92db2fab096389a3cf07f14d0f82002abec133",
    "social_links": [
        "https://www.linkedin.com/company/65320902",
        "https://twitter.com/OsmindHQ",
        "https://www.facebook.com/Osmind-110354937319541/",
        "https://www.crunchbase.com/organization/osmind"
    ],
    "logo_path": "data/logos\\Osmind_logo.png"
}