{
    "links": "https://www.ycombinator.com/companies/outrival-inc",
    "name": "OutRival, Inc.",
    "headline": "AI Agents for Admissions Teams in Higher Education",
    "batch": "W19",
    "description": "OutRival empowers customer experience teams to create and deploy Conversational AI Agents that leverage existing resources, cut costs, and grow revenue. Starting with Admissions Teams in Higher Education.",
    "activity_status": "Active",
    "website": "https://outrival.com/",
    "founded_date": 2018.0,
    "team_size": 6.0,
    "location": "San Francisco",
    "group_partner": "Michael Seibel",
    "group_partner_yc": "https://www.ycombinator.com/people/michael-seibel",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:education; industry:b2b; industry:customer-service; industry:ai; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Ruben A. Harris, Founder",
            "description": "Ruben Harris is the Co-Founder and CEO of OutRival, an AI platform transforming Customer Experience with Conversational AI, starting with Admissions Teams in Higher Education. OutRival owns Career Karma, which has helped thousands of people navigate career transitions.",
            "linkedin": "https://www.linkedin.com/in/rubenharris/"
        },
        {
            "name": "Timur Meyster, Founder",
            "description": "Timur is the Co-Founder and Chief Product Officer of OutRival, an AI platform transforming Customer Experience with Conversational AI, starting with Admissions Teams in Higher Education. OutRival owns Career Karma, which has helped thousands of people navigate career transitions.",
            "linkedin": "https://www.linkedin.com/in/timurmeyster/"
        }
    ],
    "status": true,
    "generated_description": "**OutRival, Inc.**  \nFounded in 2018 and a proud member of Y Combinator's W19 batch, OutRival, Inc. is based in San Francisco and is making significant strides in the world of higher education admissions. With a lean team of just six employees, they're focused on transforming how customer experience teams, specifically those in admissions, interact with potential students through the power of AI.\n\n**Mission**  \nOutRival's mission is clear: empower admissions teams in higher education with Conversational AI Agents that not only streamline operations but also enhance customer engagement. The goal is to provide a cost-effective solution that improves customer experiences while driving revenue growth. They understand that the admissions process can be overwhelming and aim to simplify it through intelligent automation.\n\n**Product Offering**  \nThe platform OutRival offers enables customer experience teams to create and deploy AI agents that can engage with prospects via voice, chat, or text. These agents can handle common inquiries, automate tasks, and contribute to lead conversion—all tailored to the specific needs of the institution. By fostering a self-sufficient team environment, OutRival allows organizations to innovate without heavy reliance on IT resources.\n\nA standout feature is the ability for teams to integrate preferred AI models, whether they are open-source or proprietary. This flexibility not only customizes the experience but also ensures that institutions can tap into existing data to deliver contextually relevant responses.\n\n**Security & Integration**  \nOutRival takes data security seriously, boasting SOC 2 compliance which underscores their commitment to safeguarding customer data. They ensure that all communications and data are encrypted, and they provide robust access controls—allowing educational institutions to confidently adopt AI into their workflows.\n\n**Customer Success Stories**  \nThe testimonials from clients reveal a consistent theme: OutRival listens. By taking the time to understand unique business challenges, they tailor AI solutions that genuinely drive efficiency and revenue. From co-founders to CTOs, clients appreciate the collaborative approach that OutRival takes in setting up and enhancing their AI capabilities.\n\n**Tagline**  \nWith a philosophy of \"Don’t just compete. OutRival,\" the company is poised to lead the charge in reimagining customer interactions in higher education. They invite others to join them in harnessing AI that is not only powerful but easy to deploy.\n\n**Visit OutRival**  \nTo learn more about how OutRival can shape the future of customer experiences in education, check out their website at [OutRival.com](https://outrival.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/da0c9382f40ad06ceaf6c4a43b054dc38bc0257f.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191617Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=0d1837f8851d58e5006b0b15b9a0ca6959ae38f0a0d7372de9b6f66f34e73f26",
    "social_links": [
        "https://www.linkedin.com/company/outrivalai/",
        "https://x.com/outrivalai",
        "https://www.facebook.com/outrivalAI"
    ],
    "logo_path": "data/logos\\OutRival,_Inc._logo.png"
}