{
    "links": "https://www.ycombinator.com/companies/outschool",
    "name": "Outschool",
    "headline": "A live online learning platform that empowers kids ages 3â\u0080\u009318.",
    "batch": "W16",
    "description": "Outschool is an innovative education platform that offers a variety of engaging, small-group classes online. Unlike traditional classes, Outschool classes give kids the unique opportunity to explore their interests in-depth via interactive, live video by experienced, independent educators.\r\n\nWhen Outschool was founded in 2015, homeschoolers were the first to discover our classes, but it wasnâ\u0080\u0099t long before kids in conventional schools began supplementing their education with fun and unique, interest-based classes. During the COVID-19 pandemic, Outschool became vital to families who wanted to keep kids learning, social, and pursuing their passions.\r\nToday, Outschool offers more than 140,000 live online classes to more than 1,000,000 learners in 183 countries worldwide.",
    "activity_status": "Active",
    "website": "http://outschool.com",
    "founded_date": 2015.0,
    "team_size": 107.0,
    "location": "San Francisco",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:education; industry:marketplace; location:san-francisco-bay-area",
    "founders": [],
    "status": true,
    "generated_description": "**Company Overview: Outschool**\n\nFounded in 2015 and based in San Francisco, Outschool is a vibrant online learning platform dedicated to empowering kids aged 3 to 18. The platform offers a flexible and engaging alternative to traditional education through small-group classes taught live by experienced, independent educators. \n\n**Mission and Vision**\n\nOutschool's mission centers around creating a learning environment that prioritizes curiosity and exploration. Unlike conventional education systems, Outschool allows children to delve deeply into topics of interest using interactive, real-time video technology. This focus on personalized learning became particularly vital during the COVID-19 pandemic, as families sought ways to keep their children engaged, learning, and socialized.\n\n**Growth and Reach**\n\nInitially, Outschool gained traction among homeschoolers, but it quickly expanded its reach to include kids in traditional schooling environments looking for supplementary education. As of today, the platform boasts more than 140,000 live classes, catering to over a million learners across 183 countries—an impressive scale that marks its significance in the modern educational landscape.\n\n**Key Features and Offerings**\n\n1. **Diverse Class Topics:** Outschool provides a wide variety of subjects, ranging from arts, coding, and foreign languages to life skills and more traditional academic subjects such as math and science.\n   \n2. **Flexible Scheduling:** The platform accommodates various learning styles and schedules, allowing students to pick classes that fit their individual needs.\n\n3. **Qualified Educators:** With over 10,000 experienced teachers, Outschool ensures that learners receive high-quality instruction and guidance, fostering a rich educational experience.\n\n4. **Community Building:** The interactive format of classes not only encourages learning but also helps children build friendships and community connections around shared interests.\n\n**Innovative Approach to Learning**\n\nOutschool exemplifies the benefits of a marketplace approach to education. By connecting curious learners with passionate educators, it creates a tailored and engaging learning environment. Kids can explore hobbies, enhance skills, or tackle difficult subjects in a supportive setting—a model that resonates well with both parents and children.\n\n**Conclusion**\n\nIn a world increasingly driven by technology and personalized experiences, Outschool stands out as a meaningful innovation in education. It’s a platform that thrives on empowering the next generation, equipping them with knowledge, skills, and the confidence to pursue their passions. \n\nFor more information, visit [Outschool's website](http://outschool.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/acecba1c86617858d5f45988f48bb1d3d7bcd8fe.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191617Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=5bbf8f075937458ccf2b81c736a447d29c52b7f53dee541a7d1fc1484aa78ccd",
    "social_links": [
        "https://www.linkedin.com/company/outschool/",
        "https://twitter.com/outschool",
        "https://www.facebook.com/outschool/",
        "https://www.crunchbase.com/organization/outschool"
    ],
    "logo_path": "data/logos\\Outschool_logo.png"
}