{
    "links": "https://www.ycombinator.com/companies/outtalent",
    "name": "Outtalent",
    "headline": "We help top engineers in emerging markets get jobs abroad atâ\u0080¦",
    "batch": "S19",
    "description": "Outtalent helps top engineers from emerging markets get jobs abroad at companies like Google.\r\n\nWe started Outtalent because we believe that talent is equally distributed, but opportunity is not and emerging markets have an exceptional number of great but undervalued engineers. We believe getting a job at one of the worldâ\u0080\u0099s best companies sets people on a great path to realize their full potential.\r\n\nOuttalent is funded by YCombinator, world-class venture capital funds, executives from Google and Facebook, and other angel investors who are passionate about our mission. We have already helped software engineers from Russia, Ukraine and Central Asia get jobs at Google, Amazon, Microsoft and many other companies in the US, Canada, and Europe.",
    "activity_status": "Active",
    "website": "http://outtalent.com",
    "founded_date": 2019.0,
    "team_size": 2.0,
    "location": "San Francisco",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:education; industry:emerging-markets; location:san-francisco-bay-area",
    "founders": [],
    "status": true,
    "generated_description": "Outtalent is a promising start-up born in 2019, out of the need to bridge the gap for talented engineers from emerging markets. It began with a clear mission: to help exceptional engineers secure positions at leading tech companies, including the likes of Google and Amazon. It's based in San Francisco and part of Y Combinator's Batch S19, which adds a significant stamp of credibility to its venture.\n\nAt its core, Outtalent believes in the principle that talent is distributed evenly around the globe, but opportunities often aren’t. By recognizing and harnessing the potential of undervalued engineers in emerging markets, Outtalent is taking steps to align their talent with opportunities in countries like the US, Canada, and Europe. They’ve already made strides in helping software engineers from regions like Russia, Ukraine, and Central Asia transition into robust tech roles.\n\nThe company's model is straightforward yet powerful: it offers a structured, online career acceleration program. The program focuses on areas critical to excelling in tech interviews, including algorithms, systems design, and behavioral prep. With support from mentors who are engineers at top tech firms, participants receive tailored training designed to enhance their skills and confidence.\n\nParticipants can choose between two tracks: \"Everest\" for more experienced engineers and \"Wonder,\" which is female-only, targeting newer graduates. The program is not just about getting a job; it’s designed to nurture the participants' careers through a tight-knit, supportive community—essentially a fellowship.\n\nFinancially, Outtalent's approach makes sense. They charge a modest $1,000 fee at the start and take a 10% cut from the first two years of the pre-tax salary—only if the participant lands a job. This aligns their success with the success of their fellows.\n\nTheir data speaks volumes: Outtalent has facilitated over 165 job offers, with first-year compensation averaging $200,000. For many engineers looking to transition internationally, having access to this kind of network and support is invaluable.\n\nTo wrap it up, Outtalent isn’t just about finding jobs; it’s about creating meaningful careers and a network of like-minded individuals. If you're an engineer hungry for new opportunities and a thriving community, you might just find your next step with Outtalent. \n\nFor more information, check out their website at [Outtalent](http://outtalent.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/bfe13a0897afb19ed37e905f4a0be8e9fcdd7da0.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191617Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=b987e35fb279931410430719c402a5e2f7b45a51e747781d373d9b69a7be01c5",
    "social_links": [
        "https://www.linkedin.com/company/outtalent/",
        "http://twitter.com/teamouttalent"
    ],
    "logo_path": "data/logos\\Outtalent_logo.png"
}