{
    "links": "https://www.ycombinator.com/companies/overstand-labs",
    "name": "Overstand Labs",
    "headline": "Leverage your customer comms to get into Founder Mode",
    "batch": "W25",
    "description": "If you’re a founder and feel like you—or your exec team—are too far removed from the customer, Overstand is here to help. We’re the platform (and API) for your customer communications, turning Slack, emails, WhatsApp, call recordings, and more into actionable insights. For example, we can help you discover feature requests hidden in customer emails, spot upsell opportunities from a casual Slack message, or identify a critical support issue buried in a call transcript -- all without having to depend on others in your company to fill out a form or write meeting notes.\r\n\nGet back to Founder Mode by spotting trends, uncovering growth opportunities, and staying deeply connected to your customers. Overstand makes it easy to understand where you’re needed most and take action that drives impact. 🚀",
    "activity_status": "Active",
    "website": "https://overstandlabs.com",
    "founded_date": 2024.0,
    "team_size": 4.0,
    "location": "San Francisco",
    "group_partner": "Michael Seibel",
    "group_partner_yc": "https://www.ycombinator.com/people/michael-seibel",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:artificial-intelligence; industry:customer-success; industry:api; industry:customer-support; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Derrick Cheng, Founder",
            "description": "Co-Founder of Overstand Labs | Ex-Meta | AI @ Berkeley",
            "linkedin": "https://www.linkedin.com/in/chengderrick"
        },
        {
            "name": "Mihir Patil, Founder",
            "description": "Co-founder of Overstand Labs. California Native. Ex-Palantir. Faculty @ NYU. Go Bears!",
            "linkedin": "https://www.linkedin.com/in/mihirnpatil/"
        }
    ],
    "status": true,
    "generated_description": "**Overstand Labs: Bridging the Gap Between Founders and Customers**\n\nFounded in 2024 and part of Y Combinator’s Batch W25, Overstand Labs is on a mission to connect founders with their customers in a meaningful way. If you’re a startup leader feeling distant from the conversations that shape your product, Overstand has your back. Its platform and API turn everyday customer communications—think Slack, email, WhatsApp, and call recordings—into actionable insights without adding clutter to your workflow.\n\n### What They Do\n\nOverstand makes it incredibly easy to tap into crucial customer feedback that often gets lost in the noise. Whether it's discovering feature requests buried in emails or spotting upsell opportunities from casual chats on Slack, the platform aggregates and analyzes data to spotlight trends and growth opportunities. This way, founders can reclaim their “Founder Mode,” empowering them to take swift, impactful actions based on real-time customer interactions.\n\n### Key Features\n\n1. **Centralized Communication**: Overstand pulls together insights from various channels—ensuring nothing slips through the cracks.\n2. **Real-Time Alerts**: Be the first to know when multiple customers face the same issue or ask for the same feature.\n3. **Data-Driven Decision Making**: Every insight is based on actual conversations, giving clarity and context to trends and fluctuations in customer sentiment.\n4. **Integration Ready**: The platform speaks the language of your existing tools, whether it’s support queues, emails, or call logs.\n5. **AI-Driven Insights**: Leverage machine learning to identify potential problems before they escalate.\n\n### Target Audience and Use Cases\n\nOverstand is particularly useful for companies in tech-heavy industries like wind energy or construction, where varied communication channels often lead to fragmented insights. Imagine a construction software provider managing requests from multiple firms via various platforms; Overstand simplifies this by unifying the insights.\n\n### Team and Leadership\n\nSituated in San Francisco, Overstand Labs is a lean team of four, led by an experienced Group Partner, Michael Seibel. Their agile approach allows them to rapidly iterate and adapt their offerings in response to user feedback.\n\n### Why It Matters\n\nIn today’s fast-paced digital environment, leaders need to stay connected to their customers without adding layers of complexity. Overstand Labs is here to help by creating an effortless way to turn everyday conversations into strategic intelligence. This not only boosts productivity but also enriches the decision-making process, ultimately leading to better products and happier customers.\n\nReady to transform your customer conversations into impactful decisions? Check out Overstand Labs at [overstandlabs.com](https://overstandlabs.com) for more.\n\nIn summary, Overstand Labs is an essential partner for any founder looking to enhance their connection to customers and streamline how feedback translates to actions that matter.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/7f172b3108877930085c46a3b4acaf55ec929e78.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191617Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=6ff89d89854476432fe908a7db3bdcc89c170b514f8878c20e966566cc62806f",
    "social_links": [
        "https://www.linkedin.com/company/overstand-labs/",
        "https://x.com/OverstandLabs"
    ],
    "logo_path": "data/logos\\Overstand_Labs_logo.png"
}