{
    "links": "https://www.ycombinator.com/companies/ownlocal",
    "name": "OwnLocal",
    "headline": "OwnLocal automates marketing for over 129,000 SMBs through 3,300â\u0080¦",
    "batch": "W10",
    "description": "OwnLocal works with more than 3,300+ local media companies to transform their legacy customers base into sophisticated local digital advertisers. Our technology has been designed to work seamlessly with your current sales processes and makes it simple for any newspaper, radio station, or broadcast television station to help your local customers win online.",
    "activity_status": "Active",
    "website": "http://ownlocal.com",
    "founded_date": null,
    "team_size": 45.0,
    "location": "Austin, TX",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:marketing; industry:smb; location:austin",
    "founders": [],
    "status": true,
    "generated_description": "**OwnLocal: Simplifying Local Marketing for SMBs**\n\nOwnLocal is a dynamic company dedicated to automating marketing for over 129,000 small and medium-sized businesses (SMBs) through collaboration with more than 3,300 local media companies. Based in Austin, Texas, and operating with a team of 45 talented individuals, OwnLocal's core mission is to transform the way these businesses approach digital advertising.\n\nFounded as part of Y Combinator's Winter 2010 Batch, OwnLocal started with a clear vision: to help local media outlets leverage their existing customer bases by turning them into sophisticated local digital advertisers. Their technology is designed to integrate smoothly with current sales processes, making it significantly easier for newspapers, radio stations, and TV stations to assist their local clients in thriving online.\n\nWhether you’re part of a community newspaper or a local broadcast station, OwnLocal’s tools empower you to enable your customers to win in the digital landscape. It's all about local growth—helping these businesses find their footing online without the extra overhead that typically comes with digital marketing efforts.\n\nIn summary, if you’re an SMB looking to take your digital marketing to the next level, OwnLocal is the partner you want in your corner. You can learn more about their services and solutions at [ownlocal.com](http://ownlocal.com). \n\n**Tags:** Marketing, SMB, Austin",
    "logo": "/logos/medium/missing.png",
    "social_links": [
        "https://www.linkedin.com/company/ownlocal/",
        "https://www.crunchbase.com/organization/ownlocal",
        "https://github.com/OwnLocal"
    ]
}