{
    "links": "https://www.ycombinator.com/companies/paces",
    "name": "Paces",
    "headline": "Siting and Due Diligence of Green Projects",
    "batch": "S22",
    "description": "In the next 30 years, the world will transform every part of the built environment to be climate positive green infrastructure. Knowing what, where, and how to build infrastructure like solar farms and data centers is one of the great opportunities of our time.\r\n\nPaces is software for green infrastructure developers to identify the best places to build and manage their projects. Our software supports renewable energy, EV charging, carbon sequestration and data center customers with interconnection, permitting and siting of their projects.",
    "activity_status": "Active",
    "website": "https://paces.com",
    "founded_date": 2022.0,
    "team_size": 30.0,
    "location": "New York",
    "group_partner": "Nicolas Dessaigne",
    "group_partner_yc": "https://www.ycombinator.com/people/nicolas-dessaigne",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:artificial-intelligence; industry:saas; industry:proptech; industry:climate; industry:energy; location:new-york",
    "founders": [
        {
            "name": "James McWalter, Founder",
            "description": "I’m the co-founder and CEO of Paces. Originally from Ireland, previously I was the founder of Hale, a personal training marketplace and held senior roles at Google acquired ML startup Hello Vera, B2B marketplace Respondent and fintech giant FactSet.",
            "linkedin": "https://www.linkedin.com/in/jamesmcwalter/"
        },
        {
            "name": "Charles Bai, Founder",
            "description": "Charles is the co-founder and CTO of Paces. Before Paces, Charles led the AI efficiency effort at Facebook AI, where he worked on large model inferences and designed and built metrics to track the power/carbon cost of AI models. Before that, he worked at a few different startups and built multiple data-intensive software solutions. Charles grew up in Beijing and holds a CS degree from Cornell.",
            "linkedin": "https://www.linkedin.com/in/charlesxbai/"
        }
    ],
    "status": true,
    "generated_description": "**Company Overview: Paces**\n\nFounded in 2022 and based in New York, Paces is a forward-thinking company poised to capitalize on the green infrastructure revolution. The firm emerged from Y Combinator's S22 batch and has gathered a team of 30 dedicated employees, under the guidance of Group Partner Nicolas Dessaigne. \n\n**Mission Statement:**\nPaces aims to facilitate the siting and due diligence of green projects, enhancing how developers approach renewable energy, EV charging, carbon sequestration, and data centers. The company's belief is simple yet profound: in the next three decades, every aspect of the built environment will need to transition towards climate-positive infrastructure. With such a massive shift on the horizon, knowing where and how to build these projects is a tremendous opportunity.\n\n**What They Do:**\nPaces offers innovative software tailored specifically for green infrastructure developers. Their solutions simplify the complex tasks surrounding project development by automating the identification of optimal sites, managing interconnections, and navigating permitting requirements. Essentially, they remove the tedious legwork that typically bogs down development teams, allowing them to focus more on execution rather than paperwork. \n\n**Key Features:**\n1. **Market Suitability**: Analyze over 155 million sites to find the best markets for specific strategic needs.\n2. **Site Selection & Ranking**: Access a database of pre-vetted, risk-assessed sites to make informed decisions faster.\n3. **Development Support**: Provides customized solutions and risk assessments to enhance project success rates.\n\n**Current Initiatives:**\nPaces actively publishes insights, including the latest edition of the Renewable Energy Trends report, which offers data-driven guidance on solar site selection. They also offer resources like case studies, blogs, and podcasts to keep their customers informed and engaged.\n\n**Impact and Goals:**\nBy enabling developers to make informed decisions quickly and efficiently, Paces aims to reduce development time and costs significantly—potentially by as much as 50%. Their ultimate goal is to accelerate the deployment of renewable energy projects and empower businesses to build sustainable solutions for the future.\n\n**Explore More:**\nFor more information, you can visit their website at [paces.com](https://paces.com), where they offer various resources and opportunities to engage directly with their team.\n\nIn a world where we're racing against climate change, Paces positions itself as a crucial ally for those daring enough to innovate in the green infrastructure space. If you’re part of this frontier, it might be worth checking them out.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/b1592902d0b28f84b9a6338762c417683fca1732.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191618Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=41e9089d61fdab8f8e827d93ee73d17a80cc189fee89e9cc1b55453b44fbf941",
    "social_links": [
        "https://www.linkedin.com/company/pacesai",
        "https://twitter.com/paces_ai",
        "https://www.facebook.com/pacesaico",
        "https://www.crunchbase.com/organization/paces-ai"
    ],
    "logo_path": "data/logos\\Paces_logo.png"
}