{
    "links": "https://www.ycombinator.com/companies/pachama",
    "name": "Pachama",
    "headline": "Restoring nature to solve climate change.",
    "batch": "W19",
    "description": "Pachama is a leading climate-tech company harnessing cutting-edge technologies such as computer vision and satellites to drive funding to effective reforestation and conservation projects that sequester carbon, enhance biodiversity and enrich local communities around the world.\r\n\nThrough a tech-verified marketplace that counts as customer the likes of Amazon, Airbnb, Netflix and Nespresso, the company drives capital to forests in Brazil, Mexico, India, the USA and beyond. The company is backed by top investors such as Bill Gates' BEV, Chis Sacca's LowerCarbon, Amazon Climate Pledge among others. \r\n\nThe company is fully remote and driven by a strong sense of purpose.",
    "activity_status": "Active",
    "website": "http://pachama.com",
    "founded_date": 2018.0,
    "team_size": 85.0,
    "location": "San Francisco",
    "group_partner": "Gustaf Alstromer",
    "group_partner_yc": "https://www.ycombinator.com/people/gustaf-alstromer",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:carbon-capture-and-removal; industry:machine-learning; industry:climate; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Diego Saez Gil, Founder",
            "description": "Diego Saez Gil, Pachama's founder and CEO, is a serial technology entrepreneur and environmentalist. Born and raised in the north of Argentina, Diego saw first hand the impacts of deforestation and climate change which drove him to start a company to tackle this challenge. Prior to Pachama, Diego co-founded Bluesmart (YC W15) and WeHostels. He's an avid book reader and mountain hiker.",
            "linkedin": "https://www.linkedin.com/in/dsaezgil"
        },
        {
            "name": "Tomas Aftalion, Founder",
            "description": null,
            "linkedin": "https://www.linkedin.com/in/tomasaftalion/"
        }
    ],
    "status": true,
    "generated_description": "**Pachama: Restoring Nature to Tackle Climate Change**\n\nFounded in 2018 and based in San Francisco, Pachama is a dynamic climate-tech company on a mission to harness technology for reforestation and biodiversity conservation. By using cutting-edge tools like computer vision and satellite imagery, Pachama enables businesses to effectively invest in nature and counter climate change. They’ve created a tech-verified marketplace connecting top companies like Amazon, Airbnb, Netflix, and Nespresso with impactful reforestation projects globally, including in Brazil, Mexico, India, and the USA.\n\nWhat sets Pachama apart is its strong backing from influential investors—think Bill Gates' Breakthrough Energy Ventures and Chris Sacca's Lowercarbon Capital—solidifying its position in the climate-tech arena. With a fully remote team of 85 employees, Pachama is not just about trees; it's about enhancing local ecosystems and improving livelihoods while sequestering carbon.\n\nTheir end-to-end platform allows companies to source, evaluate, and monitor carbon projects, employing a rigorous DMRV (data measurement, reporting, and verification) process. This technology not only brings transparency but also fosters trust in carbon investments—essential in an era where environmental accountability is crucial.\n\nPachama operates with a clear set of offerings: businesses can invest in nature or develop and submit reforestation projects via their intuitive platform. Their comprehensive resources and success stories, such as partnerships with Google and the Boston Consulting Group, showcase the tangible impact of their approach.\n\nAs environmental concerns escalate, Pachama stands at the forefront, turning innovative tech solutions into actionable pathways for sustainable growth. If you're looking to combine purpose with investment, Pachama is here to guide you on how to effectively make a difference.\n\nIf you're keen on learning more, visit [Pachama's website](http://pachama.com) to explore their projects and initiatives.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/9ff3da9a4752ff8682278f51c92e8960b5ccb9b5.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191618Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=ec89961407ea47bd365860037e3bbcce85574642da4ec1637fef31cebca859ef",
    "social_links": [
        "https://www.linkedin.com/company/pachama/",
        "https://twitter.com/pachamainc",
        "https://www.crunchbase.com/organization/pachama",
        "https://github.com/pachama"
    ],
    "logo_path": "data/logos\\Pachama_logo.png"
}