{
    "links": "https://www.ycombinator.com/companies/pactima",
    "name": "Pactima",
    "headline": "Live video signing for real-time agreements",
    "batch": "S21",
    "description": "Pactima is a value-centric, fast-growing, and venture-backed company that’s transforming the manner in which businesses conduct transactions in our remote world.\r\n\nOur flagship product, Live eSignatures<sup>TM</sup>, is a real-time solution that allows people to view and sign documents while simultaneously hosting a secured video call. This easy-to-use solution allows transactions that could only be done in-person to now be performed online.",
    "activity_status": "Active",
    "website": "https://pactima.com/",
    "founded_date": 2020.0,
    "team_size": 3.0,
    "location": "Ottawa, Canada",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:documents; industry:saas; industry:b2b",
    "founders": [
        {
            "name": "Moktar Yusuf, Founder",
            "description": "Co-founder & CEO of Pactima.",
            "linkedin": "https://www.linkedin.com/in/moktar-yusuf/"
        },
        {
            "name": "Joel Kapongo, Founder",
            "description": "Co-founder & CTO of Pactima. Focused on tech and moving the business forward. Son of Congo, adopted by Canada.",
            "linkedin": "https://www.linkedin.com/in/joelkapongo"
        }
    ],
    "status": true,
    "generated_description": "### Pactima: The Future of Real-Time Agreement Signing\n\nPactima is a venture-backed SaaS startup based in Ottawa, Canada, established in 2020. They emerged from the renowned Y Combinator's Batch S21, positioning themselves as a forward-thinking company poised to transform how businesses handle transactions in a world increasingly reliant on remote interactions. Their mission? To provide live video signing for real-time agreements—making what was once a physical chore into a streamlined online process.\n\nAt the heart of their offering is **Live eSignatures™**, a unique product that combines the familiar action of signing documents with the immediacy of video conferencing. This means that businesses can conduct secure, real-time document executions while ensuring face-to-face engagement—something that’s especially beneficial for high-stakes transactions.\n\nPactima's toolset is tailored for various industries, including:\n\n1. **Financial Services:** Simplifying complex signing workflows.\n2. **Legal:** Facilitating secure signatures for contracts and compliance documents.\n3. **Real Estate:** Expediting transaction closures through a robust eSignature platform.\n4. **Human Resources, Sales, and more:** Streamlining workflows to enhance productivity.\n\nTheir product lineup extends beyond just eSignatures. They offer a comprehensive suite that includes:\n\n- **Standard eSignatures:** Quick and simple signing without the need for amendments.\n- **In-Person eSignatures:** Facilitating digital signing on-site without complicated app downloads.\n- **eNotary Services:** Compliant remote online notarization, safeguarding the authenticity of signed documents.\n\nPactima emphasizes security, boasting industry-standard certifications like SOC 2 Type II, ensuring that document integrity and client data protection are central to their operations. They employ advanced encryption methods and configurable data residency options, allowing businesses to maintain strict control over their documentation.\n\nWith a compact team of just three employees and a strong partnership with nan (a reference perhaps to their growth strategy), Pactima embodies the agile and innovative spirit of modern startups. \n\nAs businesses continue to adapt to remote operations, tools like Pactima's will become invaluable for easing the complexities of signing and notarizing documents. Their user-friendly solutions are designed for all business types, whether you’re closing real estate deals or streamlining employee onboarding processes.\n\nInterested in learning more about how Pactima can revolutionize your document handling? You can dive into the specifics on their website: [Pactima](https://pactima.com).\n\nIn short, Pactima is making the traditionally cumbersome process of document signing not only easier but also more secure and engaging—truly a game-changer in today’s digital-first world.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/c77fdaf98d7168b1c276538c75bae4a03baa9c06.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191618Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=00d242784862e8e349da1e31d820e3eb1c29ceab52c51bae1cacc33dbc84195c",
    "social_links": [
        "https://www.linkedin.com/company/pactimo/",
        "https://twitter.com/pactimaHQ"
    ],
    "logo_path": "data/logos\\Pactima_logo.png"
}