{
    "links": "https://www.ycombinator.com/companies/padlet",
    "name": "Padlet",
    "headline": "Papyrus â\u0086\u0092 Parchment â\u0086\u0092 Paper â\u0086\u0092 Padlet",
    "batch": "W13",
    "description": "We are easily bored. It's the one thing that unites humanity in 2020. No one wants to read twenty paragraphs of text, or sit through forty verbose slides. Yet, we keep making them, boring everyone out of their minds.\r\n\nWe are building more beautiful and fun alternatives to traditional documents. They're less of a pain-in-the-ass to create, and a lot less waterboard-y to view.\r\n\nCheckout a Padlet timeline (https://padl.et/timeline), or a Padlet map (https://padl.et/map) to see what we're talking about. \r\n\nOver ten million people all over the world use Padlet. Most satisfyingly, for millions of kids, Padlet is their first experience of creating things on the Internet.\r\n\nPeople say we are improving education. People say we are making them more creative. People say a lot of things.",
    "activity_status": "Active",
    "website": "https://padlet.com",
    "founded_date": 2012.0,
    "team_size": 40.0,
    "location": "San Francisco",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:education; industry:saas; location:san-francisco-bay-area",
    "founders": [],
    "status": true,
    "generated_description": "**Padlet: Transforming How We Create and Share Ideas**\n\nPadlet is a dynamic company that's reshaping the landscape of digital documentation and creative expression. Founded in 2012 and hailing from the Y Combinator Batch W13, this San Francisco-based startup operates with a lean team of 40 dedicated employees. Their mission can be summed up simply: transition from the traditional, often tedious forms of content creation—think papyrus to parchment to paper—to an engaging platform that truly resonates with users. \n\nIn 2020, amidst a global wave of boredom stemming from monotonous online presentations and overflowing text, Padlet emerged as a remedy. People were tired of sifting through endless paragraphs and overwhelming slideshows. Padlet offers a refreshing alternative—an intuitive and visually pleasing way to create and interact with documents. It's all about reducing the hassle of creation and making the experience enjoyable for both creators and viewers.\n\nWith over ten million users worldwide, Padlet has carved a niche not only in educational environments, where it’s frequently credited with enhancing learning experiences, but also as a canvas for creativity. Importantly, many young users discover their potential for creating online content through Padlet, marking a significant step in their digital journey.\n\nCurious about what Padlet can do? Check out their timelines and maps featured on their website. They’re not just tools; they represent a shift toward a much-needed evolution in how information is shared and consumed. \n\nWith a focus on making creation pain-free and engagement fun, Padlet is successfully tapping into the core of what many educators and creatives want. It’s garnered recognition in various fields, particularly in education, as a tool that not only engages but inspires innovation. \n\nSo if you’re looking to break away from the uninspiring document norms, dive into Padlet’s world. Their vision isn’t just about providing a service; it’s about fostering a more colorful, engaging process of sharing knowledge and creativity. \n\nFor more information, visit [Padlet’s website](https://padlet.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/6209b2c7ac0e299a4b080a711c8f013750dd8b1e.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191618Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=6c765ef62ebd9d82e16fb0f2edcca6625b5549e44aba2a49c7849d60a8edaa34",
    "social_links": [
        "https://www.linkedin.com/company/wallwisher",
        "https://twitter.com/padlet",
        "https://www.facebook.com/padlet",
        "https://www.crunchbase.com/organization/padlet",
        "https://github.com/padlet"
    ],
    "logo_path": "data/logos\\Padlet_logo.png"
}