{
    "links": "https://www.ycombinator.com/companies/pahamify",
    "name": "Pahamify",
    "headline": "College entrance test preparation App for students in Indonesia",
    "batch": "W20",
    "description": "Pahamify is an online learning platform for K-12 students in Indonesia. We provide high quality educational videos which can be used to learn various concepts ranging from math, science, social sciences, and language based on the local curriculum. We also provide thousands of practice questions and modules which can be used for college entry test preparation.",
    "activity_status": "Active",
    "website": "https://pahamify.com/",
    "founded_date": 2018.0,
    "team_size": 40.0,
    "location": "Indonesia",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:education",
    "founders": [],
    "status": true,
    "generated_description": "Pahamify is an innovative educational platform based in Indonesia, dedicated to helping students prepare for college entrance exams effectively. Founded in 2018 and part of Y Combinator's Winter 2020 batch, Pahamify started as an online learning platform for K-12 students, offering a wide range of high-quality educational videos covering subjects like math, science, and social sciences, all tailored to the local curriculum.\n\nAs of now, Pahamify has pivoted to focus heavily on college entrance test preparation, providing thousands of practice questions along with various tools designed to help students succeed in exams like UTBK, SNBP, and SNBT. Their mission is clear: to equip Indonesian students with the necessary knowledge and confidence to excel in their academic pursuits.\n\nThe company is a bustling hub of about 40 employees and boasts partnerships with valuable educational organizations. They also provide a unique feature called \"Rockstar Teacher,\" where experienced instructors guide students through interactive learning sessions.\n\nPahamify's offerings include engaging animated videos to make learning enjoyable, personalized practice through their \"Pegasus\" feature, and a robust question bank for comprehensive exam preparation. They engage over a million students who have downloaded their app, which provides tools like TryOut sessions, live classes, and access to educational resources that keep learners informed and engaged.\n\nFor more information on their product offerings, you can visit their website [Pahamify.com](https://pahamify.com). This platform not only aims to elevate educational standards but also seeks to make quality learning accessible and fun for students across Indonesia. So, if you're eager to tackle college entrance exams or simply enhance your understanding of various subjects, Pahamify might just be the perfect study companion.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/c6c4ce88e33e544bac6af7fafba9eb47e832cfac.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191619Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=42755c43b8d6dda5c436474af83ed1124004803eaa4c70f78797b33289d6fbcd",
    "social_links": [
        "https://www.linkedin.com/company/pahamify/",
        "https://twitter.com/pahamify",
        "https://www.facebook.com/pahamify/"
    ],
    "logo_path": "data/logos\\Pahamify_logo.png"
}