{
    "links": "https://www.ycombinator.com/companies/pair-team",
    "name": "Pair Team",
    "headline": "Connecting underserved communities to high quality care",
    "batch": "S19",
    "description": "Pair Team cares for the highest-need Medicaid recipients through a community-led, virtual care model. We take responsibility for the whole person by addressing not just clinical needs, but also health-related social needs such as housing instability and food access. We partner with local community-based organizations like shelters and safety net providers to coordinate care alongside our multidisciplinary care team to improve the wellbeing of underserved individuals and communities.",
    "activity_status": "Active",
    "website": "https://pairteam.com/",
    "founded_date": 2019.0,
    "team_size": 78.0,
    "location": "San Francisco",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:health-tech; industry:workflow-automation; industry:digital-health; industry:healthcare; industry:healthcare-it; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Neil Batlivala, Founder",
            "description": "I am a technical entrepreneur, YC alumni, and co-founder of Pair Team (YC S19). I've spent the majority of my career in healthcare and had the honor of working with some exceptional people while building remote medical teams at Sling, opening primary care practices at Forward, designing medical devices at Spect, training machine learning models at Noxon, and researching pneumonia at UCSF.\n\n50% thrill seeker, 40% dad jokes, 15% math.",
            "linkedin": "https://www.linkedin.com/in/neil-batlivala/"
        },
        {
            "name": "Cassie Choi, Founder",
            "description": "After starting in emergency medicine in Boston, I moved to NYC to work in cardiac critical care at NewYork Presbyterian Columbia University Medical Center. I then moved to San Francisco and worked at Kaiser Permanente and UCSF. After leaving bedside medicine, I was the first RN at Forward building out clinical protocols, workflows and the flagship clinic. After launching Forward, I was director of operations at Circle Medical and launched their flagship clinic before starting Pair Team.",
            "linkedin": "https://www.linkedin.com/in/cassandrachoirn/"
        }
    ],
    "status": true,
    "generated_description": "**Company Overview: Pair Team**\n\n**Website:** [pairteam.com](https://pairteam.com)\n\n**Founded:** 2019, part of Y Combinator Batch S19, based in San Francisco.\n\n**Mission:** Pair Team is dedicated to connecting underserved communities to high-quality healthcare. They focus particularly on high-need Medicaid recipients, addressing both clinical and health-related social needs, like housing and food access. \n\n### Approach to Care:\nPair Team employs a community-led, virtual care model that meets patients where they are—whether that's in shelters, hospitals, or other community settings. They partner with local organizations, such as shelters and safety-net providers, to deliver a holistic, integrated approach to healthcare. Their care isn't just about treating illnesses; it's about improving overall well-being.\n\n### Key Features:\n- **Whole-Person Care:** They provide comprehensive services that include access to medical, mental health, and social services—all at no cost to the patients.\n- **Partnership Network:** They collaborate with a diverse range of community-based organizations and healthcare providers to ensure patients receive the support they need.\n- **No Cost Model:** Care is funded through initiatives like the Enhanced Care Management (ECM) benefit of Medi-Cal, meaning hospitals and patients don't incur any costs.\n\n### Outcomes:\nThe impact of their approach is significant:\n- They manage over 100,000 lives, reducing emergency room visits by 52%.\n- 88% of previously unengaged patients are now reconnected to primary care services.\n\n### Team and Culture:\nWith a team of 78 dedicated employees led by notable partner Nan, Pair Team cultivates a culture grounded in trust and community collaboration. They recognize that effective healthcare solutions must be tailored to the specific needs of the community, and they constantly seek feedback to refine their strategies.\n\n### Challenges and Innovations:\nPair Team acknowledges the complexity of reaching vulnerable populations, particularly since many of their members have not seen a primary care physician (PCP). To combat this, they actively engage with local organizations to streamline access to care while also providing training and resources for better community engagement.\n\n### In the News:\nPair Team has made headlines for its transition to a Public Benefit Corporation, which aims to bolster its community care hub and enhance its model for high-needs care. They have been recognized in various publications for their effective measures in delivering healthcare to those who need it most, emphasizing the importance of accessibility.\n\n### Conclusion:\nPair Team is reshaping healthcare delivery for underserved populations through innovative, community-driven solutions. By integrating medical care with essential social services, they are not just treating patients; they are transforming lives, one community at a time. \n\nIf you're curious about their journey or want to get involved, their [website](https://pairteam.com) offers extensive resources and opportunities for collaboration.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/7f5f457391b55c15c3df27c91d47cf9a79c30719.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191620Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=2902feff48889e0c01c5697873fc46c9dc3b594ef14abf72a53181952bb8ad11",
    "social_links": [
        "https://www.linkedin.com/company/yourpairteam/",
        "https://twitter.com/yourpairteam",
        "https://www.facebook.com/YourPairTeam/"
    ],
    "logo_path": "data/logos\\Pair_Team_logo.png"
}