{
    "links": "https://www.ycombinator.com/companies/palla",
    "name": "Palla",
    "headline": "P2P Cross border payments",
    "batch": "S21",
    "description": "Palla enables instant P2P payments from the US to other countries, a $65BN a year market. Sending and receiving remittances today is slow, time consuming and inconvenient for all parties, as it's a mostly cash based process. With Palla, senders in the US can do it in a few taps of their phone and receivers get their money in seconds.",
    "activity_status": "Active",
    "website": "https://www.palla.com",
    "founded_date": 2020.0,
    "team_size": 13.0,
    "location": "Miami, FL",
    "group_partner": "Dalton Caldwell",
    "group_partner_yc": "https://www.ycombinator.com/people/dalton-caldwell",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:b2b",
    "founders": [
        {
            "name": "Enrique Perezalonso, Founder",
            "description": "Enrique has over 25 years of experience in traditional FIs and Fintech companies, managing marketing, product, operations and sales functions. He has an MBA from the MIT Sloan school of Management and has worked for McKinsey & Co. and other consulting companies. He's bilingual (in Spanish) and has lived in Mexico, England and the US.",
            "linkedin": "https://www.linkedin.com/in/perezalonso/"
        },
        {
            "name": "Andrew Mason, Founder",
            "description": "Andrew is the CoFounder and Head of Product for Palla. He previously was the CPO for Lana, a US neobank co-created by BCG. He led product initiatives for BCG corporates and prior to that startups including Intel Capital-backed FlashGrade.\n\nYC Badge: 0x322737040ad9462049f906a2d6c06ff7f8b7a656",
            "linkedin": "https://www.linkedin.com/in/andrew-s-mason/"
        },
        {
            "name": "Greg Piccolo, Founder",
            "description": "Greg Piccolo is a founder, software engineer and solutions architect.\n\nAs an engineer, Greg has designed and built payment systems, two-sided marketplaces and modern banking platforms at scale. He previously led engineering teams at multiple fintechs, including Lana.com, a digital debit card serving over 250k customers, and Jigsaw XYZ, a London-based consultancy serving high-profile corporate clients.",
            "linkedin": "https://www.linkedin.com/in/gregorypiccolo/"
        }
    ],
    "status": true,
    "generated_description": "Palla is a FinTech company revolutionizing peer-to-peer (P2P) cross-border payments, founded in 2020 and hailing from Y Combinator’s Batch S21. Located in Miami, FL, Palla is tackling a massive $65 billion annual market for remittances with its slick, instant payment solutions.\n\n### What Palla Does\nPalla simplifies the way people send money from the U.S. to over 180 countries. Traditionally cumbersome and mostly cash-based, remittance processes are transformed into quick, convenient mobile transactions. Users can send money in just a few taps on their phones, and recipients can access funds within seconds, 24/7.\n\n### Key Features\n1. **Partnering with Financial Institutions**: Palla collaborates with FinTechs and financial institutions to embed instant payment capabilities via APIs.\n2. **Instant Transfers**: The platform boasts robust functionality that ensures secure and rapid transfers, addressing a critical pain point in the money transfer process.\n3. **Secure Payments**: Palla emphasizes security and compliance, providing a trustworthy backbone for its users’ transactions.\n\n### Team and Support\nWith a dedicated team of 13 employees, Palla is guided by Group Partner Dalton Caldwell. The company's focus is not just on individual users but also on offering solutions for businesses looking to integrate P2P payments into their services.\n\n### The Market Opportunity\nWith more than $541 billion in global remittances in 2021, the demand for efficient and reliable payment solutions is enormous. Palla is positioning itself to capture a significant share of this market by addressing the inefficiencies that have plagued traditional remittance methods.\n\n### Get Involved\nInterested parties can explore partnership opportunities through Palla’s website, which offers a treasure trove of information on how their API can be utilized to enhance existing financial applications.\n\nYou can find more about Palla and their offerings at [palla.com](https://www.palla.com).\n\nIn summary, Palla isn't just about making payments easier; it's about rethinking how money moves across borders, making it faster, safer, and more user-friendly for everyone involved.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/d59964b2f8bc80669a57f3fb9f55b222e38567e9.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191620Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=c2eadd54265a6c2de3a9400d5e34ae3769ae32a0595a043b5359d37e811148cf",
    "social_links": [
        "https://www.linkedin.com/company/palla-financial/?viewAsMember=true"
    ],
    "logo_path": "data/logos\\Palla_logo.png"
}