{
    "links": "https://www.ycombinator.com/companies/pandai",
    "name": "Pandai",
    "headline": "Learning app for school students in Southeast Asia",
    "batch": "S21",
    "description": "💡 What is Pandai?\r\n\nPandai is an app that helps students get better grades in school. \r\n\nPandai provides gamified quizzes aligned to a specific school curriculum, from which students can learn, practice, get feedback, and diagnose their weaknesses.\r\n\n🔥 Why do we build this? \r\n\nIn Southeast Asia, the education system is competitive and exam-oriented. \r\n\nThere is a huge demand for interventions (tutors, workbooks, and extra classes) to help students perform better in school. Pandai fills the demand with a solution that is better than the alternatives.\r\n\n👨‍🏫 Who We Are\r\n\nThe three founders are based in Malaysia and have known each other since high school, 23 years ago. \r\n\nAfter we graduated (from MIT & other US colleges), we started our first education company in 2007, focusing on coaching school students in STEM subjects.\r\n\nWe worked closely with students (many of them from underprivileged backgrounds) and saw firsthand the impact we’ve had on them. \r\n\nWe then realized that with technology, we could reach more students and bring more impact. Hence, we released Pandai in 2020. \r\n\n🚀 Present & Future\r\n\nCurrently, we have launched in our home ground Malaysia in 2020. \r\n\nSo far, 280,000 students have completed 83 million questions on Pandai, and 92% of users have seen some improvement in their academic performance. \r\n\nWe plan to expand to Southeast Asia and other emerging markets, a market of 100M+ school students. Pandai is designed to be scalable, and our content (also available in English) can be mapped to other curricula from other countries.",
    "activity_status": "Active",
    "website": "https://www.pandai.org",
    "founded_date": 2020.0,
    "team_size": 32.0,
    "location": "Kuala Lumpur, Malaysia",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:education; industry:saas; industry:subscriptions",
    "founders": [
        {
            "name": "Khairul Anwar Mohamad Zaki, Founder",
            "description": "CEO of Pandai.org\n\nI spend most of my capacity in Technology and Business Development.  I founded FlowyTeam, AidanTech, Borang.co\n\nI am passionate about the Education sector, having spent the past 14 years in various local & international educational initiatives.",
            "linkedin": "https://www.linkedin.com/in/khairul-anwar-mohamad-zaki"
        },
        {
            "name": "Akmal Akhpah, Founder",
            "description": "CTO of Pandai.org, a K12 Edech for Southeast Asia",
            "linkedin": "https://www.linkedin.com/in/akmalakhpah"
        },
        {
            "name": "Suhaimi Ramly, Founder",
            "description": "I am based in Kuala Lumpur, Malaysia.\n\nSince 2007, I have been involved in K-12 education value chain including policy, curriculum design, content, assessment, pedagogy, training, R&D, tech, and talent development.\n\nMIT '05 (SB, Math).",
            "linkedin": "https://www.linkedin.com/in/suhaimi-ramly/"
        }
    ],
    "status": true,
    "generated_description": "### Pandai: Revolutionizing Learning for Students in Southeast Asia\n\n**Company Overview:**\nPandai, founded in 2020 and hailing from Kuala Lumpur, Malaysia, is a dynamic educational app designed specifically to help school students in Southeast Asia improve their academic performance. With a focus on gamification, Pandai provides a variety of interactive quizzes aligned with local curricula, enabling students to learn effectively, practice skills, receive instant feedback, and pinpoint their weaknesses.\n\n**The Mission:**\nThe core mission of Pandai is simple but ambitious: empower school students across Southeast Asia to achieve better grades. Given the competitive and exam-centric nature of education in the region, there’s a growing need for supplementary educational tools beyond traditional tutoring and workbooks. Pandai addresses this need with a scalable solution, effectively changing the landscape of learning.\n\n**Founders and Background:**\nThe founders, who have known each other since high school, bring a wealth of experience from their educational ventures that began back in 2007. With degrees from prestigious institutions like MIT, their journey into education started with coaching students, especially those from underprivileged backgrounds. Realizing the potential of technology in expanding their impact, they launched Pandai during the pandemic, seizing a unique opportunity to meet rising educational demands.\n\n**Current Achievements and Growth:**\nSince its launch in Malaysia, Pandai has made significant strides. To date, over 878,501 students have completed approximately 322 million questions through the app, with 92% reporting improvements in their academic performance. This impressive uptake demonstrates the app's effectiveness and its friendly user experience, reflected in high ratings on platforms like Google Play and the App Store.\n\n**Future Vision:**\nLooking ahead, Pandai aims to expand into other Southeast Asian markets, targeting over 100 million school students. The app's content, available in English, is designed to be adaptable to different educational curricula, making it a versatile tool for global learners.\n\n**Features and Resources:**\nPandai offers a plethora of features, including:\n- **Live Online Tutoring**: Group and one-on-one sessions to facilitate personalized learning.\n- **Gamified Learning Experience**: Fun quizzes and competitions that foster engagement and motivation.\n- **Practice Tests and Examinations**: Tailored assessments to prepare students effectively for their academic challenges.\n- **Real-time Progress Tracking**: Detailed reports that help students identify areas for improvement.\n\nWhether you’re a student looking to enhance your knowledge, a parent keen on supporting your child's educational journey, or a teacher seeking versatile teaching resources, Pandai has something to offer.\n\n**Get Involved:**\nJoin the growing community of learners benefiting from Pandai. If you're curious to explore how this innovative platform can change lives, check out their website at [Pandai.org](https://www.pandai.org) and see the transformation in action.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/4b3906e943674e3f0b0a61f421133d7d830694a4.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191621Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=3f64a857ca743bdebd2ead4fb7052134c2962c6302dc4fd4369541deac0ab095",
    "social_links": [
        "https://linkedin.com/company/pandai",
        "https://twitter.com/pandaiofficial/",
        "https://facebook.com/pandaiofficial",
        "https://www.crunchbase.com/organization/pandai-org"
    ],
    "logo_path": "data/logos\\Pandai_logo.png"
}