{
    "links": "https://www.ycombinator.com/companies/pangea-app",
    "name": "Pangea.app",
    "headline": "Hire Fractional Marketing + Design Talent",
    "batch": "W21",
    "description": "The best way to know if someone is a good fit is to work with them on a project before you hire them full-time. \r\n\nAt Pangea, we make contract-to-hire easy and painless.\r\n\nWe'll work with you to provide a shortlist of top, interested candidates.  \r\n\nOur talent have an average of 5-7+ years of experience in design, growth, ops, product, and engineering, and are primarily based in the USA (but also extend to 155 countries)",
    "activity_status": "Active",
    "website": "https://www.pangea.app",
    "founded_date": 2016.0,
    "team_size": 3.0,
    "location": "New York",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:marketplace; industry:recruiting; industry:ai-assistant; location:new-york",
    "founders": [
        {
            "name": "Adam Alpert, Founder",
            "description": "Started off as a freelance videographer in middle school, and now I am one of the co-founders of Pangea.app; a platform we built to enable fractional hiring. \n\nFeatured in Techcrunch, Boston Globe, Inc.Magazine and named one of 25u25 in RI.\n\nLiving in NYC,",
            "linkedin": "https://www.linkedin.com/in/adamalp/"
        },
        {
            "name": "John Tambunting, Founder",
            "description": "Hello world! My name is John and I'm the CTO of Pangea.app. I discovered my passion for coding through attending hackathons while in college (github.com/jtambunt). I graduated from Brown with an Applied Mathematics degree.\n\nI'm dedicated to creating serious value in the world because I was fortunately given every opportunity to succeed by my family. This is what motivates me. My parents came to the US from the Philippines with nothing to their names and were able to actualize the American Dream.",
            "linkedin": "https://www.linkedin.com/in/johntambunting/"
        }
    ],
    "status": true,
    "generated_description": "Pangea.app is a revolutionary platform that aims to simplify the process of hiring fractional marketing and design talent. Founded in 2016 and part of Y Combinator's Batch W21, Pangea's mission is to make contract-to-hire partnerships seamless and effective.\n\nAt the core of Pangea’s philosophy is the idea that the best way to assess whether someone is a good fit for your needs is to collaborate on a project before making a long-term commitment. Sharing this sentiment, Pangea has built a robust network of qualified professionals—primarily based in the USA, but also spanning 155 countries—who bring an average of over 5-7 years of experience across various sectors such as design, growth, operations, product, and engineering.\n\nWith just a small team in New York, Pangea efficiently connects businesses with top-tier candidates. Their service is designed to understand client needs intimately and provide a curated shortlist of candidates, making the hiring process not only quicker but also far less painful. Whether you're a startup or an established enterprise, Pangea is adaptable enough to cater to all sizes and scopes of recruitment.\n\nUsing cutting-edge AI technology, Pangea facilitates an impressive matching system that links businesses with qualified candidates almost instantly. In fact, the platform claims talent can be available for hire in as little as 24 hours. This efficiency doesn't sacrifice quality, allowing companies to tap into a diverse pool of professionals from top-tier companies and renowned agencies. \n\nPangea prides itself on the flexibility of its offerings, allowing businesses to hire specialists for either short-term projects or long-term roles with the option to transition from contract (1099) to full-time employment (W2) as needed. Their focus on transparency and support enhances the client experience with features like streamlined communication, easy interview scheduling, and secure payment processing.\n\nIf you’re looking to source top marketing and design talent without the complexities of traditional hiring methods, Pangea.app might just be the platform you need. It empowers businesses to efficiently scale their projects while maintaining high standards of expertise and professionalism—a real game changer in the realm of recruiting.\n\nFor more information, check out their website at [Pangea.app](https://www.pangea.app).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/271f6833bd83a0f13fd9d2c0b73006ccf984822f.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191621Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=d268c30bef8dbcf6b327b47329e9a2450901cf531234a61de5d3d433bccaf4cf",
    "social_links": [
        "https://www.linkedin.com/company/app-pangea/",
        "https://www.crunchbase.com/organization/pangea-app"
    ],
    "logo_path": "data/logos\\Pangea.app_logo.png"
}