{
    "links": "https://www.ycombinator.com/companies/papa",
    "name": "Papa",
    "headline": "One-stop-shop for flexible family care",
    "batch": "S18",
    "description": "Papa is a one-stop-shop for flexible family care, providing companionship and a helping hand wherever it’s needed. With wide-ranging industry, technology, and transformation experience, we share a vision for a world where no one has to go it alone. And a deep well of gratitude for the Papa People who move this vision forward.\r\n\nFounded in 2017 and headquartered in Miami, Papa is backed by Canaan, Tiger Global Management, Comcast Ventures, SoftBank Vision Fund 2, TCG, Initialized Capital, and Seven Seven Six, among other revered institutional and individual investors. \r\n\nPapa is an equal opportunity employer. We proudly support the ParityPledge® for gender and/or racial parity at the highest levels of business.",
    "activity_status": "Active",
    "website": "https://www.papa.com",
    "founded_date": 2017.0,
    "team_size": 500.0,
    "location": "Miami, FL",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:consumer-health-services; industry:digital-health",
    "founders": [
        {
            "name": "Andrew Parker, Founder/CEO",
            "description": "Founded Papa to support older adults and families. Grew up in South Florida and started my career in sales. Cut my teeth in start up / healthcare world with MDLIVE. Started on the team in 2011 and helped grow the company to over 35M members by 2017. Left in 2017 to focus on Papa full time, been doing that ever since. Love growing Papa, snowboarding, hanging with Romi (gf) and Chewie (dog), reading, nice dinners, and spending time with family and friends.",
            "linkedin": "https://www.linkedin.com/in/andrew-parker-30904417"
        }
    ],
    "status": true,
    "generated_description": "**Company Summary: Papa**\n\n**Overview**  \nPapa is your go-to partner in flexible family care, founded in 2017 and based in Miami, Florida. The mission is simple yet profound: to ensure that no one has to go it alone, fostering vital human connections through companion care and assistance with everyday tasks. With a growing team of about 500 employees, Papa is not just working to improve lives but is also actively making strides towards greater equality in the workplace by supporting initiatives like the ParityPledge®.\n\n**Services**  \nPapa connects health plans and employers with members and their families to provide compassionate and practical support. Their services include companion care, transportation assistance, help with errands, and more. The emphasis is on maintaining independence for older adults and addressing the unique challenges faced by often marginalized communities. Moreover, for those in need, becoming a \"Papa Pal\" offers both meaningful work and the chance to make a positive difference in the lives of others.\n\n**Impact**  \nThe outcomes speak for themselves: research indicates that Papa members experience improved physical and mental well-being, fewer hospital visits, and greater overall satisfaction. For employers, this innovative care model stands as a unique benefit that enhances employee retention and attracts talent by supporting the family's needs. \n\n**Investors and Growth**  \nPapa's growth is backed by high-profile investors such as Canaan, Tiger Global Management, Comcast Ventures, and SoftBank Vision Fund 2. The company is also a proud member of Y Combinator’s Batch S18, which highlights its potential for substantial impact in the consumer health services sector.\n\n**Culture and Employment**  \nAs an equal opportunity employer, Papa champions diversity at all levels of the organization. They not only seek to uplift those they serve but also create a workplace culture that reflects the diversity of the communities they assist.\n\nFor more information, check out their website: [Papa](https://www.papa.com). Whether you're looking for support for your family or an opportunity to give back as a Papa Pal, they have a place for you.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/6187455b964c1d77520736c4b518f33c148c35b4.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191621Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=af3d3972d9bec1028ac58f406c395b849ef6edb4ec56a1526c0420793e6936e9",
    "social_links": [
        "https://www.linkedin.com/company/10879786",
        "https://twitter.com/join_papa",
        "https://www.facebook.com/joinpapa",
        "https://www.crunchbase.com/organization/papa-technologies-llc"
    ],
    "logo_path": "data/logos\\Papa_logo.png"
}