{
    "links": "https://www.ycombinator.com/companies/partnerhq",
    "name": "PartnerHQ",
    "headline": "A marketplace for B2B businesses to buy warm intros.",
    "batch": "W24",
    "description": "PartnerHQ is building the next generation LinkedIn. We are creating the world’s most valuable and accurate professional network graph by capturing and indexing vast quantities of relationship signals. \r\n\nIndividuals use PartnerHQ to grow and monetize their networks. B2B companies use PartnerHQ to buy warm intros and drive high-value sales. \r\n\nPartnerHQ was created during Y Combinator’s W24 cohort and launched in February of 2024. Since launch we have signed on hundreds of paying companies, domestic and international. 97% of all users have come inbound or word-of-mouth.",
    "activity_status": "Active",
    "website": "https://trypartnerhq.com",
    "founded_date": 2024.0,
    "team_size": 4.0,
    "location": null,
    "group_partner": "Gustaf Alstromer",
    "group_partner_yc": "https://www.ycombinator.com/people/gustaf-alstromer",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": null,
    "founders": [
        {
            "name": "Kat Wang, Founder",
            "description": "Kat was employee #4 at UVS Games, a marketplace startup she helped take from $500k to $20M in 1 year (40x growth). She built and managed the product, engineering, and design teams. \n\nBefore UVS Games she spent 4 years at Affinity (CRM used by 40% of VCs), where she helped build the relationship intelligence and warm intro tool. \n\nKat knows warm intros and marketplaces.",
            "linkedin": "https://linkedin.com/in/katherine-wang-6760026a"
        },
        {
            "name": "Stan Liu, Founder",
            "description": "Stan was the founding engineer at Notable Health ($120M raised).",
            "linkedin": "https://linkedin.com/in/stan-l-107a3b1b2"
        }
    ],
    "status": true,
    "generated_description": "### PartnerHQ: Revamping B2B Networking\n\n**Overview**  \nPartnerHQ is a fresh entrant in the B2B marketplace, aiming to streamline introductions between businesses through a unique platform where companies can purchase warm introductions to potential clients. Launched in February 2024 as part of Y Combinator’s W24 cohort, PartnerHQ is essentially building the next generation of LinkedIn by creating an extensive and accurate professional network graph.\n\n**Mission**  \nThe primary mission of PartnerHQ is to facilitate business growth by enabling B2B companies to leverage their networks more effectively. Through warm introductions, they help businesses drive high-value sales, promoting a more personalized approach to client acquisition.\n\n**User Engagement**  \nSince its inception, PartnerHQ has grown rapidly, signing hundreds of paying companies both domestically and internationally. Remarkably, 97% of all user sign-ups have come from inbound leads or word-of-mouth, a testament to the platform's appeal and effectiveness.\n\n**Features and Benefits**  \nUsers can describe their ideal customer profiles and set a bounty—typically around $500—for introductions to these prospects. This innovative model allows companies to only pay for introductions that result in scheduled meetings, significantly boosting their sales close rates by an impressive 53%.  \n\nThe platform is also equipped with a network of decision-makers from major brands like Airbnb, Netflix, and American Express, providing users access to valuable contacts. \n\n**Team and Leadership**  \nPartnerHQ currently operates with a small but dedicated team of four employees, guided by Group Partner Gustaf Alstromer from Y Combinator. The compact team dynamic allows for agility and focus, essential in the fast-paced startup environment.\n\n**Website and Contact**  \nFor those interested in exploring this innovative platform further, PartnerHQ can be found at [trypartnerhq.com](https://trypartnerhq.com). \n\n**Conclusion**  \nIn a landscape where personal connections often dictate business success, PartnerHQ offers a refreshing solution for companies eager to enhance their networking capabilities. By transforming how businesses make connections, they are positioning themselves as a significant player in the B2B marketplace. Keep an eye on PartnerHQ; they might just redefine how you think about professional networking.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/25d62dbaddd0891611d837607ff677ca5bff05cb.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191624Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=dadfd0a4264aae41d690a5e90674abad18a20644a9b99aa18c8527bed59cb2a8",
    "social_links": [
        "https://www.linkedin.com/company/trypartnerhq/"
    ],
    "logo_path": "data/logos\\PartnerHQ_logo.png"
}