{
    "links": "https://www.ycombinator.com/companies/patika",
    "name": "Patika",
    "headline": "Automating entry of sales orders from emails/Whatsapp into ERPâ\u0080¦",
    "batch": "S22",
    "description": "Our Product: Sanifu\r\n\nSanifu enables manufacturers and distributors to automate the entry of sales orders from emails and WhatsApp into their ERP systems. By extracting customer order details from various formatsâ\u0080\u0094including emails, PDFs, and handwritten notesâ\u0080\u0094and accurately entering the data into ERP systems, Sanifu significantly reduces manual data entry time and errors. This automation enhances overall efficiency for businesses, allowing them to scale more effectively and focus on core operations. We are targeting a market of 180,000 manufacturers and distributors across Africa, representing a $2.5B+ opportunity.\r\n\nSidney and Phelix, who met 10 years ago at a leadership program by Mastercard and Equity Bank, are technical founders with 5+ years experience working together to build payments platforms that processed $10M monthly GTV across Kenya, Uganda & Nigeria.",
    "activity_status": "Active",
    "website": "https://www.sanifu.ai",
    "founded_date": 2021.0,
    "team_size": 5.0,
    "location": "Nairobi, Kenya",
    "group_partner": "Michael Seibel",
    "group_partner_yc": "https://www.ycombinator.com/people/michael-seibel",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:saas; industry:b2b; industry:ai",
    "founders": [
        {
            "name": "Sidney Rema, Founder",
            "description": "Co-Founder & CEO at Patika - Helping small businesses in Africa to collect the 35% of their revenue that is not paid upfront.\n\nTrained as a Medical Doctor (Partly). 5 Years+ experience in Banking - Extending credit to micro & small businesses in Nairobi, Kenya. In my previous company, built payments systems with $10M+ monthly GTV across Kenya, Nigeria & Uganda. Led the company into markets like Somalia, built and deployed their current national revenue collection system among others.",
            "linkedin": "https://www.linkedin.com/in/sidney-rema-90138658/"
        },
        {
            "name": "Phelix Juma, Founder",
            "description": "Co-Founder & CTO at Patika - helping Africa's small businesses improve their cashflow through Account Receivables (AR) Billing  (tracking of customer debt, automated reminders and collections payments) and Cashflow Management. \nI previously helped 3 companies build payments systems that processed $10M in monthly GTV across Kenya, Uganda and Nigeria. \nI am an EE graduate from University of Nairobi with background in information systems, banking, payments integration and data science",
            "linkedin": "https://www.linkedin.com/in/phelix-juma-80877193/"
        }
    ],
    "status": true,
    "generated_description": "### Overview of Patika and Its Product, Sanifu\n\nPatika, founded in 2021, is a dynamic startup located in Nairobi, Kenya. It specializes in automating the entry of sales orders from emails and WhatsApp into ERP systems through its flagship product, Sanifu. Patika is a proud member of Y Combinator's Summer 2022 batch.\n\n#### Mission\nThe company’s primary goal is to streamline the procurement process for manufacturers and distributors. Sanifu helps automate the daunting task of manually entering sales orders, reducing both time and human error. This solution is especially targeted toward the expansive market of around **180,000 manufacturers and distributors across Africa**, translating to a significant opportunity of over **$2.5 billion**.\n\n#### The Founders\nPatika is founded by **Sidney** and **Phelix**, who boast a decade-long friendship that started during a leadership program by Mastercard and Equity Bank. Together, they have over five years of experience in building payments platforms and have successfully processed approximately **$10 million in monthly gross transaction volume** across East Africa.\n\n#### How Sanifu Works\nSanifu provides an intuitive interface for automating the following functions:\n\n- **Identifying Orders**: It scans through emails and WhatsApp messages to filter legitimate orders from various formats, such as typed messages, PDFs, or even handwritten notes.\n- **Extraction & Matching**: It extracts key customer details and matches them with product codes in the ERP system, ensuring accuracy.\n- **Exporting to ERP or CRM**: Once matched, Sanifu automatically populates these orders into the chosen integrated ERP or CRM system, dramatically reducing processing time.\n\nThis automation is not just efficient; it enhances overall business productivity, allowing teams to focus on more strategic tasks rather than repetitive data entry. \n\n#### Key Features of Sanifu\n- **Email Integration**: Automatically processes incoming orders sent via email, regardless of format (text or PDF).\n- **WhatsApp Functionality**: Orders sent through WhatsApp are similarly processed, whether they use natural language or handwritten notes sent as images.\n- **Support for Unstructured Data**: Sanifu can handle various types of documents, including scanned and handwritten materials.\n- **Broad Compatibility**: It integrates with a wide range of platforms, including popular services like Google Mail, Microsoft products, and ERP systems from major vendors like SAP and Oracle.\n\n#### Team and Support\nThe Patika team consists of **five employees**, guided by Group Partner **Michael Seibel** from Y Combinator, who provides valuable mentorship and support.\n\n#### Conclusion\nPatika is spearheading a much-needed transformation in the workflow of African manufacturers and distributors, making sales order management not only simpler but faster and error-free. If you're in this space, considering an automation partner like Sanifu could significantly enhance your operational efficiency.\n\nFor more information, you can visit their website: [Sanifu](https://www.sanifu.ai).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/5fd0b3d8bd86f887d002249f2aae17b93ffbd134.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191625Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=570f6296987050f227ea12e7b6b21d0cfe3a05b62600ca7b1a5c1148dfd2be7e",
    "social_links": [
        "https://www.linkedin.com/company/patika-africa/",
        "https://twitter.com/PatikaAfrica",
        "https://www.facebook.com/Patika-Africa-103542242060777"
    ],
    "logo_path": "data/logos\\Patika_logo.png"
}