{
    "links": "https://www.ycombinator.com/companies/paycrunch",
    "name": "PayCrunch",
    "headline": "Credit Card for college students based on UPI.",
    "batch": "W22",
    "description": "More than 150 million people in India are not able to access formal Credits in India either because of lack of financial data or low credit scores. We use Alternative Credit scoring models to provide a Pay Later option on UPI to a wider audience.",
    "activity_status": "Active",
    "website": "https://paycrunch.in",
    "founded_date": 2020.0,
    "team_size": 5.0,
    "location": "Bengaluru, India",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:payments; industry:india",
    "founders": [
        {
            "name": "Aman Bhayana, Founder",
            "description": "Hey! I am Aman. Currently building a Fin-tech company to make credits accessible and fun for the upcoming Gen.",
            "linkedin": "http://linkedin.com/in/aman-bhayana-bab9ab164"
        }
    ],
    "status": true,
    "generated_description": "### PayCrunch: Revolutionizing Credit for Gen-Z in India\n\nFounded in 2020 and hailing from Bengaluru, India, PayCrunch is tackling a glaring issue in the financial landscape: over 150 million Indians lack access to formal credit due to poor credit scores or insufficient financial data. This startup, part of Y Combinator's Winter 2022 batch, is cleverly leveraging UPI (Unified Payments Interface) to streamline credit access for college students, a demographic often overlooked by traditional financial institutions.\n\n**Mission and Approach**\nPayCrunch aims to offer a credit card experience without the baggage of traditional credit checks. They employ alternative credit scoring models, making it possible for users to secure a Pay Later option that opens up financial opportunities for a wider audience—specifically, Gen-Z and college students who desire financial independence but may not have a robust credit history. \n\n**Why PayCrunch Stands Out**\n1. **No Credit Score? No Problem!**: Users can build their PayCrunch score without needing an existing CIBIL score, which is a game-changer for young adults just stepping into the world of finance.\n  \n2. **Seamless Transactions**: Imagine scanning a QR code and paying later, anytime, anywhere. This convenience aligns perfectly with the fast-paced lifestyle of students today.\n\n3. **Expense Tracking**: On top of facilitating payments, PayCrunch gives users insights into their spending habits, empowering them to manage their finances better.\n\n4. **Community Engagement**: With features like \"PayCrunch shots\" to engage friends and earn rewards, the app creates a social aspect around credit, making it more appealing in a youth-driven marketplace.\n\n### The Vision Ahead\nAs it continues to grow, PayCrunch aims to redefine what it means to use credit—making it fun, accessible, and tied deeply to the lifestyle of its users. They also plan to roll out additional features, such as the *Super PayCard*, promising to usher in a new age of credit for those \"in a crunch.\"\n\nWith a lean team of five and strategic partnerships, including prominent backers from the startup ecosystem, PayCrunch is poised to carve out a significant niche in the fintech space. They are clearly not just about credit; they’re about community, empowerment, and making financial tools that resonate with a younger audience.\n\nTo dive deeper into what they offer, check out their website: [PayCrunch](https://paycrunch.in).\n\n---\n\nIn short, PayCrunch is a fresh take on financial service for students, blending the rigors of credit with the ease of digital payments—a compelling proposition in a rapidly changing financial environment.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/7e9e4d06b67ad707d6acb30523be324435a9dc27.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191626Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=23a2d7832394b8f0260c84a72b70af39377992817d62be99a6cf0faaa9a00bf9",
    "social_links": [
        "https://www.linkedin.com/company/paycrunch",
        "https://github.com/PayCrunch-team"
    ],
    "logo_path": "data/logos\\PayCrunch_logo.png"
}