{
    "links": "https://www.ycombinator.com/companies/paymongo",
    "name": "PayMongo",
    "headline": "Modern online payments for the Philippines",
    "batch": "S19",
    "description": "PayMongo builds products and tools that enable thousands of individuals and businesses in the Philippines to make and receive payments over the Internet. We support payments through credit or debit cards, electronic wallets, over-the-counter payments and many more.\r\n\nWe build robust APIs, plugins and other products that abstract out the complexities of payments from our users so they can get up and running quickly and focus on their business.\r\n\nOur investors include Founders Fund, Peter Thiel, Bedrock Capital and Stripe.",
    "activity_status": "Active",
    "website": "https://paymongo.com",
    "founded_date": 2019.0,
    "team_size": 220.0,
    "location": "Taguig, Philippines",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech",
    "founders": [],
    "status": true,
    "generated_description": "### PayMongo: Modernizing Payments in the Philippines\n\n**Overview**\nFounded in 2019 and part of Y Combinator’s Batch S19, PayMongo is on a mission to simplify and modernize online payments in the Philippines. Based in Taguig, the company has quickly scaled to a team of 220 employees and has garnered investments from notable firms including Founders Fund, Peter Thiel, Bedrock Capital, and Stripe.\n\n**The Problem They Solve**\nPayMongo addresses the complexities of online transactions by providing user-friendly tools that allow businesses to accept payments effortlessly. Whether you're a small business or a larger enterprise, PayMongo's platform abstracts the intricate details of payment processing so you can focus on what really matters: growing your business.\n\n**What They Offer**\nPayMongo boasts a formidable suite of products and services:\n- **Payment Acceptance**: Accept payments in multiple forms without needing a website. Options include one-time payment links, customizable checkout pages, and various plugins.\n- **Payment Options**: Support for major credit/debit cards, e-wallets like GCash, Maya, and GrabPay, and even \"Buy Now, Pay Later\" solutions.\n- **Financial Services**: Features like a treasury wallet-as-a-service API, flexible financing options, and tools for managing finances effectively. \n\nThe beauty of PayMongo is in its flexibility—users can manage payments both online and in-person. The platform is designed for ease of use, enabling even those with minimal technical skills to set up and launch services swiftly.\n\n**Security and Compliance**\nSecurity is a big deal at PayMongo. They are PCI-DSS 4.0 compliant and adhere to SOC 2 Type 2 standards, meaning your financial transactions are safeguarded by rigorous security protocols. Moreover, they operate under the regulation of Bangko Sentral ng Pilipinas, ensuring full compliance with local financial regulations.\n\n**Customer Success**\nFeedback from users highlights the effectiveness of PayMongo’s offerings. Many businesses report increased transaction volumes and simplified payment management through a centralized dashboard powered by PayMongo.\n\n**Looking Ahead**\nWith growing demand for seamless digital payment solutions in the Philippines, PayMongo is poised to play a critical role in reshaping the financial landscape. Their vision is clear: empower every business in the Philippines with the financial tools needed to thrive in a digital-first economy.\n\n**Contact and Learn More**\nYou can find more about PayMongo and explore their solutions on their website: [PayMongo](https://paymongo.com). The future of online payments in the Philippines looks promising, and PayMongo is leading the charge.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/3a2d9402b27f492de3019f9a0b38485c1face6b2.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191627Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=78af3ee0fb388528cd808fb39be8b4919540de5c8bb4731e3c03fd45164cc844",
    "social_links": [
        "https://www.linkedin.com/company/paymongo",
        "https://twitter.com/paymongo",
        "https://www.facebook.com/paymongo",
        "https://www.crunchbase.com/organization/paymongo",
        "https://github.com/paymongo"
    ],
    "logo_path": "data/logos\\PayMongo_logo.png"
}