{
    "links": "https://www.ycombinator.com/companies/peekapak",
    "name": "Peekapak",
    "headline": null,
    "batch": "IK12",
    "description": "Peekapak is an award-winning, social & emotional learning (SEL) program designed for the classroom and the home. Developed by education experts, Peekapak's innovative curriculum combines teaching skills like gratitude, empathy and self-regulation with Common Core reading and writing standards. Peekapak aims to make SEL learning resources more accessible with its freemium website. Teachers can sign up for free at www.peekapak.com. \n\n• Featured on Flare, Huffington Post, EdSurge, Edutopia, Entrepreneur Magazine, BetaKit, TechVibes, Yahoo Finance, International Business Times, CBC TV & Radio, Metro News, Adweek, CTV, Toronto Star and CH Morning Live\n• Backed by Imagine K12 (the Edtech vertical of YCombinator) & JOLT (MaRS) Accelerator programs with investment and is an Unreasonable Institute Fellow\n• Research partnerships with Denver Public Schools, Elizabeth Public Schools and Mile High Early Learning and 3 research projects with George Brown College's Early Childhood Department from the Canadian Government (NSERC) and the Ontario Centres for Excellence (OCE) \n• Academics'​ Choice Award Winner\n• Winners of the MasterCard Women in Entrepreneurship program\n• Recipient of the Centre For Social Innovation's Ontario Catapult Microloan, SheEO program and Grand Prize Winner of the It's a Start Competition",
    "activity_status": "Active",
    "website": "http://www.peekapak.com",
    "founded_date": null,
    "team_size": 11.0,
    "location": "Toronto, Canada",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": null,
    "founders": [],
    "status": true,
    "generated_description": "**Peekapak: Empowering Social and Emotional Learning**\n\nWelcome to Peekapak—a Toronto-based company that’s changing the game in education through social and emotional learning (SEL). While they’ve got a wealth of awards and recognition under their belt, the heart of their mission is simple: equip students—both at home and in the classroom—with the tools they need to thrive emotionally and academically.\n\nPeekapak is an engaging and research-backed curriculum designed specifically for PreK through Grade 12, blending essential SEL skills such as empathy and self-regulation with Common Core standards for reading and writing. The unique spin? They make their resources easily accessible through a freemium website where teachers can sign up for free at [Peekapak.com](http://www.peekapak.com).\n\n### Highlights of Peekapak:\n- **Innovative Approach**: Their program combines immersive storytelling and interactive experiences, making learning fun and relatable.\n- **Diverse Partnerships**: Collaborations with various educational institutions like Denver Public Schools and George Brown College ensure that their offerings are grounded in research and real-world applicability.\n- **Recognition and Awards**: Peekapak is celebrated by numerous media outlets, from Entrepreneur Magazine to CBC, and has received accolades such as the Academics' Choice Award and the MasterCard Women in Entrepreneurship program.\n- **Growth Support**: Backed by Imagine K12 (part of Y Combinator) and other accelerator programs, they are empowered to grow and innovate continually.\n\n### How It Works:\n- **For Younger Students (PreK–5)**: The curriculum features leveled readers and carefully crafted lessons to nurture emotional intelligence while honing reading and writing skills. Their platform also includes **myPeekaville**, a digital learning game that immerses kids in SEL concepts via interactive narrative challenges.\n  \n- **For Teens (6–12)**: The program aims to build resilience and manage stress, arming students with the confidence to navigate the complexities of adolescence and school life.\n\n- **Real-Time Insights for Educators**: Teachers benefit from tools to monitor student emotions and comprehension, fostering a supportive classroom environment. This data-driven approach allows educators to tweak their strategies effectively.\n\n### Getting Onboard:\nLeveraging their impressive track record in creating engaging, effective SEL programming, Peekapak strives to build holistic SEL plans tailored to schools. They offer professional development and family engagement resources, ensuring that the entire community is involved in cultivating emotional well-being.\n\nIn a world where education goes beyond academics, Peekapak stands out as a beacon of hope and practical solutions. You can find more details and sign up for their resources at their website, [Peekapak.com](http://www.peekapak.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/23c05d51787299b65ffd5cfcf8074ee08fc02b27.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191627Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=2593ba46d90b70d1109b2b704cb736ebc40757b23dacf6be8debf6d85322874e",
    "social_links": [
        "https://www.crunchbase.com/organization/peekapak"
    ],
    "logo_path": "data/logos\\Peekapak_logo.png"
}