{
    "links": "https://www.ycombinator.com/companies/peoplecq",
    "name": "peopleCQ",
    "headline": "Employer backed payroll advances for employees in Egypt",
    "batch": "W21",
    "description": "NowPay, a FinTech startup founded by ex-employees of IBM, Microsoft, Orange and Amazon, is building a financial-wellness platform for employees in emerging markets. Saving, spending, budgeting and borrowing. Those are the 4 pillars of financial-wellness. NowPay aims to improve every aspect of those for employees by building products that tackle every vertical. \r\n\nNowPay enables employees to get their salaries in advance at any point in time during the month and also pay their bills instantly.  NowPay is backed by 500 Startups, Beco Capital, Endure, Plug and Play, MSA Capital, 4dx, Foundation Ventures, EFG and Beltone and has raised 3.7m USD so far.",
    "activity_status": "Active",
    "website": "https://www.peopleCQ.com",
    "founded_date": 2019.0,
    "team_size": 85.0,
    "location": "Cairo, Egypt",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:recruiting; industry:hr-tech",
    "founders": [
        {
            "name": "Mostafa Ashour, Founder",
            "description": "Ex-MSFT, Ex-IBM, Startups. Founder and CEO of NowPay.",
            "linkedin": "http://www.linkedin.com/in/mostafaashour"
        },
        {
            "name": "Ahmed Abuelenien, Founder",
            "description": "Find a want, fill a want!",
            "linkedin": "https://www.linkedin.com/in/sa6ry/"
        }
    ],
    "status": true,
    "generated_description": "**Company Summary: peopleCQ**\n\nFounded in 2019 and based in Cairo, Egypt, peopleCQ, previously known as NowPay, is a FinTech startup that's shaking up the financial wellness landscape for employees in emerging markets. Its mission is clear: to provide employer-backed payroll advances that enhance the financial well-being of employees.\n\n### Founders and Backstory\nThe company was conceived by a team of savvy ex-employees from heavyweights like IBM, Microsoft, Orange, and Amazon. They recognized that financial wellness isn't just about saving—it's about a holistic approach that includes saving, spending, budgeting, and borrowing. This insight drives the development of their diverse set of products aimed at improving each of these pillars.\n\n### Key Features and Offerings\nNowPay stands out by allowing employees to access their salaries in advance at any time during the month, a feature that's particularly beneficial for those managing tight budgets. Not only that, but it also enables users to pay bills instantly—essential services that can make a significant difference in financial management.\n\n### Backing and Growth\nThe company has attracted notable investment, having raised $3.7 million to date from reputable investors like 500 Startups, Beco Capital, Endure, and several others. Their participation in the Y Combinator Batch W21 further hints at the potential and ambition of the venture.\n\n### Team and Development\nWith a dedicated team of 85 employees, peopleCQ is positioned to continue expanding its influence in the HR tech space, specifically focusing on recruitment and employee financial services. They’re not just addressing immediate financial needs but are also paving the way for improved financial literacy and autonomy among workers.\n\n### Conclusion\nIn an age where financial stress can significantly hinder productivity and well-being, peopleCQ is stepping up to provide practical solutions. By enabling payroll flexibility and empowering employees, they're not just building a platform; they're fostering a culture of financial health. For more about their offerings, visit their official site at [peopleCQ](https://www.peopleCQ.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/7d9e39d961d5b08c46f00c36b4734d737c855bc4.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191630Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=d7568b99ae581b877958fa48fee4d7020870d5f21be7e731c826bd68cb5a6080",
    "social_links": [
        "https://www.linkedin.com/company/nowpay/",
        "https://www.facebook.com/NowPayDotCash"
    ],
    "logo_path": "data/logos\\peopleCQ_logo.png"
}