{
    "links": "https://www.ycombinator.com/companies/per-diem",
    "name": "Per Diem",
    "headline": "Mobile app design and publishing platform for SMB's",
    "batch": "W21",
    "description": "Per Diem makes launching an app as easy as building a website. Think Starbucks-level tech for every mom-and-pop shop, at 10x the speed and 1/10th the cost. Ranked as the top app for Loyalty & Rewards in the Square app marketplace, our iOS and Android apps power over 150 brands, including Coffee Dose, Think Coffee, and Chip City.",
    "activity_status": "Active",
    "website": "https://tryperdiem.com",
    "founded_date": 2020.0,
    "team_size": 15.0,
    "location": "New York",
    "group_partner": "Brad Flora",
    "group_partner_yc": "https://www.ycombinator.com/people/brad-flora",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:payments; industry:consumer; industry:b2b; location:new-york",
    "founders": [
        {
            "name": "Tomer Molovinsky, Founder",
            "description": "After 5 years building products at OpenTable and Resy, I started Per Diem (YC W21) to democratize mobile apps for restaurants. Our platform helps independent brands launch their own Starbucks-like app in days. Now the top-rated loyalty app on Square, powering Coffee Dose, Chip City, and 150+ others.",
            "linkedin": "https://www.linkedin.com/in/tomermolo"
        },
        {
            "name": "Doron Segal, Founder",
            "description": "Hey I'm Doron,  the co-founder & CTO of Per Diem — a subscription platform for brick & mortar businesses. \nI'm also a dad and a husband. I love to travel and meet new people.\nI love creating things, and see people using the stuff I built. \nPrior to Per Diem I worked at Saildrone, OpenTable, Apple, Beats Music, Siemens.\nHappy to help other YC's alumna",
            "linkedin": "https://www.linkedin.com/in/doronsegal/"
        }
    ],
    "status": true,
    "generated_description": "**Per Diem** is a mobile app design and publishing platform, specifically tailored for small and medium-sized businesses (SMBs). Founded in 2020 and hailing from Y Combinator’s Batch W21, the company has made it its mission to make app development as straightforward and cost-effective as creating a website—aiming to democratize technology access for mom-and-pop shops. \n\nImagine the tech sophistication of a Starbucks but available for local cafés and restaurants at a fraction of the cost. That's what Per Diem delivers, allowing businesses to launch their personalized mobile apps in about 24 hours and at ten times the speed and a tenth of the cost compared to traditional app development.\n\nSituated in New York and supported by a dedicated team of 15 employees, Per Diem has already secured its place in the industry by becoming the top app for loyalty and rewards in the Square app marketplace. Its technology powers over 150 brands, including notable names like Coffee Dose, Think Coffee, and Chip City.\n\nAt its core, Per Diem allows businesses to create branded mobile apps that keep customers engaged—integrated seamlessly with Square POS systems for hassle-free ordering. Users find themselves checking out quickly, thanks to features like one-tap ordering and saved favorite items, which significantly boosts customer spending—some studies report that mobile app users engage in spending three times more than those who place orders in-store.\n\nBrad Flora serves as the Group Partner, guiding the company's direction and growth amidst a burgeoning market demanding user-friendly tech solutions. \n\nPer Diem’s value proposition is hard to ignore: lower costs, rapid deployment, and a user experience that matches the giants without the hefty price tag. No wonder more than 500 restaurants and cafés have already harnessed the platform for their own mobile applications. \n\nIf you're an SMB looking to enhance customer loyalty and streamline your operations, Per Diem is a platform built to elevate your business through technology, serving up premium app experiences that don’t come with the usual complications of traditional tech development. Check them out at [tryperdiem.com](https://tryperdiem.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/d980c6e513262f5e245e08f1ca8bf8204c19cc33.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191635Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=66e6fced1ad091e23775d7524cf0c787eb62b5e788dc3994f70685b41ef1c379",
    "social_links": [
        "https://www.linkedin.com/company/tryperdiem",
        "https://twitter.com/tryperdiem",
        "https://www.facebook.com/tryperdiem",
        "https://www.crunchbase.com/organization/per-diem",
        "https://github.com/PerDiemInc"
    ],
    "logo_path": "data/logos\\Per_Diem_logo.png"
}