{
    "links": "https://www.ycombinator.com/companies/perceptive-technologies",
    "name": "Perceptive Technologies",
    "headline": "Automated tooth cutting for dentists using imaging, AI and robotics",
    "batch": "W20",
    "description": "Stealth-mode, rapidly scaling, venture-backed startup at the vanguard of automated robotic surgery revolution -- just closed our Series A round. We are improving access to dental care in underserved populations by combining novel imaging technology with AI and surgical robotics to automate surgery in the $452B dental industry. \r\n\nWe are bringing a new imaging modality to dentistry which can see inside teeth and below the gingiva all without the need for x-rays. AI is used to diagnose decay and plan treatment. Automated robotics reduces the time for surgery down to one minute, reducing patient discomfort and saving time and reducing cost for the dentist.\r\n\nYC 2020, Winner of the Forsyth DenTech 2021 CareCaptial award",
    "activity_status": "Active",
    "website": "https://www.perceptive.io",
    "founded_date": 2020.0,
    "team_size": 25.0,
    "location": "Boston",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:robotics; industry:health-tech; industry:medical-devices; industry:ai; location:boston",
    "founders": [],
    "status": true,
    "generated_description": "**Perceptive Technologies: Revolutionizing Dental Care**\n\nFounded in 2020 in Boston and part of Y Combinator's W20 batch, Perceptive Technologies is on a mission to enhance dental surgery through automation. With a recent Series A funding round under its belt, this venture-backed startup is at the forefront of a significant shift towards automated robotic surgery in dentistry.\n\n### What They Do\n\nAt its core, Perceptive Technologies combines advanced imaging technology, artificial intelligence (AI), and robotics to create a seamless experience for dentists and patients alike. Their novel approach allows for automated tooth cutting, improving accessibility to dental care—especially in underserved populations—within the $452 billion dental industry.\n\n- **Imaging**: They’ve developed a portable intraoral scanner using advanced Optical Coherence Tomography (OCT) that captures detailed 3D images of dental structures without X-rays. This technology boasts over 90% accuracy in detecting tooth decay, significantly outperforming traditional 2D X-rays.\n\n- **AI Diagnostics**: Their AI analyzes the rich volumetric data from the imaging process, enabling dentists to diagnose issues earlier and with higher precision. This clarity helps patients understand their dental needs better.\n\n- **Robotic Surgery**: Perceptive is engineering a dental robotic system aimed at completing restorative procedures—like crowns—up to ten times faster than human capabilities. They envision procedures taking as little as 15 minutes and happening in a single visit, eliminating the need for multiple trips to the dentist.\n\n- **Safety First**: The safety of the robotic system is paramount. Their technology is designed to ensure precise treatment even in challenging conditions, with rigorous testing already completed for real-world scenarios.\n\n### Recognition and Impact\n\nPerceptive Technologies has quickly garnered attention, winning the Forsyth DenTech 2021 CareCaptial Award for its innovative contributions. With a dedicated team of 25 and strong backing from industry leaders, they are setting the stage for a transformative period in dental health.\n\n### Why It Matters\n\nBy reducing patient discomfort, cutting down surgery times, and ultimately lower costs for dental practices, Perceptive Technologies is not just changing how dental care is delivered; they are reshaping the entire landscape of dental hygiene. They are poised to tell a compelling story of innovation as they continue to grow and impact the market.\n\nFor more information, visit [Perceptive Technologies](https://www.perceptive.io) or reach out via email at info@perceptive.io. Keep an eye on this company—what they’re doing now will likely define future dental care.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/6eef8a43fc2b66f5c62fba7015a4f55bf5d6f7db.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191630Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=09f1c179e5502a2387b9d791219ffcd797e27425133d24d78487e2dd5dbb2f23",
    "social_links": [],
    "logo_path": "data/logos\\Perceptive_Technologies_logo.png"
}