{
    "links": "https://www.ycombinator.com/companies/perl-street",
    "name": "Perl Street",
    "headline": "Financing the next-generation of infrastructure projects",
    "batch": "W22",
    "description": "Perl Street is democratizing structured finance through our platform, unlocking billions in financing for sustainable infrastructure and next-generation hardware technologies. \r\n\nPerl Street has already helped multiple hardware startups receive over $140M in debt financing offers from some of the world’s most reputable institutions.\r\n\nClimate change is a massive hardware problem. According to IEA estimates - reaching net zero emissions would require over $4 trillion per year in global clean energy investment. \r\n\nThis means we need to upgrade nearly everything with new hardware - from energy storage devices to electric vehicles, charging stations and building electrification. \r\n\nThe future of infrastructure is both distributed and resilient. And none of it is possible without financing new hardware.",
    "activity_status": "Active",
    "website": "https://perlstreet.com/",
    "founded_date": 2019.0,
    "team_size": 4.0,
    "location": "Austin, TX",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:climate; location:austin",
    "founders": [
        {
            "name": "Tooraj Arvajeh, Founder",
            "description": "Tooraj Arvajeh has 20+ years of experience in developing, financing, and operating $1B+ new infrastructure and climate-tech projects across the world. Tooraj has worked in senior engineering, project origination, and research roles at Arup, Hatch, and the Building Performance Lab. Tooraj holds degrees in mechanical engineering and business from the University of Waterloo, Columbia Business School, London Business School, and the University of Hong Kong.",
            "linkedin": "https://www.linkedin.com/in/toorajarvajeh/"
        }
    ],
    "status": true,
    "generated_description": "**Perl Street Overview**\n\nFounded in 2019 and hailing from Austin, TX, Perl Street is on a mission to democratize structured finance for sustainable infrastructure and cutting-edge hardware technologies. This ambitious start-up, part of Y Combinator's Winter 2022 batch, aims to tackle some of the most pressing issues of climate change by unlocking much-needed financing.\n\n**What They Do**\n\nPerl Street has already made strides in the world of finance, facilitating over $140 million in debt financing offers for hardware startups from prestigious institutions. Their goal is clear: we need to invest upwards of $4 trillion annually to reach net-zero emissions, and the path forward means innovating and financing new hardware—from energy storage solutions to electric vehicles and smart infrastructures.\n\nTheir platform addresses the complexities of financing distributed energy assets by providing a suite of integrated solutions designed to streamline and enhance financial management. Among their offerings are **AssetTrack** for project monitoring, **AssetERP** for financial planning, and other tools that promote efficient integration with existing systems.\n\n**The Problem They Solve**\n\nWhen we talk about the infrastructure of tomorrow, it needs to be both distributed and resilient. Perl Street recognizes that securing funding for sustainable hardware projects is crucial for achieving these targets. In a time when climate change poses hardware challenges on a global scale, Perl Street is stepping in to ensure that the financial ecosystem can adapt and thrive.\n\n**Their Customers and Impact**\n\nPerl Street proudly supports more than 60 customers globally, rapidly scaling clean energy investments exceeding 14GW. Their customer base includes influential players like King Energy and AMPYR, all benefiting from Perl Street's technology, which transforms how finance teams operate within the renewable energy sector.\n\n**Why Perl Street Matters**\n\nAs John Witchel, CEO of King Energy, aptly puts it, \"If Excel is the programming language of finance, Perl Street technology is its operating infrastructure.\" The platform enables finance teams to focus on strategic high-value tasks rather than being bogged down by the repetitive elements of financial management.\n\nOverall, Perl Street is a clear example of how fintech can meet the challenge of climate change head-on, aligning financial services with the needs of renewable energy and infrastructure development.\n\nFor more information, you can check out their website at [perlstreet.com](https://perlstreet.com/).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/9c19acbc21027d84bf258ac5a78bc598aefe50a6.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191630Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=8d3de8913f6b38a4120afd4e4ebf3721d1a4c85043559ea7abae8d87c2b1c02c",
    "social_links": [
        "https://www.linkedin.com/company/perl-street/",
        "https://www.crunchbase.com/organization/perl-street-inc"
    ],
    "logo_path": "data/logos\\Perl_Street_logo.png"
}