{
    "links": "https://www.ycombinator.com/companies/perlara",
    "name": "Perlara",
    "headline": "Perlara: building the YC for rare disease parents",
    "batch": "W16",
    "description": "Perlara 1.0 (Feb 2014 - Feb 2019) launched early R&D joint ventures called PerlQuests with highly motivated rare disease families, companies or impact investors. We screened gene-edited patient avatars for repurposable drugs in order to build a predictive R&D engine called ArkBase. We planned to monetize programs based on ArkBase predictions by selectively spinning out asset-centric clinical development NewCos.\r\n\nPerlara 1.5 (March 2019 - April 2020) was the transition to a one-person virtual clinical development company and when the epalrestat and aripiprazole repurposing trials were launched at Mayo Clinic for the treatment of PMM2-CDG and NGLY1-CDDG, respectively.\r\n\nPerlara 2.0 (May 2020 --> The first decentralized and distributed biotech",
    "activity_status": "Active",
    "website": "http://perlara.com",
    "founded_date": 2014.0,
    "team_size": 1.0,
    "location": "Oakland, CA",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "location:san-francisco-bay-area",
    "founders": [],
    "status": true,
    "generated_description": "### Perlara: A New Frontier in Rare Disease Research\n\n**Mission:** Perlara aims to create a supportive ecosystem akin to Y Combinator, specifically tailored for parents navigating the complexities of rare diseases. They strive to empower these families by facilitating innovative drug development and treatment pathways.\n\n**Company Evolution:**\n- **Perlara 1.0 (2014-2019):** The company’s initial phase focused on pioneering early R&D through partnerships with passionate families, companies, and investors. They initiated \"PerlQuests\" where gene-edited patient avatars were screened for repurposable drugs. This led to the development of ArkBase, a predictive R&D engine designed to spin out targeted clinical development companies.\n  \n- **Perlara 1.5 (2019-2020):** A shift occurred towards a lean operation, transitioning into a virtual clinical development company. This period saw the launch of drug repurposing trials for specific rare diseases at the Mayo Clinic, marking significant strides in their research efforts.\n\n- **Perlara 2.0 (May 2020-Present):** As a decentralized biotech entity, Perlara now emphasizes modality-agnostic virtual consulting and model-agnostic drug repurposing. Their innovative approach allows them to guide families and scientists alike through the often overwhelming process of seeking and developing treatments.\n\n**Location and Team:** Based in Oakland, California, Perlara operates with a remarkably small team of just one full-time employee, showcasing a commitment to efficiency and focused leadership.\n\n**Current Services:** \n- **Guided Cures™:** A unique offering where experienced researchers and clinicians collaborate with families to navigate treatment options effectively. Perlara’s Cure Guides™ play a crucial role in guiding families through complex medical pathways.\n\n- **Cure Odysseys™:** Community-centric initiatives designed to connect affected families with the resources and support they require. This collaborative platform emphasizes shared journeys in discovering viable treatments.\n\n**Founding Background:** Established in 2014 and a member of Y Combinator's Winter 2016 batch, Perlara is a testament to innovation within the rare disease landscape.\n\n**Get Involved:** Perlara welcomes both families and scientists to join their mission in revolutionizing care for rare diseases. By fostering a community of support and expertise, they’re paving the way for breakthroughs in treatment and understanding.\n\nFor more information, check out their website: [Perlara](http://perlara.com)\n\n---\n\nThrough its novel approach and unwavering focus, Perlara exemplifies how combining community, technology, and innovative thinking can create meaningful impacts in the realm of healthcare. It’s a promising model that signals a shift in how solutions are discovered and developed for rare diseases.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/a15a9a6c3641e738c2648fdcb9653e0cd6208f35.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191630Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=0b87b0b8c3815e589f264aa2ff097d50da029cd132d29d46c7ca3e829db55323",
    "social_links": [
        "https://twitter.com/perlarapbc",
        "https://facebook.com/perlarapbc"
    ],
    "logo_path": "data/logos\\Perlara_logo.png"
}