{
    "links": "https://www.ycombinator.com/companies/petcube",
    "name": "Petcube",
    "headline": "Petcube is on the mission to improve lives of pets and pet ownersâ\u0080¦",
    "batch": "W16",
    "description": "Petcube is a company reimagining pet care, and using technology to keep people connected with their pets. Its first product, Petcube Camera, is an interactive pet monitor with real time video and built-in laser pointer. It allows pet owners to watch, talk to, and play with their pet from their smartphone, no matter where they are. \r\n\nFounded in Kyiv in 2013, Petcube was funded on Kickstarter and became one of the most successful crowdfunding pet products in history. Since graduating from the prestigious Y-Combinator incubation program, Petcube has gone on to launch two additional products, Petcube Play and Petcube Bites, as well as a cloud video recording service, Petcube Care. Petcube products are available online and in stores including Brookstone, Best Buy, and Petco.",
    "activity_status": "Active",
    "website": "http://petcube.com",
    "founded_date": 2012.0,
    "team_size": 51.0,
    "location": "San Francisco",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:hardware; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Andrey Klen, Founder/Chief Design Officer",
            "description": "Building products and brands from the ground up, strong design/marketing mix. Pet parent. 5 times Red Dot Award winner. Running www.ozero.design.",
            "linkedin": "https://www.linkedin.com/in/andreyklen"
        },
        {
            "name": "Alex (Sasha) Neskin, Founder/CTO",
            "description": "Alex is responsible for production: he knows how to survive in China and organize the work of factories. \n\nFeel free to contact about anything! alex@petcube.com",
            "linkedin": "https://www.linkedin.com/pub/alex-neskin/15/244/155"
        },
        {
            "name": "Yaroslav Azhnyuk, Founder/CEO",
            "description": null,
            "linkedin": "https://www.linkedin.com/in/YaroslavAzhnyuk"
        }
    ],
    "status": true,
    "generated_description": "Let’s talk about Petcube, a company that’s making waves in the pet care world by combining technology with a love for animals. Founded in Kyiv in 2013 (although they trace their roots to 2012), Petcube started its journey by launching the Petcube Camera on Kickstarter. This interactive pet monitor allows owners to see, talk to, and even play with their pets via their smartphones, no matter where they are. A huge hit, it became one of the most successful crowdfunding pet products ever.\n\nAfter graduating from Y Combinator's Batch W16, Petcube didn't sit on its laurels. They expanded their product line to include Petcube Play, Petcube Bites, and even a cloud video recording service called Petcube Care. Today, you can find their products both online and in retail giants like Best Buy and Petco.\n\nNow headquartered in San Francisco with a team of around 51 employees, Petcube is driven by a mission: to improve the lives of pets and their owners. They cater to tech-savvy pet parents who desire more than just basic pet care products. Their lineup now includes a GPS tracker for pets, smart pet cameras, water fountains with advanced filtration, and a variety of healthy treats.\n\nPetcube’s commitment extends beyond innovative gadgets. They offer services like Petcube Care, which provides pet and human alerts along with up to 90 days of video history, and a Pet Emergency Fund covering up to $3,000 for veterinary emergencies. Their app, which is available on both iOS and Android, allows pet owners to access all these features and stay connected with their furry friends.\n\nThe company is well-regarded in the industry. Their products have been highlighted by various media outlets, and they boast a 4.3 out of 5 rating from thousands of users. It's clear that Petcube isn't just about making money; they’re genuinely invested in enhancing the lives of pets and their humans through smart technology.\n\nWant to dive deeper? Check out their website at [petcube.com](http://petcube.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/e2dc8603f123572ca0ab4bf36fda71db64320901.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191635Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=cd0a91ae6a6458eb76d4cfc3036e7e427bf8d347906977d49b6144778ec10a25",
    "social_links": [
        "https://www.linkedin.com/company/petcube",
        "https://twitter.com/petcube",
        "https://www.facebook.com/petcube.inc/",
        "https://www.crunchbase.com/organization/petcube"
    ],
    "logo_path": "data/logos\\Petcube_logo.png"
}