{
    "links": "https://www.ycombinator.com/companies/philippo",
    "name": "Philippo",
    "headline": "Get instant access to cash before selling your home in Latam.",
    "batch": "W22",
    "description": "Philippo is building the first proptech platform in Latam that provides liquidity to home equity.\r\n\nIn Latam, ~40% of homebuyers need to sell their current property in order to afford their new home. Buying and selling at the same time can be overwhelming.\r\n\nBy implementing a Sale and Leaseback transaction, Philippo enables homeowners to access their home equity before selling their property on the market, avoiding price discounts and eliminating the pain of moving twice and/or losing their dream home.",
    "activity_status": "Active",
    "website": "https://philippo.io/",
    "founded_date": 2021.0,
    "team_size": 8.0,
    "location": "Santiago, Chile",
    "group_partner": "Michael Seibel",
    "group_partner_yc": "https://www.ycombinator.com/people/michael-seibel",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:proptech",
    "founders": [
        {
            "name": "Guido Galanter, Founder",
            "description": "Guido is co-founder and CEO of Philippo, which he launched with Nicolas and Tomas in 2021. Prior to Philippo, Guido led New Ventures at OLX (Naspers Group's main marketplace) where he launched tech transactional models from India to Latam. Guido was also involved in plenty M&As with Naspers, main was Frontier Car Group's acquisition (~$700M deal)",
            "linkedin": "https://ar.linkedin.com/in/guido-galanter-61771593"
        },
        {
            "name": "Tomás Gropper, Founder",
            "description": "Tomás is co-founder and CTO of Philippo. He has a Systems Engineering degree and was Head of Engineering at the largest retailer in Argentina, where he built and managed high-performance engineering teams, helping scale the company's operation, especially during the pandemic quarantine.",
            "linkedin": "https://www.linkedin.com/in/tomasgropper"
        },
        {
            "name": "Nicolás Piqueras, Founder",
            "description": "Nicolás is Co-founder and CFO of Philippo, launched with Guido and Tomás in 2021. Prior to Philippo, Nicolás worked in residential Real Estate, leading corporate finance and capital markets in two of the largest home builders in Argentina. He led several transactions and became specialized in IR and fundraising. Among others, he coordinated two IPOs in NYSE as an insider, leading team efforts to reach SEC standards. Nicolás studied Economics and Finance in Universidad Torcuato Di Tella.",
            "linkedin": "https://www.linkedin.com/in/nicol%C3%A1s-piqueras-38404226/"
        }
    ],
    "status": true,
    "generated_description": "**Meet Philippo: Revolutionizing Home Equity in Latam**\n\n**Mission:** Philippo's mission is straightforward yet powerful: to provide homeowners in Latin America with instant access to cash before they sell their homes. This addresses a crucial gap in the home buying and selling process in a region where nearly 40% of homebuyers need to offload their current properties to finance their next purchase.\n\n**What They Do:** Philippo is pioneering the first proptech platform in Latam designed specifically to offer liquidity to home equity. Through a mechanism known as Sale and Leaseback, they empower homeowners to monetize their home equity without the hassle of selling their property first. This means avoiding potential price discounts, the stress of moving twice, and the risk of missing out on a dream home—all common headaches for those buying and selling simultaneously.\n\n**Background:** Founded in 2021 and based in Santiago, Chile, Philippo emerged from Y Combinator's Winter 2022 batch. With a lean team of just 8 employees, they've shown remarkable ambition. Led by Group Partner Michael Seibel, they are positioned to make a significant impact in the fintech and proptech sectors.\n\n**What’s Next:** As Philippo continues its journey, they’re focused on refining their service and expanding their user base. With their innovative approach, they are not just helping homeowners access cash quickly; they’re reshaping the real estate landscape in Latam.\n\nFor more information, you can check out their website at [philippo.io](https://philippo.io/). In a world where buying and selling homes shouldn't be a logistical nightmare, Philippo stands out as a beacon of solutions.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/6c25c61706a760f0e957fa276850268ee704720d.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191635Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=1ffdc4e59ba2e986e2e4dabc31d0369f493462f6da22ec1325ee7042503147be",
    "social_links": [
        "https://www.linkedin.com/company/philippo"
    ],
    "logo_path": "data/logos\\Philippo_logo.png"
}