{
    "links": "https://www.ycombinator.com/companies/photoroom",
    "name": "Photoroom",
    "headline": "Power commerce photography with generative AI",
    "batch": "S20",
    "description": "Photoroom provides photo editing software powerful enough to create outstanding images yet simple enough to be used without any training. We leverage deep learning to translate pixels into objects, drastically simplifying non-creative tasks such as removing backgrounds from images.\r\n\nOur mission: enable entrepreneurs and small businesses to compose images that stand out.",
    "activity_status": "Active",
    "website": "https://photoroom.com/",
    "founded_date": 2019.0,
    "team_size": 60.0,
    "location": "Paris, France",
    "group_partner": "Gustaf Alstromer",
    "group_partner_yc": "https://www.ycombinator.com/people/gustaf-alstromer",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:artificial-intelligence; industry:generative-ai; industry:computer-vision; industry:design-tools; industry:api",
    "founders": [
        {
            "name": "Matt Rouif, Founder",
            "description": "Co-founder and CEO of PhotoRoom, which enables anyone to create studio-quality photos on his smartphone. \nPolytechnique & Stanford graduate. I created the first mobile apps for ski resorts, used by 50+ ski resorts globally. Then co-founded HeyCrowd app to make surveys more social. Later, I led product for the Replay video editor,  awarded « best app » of the year by Apple. GoPro acquired Replay, where he led all image editing products. I left GoPro to start PhotoRoom",
            "linkedin": "https://www.linkedin.com/in/matthieurouif/"
        },
        {
            "name": "Eliot Andres, Founder",
            "description": "3 years of experience in computer vision and deep learning, before that I worked on 5 different mobile apps.",
            "linkedin": "https://www.linkedin.com/in/eliotandres/"
        }
    ],
    "status": true,
    "generated_description": "**Photoroom: Simplifying Visual Commerce with AI**\n\nFounded in 2019 and part of Y Combinator's S20 batch, Photoroom is a Paris-based company on a mission to empower entrepreneurs and small businesses with the power of commerce photography powered by generative AI. They aim to revolutionize image-editing tasks that are often mundane and non-creative, such as background removal, allowing users to focus on their creative expression.\n\n**Who They Are**\nPhotoroom started as a user-friendly photo editing software, harnessing deep learning algorithms to transform pixels into recognizable objects. With a 60-person team under the guidance of Group Partner Gustaf Alstromer, the company has quickly gained traction among users who appreciate its balance of strength and simplicity.\n\n**What They Offer**\nTheir platform is packed with tools designed to enhance image production for a variety of industries, from fashion to e-commerce. Some standout features include:\n\n- **AI Background Remover**: Instantly remove backgrounds from images.\n- **AI Retouch**: Clean up images by removing unwanted elements.\n- **Batch Editor**: Save time by editing multiple photos simultaneously.\n  \nPhotoroom is not just about editing; it’s about making better visuals accessible for everyone, even those without formal design training. They've designed an intuitive platform that allows users to create marketing assets, social media content, stunning product photos, and more—all in real-time collaboration.\n\n**Diverse Use Cases**\nPhotoroom caters to small businesses, freelancers, and even larger enterprises. Whether you need to create ad assets, build a brand kit, or conduct automated post-production, Photoroom’s tools are tailored to make your visuals stand out. \n\n**Integration and API**\nFor developers, Photoroom offers a seamless API that allows for easy integration into existing systems, enabling automated image editing across various applications. This feature is particularly beneficial for businesses that handle large volumes of images.\n\n**Why It Matters**\nUltimately, Photoroom isn’t just selling a photo editor; they're providing a way for businesses to enhance their online presence, increase engagement, and drive sales—all without the need for costly designers or extensive training. Their tools have broad applicability, making professional-quality visuals achievable for anyone.\n\nIn a world where visual content can make or break an online brand, Photoroom ensures that every entrepreneur has the tools at their disposal to create stunning, high-performing images that truly resonate with their audience.\n\nTo start creating or to explore their offerings, you can visit their website at [photoroom.com](https://photoroom.com/).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/984c6bd623a008abfb0e8a8ec7c9f6dcd6c30b95.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191637Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=c562fb8b4426cd4e5b8e4f01bdd883be8e4e0ed7234568277f8da76db157e42f",
    "social_links": [
        "https://www.linkedin.com/company/photoroom/",
        "https://twitter.com/photoroom_app",
        "https://www.facebook.com/PhotoRoom-105863290980747",
        "https://github.com/PhotoRoom"
    ],
    "logo_path": "data/logos\\Photoroom_logo.png"
}