{
    "links": "https://www.ycombinator.com/companies/picktrace",
    "name": "PickTrace",
    "headline": "Workforce Management for Large Farms",
    "batch": "S15",
    "description": "PickTrace is a fast growing software company that provides workforce and harvest management solutions for large-scale farms. Founded by brothers Austin and Harrison Steed, PickTrace is building the farm management system of the future. \r\n\nPickTrace builds powerful software products that help agriculture companies thrive. Our workforce and harvest management software helps growers gain insight into their operations and improve their operational efficiency. Everything that we do is based on the conviction that we succeed when our customers build a more efficient, compliant, and profitable operation.",
    "activity_status": "Active",
    "website": "http://picktrace.com/company",
    "founded_date": 2015.0,
    "team_size": 65.0,
    "location": "Los Angeles, CA",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:saas; location:los-angeles",
    "founders": [
        {
            "name": "Harrison Steed, Founder/Labor Management, Harvest Management, & Traceability",
            "description": "YC Badge: 0xEb4DE7B7ffD641d114Cd9510aEb14Ba176E07f7C",
            "linkedin": "http://www.linkedin.com/pub/harrison-steed/"
        },
        {
            "name": "Austin Steed, Founder",
            "description": null,
            "linkedin": "https://www.linkedin.com/in/austinsteed"
        }
    ],
    "status": true,
    "generated_description": "**PickTrace: Revolutionizing Workforce Management in Agriculture**\n\nFounded in 2015 by brothers Austin and Harrison Steed, PickTrace is a Los Angeles-based software company that's quickly making a name for itself in the agricultural sector. As part of Y Combinator’s Summer 2015 batch, they’ve honed a powerful suite of tools designed specifically for large-scale farming operations. \n\n**Mission and Products**\nAt its core, PickTrace aims to streamline workforce management for large farms. Their software solutions focus on workforce and harvest management, providing farmers with real-time insights that boost operational efficiency and ensure compliance with labor laws. They understand that agriculture, one of the oldest industries, is fraught with complexities, and their mission is to provide a complete farm management solution to tackle these challenges head-on.\n\n**Growth and Impact**\nFrom its humble beginnings helping the Steed family's own farm, to now servicing some of the largest berry, citrus, and apple growers across the United States, Mexico, Peru, Chile, and Australia, PickTrace has rapidly expanded. Their tools are used daily by tens of thousands of farm workers, enhancing productivity and supporting the agriculture that feeds millions worldwide.\n\nBy 2018, PickTrace reached cash-flow positivity, and with a recent round of Series A funding, they are poised for even greater growth. At present, the company employs about 65 talented individuals who share a common passion for transforming the agriculture landscape through technology.\n\n**Company Values and Culture**\nPickTrace's culture stands on four core principles:\n\n1. **Customer Focus:** They prioritize understanding and solving real problems for their customers, believing that their success is directly tied to that of the growers they serve.\n   \n2. **Innovation:** Employees are encouraged to be builders who take the initiative, which spurs the development of innovative solutions.\n\n3. **Collaboration:** The team fosters a collaborative environment where helping each other and putting collective interests above personal ones is the norm.\n\n4. **Transparency:** By emphasizing data and clarity in communication, they ensure that decisions align with the company's vision and operations are agile.\n\n**Leadership Team**\nAt the helm, Austin serves as the founder and board member, while Harrison operates as the president. They are supported by a capable leadership team that includes CEO Joel Zemer, CTO Damon Valenzona, Director of Product Greg Moore, and Director of Customer Experience Kalyn Wilke.\n\n**Accolades**\nPickTrace's innovative solutions haven't gone unnoticed; they were named the “Labor Management Solution of the Year” at the 2022 AgTech Breakthrough Awards, reflecting their commitment to quality and impact.\n\nYou can learn more about the company, its mission, and how they are reshaping workforce management in agriculture by visiting their website at [PickTrace](http://picktrace.com/company). \n\nIn essence, PickTrace is not just a software company; it’s a vision for a more efficient future in farming, blending the age-old craftsmanship of agriculture with cutting-edge technology.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/cd7ce60475a1468f0ea24ccdadc900986ca8dcb0.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191638Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=769862e7784eb47451b03bad64d7572ca322c26b8aef09fbd2547afcbf5d8f62",
    "social_links": [
        "https://www.linkedin.com/company/picktrace/",
        "https://www.facebook.com/picktrace",
        "https://www.crunchbase.com/organization/picktrace"
    ],
    "logo_path": "data/logos\\PickTrace_logo.png"
}