{
    "links": "https://www.ycombinator.com/companies/pigeon-2",
    "name": "Pigeon",
    "headline": "Simplifying loans with your friends & family.",
    "batch": "W22",
    "description": "Pigeon is a relationship based technology platform that facilitates the creation and management of loans between friends, family, loved ones, and anyone who trusts one another.\r\n\nBy providing smarter ways for people to mix money with their relationships, Pigeon seeks to empower individuals to borrow and lend money with the people they trust.",
    "activity_status": "Active",
    "website": "https://www.usepigeon.io",
    "founded_date": 2020.0,
    "team_size": 5.0,
    "location": "Miami, FL",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:consumer; industry:legaltech",
    "founders": [
        {
            "name": "Brian Bristol, Founder",
            "description": "Tech Enthusiast. Hacker. Food Lover. Hip Hop Head\n\n#HustlingDegenerate\n\n🐣 Pigeons Are The Smartest Bird in the Animal Kingdom",
            "linkedin": "https://www.linkedin.com/in/brianbristol~tech/"
        }
    ],
    "status": true,
    "generated_description": "### Pigeon: Simplifying Loans Among Friends and Family\n\nFounded in 2020 and part of Y Combinator Batch W22, Pigeon is a Miami-based fintech startup that’s tackling a common challenge: how to lend and borrow money within our personal networks without the usual awkwardness. Their mission is straightforward: to simplify the loan process, making it easier for friends, family, and loved ones to help each other out financially.\n\n#### The Core Concept\n\nPigeon operates as a relationship-based technology platform, bridging the trust barrier that often complicates informal lending. By allowing users to set up loans easily, keep track of payments, and automate reminders, Pigeon empowers individuals to engage in financial transactions with people they trust—without the stress traditionally associated with money exchanges in personal relationships.\n\nWith a small but dedicated team of five, Pigeon has already attracted over 100,000 users looking for a smarter way to finance their needs. Their services come with no hidden fees, making it an attractive choice for both lenders and borrowers. \n\n#### Features and Functionality\n\n1. **Loan Creation**: Users can create loans in mere minutes. After agreeing on terms, they can send invitations to friends or family members to participate.\n  \n2. **Payment Tracking**: No more awkward reminders; Pigeon offers automatic payment tracking and notifications, so everyone stays on the same page without the discomfort.\n\n3. **Legal Documents**: Integrated legal documents provide peace of mind, ensuring that everyone understands the terms of the arrangement.\n\n4. **Community and Learning**: Beyond lending and borrowing, Pigeon includes educational resources for financial literacy, empowering users to manage their finances better.\n\n#### Testimonials\n\nPigeon’s users have praised the platform for its ease of use and its role in strengthening their personal relationships. Stories from users like Josh Grimes and Monique Wilson highlight how Pigeon has made lending money straightforward and stress-free, enabling them to pursue personal and business aspirations with the support of their community.\n\n#### In a Nutshell\n\nPigeon tackles the challenge of mixing money with personal relationships head-on. By providing a free, user-friendly platform for managing loans with people you know and trust, they make an age-old practice more accessible and less awkward. For anyone looking to lend or borrow in a more organized manner, Pigeon presents a compelling solution worth checking out.\n\nFor more information or to get started, visit [Pigeon](https://www.usepigeon.io).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/be8254e11eb32cd73cfcdcc5f990aa741fbac6c4.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191638Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=b1161dfe1368fd81aecd483dabf6b27849b09e8e50053d87b7ac18aba11c82a7",
    "social_links": [
        "https://www.linkedin.com/company/usepigeon/",
        "https://twitter.com/use_pigeon",
        "https://www.facebook.com/usepigeon",
        "https://www.crunchbase.com/organization/pigeon-loans"
    ],
    "logo_path": "data/logos\\Pigeon_logo.png"
}