{
    "links": "https://www.ycombinator.com/companies/piinpoint",
    "name": "PiinPoint",
    "headline": "PiinPoint helps businesses find the best locations for growth",
    "batch": "W14",
    "description": "PiinPoint is changing the way businesses identify the best location for expansion. Our modern day SAAS solution enables businesses to use powerful tools to search and validate locations throughout North America. We centralize a variety of datasets such as traffic, demographics, and available commercial real estate to ensure businesses can make a fast and reliable decision about where to expand.",
    "activity_status": "Active",
    "website": "https://piinpoint.com",
    "founded_date": 2013.0,
    "team_size": 20.0,
    "location": "Kitchener, Canada",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:saas; industry:real-estate; industry:analytics",
    "founders": [
        {
            "name": "Jim Robeson, Founder",
            "description": "Jim Robeson is the Co-founder and CEO of PiinPoint, a location analytics solution that helps retailers identify and predict the financial performance of future store locations. Since its launch in 2014, more than 250,000 locations have been analyzed using PiinPoint’s services.",
            "linkedin": null
        },
        {
            "name": "Adam Saunders, Founder/CTO",
            "description": null,
            "linkedin": "https://www.linkedin.com/in/adamrsaunders/"
        }
    ],
    "status": true,
    "generated_description": "**PiinPoint: Your Location Intelligence Partner**\n\nFounded in 2013 and hailing from Kitchener, Canada, PiinPoint is revolutionizing how businesses identify optimal locations for growth. A proud member of Y Combinator's Batch W14, this SaaS company seamlessly integrates various datasets—including traffic patterns, demographics, and available commercial real estate—into a robust platform designed for quick, data-driven decision-making.\n\n### What They Do\nPiinPoint helps businesses pinpoint the best sites for expansion across North America. Their sophisticated tools provide businesses with insights needed to evaluate potential locations effectively. This means you can forget about the guesswork and focus on what really matters: making informed decisions backed by data. \n\nTheir range of offerings includes predictive analytics, customer insights, site reports, and even network planning, all tailored to optimize your real estate strategy. They tag themselves with keywords like 'SaaS,' 'real-estate,' and 'analytics,' which neatly encapsulate their core competencies.\n\n### The Team\nWith a dedicated team of about 20 employees, PiinPoint operates with tailored expertise, ensuring their clients receive exceptional service and support. The company's leadership understands the intricacies of location intelligence and offers deep insights gleaned from real-world applications.\n\n### Testimonials & Impact\nCustomers rave about PiinPoint's user-friendliness and the powerful impact it has on their site selection processes. For example, Jessica McCabe, a Retail Analyst at Cushman & Wakefield, emphasizes that PiinPoint “has become an integral part” of her role, demonstrating its value in the industry.\n\n### The Bottom Line\nSince its inception, PiinPoint has positioned itself as a must-have tool for any business looking to expand intelligently. By effectively using data and predictive modeling, they empower companies to make informed, strategic decisions about their growth. If you're interested in leveraging this kind of location intelligence to boost your expansion efforts, check out their offerings at [PiinPoint's website](https://piinpoint.com).\n\nSo, whether you're a retail store looking for your next bustling street corner, or a franchisor mapping out your national expansion strategy, PiinPoint is the partner you didn’t know you needed. Get ready to grow with confidence, optimize your locations, and make informed decisions every step of the way.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/20183355c49157eeca5d5b027cff5f2711005cf5.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191639Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=4149c460f73abba9ea6c8c1118f6bcaeec28442e19c2a7d906c62afe8d9c465a",
    "social_links": [
        "https://www.crunchbase.com/organization/piinpoint",
        "https://github.com/piinpoint"
    ],
    "logo_path": "data/logos\\PiinPoint_logo.png"
}