{
    "links": "https://www.ycombinator.com/companies/pina-earth",
    "name": "Pina Earth",
    "headline": "Unlocking carbon markets for European forest owners",
    "batch": "W22",
    "description": "Pina Earth is building a suite of digital tools for data collection, monitoring, and certification of forest carbon projects. EU forests are at high risk due to climate change. With Pina Earth, forest owners can start high-quality carbon projects on their properties and use the new income stream to prepare their forests for a changing climate. Founded only last year, the startup already has active pilot projects on over 1,000 hectare (∼2,500 acres) in Germany. The founders met at CDTM and joined their expertise in sustainability science, software engineering, and machine learning to help EU forests.",
    "activity_status": "Active",
    "website": "https://pina.earth/en",
    "founded_date": 2021.0,
    "team_size": 8.0,
    "location": "Munich, Germany",
    "group_partner": "Gustaf Alstromer",
    "group_partner_yc": "https://www.ycombinator.com/people/gustaf-alstromer",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:climate; industry:climatetech",
    "founders": [
        {
            "name": "Gesa Biermann, Founder",
            "description": "I have a background in environmental studies (PhD @LMU, M.Sc., @TU Munich) and business (C-level consulting at Kearney, Audi). Before founding Pina Earth, I co-led the Center for Digital Technology and Management (CDTM) in Munich for the four years of my doctoral research. At CDTM, I taught entrepreneurship and was responsible for partnerships (with e.g. Siemens AI, Adidas) as well as recruiting. CDTM is also where I met my co-founders, Jonas and Florian.",
            "linkedin": "https://www.linkedin.com/in/gesabiermann/"
        },
        {
            "name": "Florian Fincke, Founder",
            "description": "My main study background is in HCI (M.Sc. @ LMU in Munich, Germany). I specialized in affective computing & decision-support systems for expert users. Additionally, I attended an add-on study program in Technology Management @ the Center for Digital Technology and Management (CDTM) where I also met my co-founders. Since the beginning of my studies, I was working as a full-stack web and app developer at various early-stage start-ups including Alasco, ORDA, and ShoeSizeMe.",
            "linkedin": "https://www.linkedin.com/in/florian-fincke/"
        }
    ],
    "status": true,
    "generated_description": "### Pina Earth: Championing Carbon Markets for European Forests\n\n**Founded:** 2021  \n**Location:** Munich, Germany  \n**Team Size:** 8  \n**Y Combinator Batch:** W22\n\n#### Mission\nPina Earth is on a mission to unlock carbon markets for European forest owners. The startup addresses a pressing concern: the vulnerability of EU forests to climate change. By equipping forest owners with a suite of digital tools for data collection, monitoring, and certification of forest carbon projects, Pina Earth enables them to initiate high-quality carbon projects. This not only helps preserve forests but also provides a new income stream for owners, aiding them in adapting their forests to changing environmental conditions.\n\n#### What They Do\nPina Earth specializes in providing high-quality carbon credits sourced from local forests, transforming pure stands into climate-resilient mixed forests. Their approach promotes climate resilience, focusing on the fact that around 60% of EU biomass is at risk from climate change. Remarkably, they already have pilot projects covering over 1,000 hectares (about 2,500 acres) in Germany.\n\n#### Founders\nThe founders, who met at the Center for Digital Technology and Management (CDTM), combine expertise in sustainability science, software engineering, and machine learning. This diverse skill set is vital in crafting tools that promote effective forest management and carbon credit trading.\n\n#### Partnerships and Customers\nPina Earth works with an impressive roster of partners and clients, including notable names like Airbnb, Red Bull, and Polarstern, all of whom value the innovative ways the company enables climate action through carbon credits. The startup has garnered recognition, being awarded the title of “Digital Start-up of the Year 2024.”\n\n#### Current Focus Areas\n1. **Forest Owner Engagement:** Educating and enabling forest owners to capitalize on carbon credits.\n2. **Credit Buyer Support:** Connecting businesses and organizations looking to purchase carbon credits with local conservation projects.\n3. **Promoting Climate Resilience:** Engaging in forestry practices that boost biodiversity and combat negative climate impacts.\n\n#### Media Recognition\nPina Earth has captured attention from various major media outlets, establishing itself as a leader in the climate tech space. Coverage includes features in *TechCrunch*, *Handelsblatt*, and *Wirtschaftswoche*.\n\n#### Contact\nInterested parties can reach out via email at team@pina.earth or call +49 1517 433 5250. They also encourage arranging introductory meetings to discuss forest adaptation projects and carbon credit opportunities.\n\nFor more information, visit their website: [Pina Earth](https://pina.earth/en).\n\n---\n\nWith its innovative approach and dedication to sustainability, Pina Earth is not just another startup; it's a beacon of potential in the fight against climate change, transforming the way we think about forests and carbon markets in Europe.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/68693816e36fa566d3ef87942732655688e69b3a.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191639Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=c32c16ae299154fede1bd08314431fcaf153cb48f971967dbbc35771217030d5",
    "social_links": [
        "https://www.linkedin.com/company/pina-de/",
        "https://twitter.com/pinaearth"
    ],
    "logo_path": "data/logos\\Pina_Earth_logo.png"
}