{
    "links": "https://www.ycombinator.com/companies/pina",
    "name": "PINA",
    "headline": "WealthFront of Indonesia",
    "batch": "W22",
    "description": "At PINA, we are designing and building the future of personal finance with a mission to help everyone achieve financial freedom by providing products and advice that make complicated financial decisions simple and relevant. \r\n\nWe seamlessly integrate money management and investing into one app to allow people to manage their finances holistically. Users can see their net worth, monthly cash flow and how their budget has changed over the past several months. All of this is automated and designed to help them achieve the savings goal which they have set .\r\n\nIn addition to money management, we focus on making investing easy with pre-built portfolios and automatic rebalancing. When you sign up for an account, it offers the option to pick an expertly built portfolio, or you can choose to build your own.",
    "activity_status": "Active",
    "website": "https://pina.id",
    "founded_date": 2021.0,
    "team_size": 25.0,
    "location": "Jakarta, Indonesia",
    "group_partner": "Gustaf Alstromer",
    "group_partner_yc": "https://www.ycombinator.com/people/gustaf-alstromer",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:machine-learning",
    "founders": [
        {
            "name": "Daniel van Leeuwen, Founder",
            "description": "Founder at PINA. Previously worked @ Grab as Country Marketing Head for Indonesia, where I was responsible for driving the brand and marketing strategy for the Grab mother brand and all products under the super app ecosystem.  Have 15+ years experience across design, tech, and marketing.",
            "linkedin": "https://www.linkedin.com/in/dan-van-leeuwen-7429104/"
        },
        {
            "name": "Christian Hermawan, Founder",
            "description": "Over 20 years experience in capital market. Managing a company with USD 150 million transaction value per month with USD 300 million asset under management.",
            "linkedin": "http://linkedin.com/in/christian-hermawan-26293952"
        },
        {
            "name": "Fajar Kuntoro, Founder",
            "description": "10+ years working at multinational digital & innovation design agency. led project on web, mobile, data, enterprise solution, marketing & personalisation stack, and digital transformation for FMCG and financial Industry /  Brands. \n\nStarted my career as fullstack engineer, led a team of engineer after moved back from UK",
            "linkedin": "https://www.linkedin.com/in/fajar-kuntoro-35860354/"
        },
        {
            "name": "Hendry Chou, Founder",
            "description": null,
            "linkedin": "https://www.linkedin.com/in/hendry-chou-42251125/"
        }
    ],
    "status": true,
    "generated_description": "PINA is a dynamic fintech startup based in Jakarta, Indonesia, launched in 2021 as part of Y Combinator’s Batch W22. Think of it as the \"WealthFront of Indonesia\"—a digital wealth management platform on a mission to simplify personal finance for everyone. Their goal? To help users achieve financial freedom through smart, user-friendly products and advice.\n\nThe core of PINA’s offering is its all-in-one app, which combines money management and investing. Users can assess their net worth, track monthly cash flow, and view budgeting trends—all automatically generated. This approach empowers individuals to set and reach their savings goals effortlessly.\n\nInvesting is made accessible through expertly crafted portfolios and automated rebalancing options. When you sign up, you can either select from pre-built investment portfolios or create one tailored to your own preferences. \n\nPINA offers a suite of personalized financial strategies through various advisory services. They provide guidance for:\n- Emergency fund savings\n- Investment management\n- Education funding plans\n- Retirement strategies\n- Debt management\n- Home purchase planning\n- Tailored insurance solutions\n\nSupported by a team of 25 professionals, including Gustaf Alstromer as their Group Partner, PINA combines advanced technology with human expertise. They've also passed ISO/IEC 27001:2022 certification and are duly registered with the Indonesian Ministry of Communication and Information Technology.\n\nFor those curious about their financial health, PINA offers a quick assessment tool that provides a financial \"health score\" and a comprehensive analysis within just 10 minutes.\n\nThe platform is straightforward: after scheduling a consultation, you connect with a certified financial planner, outline your financial goals, and receive a customized plan to help you follow through. They boast a commendable 4.7 rating on the App Store, with over 100,000 downloads across Android and iOS—an indication of their exhilarating growth trajectory.\n\nPINA is not just another finance app; it’s a comprehensive digital solution designed to meet diverse financial needs, from budgeting to investing—all offered in a way that feels personal and actionable. If you're keen to explore financial wisdom with a modern twist, PINA might just be your next stop. \n\nFor more information, check them out at [pina.id](https://pina.id).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/8801f49b9794aa0a79a3adcef04db166da1a43ed.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191640Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=e3084224e203704ff1e15f2f4234b88b9efa5426f47c62df854121e1fa3a6d77",
    "social_links": [
        "https://www.linkedin.com/company/pinaindonesia/",
        "https://twitter.com/PINA_ID"
    ],
    "logo_path": "data/logos\\PINA_logo.png"
}