{
    "links": "https://www.ycombinator.com/companies/pirouette-pharma",
    "name": "Pirouette Pharma",
    "headline": "We make injections as easy as pushing a button!",
    "batch": "S21",
    "description": "At Pirouette, we have developed a low-profile, disk-shaped, rugged injection device with a patient-centric focus on affordability, portability, and usability. The patented device, based on extensive patient input, is designed to make administering an injection as easy as pushing a button. This allows individuals with limited or no training to easily and intuitively perform an injection on themselves or others.",
    "activity_status": "Active",
    "website": "https://www.pirouettepharma.com/",
    "founded_date": 2017.0,
    "team_size": 9.0,
    "location": "Boston",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:health-tech; industry:medical-devices; industry:biotech; industry:healthcare; location:boston",
    "founders": [
        {
            "name": "Conor Cullinane, Founder",
            "description": "Conor obtained a PhD in Medical Engineering & Medical Physics at MIT and Harvard Medical School in the Health Sciences and Technology Program, and a BS in aeronautical engineering from Clarkson University. He is interested in leading engineering teams to successful technology implementations, not by ordering action to be taken, but rather taking action and motivating others to do the same.  He has expertise in human factors engineering, medical engineering, medical physics, and startups.",
            "linkedin": "https://www.linkedin.com/in/conorrcullinane/"
        },
        {
            "name": "Matthew Kane, Founder",
            "description": "Matthew received a B.S. in aeronautical and mechanical engineering from Clarkson University. He received a MSc in Aerospace Engineering from the University of Notre Dame. He is the COO of Pirouette Medical where he is primarily responsible for FDA Interactions, regulatory requirements, project management, quality management and design analysis. He has previous experience with fluid dynamics, turbomachinery, design, and testing. He loves learning and finding unique engineering solutions.",
            "linkedin": "https://www.linkedin.com/in/matthew-kane-321423139/"
        },
        {
            "name": "Elijah Kapas, Founder",
            "description": "Eli received a dual BS in Mechanical and Civil engineering from Clarkson University. Experience in design as well as implementation allows for key insight to user interfaces and workability. Eli is the CTO for Pirouette Medical and is responsible for device design and intellectual property. He has worked across multiple industries in roles ranging from quality to supervision and knows how to leverage the key strengths of team members to be successful.",
            "linkedin": "https://www.linkedin.com/in/eli-kapas-0b176366/"
        }
    ],
    "status": true,
    "generated_description": "**Company Overview: Pirouette Pharma**\n\nFounded in 2017, Pirouette Pharma is a Boston-based health-tech company on a mission to revolutionize how injections are administered—making it as simple as pushing a button. This innovation is particularly significant for users with little to no medical training, enhancing accessibility and usability in healthcare.\n\n### What They Do\nAt its core, Pirouette focuses on developing a low-profile, disk-shaped injection device that is rugged, affordable, and portable. This device is driven by extensive feedback from patients, ensuring it meets real-world needs.\n\nThe company is part of Y Combinator’s Batch S21, which reflects its acceleration in the startup ecosystem, highlighting its potential for growth and innovation. Their team consists of 9 dedicated employees who work tirelessly to push healthcare into the hands of patients.\n\n### Market Opportunity\nThe injectable drug market is vast—expected to surpass $1 trillion by 2029. Pirouette's current offerings include solutions for severe allergic reactions and opioid overdoses, addressing pressing public health issues. Their auto-injector technology has the scope to expand into various drugs, positioning Pirouette as a key player in the biotech space.\n\n### Core Team & Partnerships\nAlthough specifics about their team members are sparse, they are partnered with Nanos—a group that likely enhances their technological development capabilities. This partnership could be crucial as they advance their products from concept to market.\n\n### Contact & Learn More\nTo learn more about Pirouette Pharma or to explore partnership and investment opportunities, you can reach them through their website [Pirouette Pharma](https://www.pirouettepharma.com) or contact them directly at info@pirouettepharma.com. \n\n### Summary\nPirouette Pharma is not just about creating another medical device; it’s about simplifying healthcare and democratizing access to essential treatments. With a unique product in a lucrative market and a commitment to patient-centric design, they’re poised to make significant strides in medical technology.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/03f010ba97cf6d375d249e9708283530925cc1f7.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191642Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=7f41fc4649c1943b02a70200b31a526eeadb40bed27fed61b9182dfa51a3787a",
    "social_links": [
        "https://www.linkedin.com/company/pirouettepharma",
        "https://twitter.com/pirouettepharma",
        "https://www.facebook.com/pirouettepharma"
    ],
    "logo_path": "data/logos\\Pirouette_Pharma_logo.png"
}