{
    "links": "https://www.ycombinator.com/companies/planet-a-foods",
    "name": "Planet A Foods",
    "headline": "Building the next generation food ingredient champion.",
    "batch": "S21",
    "description": "Imagine a world without chocolate. Horrifying, right? But the supply of cocoa is endangered and chocolate is as bad as meat for our planet. \r\n\nWe make future-proof chocolate using precision fermentation. Doing this, our chocolate is 10x more sustainable and 20% cheaper than conventional chocolate. In order to mimic the organoleptic properties of chocolate (tender, smoothly melting taste release) we are working on the flavor itself but also on replacing the cocoa butter. \r\n\n55 Mio lbs of chocolate are consumed every day. By 2035 we will substitute a big chunk of it through our sustainable chocolate. \r\n\nIn addition, we are working on extending our technology platform to additional ingredients such as palm oil.",
    "activity_status": "Active",
    "website": "https://planet-a-foods.com/",
    "founded_date": 2021.0,
    "team_size": 6.0,
    "location": "Munich, Germany",
    "group_partner": "Gustaf Alstromer",
    "group_partner_yc": "https://www.ycombinator.com/people/gustaf-alstromer",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:climate; industry:climatetech",
    "founders": [
        {
            "name": "Maximilian Marquart, Founder",
            "description": "I am a food aficionado and my mission is to revolutionize the food system. Before founding QOA, I co-founded a company called 27pilots. At 27pilots I supported leading corporations to boost their innovation by collaborating with startups. During my time at 27pilots, I worked with >5000 B2B startups on selling their product to corporates and learned what it means to grow a 27pilots to a 7-digit revenue and 30+ employees. I am holding a Ph.D. in Material Science and Mechanical Engineering.",
            "linkedin": "https://www.linkedin.com/in/dr-maximilian-marquart-24a802107/"
        },
        {
            "name": "Sara Marquart, Founder",
            "description": "My two eternal loves are that for food and science.\nI am holding a Ph.D. in Food Chemistry.",
            "linkedin": "https://www.linkedin.com/in/saramarquart/"
        }
    ],
    "status": true,
    "generated_description": "### Planet A Foods: Revolutionizing Chocolate for a Sustainable Future\n\nImagine a world stripped of chocolate. Scary, right? That’s where Planet A Foods comes in. Founded in 2021 and nestled in Munich, Germany, this innovative startup aims to redefine how we think about chocolate and, ultimately, food ingredients. It’s part of Y Combinator Batch S21, indicating that its potential hasn’t gone unnoticed.\n\nThe mission is straightforward yet ambitious: **to build the next generation food ingredient champion**. With cocoa supplies dwindling and its production impacting our planet negatively, Planet A Foods is using **precision fermentation** to create sustainable chocolate alternatives that boast not just improved sustainability but also a lower price point—10 times more sustainable and 20% cheaper than traditional chocolate.\n\nEach day, a staggering 55 million pounds of chocolate are consumed globally. By 2035, this company aims to capture a significant share of that market with their eco-friendly chocolate substitute, maintaining the familiar taste and mouthfeel we love, while ensuring that we aren’t harming the environment in the process. They’re not stopping at chocolate either; the tech driving their innovations will soon extend to other ingredients like palm oil.\n\nThe founders highlight a troubling reality—growing demand for cocoa has led to widespread deforestation and increased carbon emissions, particularly in countries like Ghana. In fact, from 2000 to 2021, Ghana lost around 1.4 million hectares of tree cover, emitting a whopping 739 million tons of CO2 in the process. But Planet A Foods isn’t just about creating delicious alternatives; they aim to save **500 million tons of CO2 annually** by producing ingredients that don’t rely on limited natural resources and labor exploitation.\n\nWith a compact team of six, led by notable Group Partner Gustaf Alstromer, Planet A Foods is making waves in the realms of **climate and climatetech**. Their proprietary technology allows them to ferment plant-based inputs to recreate the flavors and textures we crave—locally and sustainably.\n\nCurious about their products or the science behind it? You can dive deeper into their offerings and mission on their website: [Planet A Foods](https://planet-a-foods.com/). \n\nIn the era of environmental awareness, Planet A Foods stands at the forefront, turning that horrifying vision of a chocolate-less world into a delicious reality where sustainability reigns.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/26ef9e7fc76fa22d7c0f660182e422c0643c7615.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191643Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=3a8dfb412a343ca7134248a72c7e28a22fce2b6579db47cc567c1e482cec2025",
    "social_links": [
        "https://www.linkedin.com/company/qoaco/"
    ],
    "logo_path": "data/logos\\Planet_A_Foods_logo.png"
}