{
    "links": "https://www.ycombinator.com/companies/plover-parametrics",
    "name": "Plover Parametrics",
    "headline": "Climate change insurance that pays out immediately.",
    "batch": "W22",
    "description": "The insurance industry struggles to insure new risks like climate change. The amount of climate risk that goes uninsured every year is $180 billion and growing. \r\n\nPlover's software platform enables insurers to design new insurance products quicker and manage policies cheaper, unlocking new risk markets and geographies.\r\n\nPlover's team previously worked together at Palantir, handling data infrastructure for the US Department of Defense.",
    "activity_status": "Active",
    "website": "https://plover.insure",
    "founded_date": 2022.0,
    "team_size": 6.0,
    "location": "New York",
    "group_partner": "Dalton Caldwell",
    "group_partner_yc": "https://www.ycombinator.com/people/dalton-caldwell",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "location:new-york",
    "founders": [
        {
            "name": "Max Clarke, Founder",
            "description": "Max studied History at Northwestern and Law at the University of Michigan. He spent 4 years practicing law (M&A and insurance regulatory work) before moving to Palantir, where he led business development efforts and implementation teams at the DoD and federal civilian agencies.",
            "linkedin": "https://www.linkedin.com/in/max-clarke-029821b/"
        },
        {
            "name": "Tommy Peeples, Founder",
            "description": "Tommy studied Physics at Harvard. He spent over four years at Palantir working on projects in the Defense, Intel, and Commerce spaces. He’s also a classically trained violinist and directed the Harvard mariachi band.",
            "linkedin": "https://www.linkedin.com/in/tommy-peeples-253641124/"
        },
        {
            "name": "Ranajay Sen, Founder",
            "description": "Ranajay studied undergraduate and graduate Computer Science at Stanford University, before working at Palantir Technologies for over 6 years. He served as Enterprise Technical Lead of Palantir’s law enforcement portfolio and led projects in federal defense, justice, and health.",
            "linkedin": "https://www.linkedin.com/in/ranajays/"
        }
    ],
    "status": true,
    "generated_description": "**Plover Parametrics: A Fresh Take on Insurance for a Changing Climate**\n\nFounded in 2022 and hailing from New York, Plover Parametrics is tackling a pressing issue in the insurance landscape: the inadequacy of coverage for climate-related risks. With a staggering **$180 billion** in climate risks left uninsured annually, Plover aims to fill this gap by harnessing technology to deliver **immediate payouts** for insured events, transforming the way we think about and approach insurance.\n\n### Mission\nAt its core, Plover's mission revolves around climate change insurance that pays out immediately. Their innovative approach not only provides peace of mind but also ensures that policyholders can weather the storms, literally and figuratively.\n\n### The Team\nThe brain behind Plover comes from an impressive background, with its team members previously collaborating at **Palantir**, where they managed data infrastructures for the US Department of Defense. This depth of experience informs their sophisticated software platform, designed to enable insurers to create and manage policies more effectively—unlocking new risk markets and geographies in the process.\n\n### Y Combinator & Growth\nPlover Parametrics is a proud member of Y Combinator's **W22 batch**, marking a significant step in its journey. With a compact yet mighty team of six, they're poised for growth, supported by their Group Partner **Dalton Caldwell**.\n\n### Products & Target Markets\nPlover is more than just an insurance broker; they’re a **specialty brokerage** focused on alternative risk solutions. Their offerings span various sectors, including:\n\n- **High Net Worth**\n- **Logistics**\n- **Hospitality**\n- **Energy**\n- **Agriculture**\n- **Healthcare**\n- **Real Estate**\n\nThey also cover a wide range of perils such as **named storms, earthquakes, wildfires, floods, tornadoes, and hail**, addressing the unique risks faced by these diverse industries.\n\n### How It Works\nPlover utilizes advanced software for efficient risk analysis and backtesting. This means agents can transparently see how an earthquake policy would have functioned historically, enabling better decision-making for future coverage. Their platform is aimed at bringing clarity to brokers working in challenging market conditions.\n\n### Accessing Their Services\nPlover makes it straightforward to engage with their services. Brokers can submit inquiries quickly, and the company promises to respond within **48 hours**. They operate in **48 states**, making their innovative approach to insurance broadly accessible.\n\nFor anyone navigating the complexities of climate risk insurance, Plover Parametrics represents a forward-thinking solution anchored in data-driven insights—ready to take on the challenges of our rapidly changing environment. \n\nFor more information, visit their [website](https://plover.insure).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/61606b79c9c6487926b1be45335059b537ce51dd.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191645Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=fc10e1985a8b813a59e181ff6b052716d220f7cebc883b0283716a7990c69dd5",
    "social_links": [],
    "logo_path": "data/logos\\Plover_Parametrics_logo.png"
}