{
    "links": "https://www.ycombinator.com/companies/plura",
    "name": "Plura (formerly Bloom Community)",
    "headline": "The social app for edge-of-culture communities",
    "batch": "W20",
    "description": "Plura (formerly Bloom Community) is a YCombinator backed startup based in Oakland, CA on a mission to use software to bring people together. Plura is a social and dating community that helps you meet new friends and partners organically through shared events and experiences. We partner with local event producers to help you connect and chat with other attendees before and after events. And, with a strong consent culture and referral-based community, we're the safest place to meet new partners and friends. \r\n\nThe team is led by Luna Ray. Luna spent 5 years at Facebook, most recently leading viral user growth for Instagram from 700M to past a billion users in two years.",
    "activity_status": "Active",
    "website": "https://www.heyplura.com",
    "founded_date": 2020.0,
    "team_size": 5.0,
    "location": "Oakland, CA",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:community; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Lauren (Luna) Ray Vegter, Founder",
            "description": "Lauren (Luna) Ray Vegter is the founder and chair of Plura. Plura helps people meet at in-person events and build community. Since replacing herself as CEO, Luna coaches startup founders using best practices from YC, Instagram, and Faire. \n\nPreviously, Luna led User Acquisition for Instagram from 700M to 1.1B people and launched VR for Oculus. She has two MIT degrees in business and engineering. Luna has trained in multiple coaching modalities including Hakomi Somatics and IFS.",
            "linkedin": "https://linkedin.com/in/laurenvegter"
        }
    ],
    "status": true,
    "generated_description": "**Plura: Connecting Edge-of-Culture Communities**\n\n### What is Plura?\n\nPlura, formerly known as Bloom Community, is a fresh social and dating app dedicated to edge-of-culture communities. This Y Combinator-backed startup from Oakland, CA, launched in 2020 with a vision to foster genuine human connections through shared experiences and events.\n\n### Mission\n\nPlura's mission is simple but profound: to create a social platform where people can meet new friends and partners naturally. The app encourages organic interactions during various events, effectively bypassing the frustrations of swiping and ghosting associated with traditional dating platforms. \n\n### How it Works\n\nPlura collaborates with local event organizers to provide a space where users can engage before and after events, fostering a sense of community and safety. The focus here is on consent and respectful connections—fundamental values that are woven into the app's design.\n\n- **Events**: Users can find and join a wide range of events—from queer gatherings and workshops to wellness activities—each designed to encourage real-life connections.\n- **SuperBloomer**: For those looking to enhance their experience, there’s a premium membership option that unlocks additional features.\n\n### Leadership\n\nAt the helm of Plura is Luna Ray, who has a noteworthy background, having led Instagram's rapid user growth at Facebook from 700 million to over a billion users within two years. This experience is instrumental in scaling Plura's community engagement.\n\n### The Community\n\nPlura is committed to creating a safe and inclusive space for everyone, welcoming individuals 18 and older from diverse backgrounds, including the queer, polyamorous, and kink communities. Their focus on consent and accountability adds a layer of trust and respect, making it a top choice for individuals seeking meaningful connections.\n\n### Key Features\n\n- **Event Discovery**: From queer munches and polyamory meetups to workshops on consent, users can explore a variety of events that align with their interests.\n- **Connecting & Matching**: Instead of getting lost in the algorithm, users can meet like-minded individuals and deepen connections at events.\n- **Community Values**: Plura actively promotes values like consent, accountability, and inclusion, ensuring all users feel safe and respected.\n\n### Getting Involved\n\nJoining Plura is straightforward. Users can download the app from the [App Store](https://www.heyplura.com/<https:/apps.apple.com/us/app/id1528252601>) or [Google Play](https://www.heyplura.com/<https:/play.google.com/store/apps/details?id=community.together.bloom>), where they can browse events, chat with others, and create their own gatherings.\n\n### Conclusion\n\nIn the landscape of social applications, Plura stands out by emphasizing authentic human interaction over superficial engagements. By blending technology with community-building principles, it is redefining social connection for contemporary audiences. So if you're eager to meet your people through shared experiences, Plura might just be the right place for you.\n\nTo learn more, check out their website: [Plura](https://www.heyplura.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/0270b47eb6d55741f954bfe508469022c9fc17e0.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191646Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=73a1da6a692b5e1b6be2b8073c91da4f04f3a4867581aed90dc2db68fb1ec19d",
    "social_links": [],
    "logo_path": "data/logos\\Plura_(formerly_Bloom_Community)_logo.png"
}