{
    "links": "https://www.ycombinator.com/companies/pluto-markets",
    "name": "Pluto.markets",
    "headline": "Modern Investment Product for 100m underserved Europeans",
    "batch": "W22",
    "description": "Technology is a massive enabler for stock market participation. This was the case when the phone, the internet and apps were invented granting access for more people.\r\n\nFor 100m Europeans living in countries without the Euro however, there has been no innovation for the past 30 years. High commissions, clunky interface, high minimum amounts and a brand that speaks to the few.\r\n\nWe are on a mission to drive financial inclusion by bridging the innovation gap for the overlooked regions of the EU.",
    "activity_status": "Active",
    "website": "http://pluto.markets/",
    "founded_date": 2021.0,
    "team_size": 4.0,
    "location": "Copenhagen, Denmark",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:crypto-web3",
    "founders": [
        {
            "name": "Joakim Bruchmann, Founder",
            "description": "Building the investing app of the future by enabling a multiplayer investing experience for the new generation of investors. 🌱\n\nExperience: \n- MSc in Economics from University of Copenhagen and Columbia University\n- 3 years as a derivates trader at Goldman Sachs\n- 2 years as an equities trader at Danske Bank\n- 2.5 years as CEO of nBoard - a data driven board recruiting platform. Don't touch board recruiting, it's toxic! ☠️",
            "linkedin": "https://www.linkedin.com/in/joakim-bruchmann-87b6b653/"
        },
        {
            "name": "Oscar Vingtoft, Founder",
            "description": "Software engineer & previously CTO at nBoard (largest board recruiting platform in Denmark) after spending years building data collection software for big pharma.\n\nEntrepreneur and technologist by heart, eager to develop and learn new things.\n\nI wanted to trade stocks and cryptos alongside my friends, but a platform did not exist, so now I'm building it myself 😂🚀",
            "linkedin": "https://www.linkedin.com/in/oscar-vingtoft-17680160/"
        }
    ],
    "status": true,
    "generated_description": "**Pluto.markets: Democratizing Investment in Europe**\n\nFounded in 2021 and based in Copenhagen, Pluto.markets emerged as part of Y Combinator's W22 batch, aiming to address a significant gap in Europe's investment landscape. With a mission to empower 100 million underserved Europeans, especially those in non-Euro countries, Pluto.markets addresses the barriers that have kept many from participating in the stock market. \n\nHistorically, investing has been riddled with high commissions, complex interfaces, and minimum investment hurdles—essentially locking out a massive segment of potential investors. Technology has always played a crucial role in democratizing access to financial markets—think about how the advent of the telephone, the internet, and mobile apps have opened doors. Yet, for the last 30 years, Europe has seen little innovation to address the unique needs of its diverse regions. Pluto.markets is here to change that.\n\nTheir platform allows users to create an investment account in just three minutes, offering access to over 3,000 U.S. stocks like Tesla, Nvidia, and Apple, all without commissions. This regulatory framework ensures that investments are safe and backed by the Danish deposit guarantee scheme, protecting users' funds up to €100,000.\n\nThe team is small but mighty, consisting of just four dedicated employees under the guidance of their Group Partner, Nan. As they focus on providing a frictionless trading experience with features like fractional shares and auto-invest options, they prioritize transparency—no hidden fees, just an open, clear way to engage with the market. \n\nPluto.markets is more than an app; it's a movement toward financial inclusion. By making investing accessible and affordable, they are empowering the \"overlooked regions\" of Europe to seize the investment opportunities once reserved for a select few. With a commitment to innovative solutions, Pluto.markets is on a path to redefine the investment landscape for millions.\n\nFor more information, check them out at [pluto.markets](http://pluto.markets/).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/e5abe83fa16e79da7b3b582db9f843a06145e97d.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191646Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=dea9cd298cc4240264c80793f163cf74992878a5ca8770bfef81fd3ddc6b0644",
    "social_links": [
        "https://www.linkedin.com/company/pluto-markets/"
    ],
    "logo_path": "data/logos\\Pluto.markets_logo.png"
}