{
    "links": "https://www.ycombinator.com/companies/pocket-worlds",
    "name": "Pocket Worlds",
    "headline": "Our platform enables creators to build experiences, games, and worldsâ\u0080¦",
    "batch": "S18",
    "description": "We're the creators of Highrise, now featured in the iOS App Store with 50 million users and rapidly growing. We're building bleeding-edge technology for developers and amateurs to create immersive experiences and worlds inside our virtual universe.\r\n\nWe believe that the future of virtual worlds is bright, and we're excited to be at the forefront of this industry. As we continue to grow and expand our platform, we're looking for talented individuals to join us on this journey of innovation and creativity. If you're passionate about building the platform to power virtual experiences that bring people together and push the boundaries of what's possible, we want you on our team!",
    "activity_status": "Active",
    "website": "https://pocketworlds.com",
    "founded_date": 2013.0,
    "team_size": 100.0,
    "location": "Austin, TX",
    "group_partner": "Michael Seibel",
    "group_partner_yc": "https://www.ycombinator.com/people/michael-seibel",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:gaming; industry:social; location:austin",
    "founders": [
        {
            "name": "Anton Bernstein, Founder/CEO",
            "description": "I'm founder and CEO of Pocket Worlds, the social-first gaming company. Before Pocket Worlds, I founded LuxuryEscapes.com where I ran product and marketing. Before that, I was an analyst at Insight Venture Partners and associate at Redpoint.\n\nI love new ideas and products that entertain and delight.\n\nYC Badge: 0x9dd12e8a18fe70a889c7d27ac49623c2942c5b00",
            "linkedin": "https://linkedin.com/in/antonber"
        },
        {
            "name": "Jimmy Xu, Founder/CTO",
            "description": "I'm the CTO and cofounder of Pocket Worlds, and I've spent the last 9 years working to make the virtual world mainstream and the metaverse a reality.",
            "linkedin": "https://www.linkedin.com/in/jimmyfxu/"
        }
    ],
    "status": true,
    "generated_description": "**Pocket Worlds: Crafting Virtual Realities Since 2013**\n\nFounded in 2013 and an alum of Y Combinator's S18 batch, Pocket Worlds has become a notable player in the virtual gaming landscape. Based in Austin, Texas, the company has a dedicated team of about 100 employees who are passionate about creating immersive experiences and worlds. Their flagship product, **Highrise**, boasts a user base of **50 million** and continues to gain traction, offering expansive creativity for both developers and casual creators alike.\n\n### Mission\n\nPocket Worlds' mission is simple yet impactful: to enable creators to build games, experiences, and entire worlds within their virtual universe. They see a future brimming with potential for virtual worlds, and they aim to be at the forefront of this evolution. They’re not just building technology; they’re building a community of innovators who are pushing the boundaries of what virtual experiences can be.\n\n### Key Offerings\n\n1. **Highrise**: This is more than just a game; it’s a creative platform where users can explore and interact within worlds built by fellow creators. Think of it as a universe where creativity has no limits.\n   \n2. **Highrise Studio**: A tool for aspiring creators, it allows users to unlock their imagination and share their creations with millions at the click of a button.\n\n3. **Create Portal**: Pocket Worlds invites builders and designers with open arms, providing all the necessary resources for anyone to start creating in Highrise, completely free.\n\n### Growth and Culture\n\nAs they grow, Pocket Worlds is on the lookout for passionate individuals who share their vision of connecting people through shared experiences. This isn't just a job; it’s a calling for those eager to shape the future of gaming and social interaction.\n\n### Leadership and Community\n\nWith influential figures like Michael Seibel as a group partner, Pocket Worlds is well-positioned to continue its growth trajectory. They maintain a close-knit, innovative culture that encourages collaboration and creativity.\n\n### The Future\n\nAs Pocket Worlds continues to expand its platform and user base, they remain committed to their core values of innovation and inclusiveness. For anyone interested in shaping virtual worlds and creating engaging experiences, Pocket Worlds could be the perfect stage.\n\nFor more information, check out their [website](https://pocketworlds.com/) or dive into the creative universe of **Highrise** [here](https:/highrise.game/).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/7d43d9a47c278a9934eb61baa246c455529d20e4.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191646Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=c891e2a8d6aae5d82b78e5c58d5ddf31952257df68ae0335ad7f57594978c1f9",
    "social_links": [
        "https://www.linkedin.com/company/pocketworlds",
        "https://www.twitter.com/highriseapp",
        "https://www.crunchbase.com/organization/me-a8f1"
    ],
    "logo_path": "data/logos\\Pocket_Worlds_logo.png"
}