{
    "links": "https://www.ycombinator.com/companies/podcast-app",
    "name": "Podcast App",
    "headline": "Podcast App is for the curious.",
    "batch": "W18",
    "description": "We’re a team of podcast fanatics with more than 20 years of combined experience in the audio space. We are building the fastest-growing podcast player and are now backed by YCombinator (W18).\r\n\nAt Podcast App, we are building an audio platform to help millions of people in their pursuit of happiness. Under one roof, we bring the best and most powerful podcasts, audiobooks, and meditations from leading minds and experts around the world.\r\n\nOur love for podcasts began when we discovered their power to make our ordinary day-to-day tasks more enjoyable and meaningful. Podcasts helped transform tedious activities like commutes or household chores into more positive experiences, helping us learn new skills, stay informed, or pass the time with captivating stories. We want to help people in their pursuit of happiness.\r\n\nWe’ve been podcast aficionados for years, and, even for us, finding the right one to listen to is difficult and frustrating. With tens of millions to choose from and more being released every day, the problem’s only getting worse.\r\n\nIt’s time to fix this problem. Americans spend 30 billion hours every year commuting and doing household chores. We want to make those hours worthwhile. By building technology that makes it easy to access great podcasts, we’ll help millions of people reclaim lost time and experience more fun, inspiration, and personal growth every day.\r\n\nOur product, Podcast App, is a minimalist podcast player enhanced with cutting-edge technology. We leverage machine learning to build customized podcast playlists for our users based on their interests and tastes.\r\n\nIf you want to get in touch, email us at hello@podcast.app.",
    "activity_status": "Active",
    "website": "https://podcast.app/",
    "founded_date": 2017.0,
    "team_size": 18.0,
    "location": "San Francisco",
    "group_partner": "Michael Seibel",
    "group_partner_yc": "https://www.ycombinator.com/people/michael-seibel",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:podcasts; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Juan Catalano, Founder/CTO",
            "description": "Co-founder and CPO at Podcast App. Previously first employee and CTO at Streema. Software engineer by background.",
            "linkedin": "https://www.linkedin.com/in/juancatalano/"
        },
        {
            "name": "Martin Siniawski, Founder/CEO",
            "description": null,
            "linkedin": "https://www.linkedin.com/in/msinia"
        }
    ],
    "status": true,
    "generated_description": "### Podcast App: Transforming How We Engage with Audio Content\n\n**Company Overview:**\nFounded in 2017 and based in San Francisco, Podcast App is a product born from the passion of a team that collectively brings over 20 years of experience in audio content. This venture is not just another app; it’s a community for the curious, aiming to enrich daily life through audio. Recognized as part of Y Combinator's W18 batch, Podcast App stands out as the #1 most downloaded podcast application.\n\n**Mission:**\nAt the heart of Podcast App's mission is the desire to enhance the human experience. The founders believe that audio has the power to make mundane moments—like commutes or chores—more enjoyable and meaningful. By providing access to a diverse array of content, specifically curated to cater to personal interests, they aim to support users in their pursuit of happiness.\n\n**Why Podcast App?**\nCurated audio has become essential in our fast-paced lives. With millions of podcasts to choose from, identifying the right fit can be overwhelming. Podcast App tackles this problem by leveraging cutting-edge machine learning technologies to create personalized playlists that align with each user’s tastes. This means listeners can easily navigate an expansive library of podcasts, audiobooks, and meditations without feeling lost.\n\n**Target Audience:**\nThe app is designed for the 30 billion hours Americans spend each year on activities like commuting and household chores. Podcast App turns these often tedious tasks into opportunities for learning, creativity, and growth. Whether someone is looking to stay informed, explore comedy, or find inspiration through storytelling, Podcast App serves as a one-stop hub for diverse interests—ranging from news and true crime to health, technology, and everything in between.\n\n**Features:**\n- **User-Centric Design:** With its minimalist podcast player, the app ensures that discovering new content or enjoying favorites is just a few taps away.\n- **Personalization:** Advanced algorithms tailor podcast recommendations, ensuring that each user feels catered to.\n- **Diverse Libraries:** Users can find podcasts across various categories, including arts, self-improvement, fiction, sports, and more. The app encourages users to explore niche topics and learn new skills.\n- **Language Learning and Health:** Besides just entertainment, the platform offers resources for learning new languages and staying healthy through guided meditations and motivational talks.\n\n**Team and Leadership:**\nCurrently comprising 18 members, Podcast App operates under the guidance of industry leaders, including Michael Seibel, a prominent Group Partner from Y Combinator.\n\n**Connect with Podcast App:**\nTo learn more or provide feedback, you can reach out via email at hello@podcast.app. For downloads, Podcast App is available on both the App Store and Google Play.\n\n**Website:** [Visit Podcast App](https://podcast.app)\n\nPodcast App isn't just building another podcast player; they're cultivating a world where curiosity is rewarded, and the mundane transforms into extraordinary through the power of audio. If you're someone seeking to reclaim lost moments while indulging in captivating content, this app is crafted for you.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/69a2c66bb5ac24bfb177245347c5eaa630a6099c.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191646Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=79ad7b16e17410bddba6084c37a192824c475be58137d4d36cee4dfc0b4fcce6",
    "social_links": [
        "https://twitter.com/thepodcastapp",
        "https://www.crunchbase.com/organization/the-podcast-app"
    ],
    "logo_path": "data/logos\\Podcast_App_logo.png"
}