{
    "links": "https://www.ycombinator.com/companies/podium",
    "name": "Podium",
    "headline": "Get more leads. Make more money.",
    "batch": "W16",
    "description": "Podium is the all-in-one AI-powered lead management and communication platform used by more than 100,000 businesses to acquire and convert new customers. At the forefront of Podium’s innovation is its AI employee, who ensures businesses respond to leads instantly, anytime of the day or night—significantly increasing lead conversion rates and revenue.\r\nPodium helps businesses obtain more reviews, rank higher on Google, and consolidate lead channels. Businesses can call and text customers from the web and/or mobile app, send payment links, drive repeat business through bulk messages, and more—all managed and delivered from one easy-to-use dashboard. Additionally, with Podium’s AI Employee and automations, businesses can efficiently handle customer inquiries seamlessly across all communication channels, providing timely and accurate responses that drive sales.\r\nPodium’s innovative work has gained recognition on top industry lists, such as Forbes’ Next Billion Dollar Startups, Forbes’ Cloud 100, the Inc. 5000, and Fast Company’s World’s Most Innovative Companies.\r\nPodium was founded in 2014 and is headquartered in Lehi, Utah. It is currently backed by Accel, Summit Partners, GV (formerly Google Ventures), and Y Combinator.",
    "activity_status": "Active",
    "website": "https://podium.com",
    "founded_date": 2014.0,
    "team_size": 1000.0,
    "location": "Lehi, UT",
    "group_partner": "Dalton Caldwell",
    "group_partner_yc": "https://www.ycombinator.com/people/dalton-caldwell",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:saas; industry:b2b; industry:ai",
    "founders": [
        {
            "name": "Dennis Steele, Founder",
            "description": "Co-founder and CSO of Podium—a company we’ve taken from the attic of a bike shop in 2014 to #13 on Inc. 500’s list of fastest-growing companies. Podium is leading the charge to modernize the way business happens locally—powering everything from communication to payments.\n\n1,100 employees\n$400M+ Raised (Accel, IVP, YC Continuity, GV)\n100,000 Businesses on Podium",
            "linkedin": "https://www.linkedin.com/in/steeledennis"
        },
        {
            "name": "Eric Rea, Founder/CEO",
            "description": null,
            "linkedin": "https://www.linkedin.com/in/ericrea"
        }
    ],
    "status": true,
    "generated_description": "Podium is a powerful player in the realm of AI-driven business solutions, aiming to help companies \"get more leads and make more money.\" Founded in 2014 and based in Lehi, Utah, Podium has rapidly grown to support more than 100,000 businesses with its all-in-one lead management and communication platform.\n\nAt its core, Podium leverages AI to enhance lead conversion rates dramatically. The star of the show is Podium's AI Employee, which operates round-the-clock, ensuring instant responses to potential customers—thus increasing engagement and sales. Using a user-friendly dashboard, businesses can handle communications via text, calls, web chats, and even collect payments—all from one place. \n\nPodium also excels at consolidating lead channels, enabling clients to boost their online reputation through increased reviews, which in turn helps them rank higher on search engines like Google. Its suite of tools include SMS messaging, automation, and detailed customer insights, ensuring no lead goes unanswered.\n\nSince its inception, Podium has received accolades and recognition, featuring in lists such as Forbes’ Next Billion Dollar Startups and Fast Company’s World’s Most Innovative Companies, proudly backed by heavyweights like Accel, Summit Partners, GV (formerly Google Ventures), and Y Combinator.\n\nWith a team of about 1,000 employees, Podium is not just about technology; it brings superior customer service bundled with its innovative tools. Whether you're in retail, healthcare, or any service industry, Podium tailors its offerings to meet specific business needs, driving repeat business through strategic follow-ups and customer engagement.\n\nFor companies eager to harness the power of AI to bolster their customer acquisition efforts, Podium stands out as a formidable partner. Interested parties can explore more at [podium.com](https://podium.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/2fb4d1272aa66783aa11113c5aaa9e2f2676396e.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191646Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=d7ea6abbdf45929181d5bde4d63e895dd699c1957b683174cdb41e4facc51c39",
    "social_links": [
        "https://www.linkedin.com/company/podium/",
        "https://twitter.com/podiumhq",
        "https://www.facebook.com/Podium/",
        "https://www.crunchbase.com/organization/podium-2",
        "https://github.com/podium"
    ],
    "logo_path": "data/logos\\Podium_logo.png"
}