{
    "links": "https://www.ycombinator.com/companies/polo",
    "name": "Polo",
    "headline": "Building restaurant software that works.",
    "batch": "W23",
    "description": "Founded in 2022, Polo is the ecosystem for coffee shops and restaurants in LatAm to run on. We design, build, and sell with our customer experience and reality in mind. This commitment has driven us to truly innovate, saving our customers from outrageous third-party costs and week-long lead times.\r\n\nWe offer point of sale, inventory management, and more to our growing community of entrepreneur and experienced restaurateurs. Our tech is as user-friendly as an iPhone, yet powerful enough to power Starbucks. \r\n\nPoloTab is led by a team driven by the vision that things should be different, with the skills to make it happen. We were born from the food & beverage industry and are here to make a difference, not merely be part of the crowd.",
    "activity_status": "Active",
    "website": "https://polotab.com",
    "founded_date": 2022.0,
    "team_size": 5.0,
    "location": "Mexico City, Mexico",
    "group_partner": "Dalton Caldwell",
    "group_partner_yc": "https://www.ycombinator.com/people/dalton-caldwell",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:saas; industry:payments; industry:b2b; industry:analytics; industry:food-tech",
    "founders": [
        {
            "name": "Andres Richardson, Founder",
            "description": "Co-Founder and COO at PoloPay (W23). Studied industrial engineering at the University of Michigan. Ex-Business Consultant. Enjoys playing and watching sports, traveling, and food.",
            "linkedin": "http://www.linkedin.com/in/andres-richardson-41411a167"
        },
        {
            "name": "Juan Chomali, Founder",
            "description": "Co-Founder and CTO at Polo (W23). Chilean. Started coding at 12. Mechanical engineer and economist. Ex-Goldman. PNAS published author. Loves mountaineering and cooking.",
            "linkedin": "https://www.linkedin.com/in/jchomali"
        },
        {
            "name": "Aldo Piaggio, Founder",
            "description": "Co-Founder and CEO at Polo (W23). I am a designer, an ex-Goldman Sachs IBD Analyst, and an industrial engineer from the University of Michigan. I love cigars, coffee, and LPs.",
            "linkedin": "https://www.linkedin.com/in/aldo-piaggio-59227418b"
        }
    ],
    "status": true,
    "generated_description": "**Polo: Revolutionizing Restaurant Software in LatAm**\n\nFounded in 2022 and nestled in Mexico City, Polo is on a mission to create restaurant software that genuinely works—for coffee shops and restaurants throughout Latin America. We’ve built an ecosystem tailored for entrepreneurs and seasoned restaurateurs. At the heart of Polo is our commitment to user experience, which drives our innovative approach, allowing us to help businesses dodge the absurd costs and lengthy lead times often associated with third-party services.\n\nOur software, PoloTab, is loaded with features including point of sale systems, inventory management, and more—designed to be as intuitive as an iPhone while being robust enough to handle the demands of big names like Starbucks. \n\nWe're not just another tech company; we are a team birthed from the food and beverage industry with a strong desire to make a dent in how restaurants operate—aiming not to conform, but to stand out.\n\n### What We Offer\nOur platform includes a comprehensive suite of tools, such as:\n- Mobile Ordering\n- QR Menus\n- Reservation Systems\n- Kitchen Display Screens\n- Payment Terminals\n- Inventory Management\n- Reporting and Analytics\n\nIn addition, Polo ensures that operations can continue seamlessly, even without internet access. Our technology is designed to function in a wide variety of scenarios, supporting entrepreneurs in managing their establishments confidently.\n\n### Backing and Growth\nPolo is a proud member of the Y Combinator Batch W23 and has garnered the backing of notable venture capital firms. With a lean team of five, we’re rapidly expanding our footprint, currently supporting over 200 restaurants and cafes across 24+ cities in Mexico.\n\n### Join Us\nIf you’re a café owner or restaurateur looking for a game-changing solution, Polo is here to transform your operations. You can experience the benefits first-hand; we invite you to explore our offerings on our website, [PoloTab](https://polotab.com).\n\n### Summary\nPolo is not just software; it’s a partner in growth for the hospitality industry in Latin America, crafted by industry insiders for the challenges of today. If you’re tired of traditional systems that don’t fit your needs, consider Polo—your ticket to efficiency and innovation in restaurant operations. Let's simplify and enhance how your business operates.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/ba7fff54cd8cca0c8500031a894e7823ac06889b.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191648Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=f1122a3a578f489ef454102fc063a71d792f082d49dd096b068908856f2b3d9d",
    "social_links": [
        "https://www.linkedin.com/company/81905131/admin/",
        "https://www.crunchbase.com/organization/polopay"
    ],
    "logo_path": "data/logos\\Polo_logo.png"
}