{
    "links": "https://www.ycombinator.com/companies/ponyrun",
    "name": "Ponyrun",
    "headline": "Automate prospect research at scale",
    "batch": "W22",
    "description": "Ponyrun evaluates people for you. We help you answer questions like: Should you sell to them? Are they a good fit for your product? Should you interview them? \r\n\nIts easy to use. Give it a search URL or a list of people. Tell Ponyrun what you want to evaluate the person on. And Ponyrun will go through the person's information (e.g. LinkedIn), and evaluate them.",
    "activity_status": "Active",
    "website": "http://www.ponyrun.ai",
    "founded_date": 2021.0,
    "team_size": 3.0,
    "location": "San Francisco",
    "group_partner": "Aaron Epstein",
    "group_partner_yc": "https://www.ycombinator.com/people/aaron-epstein",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:analytics; industry:sales; industry:operations; industry:ai; industry:ai-assistant; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "LIUSHA HUANG, Founder",
            "description": null,
            "linkedin": "https://www.linkedin.com/in/liushh/"
        },
        {
            "name": "Neil Chen, Founder",
            "description": "Born and raised in the Northern China. Now building and growing Nimbus remotely in U.S..\n\nPrior to Nimbus, Neil supported a full-stack engineering team in TikTok, building and growing TikTok Creator Marketplace, the market-leading creator monetization platform. Before that, Neil had been a Software Engineer and Tech Lead in various teams in Facebook/Meta for 6 years.",
            "linkedin": "https://www.linkedin.com/in/xiaotaochen"
        },
        {
            "name": "Nish Ithayakumar, Founder",
            "description": "Born in Sri Lanka. Grew up in Vancouver. Now building Nimbus in San Francisco. \n\nPrior to Nimbus, Nish led growth strategy at Unity, led BizOps teams, and consulted in Strategy/Operations in Canada and USA. Now Nish is focused on bringing the way big tech builds software to everyone else.",
            "linkedin": "https://www.linkedin.com/in/nithayakumar/"
        }
    ],
    "status": true,
    "generated_description": "Ponyrun is an innovative startup that emerged from Y Combinator’s W22 batch in 2021. Based in San Francisco, Ponyrun operates with a small team of three employees and is on a mission to automate prospect research at scale. It offers a smart solution for sales organizations, enabling them to assess potential leads with ease, whether they’re potential clients or candidates for interviews. \n\nThe platform provides a seamless way to evaluate individuals by simply inputting a search URL or a list of names. By specifying what to look for, Ponyrun leverages artificial intelligence to sift through a candidate's online presence—primarily their LinkedIn profiles—and gather relevant insights to determine their fit for specific sales needs. \n\nPonyrun recognizes that time spent on tedious prospecting can drain productivity, so it aims to drastically cut down the hours sales teams typically spend on research. Users report saving significant time—up to three hours a day—that they can redirect toward closing deals rather than getting bogged down in data gathering. \n\nThe company’s tools help users identify relevant prospects and eliminate those who aren’t a good fit, eliminating the waste associated with poor sales leads. It simplifies the outbound sales process, eliminating mass outreach campaigns that often yield dismal results. Instead, Ponyrun focuses on precision prospecting, allowing sales reps to spend time selling rather than searching. \n\nEarly feedback indicates that users find Ponyrun incredibly valuable, with testimonials highlighting a massive boost in meeting booking rates and overall prospecting efficiency. \n\nIf you're interested in discovering how Ponyrun can revolutionize your prospecting efforts, they currently offer an option to request early access to their platform at http://www.ponyrun.ai. As the sales landscape becomes increasingly challenging, tools that automate and enhance the prospecting process like Ponyrun will be crucial for gaining a competitive edge.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/d49679162721b753782b7d4da474cdfc5755d6bb.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191649Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=6bbe4a201a5ff4780322d2942968d1b76f08f44c060b386c421b8aa0a6d633df",
    "social_links": [
        "https://www.linkedin.com/company/ponyrun-ai/"
    ],
    "logo_path": "data/logos\\Ponyrun_logo.png"
}