{
    "links": "https://www.ycombinator.com/companies/pop-meals",
    "name": "Pop Meals",
    "headline": "Pop Meals is a restaurant chain without chefs. All recipes areâ\u0080¦",
    "batch": "S17",
    "description": "Pop is building Asiaâ\u0080\u0099s leading food brands through a network of cloud kitchens and tech-enabled QSR outlets. Funded with over $28m by Y Combinator and leading tech investors from Silicon Valley, Europe and Asia, we are expanding rapidly across Asia.",
    "activity_status": "Active",
    "website": "https://popmeals.com",
    "founded_date": null,
    "team_size": 153.0,
    "location": "Kuala Lumpur, Malaysia",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:food-service-robots-&-machines; industry:ghost-kitchens; industry:delivery",
    "founders": [],
    "status": true,
    "generated_description": "### Pop Meals: A Chef-less Dining Revolution\n\n**Overview**\nPop Meals is a forward-thinking restaurant chain based in Kuala Lumpur, Malaysia, dedicated to reshaping the food service industry. They operate a network of cloud kitchens and tech-enabled quick-service restaurant (QSR) outlets, allowing for a fast and efficient dining experience—without the traditional chef workforce. This model not only minimizes overhead costs but also maximizes scalability, making it a significant player in Asia's food service landscape.\n\n**Foundation and Expansion**\nFounded under the umbrella of Y Combinator in the S17 batch, Pop Meals has quickly garnered attention and funding, raising over $28 million from a mix of Silicon Valley, European, and Asian investors. This financial backing is fueling their rapid expansion across the Asian market.\n\n**Mission**\nTheir mission is clear: to build Asia's leading food brands through technology and innovative food solutions. They focus on ensuring delicious meals come at accessible prices, capitalizing on the growth of the food delivery market that has surged in recent years.\n\n**Operations**\nThe company employs a robust team of 153 individuals, all dedicated to servicing a growing customer base. Through their sustainable and tech-savvy approach, Pop Meals has served over 5.5 million meals and garnered a happy customer base of more than 884,000. Their operational model, which includes ghost kitchens, is positioned precisely to meet the increasing demand for food delivery services in Southeast Asia.\n\n**Key Offerings**\nPop Meals stands out with its diverse menu, which includes exciting dishes like Salted Egg Buttermilk Chicken, alongside other Malaysian favorites. Customers can order through their easy-to-use app for delivery, pickup, or dine-in experiences, alongside a chance to earn rewards. This combination of convenience and quality drives their appeal to a tech-savvy audience.\n\n**Community Engagement**\nPop Meals isn't just about food; it actively engages with its community through social media and local partnerships. Their campaigns often encourage user-generated content and prompt happy diners to share their experiences, thereby building a sense of community around the brand.\n\n### In Conclusion\nPop Meals is at the intersection of food and technology, offering a unique and scalable business model that resonates well with modern consumers. If you’re in Asia and looking for a new dining experience that prioritizes quality, convenience, and affordability, Pop Meals might just be your next go-to.  You can check them out at [Pop Meals](https://popmeals.com) for more information or to place an order!",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/74a9477dcefda17fdf62767bc0b15085c1ed1bdf.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191649Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=b9c605a7303c010ec9eec602522ed5f1268d7fc03fb199a8d136819a1c9a02d5",
    "social_links": [
        "https://www.crunchbase.com/organization/dah-makan",
        "https://github.com/popmeals"
    ],
    "logo_path": "data/logos\\Pop_Meals_logo.png"
}