{
    "links": "https://www.ycombinator.com/companies/porter",
    "name": "Porter",
    "headline": "Easiest way to deploy on AWS/GCP/Azure",
    "batch": "S20",
    "description": "Porter is the easiest way to deploy and scale your applications on AWS, Azure, and GCP. Connect your own cloud account, and Porter will provision and manage the underlying infrastructure for you - simply point at your repository and Porter will handle the rest, from building your application to autoscaling it.\r\n\nUnder the hood, Porter manages the same kind of infrastructure that growth-stage companies use and allows you to scale without DevOps overhead.",
    "activity_status": "Active",
    "website": "https://porter.run",
    "founded_date": 2020.0,
    "team_size": 10.0,
    "location": "New York",
    "group_partner": "Dalton Caldwell",
    "group_partner_yc": "https://www.ycombinator.com/people/dalton-caldwell",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:developer-tools; industry:saas; industry:b2b; industry:cloud-computing; location:new-york",
    "founders": [],
    "status": true,
    "generated_description": "**Company Overview: Porter**\n\nFounded in 2020 and based in New York, Porter is a robust platform aiming to simplify application deployment and scaling across major cloud providers—AWS, GCP, and Azure. If you've ever felt bogged down by the complexities of infrastructure management, Porter is here to take that burden off your shoulders. \n\n**Mission Statement:**\nPorter’s mission is straightforward: to provide the easiest way to deploy applications on modern cloud infrastructure. By allowing users to connect their own cloud accounts, Porter manages the underlying layers, so you can concentrate on building your application rather than wrestling with DevOps challenges.\n\n**The Product:**\nPorter offers a seamless experience where you simply point to your application's repository, and the platform takes over, from building to deploying and even autoscaling. They provide a fully-managed Kubernetes setup, along with crucial components like VPCs and load balancers that typically come with a steep learning curve.\n\n*Key Features:*\n- **Automatic Builds:** Utilizing Cloud Native Buildpacks, Porter can effortlessly detect application frameworks and build them into container images. Have a Dockerfile? Even better—just select it, and Porter does the rest.\n- **One-Click Deployments:** Connect your GitHub repository and deploy web services, workers, and cron jobs with minimal fuss.\n- **Preview Environments:** When a pull request is opened, Porter spins up a dedicated workspace for easier collaboration and feedback.\n- **Monitoring and Scaling:** The platform includes built-in monitoring tools for application metrics and error alerts, so you stay on top of your app's health.\n\n**Current Endeavors:**\nRecently, Porter introduced \"Porter Cloud,\" which allows startups to build their MVPs swiftly on the Porter infrastructure, then easily transition to their own cloud accounts (AWS, Azure, or GCP) as they grow.\n\n**Support and Community:**\nBacked by Y Combinator as part of the S20 batch, Porter has attracted attention and trust from numerous growth-stage startups. With a small but dedicated team of 10, they are committed to enhancing the developer experience and making cloud deployment dead simple.\n\n**Closing Thoughts:**\nFor developers and businesses looking for a hassle-free cloud deployment process, Porter represents an innovative solution that promises to streamline operations while allowing greater creative focus on application development. If managing cloud infrastructure sounds like a nightmare you want to avoid, check out Porter; it might just be your new favorite tool in the cloud toolkit.\n\nYou can learn more about Porter on their website: [porter.run](https://porter.run).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/ed707883cfe711aee4e3d9905fa674b8d6f7a0b6.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191649Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=ac7a6266bbb98b5ef8270658c1e0ba02cdfabc2ff6d57e9272a7e430d02ef205",
    "social_links": [
        "https://www.linkedin.com/company/getporter",
        "https://twitter.com/porterdotrun",
        "https://github.com/porter-dev"
    ],
    "logo_path": "data/logos\\Porter_logo.png"
}