{
    "links": "https://www.ycombinator.com/companies/prelim",
    "name": "Prelim",
    "headline": "Software for banks to open bank accounts",
    "batch": "S17",
    "description": "At Prelim, we are on a mission to revolutionize the way financial institutions onboard new customers. We believe that the customer onboarding process should be fast, efficient, and user-friendly. As a member of our team, you will have the opportunity to work with cutting-edge technology and make a real impact on the financial industry.\r\n\nOur no-code platform allows banks and financial institutions to digitize their services, streamline account opening processes, and improve customer experience. By joining our team, you will be a part of a fast-paced, innovative, and dynamic work environment where you can learn and grow your skills.\r\n\nOur team is made up of a diverse group of individuals with a wide range of experience and expertise. We value collaboration, creativity, and a passion for problem-solving. As a member of our team, you will have the opportunity to work with experts in the field, and be challenged to think outside the box.\r\n\nIn addition, we offer a comprehensive benefits package, flexible working hours, and a great work-life balance. We are constantly evolving and growing, and we are looking for talented individuals who share our vision and are excited to be a part of our journey. If you're passionate about fintech and want to be a part of a team that is making a real impact in the industry, then Prelim is the place for you.",
    "activity_status": "Active",
    "website": "https://prelim.com/",
    "founded_date": 2017.0,
    "team_size": 34.0,
    "location": "San Francisco",
    "group_partner": "Michael Seibel",
    "group_partner_yc": "https://www.ycombinator.com/people/michael-seibel",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:banking-as-a-service; industry:fintech; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Chris Blaser, Founder",
            "description": "Chris is CTO and Co-Founder of Prelim. Before Prelim, Chris built electric race cars at CalSol, and read too much science fiction.",
            "linkedin": "https://www.linkedin.com/in/chris-nguyen-blaser-553665107/"
        },
        {
            "name": "Heang Chan, Founder/CEO",
            "description": "Heang is CEO and Co-Founder of Prelim. Before Prelim, Heang was a Product Expert at Blend and previously was a Goldman Sachs banker. He graduated with a joint degree MBA/MA degree from Stanford University.",
            "linkedin": "https://www.linkedin.com/in/heangchan"
        }
    ],
    "status": true,
    "generated_description": "**Prelim: Revolutionizing Banking Onboarding**\n\nFounded in 2017 and hailing from the vibrant San Francisco tech scene as a part of Y Combinator Batch S17, Prelim is on a mission to streamline how banks and financial institutions open new accounts. Think of them as the magic wand for the tedious onboarding process, transforming it into a fast, efficient, and user-friendly experience. \n\nTheir no-code platform empowers banks to digitize services and enhance customer journeys—it's not just about making things easier; it’s about radically improving the overall experience for customers and financial institutions alike. Whether for consumer or business account openings, Prelim is making the onboarding process a breeze.\n\nThe team at Prelim, comprised of 34 skilled professionals, thrives on collaboration and innovation. They value diverse perspectives, encouraging a culture where creativity and problem-solving can flourish. Their work environment is designed for those who crave fast-paced, challenging roles where they can contribute to meaningful change in the fintech landscape.\n\nPrelim isn't just about ambitious goals; they back it up with solid technology. With their platform, banks can support over 100 financial apps, automate applications, and maintain real-time compliance with regulations such as HIPAA and GLBA. They've partnered with prominent companies like Alloy and LexisNexis, ensuring that customer information remains secure and compliant.\n\nThe benefits of joining the Prelim team are not merely aspirational. They offer flexible hours and a healthy work-life balance, making them not just a job but a place where you can grow your skills and enjoy what you do.\n\nIf you’re passionate about fintech and eager to shape the future of banking, Prelim is a stimulating environment where your input can lead to real impact. Visit their website at [Prelim.com](https://prelim.com/) to learn more about their continued evolution in the banking-as-a-service space, or book a demo to see firsthand how Prelim can modernize your bank’s onboarding process today.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/9daf9cbee53ecac0531753272c685f3795451952.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191652Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=e042fbf78aa43b59913e0f9ed838b0a692f1139070b7eec7fb4b424ba318dc39",
    "social_links": [
        "https://www.linkedin.com/company/18020119",
        "https://www.crunchbase.com/organization/original-tech"
    ],
    "logo_path": "data/logos\\Prelim_logo.png"
}