{
    "links": "https://www.ycombinator.com/companies/prelay",
    "name": "Prelay",
    "headline": "Team Selling Platform",
    "batch": "W20",
    "description": "Most revenue teams have difficulty getting the right team members and internal stakeholders involved in a deal at the right time which creates waste of resources, delays deals, and causes deal slippage.\r\n\nWith Prelay's team selling software, coordination and communication is all organized within one purpose-built platform integrated with your other key software instead of spread across multiple disjointed collaboration tools without any centralized tracking, oversight, or learnings. Not only are there fewer headaches for sales reps and their technical counterparts, but sales, presales, and revenue operations leaders have more insight into where and how resources are being used as well as how effective they are at surpassing their goals.\r\n\nPrelay enables your revenue team and its internal stakeholders to coordinate and communicate effectively so you can drive more revenue faster as a team.\r\n\nPrelay is also backed by top-tier investors including funds like Y Combinator, SV Angel, Liquid2 Ventures and executives from Box, Dropbox, Palantir, SAP, and Microsoft.",
    "activity_status": "Active",
    "website": "https://prelay.com",
    "founded_date": 2019.0,
    "team_size": 16.0,
    "location": "San Francisco",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:saas; location:san-francisco-bay-area",
    "founders": [],
    "status": true,
    "generated_description": "Prelay is a team selling platform designed to streamline and enhance the sales process by improving coordination among revenue teams. Founded in 2019 and part of the prestigious Y Combinator Batch W20, the company is based in San Francisco and boasts a team of 16 employees. Its mission is clear: to help sales teams engage the right members and stakeholders in deals at optimal times—ultimately reducing resource waste and minimizing deal slippage.\n\nWhere many sales organizations struggle with fragmented tools and inefficiencies, Prelay offers a cohesive software solution that integrates seamlessly with existing key software—something that's often missing in traditional setups. Their approach benefits not just sales reps but also leaders in sales, technical sales, and rev ops, giving them greater visibility into resource allocation and performance metrics. \n\nWith Prelay, revenue teams can quickly scale their efforts, reduce costs, and boost revenue faster. The platform emphasizes not just compliance with internal processes but also enhances productivity across various teams, including presales, deal desk, customer success, and more. \n\nBacked by prominent investors like Y Combinator and various tech executives from companies like Microsoft and Dropbox, Prelay is positioned strongly in the SaaS market. If you’re looking to enhance your sales strategy through teamwork, their platform promises to deliver by simplifying the entire sales journey—allowing teams to focus on what truly matters: closing deals. \n\nFor a closer look at how Prelay can redefine your sales approach, check out their website: [Prelay](https://prelay.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/a2e398b46b41bfaf9efab96de5305adef3c895bc.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191651Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=f9a4d242a2b1ff37bb38641ed6eff256cd5cfb696c0e1baecc99bdf5cdfb1a4a",
    "social_links": [
        "https://www.linkedin.com/company/prelayhq",
        "https://twitter.com/prelayhq",
        "https://www.facebook.com/prelayhq",
        "https://www.crunchbase.com/organization/prelay"
    ],
    "logo_path": "data/logos\\Prelay_logo.png"
}