{
    "links": "https://www.ycombinator.com/companies/probably-genetic",
    "name": "Probably Genetic",
    "headline": "Patient Intelligence Platform for Genetic Disease",
    "batch": "W19",
    "description": "Probably Genetic is changing the lives of patients living with severe, complex diseases. Our data platform is used by drug developers and patient advocacy groups to develop and launch treatments for these patients. Our technology discovers undiagnosed patients online, analyzes their disease state using machine learning and at-home testing, and enables compliant communication with patients. In doing so, we help patients access diagnoses, clinical trials, and treatments as early as possible.",
    "activity_status": "Active",
    "website": "https://www.probablygenetic.com/",
    "founded_date": 2019.0,
    "team_size": 9.0,
    "location": "San Francisco",
    "group_partner": "Michael Seibel",
    "group_partner_yc": "https://www.ycombinator.com/people/michael-seibel",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:health-tech; industry:biotech; industry:genomics; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Lukas Lange, Founder",
            "description": "CEO & Co-Founder of Probably Genetic. Previously BCG & The Bill & Melinda Gates Foundation. PhD from Oxford as a Rhodes Scholar.",
            "linkedin": "https://www.linkedin.com/in/lukas-lange-8b1aa334/"
        }
    ],
    "status": true,
    "generated_description": "### Probably Genetic: Changing Lives Through Genetic Insights\n\n**Overview:**\nProbably Genetic, founded in 2019 and based in San Francisco, is pioneering the landscape of patient intelligence in genetic disease. As a Y Combinator Batch W19 company, it aims to identify and support patients dealing with severe, complex diseases through an innovative data platform. \n\n**Mission:**\nThe company's mission is straightforward yet profound: to transform the lives of those grappling with genetic diseases by ensuring timely access to diagnoses, clinical trials, and targeted treatments. By leveraging advanced machine learning and at-home testing, Probably Genetic finds undiagnosed patients and analyzes their conditions, streamlining the communication between patients, drug developers, and advocacy groups.\n\n**How It Works:**\nProbably Genetic's platform offers free genetic testing for over 4,000 diseases, allowing eligible patients to receive at-home test kits. With a simple saliva or cheek swab, patients can collect samples for analysis at a CLIA-certified lab. Importantly, their services are HIPAA-compliant, ensuring robust data privacy and protection.\n\n1. **Patient Enrollment:** Individuals complete a health assessment to determine eligibility for testing.\n2. **Home Testing Kits:** Upon approval, test kits are sent directly to patients’ homes for easy sample collection.\n3. **Results and Counseling:** Patients receive personalized genetic insights and have access to genetic counseling to understand their results.\n\n**Current Impact:**\n- **Patients Served:** Over 100,000 individuals have utilized the Probably Genetic platform.\n- **Partnerships:** Collaborating with more than 50 patient advocacy groups, the company fosters a supportive environment for patients seeking answers regarding their health.\n\n**Team and Leadership:**\nProbably Genetic operates with a focused team of nine employees and is led under the guidance of Michael Seibel as their Group Partner. This compact team is effectively making significant strides in the health-tech, biotech, and genomics sectors.\n\n**Why It Matters:**\nProbably Genetic is not just a service provider; it’s a beacon of hope for many who have faced years of uncertainty regarding their health. By simplifying access to genetic testing and connecting patients to the resources they need, it fills a critical gap in the healthcare system.\n\nTo discover if you or someone you know is eligible for free genetic testing, you can check out more at [Probably Genetic's Website](https://www.probablygenetic.com/).\n\nIn this rapidly evolving field, Probably Genetic stands out. They’re not just probably genetic; they’re likely the future of genetic disease diagnosis and management. If you’re interested, don’t hesitate to see how they can make a difference for you or a loved one.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/5e9a2bc9f51811d855c620113856c5bccf1c7124.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191654Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=80022631a2f90abc08e3d2961697cced7883f346f2a17359abc10b70de778493",
    "social_links": [
        "https://www.linkedin.com/company/probablygenetic/"
    ],
    "logo_path": "data/logos\\Probably_Genetic_logo.png"
}