{
    "links": "https://www.ycombinator.com/companies/proglix",
    "name": "Proglix",
    "headline": "B2B Marketplace for Raw Materials in Indonesia",
    "batch": "W23",
    "description": "Proglix is a marketplace for small and medium manufacturers to buy metal and steel raw materials in Indonesia. With our platform, customers can easily order domestic and import raw materials with cheaper price, no minimum order quantities, 2x faster in SLA and real time inventory stock.",
    "activity_status": "Active",
    "website": "https://proglix.com/",
    "founded_date": 2022.0,
    "team_size": 25.0,
    "location": "Jakarta, Indonesia",
    "group_partner": "Gustaf Alstromer",
    "group_partner_yc": "https://www.ycombinator.com/people/gustaf-alstromer",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:marketplace; industry:b2b; industry:manufacturing; industry:e-commerce",
    "founders": [
        {
            "name": "Wynn Wijaya, Founder",
            "description": "Wynn was born in Indonesia and have 7 years in B2B sector. He started his small business in 2016 trading electrical components to government project and power plant developer. Moving on in 2019, he expand the business into manufacturing in agriculture commodities and got contracted from local and global oil companies like Wilmar and Cargill.",
            "linkedin": "https://www.linkedin.com/in/wynn-wijaya-76a2a8a4/"
        },
        {
            "name": "Prawira Indrawan, Founder",
            "description": "Software engineer, with 11+ years in software development. CTO of Proglix.",
            "linkedin": "https://www.linkedin.com/in/prawira-indrawan-11826a256/"
        },
        {
            "name": "Wendy Wijaya, Founder",
            "description": "Wendy has built several ventures in Construction distribution and F&B. In 2016, he started a steel distributor company located in Cikarang, Indonesia. 4 years later, he started Joomba, an F&B company that produce & sell smoothies. In 2022, Joomba has 70 outlets across Indonesia and invested by Jiwa Group (one of the biggest F&B company in Indonesia).",
            "linkedin": "https://www.linkedin.com/in/wendy-noel-wijaya-b9b6648b/"
        }
    ],
    "status": true,
    "generated_description": "**Proglix: Revolutionizing Raw Materials Procurement in Indonesia**\n\nProglix is a burgeoning B2B marketplace dedicated to the procurement of raw materials, primarily metal and steel, for small and medium-sized manufacturers in Indonesia. Founded in 2022 and backed by the respected incubator Y Combinator in Batch W23, Proglix has quickly positioned itself as a vital player in the Indonesian manufacturing landscape.\n\n### What Makes Proglix Stand Out?\nProglix simplifies the purchasing process for manufacturers by allowing them to seamlessly order both domestic and imported raw materials. What's particularly compelling about their offering is the **no minimum order quantity** policy, which eliminates barriers for smaller manufacturers. The platform guarantees **twice the speed** in service level agreement (SLA) fulfillment and features real-time inventory tracking, making the procurement process not just easier but also significantly more efficient.\n\nOperating out of Jakarta, Indonesia, Proglix boasts a skilled team of 25 employees led by their group partner, Gustaf Alstromer. This compact yet talented team collaborates to ensure that customers get the best rates and top-notch products. \n\n### How Proglix Works\nProglix offers a diverse array of metal and steel products, such as Galvalume coils, steel plates, and pipes. Customers can explore categories, compare products, and receive instant quotes directly from the website, allowing for informed purchasing decisions with just a few clicks.\n\nIn addition to procurement, Proglix also specializes in:\n- **Excess Inventory Liquidation**: Helping businesses convert stagnant stock into cash.\n- **Customization and Logistics**: Tailoring solutions to meet the specific needs of their clients.\n- **E-Procurement and Financing**: Providing financial and credit solutions to support businesses throughout their procurement journeys.\n\n### A Platform for All\nProglix aims not only to serve small and medium enterprises but also larger companies, acting as a comprehensive digital supply-chain platform. Their approach integrates procurement, logistics, and financing—all designed to foster efficiency and stimulate growth in the metal supply chain.\n\nAs a one-stop shop, Proglix empowers businesses to optimize their operations. They tout features like guaranteed low prices and credit facilitation for purchases within a 30-day timeframe—elements that are invaluable in today’s fast-paced market.\n\n### Future Potential\nWith the growing demand for reliable sourcing and procurement channels in Indonesia, Proglix is positioned for significant growth. By continuing to innovate and streamline the supply chain processes, they are on track to transform the way raw materials are procured in the Indonesian market.\n\nFor more details, visit [Proglix’s official website](https://proglix.com/) to explore their offerings further. \n\nIn a rapidly evolving landscape, Proglix is proving to be a game-changer for metal and steel procurement in Indonesia—a space ripe for innovation and opportunity.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/091d412b665b43a920d7c24ddfc9afbdccb1eb3d.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191654Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=434ed1589b4dd57844c583c97894fdb32b8009cb2a4426e5fb56fe88fa2e8411",
    "social_links": [
        "https://www.linkedin.com/company/proglixindonesia/",
        "https://www.facebook.com/profile.php?id=100086480051818"
    ],
    "logo_path": "data/logos\\Proglix_logo.png"
}