{
    "links": "https://www.ycombinator.com/companies/prolific",
    "name": "Prolific",
    "headline": "Making diverse, high-quality data easily available to anyone, anywhere",
    "batch": "S19",
    "description": "Prolific helps dedicated research teams to collect the very highest-quality human-powered data - at scale - using our simple-to-use platform to target and manage participants from our diverse, vetted participant pool.\r\n\nThe truth matters: the best decisions, and biggest discoveries, are built on the highest-quality data. And with the increasing proliferation of AI, access to reliable, diverse data to develop and train AI models has never been more important.\r\n\nCreated by researchers for researchers, Prolific was founded to provide a better way for researchers and organisations to get high-quality human data and feedback at scale for important research.\r\n\nNow, more than 30,000 researchers across academia and industry use Prolific to gather definitive human data and feedback from reliable, engaged and fairly-treated participants – with a new study launched every 3 minutes.",
    "activity_status": "Active",
    "website": "https://www.prolific.com",
    "founded_date": 2014.0,
    "team_size": 130.0,
    "location": "London, United Kingdom",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:aiops; industry:marketplace",
    "founders": [
        {
            "name": "Phelim Bradley, Founder",
            "description": "Co-Founder and CEO of prolific.co.Prolific is a platform that makes it easy to run high quality online research. We manage a diverse pool of 100,000+ verified participants and provide access to an ecosystem of tools to run research on them. \n\nPreviously, I did a PhD in Bioinformatics, where I wrote software to analyze and search bacterial data sets using graph data structures.",
            "linkedin": "https://www.linkedin.com/in/phelim-bradley-84300826"
        }
    ],
    "status": true,
    "generated_description": "**Prolific: Connecting Researchers with Quality Data**\n\nProlific is a London-based company founded in 2014, which strongly believes that the truth is essential for making impactful decisions and discoveries. At its core, Prolific's mission is to democratize access to high-quality, human-powered data—making it easily available to researchers and organizations across the globe.\n\nInitially tailored for dedicated research teams, Prolific offers a straightforward platform that allows users to efficiently collect data from a diverse, vetted participant pool. This is particularly crucial now, as the development of artificial intelligence (AI) increasingly relies on reliable data for model training.\n\nWith over 30,000 researchers spanning both academia and industry employing Prolific for their studies, the platform facilitates a new data collection task every three minutes. Prolific's approach promotes ethical research practices by ensuring participants are treated fairly and compensated appropriately—earning at least $8.00 an hour per task.\n\n**A Powerful Tool for Data Collection**\n\nProlific stands out for a few key reasons:\n- **Speed and Efficiency:** Researchers can set up their studies in as little as 15 minutes and start collecting data within two hours. \n- **Quality of Responses:** Participants provide detailed, thoughtful answers, often surpassing the superficial responses typically seen in other data collection platforms.\n- **Flexibility for Participants:** Those looking to contribute can choose from a variety of interesting tasks, participate on their own terms, and earn money for their time.\n\nAs a trusted partner for leading organizations like Stanford, Google, and Oxford, Prolific has built a reputation for delivering high-quality data that supports the advancement of research across multiple fields. \n\nIf you’re in search of high-quality data, or if you're interested in earning by taking part in research, Prolific is definitely worth considering. \n\nExplore more at [Prolific](https://www.prolific.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/ba11273a6a7c880d7a0eade093d0be4a17477301.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191654Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=a75f736aa7e68b1224c97c1713b5dcc4056821694df11e3481c64ae10a338872",
    "social_links": [
        "https://www.linkedin.com/company/prolific-academic",
        "https://twitter.com/prolific",
        "https://www.facebook.com/prolificac/"
    ],
    "logo_path": "data/logos\\Prolific_logo.png"
}