{
    "links": "https://www.ycombinator.com/companies/promise",
    "name": "Promise",
    "headline": "A modern payment processing platform focused on government agencies.",
    "batch": "W18",
    "description": "Promise modernizes and humanizes government payments. We are a comprehensive payments platform that increases revenue and efficiency for government agencies. We help residents navigate payments with dignity and ease to avoid the negative consequences of non-payment. Promise’s win-win services strengthen the bond between government agencies and the communities which they serve.",
    "activity_status": "Active",
    "website": "http://promise-pay.com",
    "founded_date": 2017.0,
    "team_size": 70.0,
    "location": "Oakland, CA",
    "group_partner": "Michael Seibel",
    "group_partner_yc": "https://www.ycombinator.com/people/michael-seibel",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:govtech; location:san-francisco-bay-area",
    "founders": [],
    "status": true,
    "generated_description": "**Promise: Transforming Government Payments**\n\nFounded in 2017 and hailing from Oakland, California, Promise is a fintech company that focuses on optimizing payment processing for government agencies. It was part of the Y Combinator Batch W18, and currently employs around 70 people. The company is on a mission to modernize and humanize government payments, ensuring that residents can navigate these processes with dignity and ease, all while enhancing revenue and efficiency for the agencies involved.\n\nAt the core of Promise’s offerings is a comprehensive platform designed to tackle the inefficiencies often present in government payments. Through their innovative solutions, they aim to reduce the negative impacts of non-payment on communities, strengthening the relationship between government agencies and the residents they serve.\n\n### What They Do\n\nPromise's products include:\n\n1. **PromiseRelief**: Automates and streamlines relief programs, making them more accessible and efficient.\n2. **PromisePay**: Offers flexible, interest-free payment plans, helping to improve revenue collection and customer satisfaction.\n3. **PromiseVerified**: Utilizes advanced technology for quick and accurate income verification, enhancing the speed of service delivery.\n\nThese products enable government and utility agencies to distribute relief more swiftly and securely, leading to significant improvements in revenue recovery and customer experiences.\n\n### Proven Impact\n\nThe results of their services speak volumes. For instance, partnerships with agencies have yielded substantial successes, such as:\n\n- **Washington State**: In just 100 days, they provided fast energy relief to 690,000 households, distributing $150 million in credits, largely benefiting low-income families.\n- **WSSC Water**: Implemented payment plans resulted in recovering $28 million over 15 months and improving the on-time payment rate from 40-50% to 90%.\n- **City of Richmond**: They effectively distributed federal relief funds, significantly reducing outstanding payments and enhancing customer compliance.\n\n### Security and Reliability\n\nPromise places a high emphasis on security, employing professionals who are adept in national defense projects to safeguard sensitive information. This dedication ensures that all processes are not only seamless but also built on robust security foundations.\n\n### Recognition\n\nRecent acclaim includes being featured in Forbes’ 2024 list of Next Billion-Dollar Startups, a nod to their impactful contributions within the fintech and govtech spaces.\n\nFor anyone interested in advancing the efficiency and humanity of government payments, Promise offers a powerful suite of tools coupled with a strong commitment to community welfare. Their website, [promise-pay.com](http://promise-pay.com), contains further details on how they can help government agencies and residents navigate payments more effectively.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/e1953578e12f9621409e039950a16c03b8cf04a7.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191654Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=df530aeeb446b614292c881b6572eeadedec39a84596c4f278bc95720a070720",
    "social_links": [
        "https://www.linkedin.com/company/joinpromise",
        "https://www.crunchbase.com/organization/promise"
    ],
    "logo_path": "data/logos\\Promise_logo.png"
}