{
    "links": "https://www.ycombinator.com/companies/prometheus",
    "name": "Prometheus",
    "headline": "We use solar and wind power to make zero net carbon electrofuels",
    "batch": "W19",
    "description": "We remove CO2 and water from the air and use electricity from solar and wind power to turn them into zero net carbon electrofuels. These are gasoline, diesel, and jet fuels that work in existing cars, trucks and planes without requiring modification of their engines, and don't contribute to global warming because they don't add any new CO2 to the atmosphere. Each gallon of our electrofuels means a gallon of fossil oil left in the ground forever. Importantly, these fuels for the first time can compete with fossil fuels on price - our zero net carbon jet fuel has a price of one cent per gallon less than fossil jet fuel. American Airlines ordered 10 million gallons of this fuel and we will start shipping it next year.",
    "activity_status": "Active",
    "website": "http://www.prometheusfuels.com",
    "founded_date": 2018.0,
    "team_size": 25.0,
    "location": "Santa Cruz, CA",
    "group_partner": "Jared Friedman",
    "group_partner_yc": "https://www.ycombinator.com/people/jared-friedman",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:energy-storage; industry:climate",
    "founders": [
        {
            "name": "Rob McGinnis, Founder/CEO",
            "description": "Rob McGinnis is Founder and CEO of Prometheus, the first unicorn in e-fuels. Prometheus removes CO2 from the air and uses solar and wind power to turn it into zero net carbon petrol, diesel, jet, and RNG fuels that are superior to fossil fuels at a lower price. Rob has launched three venture backed startups in the fields of desalination, nanotechnology, and energy, and has over 20 patents in these fields. He completed his PhD in Environmental Engineering at Yale and is a veteran of US Navy EOD.",
            "linkedin": "https://www.linkedin.com/in/robertmcginnis"
        }
    ],
    "status": true,
    "generated_description": "**Prometheus: Pioneering Zero Carbon Electrofuels**\n\nFounded in 2018 and part of Y Combinator's Winter 2019 batch, Prometheus is on a mission to reshape the energy landscape with innovative, sustainable solutions. Based in Santa Cruz, California, the company has a dedicated team of 25 employees focused on creating zero net carbon electrofuels using renewable energy sources like solar and wind.\n\nAt its core, Prometheus captures CO2 and water from the atmosphere and converts them into electrofuels—gasoline, diesel, and jet fuels—without modifying existing engines. This process does not introduce new CO2 into the atmosphere, effectively leaving fossil resources untouched. The company underscores the environmental benefits of its approach: every gallon of their electrofuels means a gallon of fossil oil that remains in the ground indefinitely.\n\nWhat’s particularly compelling is that Prometheus has achieved a major breakthrough—their zero net carbon jet fuel competes on price with traditional fossil fuels, even coming in at one cent less per gallon. This has already caught the attention of major players in the airline industry; American Airlines has placed an order for 10 million gallons to be delivered next year.\n\nIn a world grappling with climate change, Prometheus is not just a fantasy but an actionable reality. They tag themselves in the realms of 'energy-storage' and 'climate,' emphasizing their dual focus on renewable energy and reducing global carbon emissions. The company's website, http://www.prometheusfuels.com, serves as a portal for more information about their groundbreaking work and future initiatives. \n\nWith Jared Friedman as their Group Partner at Y Combinator guiding them, Prometheus is poised to play a significant role in the transition towards sustainable fuels. In a competitive world, they stand out not just for their technology, but for their vision of a cleaner, greener future where our dependency on fossil fuels can finally diminish.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/8d90db168701b5b0aa7a363d758084e3845c79ec.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191654Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=4c88696b619920ef680070ef121d0180687c4fcb902a73f5984a1fd5a4b2f9ad",
    "social_links": [
        "https://www.linkedin.com/company/prometheusfuels/",
        "https://twitter.com/prometheusfuels",
        "https://www.facebook.com/prometheusfuels/",
        "https://www.crunchbase.com/organization/prometheus-2373"
    ],
    "logo_path": "data/logos\\Prometheus_logo.png"
}