{
    "links": "https://www.ycombinator.com/companies/promakhos-therapeutics",
    "name": "Promakhos Therapeutics",
    "headline": "A therapeutics platform for curing inflammatory disorders",
    "batch": "S21",
    "description": "We are building a platform of bacterial molecules to awaken our body’s innate ability to control inflammation and heal. Our first indication is Crohn’s Disease, which affects over 500,000 Americans at an annual cost of $10B. After Crohn's disease, we are going for type 1 Diabetes and Multiple Sclerosis.",
    "activity_status": "Active",
    "website": "https://www.promakhos.com/",
    "founded_date": 2021.0,
    "team_size": 2.0,
    "location": "Boston",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:therapeutics; location:boston",
    "founders": [
        {
            "name": "Katerina Chatzi, Founder",
            "description": "I believe we can discover unexpected things that can transform our lives. I have lived and performed research in 4 countries and 2 continents. Previously I was a postdoc at Harvard. I founded Promakhos because I think we have given to “autoimmune” diseases a grossly misleading name and we treat them in a primitive way. Promakhos means the first to enter a battle. In ancient Greece Promakhos was the strongest to put in the front line of an army so that they will not even have to start a battle.",
            "linkedin": "https://www.linkedin.com/in/katerina-chatzi-phd-366625179/"
        },
        {
            "name": "Jasper Edgar Neggers, Founder",
            "description": "In 2009, Jasper built a web-shop in the Netherlands. He then received a BSc, MSc and PhD in Biomedical Sciences from KU Leuven (Belgium). He pioneered the use of XPO1 inhibitors for treating cancer and invented a CRISPR-directed evolution technology for drug target deconvolution. Jasper then joined the Dana-Farber Cancer Institute and Broad Institute of MIT and Harvard to identify and validate new drug targets for gastrointestinal cancers. Now, he is developing drugs for chronic inflammation.",
            "linkedin": "https://www.linkedin.com/in/jasperneggers"
        }
    ],
    "status": true,
    "generated_description": "**Promakhos Therapeutics: A New Frontier in Inflammatory Disease Treatment**\n\nFounded in 2021 and based in Boston, Promakhos Therapeutics is on a mission to revolutionize the treatment of inflammatory disorders. Their approach is refreshing and bold; instead of just suppressing the immune system—which is the standard method for treating chronic inflammatory diseases today—they aim to restore its inherent ability to regulate inflammation and facilitate healing.\n\n### The Beginning and Future Directions\n\nInitially, Promakhos began by focusing on leveraging bacterial molecules to enhance the body’s innate immune response. Their first target? Crohn's disease, which carries a staggering annual treatment cost of around $10 billion in the U.S. Following Crohn's, they plan to tackle type 1 diabetes and multiple sclerosis—conditions that also stem from immune system dysregulation.\n\n### A Small but Mighty Team\n\nWith a compact team of just two full-time employees, Promakhos is powered by the vision of Co-founders **Katerina Chatzi, Ph.D.**, and **Jasper E. Neggers, Ph.D.** Both bring extensive backgrounds in biology and immunology, complemented by their entrepreneurial spirit. Their impressive track records include postdoctoral work at prestigious institutions like Harvard University and KU Leuven, where they honed their expertise in research, business development, and drug discovery.\n\n### Innovative Therapeutics Platform\n\nPromakhos is not just another biotech company. They're developing a unique therapeutics platform that centers on treating the root causes of inflammatory diseases—an approach that very few in the industry are taking. Instead of simply managing symptoms, they aim to fundamentally change how chronic inflammation is addressed. As they grow, their platform may become a pivotal part of modern medicine in managing autoimmune conditions.\n\n### Awards and Recognition\n\nRecognizing its innovative approach and potential impact, Promakhos has garnered attention from organizations like Y Combinator and the Massachusetts Life Sciences Center. Their recent achievements include winning the **Massachusetts Next Generation Initiative Award**, awarded to women-led startups that show promise. They also received a **$272,000 NIH Phase 1 SBIR grant** to develop an oral immunomodulating therapy specifically focusing on Crohn's disease.\n\n### Future Aspirations\n\nPromakhos Therapeutics is clearly on the rise, combining scientific innovation with strategic foresight to create therapies that could alleviate the burden of chronic diseases affecting millions. Their mission aligns well with modern healthcare's need for effective solutions that prioritize restoring rather than suppressing our bodies' natural functions.\n\nIn short, if you’re looking at the biotech landscape through the lens of inflammation and autoimmunity, keep your eyes on Promakhos Therapeutics. They might just be the game-changer we've all been waiting for. \n\nTo learn more about their groundbreaking work, you can visit their [website](https://www.promakhos.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/d7ec4363d01c0afe1de3d198e6cf8a8649d2a650.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191654Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=1b4545e3aa37d430e1db15e86ce5c85b3da81f85594794446d99212556850928",
    "social_links": [
        "https://www.linkedin.com/company/79357217",
        "https://twitter.com/Katerina_Hatzi"
    ],
    "logo_path": "data/logos\\Promakhos_Therapeutics_logo.png"
}