{
    "links": "https://www.ycombinator.com/companies/proof-trading",
    "name": "Proof Trading",
    "headline": "Institutional equities broker-dealer",
    "batch": "S19",
    "description": null,
    "activity_status": "Active",
    "website": "https://prooftrading.com",
    "founded_date": 2019.0,
    "team_size": 7.0,
    "location": "New York",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:finance; location:new-york",
    "founders": [],
    "status": true,
    "generated_description": "**Company Overview: Proof Trading**\n\nFounded in 2019 and based in New York, Proof Trading is a fresh face in the world of institutional equities brokerage, boasting a team of seven skilled employees. As an execution-only broker-dealer, the company has positioned itself as a transparent and accountable partner for institutional clients looking to navigate the complexities of the U.S. equities market.\n\n**Mission & Approach**\n\nAt its core, Proof Trading is dedicated to bridging the gap between market principles and the trading experiences of long-term investors. The financial industry often feels bloated and convoluted, with a combination of advanced technology and outdated practices. Proof aims to untangle this mess by building advanced algorithms that not only perform effectively but also prioritize transparency. They believe that true transparency goes beyond mere marketing jargon—it's about accountability in the trading process.\n\nTheir cloud-based trading platform allows for rapid iteration and improvement of their products, ensuring that they remain at the cutting edge of technology while adhering to the rigorous standards of scientific research. They’re committed to keeping their clients informed with detailed insights into their algorithmic designs and market structures.\n\n**What They Offer**\n\nProof Trading revolves around innovative solutions, including a cloud-based trading platform and an impact minimization model, aimed at enhancing the trading experience for their clients. Their resources remain openly accessible, with whitepapers detailing algorithm designs, market structure primers, and a blog chronicling their journey and insights.\n\nFor those interested in the mechanics of trading, you can explore more through their offerings including how their algorithms function and the rationale behind their open approach to algorithm design.\n\n**Affiliations and Growth**\n\nAs a proud member of the Y Combinator S19 batch, Proof Trading is part of a well-recognized accelerator known for nurturing high-potential startups. Their group partner is currently not listed, but the emphasis on being a woman-owned broker underscores a commitment to diversity in finance.\n\n**Conclusion**\n\nWith their emphasis on transparency, cutting-edge technology, and institutional client focus, Proof Trading is poised to make a significant impact in the equities brokerage space. By tackling the industry’s archaic structures head-on, they’re not just innovating—they’re creating a new model for how institutional trading can be done right.\n\nFor more information, check out their website: [Proof Trading](https://prooftrading.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/21bd5998651fa93983bac079c484a4636ad7abbb.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191655Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=dc72fb1bdbdbd22c3ba903730bc8ee3f4072013b065ca53104e50900c6a9ff52",
    "social_links": [],
    "logo_path": "data/logos\\Proof_Trading_logo.png"
}