{
    "links": "https://www.ycombinator.com/companies/pulley",
    "name": "Pulley",
    "headline": "Pulley helps startups manage their equity and cap table",
    "batch": "W20",
    "description": "Pulley is the cap table and equity management platform that helps founders and employees make smarter decisions about their equity.\r\n\nFor early stage companies, Pulley helps founders get started on hiring and fundraising, avoid expensive equity mistakes, and save thousands on legal fees. With Pulley, you can compare different funding scenarios, raise capital, and set up equity grants for employees.\r\n\nOur tools help companies answer important questions such as:\r\n1. How much of the company will I own after my next round?\r\n2. How will pro-rata rights impact my ownership in future rounds?\r\n3. How do I explain the value of equity to candidates?\r\n\nEquity is a company's single most important asset. Pulley gives companies insights into their equity, so they can make smarter decisions around hiring and fundraising, while proactively staying ahead of tax filings and accounting. If you are looking for a way to manage your cap table, try Pulley at https://pulley.com/.",
    "activity_status": "Active",
    "website": "https://pulley.com",
    "founded_date": 2020.0,
    "team_size": 68.0,
    "location": "San Francisco",
    "group_partner": "Dalton Caldwell",
    "group_partner_yc": "https://www.ycombinator.com/people/dalton-caldwell",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Yin Wu, Founder",
            "description": "Yin Wu is a serial entrepreneur who sold her last previous company to Microsoft in 2015. She was one of the youngest principal engineers at Microsoft and built products that applied machine learning to mobile products. Prior to Microsoft, Yin studied computer science at Stanford. She dropped out in 2011 to join Y Combinator for her first startup and is a three time Y Combinator alumnus (S11, S13, W20).",
            "linkedin": "https://www.linkedin.com/in/ywu01/"
        }
    ],
    "status": true,
    "generated_description": "**Pulley: Managing Equity Smarter for Startups**\n\nPulley is a dynamic startup founded in 2020, nestled in the bustling innovation hub of San Francisco. As part of Y Combinator’s Winter 2020 batch, Pulley has quickly made a name for itself as an invaluable tool for founders and employees dealing with equity and cap table management.\n\n**What They Do:**\nThe core mission of Pulley is straightforward: they help startups navigate the sometimes murky waters of equity management. For early-stage companies, this means a treasure trove of benefits. From hiring to fundraising, Pulley aims to eliminate costly equity blunders and streamline legal processes, saving startups significant time and money.\n\n**Key Functions:**\n- **Cap Table Management:** Get clear insights into ownership structures, allowing founders to grasp exactly how much equity they’ll have after future funding rounds.\n- **Fundraising Modeling:** Compare scenarios, prepare for rounds, and efficiently issue SAFEs (Simple Agreements for Future Equity).\n- **Compliance Made Easy:** Obtain 409A valuations swiftly, facilitating smoother tax handling and compliance.\n- **Employee Engagement:** Educate and inform employees about equity, building a culture of ownership and motivation.\n\nPulley’s tools address essential questions such as:\n- What portion of the company will I own post-funding?\n- How do my pro-rata rights work?\n- How do I communicate the true value of equity to potential hires?\n\n**Why Pulley?**\nEquity is arguably one of the most vital assets a company holds, and Pulley enables founders to take the reins. The platform consolidates critical functions, offering a single place to manage equity, ensuring you're ahead of tax filings and accounting—two areas that can otherwise drown you in administrative intricacies.\n\n**The Team:**\nCurrently, Pulley employs approximately 68 people and is guided by Dalton Caldwell as their Group Partner. This compact but efficient team is dedicated to evolving their platform to better serve the needs of modern companies.\n\n**Join the Movement:**\nWith over 5,000 companies already utilizing Pulley, it’s clear that this tool is resonating within the startup community. If you’re a founder seeking a seamless way to manage your equity and propel your company forward, give Pulley a shot. You might just simplify your journey.\n\nFor more insights and to start your free trial, visit [Pulley’s website](https://pulley.com/).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/30498b7f6b0092ed9c870db92695e2c2a34deeac.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191657Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=394d294c4408db0861eca96c75c21262e42227e0cc8977b774b6292b81d9dd2b",
    "social_links": [
        "https://www.linkedin.com/company/pulley-cap-table/",
        "https://twitter.com/pulley"
    ],
    "logo_path": "data/logos\\Pulley_logo.png"
}