{
    "links": "https://www.ycombinator.com/companies/pulppo",
    "name": "Pulppo",
    "headline": "Shopify for Real Estate Agents in LATAM",
    "batch": "S22",
    "description": "Pulppo is building Shopify for the real estate brokerages in Latin America. We provide them with performance analytics software, automatic online property listings, a valuation tool and a CRM. We will charge 20% of the 166 billions dollars in annual commissions they generate. \r\nFrom our integrated tool we automate non-value added activities, and give visibility and transparency to agents (CRM) and customers (buyer collaboration, seller dashboard). By integrating the entire process, we empower agents to deliver an improved customer journey and more efficient process.",
    "activity_status": "Active",
    "website": "https://www.pulppo.com",
    "founded_date": 2022.0,
    "team_size": 29.0,
    "location": "Mexico City, Mexico",
    "group_partner": "Michael Seibel",
    "group_partner_yc": "https://www.ycombinator.com/people/michael-seibel",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:real-estate; industry:proptech",
    "founders": [
        {
            "name": "Matias Gath, Founder",
            "description": "3rd time founder with a passion for solving problems in LATAM. Prior to Pulppo I started Kadabra, the first on demand delivery platform in Argentina. Kadabra was acquired by Glovo less than a year after starting ops and I led Glovo's launch and expansion in Argentina and supported the rest of the region.\n\nI come from a family of architects and real estate developer so I was always passionate in proptech. Prior to my startup life, I was in corporate innovation at Brambles and got an MBA at IESE.",
            "linkedin": "https://www.linkedin.com/in/matias-gath-6881314/"
        },
        {
            "name": "Agustin Iglesias, Founder",
            "description": "2nd time founder with a passion in Proptech. Prior to Pulppo I started Tokko Broker, the first Real Estate CRM SaaS in Argentina. Tokko was acquired by Navent / QuintoAndar when we have more than 20k paid active brokers, then I led Tokko launch and expansion in Mexico, Peru, and Ecuador.\n\nIn 2020, I relocated to Mexico and become country manager of Inmuebles24.com (Zillow for Mexico).\n\nI come from a family of Real Estate Brokers. I studied in ITBA (Arg), and take several courses at IAE.",
            "linkedin": "https://www.linkedin.com/in/agustiniglesias/"
        }
    ],
    "status": true,
    "generated_description": "**Pulppo: Revolutionizing Real Estate in LATAM**\n\nFounded in 2022 and based in Mexico City, Pulppo is on a mission to be the \"Shopify for Real Estate Agents in Latin America.\" As part of Y Combinator's Batch S22, this innovative proptech company is transforming how real estate brokerages operate in a market worth a staggering $166 billion in annual commissions.\n\nPulppo provides agents with a comprehensive suite of tools that includes performance analytics software, an automatic online property listing service, a property valuation tool, and a customer relationship management (CRM) system. Their approach focuses on automating non-value-added tasks, improving transparency for both agents and clients through dashboards and collaboration tools, and ultimately enhancing the customer journey.\n\nThe company operates on a revenue-sharing model where it captures 20% of the commissions generated by its users. With a team of 29 employees, Pulppo is integrating the entire real estate process to empower agents, giving them the ability to streamline operations and focus on what truly matters: serving clients effectively.\n\nFor those interested in the latest properties, Pulppo offers various options for buying, selling, or renting real estate in Mexico, aiming to simplify the process through expert support and robust technology.\n\nCurious to learn more? Check out [Pulppo's website](https://www.pulppo.com) for the latest listings or to join their network of agents. With Pulppo, finding a home in LATAM is now just a click away.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/9e026e58c5610001c046d09af6fe57f59e4898ba.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191657Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=f580bb411fcb92a24e367c19b2579f5dfc5e7415ed788539416acf472d770bdf",
    "social_links": [
        "https://www.linkedin.com/company/pulppo",
        "https://www.twitter.com/pulppomx",
        "https://www.facebook.com/pulppomx",
        "https://www.crunchbase.com/organization/pulppo"
    ],
    "logo_path": "data/logos\\Pulppo_logo.png"
}