{
    "links": "https://www.ycombinator.com/companies/pyka",
    "name": "Pyka",
    "headline": "Autonomous electric airplanes",
    "batch": "S17",
    "description": "Pyka’s goal is to provide society with a new form of safe, clean, and cost-effective transportation enabled by autonomous electric aviation. \r\n\nTo get there, we’re taking a different approach than most. We're applying our technologies to every industry where autonomous electric aircraft can be useful, starting with the highest value and most dangerous jobs. In doing so, we're building game-changing products manufactured at scale, while perfecting the safety, reliability, and capabilities of our autonomy engine and electric propulsion systems. \r\n\nWe design, develop and manufacture an ecosystem of technologies including proprietary flight control software, avionics, high power density motors, motor controllers, batteries, and custom carbon-fiber composite airframes.\r\n\nToday, we supply autonomous electric aircraft for cargo transport and crop protection to real-world customers across four separate continents and have secured industry-first regulatory approvals from the FAA. \r\n\nOur cargo aircraft enables remote connectivity, enhances express delivery networks, and ensures fast and reliable shipping of critical supplies to areas in need. Our crop protection aircraft offers agricultural services providers and farmers an autonomous tool to make aerial application safer, more precise, and less harmful to surrounding environments. Both vehicles are highly economical to operate, easy to deploy, and significantly reduce C02 emissions in their respective industries.  \r\n\nWhat you work on at Pyka makes people’s lives better now and brings the future of electric aviation one step closer each day.",
    "activity_status": "Active",
    "website": "https://flypyka.com",
    "founded_date": 2017.0,
    "team_size": 75.0,
    "location": "Alameda, CA",
    "group_partner": "Dalton Caldwell",
    "group_partner_yc": "https://www.ycombinator.com/people/dalton-caldwell",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:airplanes; industry:climate; industry:agriculture; industry:transportation; industry:electric-vehicles; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Kyle Moore, Founder",
            "description": "Co-Founder of Pyka building autonomous electric airplanes",
            "linkedin": "https://www.linkedin.com/in/kyle-moore-1485536a/"
        },
        {
            "name": "Michael Norcia, Founder/CEO",
            "description": null,
            "linkedin": "https://www.linkedin.com/in/michael-norcia-13a79124/"
        },
        {
            "name": "Chuma Ogunwole, Founder/COO",
            "description": null,
            "linkedin": "https://www.linkedin.com/in/chuma-ogunwole-10893316"
        },
        {
            "name": "Nathan White, Founder/CEO",
            "description": null,
            "linkedin": "https://www.linkedin.com/in/nathan-white-8a1950a9"
        }
    ],
    "status": true,
    "generated_description": "Pyka is at the forefront of a transformative era in aviation, focusing on autonomous electric airplanes designed to provide safe, clean, and cost-effective transportation. Founded in 2017 and part of Y Combinator's Summer 2017 batch, this Alameda, CA-based company has set out to revolutionize how we think about air transport across various industries, starting with the most demanding and valuable tasks.\n\nWith a crew of 75 talented employees, Pyka crafts an impressive ecosystem of technologies—ranging from proprietary flight control software to high-density motors and custom carbon-fiber airframes. Their innovations are not merely theoretical; they include the Pelican 2, a next-generation aircraft aimed at crop protection, and the upcoming Pelican Cargo, which promises large-scale autonomous cargo transport capabilities.\n\nBut what's particularly noteworthy is Pyka's smart, methodical approach. Instead of limiting their focus to niche markets, they’re tackling broader applications of their technology, which includes autonomous aerial applications in agriculture and logistics. Their operations are significantly more economical and greener, cutting down CO2 emissions while enhancing safety and delivery capabilities. They’ve even garnered industry-first regulatory approvals from the FAA, paving the way for future endeavors.\n\nPyka’s aircraft already serve real-world customers across four continents, streamlining cargo delivery and providing precision in agricultural practices. This dual approach not only improves efficiency but also makes aerial work safer and less harmful to the environment.\n\nIn essence, what Pyka is building not only makes people's lives better today but also inches us closer to a future dominated by electric aviation. If you're curious and want to dive deeper into their vision, their website is a great place to start: [Fly Pyka](https://flypyka.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/2883ae69a79f4628b408eca8a6a82c41638c9848.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191659Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=e49a453895a458ba5f9d79da3d4a06535abd18631354ea180c075a2d885421e5",
    "social_links": [
        "https://www.linkedin.com/company/18059383",
        "https://www.crunchbase.com/organization/pyka"
    ],
    "logo_path": "data/logos\\Pyka_logo.png"
}