{
    "links": "https://www.ycombinator.com/companies/quantstruct",
    "name": "Quantstruct",
    "headline": "Auto-improve & publish technical docs with AI",
    "batch": "W25",
    "description": "Quantstruct automatically creates and improves product documentation, implementation guides, and changelogs for API & SDK products, web-based enterprise software, and internal applications.\r\n\nQuantstruct identifies gaps in your knowledge base based on each product release or unfulfilled customer query. It uses multiple AI agents to search existing knowledge sources, test existing docs for validity and style guidelines, and clicks, scrolls, and uses enterprise software through a web browser to generate docs with embedded screenshots and video recordings. Quanstruct is available as a cloud service to start, targeting technical writers, content writing, professional services, and product teams.\r\n\nTraditional generative AI tools risk hallucinating critical API & SDK fields, even with RAG based approaches. Purely agent-based approaches risk providing unpredictable output that can diverge from desired documentation processes. Finally, no company’s review and publishing workflow is the same. Quantstruct is the easiest way to onboard and customize AI agents to continuously improve your documentation based on your customer needs and product evolution. https://quantstruct.com",
    "activity_status": "Active",
    "website": "https://quantstruct.com",
    "founded_date": 2024.0,
    "team_size": 2.0,
    "location": "San Francisco",
    "group_partner": "Garry Tan",
    "group_partner_yc": "https://www.ycombinator.com/people/garry-tan",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:artificial-intelligence; industry:developer-tools; industry:b2b; industry:api; industry:automation; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Newman Hu, Founder",
            "description": "Co-founder of Quantstruct. We're building AI agents to create the best documentation for your product. Newman previously built search infrastructure at Moveworks and Replit (YC W18), where he managed mission critical platforms powering Gen AI experiences for Fortune 500 companies. EECS @ Berkeley",
            "linkedin": "https://www.linkedin.com/in/newmanhu/"
        },
        {
            "name": "Sarthak Srinivas, Founder",
            "description": "Cofounder of Quantstruct (YC W25). Built an agent developer platform from 0 to $2+ million as product lead while onboarding multiple Fortune 100 companies at Moveworks. Published and reviewed 1000s of documentation guide updates to support customers and internal teams, before realizing agent-based workflows could do his job. Ex-Kleiner Perkins fellow. Published research with Google Glass inventor (who coined “wearable computing”) at Georgia Tech.",
            "linkedin": "https://linkedin.com/in/sarthaksrinivas"
        }
    ],
    "status": true,
    "generated_description": "### Quantstruct Overview\n\nFounded in 2024 and hailing from the prestigious Y Combinator Batch W25, Quantstruct is a burgeoning company based in San Francisco, composed of a nimble team of two. The startup is on a mission to revolutionize technical documentation by leveraging the power of AI. Their main goal? To **automate the improvement and publication of technical documents** in real time.\n\n### What They Do\n\nOriginally envisioned as a solution for generating and enhancing product documentation, Quantstruct automatically creates implementation guides and changelogs tailored for API & SDK products, web-based enterprise software, and internal applications. Rather than having users manually sift through documentation, Quantstruct identifies gaps based on product releases and unsatisfied customer queries. It employs multiple AI agents that evaluate the validity and style of existing documentation, accessing internal knowledge sources, and even interacting with enterprise software to create documentation that’s as insightful as it is comprehensive. \n\n### Key Features\n\n- **AI-Powered Documentation:** By analyzing code changes in GitHub and scanning existing documents, Quantstruct suggests improvements and generates new documentation automatically. It does this while ensuring that everything maintains a high standard of accuracy through rigorous validation protocols.\n  \n- **User-Friendly Integrations:** The platform integrates seamlessly with popular tools like Slack and GitHub, allowing for a dynamic workflow that keeps documentation up-to-date without the manual overhead associated with traditional documentation practices.\n\n- **Customization:** Recognizing that no two companies share the same documentation needs, Quantstruct offers simple onboarding and customization for teams. This allows organizations to tailor the system to align with their unique review and publishing workflows.\n\n### Challenges They Address\n\nTraditional generative AI tools often struggle with accuracy, particularly in generating vital API and SDK fields, while agent-based approaches can produce unpredictable results. Quantstruct overcomes these challenges with a blend of structure and flexibility, ensuring documents evolve alongside product updates and customer feedback, thereby driving continuous improvement.\n\n### Current Status and Vision\n\nWith its innovative approach to technical writing, Quantstruct is positioned to be an essential tool for technical writers, content creators, professional services, and product teams. Their website (https://quantstruct.com) serves as a portal for potential users to learn more, sign up, and even schedule a chat with the founders to dive deeper into what Quantstruct can offer.\n\nIn summary, Quantstruct is more than just a documentation tool; it’s a forward-thinking platform designed to bring automation, customization, and precision to technical writing, ultimately supporting teams in delivering stellar user experiences without the hassle.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/24efcdfbfd0c7c9a95e79ad658d3540d38c1e734.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191700Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=9ffbc8f38f3d9c65a9f752cf3bbfeafcda8391482daa0599879caafd009d1731",
    "social_links": [
        "https://www.linkedin.com/company/quantstruct",
        "https://x.com/quantstruct",
        "github.com/quantstruct"
    ],
    "logo_path": "data/logos\\Quantstruct_logo.png"
}