{
    "links": "https://www.ycombinator.com/companies/quantierra",
    "name": "Quantierra",
    "headline": "Sourcing investment real estate",
    "batch": "W15",
    "description": "Quantierra sources real estate investments for developers.\r\n\nIt uses their database and algorithms to determine what can be built, its value, and the probability of it selling. Taking a 1.5% cut of any property they help sell, They’ve made $141,000 in revenue in 3 months, and say they have $310,000 in signed term sheets.",
    "activity_status": "Active",
    "website": "http://quantierra.com",
    "founded_date": null,
    "team_size": 5.0,
    "location": "New York",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:real-estate; industry:investing; location:new-york",
    "founders": [],
    "status": true,
    "generated_description": "Quantierra is an innovative startup focused on sourcing investment real estate, primarily for developers. It utilizes a smart combination of a robust database and sophisticated algorithms to evaluate properties—determining what can be built, estimating their value, and assessing the likelihood of a successful sale. \n\nThe business model is straightforward: Quantierra earns a 1.5% commission on any property transactions they facilitate. This model is proving effective, as the company has generated $141,000 in revenue in just three months and has secured $310,000 in signed term sheets—a clear indication of traction in their market.\n\nFounded in the Y Combinator Batch W15, Quantierra calls New York City home and operates with a lean team of five. While details on their full team and partnerships are a bit sparse (notably, there's a mention of an unspecified group partner), their taglines—'real-estate', 'investing', 'new-york'—capture their essence well.\n\nIf you’re interested in learning more, you can visit their website at [quantierra.com](http://quantierra.com). With a promising start and the backing of a reputable accelerator, Quantierra is poised to make waves in the real estate investment sector.",
    "logo": "/logos/medium/missing.png",
    "social_links": [
        "https://twitter.com/quantierra",
        "https://www.crunchbase.com/organization/quantierra"
    ]
}