{
    "links": "https://www.ycombinator.com/companies/querypie",
    "name": "QueryPie",
    "headline": "Unified Access Control & Audit for Infrastructure",
    "batch": "W20",
    "description": "QueryPie solves two important customer problems. The first is being able to respond to ITGC audits to ensure financial transparency, The second is to keep customer privacy data and sensitive information from internal employees and external attackers,also provide insights into what data to use for AI.\r\n\nThis is made possible by centralizing access control and auditing of IT assets such as databases, servers, and containers across both on-premises and cloud environments in One-place QueryPie.\r\n\nQueryPie covered various privacy law and compliances such as ITGC for Sox, PCI-DSS, ISO27001, HIPAA, CCPA, GDPR, ISMS",
    "activity_status": "Active",
    "website": "https://www.querypie.com",
    "founded_date": 2017.0,
    "team_size": 97.0,
    "location": "San Mateo, CA",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:artificial-intelligence; industry:b2b; industry:compliance; industry:security; industry:cybersecurity; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Brant Hwang, Founder/CEO",
            "description": "Brant has over 17 years of experience in the software field, with a Master's in Computer Science from KAIST. He has worked on Enterprise Software, Embedded Systems, Internet Portals, and Commerce Platforms. Before considering entrepreneurship, he was involved in Platform development at Kakao.\n\nBrant believes the core of software is the people it serves and focuses on solving problems simply and efficiently.",
            "linkedin": "https://www.linkedin.com/in/ishwang/"
        },
        {
            "name": "Benjamin Yang, Director of product development, Founder",
            "description": "Benjamin is an open-minded IDE expert who has been developing IDE databases for 15 years. He is now a full-time cloud-based PaaS developer, with a 21-year experience in software development and a bachelor's degree in computer science from Hanshin University.\n\nBen's IDE expertise and data connectivity foundation enable the company to provide top-notch SQL editing, querying, and collaboration tools to QueryPie's development team, enabling seamless data governance and data analytics integration.",
            "linkedin": "https://www.linkedin.com/in/benjamin-yang-4b0609159/"
        }
    ],
    "status": true,
    "generated_description": "**QueryPie: Streamlining Security and Compliance in the Digital Age**\n\nFounded in 2017 and backed by Y Combinator’s W20 batch, QueryPie is on a mission to provide *Unified Access Control & Audit for Infrastructure*. This San Mateo-based company (currently employing around 97 people) began its journey by addressing two crucial customer challenges: facilitating IT General Controls (ITGC) audits for better financial transparency, and protecting sensitive data to shield it from both internal mishandling and external threats. \n\nSo how does QueryPie achieve this? By centralizing access control and auditing for IT assets—be it databases, servers, or containers—across both on-premises and cloud setups. In this \"one-stop-shop,\" organizations can maintain precise control over who accesses what, which is vital for ensuring compliance with a variety of regulations including SOX, PCI-DSS, ISO27001, HIPAA, CCPA, and GDPR.\n\nQueryPie stands out not just in compliance but as a powerful tool for lengthening your reach into the world of AI. By offering insights into data usage for AI applications, it allows businesses to innovate while remaining compliant.\n\n### Comprehensive Product Offerings\n\nQueryPie offers a suite of products designed to obliterate security headaches:\n\n- **Database Access Controller (DAC)**: Provides detailed control over who can access your databases.\n- **System Access Controller (SAC)**: Governs access to critical systems, ensuring only the authorized can make modifications or view sensitive info.\n- **Kubernetes Access Controller (KAC)**: Secures access to your Kubernetes environment, handling the complexities of microservices.\n- **Web Access Controller (WAC)**: Manages who accesses your web applications, catering to various compliance needs.\n- **AI Data Discovery (AIDD)**: Identifies and maintains oversight of data that can be utilized for AI-driven projects.\n\nIn addition to these products, QueryPie also offers solutions for simplified access control, automated auditing, enhanced efficiency for engineering teams, optimized integration, and help in meeting compliance requirements.\n\n### Security in a Complex Landscape \n\nIn a world where multi-cloud infrastructures can create murky compliance waters, QueryPie acts as a lighthouse, helping businesses navigate the stormy seas of security management. As companies juggle internal systems with cloud environments, QueryPie’s comprehensive access control and auditing capabilities prevent chaos and reinforce defenses against ever-evolving threats.\n\nThey also understand that regulatory compliance is a moving target. QueryPie keeps its offerings updated to meet the latest standards, reducing the complexity of adhering to stringent data privacy laws.\n\n### Community and Influence\n\nWith a growing roster of prominent clients and a dedicated partner ecosystem, QueryPie is positioning itself as a trusted ally for IT security and compliance in some of the fastest-growing tech environments. Their extensive resources, including white papers, webinars, and success stories, further highlight their commitment to transparency and consumer education.\n\n### Future Aspirations\n\nAs businesses increasingly rely on digital assets, the demand for innovative security solutions will undoubtedly surge. QueryPie’s strategic emphasis on advanced access management reflects an astute understanding of this landscape, positioning them to not only respond to current needs but also anticipate future challenges.\n\nFor a closer look at their solutions or to schedule a demo, check out their offerings at [QueryPie’s website](https://www.querypie.com).\n\nFrom financial institutions to tech giants, QueryPie aims to be the guardian of data integrity in the complex interworkings of today's infrastructure. They’re not just selling software; they're providing peace of mind in a digital era rife with challenges.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/d5e1e408eb9875f9898d826bd62b891d1fea2af0.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191701Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=158f621e0dae9bd9847a83aedce634a1ce34cefe2f68d1210e99249507488c2e",
    "social_links": [
        "https://www.linkedin.com/company/querypie",
        "https://twitter.com/querypie",
        "https://www.facebook.com/querypie/",
        "https://www.crunchbase.com/organization/querypie"
    ],
    "logo_path": "data/logos\\QueryPie_logo.png"
}