{
    "links": "https://www.ycombinator.com/companies/quik",
    "name": "QUIK",
    "headline": "Building the operating system for business in LATAM",
    "batch": "W22",
    "description": "QUIK is building the operating system for business in LATAM.\r\n\nOn one side, powering users on QUIK Super App, where they can order foods, groceries and goods and get them on 30 minutes, while paying using any currency they want and logistics enterally handled by QUIK team. \r\n\nOn the other side, powering business with QUIK Pro, giving them a complete set of software to manage their business and online presence, with their own website, inventory management, logistics solutions, all in perfect sync with QUIK Super App, increasing sales and customer satisfaction.",
    "activity_status": "Active",
    "website": "https://quikpago.com",
    "founded_date": 2021.0,
    "team_size": 35.0,
    "location": "Maracaibo, Venezuela",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:marketplace; industry:saas; industry:delivery",
    "founders": [
        {
            "name": "Alejandro Flores-Hernandez, Founder",
            "description": "Alejandro is a mechanical engineer by education and a system engineer by heart. First working for over 10 years as a Field Service Engineer installing Gas Turbines around the world for General Electric, Rolls-Royce and Siemens. After the pandemic and with the help of a great team, decided to build QUIK. QUIK aims to be the easiest way to buy online in LatAm, becoming the operating system for all kind of business.",
            "linkedin": "https://www.linkedin.com/in/alejandro-flores-hern%C3%A1ndez-604635b/"
        },
        {
            "name": "Mauricio Martínez, Founder",
            "description": "I'm a Graphic Designer, Art Director, Marketer and Proyect Manager with 10 years of professional experience.",
            "linkedin": "https://www.linkedin.com/feed/"
        }
    ],
    "status": true,
    "generated_description": "**Company Overview: QUIK**\n\nFounded in 2021, QUIK is on a mission to build the operating system for business in Latin America (LATAM). Hailing from Maracaibo, Venezuela, this innovative startup is part of the prestigious Y Combinator Batch W22 and has quickly established itself in the business landscape of the region. With a tight-knit team of 35 employees, QUIK is focusing on transforming how businesses and consumers interact, particularly in the realms of service delivery and business management.\n\n**What Does QUIK Do?**\n\nQUIK operates on two fronts, effectively tackling both consumer and business needs. \n\n1. **QUIK Super App**: This is where consumers become the focus. The QUIK Super App allows users to order food, groceries, and other goods with incredible speed—delivering items within 30 minutes. The app also offers the flexibility of payment in multiple currencies, making it accessible to a broader audience. All logistics for these deliveries are seamlessly handled by the QUIK team, ensuring efficiency and reliability that customers can trust.\n\n2. **QUIK Pro**: On the business side, QUIK Pro provides a comprehensive software suite designed to empower local businesses. It includes tools for managing online presence with custom websites, inventory management systems, and logistics solutions. This software is in sync with the QUIK Super App, allowing businesses to increase their sales and enhance customer satisfaction by streamlining operations.\n\n**Market Position and Tags**\n\nQUIK sits at the intersection of three vital sectors: marketplace, SaaS (Software as a Service), and delivery. This combination positions them uniquely to address the needs of both consumers and businesses within a rapidly evolving market.\n\n**Conclusion**\n\nWith a clear vision and a robust offering, QUIK is not just a service provider; it's a key player in shaping the future of business operations in LATAM. As the region continues to modernize and digitalize, QUIK stands ready to be at the forefront, helping both consumers and enterprises thrive in a dynamic marketplace. \n\nFor more information, visit [QUIK's website](https://quikpago.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/17e3b20dd69f50a5ed4c4fe6ed2d742bf6a396cf.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191702Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=fceea4ca5bcca8773e616fd93a5b571daba32219e328e7bcfc94055d74a76a95",
    "social_links": [
        "https://twitter.com/quikpago"
    ],
    "logo_path": "data/logos\\QUIK_logo.png"
}