{
    "links": "https://www.ycombinator.com/companies/quotabook",
    "name": "QuotaBook",
    "headline": "Equity management platform for startups and investors.",
    "batch": "W21",
    "description": "Founded in 2019 by ex-VCs, Quotabook is a fintech startup building equity management solutions for startups, employees and investors. With Quotabook, founders can streamline equity data and company ownership by managing cap tables as well as running analyses and simulations. Employees are better motivated through stock option features that are aligned with the growth of the company. Investors can track performance of their portfolios with data automatically synced into the platform. Quotabook takes care of all the fuss so that founders, employees and investors can focus on building a business together. \r\n\nWe are proud to be a startup helping fellow startups boost growth. Find out more about how we simplify equity management for startups around the globe from https://www.quotabook.com/en/",
    "activity_status": "Active",
    "website": "https://www.quotabook.com/en",
    "founded_date": 2019.0,
    "team_size": 50.0,
    "location": "South Korea",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:saas; industry:b2b",
    "founders": [
        {
            "name": "Andy Choi, Founder",
            "description": "Andy is the CEO and co-founder of QuotaBook. Previously, he was a software engineer in Silicon Valley and a VC in Korea.",
            "linkedin": "https://www.linkedin.com/in/andy-choi"
        }
    ],
    "status": true,
    "generated_description": "**QuotaBook Overview**\n\nFounded in 2019 by a group of former venture capitalists, QuotaBook is a fintech startup that has emerged as a crucial player in the realm of equity management. Imagine a tool that simplifies the complex world of startup equity for founders, employees, and investors alike—that's QuotaBook.\n\nTheir mission? To streamline equity management processes, making it seamless for startups and their stakeholders to focus on what really matters: growth and collaboration. With QuotaBook, founders can effortlessly manage their cap tables and run various analyses to understand ownership dynamics better. This clarity not only empowers the founders but also keeps employees motivated, as they can partake in stock options that align their success with the company's growth.\n\nInvestors benefit too, thanks to QuotaBook’s automated syncing feature that allows them to monitor their portfolio performance with ease. Essentially, QuotaBook takes care of the intricate details, allowing everyone involved to concentrate on building a successful business.\n\nBased out of South Korea and a proud participant in the Y Combinator Batch W21, QuotaBook currently boasts a team of 50 dedicated professionals. They're tagged as a blend of “fintech,” “SaaS,” and “B2B,” which should give you an idea of their market niche. With QuotaBook, you’re not just getting a product; you’re getting a partner that understands the startup ecosystem and is committed to making equity management simpler and more efficient.\n\nIf you're curious to learn more about their solutions and how they can help your startup thrive, you can check out their website at [QuotaBook](https://www.quotabook.com/en).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/3ff421fa966a9d995bedb19ff296a1b15c3eb19e.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191702Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=6bebada6175397b6c5cc77d609bbe4cc8f6b856344578b5df7e9fb1909e5e0d5",
    "social_links": [
        "http://linkedin.com/company/quotabook",
        "https://twitter.com/quotabook",
        "https://www.facebook.com/quotabook1",
        "https://github.com/quotabook"
    ],
    "logo_path": "data/logos\\QuotaBook_logo.png"
}