{
    "links": "https://www.ycombinator.com/companies/qvin",
    "name": "Qvin",
    "headline": "Empowering women. Period.",
    "batch": "W16",
    "description": "Qvin is the first and only healthcare service to scientifically prove menstrual blood can test for critical health information – just like a traditional laboratory blood test.\r\n\nWomen's health has always been under-prioritized in science. We still operate in a world built by men, for men. It’s why in 2014, Dr. Sara Naseri and Søren Therkelsen started Qvin to research, develop, and patent a product that powers an underserved and understudied population—women.\r\n\nOver 70% of the decisions our doctors make are influenced by blood test results.  Every month, 1.8 billion people across the world menstruate. However, the blood our bodies naturally deliver every month has never been explored as a testing source. And yet, menstrual blood has been left unexplored.\r\n\nQvin is the first and only healthcare service to use period blood as a non-invasive blood test. We exist to give women an easy, insightful way to monitor existing health issues, proactively screen for others, and go into doctor visits more informed and confident of their own health.\r\n\nOur health technology platform helps women manage their health better through a non-invasive blood collection device named the Q-Pad™.\r\n\nAll of us at Qvin want to move the study of women forward. We want to close the gender data gap. And we stand for every person who identifies with women, however they define it.",
    "activity_status": "Active",
    "website": "https://qvin.com/",
    "founded_date": 2014.0,
    "team_size": 30.0,
    "location": "Menlo Park, CA",
    "group_partner": "Jared Friedman",
    "group_partner_yc": "https://www.ycombinator.com/people/jared-friedman",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:ai-powered-drug-discovery; industry:consumer-health-services; industry:telemedicine; location:san-francisco-bay-area",
    "founders": [],
    "status": true,
    "generated_description": "**Company Overview: Qvin**\n\n**Mission:** Empowering women. Period.\n\nFounded in 2014 by Dr. Sara Naseri and Søren Therkelsen, Qvin is revolutionizing the healthcare landscape by focusing on women’s health—a field long undervalued in medical research. Operating out of Menlo Park, California, and part of Y Combinator's Batch W16, Qvin is tackling the gender data gap in health studies, aiming to give women the autonomy and insights they deserve about their health.\n\n**Innovative Approach:**  \nQvin is the first healthcare service to scientifically validate that menstrual blood can provide critical health information through testing, much like traditional blood tests. With 1.8 billion individuals menstruating globally each month, this innovation offers a significant leap in how we understand and manage women’s health.\n\nTheir flagship product, the **Q-Pad™**, is designed as a non-invasive alternative to traditional blood collection methods. This FDA-cleared menstrual pad allows users to collect their menstrual blood comfortably and send it to a certified lab for analysis—turning what was once seen as waste into a valuable health resource. \n\n**Current Offerings:**  \nQvin has focused its early efforts on the **HbA1c test**, which measures average blood sugar levels, helping women monitor their health effectively from the comfort of their homes. The company has plans to expand its testing capabilities to include additional biomarkers relevant to women's health, such as thyroid function and fertility indicators.\n\n**Team and Community:**  \nWith a team of 30 passionate individuals and Jared Friedman as their Group Partner, Qvin is more than a tech startup; it is a movement pushing for inclusive health innovation. They aim to create a community around female empowerment and health education, ensuring that all people who menstruate can advocate for their health with the right tools and knowledge.\n\n**Conclusion:**  \nQvin is changing the narrative around women’s health, actively working to make menstrual blood a key player in diagnostic testing. With their unique approach and commitment to empowering women, they are poised to make a lasting impact in healthcare. For more information, visit their website at [Qvin](https://qvin.com/).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/87e61dd5f3e39a67aec24788fb25eed7e7351429.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191702Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=411b168d431e52ad6708155ba1c0646b6774349e9987098ff24b5d3486fc4c57",
    "social_links": [
        "https://www.linkedin.com/company/qvin/",
        "https://twitter.com/weareqvin/",
        "https://www.facebook.com/WeAreQvin"
    ],
    "logo_path": "data/logos\\Qvin_logo.png"
}