{
    "links": "https://www.ycombinator.com/companies/railbird",
    "name": "Railbird",
    "headline": "A futures market for events.",
    "batch": "W22",
    "description": "At Railbird, we are building a prediction market exchange designed to hedge and mitigate risk for the services sector. The Railbird team has years of experience analyzing companies in the service sector and has seen firsthand how little opportunity there is to hedge risk in volatile markets like hospitality, tourism, recreation, entertainment, and sports. The platform is designed to be open to all traders.",
    "activity_status": "Active",
    "website": "https://www.railbirdexchange.com/",
    "founded_date": 2021.0,
    "team_size": 8.0,
    "location": "New York",
    "group_partner": "Dalton Caldwell",
    "group_partner_yc": "https://www.ycombinator.com/people/dalton-caldwell",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:marketplace; location:new-york",
    "founders": [
        {
            "name": "Miles Saffran, Founder",
            "description": "Miles is the co-founder and CEO of Railbird Technologies Inc.\n\nPrior to founding Railbird, Miles was an investment research analyst at Point72 covering the fintech and gaming sectors. Before that, he was a data scientist at the Orlando Magic, where he built machine learning models to assist with scouting and in-game play.\n\nHe received a B.S. in Computer Science from Yale University.",
            "linkedin": "https://www.linkedin.com/in/miles-saffran/"
        },
        {
            "name": "Edward Tian, Founder",
            "description": "Eddie is the co-founder and COO of Railbird Technologies Inc.\n\nPrior to founding Railbird, Eddie was an investment research analyst at Point72 covering the fintech, internet, and business services sectors. He is passionate about technology, capital markets, and sports. His sports of choice are soccer and basketball.\n\nHe received a B.A. in Mathematics-Statistics and Financial Economics from Columbia University.",
            "linkedin": "https://www.linkedin.com/in/edward-tian-a74139bb"
        }
    ],
    "status": true,
    "generated_description": "Railbird is carving out a unique space in the financial landscape with its innovative approach to predicting market trends. Founded in 2021 and hailing from New York, Railbird is a predictive market exchange aimed at creating a futures market for events—think of it as a place where you can bet on the likelihood of various outcomes, from sports results to weather forecasts.\n\nAt a glance, Railbird is addressing a tangible gap in the market, particularly for the services sector, such as hospitality and tourism, where businesses face significant volatility and lack viable options to hedge their risks. The team behind Railbird brings a wealth of experience in analyzing these industries, understanding the complexities and demands of operating within them. \n\nWhat sets Railbird apart is its pending regulatory approval to operate as a CFTC-regulated derivatives exchange. This means heightened consumer protection and a trustworthy trading environment once they officially launch—expected later this year.\n\nThe platform is designed for accessibility, open to all traders over the age of 18, whether they are individuals or businesses. Users can engage in buying and selling contracts that reflect their predictions on future events, making it a powerful tool for managing and mitigating risk.\n\nWith a lean team of eight and backed by Dalton Caldwell from Y Combinator Batch W22, Railbird is positioned to make waves in the fintech and marketplace sectors. They are all about creating a user-friendly interface, allowing traders to act on insights flexibly and intuitively. \n\nSo, if you’ve got a knack for foreseeing trends and you want to put your predictions to the test, joining Railbird’s platform could be an intriguing opportunity. Catch them while they're still building momentum—this is one company you might want to keep an eye on. \n\nFor more information, check out their website: [Railbird Exchange](https://www.railbirdexchange.com/).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/59253337ec0a5e1a95de12971fb9c90e83f40c82.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191707Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=42cc8ba8d0a5935a2b79483bcb5ab97c9ef73bf75d7fa7c1b40214a5531f6e20",
    "social_links": [
        "https://www.linkedin.com/company/railbird/",
        "https://twitter.com/railbirdxchange",
        "https://www.facebook.com/Railbird.Technologies"
    ],
    "logo_path": "data/logos\\Railbird_logo.png"
}