{
    "links": "https://www.ycombinator.com/companies/rarebird",
    "name": "Rarebird",
    "headline": "Elevating mental health to be a part of your daily coffee ritual.",
    "batch": "S20",
    "description": "We are making coffee for caffeine sensitive people. We do this by producing the world's first caffeine replacement, paraxanthine. It's better than caffeine at waking you up and causes fewer side effects, like anxiety and jitteriness.",
    "activity_status": "Active",
    "website": "http://www.rarebird.coffee",
    "founded_date": 2020.0,
    "team_size": 5.0,
    "location": "San Leandro, CA",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Jeffrey Dietrich, Founder",
            "description": "Jeffrey Dietrich received his Ph.D. in BioEngineering from UC-Berkeley working in Jay Keasling’s lab to develop new biomanufacturing technologies. Jeffrey then co-founded and was CTO at Lygos (YC W16), which raised over $40MM in equity financing and $10MM in Federal awards to commercialize industrial biochemicals. He has also served on advisory boards for Department of Energy- and National Science Foundation-backed institutions and is an inventor on 17 patents or patent applications.",
            "linkedin": "https://www.linkedin.com/in/jeffreydietrich"
        }
    ],
    "status": true,
    "generated_description": "**Rarebird: Turning Coffee on Its Head**\n\nFounded in 2020 and hailing from the vibrant San Leandro, California, Rarebird is upending the coffee game. Imagine waking up to a cup of coffee that doesn’t make you jittery, anxious, or disrupt your sleep. That’s the mission here: to elevate mental health and coffee culture hand-in-hand. With a nod to wellness enthusiasts, they're introducing Px coffee—a revolutionary caffeine replacement that claims to be better than caffeine itself.\n\nRarebird's story began with a simple realization: caffeine, while effective in boosting alertness, often comes with some undesired baggage. Enter paraxanthine (Px), the primary metabolite of caffeine that your body naturally produces. Rarebird has harnessed this concept to create a unique product that retains coffee's comforting ritual while cutting out the jitters.\n\nWith an expert-supported approach, they have meticulously developed this product, backed by the National Science Foundation. Their Px coffee is made from Colombian Arabica beans processed in a way that preserves flavors while being kinder to your body.\n\nThe team is small but mighty, consisting of just five dedicated employees. As part of Y Combinator's S20 batch, they've gained traction and visibility, drawing interest from various media like Forbes and Perfect Daily Grind. Their goal? To make Px coffee an integral part of your daily routine—right alongside your morning ritual.\n\nCurrently, Rarebird offers a range of options, including ground coffee and single-serve pods. The beauty of Px is that it promises to energize without the negative consequences typically associated with traditional caffeine. Brewed just like any regular coffee, it caters to both convenience lovers and those who enjoy a good pour-over.\n\nThe company is steadily building a brand that aligns itself with a growing preference for wellness-focused products. If you think about it, a cup of Rarebird coffee might just be the antidote for those who want their caffeine fix without the complications. So why not try it? You might be surprised to find a little buzz without the BS.\n\nFor more information, visit [rarebird.coffee](http://www.rarebird.coffee).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/ca1d229c58b6459202f29abc9b5c5e567aad58ee.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191707Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=e3a790a438174c502c35f11fefac572d28a7e13eec4da860318023ecede251f9",
    "social_links": [
        "https://linkedin.com/company/revel-technologies-inc"
    ],
    "logo_path": "data/logos\\Rarebird_logo.png"
}