{
    "links": "https://www.ycombinator.com/companies/rastro",
    "name": "Rastro",
    "headline": "AI personal shopper for home goods",
    "batch": "S24",
    "description": "Rastro is a personal shopper for home decor. Our AI agents find you products from any retailer on the internet: we aim to build Perplexity for shopping. Built by ex-Shopify AI engineers, we're doing $25k monthly GMV with 15% margins.\r\n\nDecorating your home can cost tens of thousands for an interior designer, or involve hours of scrolling retailer sites. Tell Rastro about your vision, and send our agents to source for you. Receive dozens of products in minutes. Our agents understand your taste, and their picks convert 10 times better than classic e-commerce search. \r\n\nUnder the hood, we're building general purpose agents capable of sourcing products matching your taste and constraints from any retailer on the internet. Our algorithms consider images and descriptions, as well as product style, materials, brand and location.",
    "activity_status": "Active",
    "website": "https://rastro.sh",
    "founded_date": 2024.0,
    "team_size": 3.0,
    "location": "San Francisco",
    "group_partner": "Tom Blomfield",
    "group_partner_yc": "https://www.ycombinator.com/people/tom-blomfield",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:consumer; industry:retail-tech; industry:retail; industry:ai; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Baptiste Cumin, Founder",
            "description": "CEO @ Rastro: AI personal shopper for home goods. Previously built Shopify's search + recommendations for 6 years as a Staff AI Engineer.",
            "linkedin": "https://www.linkedin.com/in/baptiste-cumin/"
        },
        {
            "name": "Augustin Baudoin, Founder",
            "description": "COO @ Rastro: AI personal shopper for home goods.\n\nPreviously Ops @ Uber and DS @ Criteo / French Gov.",
            "linkedin": "https://www.linkedin.com/in/augustin-baudoin/"
        },
        {
            "name": "Papa Sougou Wele, Founder",
            "description": "CTO @ Rastro, AI personal shopper for home goods. Previously Backend engineer at Zapper and Shopify.",
            "linkedin": "https://www.linkedin.com/in/papiswele/"
        }
    ],
    "status": true,
    "generated_description": "**Company Overview: Rastro**\n\nFounded in 2024 and operating out of San Francisco, Rastro is on a mission to revolutionize how we shop for home goods. It's an innovative AI-powered personal shopper focused on home decor, allowing customers to avoid the time-consuming task of rifling through countless online retailers. With a small but competent team of three, Rastro is already generating around $25,000 in monthly gross merchandise volume (GMV) with an impressive 15% profit margin.\n\nThe company was birthed from the minds of former Shopify AI engineers, who envisioned a platform that could aggregate products from across the internet based on individual tastes. Rastro aims for nothing less than to become the \"Perplexity for shopping\"—a reference to how they enhance the searching process through intelligent and personalized recommendations.\n\n**How It Works**\n\nHere's how Rastro operates in four streamlined steps:\n\n1. **Connect with the Design Team:** Customers start by booking a quick 10-minute call with Rastro's design experts. This is where they discuss their vision and preferences while sharing images of their space.\n   \n2. **Product Sourcing:** Rastro’s AI agents then comb through over 40 different retailer sites to find unique home decor items that match the customer's style and budget.\n\n3. **Product Selection:** Once the AI has curated a list of matching products, they’re sent directly to the customer's inbox for review. Customers can choose what appeals to them from this curated selection.\n\n4. **Delivery:** Products are shipped directly to the customer's door without additional costs. Rastro earns money through referrals and partnerships, making it a free service for users.\n\n**Market Potential**\n\nGiven that hiring an interior designer can cost thousands, Rastro presents a much more affordable option for consumers wanting stylish home decor. Their AI-driven approach has shown to convert at rates ten times higher than traditional e-commerce searches, making for a compelling case for both individual users and potential investors.\n\nCurrently part of Y Combinator's Batch S24, Rastro is tagged under consumer tech, retail-tech, and AI, indicating its growth potential in the expansive market of home goods.\n\nThe company is backed by significant expertise in AI and e-commerce, with figures like Tom Blomfield as a Group Partner. With its blend of innovative technology and user-centric design, Rastro is positioned to not just provide products, but to curate an experience. \n\nTo learn more about their offerings or to start your personalized shopping journey, you can visit their [website](https://rastro.sh).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/54236ec314ab0cc4ef1de0a22752b7c02ef434d3.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191707Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=a94ef096a36bcfebf3a6a21b99ee924904f4914c77078b5c5242a94aa9c69a7c",
    "social_links": [
        "https://www.linkedin.com/company/101692605",
        "https://x.com/rastroai"
    ],
    "logo_path": "data/logos\\Rastro_logo.png"
}