{
    "links": "https://www.ycombinator.com/companies/razorpay",
    "name": "Razorpay",
    "headline": "India's only full-stack financial solutions company for businesses.",
    "batch": "W15",
    "description": "The journey of building Razorpay started in 2014, when Harshil Mathur (CEO & Co-Founder) and Shashank Kumar (MD & Co-Founder) witnessed the dismal state of the online payments industry in India then and understood that they have a larger and more important issue to solve. And That was democratizing online payments for Indian businesses, particularly the underserved market, Startups and SMEs. Over the last 9 years, Razorpay has evolved from a single-product company to a multi-product company, from an online payment gateway to India’s only full-stack financial solutions company, offering payments and banking solutions to businesses.  Razorpay today is transforming age-old complexities and changing every known paradigm of money movement for disruptive businesses.\r\n\nOver the last couple of years, Razorpay’s growth has evolved to be an index of India’s digital economy. From a kirana shop in Kashmir collecting payments on our POS device to a textile exporter in Kanyakumari accepting dollars through our International Payments product, Razorpay has revolutionised how businesses have traditionally transacted and interacted with money. \r\n\nRazorpay became the first and only Indian fintech to build a full-stack international Payment Gateway ‘Curlec by Razorpay’ and evolved into a comprehensive provider of payment solutions, leveraging the synergy between cutting-edge technological capabilities and a profound understanding of the local payment ecosystem. The introduction of the new Curlec Payment Gateway aims to cater to a wide spectrum of businesses, expanding its reach to over 5,000 establishments. \r\n\nBe it for international expansion or solving for Indian businesses, for Razorpay, the customer has always been at the core of all disruption, from addressing evolving needs to delivering new solutions. This hyperfocus helped bring Razorpay’s several industry-first innovations into the market since 2014. Razorpay became the first to launch a completely digital on-boarding process for startups, first to launch support for UPI, first to launch support for Bharath QR, first to introduce recurring payments for businesses through Razorpay Route, automating payment receipts and later automate payouts and making the entire process seamless and optimized and many more were introduced aling the way. Other firsts include: - First to launch India’s Multi-Network Tokenisation solution, TokenHQ - Razorpay became India’s first payment gateway to support credit cards on UPI - Razorpay also became India’s largest omnichannel payment gateway for businesses post acquiring Ezetap which is India’s leading offline POS company that was founded with the aim to simplify the in-person offline payments experience.\r\n\nOver the years, Razorpay’s valuation has jumped from $1 billion to $7.5 billion and has added a host of marquee investors to its captable. Razorpay is also the second Indian company to be a part of Silicon Valley’s largest tech accelerator, Y Combinator. Marquee investors such as Lone Pine Capital, Alkeon Capital, TCV, GIC, Tiger Global, Sequoia Capital India, Ribbit Capital, Matrix Partners, Salesforce Ventures, Y Combinator, and MasterCard have invested a total of $741.5 Mn through Series A, B, C, D, E and F funding. The last financing round of Series F led the company’s valuation to $7.5 Billion signaling one of the fastest increases in valuation for an Indian Unicorn. \r\n\nRazorpay has also made acquisitions with like-minded companies over the last 9 years. In total, till date, Razorpay has made eight acquisitions, Billme in 2023 - A Digital invoice and customer Engagement, Ezetap in 2022 - India’s leading offline POS company, PoshVine in 2022 - India’s leading loyalty and reward management platform, IZealiant in 2022 - A mobile-first, API-enabled, and cloud-ready payment solution and made its first international foray in South-East Asia by announcing its acquisition of Curlec in 2022 - A recurring payments platform. TeraFin Labs in 2021 - the AI-based SaaS platform that facilitates digital financing solutions, Opfin (Now RazorpayX Payroll) in 2019 -  The payroll management solution and Thirdwatch in 2019, the first acquisition - The AI-powered fraud detection platform.\r\n\nAll these efforts are being done in collaboration with banks, regulators, and stakeholders so that India can build a better place for small and big businesses. Today, Razorpay powers online payments for 76 Of 100 startup unicorns and millions of businesses in India. The core premise of what Razorpay was founded in 2014 and what it is today hasn’t changed. It is to make money movement simpler and easier, whether it is for businesses to receive money, send money, or manage money.",
    "activity_status": "Active",
    "website": "https://razorpay.com",
    "founded_date": 2014.0,
    "team_size": 2700.0,
    "location": "Bengaluru, India",
    "group_partner": "Dalton Caldwell",
    "group_partner_yc": "https://www.ycombinator.com/people/dalton-caldwell",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:banking-as-a-service; industry:fintech; industry:payments; industry:india",
    "founders": [],
    "status": true,
    "generated_description": "**Razorpay: Simplifying Financial Solutions for Indian Businesses**\n\nFounded in 2014 by Harshil Mathur and Shashank Kumar, Razorpay emerged from a vision to make online payments accessible and seamless for Indian businesses, especially for startups and SMEs that were previously underserved. Initially starting as a payment gateway, Razorpay has grown into India's only full-stack financial solutions company, offering a comprehensive suite covering payments, banking, payroll, and more.\n\n**Key Milestones:**\n- From a single product launch, Razorpay has expanded its offerings to more than 100 payment methods, including groundbreaking firsts like support for UPI and recurring payments.\n- It became the first Indian fintech to establish a full-stack international payment gateway, “Curlec by Razorpay,” catering to over 5,000 establishments.\n- The company’s rapid growth mirrors that of India's digital economy, with current operations supporting 76 of the 100 startup unicorns in the nation.\n\n**Valuation and Expansion:**\nRazorpay's impressive ascent in value—from $1 billion at its Series D funding to $7.5 billion following its Series F—has attracted prominent investors like Tiger Global and Sequoia Capital India. Additionally, it’s noteworthy that Razorpay is part of Y Combinator's Batch W15, a testament to its innovative ethos.\n\n**Innovations and Solutions:**\nRazorpay prides itself on continuous disruption in financial services. With features like Razorpay Route for automated payment receipts, TokenHQ for multi-network tokenization, and the ability to process international payments, it consistently aims to simplify money movement. The company has made eight strategic acquisitions to enhance its service portfolio, including fintechs focusing on payroll and digital invoicing.\n\n**Team and Culture:** \nOperating from Bengaluru with a team of 2,700 employees, Razorpay emphasizes a tech-driven and customer-centric culture, striving to keep the needs of the business at the forefront of all innovations. \n\n**Conclusion:**\nUltimately, Razorpay’s mission is straightforward: to simplify the complexities of financial transactions for all types of businesses, making receiving, sending, and managing money an intuitive experience. The company continues to explore new frontiers in fintech, enhancing the financial landscape of India one innovation at a time. \n\nFor more information, you can visit their website at [razorpay.com](https://razorpay.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/48a842c412c82e39ae5685642d749cd23e014c1a.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191708Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=7c7f9a7768e9ef379439712424d072df3da391c72f1c9139df14706212b19921",
    "social_links": [
        "https://www.linkedin.com/company/razorpay/",
        "https://twitter.com/razorpay",
        "https://facebook.com/razorpay",
        "https://www.crunchbase.com/organization/razorpay",
        "https://github.com/razorpay"
    ],
    "logo_path": "data/logos\\Razorpay_logo.png"
}