{
    "links": "https://www.ycombinator.com/companies/reactwise",
    "name": "ReactWise",
    "headline": "AI Co-Pilot for Chemical Process Optimization",
    "batch": "S24",
    "description": "Our Mission: \r\nWe aim to accelerate and automate chemical process development by equipping wet-lab chemists with the power of data-driven optimization and robotic execution of experiments.\r\n\nThe Problem: \r\nThe discovery of novel pharmaceuticals is one of our most important weapons in fighting disease. However, the drug development pipeline is often held up for many months during the design of chemical processes to manufacture these drugs at scale, delaying FDA trials and lengthening the time until drug launch. Designing chemical processes involves the identification of suitable parameters such as catalyst/temperature/solvent. Currently process development is often done via tedious trial-and-error experimentation (slow) or exhaustive screening (expensive and wasteful).\r\n\nOur Approach: \r\nIn our research, we have developed algorithms for chemical process optimization, which leverage transfer learning and Bayesian optimization. We validated the algorithms in the wet lab, showing an up to 95% reduction in required experiments and cost compared to exhaustive screening. We have made our approaches accessible to chemists through our user-friendly no-code software platform and to automated laboratory equipment with our API.",
    "activity_status": "Active",
    "website": "https://www.reactwise.com/",
    "founded_date": 2024.0,
    "team_size": 2.0,
    "location": "San Francisco",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Alexander Pomberger, Founder",
            "description": "Alexander holds a PhD in chemical engineering, and has been working at the intersection of machine learning, chemistry and lab automation for the past 5 years. In his research, Alexander developed optimization algorithms to aid in designing manufacturing processes for novel pharmaceuticals. Alexander launched ReactWise to democratize access to AI in pharma & biotech with no-code software.",
            "linkedin": "https://linkedin.com/in/apomberger"
        },
        {
            "name": "Daniel Wigh, Founder",
            "description": "Daniel holds a PhD in chemical engineering, and has been working at the intersection of machine learning and chemistry for the past 5 years. In his research, Daniel developed optimization algorithms to aid in designing manufacturing processes for novel pharmaceuticals. Daniel launched ReactWise to democratize access to AI in pharma & biotech with no-code software.",
            "linkedin": "https://linkedin.com/in/daniel-wigh"
        }
    ],
    "status": true,
    "generated_description": "**ReactWise: The AI Co-Pilot for Chemical Process Optimization**\n\nFounded in 2024 and part of Y Combinator's Batch S24, ReactWise is a San Francisco-based startup on a mission to revolutionize the drug development process. It offers an innovative AI-powered platform designed specifically for wet-lab chemists, facilitating the optimization of chemical processes through data-driven methodologies and robotic experiment execution.\n\n### The Problem\nEvery day, pharmaceutical companies grapple with delays in drug development, not due to a lack of innovation, but because the process of designing chemical processes is slow, expensive, and often wasteful. Identifying the right parameters—like catalysts, temperature, and solvent—typically involves tedious trial-and-error or exhaustive screening methods that can take months. This inertia not only impacts the timelines for FDA trials but also hinders the launch of potential life-saving drugs.\n\n### How ReactWise Solves It\nEnter ReactWise. The team has developed cutting-edge algorithms leveraging transfer learning and Bayesian optimization, which have been validated in real lab conditions. Their results are impressive: they've achieved up to a 95% reduction in the number of required experiments and costs compared to traditional exhaustive screening methods. This functionality is wrapped in a no-code software platform, making it accessible for chemists without a deep technical background, and is complemented by an API for integration with automated lab equipment.\n\n### What They Offer\nReactWise has several key functionalities:\n- **Predict**: Build predictive models to determine chemical reaction outcomes quickly.\n- **Automate**: Seamlessly connect with laboratory equipment to enhance workflow efficiency.\n- **Insights**: Analyze data to unveil hidden patterns and trends, driving better decision-making.\n- **Collaborate**: Foster teamwork through shared dashboards and real-time data access.\n\nIn an industry that desperately needs efficiency, ReactWise makes it possible to accelerate the optimization journey, often cutting down the time to implementation to just 30 minutes. \n\n### The Team\nWith a compact team of two and a strong backing from Y Combinator, ReactWise is strategically positioned to embrace challenges that larger companies might take on with cumbersome processes. Their collaboration with notable partners—including the University of Cambridge and Technical University of Munich—enhances their credibility and reach.\n\n### The Future\nFor those looking to bring a transformative change to how chemical processes are optimized—and do so with the support of an expert system—ReactWise presents a compelling solution. Whether you’re a researcher in a pharmaceutical company or a member of a lab team, this platform might just be the AI co-pilot you need.\n\nCheck out their website at [ReactWise](https://www.reactwise.com) to learn more or to book a demo. The future of drug development is here, and it's automated.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/0e31bc5980f2278d214cb8025386251682f6c9ce.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191709Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=6c170b476e186f32d505851c005d9c4ef03aff7ff5580c860bc7cb013c9b5923",
    "social_links": [
        "https://www.linkedin.com/company/reactwise"
    ],
    "logo_path": "data/logos\\ReactWise_logo.png"
}