{
    "links": "https://www.ycombinator.com/companies/read-bean",
    "name": "Read Bean",
    "headline": "Learn language with real-world content, at your level",
    "batch": "S23",
    "description": "Read Bean helps intermediate-advanced Chinese learners and heritage speakers improve their literacy using real-world content. The app measures your initial reading level and automatically transforms texts into bite-sized lessons at your level. It adapts to your progress, reinforcing vocabulary and tailoring content to ensure continuous improvement.",
    "activity_status": "Active",
    "website": "https://readbean.app/",
    "founded_date": 2023.0,
    "team_size": 3.0,
    "location": "San Francisco",
    "group_partner": "Diana Hu",
    "group_partner_yc": "https://www.ycombinator.com/people/diana-hu",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:ai-enhanced-learning; industry:education; industry:elearning; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Maggie Zhang, Founder",
            "description": "CEO at Read Bean. Studied CS @ MIT and previously bootstrapped an e-comm business to 200k followers, quant traded at virtu, built software at bloomberg, and was in management consulting at bain.",
            "linkedin": "https://linkedin.com/in/maggiezhang84"
        },
        {
            "name": "Pearl Li, Founder",
            "description": "CTO of Read Bean, studied CS at MIT. First line of code at 10, optimized LLM performance at Facebook AI Research.",
            "linkedin": "https://linkedin.com/in/pearlli98"
        },
        {
            "name": "Savannah Liu, Founder",
            "description": "COO at Read Bean. Built a payment pipeline at Amazon that did $2B in TPV and made a security layer at Flatiron health.",
            "linkedin": "https://linkedin.com/in/savannah-liu-291674197"
        }
    ],
    "status": true,
    "generated_description": "**Read Bean: Summary**\n\n**Company Overview**  \nFounded in 2023, Read Bean is a promising educational startup located in the heart of San Francisco, part of Y Combinator's Batch S23. The company is small but nimble, operational with a dedicated team of three employees, including Group Partner, Diana Hu. Read Bean is focused on leveraging technology for immersive and personal language learning experiences.\n\n**Mission Statement**  \nRead Bean's mission is straightforward yet impactful: to empower learners to achieve fluency in Chinese through engaging, real-world content that adapts to their individual progress. This focus on personalized learning is at the core of their approach, exemplifying their commitment to accessibility in language education.\n\n**Product and Features**  \nThe Read Bean app is designed specifically for intermediate to advanced Chinese learners and heritage speakers. Its standout feature is a smart assessment tool that measures users’ reading levels upon joining. Based on this data, the app transforms authentic texts into bite-sized lessons tailored to the learner's abilities, gradually introducing new vocabulary and context. This dynamic, AI-enhanced approach ensures continuous engagement and improvement, moving beyond traditional rote learning methods.\n\n**User Experience**  \nRead Bean's design merges functionality with user engagement, showcasing daily tasks and a library filled with content suitable for various proficiency levels. Users receive personalized readings every day, fostering not just language skills, but also a deeper understanding of Chinese culture and context through historical and contemporary narratives.\n\n**Market Position**  \nIn a crowded eLearning space, Read Bean is carving out a niche marked by depth rather than breadth. Their commitment to real, usable language learning is resonating with users, eliciting positive testimonials. Many learners have attested to the app’s effectiveness, noting substantial improvements in their reading within just a week of use, leading some to abandon other popular language apps.\n\n**Outlook and Conclusion**  \nAs language learning becomes increasingly digital and personalized, Read Bean stands out as an innovative solution that addresses the unique needs of its users. With promising early feedback and a clear mission, the company is well-positioned for growth in the evolving edtech landscape.\n\nFor more information, check out their website: [Read Bean](https://readbean.app/).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/d8584a94cc76c39349f096365e04192e9f7ef111.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191709Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=beff86150fb4014b84371eee59384b0c68f59419c00680a1c40e213c18b454cf",
    "social_links": [
        "https://www.linkedin.com/company/read-bean",
        "https://x.com/readbeanAI"
    ],
    "logo_path": "data/logos\\Read_Bean_logo.png"
}