{
    "links": "https://www.ycombinator.com/companies/ready-education",
    "name": "Ready Education",
    "headline": "Ready Education is building the mobile OS for higher education. Weâ\u0080¦",
    "batch": "S16",
    "description": "Student engagement and persistence pose a significant challenge in higher education. \r\n\nReady Education, the preferred choice of over 350 higher ed institutions, offers custom mobile app solutions that enable colleges and universities to personalize the student experience and support engagement.\r\n\nOur mission is to make college a successful journey for every student.\r\n\nThe Ready Education platform is designed to support student success by unifying campus resources â\u0080\u0093 LMS, co-curricular, athletics, clubs/orgs, events and many more â\u0080\u0093 within a branded, integrated, college app. By adopting the  Ready Education platform, administrators are able to track student engagement, get immediate feedback, and send targeted content to their students.\r\n\nClear communication between a student and their institution is crucial when it comes to having a positive higher learning experience. Going mobile bridges this communication gap, connecting hundreds of thousands of students with their administrators, their campus, and most importantly, their peers, both on and off campus. For more information, visit www.oohlalamobile.com.",
    "activity_status": "Active",
    "website": "https://www.readyeducation.com",
    "founded_date": null,
    "team_size": 54.0,
    "location": "Montreal, Canada",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:education",
    "founders": [
        {
            "name": "Alice Dinu",
            "description": "I'm a Customer-Centric Co-Founder of the largest international Ed-Tech mobile platform, Ready Education that I've successfully exited. Ready Education is an international company serving over 700 institutions and 7 million students. I have over ten years of experience in customer success, data strategy, product-market fit, and M&A processes. She built and scaled B2B and B2C user acquisition and retention strategies for 400 Educational institutions across 4 million students.",
            "linkedin": "https://ca.linkedin.com/in/alice-dinu-b214011b"
        },
        {
            "name": "James Dang",
            "description": null,
            "linkedin": "https://linkedin.com/in/james-dang-4ab61b26"
        },
        {
            "name": "Danial Jameel",
            "description": null,
            "linkedin": "https://linkedin.com/in/danialj"
        }
    ],
    "status": true,
    "generated_description": "**Ready Education: The Mobile OS for Higher Education**\n\nStarted as a solution to the persistent challenges of student engagement in higher education, Ready Education has evolved into a robust mobile platform that unifies various campus resources—think Learning Management Systems (LMS), athletics, clubs, events, and more—into a personalized college app. This is not just about going mobile; it's about creating a seamless student experience that fosters engagement and connection.\n\nLocated in Montreal, Canada, and part of Y Combinator's S16 batch, Ready Education caters to over 350 higher education institutions, helping them enhance the college experience for hundreds of thousands of students. Their platform enables administrators to track engagement, send targeted communications, and gather immediate feedback, all essential for nurturing a vibrant campus culture.\n\nThe mission is clear: to ensure every student’s journey through college is successful. By fostering clear communication between students and their institutions, Ready Education bridges gaps and builds communities, making education more accessible and engaging.\n\n### What They Offer\n\nReady Education's platform is a one-stop solution for various challenges faced by students and administrators alike. They focus on:\n\n- **Strengthening Student Engagement**: Encouraging participation through tailored events, gamification, and a unique points-based system to track achievements.\n- **Supporting Academic Success**: Offering a centralized hub where students can manage everything from classes to extracurricular activities, keeping them organized and informed.\n- **Fostering Community and Belonging**: Creating spaces for students to connect, share ideas, and engage through forums and chat features.\n- **Streamlining Communications**: Centralizing the way students receive information, ensuring they get what they need, when they need it.\n- **Optimizing Operations**: Automating processes to reduce administrative workload and enhance the overall efficiency of campus operations.\n\n### The Impact\n\nUniversities using Ready Education have reported remarkable outcomes—like a 41.6% spike in group membership and over 22,000 events promoted shortly after implementation. Such metrics highlight the platform's power in transforming the educational experience.\n\n### Who They Are\n\nWith a team of 54 dedicated employees, Ready Education operates primarily in the education space, aiming to redefine how students interact with their campuses. Their commitment to improving the student experience is evident in their continuous efforts to adapt and grow alongside the needs of academic institutions.\n\n### Get In Touch\n\nIf you're looking to improve communication and engagement within your institution, Ready Education could be the solution. Visit [Ready Education](https://www.readyeducation.com) for more information and see how they can help enhance the college journey for your students.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/87e008b04d9ae907af0d66983bbcfb55fd2e6c09.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191709Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=a2a35b95b7dee453778b995326d9d47734f48c1a1ab5f85636a0c967fdd36a6b",
    "social_links": [
        "https://www.crunchbase.com/organization/oohlala-mobile"
    ],
    "logo_path": "data/logos\\Ready_Education_logo.png"
}