{
    "links": "https://www.ycombinator.com/companies/readme",
    "name": "ReadMe",
    "headline": "Beautiful, personalized, interactive developer hubs",
    "batch": "W15",
    "description": "ReadMe provides every company the ability to easily create beautiful documentation, and build loyal, productive developer communities.\r\n\nWith ReadMe, build developer portals that combine support, tutorials, topical guides and API exploration. ReadMe makes it trivial to keep docs up-to-date and has community oriented features that help drive adoption.\r\n\nWanna see what it'd look like to work at ReadMe? Our careers page takes a stab at it! https://readme.com/careers",
    "activity_status": "Active",
    "website": "http://readme.com",
    "founded_date": 2015.0,
    "team_size": 52.0,
    "location": "San Francisco",
    "group_partner": "Michael Seibel",
    "group_partner_yc": "https://www.ycombinator.com/people/michael-seibel",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:developer-tools; industry:design-tools; location:san-francisco-bay-area",
    "founders": [],
    "status": true,
    "generated_description": "**Company Overview: ReadMe**\n\nFounded in 2015 and hailing from the esteemed Y Combinator Batch W15, ReadMe is on a mission to create beautiful, personalized, and interactive developer hubs. Located in San Francisco, their lean yet formidable team of 52 employees is dedicated to reshaping how companies deliver documentation and foster developer communities.\n\n**What They Do**\n\nInitially, ReadMe set out to empower companies with tools to craft stunning documentation, making it incredibly straightforward to maintain updated content. They've since evolved into a comprehensive solution for building developer portals. These portals seamlessly integrate support, tutorials, topical guides, and API exploration—essentially everything a developer might need to succeed.\n\nSupport is paramount in their offering. With community-driven features, ReadMe helps businesses drive adoption and build loyal, productive developer communities. This means that whether teams are working on documentation or coding integrations, the experience can be both collaborative and effective.\n\n**Why It Matters**\n\nDevelopers thrive on clear, accessible documentation, and ReadMe excels at delivering just that. Their platform is designed to help users easily navigate through docs, find relevant tutorials, and explore APIs without frustration. The clarity and efficiency that ReadMe brings to documentation not only enhances developer satisfaction but also significantly bolsters the overall adoption of technologies.\n\n**Current Pursuits and Engagements**\n\nReadMe's commitment to innovation is evident in their continuous rollout of new features. Their offerings include capabilities like Git-backed documentation, reusable content, and AI-powered search. They empower developers with \"Try It\" functionality that allows for testing API calls directly within the documentation—making the first interaction as smooth as possible.\n\nFor those interested in being part of this transformative journey, ReadMe has a dedicated careers page to showcase what it's like to work within their dynamic team.\n\n**Conclusion**\n\nIn a tech landscape that's always on the move, ReadMe stands out for its focus on building beautiful, interactive, and community-oriented documentation tools. With a solid foundation and a clear vision, they are poised to continue shaping the way developers and companies interact through well-crafted content.\n\nFor more information, visit [ReadMe](http://readme.com), or check out their [careers page](https://readme.com/careers) to see how you can contribute to their mission.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/3e5eb5fb62a7ee0260f47285d1343af2fd07b721.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191709Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=2fac9742304d3a5068b4199c8e361a71aa5a5149abc17e7d1c4552865a226343",
    "social_links": [
        "https://www.linkedin.com/company/readme-io/",
        "https://twitter.com/readme",
        "https://www.crunchbase.com/organization/readme-io"
    ],
    "logo_path": "data/logos\\ReadMe_logo.png"
}