{
    "links": "https://www.ycombinator.com/companies/readworks",
    "name": "ReadWorks",
    "headline": null,
    "batch": "IK12",
    "description": "ReadWorks offers free, research-based, classroom-proven lessons and online training to help K-6 teachers explicitly teach the component skills and strategies of reading comprehension, while also supporting the much needed development of background knowledge and vocabulary.",
    "activity_status": "Active",
    "website": "http://www.readworks.org/",
    "founded_date": null,
    "team_size": 11.0,
    "location": "New York",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "location:new-york",
    "founders": [],
    "status": true,
    "generated_description": "### ReadWorks: Empowering Reading Comprehension\n\n**Overview**\nReadWorks is a pioneering educational nonprofit based in New York, dedicated to improving reading comprehension among K-6 students. The site offers a library of over 5,600 texts and resources designed to help educators explicitly teach reading skills, background knowledge, and vocabulary development.\n\n**Mission**\nReadWorks aims to ensure that every district, school, and student, especially those in low-income communities, has access to high-quality educational resources. Their mission is anchored in the belief that every child deserves the opportunity to become a confident reader.\n\n**What They Do**\nFounded during a Y Combinator Batch focused on education (IK12), ReadWorks provides free, research-based lesson plans and online training tailored for teachers. Their tools are grounded in the latest reading science, focusing on essential comprehension strategies such as building background knowledge, expanding vocabularies, and enhancing strategic reading skills.\n\nEach year, ReadWorks reaches over 13.5 million students and teachers, offering a range of services including:\n- Comprehensive lesson plans\n- Curriculum alignments\n- Webinars\n- Teacher guides that can assist in differentiating instruction\n\nTheir approach is inclusive, tailored to support diverse learners, including English Language Learners (ELL) and students with special education needs.\n\n**Team and Structure**\nWith a compact team of 11 employees, ReadWorks operates efficiently to service a vast community of educators. The organization fosters partnerships with a range of institutions—from museums to universities—to enhance the quality and diversity of their content.\n\n**Core Values**\nReadWorks emphasizes accessibility, inclusivity, and quality in its operations, consistently striving for educational equity. Their resources are designed not just for academic success but to resonate with students' cultural and personal backgrounds—ensuring relevance in today's educational landscape.\n\n**Website and Community Feedback**\nEducators rave about ReadWorks for providing essential resources previously unavailable to their students. User testimonials highlight significant improvements in student engagement and reading proficiency as a result of utilizing ReadWorks materials.\n\nFor more information on their offerings and services, check out their website at [ReadWorks](http://www.readworks.org).\n\nIn a world where literacy can be a game-changer, ReadWorks is on a mission to make sure every child plays the game.",
    "logo": "/logos/medium/missing.png",
    "social_links": [
        "https://www.crunchbase.com/organization/readworks"
    ]
}