{
    "links": "https://www.ycombinator.com/companies/rebellyous-foods",
    "name": "Rebellyous Foods",
    "headline": "Rebellyous Foods is a food manufacturing technology and productionâ\u0080¦",
    "batch": "S18",
    "description": "Rebellyous Foods is a food manufacturing technology and production company defined solely to catapult meat alternative production toward price parity with animal-based meat.  Rebellyous implements novel food manufacturing equipment and processes in large-scale production to produce low-cost plant-based meat at high volumes.  These goals are achieved through uniquely designed food products, the use of high-throughput manufacturing automation and â\u0080\u0098smartâ\u0080\u0099 production centers, and the development and utilization of new innovative low-energy manufacturing tools.  Working closely with industry partners, Rebellyous makes plant-based meat sustainable, affordable, and widely available.",
    "activity_status": "Active",
    "website": "https://rebellyous.com/",
    "founded_date": 2017.0,
    "team_size": 12.0,
    "location": "Seattle, WA",
    "group_partner": "Gustaf Alstromer",
    "group_partner_yc": "https://www.ycombinator.com/people/gustaf-alstromer",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:climate; industry:plant-based-meat; location:seattle",
    "founders": [
        {
            "name": "Christie Lagally, Founder/CEO",
            "description": "Christie Lagally is the founder/CEO of Rebellyous Foods. Rebellyous is building a novel manufacturing stack for efficient plant-based meat production to make delicious, juicy & affordable plant-based chicken products. Christie is a former Boeing engineer with nearly 20 years of engineering experience and holds 5 patents in manufacturing technology. Rebellyous designs new equipment for making plant-based meat that is more cost effective, higher quality, and capable of scaling to meet huge demand.",
            "linkedin": "https://www.linkedin.com/in/christie-lagally-875b9a4/"
        }
    ],
    "status": true,
    "generated_description": "### Rebellyous Foods: A Pioneer in Plant-Based Meat\n\n**Overview**\nFounded in 2017 and situated in Seattle, WA, Rebellyous Foods is on a mission to revolutionize the food industry by creating affordable, high-quality plant-based meat products that can compete with traditional animal-based meats. As an innovative food manufacturing technology company, they leverage cutting-edge automation and specialized production equipment to scale their operations, aiming for price parity with conventional meat.\n\n**Objective**\nRebellyous Foods exists to make plant-based meat not just a niche product but a staple that is sustainable, delicious, and widely accessible. They achieve this through:\n\n- High-throughput manufacturing automation.\n- Smart production centers that optimize energy and efficiency.\n- Collaboration with industry partners to enhance distribution and sustainability.\n\n**Team**\nThe Rebellyous team is small but mighty, consisting of 12 dedicated employees. Their approach is driven by an aerospace engineer who applies principles from the aerospace industry to innovate animal-free chicken products.\n\n**Products**\nThe company specializes in a range of plant-based chicken items—nuggets, patties, and tenders—that are designed to meet the taste and texture expectations of chicken lovers while being kinder to animals and the planet. They emphasize that their offerings are made “with love, care, and no birds.”\n\n**Community Engagement**\nRebellyous is proactive about engaging with schools and food service providers, offering resources and recipes to promote plant-based eating in various contexts. They aim to educate and inspire a movement towards a more sustainable food system.\n\n**Where to Find Them**\nCurious about their products or want to learn more? Check out their website at [Rebellyous Foods](https://rebellyous.com/) for detailed information about their offerings, technology, and mission.\n\n**Key Elements**\n- **Founded:** 2017, Y Combinator Batch S18\n- **Location:** Seattle, WA\n- **Team Size:** 12 employees\n- **Tagline:** “No Harm. No Fowl.®”\n- **Focus Areas:** Climate action, plant-based meat innovation, accessibility\n\n**Market Position**\nRebellyous Foods is not just another player in the plant-based sector; they’re positioned as a leader, actively engineering the future of meat production to be more aligned with environmental sustainability and consumer needs.\n\nIn summary, Rebellyous Foods is carving a niche in an increasingly important market—where the intersection of food technology, climate consciousness, and animal welfare meets innovation. Their mission is simple yet profound: make plant-based meat a delicious, affordable choice for everyone.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/cbd94ed72d802dfe3acdebf6126da6c0b1d27018.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191710Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=c3a294b770aee56cbcb0c2fd0701c3eb9237284db357e62a7f89ce13c8908d4a",
    "social_links": [
        "https://www.linkedin.com/company/rebellyousfoods/",
        "https://twitter.com/RebellyousFoods",
        "https://www.facebook.com/RebellyousFoods/"
    ],
    "logo_path": "data/logos\\Rebellyous_Foods_logo.png"
}