{
    "links": "https://www.ycombinator.com/companies/rebill",
    "name": "Rebill",
    "headline": "Payments and subscriptions platform for Latin America",
    "batch": "W22",
    "description": "Payments and subscriptions platform for digital businesses and global companies scaling in Latin America\r\n\nWith our platform and API, companies can integrate over 100 local payment methods from the region, including cards, bank transfers, cash, and even wallets. In addition, they always receive the best human support with fair pricing and utmost transparency, enabling them to scale across the region 10 times faster.",
    "activity_status": "Active",
    "website": "https://www.rebill.com",
    "founded_date": 2020.0,
    "team_size": 15.0,
    "location": "Buenos Aires, Argentina",
    "group_partner": "Michael Seibel",
    "group_partner_yc": "https://www.ycombinator.com/people/michael-seibel",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:saas; industry:payments; industry:b2b; industry:subscriptions",
    "founders": [
        {
            "name": "Nahuel Candia, Founder",
            "description": "Nahuel is a Cloud Solutions Architect with over 8 years of experience in different roles within the Tech Industry, ranging from developer to product manager up to startup founder. Certified in Disciplined Entrepreneurship and New Ventures by the Massachusetts Institute of Technology (MIT), and currently Founder of Rebill, the most powerful payments orchestration solution for multinationals in Latin America.",
            "linkedin": "https://www.linkedin.com/in/nahuelcandia/"
        },
        {
            "name": "Ariel Diaz Ailan, Founder",
            "description": "Ariel has over 10 years of experience in the tech industry and currently serves as the co-founder and COO of Rebill.com, a payment and subscription platform tailored to digital businesses and global companies expanding in Latin America.",
            "linkedin": "https://www.linkedin.com/in/diazailan"
        }
    ],
    "status": true,
    "generated_description": "### Rebill: Revolutionizing Payments in Latin America\n\nFounded in 2020 and operating out of Buenos Aires, Argentina, Rebill is a payments and subscription platform designed specifically for the Latin American market. Emerging from the Y Combinator Batch W22, Rebill has set its sights on maximizing the potential of digital businesses and global companies as they scale within this diverse region.\n\n#### Mission and Services\n\nRebill's mission is straightforward: to accelerate business success in Latin America through a robust payment system. The platform offers a powerful API that integrates over 100 local payment methods, including credit cards, bank transfers, cash, and digital wallets. This extensive suite of options ensures that companies can cater to the unique preferences of consumers throughout Latin America, allowing them to operate with agility and transparency—potentially scaling their operations ten times faster than traditional methods.\n\nBut Rebill isn’t just another payment processor. What stands out is their commitment to customer service. With a dedicated team of 15 employees, they provide real human support to their clients, ensuring that businesses have the assistance they need when navigating local payment complexities. \n\n#### Key Features\n\n- **Diverse Payment Methods**: Companies can accept cards, digital wallets, and even cash payments without the hassle of setting up local entities.\n- **Flexible Billing Options**: Rebill offers a range of billing methods, including usage-based and per-seat billing, which allow businesses to optimize their revenue streams.\n- **High Approval Rates**: By utilizing Rebill's transparent exchange rates and local insights, businesses can experience a significant increase in payment approval rates, sometimes exceeding 20%.\n\n#### Market Position and Growth\n\nTargeting various industries including SaaS, e-commerce, healthtech, and edtech, Rebill recognizes the unique needs of each sector, tailoring its offerings accordingly. The company operates in multiple countries including Brazil, Mexico, Colombia, Argentina, Chile, and Peru, making it a vital partner for any business looking to thrive in the Latin American market.\n\n#### Why Rebill?\n\nThe testimonials from their client base reflect an impressive track record of reliability and service quality. Businesses have highlighted how Rebill enables them to maintain their branding at every interaction while tapping into local payment solutions that truly resonate with customers.\n\nIf your company is ready to take on the Latin American market, Rebill might just be the partner you’ve been looking for—combining innovative technology with a customer-first approach to revolutionize the way you handle payments. It’s about making the complex simple and empowering your business to grow. \n\nTo explore their offerings, visit [Rebill's website](https://www.rebill.com) and see how they can help you navigate the rich landscape of Latin American payments.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/992e14fc6f06c53a5e849573247560b447df6914.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191710Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=d7d77089a3447b3eb93381b572c2c0f6d7ae78bef783298491013abbd0bc965a",
    "social_links": [
        "https://www.linkedin.com/company/rebill",
        "https://twitter.com/rebillteam",
        "https://www.crunchbase.com/organization/rebill-inc"
    ],
    "logo_path": "data/logos\\Rebill_logo.png"
}