{
    "links": "https://www.ycombinator.com/companies/recover",
    "name": "Recover",
    "headline": "Government-funded online addiction treatment",
    "batch": "W21",
    "description": "Recover provides more effective and affordable addiction treatment via telemedicine. We partner with local governments to save lives and taxpayer dollars.\r\n\nMore than 20 million Americans struggle with addiction, but less than 10% of people who need it receive treatment. For those that do, it usually does not work - only 8% get better. Most of this treatment is funded by governments, and goes to programs that are frequently predatory, and focus more on profit than people.\r\n\nWe have created an effective, accessible, and affordable solution: Recover. We offer a proven approach using medication and counseling, that can improve outcomes for over 70% of patients. It reduces overdoses by 80%, death by 50%, and has years of research and application showing it works. \r\n\nDespite how effective this medication can be, most rehabs do not have medical professionals on staff. Not only does our program work better and bring medicine to addiction care, it also costs just 10% of traditional programs.\r\n\nNick founded Recover after seeing his family and friends struggle with addiction. He was raised by a drug addict, has an alcoholic brother, and lost an uncle to heroin. He saw how hard it is for people to get the treatment they need, and how ineffective existing options are. We are working to make sure that people like Nick’s family have access to best-in-class addiction treatment so they can get and stay well.",
    "activity_status": "Active",
    "website": "https://www.letsrecover.com",
    "founded_date": 2021.0,
    "team_size": 10.0,
    "location": null,
    "group_partner": "Michael Seibel",
    "group_partner_yc": "https://www.ycombinator.com/people/michael-seibel",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": null,
    "founders": [],
    "status": true,
    "generated_description": "**Recover: Revolutionizing Addiction Treatment**\n\nRecover is a game-changer in the field of addiction treatment, utilizing government funding to make its services accessible, effective, and affordable through telemedicine. Founded in 2021 by Nick, who has a personal connection to the struggles of addiction within his family, Recover stands on a mission to combat the staggering reality that over **20 million Americans** face substance use challenges. Alarmingly, less than **10%** of those in need actually receive treatment, and for the minority that do, the success rate hovers around a mere **8%**.\n\nThis is where Recover steps in. The company has crafted a more effective model that integrates medication and counseling, boasting improvement outcomes for over **70%** of its patients. The approach is backed by extensive research, showing that it can reduce overdoses by an impressive **80%** and mortality rates by **50%**. Unlike traditional rehab centers that often operate like businesses more focused on profit than people—lacking medical professionals—Recover ensures a comprehensive and compassionate care system.\n\nWhat sets Recover apart is not just its mission, but its innovative use of technology. Patients benefit from a seamless telehealth option, making treatment remarkably more accessible. You can enroll without a waiting list, receive same-day care, and utilize a service that costs just **10%** of traditional programs.\n\nLocated in an undisclosed area, Recover is a small but dedicated team of **10** employees, working under the mentorship of Group Partner Michael Seibel from Y Combinator Batch W21. They’re not just another startup; they’re part of a critical movement to ensure that treatment isn't just a privilege for the few, but a right for everyone who needs it.\n\nIf you or someone you know is facing addiction challenges and needs support, check out Recover’s website at [letsrecover.com](https://www.letsrecover.com). Together, we can fight addiction and make recovery accessible for all.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/a1af1d1ffb695e583187ec2b63eacc625e15bc16.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191711Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=e0887bf4aa8c6c0951894f387e7a6948e3f556e5cacd47a78d59f68214870083",
    "social_links": [
        "https://www.linkedin.com/company/letsrecover/"
    ],
    "logo_path": "data/logos\\Recover_logo.png"
}