{
    "links": "https://www.ycombinator.com/companies/recurrency",
    "name": "Recurrency",
    "headline": "Automated ERP for distributors.",
    "batch": "S20",
    "description": "Recurrency is reversing enterprise resource planning (ERP) stagnation by building the industry-standard ERP automation platform: blazingly fast and complete with powerful automation tools like intelligent sales recommendations, dynamic pricing, and demand forecasting. Despite distribution being a multi-trillion dollar industry, the legacy ERP systems that exist to help businesses manage their purchasing, inventory, sales, order processing, and accounting are decades behind. \r\n\nFor the most part, ERP systems are painfully slow, difficult to use, and soul-crushingly manual. Using Recurrency can boost a distributor’s revenue and profit margins, while reducing waste and saving time. Most importantly, Recurrency is fully integrated with the customer’s legacy system, so deploying Recurrency in production can be done in as little as one day.",
    "activity_status": "Active",
    "website": "http://www.recurrency.com",
    "founded_date": 2020.0,
    "team_size": 50.0,
    "location": "San Francisco",
    "group_partner": "Dalton Caldwell",
    "group_partner_yc": "https://www.ycombinator.com/people/dalton-caldwell",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:saas; industry:ai; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Sam Oshay, Founder",
            "description": "I'm building Recurrency!",
            "linkedin": "https://www.linkedin.com/in/soshay/"
        }
    ],
    "status": true,
    "generated_description": "### Recurrency\n\n**Mission:** To automate ERP for distributors.\n\nFounded in 2020 and based in San Francisco, Recurrency aims to revolutionize the distribution industry by tackling the inefficiencies of legacy enterprise resource planning (ERP) systems. These traditional systems are often slow, cumbersome, and require extensive manual input, which frustrates users trying to manage purchasing, inventory, sales, order processing, and accounting. Recurrency stands out by creating an ERP automation platform that is fast, user-friendly, and integrates seamlessly with existing systems—often in just a day. \n\nThe company's technology incorporates powerful automation tools like intelligent sales recommendations, dynamic pricing, and demand forecasting—features designed to increase revenue and profit margins while cutting down waste and saving valuable time for distributors.\n\n### Team and Foundation\nAs part of the Y Combinator Batch S20, Recurrency has rapidly grown to a team of 50 talented employees, led by Group Partner Dalton Caldwell. \n\n### Key Offerings\nRecurrency's key products streamline operations for distributors, enhancing various aspects of their business—from purchasing and demand planning to reporting and customer service. Here’s a closer look at what they offer:\n\n- **Demand Planning & Purchasing Automation:** Helps distributors efficiently manage inventory and purchasing cycles.\n- **Reporting Tools:** Provides insights into sales performance and business operations.\n- **AI-Driven Sales Recommendations:** Utilizes machine learning to suggest upsells and improve customers' shopping experiences.\n\n### Customer-Centric Approach\nTestimonials from users highlight Recurrency's ability to transform how sales teams operate. Customers report quicker access to information, enhanced sales capabilities, and an overall better experience compared to their previous systems.\n\n### Integration and Accessibility\nRecurrency can easily integrate with other ERP platforms, allowing businesses to transition smoothly without extensive downtime. The platform is mobile-accessible, giving sales teams the flexibility to work without being anchored to a desk.\n\n### Summary\nBy automating and modernizing ERP processes, Recurrency aims to empower distributors to thrive in a multi-trillion dollar industry that has long been bogged down by outdated technology. The result? Increased productivity, improved customer experiences, and ultimately, a boost in profitability. For more information, you can visit their official website at [Recurrency.com](http://www.recurrency.com).\n\nRecurrency is the solution for distributors looking to elevate their operational efficiency and become more competitive in today’s fast-paced market.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/651497d275983b8dfa9d8af765d471cfc46d0924.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191711Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=6ae9d2b991377f044437ad72a797c30ecbdf1b7ea8380e9b50c104943e6fff7f",
    "social_links": [
        "https://www.linkedin.com/company/recurrency",
        "https://twitter.com/recurrency",
        "https://www.facebook.com/recurrency",
        "https://github.com/recurrency"
    ],
    "logo_path": "data/logos\\Recurrency_logo.png"
}