{
    "links": "https://www.ycombinator.com/companies/recurse-center",
    "name": "Recurse Center",
    "headline": "The retreat where curious programmers recharge and grow",
    "batch": "S10",
    "description": "The Recurse Center is a self-directed, educational retreat for people who want to get better at programming, whether they've been programming for three decades or three months.\r\n\nThe retreat is free for all participants because we run an integrated recruiting agency and provide (optional) personalized recruiting services to anyone in our community considering a new job.",
    "activity_status": "Active",
    "website": "https://www.recurse.com",
    "founded_date": 2010.0,
    "team_size": 10.0,
    "location": "New York",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:education; industry:community; industry:recruiting; location:new-york",
    "founders": [],
    "status": true,
    "generated_description": "**Recurse Center: A Haven for Curious Programmers**\n\nFounded in 2010 and part of Y Combinator’s Batch S10, the Recurse Center (RC) is a unique educational retreat in New York City designed specifically for programmers seeking to hone their skills. Whether you're a seasoned coder or just starting out, RC invites you to recharge, grow, and work on projects that ignite your curiosity. \n\n### The Concept\nAt its core, Recurse Center operates on a simple but powerful premise: learning is personal and self-directed. The retreat spans six to twelve weeks, during which participants immerse themselves in coding—without the pressures of deadlines, grades, or performance metrics (think of it as a coding sabbatical). With a friendly environment and no formal curriculum, it allows developers from various backgrounds to collaborate, share insights, and support one another.\n\n### Cost and Support\nRemarkably, RC is free for all participants. This is possible because they run an integrated recruiting agency that offers optional personalized job placement services. This approach not only removes financial barriers but also fosters a community of cooperation rather than competition.\n\n### Community and Connection\nCurrently, the Recurse Center has a dedicated team of about ten employees and a vast network of over 2,600 alumni—each adding to the rich tapestry of support and collaboration. Participants benefit from 24/7 access to RC's Brooklyn hub, enabling them to work in a quiet and inspiring space or connect with peers from around the world.\n\n### Career Perks\nThe Recurse Center is also a strategic stepping stone for those seeking new opportunities post-retreat. The Career Services team takes a personal approach, matching participants with companies and roles that align with their goals and values. Additionally, friendly alumni are on hand to provide mock interview practice, enhancing the chances of landing a job that fits.\n\n### A Commitment to Diversity\nRC is especially committed to inclusivity and has invested over $1.7 million in living expense grants to underrepresented groups in tech. They have worked hard to create a welcoming atmosphere where everyone can thrive, regardless of their background.\n\n### In Their Words\nParticipants have echoed their experiences, calling RC a \"magical place\" and a \"transformational\" retreat for both personal and professional development. As Andrew Kelley, creator of Zig, stated: “It’s rare to find such dedicated people who genuinely believe in a cause.”\n\n### Explore More\nIf you're curious to learn more about the Recurse Center or considering applying, you can visit their website at [Recurse Center](https://www.recurse.com). There, you’ll find a wealth of resources about their approach, the application process, and insights from current and former participants.\n\nIn a world where coding often becomes a solitary endeavor, the Recurse Center stands out as a collaborative sanctuary. If you're looking to get better at programming while being supported by a community of like-minded individuals, this could be the retreat for you.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/628648b1c5b274276acf39c2bb945e25bc97d33c.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191711Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=c80f32cb3f91a3516e55b62f99124d304cb9a92cf2657e0f07664100a5577936",
    "social_links": [
        "https://www.linkedin.com/company/recurse-center/",
        "https://www.twitter.com/recursecenter",
        "https://github.com/recursecenter"
    ],
    "logo_path": "data/logos\\Recurse_Center_logo.png"
}