{
    "links": "https://www.ycombinator.com/companies/redcliffe-lifetech",
    "name": "Redcliffe Lifetech",
    "headline": "Redcliffe Labs is India's Largest Omni-channel Diagnostics platform",
    "batch": "W21",
    "description": "Redcliffe Labs (a unit of Redcliffe Lifetech Inc) provides diagnostics with a comprehensive portfolio approach both with routine and specialised test menus with advanced testing labs all over India. Its digital first approach with on-demand 1-hour home collection and same day report is disrupting the way diagnostics is delivered today and thus is the fastest growing in India. \r\n\nRedcliffe Labs is providing 3500+ tests across its wide network of labs and collection centres. The company has served about millions of Indians and is processing more than 250K+ test parameters daily. The test portfolio is very wide including routine pathology tests, advanced genetic screening, research-based DNA tests in reproductive health, cancer and wellness/fitness. The easy to interpret smart reports provide key health check-points, which can help in diagnosing and treating both chronic and acute diseases on time. Redcliffe Labs has pioneered Drone technology adoption in the diagnostic sector by opening up the first commercial corridor from Uttarkashi to Dehradun. The company currently has 30+ labs and 700+ authorised collection centres in more than 120 cities across India. \r\n\nRedcliffe's vision is to provide world-class diagnostic services to people across the Indian sub-continent in an affordable manner.",
    "activity_status": "Active",
    "website": "http://redcliffelabs.com",
    "founded_date": 2018.0,
    "team_size": 3500.0,
    "location": "Delhi, India",
    "group_partner": "Jared Friedman",
    "group_partner_yc": "https://www.ycombinator.com/people/jared-friedman",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:consumer-health-services; industry:health-tech; industry:digital-health; industry:healthcare; industry:diagnostics",
    "founders": [
        {
            "name": "Dheeraj Jain, Founder",
            "description": "15 years of corp strategy and M&A, buyout global experience in Tech/Telecom/Health, 5 years of early stage investments, built successful women health D2C company (#1 fem hygiene brand in India), successful exits in Cancer Big Data, etc. Last 4 years only focused around improving health outcomes for Indian families using wide arrange new technologies, genomics, IVF treatments, etc. Met my co-founders at Redcliffe 8 years back and we realised this is our future.",
            "linkedin": "https://uk.linkedin.com/in/dheeraj-jain-4961352?challengeId=AQH_WYMY17jvTwAAAXS3lCwds9CeWzZFXmNa0rbrRI3rRN8kXGMEC0pvIfSICzj96-geUzT3XtlBn6n_bIUh6K0VOr4uUoBmBQ&submissionId=34695f9f-3036-3716-7fcf-56686be03875"
        },
        {
            "name": "Aditya Kandoi, Founder",
            "description": "Aditya Kandoi was in consulting roles with Deloitte, Barclays, American Express in health and built health tech ventures in the past. He is passionate around women health and have depth in Indian Healthcare market with deep focus on Health-tech, his other strengths are around Digital Health operations.",
            "linkedin": "https://www.linkedin.com/in/adityakandoi/"
        }
    ],
    "status": true,
    "generated_description": "**Company Overview: Redcliffe Lifetech**\n\nFounded in 2018 and based in Delhi, India, Redcliffe Lifetech—initially known as Redcliffe Labs—has rapidly established itself as India’s leading omni-channel diagnostics platform. With a strong team of about 3,500 employees, the company operates over 30 labs and 700 authorized collection centers across more than 120 cities, making diagnostic services accessible to millions of Indians.\n\n**Mission & Vision**\n\nRedcliffe Lifetech aims to revolutionize healthcare diagnostics by offering world-class services that are affordable and easily accessible. Their mission is straightforward: to provide timely, high-quality diagnostics to improve health outcomes for everyone across the Indian subcontinent.\n\n**Innovative Approach to Diagnostics**\n\nRedcliffe Labs is at the forefront of redefining diagnostics through a digital-first, consumer-oriented approach. They offer more than 3,500 tests, including routine pathology, advanced genetic screenings, and specialized tests for reproductive health, cancer, and wellness. Notably, they provide a unique one-hour home sample collection and same-day reporting, a game-changer in the healthcare landscape. They proudly process over 250,000 test parameters each day.\n\nIn a notable leap for the sector, Redcliffe Labs pioneered the use of drone technology for sample collection, having launched India’s first commercial corridor for drone logistics between Uttarkashi and Dehradun. This not only enhances efficiency but also expands their reach into remote areas.\n\n**User-Friendly Services**\n\nRedcliffe has made accessing health packages straightforward. Patients can easily book tests online, upload prescriptions, or select from doctor-curated health checkup packages. The reports generated are designed to be easy to interpret, highlighting key health indicators that empower patients to make informed health decisions.\n\n**Key Offerings**\n\nRedcliffe Labs offers a diverse range of packages, including:\n\n- Comprehensive Full Body Check-ups\n- Specialized tests for Diabetes, Heart, Thyroid, and Cancer screenings\n- Targeted packages for various demographics, including fertility and antenatal care\n\nThey regularly provide promotions, driving down costs dramatically; for example, a Fit India Full Body Checkup can be booked for as low as ₹1,099, a significant discount from its original price.\n\n**Partnerships and Support**\n\nThe company is part of the Y Combinator Batch W21, further securing its position in the competitive health-tech landscape. Jared Friedman serves as their Group Partner, supporting their innovative ventures.\n\nIn summary, Redcliffe Lifetech is not just another healthcare provider; it is a pioneering force looking to disrupt the diagnostics industry in India. With cutting-edge technology, an extensive service portfolio, and a commitment to affordability, they are making a significant impact on public health accessibility. For more information, visit their website: [Redcliffe Labs](http://redcliffelabs.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/23cb9a660c3a14cb8ab1a27d01d8e3a148194c35.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191712Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=4f50ec91d8a1df29eb8979a7697188fb91dc7155244ce389f8e776a6e080ba44",
    "social_links": [
        "https://www.linkedin.com/company/redcliffe-labs/",
        "https://twitter.com/redcliffelab",
        "https://www.facebook.com/RedcliffeLabs/"
    ],
    "logo_path": "data/logos\\Redcliffe_Lifetech_logo.png"
}