{
    "links": "https://www.ycombinator.com/companies/reebee",
    "name": "Reebee",
    "headline": "Flyer app.",
    "batch": "S13",
    "description": "Reebee is the best way to browse and distribute flyers. \n\nThe reebee mobile application makes it easy for customers to browse and discover local flyers, stay organized with an integrated shopping list, search products and much more. \n\nAvailable for free in Canada on the Apple App Store, Google Play, and BlackBerry World. \n\nReebee specializes in targeted flyer distribution, engaging the consumer audience through a rich mobile experience.\n\nDigital distribution not only fills in the voids of physical distribution, but it also reaches a new audience with distinctly measurable results. Track consumer buying signals like never before.",
    "activity_status": "Active",
    "website": "http://reebee.com",
    "founded_date": null,
    "team_size": 11.0,
    "location": "Kitchener, Canada",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:travel",
    "founders": [
        {
            "name": "Tobiasz Dankiewicz",
            "description": "Co-founded reebee in 2012, exited in 2022. Interested in building marketplaces and technologies that improve peoples lives.",
            "linkedin": "https://linkedin.com/in/tobiaszdankiewicz"
        },
        {
            "name": "Michal Martyniak",
            "description": null,
            "linkedin": null
        }
    ],
    "status": true,
    "generated_description": "**Reebee Overview**\n\nReebee is a Canadian company based in Kitchener, specializing in targeted digital flyer distribution through its mobile app. Initially launched with the promise of being “the best way to browse and distribute flyers,” Reebee has evolved into a rich platform that enhances the shopping experience.\n\n**Mission and Offerings**\n\nThe backbone of Reebee’s offering is its app, which enables users to easily browse local flyers, stay organized with an integrated shopping list, and search for products. Think of it as your digital guide for navigating the world of shopping flyers and savings. With Reebee, you not only find deals, but you can also track consumer buying signals in a way that traditional physical flyers simply can't match. This digital shift expands the reach of flyer distribution while providing measurable results for users and businesses alike.\n\n**Accessibility and Availability**\n\nReebee’s app is available for free on major platforms including the Apple App Store, Google Play, and BlackBerry World, making it accessible to a wide array of users across Canada. As consumers increasingly turn to their mobile devices for shopping, Reebee stands as a modern solution for deal-seekers.\n\n**Team and Background**\n\nFounded in 2013 and part of Y Combinator’s S13 batch, Reebee operates with a nimble team of 11 employees. Their innovative approach to digital distribution allows them to tap into the potential audience that traditional flyers miss out on.\n\nIn the competitive marketplace of shopping apps, Reebee focuses on creating an engaging mobile experience that not only serves consumers but also assists retailers in reaching their target audience effectively.\n\n**Conclusion**\n\nWhether you're a bargain hunter or someone looking to streamline your shopping list, Reebee has the tools to help you save time and money. Their focus on digital innovation is not just a reaction to current trends but a strategic move towards a more connected shopping experience. For more information, visit [Reebee’s website](http://reebee.com).",
    "logo": "/logos/medium/missing.png",
    "social_links": [
        "https://www.crunchbase.com/organization/reebee"
    ]
}