{
    "links": "https://www.ycombinator.com/companies/reforged-labs",
    "name": "Reforged Labs",
    "headline": "The world's first AI copilot built for mobile game marketers",
    "batch": "W22",
    "description": "Reforged Labs empowers game studios to supercharge their performance marketing. Our AI copilot, the first platform built for mobile game marketing, enables UA managers to achieve results 5x faster and 10x cheaper.\r\n\nBy analyzing thousands of top-performing ads, our platform uncovers what makes an ad effective. Backed by real-world data, it transforms how UA managers brainstorm ideas, create video ads, and launch high-performing campaigns - delivering a competitive edge in the evolving gaming industry.\r\n\nWith Reforged Labs, you don’t just keep up with trends - you set them.",
    "activity_status": "Active",
    "website": "https://reforgedlabs.com/",
    "founded_date": 2021.0,
    "team_size": 10.0,
    "location": "San Francisco",
    "group_partner": "Dalton Caldwell",
    "group_partner_yc": "https://www.ycombinator.com/people/dalton-caldwell",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:generative-ai; industry:b2b; industry:gaming; industry:advertising; industry:ai; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Robert Huynh, Founder",
            "description": "Robert is the co-founder and CEO of Reforged Labs. Previously, he was at some of the world's largest tech companies (X the moonshot lab/Google/Microsoft) before starting his MBA at Harvard Business School.",
            "linkedin": "https://www.linkedin.com/in/huynhrobert/"
        }
    ],
    "status": true,
    "generated_description": "**Reforged Labs: Revolutionizing Mobile Game Marketing with AI**\n\nFounded in 2021 and a part of Y Combinator’s W22 batch, Reforged Labs is based in San Francisco and has a compact team of ten passionate individuals. Their mission is clear: **to create the world’s first AI copilot specifically designed for mobile game marketers**. Sounds ambitious? It is. But they’re making significant strides—enabling user acquisition (UA) managers to boost their marketing game five times faster and at a fraction of the cost.\n\nAt the heart of Reforged Labs is **Boa**, an AI-powered assistant that takes the grunt work out of ad creation. By analyzing thousands of successful ads, Boa helps UA managers brainstorm ideas, craft high-impact video ads, and launch campaigns that consistently perform better. This isn’t just about keeping up with industry trends; it’s about setting them and redefining the rules of the game. \n\nThe stats are telling. Users of their platform report an impressive **27% average increase in return on ad spend (ROAS)** and a **30% bump in click-through rates (CTR)**. Meanwhile, the process of onboarding and making decisions is 5.5 times faster. With over 250 high-performing videos analyzed, the platform continuously learns and adapts, optimizing campaigns with minimal hands-on management.\n\nReforged Labs aims to show gaming studios that they not only *can* compete but *should* innovate boldly. As they put it, their technology \"unlocks your full marketing potential.\" This kind of confidence drives a change that many marketers have awaited, while also making their operations increasingly efficient.\n\nWith the trend towards generative AI on the rise, partnering with Reforged Labs means you’re not just adopting a tool; you’re gaining an AI team that’s constantly evolving to meet your business needs. Not convinced? Their clients are speaking up, highlighting how the combination of creativity and AI is transforming their metrics and business outcomes.\n\nIf you’re intrigued or just want to see how it works, you can **[book a demo here](https://reforgedlabs.com/)</contact>**. Whether you’re a mobile game studio looking to enhance your marketing approach or simply interested in what the future holds for advertising in gaming, Reforged Labs is carving a notable path in this dynamic industry.\n\nFor more details, check out their website: [Reforged Labs](https://reforgedlabs.com/).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/7a1d38b341ab15a043dfbeecc5451595f0ed905b.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191712Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=0102c35bab9551a72e16f8bd0039138ec8e1284359b2f568deaeaf6c865b179d",
    "social_links": [
        "https://www.linkedin.com/company/reforged-labs",
        "https://www.crunchbase.com/organization/reforged-labs"
    ],
    "logo_path": "data/logos\\Reforged_Labs_logo.png"
}