{
    "links": "https://www.ycombinator.com/companies/regent",
    "name": "REGENT",
    "headline": "All-electric seagliders for fast, affordable regional transportation",
    "batch": "W21",
    "description": "REGENT is building a new mode of transportation that will redefine regional mobility by mid-decade. Their first product, the seaglider, is an all-electric, hydrofoiling boat-plane that operates within a wingspan of the water's surface.  By flying low on a cushion of air, seagliders unlock the ability to fly twice as far as an electric aircraft, while being regulated by maritime authorities enabling market entry for a fraction of the cost.\r\n\nREGENT has de-risked seaglider technology with a ¼-scale, 400 lb, flying demonstration vehicle and a full-scale wing test section. By 2024, REGENT will fly humans on the first full-scale prototype seaglider.  By mid-decade, REGENT’s customers - airlines and ferry companies – will begin commercial seaglider service on the 12-seat initial product.\r\n\nIn just two years, REGENT has accumulated $8B in provisional orders (including firm deposits) proving the potential of the $25B+ initial market. \r\n\nREGENT, a team of 40, is led by MIT-trained, ex-Boeing engineers Billy Thalheimer and Mike Klinker.  REGENT has raised $50M to date from the likes of Thiel Capital, Founders Fund, Mark Cuban, Y Combinator, and includes strategic investment from Japan Airlines, Hawaiian Airlines and Mesa Airlines.",
    "activity_status": "Active",
    "website": "http://regentcraft.com",
    "founded_date": 2020.0,
    "team_size": 40.0,
    "location": "North Kingstown, RI",
    "group_partner": "Brad Flora",
    "group_partner_yc": "https://www.ycombinator.com/people/brad-flora",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:climate; industry:electric-vehicles; industry:aerospace; industry:maritime",
    "founders": [
        {
            "name": "Billy Thalheimer, Founder",
            "description": "Billy is an aerospace business leader and multidisciplinary engineer with expertise spanning aviation entrepreneurship and novel aircraft development. \n\nAt Aurora Flight Sciences, Billy led execution and BD for next-gen aircraft programs. Holding a BS/MS from MIT in aerospace engineering, he also led flight physics modeling for Boeing's electric air taxi, and authored their custom aircraft design code.\n\nAs a passionate aerospace nerd, Billy spends his free time competing as an aerobatic pilot.",
            "linkedin": "https://www.linkedin.com/in/williamthalheimer/"
        },
        {
            "name": "Michael Klinker, Founder",
            "description": "Aviation runs in Mike’s blood--he received his Bachelors and Masters degrees from MIT focused on aircraft controls and autonomy, is an avid pilot, and loves any vehicle that flies or floats. Mike spent years at Airware, Raptor Maps, MIT Lincoln Labs, and Aurora Flight Sciences designing and operating innovative vehicles.  Mike has built and written control software for over a dozen aircraft, and brings his advanced flight controls and abundant flight test experience to REGENT as its CTO.",
            "linkedin": "https://www.linkedin.com/in/michael-klinker-85a1a989/"
        }
    ],
    "status": true,
    "generated_description": "**Company Overview: REGENT**\n\n**Founded:** 2020  \n**Location:** North Kingstown, RI  \n**Team Size:** 40 employees  \n**Founders:** Billy Thalheimer and Mike Klinker (both MIT-trained ex-Boeing engineers)  \n**Funding:** $50M from investors including Thiel Capital, Founders Fund, Y Combinator, and backing from airlines like Japan Airlines and Hawaiian Airlines.  \n**Provisional Orders:** $8B in orders from airlines and ferry companies, with a potential market exceeding $25B.  \n**Batch:** Y Combinator Batch W21\n\n---\n\n**Mission:**\nREGENT is set on revolutionizing regional transportation with all-electric seagliders, aiming for fast, reliable, and affordable access to coastal routes. \n\n**Product: Seaglider**\nTheir flagship product, the seaglider, is an all-electric, hydrofoiling vehicle designed to operate close to the water's surface. This allows it to fly twice as far as traditional electric aircraft, while benefiting from maritime regulations that significantly cut down the costs of market entry. The seaglider can cruise at speeds of 180 mph (290 kph) over distances of up to 180 miles (290 km).\n\n**Development Progress:**\nREGENT has de-risked its technology through a ¼-scale flying demonstration vehicle and a full-scale wing test. A full-scale prototype that carries human passengers is anticipated to take flight in 2024. By mid-decade, commercial seaglider operations are expected to begin, initially featuring a 12-seat configuration.\n\n---\n\n**Why It Matters:**\nThis innovative approach addresses critical pain points in regional travel—cost, speed, and emissions. The electric powertrain allows for lower operating costs and zero emissions. Plus, with no airport security hassles and swift travel speeds, the seaglider promises faster door-to-door times compared to traditional air and ferry travel.\n\nWith a strong footing in both the aerospace and maritime sectors, REGENT is positioned to redefine how we think about regional transport over the coming years.\n\n**Current Engagements:**\nThe team is actively developing and testing their technology while engaging with major airlines and ferry operators to secure partnerships for future commercial services.\n\nFor more details on REGENT and its vision for the future of travel, check their website: [REGENT](http://regentcraft.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/2c6550be80d01c97ac031e25e3d2231f8cfd24a4.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191713Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=beab81d7ca2f671f126d6cd647db0c38e1b2258b992a2630d83c6d7aa1da4993",
    "social_links": [
        "https://www.linkedin.com/company/regentcraft",
        "https://twitter.com/regentcraft",
        "https://www.facebook.com/regentcraft"
    ],
    "logo_path": "data/logos\\REGENT_logo.png"
}