{
    "links": "https://www.ycombinator.com/companies/relay-health",
    "name": "Relay Health",
    "headline": "Peer support to overcome addiction â\u0080\u0093 the modern AA",
    "batch": "S22",
    "description": "Relay is an app that helps people overcome addiction through peer support and accountability â\u0080\u0093 starting with pornography addiction. Itâ\u0080\u0099s like if Alcoholics Anonymous were invented in 2024.\r\n\nFor example, when someone is struggling in isolation, Relay matches them with 3-7 other peers with the same challenge, makes it easy to reach out for help when vulnerable, and enables change through shame-free accountability and facilitated connection.",
    "activity_status": "Active",
    "website": "https://www.joinrelay.app",
    "founded_date": 2022.0,
    "team_size": 5.0,
    "location": "Salt Lake City, UT",
    "group_partner": "Brad Flora",
    "group_partner_yc": "https://www.ycombinator.com/people/brad-flora",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:mental-health-tech; industry:health-tech; industry:community",
    "founders": [
        {
            "name": "Chandler Rogers, Founder",
            "description": "Chandler Rogers is the co-founder and CEO of Relay, where he leads product strategy and all things user experience. Having struggled with addiction personally, Chandler has a deep passion for helping people band together to find healing and change. Previously, he led product teams at two other startups, launching multiple 0 to 1 products. Originally from Washington State, Chandler earned a degree from BYU in Business Strategy with emphases in Product Management and Computer Science.",
            "linkedin": "https://www.linkedin.com/in/chandlermrogers/"
        },
        {
            "name": "Jace Kendrick, Founder",
            "description": "Jace Kendrick is the co-founder and CTO of Relay, leading all of the engineering efforts for the team. Jace studied Computer Science and Business at Brigham Young University where he discovered his love for entrepreneurship and building new things. Jace is passionate about using technology to help improve peopleâ\u0080\u0099s lives. Previously, he worked as a web and mobile engineer at Apple.",
            "linkedin": "http://www.linkedin.com/in/jacekendrick"
        }
    ],
    "status": true,
    "generated_description": "### Relay Health: Redefining Support for Addiction Recovery\n\n#### Overview\nFounded in 2022, Relay Health aims to revolutionize the way individuals tackle addiction—think of it as 'Alcoholics Anonymous' for the digital age. Based in Salt Lake City, Utah, Relay is a product of Y Combinator Batch S22, and it currently operates with a compact team of five dedicated employees. \n\n#### Mission\nAt its core, Relay encourages peer support to help users overcome addiction, starting with pornography and expanding into areas like binge eating, alcohol, smoking, vaping, and marijuana. The mission is clear: offer a shame-free environment where accountability and connection thrive, allowing users to confront their challenges head-on.\n\n#### How It Works\nWhen someone signs up for Relay and finds themselves struggling in isolation, the app matches them with a small group of peers grappling with similar issues. This communal approach fosters vulnerability and is aimed at creating real change through genuine support. \n\nThe platform employs principles from cognitive behavioral therapy, facilitating personalized reflections and guided exercises to tackle the root causes of addiction rather than just the symptoms. Users can easily check in and share their progress, creating accountability while building a tight-knit community.\n\n#### Key Features\n- **Group-Based Support**: Users connect with a group of 3-7 individuals facing similar challenges, promoting comfort and openness.\n- **Personalized Recovery Plans**: Each participant receives a tailored plan to focus on specific triggers and goals.\n- **Tools for Tracking Progress**: Relay includes analytics to help users understand patterns in their behavior, enabling them to preemptively address potential relapses.\n- **Affordability**: At just $25 per month, Relay offers access to a comprehensive suite of resources, including over 96 interactive lessons designed by clinical experts.\n\n#### Testimonials\nRelay has garnered positive feedback from its users. Many express how connecting with like-minded individuals has made a world of difference in their recovery journeys. Common sentiments highlight the app's role in facilitating judgment-free conversations, providing essential tools, and creating a sense of community that alleviates the loneliness often associated with addiction.\n\n#### Conclusion\nIn a landscape where traditional methods of recovery can often leave individuals feeling isolated and stigmatized, Relay Health is crafting a new narrative—one that harnesses technology to foster connection, accountability, and lasting change. For anyone grappling with addiction, Relay offers a refreshing and hopeful path forward.\n\nWant to dive deeper? Check them out at [joinrelay.app](https://www.joinrelay.app).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/c6830d7d799826124c121d3ac186aeda31983c19.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191715Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=3657400cbe4401064d852d93f0ba0cf377031d9f0381ab69bff03227acf0878b",
    "social_links": [
        "https://www.linkedin.com/company/joinrelayapp/"
    ],
    "logo_path": "data/logos\\Relay_Health_logo.png"
}