{
    "links": "https://www.ycombinator.com/companies/releaf-earth",
    "name": "Releaf Earth",
    "headline": "Turning food waste into Biochar to remove CO2 from the atmsophere",
    "batch": "S17",
    "description": "Releaf Earth is a climate tech startup pioneering carbon removal and agricultural solutions leveraging biochar (BCR). Expanding from our roots in food processing technology, we now specialize in producing premium biochar from palm kernel shells. Biochar Carbon Removal (BCR) is a powerful tool for carbon sequestration and a key technology for economic development in Africa.\r\n\nAfrican farmers already experience a 150% global mean temperature rise from a climate crisis they didn’t cause. Releaf's mission is to empower rural communities with improved productivity, crop yields, and a role in achieving Net Zero Emissions.",
    "activity_status": "Active",
    "website": "http://www.releaf.africa",
    "founded_date": 2017.0,
    "team_size": 100.0,
    "location": "Lagos, Nigeria",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:carbon-capture-and-removal; industry:climate; industry:supply-chain; industry:agriculture",
    "founders": [
        {
            "name": "Uzoma Ayogu, Founder/CTO",
            "description": "Uzo is CTO & Co-founder of Releaf - \nUzo graduated from Duke with a degree in Mechanical engineering in 2017 and currently serves on Duke’s Board of Trustees as a full voting member. \n\nUzo has professional experience working on jet engines at GE Aviation, devising, funding,  building resilient engineering impact projects in sanitation & water in rural Brazil & Togo, & independent research research on autonomous drone medical delivery.",
            "linkedin": "https://www.linkedin.com/in/uzomabayogu"
        },
        {
            "name": "Kenna Nzewi, Founder/CEO",
            "description": "Co-founder + CEO of Releaf. We develop technology to unlock the processing of local crop varieties in emerging markets.",
            "linkedin": "https://www.linkedin.com/in/inzewi"
        }
    ],
    "status": true,
    "generated_description": "**Releaf Earth: Biomass Waste into Agricultural Gold**\n\nReleaf Earth is not just another climate tech startup; it's a dynamic player in the fight against climate change and a champion for African agriculture. Founded in 2017 in Lagos, Nigeria, Releaf Earth was part of the prestigious Y Combinator Batch S17, and it has rapidly distinguished itself as Nigeria’s first industrial biochar producer. At its core, Releaf's mission is clear: turn food waste into biochar to remove CO₂ from the atmosphere, effectively contributing to carbon sequestration while empowering local communities.\n\n### What is Biochar?\n\nBiochar is a form of charcoal produced from biomass through a process called pyrolysis. It has gained traction as a powerful tool for carbon removal and soil enhancement. Releaf Earth focuses on creating premium biochar from palm kernel shells—a resource that is abundant in Africa. By transforming waste into valuable biochar, the company wraps environmental protection in economic empowerment, enhancing soil fertility and enabling rural farmers to increase their productivity.\n\n### The Dual Challenge\n\nFarmers in Africa, particularly in vulnerable communities, are facing a daunting 150% rise in mean temperatures due to the climate crisis they never initiated. Releaf aims to combat this by enhancing crop yields and creating sustainable livelihood opportunities. Their ambitious roadmap includes removing 700,000 metric tons of CO₂ equivalent by 2030 and producing 20,000 metric tons of biochar annually while creating over 500 jobs, half of which they aim to fill with women.\n\n### Innovations at Work\n\n1. **Kraken Technology**: A breakthrough innovation, Kraken is a patented oil palm de-shelling technology tailored for smallholders and off-grid applications. By sourcing palm nuts directly from farmers, Releaf creates agricultural waste in the form of palm kernel shells, which feed their biochar production.\n\n2. **Smart Pyrolysis**: Releaf assesses the optimal pyrolysis manufacturers based on project-specific needs—ensuring every biochar project is tailored to its local context.\n\n3. **Measurement & Verification**: Independent measurement solutions are leveraged to ensure the authenticity of the carbon removal claims Releaf makes through its projects.\n\n4. **Geospatial Planning with SITE**: By developing its own geospatial mapping tool, Releaf locates biochar facilities near sustainable biomass sources, maximizing profitability and efficiency.\n\n### Why Africa?\n\nAfrica possesses unique advantages for biochar production:\n- **Abundant Biomass**: With around 1.4 billion tons of biomass produced annually, there's no shortage of feedstock for biochar.\n- **Cost-Effective Labor**: Labor costs in the region are significantly lower than elsewhere, which optimizes production expenses.\n- **Energy Independence**: The production process is self-sustaining, generating its own energy and reducing reliance on external power sources.\n\n### Impact Beyond the Environment\n\nReleaf is committed to not only reversing climate change through innovative technology but also enhancing social equity by prioritizing women in the workforce and supporting rural economies. The goal is clear: to make Releaf Earth the largest carbon removal company by 2030 and catalyze a sustainable revolution across Africa.\n\nIn a world where climate change threatens livelihoods and ecosystems, Releaf Earth stands as a beacon of how we can turn waste into wealth, heal our planet, and empower communities. If you're intrigued and want to learn more, visit [Releaf Africa](http://www.releaf.africa).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/ff9a2d94abe8f67c93602438d492506551a3da47.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191715Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=fe6a632562313ed3fe66c07c952cb33d04cde9abacf0d68db04a7d7e528f5593",
    "social_links": [
        "https://www.linkedin.com/company/releaf-africa",
        "https://twitter.com/ReleafAfrica",
        "https://web.facebook.com/releaf.africa/",
        "https://www.crunchbase.com/organization/releaf"
    ],
    "logo_path": "data/logos\\Releaf_Earth_logo.png"
}