{
    "links": "https://www.ycombinator.com/companies/reliance-health",
    "name": "Reliance Health",
    "headline": "We make healthcare in emerging markets affordable and accessible",
    "batch": "W17",
    "description": "Reliance Health uses technology to make quality healthcare delightful, affordable and accessible in emerging markets. Through an integrated approach that includes affordable health insurance, telemedicine and a combination of partner and proprietary healthcare facilities, Reliance Health offers innovative healthcare solutions that meet the needs of emerging markets including Nigeria, Egypt and growing",
    "activity_status": "Active",
    "website": "https://www.getreliancehealth.com",
    "founded_date": 2016.0,
    "team_size": 384.0,
    "location": "Lagos, Nigeria",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:health-tech; industry:digital-health; industry:healthcare; industry:health-insurance",
    "founders": [
        {
            "name": "Matthew Mayaki, Founder/Senior Vice President Product",
            "description": "Matthew Mayaki is a software engineer with over 5 years of experience in the industry. Having started at a very young age, he has built battle-tested skills in both design and engineering and developed a passion for art and creativity, which he uses in solving everyday problems. He's a founding member of Reliance Health Inc. and currently serves as the VP Engineering, where he along with his team members handle the development and maintenance of the company's mobile and web infrastructures.",
            "linkedin": "https://ng.linkedin.com/in/matthew-mayaki-00b8345b"
        },
        {
            "name": "Femi Kuti, Founder/CEO",
            "description": null,
            "linkedin": "https://www.linkedin.com/in/femi-kuti-3766506"
        },
        {
            "name": "Opeyemi Olumekun, Founder/COO",
            "description": null,
            "linkedin": "https://ng.linkedin.com/pub/opeyemi-olumekun/36/8b4/bb6"
        }
    ],
    "status": true,
    "generated_description": "**Reliance Health Overview**\n\nFounded in 2016 and emerging from the Y Combinator Batch W17, Reliance Health is on a mission to revolutionize healthcare in emerging markets by making it affordable and easily accessible. Based in Lagos, Nigeria, the company has grown into a team of 384 dedicated employees, driven by a commitment to enhance healthcare delivery across countries like Nigeria and Egypt.\n\n**What They Do**\n\nAt its core, Reliance Health leverages technology to transform the healthcare landscape. Their integrated approach combines affordable health insurance with telemedicine services and a network of both partner and proprietary healthcare facilities. This innovative model addresses the unique healthcare challenges faced in emerging markets.\n\nThe company currently offers a range of services:\n- **Health Plans**: Tailored to meet the needs of varying businesses, offering everything from emergency coverage to preventive care.\n- **Telemedicine**: With their user-friendly app, members gain prompt access to healthcare professionals through virtual appointments, reducing disruptions in their daily lives.\n- **Clinical Services**: Reliance collaborates with over 3,800 health and wellness partners to provide high-quality clinical services that adhere to global standards.\n\n**Community Impact**\n\nReliance Health has made significant strides in empowering over 200,000 individuals and serving more than 4,000 businesses globally. Their focus is not just on healthcare provision but also on cultivating healthier lifestyles and improving employee health experiences. \n\nCustomer testimonials underscore their effectiveness, with many praising the peace of mind brought by the Reliance HMO, the convenience of their dashboard services, and the innovative technology that distinguishes them in the healthcare sector.\n\n**Where to Learn More**\n\nFor those interested in discovering more about Reliance Health, either as potential clients or simply curious minds, their website is a treasure trove of information. You can explore their various health plans, clinical services, and also dive into their resources and blog for insights into the healthcare industry.\n\nVisit [Reliance Health](https://www.getreliancehealth.com) to get started on your journey to improved healthcare solutions. In a world where access to quality healthcare is often a luxury, Reliance Health is making strides to ensure it’s within everyone's reach.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/e670fe1fec54b836c03e2046cbd22af8897d6728.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191715Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=f86577509e3c83eeb51736e20dc6d533e90b208ac3037e9c339d7b32ab2cb5ff",
    "social_links": [
        "https://www.linkedin.com/company/reliance-health-global",
        "https://www.crunchbase.com/organization/reliancehealth",
        "https://github.com/reliancehealthinc"
    ],
    "logo_path": "data/logos\\Reliance_Health_logo.png"
}