{
    "links": "https://www.ycombinator.com/companies/remedial-health",
    "name": "Remedial Health",
    "headline": "B2B E-commerce & Fintech platform for Pharmacies & Hospitals in Africa",
    "batch": "W22",
    "description": "Remedial Health sells medicine wholesale to the 1 million pharmacies and hospitals in Africa. Today in Africa, pharmacies shop in open-air medicine markets where they pay higher prices for counterfeits medicines. We offer a managed marketplace with all the stock they'll need, deliver within 24 hours and offer credit to help them grow.",
    "activity_status": "Active",
    "website": "https://remedial.health",
    "founded_date": 2021.0,
    "team_size": 300.0,
    "location": "Lagos, Nigeria",
    "group_partner": "Michael Seibel",
    "group_partner_yc": "https://www.ycombinator.com/people/michael-seibel",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:b2b; industry:e-commerce",
    "founders": [
        {
            "name": "Samuel Okwuada, Founder",
            "description": "Pharmacist (Masters in pharmacy) and Software engineer (Self-taught age 14). Started 3 companies and exited 2 whilst at university. Currently the Founder and CEO of Remedial Health - improving affordability and access to medicines by providing direct to retail medical and non-medical consumables from manufacturers to pharmacies in Africa.",
            "linkedin": "https://www.linkedin.com/in/samuelokwuada/"
        },
        {
            "name": "Victor Benjamin, Founder",
            "description": "Co-founder Remedial Health \nA salesman by passion, with a well established background of over 10years in pharma sales. My drive and strategy has earned me several awards as best salesman and distributor back to back for over 4 years at my previous work place.\nI bring my experience and strategy to grow sales, increase revenue generation and geographical expansion at Remedial Health.",
            "linkedin": "https://www.linkedin.com/feed/?trk=404_page"
        }
    ],
    "status": true,
    "generated_description": "**Remedial Health - Simplifying Pharmaceutical Procurement in Africa**\n\nFounded in 2021 and proudly operating from Lagos, Nigeria, Remedial Health is a forward-thinking B2B e-commerce and fintech platform designed specifically for pharmacies and hospitals across Africa. Initially starting as a wholesale distributor of medicines to Africa's abundant landscape of 1 million health facilities, Remedial Health has evolved into a comprehensive managed marketplace. This platform not only supplies essential stock but also delivers it within 24 hours, enabling pharmacists to avoid the pitfalls of open-air markets, where counterfeits and inflated prices are rampant.\n\nThe heart of Remedial Health's mission is to empower healthcare providers by providing a streamlined, efficient, and cost-effective procurement process. Their offering includes a range of innovative solutions like the Remedial Benefits Manager, Buy Now-Pay Later options for inventory financing, and a robust data analytics service through Remedial Intelligence. These tools are tailored to remove the burdensome logistics of purchasing medications, allowing healthcare professionals to focus on what they do best—caring for patients.\n\nWith a sizeable team of 300 employees, Remedial Health has quickly gained traction, amassing a trusted clientele of over 1,000 pharmacies and hospitals, all delighted to have the convenience of accessing pharmaceuticals at their fingertips. They can avoid the traditional chaos of supply chains and streamline operations through their easy-to-use platform.\n\nSupported by notable investors such as Y Combinator, Tencent, and QED Investors, Remedial Health stands on solid ground for future growth. They are not just about selling medications; they are about transforming how healthcare providers operate, bringing efficiency and reliability into the healthcare ecosystem.\n\nMichael Seibel, a prominent figure in the startup community, serves as Group Partner, providing valuable mentorship to this ambitious venture. If you're looking to explore their solutions further, check out their website at [remedial.health](https://remedial.health).\n\nIn a world where healthcare is increasingly dominated by inefficiencies, Remedial Health is fostering innovation—a true lifeline for those who need it most. And if you’re in the pharmacy business in Africa, you might just find that stocking up and simplifying your operations has never been easier.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/d33a1706f8081e70b616935b7c595c80a3f01790.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191715Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=5486a24ec77e13b13cfc25526ab94ede8b3555e272d0d0ebf834dd517bfa4c59",
    "social_links": [
        "https://www.linkedin.com/company/remedial-health/",
        "https://twitter.com/remedial_health",
        "https://www.crunchbase.com/organization/remedial-health"
    ],
    "logo_path": "data/logos\\Remedial_Health_logo.png"
}