{
    "links": "https://www.ycombinator.com/companies/remind",
    "name": "Remind",
    "headline": null,
    "batch": "IK12",
    "description": "Remind is a communication platform that helps every student succeed. Founded in 2011, Remind allows school and district administrators to reach and engage with their communities and connects educators and families with the tools that help them teach and learn.",
    "activity_status": "Active",
    "website": "http://www.remind.com",
    "founded_date": null,
    "team_size": 51.0,
    "location": "San Francisco",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Brett Kopf",
            "description": "Started remind.com\nWorking on omella.com",
            "linkedin": "https://www.linkedin.com/in/brettkopf"
        },
        {
            "name": "David Kopf",
            "description": null,
            "linkedin": "https://www.linkedin.com/in/davekopf"
        }
    ],
    "status": true,
    "generated_description": "### Remind: A Communication Revolution for Education\n\nFounded in 2011 and located in the vibrant tech hub of San Francisco, **Remind** started as an innovative communication platform aimed at helping students thrive. With a team of 51 dedicated employees, Remind has become a go-to tool for educators, school administrators, and families across the United States.\n\nThe essence of Remind's mission is simple: to foster meaningful communication and engagement in education. It delivers services that really matter to schools, allowing seamless connections between educators and families. With over **30 million users across 80% of U.S. schools**, it’s clear that their approach resonates. \n\n#### Key Offerings\n\n1. **Chat**: A free, two-way messaging service tailored for the classroom. It enables real-time communication that can even be translated into 90+ languages, ensuring that every stakeholder feels included and informed.\n\n2. **Hub**: This tool enhances organizational communication from classrooms to the district office, making it easier for administrators to connect with students and families. It streamlines information sharing, which is essential, especially in times of emergency or important updates. \n\nBoth tools are designed with privacy and safety in mind, protecting users' personal information while promoting active engagement.\n\n#### Recent Developments\n\nIn a significant move, **Remind is now part of the ParentSquare family**. This partnership is set to enhance their mission of facilitating equitable family engagement in education, creating a unified communication platform that better serves schools and families alike.\n\nThe impact of Remind’s services is evident; educators describe their interactions with families as more frequent and positive. It's not just about sending messages; it’s about building relationships that foster student success.\n\n#### Who Benefits from Remind?\n\n- **Teachers**: Empowered to reach students and families effectively.\n- **Administrators**: Given the tools to ensure smooth, meaningful communication.\n- **Families**: Able to support their children's learning from home and stay informed about school activities.\n\nWith a user rating of **4.8** on the Apple App Store and groundbreaking adoption rates, Remind isn’t just another tool—it’s a game changer in how school communication is approached.\n\nFor more information, resources, or to get started, check out their website: [Remind.com](http://www.remind.com). \n\nIn essence, Remind exemplifies how technology can bridge gaps in education, making communication not just easier, but more effective and engaging for everyone involved.",
    "logo": "/logos/medium/missing.png",
    "social_links": []
}