{
    "links": "https://www.ycombinator.com/companies/remi",
    "name": "Remi",
    "headline": "Simplifying roofing for homeowners, roofers and enterprises.",
    "batch": "W22",
    "description": "We find roofers more roofs, and homeowners the right roofer.\r\n\nThere are over 80 million homes in the US, and eventually, every one of them will need a new roof. Our technology  allows contractors to focus on what they do best—getting a repaired roof over homeowners' heads quickly.",
    "activity_status": "Active",
    "website": "https://www.remihq.com",
    "founded_date": 2022.0,
    "team_size": 60.0,
    "location": "Lehi, UT",
    "group_partner": "Michael Seibel",
    "group_partner_yc": "https://www.ycombinator.com/people/michael-seibel",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:saas; industry:solar-power; industry:construction; industry:proptech; industry:climate",
    "founders": [
        {
            "name": "Doug Barnett, Founder",
            "description": "I have worked in sales, sales operations and marketing my entire career. Most recently led Marketing for Vivint (NYSE:VVNT) which sold to NRG.",
            "linkedin": "https://www.linkedin.com/in/doug-barnett-74653816/"
        },
        {
            "name": "Brant Choate, Founder",
            "description": "I've been an IC designer, engineer, and PM. Led Product @ Podium (YC W15) from $1M - $100M ARR. 2X founder. Big believer that technology is the most important factor for reducing net human suffering in the world.",
            "linkedin": "https://www.linkedin.com/in/brantchoate/"
        }
    ],
    "status": true,
    "generated_description": "**Company Overview: Remi**\n\nFounded in 2022 and hailing from Lehi, Utah, Remi is tackling a monumental challenge in the roofing industry: simplifying the roofing process for homeowners, roofers, and enterprises alike. Initially, their mission was to connect roofers with more roofs, while helping homeowners find the right contractors. With over 80 million homes in the U.S., each of which will eventually need a new roof, Remi's technology enables contractors to streamline their processes—allowing them to focus on what they do best: getting roofs repaired quickly for homeowners.\n\n**Mission and Services:**\n\nRemi aims to revolutionize an industry fraught with complications, like unexpected costs and delays. They provide a full range of services including standard roof work, combined reroof and solar panel installation, and solar panel removal/reinstallation. Each service is offered with a guaranteed price, eliminating the frequent unpleasant surprises inherent in traditional roofing projects.\n\n**Key Features:**\n\n- **Simplified Pricing**: The price quoted is the price you pay, with no hidden fees or unexpected change orders.\n- **Comprehensive Offerings**: Services span regular roofing work, solar integration, and fast reinstallation processes for solar panels.\n- **Expert Support**: Each project is managed by a dedicated Remi expert who ensures transparent communication and support from start to finish.\n- **Warranty and Quality Assurance**: They offer a five-year workmanship warranty along with limited lifetime material guarantees, ensuring that homeowners feel confident in their investment.\n\n**The Team:**\n\nWith a dynamic team of 60 employees and mentorship from Michael Seibel of Y Combinator in their W22 batch, Remi is positioned for growth. They are well-versed in various tags including SaaS, solar power, construction, proptech, and climate solutions, pointing to their innovative and eco-friendly approach.\n\n**Customer Experience:**\n\nRemi boasts a track record of positive customer experiences. Homeowners consistently highlight the professionalism, punctuality, and thorough communication from Remi's crews. Testimonials reveal satisfaction with both the quality of work and the meticulous cleanup process—details that can often get lost in the shuffle of home improvement projects.\n\n**Why Choose Remi?**\n\nChoosing Remi means engaging with a company that prioritizes transparency, speed, and quality in a typically cumbersome industry. Their commitment to exceptional customer service, warranty protection, and rapid project completion positions them as a leader in the roofing landscape. And, with an eye toward integrating sustainable practices, they’re also part of the climate solution.\n\nTo put it simply, if you're a homeowner trying to navigate the complexities of roof repair or replacement, Remi is here to make your life easier. For more information, you can visit their website at [remihq.com](https://www.remihq.com). \n\nIn a nutshell, Remi is not just about roofs—it's about providing a trusted, seamless experience that reshapes how we think about roofing alternatives.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/cf2b95ddaed8ab41e5ee70b587e28fa7dcf364b6.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191715Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=44bed6fb62f49f21356be980cbbb97988d603e37c317b1bf1dc72fc3f4e3be78",
    "social_links": [
        "https://www.linkedin.com/company/remilabs",
        "https://twitter.com/remilabs"
    ],
    "logo_path": "data/logos\\Remi_logo.png"
}