{
    "links": "https://www.ycombinator.com/companies/remo",
    "name": "Remo",
    "headline": "AI for compliance teams at banks",
    "batch": "S24",
    "description": "Remo is building AI copilots for onboarding and compliance teams at financial institutions. \r\nWe automate highly manual processes like KYB, AML, and Ongoing Monitoring.",
    "activity_status": "Active",
    "website": "https://getremo.ai",
    "founded_date": 2024.0,
    "team_size": 3.0,
    "location": null,
    "group_partner": "Tom Blomfield",
    "group_partner_yc": "https://www.ycombinator.com/people/tom-blomfield",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": null,
    "founders": [
        {
            "name": "Rabii Malik, Founder",
            "description": "Former McKinsey consultant and international expansion lead at Telda - now bringing AI to financial institutions.",
            "linkedin": "https://linkedin.com/in/rabii-malik"
        },
        {
            "name": "Hashim Rehman, Founder",
            "description": "Co-Founder & CTO at Remo. I previously lead and scaled Pricing Engineering at Careem, built multiple consumer products at Deliveroo and consulted as a full-stack engineer for British Airways.",
            "linkedin": "https://linkedin.com/in/hashimrehman"
        }
    ],
    "status": true,
    "generated_description": "### Remo: AI for Compliance Made Simple\n\n**Overview:**  \nRemo is a startup on a mission to redefine compliance in the banking sector through the power of artificial intelligence. Founded in 2024 and part of Y Combinator's Batch S24, Remo targets the financial institutions struggling with manual processes in onboarding and compliance—specifically Know Your Business (KYB), Anti-Money Laundering (AML), and ongoing monitoring.\n\n**The Problem:**  \nCompliance work is tedious and often requires navigating through a maze of regulations and protocols. As financial institutions grow, so do their obligations to automate and streamline processes while maintaining compliance. Remo understands that integrating outdated systems with modern practices is not only essential but overdue.\n\n**The Solution:**  \nRemo offers AI copilots meticulously designed for compliance teams, enabling them to automate these high-stakes, time-consuming processes. With features like customizable compliance workflows, real-time risk detection, and comprehensive case management, Remo helps teams onboard businesses faster and more securely. By automating vast swathes of compliance work, they allow banks to focus on what they do best—serving customers.\n\n**Key Features:**  \n- **Automated Workflows:** Speedy onboarding of businesses via streamlined KYB processes, allowing for quicker turnaround times and reduced manual intervention.\n- **Customizable Compliance:** Tailored workflows cater to the unique needs of each institution, ensuring regulatory requirements are met without sacrificing efficiency.\n- **Real-Time Monitoring:** Continuous oversight and risk detection help maintain compliance long after the initial onboarding is completed.\n- **Enterprise Security:** Built to SOC2 standards, ensuring that data integrity and confidentiality are paramount, thus paving the way for audit-ready processes.\n\n**Current Status:**  \nOperating with a team of three, based in an undisclosed location, Remo is garnering backing from notable figures in the fintech domain, including Group Partner Tom Blomfield. Despite being a nascent company, their vision is to make compliance seamless and efficient, ensuring that financial institutions can grow without the burden of slow processes.\n\n**Why It Matters:**  \nIn a world where regulations are tightening and the penalties for non-compliance are increasing, companies like Remo stand at the forefront of an essential evolution in fintech. They are not just simplifying compliance; they are enabling banks to innovate and expand with confidence.\n\nTo learn more or to see Remo in action, check out their [website](https://getremo.ai) and consider booking a demo to witness how they could transform your compliance processes.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/ef278e67c5f0a246e5b151c0d2f1887e99e055ca.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191716Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=d3f429f10687c4fe99093f53b9a30a37d73d3f17151a58f100b035331409c97e",
    "social_links": [
        "https://www.linkedin.com/company/getremo/"
    ],
    "logo_path": "data/logos\\Remo_logo.png"
}