{
    "links": "https://www.ycombinator.com/companies/reprosent",
    "name": "REPROSENT",
    "headline": "Activating an overlooked force in medicine - the patient.",
    "batch": "S21",
    "description": "REPROSENT is a patient-driven care system that harnesses patients' time to relieve overburdened medical teams. With an app that elevates the role of both patients and their loved ones, REPROSENT helps patients stay on track, capture previously untapped data about their lived experience, and receive timely triage that improves their health outcomes. By making crucial patient information actionable, REPROSENT enables doctors to focus their time on personalized treatment, transforming the way medical care is provided.",
    "activity_status": "Active",
    "website": "http://www.reprosent.com",
    "founded_date": 2020.0,
    "team_size": 4.0,
    "location": "Los Gatos, CA",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:biometrics; industry:consumer-health-services; industry:digital-health; industry:healthcare; industry:oncology; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Aimee DeGolyer, Founder",
            "description": "Aimee DeGolyer has a history bringing new technology to market with a strong focus on understanding consumer needs and developing products to match. She has direct experience in oncology patient data through her time at Ciitizen, and created REPROSENT based on the experience she had losing her father in 2020 to an adverse reaction to his treatment. Additional previous startup experience includes: True Key, OnCue, and LightLogic.",
            "linkedin": "https://www.linkedin.com/in/aimee-degolyer/"
        },
        {
            "name": "Michael Sample, Founder",
            "description": "Over the years, I have helped build  a variety of software solutions for a number of companies ranging from consumer startups to large enterprise companies. I'm the technical cofounder of Reprosent, a startup dedicated to improving patient outcomes with better data.",
            "linkedin": "https://www.linkedin.com/in/mike-sample-1547521/"
        }
    ],
    "status": true,
    "generated_description": "**Meet REPROSENT: Activating an Overlooked Force in Healthcare**\n\nFounded in 2020 and proudly part of Y Combinator's S21 batch, REPROSENT is a forward-thinking company based in Los Gatos, CA, on a bold mission: to empower patients as a vital resource in their healthcare journey. With a small but passionate team of four, including Founder & CEO Aimee DeGolyer, REPROSENT offers a unique patient-driven care system designed to alleviate the strain on overburdened medical teams.\n\n**The Problem: Underutilized Patient Time**\nDespite having around 720 hours in a month, patients often spend less than one hour with their doctors. This disparity creates a missed opportunity for meaningful communication and understanding. REPROSENT steps in to optimize that time, turning patients into key players in their treatment process.\n\n**Transforming Healthcare Through Actionable Data**\nThe foundation of REPROSENT’s approach is a smart app that integrates patients and their loved ones into the care process. Patients can track their symptoms, capture their experiences, and receive timely triage advice. This not only aids in managing their health but also provides healthcare professionals with actionable insights to offer tailored treatments.\n\n- **Stay On Track**: REPROSENT ensures patients receive critical reminders and instructions, enhancing safety and compliance during recovery.\n- **Data-Driven Understanding**: By allowing patients to record their lived experiences in real-time, the app helps them articulate their symptoms accurately, which can significantly influence care decisions.\n- **Broadening Support Networks**: The platform includes two app experiences—one for the patient and another for a loved one—encouraging family engagement in the care process.\n- **Maximizing Doctor Visits**: With better preparation, patients can arrive at appointments equipped with data-driven reports that facilitate richer discussions with their healthcare providers.\n\n**A Personal Touch**\nREPROSENT's inception stems from a deeply personal experience. Founder Aimee DeGolyer lost her father to a preventable adverse reaction during cancer treatment, fueling her drive to enhance patient engagement in healthcare. This personalized commitment signifies REPROSENT’s ethos: transforming the way medical care is delivered to foster better outcomes.\n\n**The Vision Ahead**\nREPROSENT's mission aligns perfectly with today's healthcare landscape, where efficiency meets empathetic care. With ongoing backing from investors like Y Combinator, Bond Capital, and Harvard, the company is poised for substantial growth in the digital health sector, especially within oncology and consumer health services.\n\nFor those interested in finding out more or joining the journey to amplify patient voices in medicine, visit [REPROSENT's website](http://www.reprosent.com) or connect on [Twitter](https://twitter.com/REPROSENT1), [LinkedIn](https://www.linkedin.com/company/reprosent), or [Facebook](https://facebook.com/REPROSENT1). \n\nIn a time when healthcare requires a more holistic, patient-centric approach, REPROSENT is leading the charge. If you've ever felt that healthcare is more of a monologue than a dialogue, it might be time to explore what REPROSENT brings to the table.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/f7723b7e5d81a859058b564a6c4c4ee9d204f2de.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191718Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=529334a61c0eed0cbc3989a729a634c5247298564567733719841be7ca99bf3f",
    "social_links": [
        "https://www.linkedin.com/company/reprosent/"
    ],
    "logo_path": "data/logos\\REPROSENT_logo.png"
}