{
    "links": "https://www.ycombinator.com/companies/rescript",
    "name": "Rescript",
    "headline": "AI Regulatory Analyst for Enterprises",
    "batch": "S24",
    "description": "Rescript helps regulatory compliance and advocacy teams effortlessly track the constant stream of legal developments and always stay compliant. With our AI regulatory analyst, companies don't have to rely on expensive consultants or settle for inadequate tools that can't do the job. \r\n\nHow it works: \r\n1. Comprehensive Tracking: Rescript scans the web for government meetings and regulatory documents, feeding them into our internal repository. \r\n\n2. Intelligent Filtering: Our tool determines whether a new development involves the customer's regulatory priorities, using reasoning trained by 40+ regulatory analysts from top consulting firms.\r\n\n3. Change Management: We sync with existing internal policies and materials, and evaluate them in light of new regulations.  \r\n\nFor more information, visit www.rescript.ai or contact our team at team@rescript.ai.",
    "activity_status": "Active",
    "website": "https://rescript.ai/",
    "founded_date": 2023.0,
    "team_size": 3.0,
    "location": null,
    "group_partner": "Brad Flora",
    "group_partner_yc": "https://www.ycombinator.com/people/brad-flora",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:artificial-intelligence; industry:saas; industry:civic-tech; industry:b2b; industry:legaltech",
    "founders": [
        {
            "name": "Nikhil Ajjarapu, Founder",
            "description": "Co-founder and CEO of Rescript, building at the intersection of AI, legal, and public policy. Most recently, I developed products used by federal agencies while on Salesforce's Public Sector team, helped build out AI and process automation for the Air Force's Cloud Computing Team, and studied CS and Public Policy at Princeton.",
            "linkedin": "https://linkedin.com/in/nikhil-ajjarapu"
        },
        {
            "name": "Vincent Huang, Founder",
            "description": "Co-founder of Rescript, helping government and regulatory affairs professionals monitor policy developments effortlessly with AI. \n\nStanford Alum - MS in Computer Science and BA in Philosophy",
            "linkedin": "https://linkedin.com/in/vincentjh"
        },
        {
            "name": "Alexander Pesendorfer, Founder",
            "description": "Co-founder and CTO of Rescript. Building AI tools to track public policy. Previously, I studied Computer Science, Statistics, and Machine Learning at Princeton and worked on software at a leading derivatives marketplace.",
            "linkedin": "https://linkedin.com/in/alex-pesendorfer"
        }
    ],
    "status": true,
    "generated_description": "**Rescript: The AI Regulatory Analyst for Enterprises**\n\nLaunched in 2023, Rescript is on a mission to reinvent how companies manage regulatory compliance with the help of AI. It's as straightforward as it sounds: navigating the maze of legal regulations is tedious and often requires costly Consultants. Rescript leverages artificial intelligence to streamline this process, enabling regulatory compliance and advocacy teams to track, analyze, and respond to the constant stream of legal developments efficiently.\n\n### How It Works\n\n1. **Comprehensive Tracking**: Rescript scours the web for government meetings and regulatory documents, compiling them into a robust internal repository.\n   \n2. **Intelligent Filtering**: Using insights from over 40 seasoned regulatory analysts, Rescript discerns which new developments align with your organization's regulatory priorities. It's like having a seasoned consultant onboard but without the hefty fees.\n\n3. **Change Management**: Their platform seamlessly integrates with your existing internal policies, evaluating them in light of new regulations to ensure compliance.\n\n### What Makes Rescript Stand Out?\n\n- **AI-Powered Capabilities**: Their solution covers everything from transcribing federal and state hearings to summarizing lengthy legislative documents and analyzing public comments. You won’t have to rely on outdated keyword approaches; Rescript autonomously reviews relevant bills, providing timely updates that matter to you.\n  \n- **Efficiency and Productivity**: Companies have reported saving upwards of 70% of the time that they would typically expend reviewing legislation. That’s a game changer in the regulatory landscape.\n\n- **Tailored Insights**: With Rescript, you’re not just monitoring legislation—you’re deeply analyzing it. The platform provides personalized summaries and impact analyses, helping you stay one step ahead.\n\nLocated within the vibrant ecosystem of Y Combinator's Batch S24, Rescript is a small but mighty team of three, guided by Group Partner Brad Flora. As they build out their suite of tools, their focus remains on ensuring businesses don’t just comply with regulations but thrive amid them.\n\nTo find out more or to see Rescript in action, head over to [rescript.ai](https://rescript.ai) or reach out via email at team@rescript.ai.\n\nIn short, if regulatory compliance has been a headache for your enterprise, Rescript is your AI-powered remedy.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/6ad51f558392375a93410aead0db23d5ea8d2304.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191718Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=52dd145204d236b65d920ef05c3137ce1b207b16ccb8430db9232f88167dfccc",
    "social_links": [
        "https://www.linkedin.com/company/rescript-ai",
        "https://x.com/RescriptAI"
    ],
    "logo_path": "data/logos\\Rescript_logo.png"
}