{
    "links": "https://www.ycombinator.com/companies/rescale",
    "name": "Rescale",
    "headline": "High Performance Computing Built for the Cloud",
    "batch": "W12",
    "description": "Rescale is a cloud-based platform for computational engineering and R&D, that empowers engineers and researchers to accelerate discovery, testing, and optimization. We democratize access to the latest technologies that drive greater efficiency and competitiveness, including high performance computing, simulation, modeling, AI/ML, and digital twins.\r\n\nThe majority of industry leaders worldwide use Rescale as the backbone of R&D, connecting the digital thread of new product innovation to develop products that enrich humanity, from autonomous vehicles to drug discovery. Rescale customers include 7 of the top 10 automotive companies and 3 of the top 6 life science companies.\r\n\nRescale’s full-stack, open platform automates systems, data, and workflows into a user-centric experience, so customers can focus on innovation. Choose from 1000+ pre-installed applications for multiphysics simulation and AI/ML-assisted design exploration, including commercial, open-source, and custom software. We offer the largest global network of hyperscale and specialty cloud infrastructure to leverage the latest CPU, GPU, and other specialized architectures.\r\n\nRescale is enterprise-ready to enable any size organization to achieve their digital transformation goals–with unified management that gives IT teams full visibility and control of hybrid-cloud operations. Rescale’s intelligent automation gives customers flexibility to improve performance and reduce costs of computing, while our enhanced security and compliance ensures industry-leading standards are met from end to end.\r\n\nGetting started is simple, flexible, and free to try. Our team of experts is ready to help you achieve your most ambitious engineering goals – schedule a demo today.\r\n\nJoin us and help us build products that change the world: www.rescale.com/careers",
    "activity_status": "Active",
    "website": "https://rescale.com",
    "founded_date": 2011.0,
    "team_size": 250.0,
    "location": "San Francisco",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:cloud-computing; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Joris Poort, Founder/CEO",
            "description": "Founder & CEO @ Rescale",
            "linkedin": "https://www.linkedin.com/in/gpoort/"
        },
        {
            "name": "Adam McKenzie, Founder/CTO",
            "description": null,
            "linkedin": "https://www.linkedin.com/in/adammckenzie"
        }
    ],
    "status": true,
    "generated_description": "### Rescale Summary\n\n**Company Overview:**\nRescale is a dynamic player in the high-performance computing (HPC) space, fundamentally built for the cloud. Founded in 2011 and a proud member of Y Combinator’s Batch W12, Rescale is headquartered in San Francisco, employing a dedicated team of about 250 people. \n\n**Mission:**\nRescale's mission is all about empowering engineers and researchers to accelerate discovery and optimization in their fields through advanced computational engineering and R&D tools. \n\n**What They Do:**\nRescale offers a cloud-based platform that democratizes access to cutting-edge technologies like HPC, AI/ML, digital twins, and simulation tools. They automate processes and workflows, ensuring engineers can focus on innovation without being bogged down by the technical complexities of computing. \n\nThe platform comes with over 1,000 pre-installed applications and supports a vast range of industries—such as automotive, life sciences, aerospace, and energy. Notably, seven out of the top ten global automotive companies and three of the top six life sciences firms leverage Rescale’s infrastructure to power their R&D efforts.\n\n**Key Features:**\n- **Full-Stack Platform:** Rescale provides a comprehensive, open platform that integrates data, systems, and workflows, allowing users a seamless and user-friendly experience.\n- **Global Network:** Clients can tap into the largest global network of hyperscale cloud infrastructures, utilizing the latest CPU and GPU technologies, tailored to their needs.\n- **Security & Compliance:** Rescale places a high priority on security, ensuring industry-leading standards are met throughout their services.\n- **Intelligent Automation:** Their solutions provide flexibility, helping organizations improve performance and reduce costs effectively.\n\n**Getting Started:**\nInterested customers can begin with a free trial or schedule a demo to experience how Rescale can enhance their innovation processes. \n\n**Why Choose Rescale?**\nAs industries evolve rapidly, Rescale positions itself as a key partner in digital transformation for businesses. Their clients benefit from greater agility, efficiency, and computational power, allowing for larger and more complex projects to be handled with ease.\n\n**Join the Movement:**\nFor engineers and businesses looking to revolutionize their R&D capabilities, Rescale invites you to join them in building products that make a significant impact on the world. For career opportunities, visit their careers page.\n\n**Website:** [Rescale](https://rescale.com)\n\nIn a nutshell, if you’re in the game of innovation, Rescale could just be the partner you need for your high-performance computing needs in the cloud.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/da3f3174c26b4958381aade7b404db4abc26d829.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191718Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=2856e64992b3296bdfc372a1de3550d9e68473bf1af066cc7e6436fab9430046",
    "social_links": [
        "https://www.linkedin.com/company/rescale",
        "https://twitter.com/rescaleinc",
        "https://www.crunchbase.com/organization/rescale",
        "https://github.com/rescale"
    ],
    "logo_path": "data/logos\\Rescale_logo.png"
}