{
    "links": "https://www.ycombinator.com/companies/respaid",
    "name": "Respaid",
    "headline": "Respectful AI B2B Collection",
    "batch": "S23",
    "description": "We use AI to respectfully collect account receivables.\r\nWe got 50% collection rate within 20 Days. \r\n\nWe only need an excel file to start (we integrate as well).\r\nOur most notorious customers include DoorDash, Deel, Flexport, Clipboard Health, Vanta etc...\r\n\nNo risk for your brand (Debtor NPS: 93)",
    "activity_status": "Active",
    "website": "https://www.respaid.com",
    "founded_date": 2020.0,
    "team_size": 38.0,
    "location": "San Francisco",
    "group_partner": "Garry Tan",
    "group_partner_yc": "https://www.ycombinator.com/people/garry-tan",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:artificial-intelligence; industry:fintech; industry:b2b; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "John Banner, Founder",
            "description": "My prior startup's downfall was due to unpaid invoices. With no viable market solution and seeing that 1/4 of businesses faced bankruptcy for similar reasons, I founded Respaid, using AI and respect to address the issue. Beyond entrepreneurship, I'm a commander in the French Republican Guard, a pianist, composer, and passionate about fintech meeting psychology. An engineer by training, I graduated from Harvard Business School and Ecole Centrale Electronique. Also, I'm a proud dad of 4 under 5 🙂",
            "linkedin": "https://linkedin.com/in/johnbanr"
        }
    ],
    "status": true,
    "generated_description": "**Respaid: The Respectful AI Solution for B2B Collections**\n\nFounded in 2020 and hailing from San Francisco, Respaid stands out in the B2B collections world by employing an innovative blend of respectful communication and artificial intelligence. Part of Y Combinator’s Batch S23, the company aims to enhance the collections process while safeguarding client reputations. \n\n**Mission**: The core mission of Respaid is simple: to provide a Respectful AI-driven strategy for collecting account receivables. It's about treating debtors as humans, which is crucial—after all, studies show that people are nine times more likely to pay when treated respectfully.\n\n**Results-Driven Approach**: Impressive metrics highlight their effectiveness; they report a collection rate of 50% within just 20 days. This rapid turnaround is a game-changer for businesses struggling with late payments. By merely uploading an Excel file of unpaid accounts to their platform, clients can begin seeing collections the very next day, turning potentially lost revenue into cash flow almost immediately.\n\n**Client Portfolio**: Respaid’s client list boasts impressive names such as DoorDash, Deel, Flexport, Clipboard Health, and Vanta. This diverse clientele reflects trust in Respaid’s approach, which consistently yields high debtor NPS scores—another testament to their respectful handling of collections.\n\n**Technology and Integration**: Respaid harnesses AI to tailor communications that resonate with each individual debtor. Their system learns from engagement data and adjusts messages over time, optimizing collection strategies and enhancing success rates. They offer a zero-fuss onboarding experience, allowing businesses to integrate effortlessly with popular accounting tools via Zapier and other services.\n\n**Brand Protection**: With a focus on maintaining brand integrity, Respaid emphasizes no risk to client reputation while utilizing their services. This is largely due to their unique communication style and the direct payment model, where customers pay the original business instead of Respaid, fostering trust and reliability.\n\n**Team and Structure**: With a team of 38 under the guidance of group partner Garry Tan, Respaid combines expertise with a rapidly evolving tech landscape. Their operations reflect a deep commitment to finding the best ways to engage late payers while protecting the brands involved.\n\nIn summary, Respaid is redefining what it means to collect B2B debts. They blend thoughtful communication with advanced technology, focusing squarely on humanizing the collection process. If you’re tired of cash flow disruptions from unpaid invoices, it might just be time to see what Respaid can do for you.\n\nFor more information, visit [Respaid's website](https://www.respaid.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/bd4ac97702c5247a8ef4b6d3c0aefd5a8fd60b44.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191719Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=2fefd9885e20505391f7d193e2cec2d951aae3eed55c5dd3c4af7be57150bebb",
    "social_links": [
        "https://linkedin.com/company/respaid",
        "https://www.crunchbase.com/organization/respaid"
    ],
    "logo_path": "data/logos\\Respaid_logo.png"
}