{
    "links": "https://www.ycombinator.com/companies/resquared",
    "name": "Resquared",
    "headline": "Marketing automation platform for selling to local businesses.",
    "batch": "W21",
    "description": "Local businesses were the hardest B2B segment to reach, but account for over 60% firms in the U.S.\r\nOur SaaS application has data on every local business that are easy to get in touch with using our specialized marketing automation tools and workflows. \r\nResquared has been proven to save sales pro's over 3 hours per day and result in 53% stronger leads (case study on website).",
    "activity_status": "Active",
    "website": "http://re2.ai",
    "founded_date": 2019.0,
    "team_size": 40.0,
    "location": "Philadelphia, PA",
    "group_partner": "Dalton Caldwell",
    "group_partner_yc": "https://www.ycombinator.com/people/dalton-caldwell",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:saas; industry:b2b; industry:sales; industry:proptech; industry:marketing",
    "founders": [
        {
            "name": "Griffin Morris, Founder",
            "description": "B2B SaaS focused entrepreneur.",
            "linkedin": "https://linkedin.com/in/jgriffinmorris"
        },
        {
            "name": "Tyler Carlson, Founder",
            "description": null,
            "linkedin": "https://www.linkedin.com/in/tylerwcarlson/"
        }
    ],
    "status": true,
    "generated_description": "### Resquared: The Future of Local Business Outreach\n\n**Overview**  \nFounded in 2019 and part of Y Combinator’s Winter 2021 batch, Resquared is a marketing automation platform that’s on a mission: to streamline how businesses sell to local firms. It’s rooted in a well-recognized challenge—the fact that local businesses represent over 60% of firms in the U.S. but are notoriously difficult to reach. With their SaaS application, the company has taken the first step towards bridging that gap.\n\n**What They Do**  \nResquared provides an extensive database of local businesses, allowing sales professionals to effortlessly connect with potential leads. Their tools focus on marketing automation, offering workflows that enable users to save time and enhance outreach efficiency. On average, Resquared helps sales professionals reclaim over three hours every day and has been associated with a whopping 53% increase in lead strength, as showcased in their case studies on the website.\n\n**Core Features**  \n- **Extensive Local Business Database**: Data on over 12 million local businesses, many of which aren’t on LinkedIn.\n- **Email Prospecting Tools**: Streamlined outreach that increases engagement.\n- **Sales Pipeline Management**: Helps users easily track and manage their sales efforts.\n- **Outreach Analytics**: Offers insights into engagement levels and success rates.\n- **Social Media Outreach**: Leverages social media platforms for direct communication with prospects.\n\nThese features collectively empower users to maximize their outreach and streamline the lead management process.\n\n**Location and Team**  \nResquared is based in Philadelphia, PA, and boasts a team of around 40 dedicated employees. This small but mighty group is supported by Dalton Caldwell, their Group Partner at Y Combinator, adding a layer of credibility and mentorship to their growth trajectory.\n\n**Market Position**  \nTagged across various domains such as SaaS, B2B, sales, proptech, and marketing, Resquared positions itself uniquely in the realm of local business outreach. Their offering fits perfectly for sectors that depend on direct interaction with local entities, including real estate, service industries, and beyond.\n\n**Customer Testimonials**  \nFeedback from users reflects strong satisfaction. Joe Knopp from Quiet Box stated, “I just love your platform. I literally set up my whole week in 30 minutes.” Similarly, other users reported significant improvements in their prospecting results and lead conversions, indicating that Resquared is making a tangible impact on their sales processes.\n\n**Why it Matters**  \nIn a world where local businesses are often overlooked by conventional CRM tools, Resquared provides a vital solution. Its focused approach not only saves time but also enhances the quality of leads, making it a game-changer for sales teams aiming to tap into the local market.\n\n**Conclusion**  \nWith an innovative platform and a clear mission, Resquared is setting new standards for how businesses interact with local firms. If connecting with these businesses is on your agenda, checking out Resquared is a smart move. Get a demo, and see for yourself how they can transform your outreach efforts.\n\nFor more info, visit their site: [Resquared](http://re2.ai).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/d7c2bac13deef32c59e4bc9d7acbb0b49c6dd09e.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191719Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=8c6843640eced938c78457191af625682ebf28ed929b3ddc4e605ba49ecea3b5",
    "social_links": [
        "https://www.linkedin.com/company/36077507/",
        "https://x.com/re2_ai"
    ],
    "logo_path": "data/logos\\Resquared_logo.png"
}