{
    "links": "https://www.ycombinator.com/companies/retrofit",
    "name": "Retrofit",
    "headline": "A vintage marketplace powered by AI",
    "batch": "W25",
    "description": "Retrofit is a curated vintage marketplace, making online vintage shopping seamless and enjoyable. We are building AI agents to aggregate the most in-demand inventory from vintage stores nationwide and create detailed, visually compelling listings for each item.\r\n\nWhether you're a vintage enthusiast or a first-timer you can discover unique sought-after pieces easily. Retrofit makes vintage shopping feel like shopping on Nordstrom— rather than digging through piles of low quality listings on existing secondhand marketplaces. For sellers, Retrofit offers tools to list quickly and to connect their inventory with the right audience on our marketplace.",
    "activity_status": "Active",
    "website": "https://www.retrofit.shop/",
    "founded_date": 2024.0,
    "team_size": 2.0,
    "location": "San Francisco",
    "group_partner": "Michael Seibel",
    "group_partner_yc": "https://www.ycombinator.com/people/michael-seibel",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:consumer; industry:e-commerce; industry:retail-tech; industry:fashion; industry:ai; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Sandra Lifshits, Founder, CEO",
            "description": "Building a curated vintage marketplace powered by AI. Previously, product @ ecommerce startups and Stanford MBA.",
            "linkedin": "https://www.linkedin.com/in/sandra-lifshits-a7a60284/"
        },
        {
            "name": "Maddy Yip, Founder, CTO",
            "description": "We are fixing shopping vintage fashion, curated and personalized for you! Previously, solving Computer Vision problems at Google Pixel Camera and led two pending patents. Before that, Stanford CS",
            "linkedin": "https://www.linkedin.com/in/mjyip/"
        }
    ],
    "status": true,
    "generated_description": "**Retrofit: Vintage Shopping Reimagined**\n\nFounded in 2024 and based in San Francisco, Retrofit is a fresh entrant in the e-commerce scene, designed to make vintage shopping not just easy, but enjoyable. Imagine if shopping for unique vintage items felt as seamless as browsing through a retailer like Nordstrom—that's exactly the experience Retrofit aims to deliver. \n\n**Mission and Functionality:**\n\nAt its core, Retrofit is a curated vintage marketplace powered by AI. It addresses two key problems: overwhelming options and inconsistent quality. By employing advanced AI agents, Retrofit aggregates the most in-demand inventory from vintage stores across the nation, creating rich, visually appealing listings that truly showcase the uniqueness of each piece. Whether you're a seasoned vintage aficionado or a curious newcomer, Retrofit makes discovering sought-after items a breeze.\n\nFor sellers, the platform simplifies the listing process, streamlining how they connect with their target audience. This dual-focus approach ensures that both buyers and sellers find genuine value, enhancing the overall vintage shopping experience.\n\n**Key Features:**\n\n- **Free Shipping & Returns**: To further entice customers, Retrofit offers free shipping and returns, reducing the friction often associated with online shopping.\n- **User-Friendly Interface**: The website is designed for ease of navigation, allowing users to filter products by various categories and sizes, making the hunt for that perfect vintage find enjoyable.\n\n**Community and Support**:\n\nRetrofit is part of the Y Combinator Batch W25, a testament to its innovative approach and potential for growth. With a lean team of just two employees, it’s a small yet focused operation, guided by the mentorship of Michael Seibel, a notable figure in the startup ecosystem.\n\nIn a landscape crowded with low-quality listings and difficult searches, Retrofit stands out by promising a curated, high-quality vintage marketplace experience with the added efficiency of AI. Whether you're here to shop or sell, Retrofit is gearing up to transform how we engage with vintage fashion.\n\n**Explore More**: [Visit Retrofit](https://www.retrofit.shop/) to discover unique vintage pieces that might just redefine your wardrobe.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/3df4bafd3ca626a187eafc7c39feb2ee6b828e01.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191722Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=bdf9d5ff8a8cc979fecfe5a98b56723c6d2ad4b15ad3acf782fee7cab0263f75",
    "social_links": [],
    "logo_path": "data/logos\\Retrofit_logo.png"
}