{
    "links": "https://www.ycombinator.com/companies/rev-genomics",
    "name": "Rev Genomics",
    "headline": "Rev is a biotechnology company creating better plants.",
    "batch": "S17",
    "description": "Rev Genomics is a plant biotechnology company that provides breeders, growers, and retailers with novel cultivars to differentiate themselves in high value markets.",
    "activity_status": "Active",
    "website": "https://www.revgenomics.com",
    "founded_date": 2016.0,
    "team_size": 8.0,
    "location": "Oakland, CA",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:b2b; location:san-francisco-bay-area",
    "founders": [],
    "status": true,
    "generated_description": "**Rev Genomics: Crafting the Future of Plants**\n\nFounded in 2016 and part of Y Combinator's Batch S17, Rev Genomics is an innovative biotechnology venture based in Oakland, California. The company is on a mission to create better plants, focusing on high-value crop cultivars that contain essential biochemicals. With a small but mighty team of eight, Rev Genomics employs cutting-edge techniques in plant breeding, leveraging tools like whole genome selection and advanced tissue culture to deliver novel cultivars. \n\n### Who They Are\nRev Genomics positions itself at the intersection of agriculture and genomics. Their scientific approach encompasses a diverse toolkit—from molecular genetics to in-house metabolite analytics—allowing them to develop unique and commercially viable plant varieties. They cater to breeders, growers, and retailers by providing them with technologies that differentiate their offerings in competitive markets.\n\n### What They Do\nTheir core offering revolves around creating high-value cultivars designed for specific biochemicals, which help partners stand out in the crowded agricultural landscape. They collaborate with partners to deliver molecular fingerprints for unique strains and seeds, effectively streamlining the process of cultivar development. This includes an efficient pheno-hunting process that dramatically reduces timelines from months to mere weeks.\n\n### Technology Overview\nRev Genomics relies heavily on data science to make sense of the immense amount of biological data gathered through nucleic acid sequencing. Their proprietary Genomics Data Pipeline optimizes the plant breeding process, minimizing costs and time involved while supporting rational phenotype design. Their advanced tissue culture techniques not only replicate existing cultivars but also foster the creation of true-breeding plants with distinct traits. They leverage the concept of trait stacking to enhance multiple characteristics, from yield to disease resistance, promoting the emergence of ‘super cultivars.’\n\n### Leadership\nRev is helmed by co-founders Bertrand Vick, PhD, an experienced biotech entrepreneur, and R.J. Cody Markelz, PhD, a specialist in plant systems biology. Together, they bring a wealth of knowledge and an ambitious vision for the future of plant biotechnology.\n\nFor more details about Rev Genomics, check out their website [here](https://www.revgenomics.com). If you have any inquiries about products and services, you can reach them at sales@revgenomics.com or call (510) 325-0484. \n\nIn a world increasingly reliant on sustainable agriculture and innovative biotechnological solutions, Rev Genomics is positioning itself as a leader, pushing the boundaries of what's possible in plant genetics and cultivars.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/5c2ebafec974c3a82402e2a13c9566e5e2f75095.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191724Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=61452e43be267d20f502a39d98ee1b598d074de74017149ed423dcf4af472959",
    "social_links": [
        "https://www.crunchbase.com/organization/rev-genomics"
    ],
    "logo_path": "data/logos\\Rev_Genomics_logo.png"
}