{
    "links": "https://www.ycombinator.com/companies/reviving-mind",
    "name": "Reviving Mind",
    "headline": "Addressing Loneliness and Isolation for Seniors",
    "batch": "W22",
    "description": "Navigating chronic illness is an isolating and lonely process which ultimately reduces medical adherence and adversely impacts outcomes. There are over 100 deadly chronic conditions as 1 out of 2 Americans is currently living with at least 1 chronic condition. The US healthcare system has over $1 trillion dollars in direct costs. Medical adherence rates for therapeutic programs and medicine are only 50% because patients feel lonely, isolated, and unsupported in their chronic illness journey.\r\n\nReviving Mind is an in-network telehealth provider that improves clinical outcomes and program adherence for the senior medicare and medicare-advantage population that is plagued with loneliness and chronic illness. This is done through a novel and proprietary clinical program and technology platform that integrates virtual, private, curated, and professionally led groups that scale up to 8-patients with individualized and goal oriented lifestyle medicine coaching that is automated but managed by a licensed provider.\r\n\nScaling rapidly across the United States.",
    "activity_status": "Active",
    "website": "https://www.revivingmind.com/",
    "founded_date": 2020.0,
    "team_size": 3.0,
    "location": "Boston",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:consumer-health-services; industry:digital-health; industry:healthcare; industry:telemedicine; location:boston",
    "founders": [],
    "status": true,
    "generated_description": "### Company Overview: Reviving Mind\n\n**Reviving Mind** is a Boston-based telehealth provider that tackles an urgent issue: the loneliness and isolation often faced by seniors dealing with chronic illnesses. Founded in 2020 and part of Y Combinator's Batch W22, Reviving Mind aims to enhance clinical outcomes and adherence to medical programs for the Medicare and Medicare-Advantage demographic.\n\n#### The Challenge\n\nLiving with chronic conditions is a burden for millions—over half of Americans currently live with at least one chronic illness, leading to feelings of isolation that hinder their ability to maintain treatment regimens. In fact, medical adherence rates hover around just 50% for these patients. The financial implications are staggering, with the U.S. healthcare system incurring over $1 trillion in direct costs annually. Reviving Mind steps in to address this pressing need by fostering connection and support among patients.\n\n#### Innovative Approach\n\nReviving Mind employs a proprietary technology platform that facilitates small, private, and curated group sessions, accommodating up to eight patients per group. The program offers individualized, goal-oriented lifestyle medicine coaching, managed by licensed providers. This unique setup not only provides emotional support but also encourages engagement with their health management.\n\n**Key Features of Reviving Mind:**\n- **Collaborative Care Management (CoCM):** Integrates behavioral health into primary care, ensuring comprehensive patient care.\n- **Automated, yet Personalized Support:** Using technology to automate some aspects while being overseen by real professionals makes the system efficient and humane.\n- **Holistic Wellness Treatment:** Focuses not just on conditions but overall mental and physical health through various tailored programs such as Chronic Care Management and Remote Patient Monitoring.\n\n#### Growth and Future\n\nWith a small but passionate team of three, Reviving Mind is rapidly scaling its services across the U.S. Its innovative model shows significant promise, indicating better patient satisfaction, enhanced medication adherence, and reduced hospital readmission rates.\n\n**Website:** For more information or to access their services, visit [Reviving Mind](https://www.revivingmind.com/).\n\nIn a landscape where senior care often overlooks key emotional needs, Reviving Mind positions itself as a beacon of hope—where technology and compassionate care meet to transform lives.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/b8f1fd16f0baf2e792e98189a8abd3fe46428feb.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191722Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=42b17d5170a635330958898f82582150a20bf28a248bc4f7acb3ddfb30b00af4",
    "social_links": [
        "https://www.linkedin.com/company/reviving-mind",
        "https://twitter.com/reviving_mind",
        "https://www.facebook.com/pages/category/Mental-Health-Service/Reviving-Mind-106552837793761/",
        "https://www.crunchbase.com/organization/reviving-mind"
    ],
    "logo_path": "data/logos\\Reviving_Mind_logo.png"
}