{
    "links": "https://www.ycombinator.com/companies/revl",
    "name": "Revl",
    "headline": "AI edited video souvenirs as a service",
    "batch": "W16",
    "description": "Revl is an experience technology company and Y Combinator 2016 Winter Batch member launching the Revl Arc smart action camera. \r\n\nDesigned in coordination with frogVentures, Sony, Ambarella and leading engineers with backgrounds at NASA, HP and Sikorsky Aircraft, the Revl Arc is available for preorder and will begin shipping in December. \r\n\nRevl was founded in 2015 and is based in San Francisco. For more information, please visit www.revl.com",
    "activity_status": "Active",
    "website": "https://revl.com/",
    "founded_date": 2015.0,
    "team_size": 22.0,
    "location": "San Francisco",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:machine-learning; industry:saas; industry:sports-tech; industry:b2b; industry:video; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Eric Sanchez, Founder/CEO",
            "description": "I am the co-founder and founding CEO of Revl, a startup that is backed by Y Combinator and other prominent investors. Next I’m working on launching my new AI stealth startup. \n\nI have over 15 years of experience in business development, product development, and engineering. I currently lead a team of talented and passionate professionals who are building innovative AI solutions for B2B customers.",
            "linkedin": "https://linkedin.com/in/ericsanchezcurti"
        },
        {
            "name": "Bruce Pla, Founder/Chief Design Officer",
            "description": null,
            "linkedin": "https://www.linkedin.com/messaging/thread/6027669874958938112"
        },
        {
            "name": "Nelson Vazquez, Founder/CTO",
            "description": null,
            "linkedin": "https://www.linkedin.com/pub/nelson-vazquez/a8/36/725"
        }
    ],
    "status": true,
    "generated_description": "### Revl: Transforming Adventure Experiences Through AI\n\nRevl is a promising tech company founded in 2015, nestled in the heart of San Francisco and renowned as a Y Combinator W16 alumnus. Initially launched with the Revl Arc smart action camera, the company has evolved into a dynamic provider of AI-enhanced video solutions, creating memorable souvenirs for adventure experiences. \n\n#### Mission and Technology\n\nAt its core, Revl aims to automate video editing, specifically honing in on producing AI-edited video souvenirs as a service. Their sophisticated technology is designed to capture and deliver high-quality video content almost instantaneously. Imagine this: your thrilling day of zip-lining or skydiving concluded, and before you're even done reliving that adrenaline rush, your edited video is waiting for you—a seamless blend of convenience and cutting-edge tech.\n\n#### The Revl Arc\n\nThe Revl Arc, initially developed in collaboration with top engineering minds from prestigious organizations such as NASA, HP, and Ambarella, represents the pinnacle of their initial venture into experience technology. While it's a testament to their engineering prowess, the real magic happens in the robust software that powers Revl's current offerings.\n\n#### Market Focus and Benefits\n\nRevl is strategically positioned to serve adventure attractions—think amusement parks, alpine coasters, and skydiving facilities. Their platform provides several key benefits:\n- **Complete Video Automation**: Their system records, edits, and delivers guest footage in moments, ensuring no experience goes undocumented.\n- **New Revenue Streams**: Revl partners report significant boosts in media sales, enhancing profit margins for venues running adventure experiences.\n- **Enhanced Marketing Insights**: By increasing the shareable content guests produce, Revl helps businesses expand their digital reach and visibility.\n\n#### Team and Future Prospects\n\nOperating with a lean team of just 22 talented employees, Revl is a testament to the power of focused innovation. With a strategic partner in the form of nan and a dedication to refining adventure tech, they're poised for growth in the ever-expanding landscape of experience-based entertainment.\n\n#### Conclusion\n\nIf you’re looking for an exciting way to boost customer engagement and enhance guests' adventures, Revl's automated video solutions might just be the ticket. Check them out at [revl.com](https://revl.com/) to see how they can revolutionize your guest experience and put spectacular memories at your fingertips. \n\nIn a world where experience is king, Revl is positioning itself not just as a participant but as a leader, harnessing the power of AI to create lasting memories.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/312c1ed1c72e15e62f3be5126428ed7df20065f5.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191722Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=90ff16ec5c594060cdd34279af1d6a27c53217521a588793987dcc52af1ad1d9",
    "social_links": [
        "https://www.crunchbase.com/organization/revl"
    ],
    "logo_path": "data/logos\\Revl_logo.png"
}