{
    "links": "https://www.ycombinator.com/companies/rio",
    "name": "Rio",
    "headline": "Mexicoâ\u0080\u0099 s largest digital asset brokerage",
    "batch": "S22",
    "description": "Rio is the premier stablecoin liquidity provider for the LATAM market. We enable access to stablecoins for financial innovators to scale their products.",
    "activity_status": "Active",
    "website": "https://www.rio.trade",
    "founded_date": 2022.0,
    "team_size": 10.0,
    "location": "Mexico City, Mexico",
    "group_partner": "Dalton Caldwell",
    "group_partner_yc": "https://www.ycombinator.com/people/dalton-caldwell",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:crypto-web3; industry:payments; industry:latin-america",
    "founders": [
        {
            "name": "Eudelio Garza, Founder",
            "description": "Eudelio is the CEO of Rio. Prior to Rio, he was a Product Manager at BlockVigil, a dev platform that provides Matic nodes as a service. He onboarded 30 developers and helped the company reach 1 billion API calls/day. When talking to web3 devs, he realized the need for better on-and-off ramping infrastructure in emerging markets.",
            "linkedin": "https://www.linkedin.com/in/eudelio-garza-5abb7a13b/"
        },
        {
            "name": "Javier Roberts, Founder",
            "description": "Building Rio",
            "linkedin": "http://linkedin.com/in/javierroberts"
        },
        {
            "name": "Ricardo Villarreal Chapa, Founder",
            "description": "Co-founder of Rio (YC S22). Studied Computer Engineering at Boston University. Ex engineering product manager (for banks) and private equity analyst. Enjoys training BJJ, rockclimbing, and tennis.",
            "linkedin": "https://www.linkedin.com/in/ricardo-villarreal-chapa/"
        }
    ],
    "status": true,
    "generated_description": "### Company Summary: Rio\n\n**Overview**  \nRio is becoming a key player in the financial technology scene in Latin America. Founded in 2022 and based in Mexico City, Rio aims to be Mexico’s largest digital asset brokerage, focusing primarily on stablecoin liquidity for the region. The company was part of Y Combinator’s Summer 2022 batch, which is a testament to its potential.\n\n**Mission**  \nThe core mission of Rio is to enable access to stablecoins for financial innovators looking to scale their products. This is crucial in a region where traditional banking can be restrictive. By positioning itself as the premier stablecoin liquidity provider for Latin America, Rio is opening up avenues for trading virtual assets at incredible speeds.\n\n**Team and Leadership**  \nRio has a team of ten dedicated professionals. Dalton Caldwell serves as the Group Partner, guiding the company towards achieving its ambitious goals.\n\n**Key Services**  \nRio specializes in three main areas:\n\n1. **Liquidity Provisioning:** Providing market makers and clients access to tight spreads between local currencies and stablecoins.\n2. **Stablecoin FX:** Enabling quick and cost-effective conversions between fiat and stablecoins, significantly reducing fees compared to traditional foreign exchange methods.\n3. **OTC (Over-the-Counter) Trading:** Offering institutional-grade stablecoin trading with ultra-tight spreads and dedicated support.\n\n**Impact and Reach**  \nIn only a short time, Rio has achieved considerable milestones, supporting over 40 institutional clients and facilitating transactions across more than 8 local currencies, with an astonishing annual transaction volume exceeding $1 billion. They currently work with five different stablecoins, illustrating their robust infrastructure and commitment to diverse financial solutions.\n\n**Principles and Compliance**  \nRio prioritizes robust compliance with strict regulatory standards, ensuring trust and security in handling clients’ assets. By employing fine-tuned algorithms to maintain tight FX spreads, the company ensures that its clients maximize their trading potential. Furthermore, the integration of Rio's APIs is designed to be seamless for developers, promoting customized and secure financial solutions.\n\n**Vision for the Future**  \nThrough strategic partnerships and an innovative approach to stablecoin finance, Rio is not just trying to change the way transactions happen in Latin America; it is striving to establish a new financial ecosystem where stability and accessibility reign.\n\n**Contact**  \nFor more information or to engage with Rio, visit [their website](https://www.rio.trade).\n\n---\n\nRio's journey is a powerful reminder that in the rapidly evolving landscape of digital finance, those who prioritize innovation and compliance will lead the way. They’re not just participating in the fintech revolution; they’re helping to shape its future in Latin America.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/6388778e65f4b93bb4babbff32f2f06ca896084b.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191725Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=04e87f437ca615581df2134ecad3084138b2c93c79bb9a8a88ecc31e56ef1c7f",
    "social_links": [
        "https://www.linkedin.com/company/rio-transfer/",
        "https://twitter.com/rio_transfer"
    ],
    "logo_path": "data/logos\\Rio_logo.png"
}