{
    "links": "https://www.ycombinator.com/companies/riot",
    "name": "Riot",
    "headline": "Cybersecurity awareness for fast growing companies",
    "batch": "W20",
    "description": "Riot is a SaaS platform to easily set up a cybersecurity awareness program for teams. We're making tools to protect your employees, and therefore protecting your company.",
    "activity_status": "Active",
    "website": "https://tryriot.com/",
    "founded_date": 2020.0,
    "team_size": 50.0,
    "location": "Paris, France",
    "group_partner": "Dalton Caldwell",
    "group_partner_yc": "https://www.ycombinator.com/people/dalton-caldwell",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:saas; industry:security",
    "founders": [
        {
            "name": "Benjamin Netter, Founder",
            "description": "Highly curious coder, I've been creating products for the past 15 years.\n\n1. At 19, I created a Facebook app that grew from 0 to 500,000 users in a week. That's how my first web server died.\n2. At 20, I won Foursquare Global Hackathon, creating an automatic trip planner.\n3. At 25, I co-founded October, financing European SMBs online. Now 110 employees, 5 offices, raised $60m.\n4. At 30, I founded Riot, a cybersecurity training SaaS. Protecting your company by protecting your employees.",
            "linkedin": "https://www.linkedin.com/in/b-netter/"
        }
    ],
    "status": true,
    "generated_description": "**Riot: Cybersecurity Awareness for Growing Companies**\n\nFounded in 2020 and hailing from the vibrant tech hub of Paris, France, Riot is on a mission to empower companies with cybersecurity awareness tailored for their rapidly evolving needs. As part of Y Combinator's Batch W20, Riot has quickly cemented itself as a leader in the SaaS (Software as a Service) space, focusing on safeguarding both employees and organizations against today’s sophisticated cyber threats.\n\nRiot’s platform offers a suite of essential tools designed to cultivate a proactive security culture within teams. With just a few clicks, companies can launch a comprehensive cybersecurity awareness program that ensures employees are well-equipped to recognize and respond to potential threats. It's not just training; it’s about making employees the first line of defense against hackers.\n\n### Key Features:\n- **Awareness Training**: Simplifies the process of embedding cybersecurity culture within teams.\n- **Phishing Simulations**: Provides practical, hands-on experiences that prepare users for real-world threats.\n- **24/7 Cybersecurity Hotline**: Offers a constant support framework for any immediate questions or crises.\n- **Data Breach Detection**: Utilizes real-time monitoring to keep organizations informed of any potential security incidents.\n\nRiot's platform elegantly integrates with popular tools like Google, Microsoft, and Okta, ensuring seamless operations and up-to-date security postures. This integration helps teams to track progress and set priorities via a unified scoring system that makes security less daunting and more actionable.\n\nWith a growing team of around 50 employees and recognition for its cutting-edge approach, Riot is rethinking traditional cybersecurity paradigms. Given the alarming statistic that AI-driven cyberattacks have spiked by over 1,275% since the launch of ChatGPT, the urgency for their innovative approach couldn't be clearer.\n\nBacked by Dalton Caldwell as their Group Partner and having recently secured $30 million in Series B funding, Riot is not just a startup; it's a contender ready to make a significant impact on the cybersecurity landscape.\n\nFor companies looking to enhance their cybersecurity awareness, being proactive is key. As hackers evolve, so too must our defenses, and Riot is prepared to lead the charge. Interested in giving it a try? Check out their offerings at [tryriot.com](https://tryriot.com/) and see how they can help your organization stay safe in an increasingly complex digital world.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/6f8a6cccc9be13fcb8fa0447537d9929f107105c.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191725Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=8e9f7d97a23a7da443b74bc225b3d2039246fc8813ad401c36bdc7b593f59929",
    "social_links": [
        "https://www.linkedin.com/company/tryriot",
        "https://twitter.com/tryriotdotcom"
    ],
    "logo_path": "data/logos\\Riot_logo.png"
}