{
    "links": "https://www.ycombinator.com/companies/rmfg",
    "name": "RMFG",
    "headline": "Autonomous Sheet Metal Factories",
    "batch": "S21",
    "description": "We're building autonomous sheet metal factories. Sheet metal is a large ($200b+ in the US) industry heavily reliant on human labor. If you're building something in the real world, it's almost a certainty that you will use sheet metal in some capacity. It's used in automotive manufacturing, aerospace, consumer goods, defense, and many more verticals. The industry mostly operates the same way it has for the last 50+ years.\r\n\nWe're making a 10x better experience for people to get sheet metal parts manufactured. We are vertically integrated and build everything from our quoting engine to the physical automation inside of our factory. Factories should own automation as a core in-house skill. \r\n\nToday we sell laser cut and bent sheet metal parts. Users can get instant quotes through our website (and eventually through integrations build on top of our API). We build custom internal software to command and control the operations of the factory. \r\n\nRight now we are actively working on fully automating the production of laser cut parts including scheduling, material movement, laser configuration, etc. Orders will be able to come in, and our software will control the factory and output parts ready to ship.",
    "activity_status": "Active",
    "website": "https://www.rmfg.com",
    "founded_date": 2021.0,
    "team_size": 2.0,
    "location": "Fort Worth, TX",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:robotics; industry:manufacturing; industry:industrial",
    "founders": [
        {
            "name": "Kenneth Cassel, Founder",
            "description": "Got into tech by accident. First career was in the trades, grew up fixing / building cars. Bought a Raspberry Pi one day and caught the programming bug.\n\nI think most of the interesting problems left to solve involve software + hardware.",
            "linkedin": "https://www.linkedin.com/in/kenneth-cassel/"
        }
    ],
    "status": true,
    "generated_description": "**RMFG: Revolutionizing Sheet Metal Manufacturing**\n\nFounded in 2021 and hailing from Fort Worth, Texas, RMFG is taking on a $200 billion industry that has largely remained unchanged for over 50 years: sheet metal manufacturing. The company's mission centers on building autonomous sheet metal factories to create a seamless and efficient order-to-delivery experience for customers.\n\n### What They Do\n\nAt RMFG, the aim is to radically improve how sheet metal parts are manufactured. They're not just selling parts—they're building a comprehensive system that integrates everything from quoting to production automation. If you need laser-cut or bent sheet metal parts, RMFG provides instant quotes through their user-friendly website. You can upload files, get a price in seconds, and even enjoy fast lead times starting at just two days, with no minimum order requirements.\n\nThe technology behind RMFG is intriguing. They are developing proprietary software that oversees factory operations, ensuring that material movement and laser configurations are efficiently managed. This software aims to fully automate the production process, so when orders come in, the system commands the factory to create and ship the parts—no human intervention required.\n\n### The Team and Support\n\nOperating with a lean team of two and backed by Y Combinator as part of their S21 batch, RMFG is positioned for significant growth. They’re building their capabilities in-house, fostering expertise in automation as a foundational skill for their operations. Nan is their group partner, providing additional support as they scale.\n\n### Customer-Centric Approach\n\nRMFG places a strong emphasis on customer experience. Their platform has garnered positive feedback for its interface, speed, and reliability. Customers, from automotive suppliers to consumer goods manufacturers, have praised the quality and precision of the parts they order. Users like Pete Oxenham from Chatter.dev have noted the exceptional quality—surpassing previous experiences with other laser shops.\n\n### Conclusion\n\nIn a world where manufacturing often gets left behind by technological advancements, RMFG is a breath of fresh air. They’re not just tinkering around the edges; they’re rethinking the entire production process for sheet metal. If you have sheet metal needs, consider giving RMFG a shot. With faster lead times and instant quotes, it’s clear they're making waves in the industry—one part at a time. \n\nFor more information, check out their website at [rmfg.com](https://www.rmfg.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/49d931944b58fb4e83cf5a5e5e0440798457d6c9.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191806Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=026e37432b41e6dac58b43b6cca2305dff24fb926a5e12aec3a8ce7a8df8a15e",
    "social_links": [
        "https://www.linkedin.com/company/rmfg/"
    ],
    "logo_path": "data/logos\\RMFG_logo.png"
}