{
    "links": "https://www.ycombinator.com/companies/rocketlit",
    "name": "RocketLit",
    "headline": "RocketLit is an adaptive learning and assessment platform.",
    "batch": "S16",
    "description": "RocketLit gives all students better access to learning and educators access to the data they need to be most impactful.\r\n\nOur first product, RocketLit, is an adaptive and personalized learning platform that serves reading to students at their independent level. Students read the same content at different levels of complexity and fluidly move up reading levels as they improve.\r\n\nInnerOrbit is our new Science Assessment platform, giving students, teachers and administrators the practice and data they need to be successful on science tests. We serve the highest quality content and feature the most detailed reporting on the market. \r\n\nWe’re a small and focused team working to change the world through science education. Our company has served over 650k students and we’re on track to more than double that number in the next year. We’re looking for folks who’ll grow into a leadership role within the organization.",
    "activity_status": "Active",
    "website": "http://www.rocketlit.com",
    "founded_date": 2016.0,
    "team_size": 11.0,
    "location": "Santa Monica, CA",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:education; industry:edtech",
    "founders": [
        {
            "name": "Brendan Finch, Founder/CEO",
            "description": "Veteran teacher working tirelessly to support admin, teachers, and students with digital learning through our leveled reading and NGSS Assessment products.",
            "linkedin": "https://www.linkedin.com/in/brendan-finch-8658265b"
        },
        {
            "name": "Grenard Madrigal, Founder/CTO",
            "description": null,
            "linkedin": "https://www.linkedin.com/in/grenard-madrigal-437b7118"
        }
    ],
    "status": true,
    "generated_description": "### Snapshot of RocketLit\n\n**Overview**\n\nRocketLit, founded in 2016 and a proud participant in Y Combinator's S16 batch, is an innovative edtech company based in Santa Monica, California. With a compact team of 11 dedicated employees, RocketLit’s mission is to enhance access to learning for students and provide educators with actionable data to maximize their impact.\n\n**Key Offerings**\n\n1. **RocketLit Platform**: As the company’s flagship product, RocketLit is an adaptive learning platform that tailors reading content to individual student levels. It allows students to engage with the same material but at varying complexities, adapting dynamically as their skills improve.\n\n2. **InnerOrbit**: This newly launched science assessment platform complements RocketLit by equipping educators and students with essential practice tools and comprehensive reporting. InnerOrbit focuses on preparing users for science tests, providing high-quality content, and detailed performance analytics.\n\n**Impact**\n\nRocketLit prides itself on its significant outreach, having served over 650,000 students with plans to double that within the next year. Their products not only save teachers valuable time but also help in directing instruction effectively. They are actively on the hunt for talented individuals who aspire to take on leadership roles within the organization.\n\n**Features of RocketLit:**\n- **Leveled Assignments**: Customized reading tasks tailored to each student’s ability.\n- **Annotations & Highlighting**: Encourages active reading through interactive tools.\n- **Read-Aloud Options**: Accessibility for lower reading levels to hear content as they follow along.\n- **Detailed Reporting**: Facilitates educators in understanding student progress and areas needing attention.\n\n**Market Positioning**\n\nAligning with educational standards like NGSS, TEKS, and others, RocketLit stands out in the crowded edtech space. Their focus on adaptive learning positions them well amidst rising trends in personalized education, making them an attractive option for schools aiming to implement differentiated learning strategies.\n\n**Trial Offer**\n\nRocketLit believes in their product so much that they offer educators a free month-long trial to explore the benefits of their platform.\n\n**Engagement Channels**\n\nInterested parties can find RocketLit on social media platforms such as Twitter, Facebook, and YouTube to stay updated and witness their ongoing contributions to education.\n\n**Conclusion**\n\nIn the ever-evolving landscape of education technology, RocketLit emerges as a compelling player with its promise of personalized learning experiences and data-driven insights. If you're involved in education—be it as a teacher, administrator, or learner—you might want to take a closer look at what RocketLit has to offer. You can check them out at [RocketLit.com](http://www.rocketlit.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/97d59af8d225ff0b84a033dbc25b036831315cf4.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191856Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=80a591fe9eee396b445a1bf9e6830a0732221e58125764593a528e358dbdd63b",
    "social_links": [
        "https://www.linkedin.com/company/rocketlit",
        "https://twitter.com/InnerOrbitedu",
        "https://www.facebook.com/innerorbitNGSS/",
        "https://www.crunchbase.com/organization/rocketlit"
    ],
    "logo_path": "data/logos\\RocketLit_logo.png"
}