{
    "links": "https://www.ycombinator.com/companies/roomstorm",
    "name": "Roomstorm",
    "headline": "Real time B2B hotel room marketplace for various industriesâ\u0080¦",
    "batch": "S14",
    "description": "Roomstorm has developed the airline industry's first ever fully automated platform for providing hotel accommodations to distressed passengers during flight disruptions.  This platform gives airlines the opportunity to directly connect to hotel inventory all over the world, or to give their teams an advanced web portal for the rapid processing of their passengers.",
    "activity_status": "Active",
    "website": "http://roomstorm.com",
    "founded_date": null,
    "team_size": 4.0,
    "location": "Redwood City, CA",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:marketplace; industry:b2b; industry:travel; location:san-francisco-bay-area",
    "founders": [],
    "status": true,
    "generated_description": "Roomstorm is a pioneering company that has carved a niche in the travel sector with a real-time B2B hotel room marketplace specifically designed for various industries. Founded as part of Y Combinator's Batch S14, Roomstorm began its journey by creating the airline industry's first fully automated platform for quickly securing hotel accommodations for distressed passengers during flight disruptions. This innovation allows airlines to tap into hotel inventories across the globe efficiently, or equip their teams with a streamlined web portal for rapid passenger processing.\n\nBased in Redwood City, California, Roomstorm operates with a lean team of four employees. The company is tagged with various identifiers such as 'marketplace,' 'B2B,' 'travel,' and 'San Francisco Bay Area,' which highlights its specialized focus and geographical roots.\n\nIn terms of operations, Roomstorm not only handles hotel bookings but also provides options for car rentals, emphasizing flexibility for travelers. For those in need of accommodations or car rentals, Roomstorm presents a clear and easy-to-navigate platform that invites instant action.\n\nFor more information, Roomstorm's website can be visited at [roomstorm.com](http://roomstorm.com), and they can be reached via phone at +1 877-987-8676. The company's growth and mission reflect a deep understanding of the complexities within the travel industry, particularly in handling unexpected disruptions with automation and technology.",
    "logo": "/logos/medium/missing.png",
    "social_links": [
        "https://www.linkedin.com/company/walksource/",
        "https://www.crunchbase.com/organization/walksource"
    ]
}