{
    "links": "https://www.ycombinator.com/companies/rthm",
    "name": "RTHM",
    "headline": "Simplifying complex illness care at scale",
    "batch": "W22",
    "description": "Current Description: RTHM provides virtual-first care for complex illness including Long COVID, ME/CFS, POTS, and mast cell activation.  Many clinics focus on teaching patients how to better cope with symptoms, which is helpful, but we don’t stop there.  We develop collaborations & partnerships so our patients access to the most promising testing and root-cause directed early therapies for their illness(es) with the goal of simplifying and streamlining the most efficient and effective clinical pathways so they can be scaled in the form of low cost online modules overseen remotely by clinicians.  \r\n\nIn conjunction with clinical care, RTHM operates a clinical lab and collects deep molecular data with robust clinical context to develop AI-powered diagnostics and better ways of predicting which treatments may work best for whom.",
    "activity_status": "Active",
    "website": "https://www.rthm.com",
    "founded_date": 2018.0,
    "team_size": 14.0,
    "location": "Redwood City, CA",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:consumer-health-services; industry:health-tech; industry:digital-health; industry:healthcare; industry:telemedicine; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Ryan Kellogg, Founder",
            "description": "Dr. Kellogg’s struggle with a mystery illness led him to pioneer technology for measuring thousands of molecules in self-collected blood microsamples. This allows for a better understanding of health fluctuations and the impacts of health interventions in detail. When combined with wearable sensors and symptom tracking, this technology allows for real-time health monitoring and pattern discovery with unprecedented resolution. PhD in Microfluidics and Systems Biology from ETH Zurich.",
            "linkedin": "https://www.linkedin.com/in/rkellogg/"
        },
        {
            "name": "Jennifer Curtin, Founder",
            "description": "Physician treating post-viral illnesses & ME/CFS for >5 yrs, Long COVID for the past year.  Member of the ME/CFS Clinician Coalition & co-author of the latest Coalition ME/CFS expert management guidance published in Mayo Clinic Proceedings 8/25/2021.  Streamlined/mapped the complex decision making, testing & treatment logic for Long COVID & frequently diagnosed co-morbid illnesses (incl ME/CFS) so it can be more rapidly utilized by new healthcare providers and scaled.",
            "linkedin": "https://www.linkedin.com/in/jennifer-curtin-md-00758556"
        }
    ],
    "status": true,
    "generated_description": "**Company Overview: RTHM**\n\nFounded in 2018 and hailing from Redwood City, CA, RTHM is revolutionizing the way we approach complex illness care. Part of Y Combinator's Batch W22, this innovative health tech startup is on a mission to \"simplify complex illness care at scale,\" addressing challenging conditions like Long COVID, ME/CFS, POTS, and mast cell activation syndrome.\n\n**What They Do:**\n\nRTHM is not just another telemedicine service. Unlike traditional clinics that merely help patients manage their symptoms, RTHM dives deep into the underlying issues. They partner with advanced clinical labs and develop AI-powered diagnostics, which facilitate a comprehensive understanding of each patient's unique health landscape. This allows for personalized and root-cause-directed therapies.\n\nTheir services include:\n- **RTHM Direct**: A more accessible offering that starts at $49 for online assessments. Patients can access treatments within a business day without needing in-person visits.\n- **RTHM Clinic**: A premium membership providing extensive lab access and multiple clinician visits throughout the year for a more hands-on approach to treatment.\n\n**Approach and Innovation:**\n\nAt RTHM, the focus is on patient collaboration. They enrich their treatment pathways by learning from the experiences of patients, which helps refine their methods continually. Their integration of remote clinical medicine with advanced molecular data allows them to deliver cutting-edge solutions faster.\n\nWith a dedicated team of 14 employees, RTHM emphasizes building personalized care pathways. Their goal is to aggregate patient experiences into a broad repository of knowledge that can shorten treatment timelines and enhance outcomes.\n\n**Why It Matters:**\n\nIn an era when healthcare can often feel impersonal, RTHM stands out by reinforcing the notion that care should be tailored to the individual's needs. Their insight into complex illnesses is grounded not just in clinical expertise but also in a real understanding of patient journeys—they're driven by their own past experiences in the field.\n\n**Current Offerings and Future Goals:**\n\nRTHM has plans to expand its services further across the United States to reach more patients who need help navigating these complex conditions. By leveraging their existing partnerships and clinical infrastructure, they're set to make significant strides in how chronic diseases are diagnosed and treated.\n\nTo learn more, visit their website at [RTHM](https://www.rthm.com). Whether you're wrestling with a complex illness or advocating for someone who is, RTHM aims to be a beacon of hope and a guide on the path to recovery.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/55e0977b8555da73dac8eb1b59138327d3c91d31.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191903Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=733ccdab9578c5a482e5c5b26bcc31706554f5c74fc271db4c05889cf2dd9a65",
    "social_links": [
        "https://www.linkedin.com/company/rthm",
        "https://twitter.com/RTHM_Health",
        "https://www.facebook.com/HealthRTHM",
        "https://www.crunchbase.com/organization/rthm"
    ],
    "logo_path": "data/logos\\RTHM_logo.png"
}