{
    "links": "https://www.ycombinator.com/companies/rune",
    "name": "Rune",
    "headline": "Talk & play multiplayer games with your friends!",
    "batch": "W19",
    "description": "Rune is the best place to talk and play multiplayer games with your friends. Users hang out on Rune’s mobile app, sharing laughs on our voice chat as they play amazing indie multiplayer games together! And developers build these games right on the Rune platform.\r\n\nDevelopers leverage the Rune SDK to build multiplayer games without needing a single line of backend code. They launch their game on Rune and instantly, thousands of passionate friend groups play it together on voice chat right inside the Rune app! Rune's beta has grown rapidly, with over 50 games built for the platform ranging from multiplayer mini-golf to real-time 3D racing games. The SDK supercharges game creation, with many of our games built in under a week! And these games are played like crazy too — friends have spent over 50 million minutes hanging out and playing our new games together already.",
    "activity_status": "Active",
    "website": "http://rune.ai",
    "founded_date": 2018.0,
    "team_size": 6.0,
    "location": "San Francisco",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:gaming; industry:social; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Bjarke Felbo, Founder",
            "description": "Developed ML algorithms at MIT as a Marvin Minsky Fellow. Open-sourced an algorithm now used to serve 300M+ daily users. Published 5 papers at top machine learning and NLP outlets such as EMNLP, ICML, CoNLL.\n\nNow building Rune, join us! 🎉",
            "linkedin": "https://www.linkedin.com/in/bjarkefelbo/"
        },
        {
            "name": "Sanjay Guruprasad, Founder",
            "description": "Sanjay's been hacking away on a computer as far back as he can remember (perks of his mom and dad both being programmers). He studied Physics at IIT Madras and was working towards a PhD on Network Effects at MIT before dropping out to start Rune. Rune combines all his passions -- gaming, social networks and some hardcore Software engineering.\n\nOutside of work, Sanjay loves to run, bike, play the guitar and of course code some more / blog about coding :)",
            "linkedin": "https://www.linkedin.com/in/sanjaypojo/"
        }
    ],
    "status": true,
    "generated_description": "**Company Overview: Rune**\n\nFounded in 2018 and born from Y Combinator's W19 batch, Rune is a San Francisco-based startup that's reshaping how friends engage with each other in the gaming space. With a mission to create a seamless experience for talking and playing multiplayer games, Rune has crafted a mobile app that serves as a vibrant community hub.\n\n**The Concept:**\n\nRune was designed to be more than just a gaming platform—it's about social interaction. Users can connect through voice chat, sharing laughter while diving into a wide array of incredible indie games that developers create directly on the Rune platform. This unique setup allows gamers to enjoy a dynamic and cohesive experience without the hassle of juggling multiple apps or dealing with intrusive advertisements.\n\n**For Developers:**\n\nOne of the standout features of Rune is its developer-friendly SDK, which enables creators to build multiplayer games without writing a single line of backend code. This drastically reduces the time it takes to launch a game, with many titles hitting the platform in under a week. With over 50 games available—ranging from miniature golf to exhilarating real-time racing—developers can tap into a ready-made audience of passionate gamers who spend more than 50 million minutes enjoying the platform's offerings.\n\n**Metrics that Matter:**\n- **10M+ Mobile App Installs**\n- **100K+ Five-Star Ratings**\n- **150+ Countries Represented**\n- **1B+ Minutes Spent on Voice Chat**\n\nRune’s impressive figures reflect its rapid growth and acceptance in the gaming community, particularly among younger users looking for engaging ways to interact.\n\n**User Experience:**\n\nRune is designed for ease. Games launch directly within voice chat rooms, allowing friends to effortlessly mingle and play. Each session is a chance for connection and fun, making it the go-to platform for the next generation of gamers.\n\n**Final Thoughts:**\n\nSo, if you’re keen on gaming alongside friends while keeping the communication flowing, check out Rune. It’s where laughter meets gameplay, and with new games constantly being added, there’s always something fresh to dive into.\n\nFind out more at [Rune's official website](http://rune.ai).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/9607e03a3c0e34d19200d6a2b939b2a8d2e87edb.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191904Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=33aa2b6235370a58a05fa4d1cd927b3ddd684475ce4a2347c6d7e7e296639ce7",
    "social_links": [
        "https://www.linkedin.com/company/duskgg",
        "https://twitter.com/@dusk_devs",
        "https://www.facebook.com/dusk.gg",
        "https://www.crunchbase.com/organization/rune-8231",
        "https://github.com/dusk-gg"
    ],
    "logo_path": "data/logos\\Rune_logo.png"
}