{
    "links": "https://www.ycombinator.com/companies/ryse",
    "name": "Ryse",
    "headline": "The secondary market for real estate leases",
    "batch": "W24",
    "description": "Ryse is the only marketplace where investors who want to buy leases can trade with real estate operators who want to sell leases.",
    "activity_status": "Active",
    "website": "https://www.rysemarket.com/",
    "founded_date": 2024.0,
    "team_size": 13.0,
    "location": "New York",
    "group_partner": "Michael Seibel",
    "group_partner_yc": "https://www.ycombinator.com/people/michael-seibel",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:machine-learning; industry:marketplace; industry:b2b; industry:proptech; location:new-york",
    "founders": [
        {
            "name": "Sean Mitchell, Founder",
            "description": "Sean Mitchell went to Florida A&M University where he received a bachelor's in Business Administration and minor in math and computer programming. He started his career in 2009 at JP Morgan's Chief Investment Office, where he was part of a 5-person team that managed a $30B structured mortgage backed security portfolio. Sean began working for Corbin Capital Partners in 2012, where he managed a $300M in a structured credit portfolio. Sean co-founded REZI (YC W17), a tech-enabled property manager.",
            "linkedin": "https://linkedin.com/in/seanfmitchell"
        },
        {
            "name": "Harsh Yadav, Founder",
            "description": "Harsh earned his MS, Computer Engineering from Rutgers, New Brunswick, New Jersey in 2010. He also has a Bachelor of Technology degree from the National Institute of Technology in Allahabad, India. Harsh began his career at Consumer Reports in 2010; helping transitioning Consumer Reports print media to web first world. In 2013, Harsh joined Torrential Inc., a digital media company as their VP, Engineering. Harsh co-founded REZI (YC W17), a tech-enabled property manager.",
            "linkedin": "https://linkedin.com/in/harsh-yadav-a382b911"
        }
    ],
    "status": true,
    "generated_description": "**Ryse: Revolutionizing the Real Estate Leasing Space**\n\nFounded in 2024 and situated in the bustling metropolis of New York, Ryse is trailblazing a new path in the secondary market for real estate leases. As part of Y Combinator’s W24 batch, this fintech startup is carving out a niche by being the only marketplace where investors keen on buying leases can effortlessly connect with real estate operators looking to sell them.\n\nWith a compact yet capable team of 13 under the guidance of Group Partner Michael Seibel, Ryse is rooted in its mission: to transform how leases are exchanged and open up new opportunities for both landlords and investors. The startup is riding the wave of innovation with its emphasis on machine learning and modern technology, which is essential in the fintech and proptech sectors—a hotbed of growth right now.\n\nSo, what does Ryse actually do? They provide a platform that streamlines the leasing process for real estate operators, facilitating not just the trading of leases but also offering software for search, payment processing, and transaction reporting. In short, Ryse is like the bridge connecting real estate operators with capital partners, ultimately aiming to enhance their liquidity and growth potential.\n\nKey services include:\n\n1. **Guaranteed Cash Flows**: Operators can secure consistent income from leases, enabling them to focus on growth without the fear of balance sheet risk.\n   \n2. **Streamlined Onboarding**: After a quick due diligence process, operators can start receiving payments within just 60 days. \n\n3. **Flexibility**: With their a-la-carte model, operators can engage with Ryse for specific projects, ensuring they only pay for what they need.\n\n4. **Back Office Optimization**: Offering a suite of modular solutions aimed at enhancing operational efficiency, whether it’s data management or payment processing.\n\nThe bottom line is that Ryse is about enabling real estate operators to differentiate themselves in a competitive market by providing them the tools to manage leases better and tap into new revenue streams, like offering liquidity against future rent collections. \n\nFor those intrigued by what Ryse has to offer, their website provides a wealth of information and resources, making it easy to explore opportunities for partnership and engagement.\n\nIn a nutshell, by connecting the dots in the real estate leasing market, Ryse isn’t just helping operators—it's setting the groundwork for a more efficient, scalable, and profitable industry. Check them out at [rysemarket.com](https://www.rysemarket.com/), and stay tuned, because they're just getting started.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/5e09182b25a8526e6b6451c12e4426e1565ea44b.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191906Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=0dd6fe985cb3e440b6f2c30a687030e236cb058708918fda59b71f6feaa6f8ff",
    "social_links": [
        "https://www.linkedin.com/company/ryse-market/"
    ],
    "logo_path": "data/logos\\Ryse_logo.png"
}