{
    "links": "https://www.ycombinator.com/companies/safebase",
    "name": "SafeBase",
    "headline": "Trust Center platform that scales customer security reviews",
    "batch": "S20",
    "description": "Trust Center Platform\r\n\nSafeBase Trust Center enables Security teams to proactively share and automate access to security, compliance, and privacy information/ complete security questionnaires.",
    "activity_status": "Active",
    "website": "https://www.safebase.io",
    "founded_date": 2020.0,
    "team_size": 60.0,
    "location": "San Francisco",
    "group_partner": "Dalton Caldwell",
    "group_partner_yc": "https://www.ycombinator.com/people/dalton-caldwell",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:saas; industry:productivity; industry:cybersecurity; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Al Yang, Founder",
            "description": "Father of two - lives in the Bay - enjoys company building and golfing. Started SafeBase to help companies share their security and compliance posture and automate access to sensitive information -- a pain he dealt with in his last company (Medumo, acquired by Philips Health).",
            "linkedin": "https://www.linkedin.com/in/alyang10/"
        },
        {
            "name": "Adar Arnon, Founder",
            "description": "Former R&D group leader in an elite technology unit in the Intelligence Directorate of the IDF. Specialized in Cybersecurity and OS architecture. Graduated from the joint-degree MS/MBA program at Harvard.\nI enjoy building stuff, and I enjoy breaking stuff even more. I've had years of varied experiences in the intersection of cybersecurity & web infrastructure, from designing secure networking protocols, to architecting operating system drivers, and managing a reverse-engineering team.",
            "linkedin": "https://www.linkedin.com/in/adarnon/"
        }
    ],
    "status": true,
    "generated_description": "**SafeBase: A Trust Center for Modern Businesses**\n\nFounded in 2020 and part of Y Combinator's Summer Batch (S20), SafeBase is revolutionizing how organizations handle customer security reviews. Based in San Francisco, this SaaS company has quickly grown to a team of around 60 employees.\n\n**What Does SafeBase Do?**\nAt its core, SafeBase operates as a Trust Center platform—a dedicated space where security teams can share crucial security, compliance, and privacy information with customers. The idea is simple yet powerful: automate and streamline the security review process, making it significantly more efficient. SafeBase allows companies to effortlessly respond to security questionnaires and showcases their security posture directly to clients.\n\nKey features include:\n- **AI Questionnaire Assistance**: This tool helps teams quickly and accurately respond to complex security questionnaires, significantly cutting down on turnaround time.\n- **Integrations**: SafeBase works seamlessly with tools that teams use daily, including Salesforce, Slack, and various document management systems. This integration helps bring security processes right into the workflow, enhancing productivity.\n- **Analytics**: Users gain insights into their security programs and can track engagement metrics with clients, demonstrating the tangible ROI of their security efforts.\n\n**SafeBase’s Mission**\nThe mission of SafeBase is clear: they aim to build a scalable platform that simplifies security reviews and enhances customer trust. In a landscape where data security and compliance are paramount, SafeBase positions itself as a trusted partner for businesses aiming to strengthen their security posture.\n\n**The Team Behind SafeBase**\nThe company is co-led by Dalton Caldwell, a notable group partner at Y Combinator. With a focus on productivity and cybersecurity, SafeBase is heavily invested in creating solutions that empower both security teams and their customers.\n\n**The Big Picture**\nIn an environment where customers increasingly demand transparency and security, SafeBase not only meets these needs but also facilitates stronger business relationships through trust. With a growing list of high-profile clients and a reputation for efficiency, SafeBase is setting a new standard for how businesses navigate security reviews.\n\nFor more information, you can visit their website at [SafeBase.io](https://www.safebase.io). \n\nIn an age where security cannot be an afterthought, companies that leverage SafeBase get ahead in building trust and demonstrating their commitment to security. ",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/c29d3bee9dcf5f310f3dd75b079f3afce2e86291.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191906Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=cb3f1b25246e30c053ba9c2c02158df766a9c5d9536a940f2b263a768a7ad7ed",
    "social_links": [
        "https://www.linkedin.com/company/safebase/"
    ],
    "logo_path": "data/logos\\SafeBase_logo.png"
}