{
    "links": "https://www.ycombinator.com/companies/salt",
    "name": "SALT",
    "headline": "B2B Cross-Border Payment & Compliance Platform",
    "batch": "W22",
    "description": "Salt is a neo banking solution stitched together to ease payments and documentation which comes with business banking by moving it to a digital-first and automated end to end platform.",
    "activity_status": "Active",
    "website": "https://salt.pe",
    "founded_date": 2020.0,
    "team_size": 14.0,
    "location": "Bengaluru, India",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:saas; industry:b2b",
    "founders": [
        {
            "name": "Ankit Parasher, Founder",
            "description": "Graduated from IIT Kharagpur and holds a bachelor’s degree in Electronics Engineering and further pursued a Bachelor of Laws. \nPreviously co-founded LetsTransport. This techno logistics platform has raised over 35m USD in the past. He has been recognized by both Forbes Asia & India 30 under 30",
            "linkedin": "https://www.linkedin.com/in/ankitparasher"
        },
        {
            "name": "Udita Pal, Founder",
            "description": "Udita graduated with a degree in mass communication in 2017. She has worked in product growth, marketing, and brand as an early team member of Opentalk, Tapchief (acquired by Unacademy), and Manch. She has also worked with over 35 start-ups worldwide as a consultant and helped them scale from 0-1. She has past experience as a successful content creator, brand manager, and helping start-ups with fast and stable growth.",
            "linkedin": "https://www.linkedin.com/in/uditapal/"
        }
    ],
    "status": true,
    "generated_description": "**Company Overview: SALT**\n\nFounded in 2020, in Bengaluru, India, SALT is a fintech startup that's reimagining the world of cross-border payments and compliance for businesses. Initially conceived as a neo banking solution, SALT has evolved into a robust B2B platform, aiming to simplify the complexities of international transactions—all while keeping it automated and digital-first.\n\n**Mission and Product Offering**\n\nSALT's mission is clear: to help businesses seamlessly navigate the murky waters of international markets by delivering effortless payments at competitive rates. The platform specializes in two major areas:\n\n1. **Inward Remittance**: This service facilitates the reception of foreign payments within 24 hours, providing an efficient solution for both merchants and individuals.\n2. **Table Salt (FDI)**: A beta offering aimed at streamlining the legal and finance processes required for startups seeking foreign investments.\n\nWith high adaptability, SALT supports transfers across 13 different currencies including USD, GBP, and EUR, empowering SMEs, freelancers, and startups alike to thrive globally.\n\n**Team and Support**\n\nSALT operates with a lean team of 14 talented individuals, guided by co-founders Ankit Parashar and Udita Pal—both of whom bring relevant experiences that shaped their insights into the challenges faced in international payments. Notably, both founders have experienced firsthand the frustrations of traditional banking, motivating their vision to create a more efficient solution.\n\nAdditionally, SALT has garnered backing from Y Combinator, participating in their Winter 2022 batch, which speaks volumes about its potential and innovation in the fintech space.\n\n**What Makes SALT Unique?**\n\nWhile many players exist in the finance tech landscape, SALT stands out by focusing specifically on the pain points of international transactions and compliance. In a world where businesses often lose precious time and resources navigating the red tape, SALT provides a streamlined, automated platform designed to ease these burdens.\n\n**Target Audience**\n\nSALT caters to a diverse clientele that includes:\n- **SMEs and Startups** looking for expansion into international markets.\n- **Freelancers and Service Providers** needing quick and efficient payment solutions.\n- **Consultants and Agencies** managing international transactions on behalf of clients.\n\n**Get Involved**\n\nSALT's user-friendly platform is accessible via their website [salt.pe](https://salt.pe), where you can explore their tools, read informative blogs, and keep up-to-date with the latest media mentions. As they continue to grow, they are particularly keen on building partnerships within the fintech ecosystem.\n\nIn a nutshell, SALT is not just about moving money across borders; it’s about enabling businesses to focus on growth while taking care of the complexities that accompany cross-border transactions. And that's a critical ingredient for success in today's global economy.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/c44c35ffe81c8027c394c7c5997bf7de4da29187.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191908Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=577be36b2239dcfaba33f1f8d18063c123d594c20495d5355e08caa60a000471",
    "social_links": [
        "https://www.linkedin.com/company/saltpe/",
        "https://twitter.com/saltpe_",
        "https://www.facebook.com/saltpebank"
    ],
    "logo_path": "data/logos\\SALT_logo.png"
}