{
    "links": "https://www.ycombinator.com/companies/sameday",
    "name": "Sameday",
    "headline": "AI sales agents for home service businesses",
    "batch": "W23",
    "description": "Home service businesses, like plumbers and roofers, are losing millions of dollars each year by failing to answer the phone. Sameday's AI Sales Agent answers any calls they otherwise would miss and will follow up until every lead is on the schedule.",
    "activity_status": "Active",
    "website": "https://www.gosameday.com/",
    "founded_date": 2021.0,
    "team_size": 7.0,
    "location": "Lehi, UT",
    "group_partner": "Gustaf Alstromer",
    "group_partner_yc": "https://www.ycombinator.com/people/gustaf-alstromer",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:artificial-intelligence; industry:generative-ai; industry:b2b; industry:sales-enablement; industry:automation",
    "founders": [
        {
            "name": "Aaron Cooper, Founder",
            "description": "Formerly the Chief Marketing Officer of the fastest growing home services company in the US. I now run a startup that solves the biggest pain in the home services space. Answering the phone.",
            "linkedin": "https://www.linkedin.com/in/aarongcooper/"
        }
    ],
    "status": true,
    "generated_description": "### Sameday: Revolutionizing Customer Outreach in Home Services\n\n**Company Overview**  \nFounded in 2021 and nestled in Lehi, Utah, Sameday is setting the pace for how home service businesses—like plumbers, roofers, HVAC specialists, and pest control providers—connect with their customers. As part of Y Combinator's Winter 2023 batch, Sameday has quickly gained traction. With a dynamic team of seven and led by group partner Gustaf Alstromer, they are addressing a critical pain point: missed calls.\n\n**Mission**  \nSameday's mission is straightforward: utilize AI sales agents to ensure that home service businesses never miss a customer interaction. By answering calls and diligently following up on leads, Sameday helps businesses capture valuable opportunities that would otherwise slip through the cracks.\n\n**Problem Addressed**  \nHome service industries lose millions annually because they fail to pick up the phone. Sameday's AI-driven answering service acts like the top-performing salesperson, effectively engaging callers, identifying their needs, and booking appointments seamlessly.\n\n**Key Features**  \n- **24/7 Availability**: Sameday's AI operates around the clock, handling customer inquiries and scheduling even during after-hours.\n- **Custom Integrations**: They integrate effortlessly with leading service software like ServiceTitan, allowing smooth operation within existing workflows.\n- **High Success Rates**: The AI boasts a 92% successful booking rate and operates in 49 states, showcasing its wide acceptance and effectiveness.\n\n**Customer Testimonials**  \nUsers are raving about Sameday. For instance, Rob Greer from Rove Pest Control shared how they achieved \"zero missed Google Local Services calls\" after implementing Sameday. Similarly, Konnor Buscho from Way Cool Plumbing reported significant enhancements in customer retention and service issue management thanks to Sameday's handling over 4,000 calls in just four months.\n\n**Tags**:  \nSameday is categorized under several relevant tech tags:\n- Artificial Intelligence\n- Generative AI\n- B2B Solutions\n- Sales Enablement\n- Automation\n\n**What’s Next?**  \nIt’s clear that Sameday doesn’t just aim to answer phones; they want to change the game for service businesses across all trades. With a focus on continuous improvement and integration of cutting-edge technology, the journey ahead looks promising. For those interested in seeing this technology in action, Sameday offers demos, making it easy to integrate their solutions without the burden of long-term commitments.\n\nFor more details on Sameday’s offerings and to schedule a demo, you can visit [Sameday's website](https://www.gosameday.com/).\n\nThis is just the beginning for Sameday—a fresh arrival in the home service sector that’s turning missed calls into appointments, one AI conversation at a time.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/8b39343595b0b894931aef81907d8b2a1a47072a.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191910Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=46782dae6d06d161dbffad64df9bb04da4c92d645b2abfa458dbf2d3d2b8d3a9",
    "social_links": [
        "https://www.linkedin.com/company/74740106/admin/"
    ],
    "logo_path": "data/logos\\Sameday_logo.png"
}