{
    "links": "https://www.ycombinator.com/companies/samos-insurance",
    "name": "Samos Insurance",
    "headline": "Accidental Death Insurance for Surgery",
    "batch": "W22",
    "description": "Samos sells accidental death insurance for individuals undergoing surgery. Just like travel insurance but covering a hospital stay.",
    "activity_status": "Active",
    "website": "https://www.samos.insure",
    "founded_date": 2021.0,
    "team_size": 6.0,
    "location": "Kitchener, Canada",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:consumer-health-services; industry:health-tech; industry:healthcare; industry:insurance",
    "founders": [
        {
            "name": "Leon Punambolam, Founder",
            "description": "Accomplished & highly networked insurance executive with broad leadership, strategic, financial, tech, risk management & operational experience. Consistently chosen to lead strategic initiatives ranging from grassroots establishment of businesses, to being seconded as turnaround manager to bring business to the “next level”. A trusted strategist with a talent for translating  broad concepts into clearly articulated business visions & fiscal objectives to drive business growth.",
            "linkedin": "https://www.linkedin.com/in/leonpunambolam/"
        }
    ],
    "status": true,
    "generated_description": "**Samos Insurance: Reimagining Protection for Surgical Risks**\n\nFounded in 2021 and made its way through Y Combinator's Winter 2022 batch, Samos Insurance is based in Kitchener, Canada, and operates with a tight-knit team of six. The company's mission? To provide Accidental Death Insurance specifically for individuals undergoing surgery—a pressing need that many traditional insurance policies overlook.\n\nPicture this: Just like travel insurance but specifically constructed for surgical procedures and associated hospital stays. That's the essence of Samos. Their services aim to alleviate stress by offering straightforward, affordable insurance that provides peace of mind when it’s needed most. Whether you’re preparing for an operation or facing the unthinkable during childbirth, Samos is designed to cover the financial anxiety that comes with surgical risks, or as they put it, \"Protect What Matters Most.\"\n\n### What Makes Samos Stand Out?\n\n1. **Transparent & Accessible**: The insurance application process is refreshingly quick and free from unnecessary complexity. With no medical exams required, applicants can receive coverage approval in as little as five minutes. This speed is crucial for individuals preparing for surgeries that could be daunting enough without the added burden of financial worries.\n\n2. **Giving Back**: Samos has a philanthropic side, committing to donate 10% of proceeds from all policies sold to the Grand River Hospital Foundation, specifically for the Palliative Care unit at Freeport Hospital. This aligns with their ethos of community support and reinforces their commitment to making a positive impact beyond just insurance.\n\n3. **Unique Offerings**: Their products include Surgical Risk Insurance, tailored precisely for those going under the knife, and Birth Coverage Insurance, designed for expectant parents. This specialization fills a critical gap in the insurance market.\n\n4. **Community Recognition**: Samos has already gained accolades for its innovative approach, including the \"Best Business Innovation\" award at the Canadian SME Awards in 2023 and a \"Carrier/Broker Award\" at Insurtech NY. \n\n5. **Commitment to Ease**: In a world where traditional insurance can be convoluted and expensive, Samos aims for streamlined access by utilizing advanced data technology to simplify processes.\n\n### Why Choose Samos?\n\nChoosing Samos means opting for peace of mind. It's about knowing that in the face of surgical risks—an unsettling reality for many—you’ll have a safety net. Their focus on straightforward, no-grey-area policies with no hidden fees means you’re not just purchasing insurance; you’re investing in the emotional relief that comes with it.\n\nIn summary, Samos Insurance isn’t just another player in the crowded insurance market. It’s a startup that presents a thoughtful approach to a genuine need, embodying both innovation and compassion. It invites those who are considering surgery to protect their loved ones during potentially perilous times—making it a forward-thinking choice in healthcare and insurance.\n\nCheck out their offerings at [Samos Insurance](https://www.samos.insure) and consider getting a quote to see how they can best serve you.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/d4489d0fa999c0fbec4b57ad2f6cbdc962db03e0.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191909Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=1a7def3869b7c342cfc1e6644735d4c751484b7f1f486954a29c4f6c4a5f1c2e",
    "social_links": [
        "https://www.linkedin.com/company/samosinsure/",
        "https://twitter.com/samosinsure",
        "https://www.facebook.com/samosinsure"
    ],
    "logo_path": "data/logos\\Samos_Insurance_logo.png"
}