{
    "links": "https://www.ycombinator.com/companies/sanitation-and-health-rights-in-india-shri",
    "name": "Sanitation and Health Rights in India (SHRI)",
    "headline": null,
    "batch": "W16",
    "description": "Sanitation and Health Rights in India (SHRI) fights alongside communities to end open defecation as a key step in an ongoing struggle for health equity and social and economic justice.\n\nThe company has built a toilet that converts poop into methane gas that powers a water filtration system that creates clean drinking water. SHRI then sells the water in the local community to make the whole system sustainable. Source: TechCrunch",
    "activity_status": "Active",
    "website": "http://www.sanrights.org",
    "founded_date": null,
    "team_size": 1.0,
    "location": "India",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": null,
    "founders": [],
    "status": true,
    "generated_description": "Sanitation and Health Rights in India (SHRI) is on a crucial mission to enhance health equity and ensure social and economic justice through improved sanitation. Born out of the determination to tackle the endemic issue of open defecation in India, SHRI is more than just a sanitation provider; it's a community ally striving for a healthier future.\n\nOne of SHRI's innovative solutions is a toilet design that transforms human waste into methane gas, which in turn powers a water filtration system to yield clean drinking water. This water is then sold back to the local community, effectively creating a self-sustaining cycle while addressing critical sanitation and water access issues.\n\nFounded as part of Y Combinator's Batch W16, SHRI is anchored in India with a passionate team focused on this social cause. They are acutely aware of the struggle faced by over 238 million people who lack access to basic sanitation, which unfortunately extends even to children in schools and healthcare facilities.\n\nTheir vision aligns with the belief that high-quality sanitation is a universal right. By enhancing community and institutional sanitation services, SHRI not only alleviates immediate suffering but also seeks to rectify systemic inequities. They are committed to employing people from the very communities they serve, ensuring local insight and empowerment frame their approach. \n\nThe SHRI model stands out for its blend of immediate action and sustainable practices. With a lean team of one, their impact is still significant, boasting 18 facilities and over 2.21 million uses to date, all while keeping the maintenance cost incredibly low at just 0.04 USD per use.\n\nFor anyone curious about their ongoing projects or wanting to support their cause, SHRI provides a wealth of resources including publications, annual reports, and strategic insights available on their [website](http://www.sanrights.org). \n\nIn a world where sanitation often gets overlooked, SHRI is not just filling a gap; they are revolutionizing the way communities access health and sanitation, illustrating that with creativity and commitment, impactful change is possible.",
    "logo": "/logos/medium/missing.png",
    "social_links": [
        "https://www.crunchbase.com/organization/shri"
    ]
}