{
    "links": "https://www.ycombinator.com/companies/saturn",
    "name": "Saturn",
    "headline": "Compliance and back office workflows for Wealth Managers.",
    "batch": "S24",
    "description": "At Saturn, our mission is to make financial peace of mind more accessible by building the best operating system for wealth managers. \r\n\nWealth and Asset Management is one of the world’s highest revenue-generating industries, yet it remains painfully inefficient. The sector relies heavily on disjointed legacy systems, manual human tasks, and a complex web of intermediaries, all of which increase costs. \r\n\nSaturn is an AI-powered operating system for wealth management built to automate investment research, streamline operations, and ensure compliance. Saturn creates the best version of truth, empowering investment advisors to work more efficiently, navigate complex regulatory landscapes, and deliver personalised, high-value services to their clients.\r\n\nToday, Saturn supports over 200 firms globally that manage more than £35bn in assets under management (AUM) and over 200,000 clients.\r\n\nAs the industry grows, it faces massive operational challenges like bad tech, advisor retirements, regulatory pressure, an increased cost base, and transformational opportunities like great intergenerational wealth transfer and changing consumer needs.\r\n\nSaturn aims to be at the forefront of this transformation, driving the future of wealth management.",
    "activity_status": "Active",
    "website": "https://www.SaturnOS.com",
    "founded_date": 2023.0,
    "team_size": 8.0,
    "location": "London, United Kingdom",
    "group_partner": "Tom Blomfield",
    "group_partner_yc": "https://www.ycombinator.com/people/tom-blomfield",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:generative-ai; industry:b2b",
    "founders": [
        {
            "name": "Amal Jolly, Founder/CEO",
            "description": "Financial peace of mind enables every human to achieve more; we are on a mission to make it happen!\n\nExperienced in Product/GTM in Banking, Insurance, Wealth/Asset Management and Capital Markets technologies.",
            "linkedin": "https://linkedin.com/in/amaljolly"
        },
        {
            "name": "Michael Ettlinger, Founder",
            "description": "CTO & Co-Founder at Saturn AI\n\nLaunched AI products used by 20M+ users across various industries. Background in AI research, focused on AI Agents since 2017.",
            "linkedin": "https://www.linkedin.com/in/michaelettlinger/"
        },
        {
            "name": "Rohit Vaish, Founder",
            "description": "President & Co-founder at Saturn. \n\nRohit has expertise in building investment portfolios for Wealth Management firms having spent over 5 years at BNY Mellon. Alongside that, he also led firm wide compliance initiatives across the UK fund management company to assess value for money and client suitability. \n\nAfter leaving financial services, Rohit led Product and Operations teams in a variety of startups before founding Saturn.",
            "linkedin": "https://www.linkedin.com/in/rohit-vaish/"
        }
    ],
    "status": true,
    "generated_description": "### Saturn: Revolutionizing Wealth Management\n\n**Company Overview**  \nFounded in 2023 and based in London, Saturn is an emerging player in the fintech space, specifically designed to address the compliance and operational inefficiencies faced by wealth managers. As part of Y Combinator's Batch S24, Saturn embodies a fresh perspective on modernizing an industry burdened by outdated systems and excessive manual tasks.\n\n**Mission**  \nSaturn’s mission is straightforward: to enhance financial peace of mind for wealth managers by providing them with the best operating system. The firm recognizes that the Wealth and Asset Management industry, while lucrative, is riddled with inefficiencies stemming from legacy technology and fragmented processes. \n\n**Key Offerings**  \nAt its core, Saturn is an AI-powered operating system that automates investment research, streamlines operations, and ensures compliance. This technology doesn’t just make life easier for advisors—it crafts a single source of truth, allowing them to navigate complex regulatory landscapes more effectively and deliver tailored, high-value services to clients.\n\nAs of now, the platform supports over **200 firms** managing more than **£35 billion in assets** and serves over **200,000 clients** worldwide.\n\n**Industry Challenges & Opportunities**  \nSaturn enters a landscape filled with significant challenges, including aging advisors, regulatory pressures, rising costs, and the impending intergenerational transfer of wealth. However, these hurdles also represent transformational opportunities—a chance for wealth management to evolve.\n\n**Team & Leadership**  \nOperating with a compact team of just **8 employees**, Saturn benefits from the insights of its Group Partner, **Tom Blomfield**, a prominent figure in the fintech realm.\n\n**What They Do**  \nSaturn focuses on blending disparate data through industry-specific integrations. Their standout product, **CoPlanner AI**, is designed to fit the unique needs of financial services, employing advanced technology to ensure compliance and quality in data handling without compromising client security. Key features include:\n\n- **Unifying Teams and Data:** Eliminating silos to foster efficiency across functions like financial advising, paraplanning, and compliance.\n- **Increased Efficiency:** Time saved equates to money earned—Saturn aims to reduce administrative tasks significantly, enabling financial advisors to dedicate more time to their clients.\n- **Data Security:** With a commitment to data protection, Saturn ensures that client information remains confidential during AI training processes.\n\n**Achievements**  \nSaturn claims its tools have saved financial advice firms **over 2 million minutes** by streamlining data capture and eliminating duplicate entry. By currently processing **1.4% of UK regulated advice conversations**, it’s clear that Saturn is making strides in enhancing operational efficiencies for financial advisors.\n\n**Looking Ahead**  \nAs Saturn continues to grow, it aims to remain at the forefront of wealth management transformation, not just offering tools, but also fundamentally rethinking how financial advice is delivered. \n\nFor a deeper dive into Saturn and to see how their solutions can enhance your operations, check out their website: [SaturnOS.com](https://www.SaturnOS.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/48c4497b02b8c90c53d3585b47180905187ea95e.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191910Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=dfaf9a4194dd8568a21e608ef0975aa581701270f2a384ca01ba23e6de634ee3",
    "social_links": [
        "https://www.linkedin.com/company/saturntechnology/"
    ],
    "logo_path": "data/logos\\Saturn_logo.png"
}