{
    "links": "https://www.ycombinator.com/companies/savein",
    "name": "SaveIN",
    "headline": "Making private healthcare in India accessible and affordable",
    "batch": "W22",
    "description": "SaveIN connects people with quality healthcare practices near them and enables them to split their entire medical and wellness bills into monthly instalments. \r\n\nOver 80% of healthcare expense in India is borne out of pocket since less than 10% of Indians have private health insurance. On top of this medical inflation is 15% per annum, thereby making paying for private care expensive and frictional.\r\n\n5000+ healthcare practices in India now use SaveIN to be discovered by millions of high intent customers near them and offer instant, monthly payment plans for all healthcare services, thereby making it a win-win proposition for all.",
    "activity_status": "Active",
    "website": "https://www.savein.money/",
    "founded_date": 2022.0,
    "team_size": 60.0,
    "location": "Delhi, India",
    "group_partner": "Michael Seibel",
    "group_partner_yc": "https://www.ycombinator.com/people/michael-seibel",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:marketplace; industry:healthcare",
    "founders": [
        {
            "name": "Jitin Bhasin, Founder",
            "description": "Jitin is a 2X fintech founder and has over 14 years of experience across Banking, Fintech, Insurance and Consulting in India. His previous startup Rupeeredee, a fintech lending company delivered millions in revenue along with profitability. He also held leadership positions at Bankbazaar and Indusind Bank. \nAn electronics engineer by qualification and MBA from Indian Institute of Foreign Trade, he was also adjudged as The Economic Times Young Leader across India",
            "linkedin": "https://www.linkedin.com/in/jitinbhasin/"
        },
        {
            "name": "Gaurav Luthra, Founder",
            "description": "Serial entrepreneur with a decade long experience across consumer-focused domains - lifestyle, F&B, real estate. Experience in creating customer centric propositions.",
            "linkedin": "https://www.linkedin.com/in/gauravluthraa/"
        }
    ],
    "status": true,
    "generated_description": "**SaveIN: Making Healthcare Affordable in India**\n\nFounded in 2022 and based in Delhi, SaveIN aims to tackle a pressing issue: the high out-of-pocket healthcare costs in India. With less than 10% of Indians covered by private health insurance and medical inflation hitting a staggering 15% annually, the challenge is significant. This is where SaveIN steps in.\n\nThe mission of SaveIN is simple yet powerful: to make private healthcare accessible and affordable for everyone. They do this by connecting individuals with quality healthcare providers and offering innovative payment plans that allow users to split their medical expenses into manageable monthly installments. Imagine being able to book a doctor’s appointment or a health service without the burden of paying the total upfront—SaveIN makes that possible.\n\nAs of now, over 5,000 healthcare practices across India leverage SaveIN to reach millions of potential customers. This includes a wide range of healthcare services, from general practice to specialized fields like dentistry, dermatology, and alternative medicine. Through SaveIN, these services come with the flexibility of 0% EMIs (equated monthly installments), effectively removing the financial friction usually associated with healthcare expenses.\n\nWhat's notable is their impressive backing by Y Combinator (Batch W22), which speaks volumes about the potential of the platform. SaveIN has a dedicated team of 60 employees working tirelessly to provide an efficient and user-friendly experience, and Michael Seibel, a renowned figure in the startup ecosystem, serves as their Group Partner.\n\nCustomer satisfaction is evident with glowing testimonials highlighting how SaveIN has transformed their approach to healthcare. From IVF treatments to cosmetic procedures, the platform has enabled users to access necessary medical services that were previously deemed financially unattainable.\n\nIn summary, SaveIN isn’t just a fintech solution; it’s a healthcare revolution that empowers individuals to prioritize their health without the weight of financial stress. For anyone in India seeking reliable healthcare options and flexible payment plans, SaveIN is worth checking out. \n\nFor more information, visit their website at [SaveIN](https://www.savein.money).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/fbf96f6b5e5b2b354b5841afddb927a73fea393e.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191911Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=deaec7ab8568d697e74211e6648f3d189712a18dc5fb2d0c32cd30da77d85b02",
    "social_links": [
        "https://www.linkedin.com/company/saveinmoney",
        "https://twitter.com/SaveINMoney/",
        "https://www.facebook.com/SaveINMoney/",
        "https://www.crunchbase.com/organization/savein"
    ],
    "logo_path": "data/logos\\SaveIN_logo.png"
}