{
    "links": "https://www.ycombinator.com/companies/scentbird",
    "name": "Scentbird",
    "headline": "Scentbird is a luxury fragrance subscription service.",
    "batch": "S15",
    "description": "Scentbird inspires fragrance lovers to go beyond the ordinary and sample scents that evoke passion, confidence, and the unknown. \r\n\nOur mission is to revolutionize the way individuals perfume by bringing the ultimate fragrance playground right to their fingertips. By way of a monthly subscription service (starting at $14.95 a month), members can choose from over 500+ designer colognes and perfumes each month!\r\n\nSee what we're all about at: www.Scentbird.com // @Scentbird\r\n*WE'RE HIRING!: https://www.scentbird.com/careers",
    "activity_status": "Active",
    "website": "https://www.scentbird.com",
    "founded_date": 2013.0,
    "team_size": 165.0,
    "location": "New York",
    "group_partner": "Michael Seibel",
    "group_partner_yc": "https://www.ycombinator.com/people/michael-seibel",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "location:new-york",
    "founders": [],
    "status": true,
    "generated_description": "Scentbird is a luxury fragrance subscription service that was founded in 2013 and is based in New York. The company, which graduated from Y Combinator's S15 batch, aims to redefine how we experience and select perfumes. With a mission to create a “fragrance playground,” Scentbird invites scent enthusiasts to explore beyond the usual offerings.\n\nFor a monthly fee starting at just $14.95, subscribers can select from a dazzling array of over 500 designer perfumes and colognes. This model not only makes high-end fragrances more accessible but also promotes a culture of experimentation and personal expression.\n\nCurrently, Scentbird has grown to a dedicated team of 165 employees and operates under the insightful guidance of Group Partner Michael Seibel. The company focuses on connecting individuals to scents that evoke confidence, passion, and the thrill of discovery, elevating the fragrance experience right at your fingertips.\n\nIf you're passionate about fragrances and intriguing career opportunities, Scentbird is expanding its team! Their website, www.Scentbird.com, showcases their offerings, and you can follow them on social media @Scentbird to keep up with the latest news and updates.\n\nIn summary, Scentbird isn't just about perfumes; it's about creating a personalized journey through scent that inspires and excites.",
    "logo": "/logos/medium/missing.png",
    "social_links": [
        "http://twitter.com/scentbird",
        "https://www.crunchbase.com/organization/scentbird",
        "https://github.com/scentbird"
    ]
}