{
    "links": "https://www.ycombinator.com/companies/scope-ar",
    "name": "Scope AR",
    "headline": "Scope AR is the leading provider of User Guided Augmented Realityâ\u0080¦",
    "batch": "S15",
    "description": "Scope AR is the pioneer of enterprise-class augmented reality (AR) solutions, delivering AR tools for getting workers the knowledge they need, when and where they need it. \r\n\nScope AR is revolutionizing the way enterprises work and collaborate with intuitive augmented reality tools that deliver the real-time knowledge sharing needed to conduct complex remote tasks, employee training, product and equipment assembly, maintenance and repair, field and customer support, and more.\r\n\nRemote AR\r\nRemote AR is an augmented reality telepresence tool; the expert has access to the field technicianâ\u0080\u0099s view through their hardware device (tablet, glasses, or smart phone) and can add or manipulate augmented content to aid the technician in completing the process efficiently and safely.  \r\n\nWorkLink\r\nA product that we can license to our clients, which will allow you to build, deploy, and manage your own augmented reality solutions. WorkLink also provides unprecedented levels of access to information generated by work processes, both active (measurements, photos etc) and passive (date,time and geolocation etc)",
    "activity_status": "Active",
    "website": "http://scopear.com",
    "founded_date": 2011.0,
    "team_size": 50.0,
    "location": "San Francisco",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:saas; industry:augmented-reality; location:san-francisco-bay-area",
    "founders": [],
    "status": true,
    "generated_description": "Scope AR is at the forefront of augmented reality (AR), providing user-guided AR solutions that transform how enterprises approach complex tasks. Founded in 2011 and part of the Y Combinator Batch S15, the company operates out of San Francisco and boasts a dedicated team of about 50 employees. Their mission? To equip workers with the real-time knowledge they need when and where they need it.\n\nTheir flagship product, WorkLink, serves as a powerful AR platform. It allows clients to create, deploy, and manage their own AR solutions, integrating seamlessly with existing workflows. Imagine being able to provide real-time guidance directly to a technician's device, whether it’s a smartphone, tablet, or AR glasses. That’s the magic of Scope AR's Remote AR tool, which opens up a world of possibilities for remote assistance in fields ranging from aerospace to general industrial sectors.\n\nWith a client roster that includes big names like Rolls Royce, Honeywell, and Northrop Grumman, Scope AR has proven its value by offering substantial returns on investment. For instance, companies have reported up to a 99% reduction in pre-work preparation time and saved millions in training travel costs, thanks to the efficiency of their AR solutions.\n\nScope AR is not just releasing products; it’s redefining industries. Its tools enable better remote support, training, maintenance, and inspection processes, ultimately leading to higher accuracy and less downtime in operations. For the enterprise, this means not just keeping pace with technological advancement but truly getting ahead of the curve.\n\nTo learn more about their offerings or to see their technology in action, visit their website at [scopear.com](http://scopear.com). Whether you’re in aerospace, aviation, or general manufacturing, Scope AR is certainly a company that brings the future closer to today’s workforce.\n",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/1b64002bfd5128693ba11306c09f62c4c9e1ee34.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191912Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=3bcc83d8fa6471b2ec61a72ba9805a5024884c68cc34ea905a753b300d8ee4bf",
    "social_links": [
        "https://www.linkedin.com/company/scopear/",
        "https://twitter.com/ScopeAR",
        "https://www.facebook.com/scopear",
        "https://www.crunchbase.com/organization/scopear",
        "https://github.com/scopear"
    ],
    "logo_path": "data/logos\\Scope_AR_logo.png"
}