{
    "links": "https://www.ycombinator.com/companies/seabound",
    "name": "Seabound",
    "headline": "Carbon capture equipment for ships",
    "batch": "W22",
    "description": "Seabound builds carbon capture equipment for ships. We're the only way for existing ships to reduce up to 95% of CO2 emissions and meet new global regulations.",
    "activity_status": "Active",
    "website": "http://seabound.co",
    "founded_date": 2021.0,
    "team_size": 9.0,
    "location": "London, United Kingdom",
    "group_partner": "Gustaf Alstromer",
    "group_partner_yc": "https://www.ycombinator.com/people/gustaf-alstromer",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:hard-tech; industry:climate; industry:transportation",
    "founders": [
        {
            "name": "Alisha Fredriksson, Founder",
            "description": "I’m on a mission to tackle the climate crisis by decarbonizing shipping. Before Seabound, I launched a climate program and built global partnerships at Generation, a non-profit founded by McKinsey & Co. I also helped start a maritime electro-fuel startup (Liquid Wind), climate activist group (Green New Deal London), global university (Minerva University) , and jewelry social enterprise (Seema).",
            "linkedin": "https://www.linkedin.com/in/alishafredriksson/"
        },
        {
            "name": "Roujia Wen, Founder",
            "description": "I have a background in math/CS/physics/sciences and R&D experience in materials, fluid dynamics, and particle physics. Before Seabound, I built machine learning products at Amazon’s Alexa AI, and completed a master’s degree in Theoretical Physics at the University of Cambridge.",
            "linkedin": "https://www.linkedin.com/in/roujia-wen/"
        }
    ],
    "status": true,
    "generated_description": "**Seabound** is a pioneering company based in London, founded in 2021 as part of Y Combinator’s Batch W22. Their mission is straightforward yet ambitious: to equip ships with the technology to capture carbon emissions effectively. This is crucial in an era where the shipping industry faces increasing pressure to meet new global emissions regulations. \n\n### The Problem\nShipping contributes significantly to global CO2 emissions, yet shipowners have been limited in their options for compliance and sustainability. Future fuels are still a long way off, and traditional efficiency measures just aren’t cutting it. \n\n### The Solution\nEnter Seabound's retrofittable carbon capture system, which can help vessels reduce CO2 emissions by up to 95%. Their effective design allows for quick installation at minimal capital expenditure (CAPEX), capturing between 25-95% of emissions by converting CO2 into solid, easy-to-store carbonate pebbles. They also provide a streamlined operation: capturing, offloading, and recycling these pebbles at key ports. Simply put, Seabound offers shipowners a proven technology that addresses a pressing challenge today.\n\n### Team & Partners\nSeabound is led by co-founder and CEO Alisha Fredriksson, who brings significant experience from her work with maritime startups and climate initiatives. The team consists of nine individuals, including experts in engineering and research, crucial for innovating their carbon capture technology. Their strategic partnerships with firms like Lowercarbon Capital and Eastern Pacific Shipping bolster their credibility and outreach.\n\n### Why It Matters\nThe stakes are high; shipping drives 90% of the world’s economy. By adopting Seabound’s technology, shipowners can not only comply with upcoming regulations but also position themselves as leaders in the decarbonization of their industry. \n\n### The Takeaway\nSeabound isn’t just a tech company; it's a response to a crucial need in climate action and oceanic sustainability. They're offering a tangible way for the shipping sector to take charge of its carbon output while rethinking its environmental impact. If you're interested in learning more or looking to get involved, check out their website at [seabound.co](http://seabound.co) or reach out directly via their contact page.\n\nIn a world hungry for solutions, Seabound is charting a path for innovation in maritime carbon capture. Let's just say they’re not waiting for the future—they’re building it now.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/ab3e860fd709c017779b897322f8b5e02c7fa1d3.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191913Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=c6a6bbe1704b8e2c377ad85246ac83a6ba88c874e2005b56026622e4a7f3b18a",
    "social_links": [
        "https://www.linkedin.com/company/seabound/"
    ],
    "logo_path": "data/logos\\Seabound_logo.png"
}