{
    "links": "https://www.ycombinator.com/companies/seaflight-technologies",
    "name": "Seaflight Technologies",
    "headline": "We make the world's most efficient aircraft",
    "batch": "S22",
    "description": "Seaflight Technologies has developed a new form of Aerodynamic Flow Control for electrified aircraft that increases range and payload by 30%. That's the same performance improvement you'd get from hopping in a DeLorean to 2035 and coming back with batteries from the future. But it's available today - our tech has been derisked by testing supported by the National Science Foundation, the US Air Force, and the Australian Government. \r\n\nOur first product is a simple fixed-wing large cargo drone that is efficient enough to remove the \"green penalty\" currently associated with electric aviation. That's a step change from today's conventional platforms.  \r\n\nFirst generation electric aircraft are heavy, expensive, complicated, and limited in terms of range and payload. In the entire history of aviation, that's never been a winning formula. When everyone already has access to the same batteries, materials, and motors, what really makes the difference? The answer is revolutionary aerodynamics, but in a form factor that suits today's operations and manufacturing. \r\n\nBeyond our own drone product line, we have partners across Aerospace helping incorporate our tech into their products. In the future, if you want to have the most efficient and cost-effective flying machine of any description, you'll need Seaflight's Flow Control inside.",
    "activity_status": "Active",
    "website": "https://www.seaflight.tech",
    "founded_date": 2022.0,
    "team_size": 4.0,
    "location": "Carson, CA",
    "group_partner": "Jared Friedman",
    "group_partner_yc": "https://www.ycombinator.com/people/jared-friedman",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:robotics; industry:airplanes; industry:logistics; industry:climate; industry:transportation",
    "founders": [
        {
            "name": "Graham Doig, Founder",
            "description": "Graham Doig, founder/CEO of Seaflight Technologies, has >18 years experience across aerospace and automotive, and in academia with over 90 technical papers to his name as a Lockheed Martin-endowed professor. After his PhD on the aerodynamics of low altitude flight, he led the aero/range team at EV startup Canoo from early through SPAC, and conducted funded research programs with NASA, Tesla, and Joby Aviation. He designed 2 solar-electric vehicles which set international land speed records.",
            "linkedin": "https://www.linkedin.com/in/graham-doig/"
        }
    ],
    "status": true,
    "generated_description": "Seaflight Technologies, founded in 2022 and currently part of Y Combinator's S22 batch, is on a mission to revolutionize aviation by creating the world's most efficient aircraft. Based in Carson, California, Seaflight has developed an innovative Aerodynamic Flow Control technology that enhances the range and payload of electrified aircraft by an impressive 30%. Think of it as borrowing a time machine's advantage—like bringing back futuristic batteries—except it's here and ready to deploy.\n\nTheir flagship product is the AURAE, a fixed-wing cargo drone designed to eliminate the \"green penalty\" often associated with electric aviation. Unlike first-generation electric aircraft that tend to be heavy, expensive, and limited in capacity, Seaflight’s drones offer a step-change in performance. They’re built to work smarter, not harder, leveraging revolutionary aerodynamics to maximize efficiency. This approach makes Seaflight’s drones capable of same-day air cargo delivery—without the environmental drawbacks.\n\nSeaflight isn’t just stopping at its drone. The company is collaborating with partners throughout the aerospace industry to embed its groundbreaking aerodynamic technology into various aircraft, shaping a future where efficiency is paramount in both design and operation.\n\nWith a small but mighty team of four, under the mentorship of Jared Friedman, Seaflight is set on a path toward achieving its ambitious vision. If you want to follow their journey and learn more about their technology, you can check them out at [Seaflight Technologies](https://www.seaflight.tech).\n\nIn summary, Seaflight Technologies is tackling the future of aviation head-on, making strides toward a more sustainable and efficient airborne logistics landscape. They believe that with the right aerodynamics, the skies aren't the limit—they're just the beginning.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/9b4b5b68e9a041eb98481deff74aea02e36bb783.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191914Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=e1d669b79ce27e46ae7b35c8b706955b167a4eddc347963b237abba05d327bf7",
    "social_links": [
        "https://www.linkedin.com/company/seaflight-technologies"
    ],
    "logo_path": "data/logos\\Seaflight_Technologies_logo.png"
}