{
    "links": "https://www.ycombinator.com/companies/seer",
    "name": "Seer",
    "headline": "Sell beyond the store.",
    "batch": "W21",
    "description": "Seer helps retail salespeople create and send personalized shoppable Lookbooks to their customers via email and sms.",
    "activity_status": "Active",
    "website": "https://www.helloseer.com/",
    "founded_date": 2019.0,
    "team_size": 4.0,
    "location": "Menlo Park, CA",
    "group_partner": "Brad Flora",
    "group_partner_yc": "https://www.ycombinator.com/people/brad-flora",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:saas; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Christina Czap, Founder",
            "description": "Christina is a former Director at Vogue and top grossing salesperson at some of the most recognizable companies and brands such as Moda Operandi, Alexander McQueen and Miu Miu.",
            "linkedin": "https://www.linkedin.com/in/christina-czap/"
        },
        {
            "name": "Felipe Saint-Jean, Founder",
            "description": "Felipe has a PhD from Yale in Computer Science and is a visionary developer whose platforms have millions of users. He has been behind some of the most innovative and progressive products in both the consumer and B2B space. From the creation of a remote learning solution for NY DoE, to fanning the flames of global football fans via the most downloaded fantasy gaming app in the world to working with the government in South America on building effective education software.",
            "linkedin": "https://www.linkedin.com/in/felipe-saint-jean-8151a72a/"
        }
    ],
    "status": true,
    "generated_description": "**Seer: Selling Beyond the Store**\n\nFounded in 2019 and incubated in Y Combinator's W21 batch, Seer is taking the luxury retail market by storm from its Menlo Park, CA headquarters. With a dedicated team of four—including industry veterans like CEO Christina Czap, a former Vogue Director, and CTO Felipe Saint-Jean, a renowned entrepreneur—the company is laser-focused on empowering luxury sales associates.\n\n### Mission Statement\nSeer's mission is simple yet profound: to sell beyond the store. They achieve this by enabling retail salespeople to design and distribute personalized, shoppable Lookbooks that captivate customers.\n\n### The Problem They Solve\nSales associates in luxury retail face a mountain of challenges—hours spent on tedious tasks like sourcing quality images and crafting detailed recommendations can sap their time and creativity. Christina Czap's firsthand experiences as a top-grossing stylist shaped the vision for Seer. She curated the platform to streamline the creation of bespoke, magazine-style content that resonates with discerning clients, eliminating operational headaches.\n\n### Key Features\n1. **Quick Content Creation**: Seer allows you to whip up personalized, click-worthy content in a matter of minutes. No need for complex design software; it’s all about creating shoppable edits that look fabulous.\n   \n2. **Multi-channel Communication**: Whether clients prefer an email, text message, or video chat, Seer ensures that content is delivered in a way that suits them best.\n\n3. **Performance Tracking**: The platform helps you monitor real-time engagement metrics like opens, clicks, and views, empowering sales associates to follow up effectively and close deals faster.\n\n### Founders' Background\n- **Christina Czap**, CEO: With over 15 years in luxury retail, Christina has graced the sales floors of high-end brands like Prada and Alexander McQueen. Her deep understanding of client expectations and sales associate needs informed the creation of Seer.\n  \n- **Felipe Saint-Jean**, CTO: Felipe boasts a wealth of experience from building platforms that cater to millions, including educational solutions and popular gaming apps. His technical prowess complements Christina's industry insights to build a seamless user experience.\n\n### Why It Matters\nIn an increasingly digital marketplace where consumers expect exceptional experiences, Seer equips luxury sales professionals with the tools they need to meet and exceed these expectations. By combining elegance with efficiency, Seer not only helps sales associates sell more but also elevates the overall customer experience.\n\nAs the retail landscape shifts, Seer positions itself as a vital ally for luxury brands aiming to thrive in a future where customer engagement and personalized service reign supreme. \n\nFor anyone looking to enhance their luxury retail game—or just curious about this innovative platform—check out [Seer's website](https://www.helloseer.com/). \n\nIn essence, Seer embodies the age-old adage: necessity is the mother of invention, perfectly honed by the trials of experience. And they’re here to help the fashion world move forward.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/6a9c9ba953355138b9eec7df3c63a1c6b18b28f2.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191914Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=19806c0983828ed22f1807c575c899df307f58dd37e4d049267184aeef9da9a7",
    "social_links": [
        "https://www.linkedin.com/company/helloseer/about/"
    ],
    "logo_path": "data/logos\\Seer_logo.png"
}