{
    "links": "https://www.ycombinator.com/companies/sekilo",
    "name": "Sekilo",
    "headline": "Poultry processing & supply chain for the SME foodservice industry.",
    "batch": "W22",
    "description": "Sekilo - Poultry processing & supply chain for the SME foodservice industry.\r\n\nA category-first consumer food company is revolutionizing the poultry industry with innovative technology. At the forefront of poultry distribution and processing, our robust supply chain, fortified with stringent cold chain control, guarantees excellence from procurement to final delivery, setting a new industry standard. Our unwavering commitment addresses client pain points—ensuring unparalleled quality, hygiene, freshness, and multiple drops with a low MOQ.\r\n\nAs a startup deeply rooted in logistics and supply chain expertise, Sekilo is the trusted partner for the diverse needs of the middle-downstream foodservice sector. Delivering cutting-edge solutions in warehouse management, inventory control, operations, delivery logistics, customization, and processing management, we cater to catering SMEs, HORECA chains, industry players, e-grocery startups, and D2C processed meat factories. Embracing technology, Sekilo optimizes Indonesia's poultry supply chain.\r\n\nWith robust supply chain capabilities, customization, an efficient business model, and an unwavering commitment to consistency, Sekilo is reshaping the poultry distribution and processing landscape.",
    "activity_status": "Active",
    "website": "https://sekilo.com/en/",
    "founded_date": 2019.0,
    "team_size": 11.0,
    "location": "Jakarta, Indonesia",
    "group_partner": "Gustaf Alstromer",
    "group_partner_yc": "https://www.ycombinator.com/people/gustaf-alstromer",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:supply-chain; industry:food",
    "founders": [
        {
            "name": "Chandni Chainani, Founder",
            "description": "Spent the last 8 years building businesses from the ground up, touching base with departments such as erp, hrms, fintech, sales & growth. She started Dropezy with one goal - to change the fact that <0.5% of grocery spend was online despite having a $116B market. Most don’t know that this journey began in her apartment where together with Nitesh, they packed and delivered their first 200 orders orders themselves. Today, her focus is to make e-groceries fast, convenient & accessible for all.",
            "linkedin": "https://www.linkedin.com/in/chandni-chainani/"
        },
        {
            "name": "Nitish Chellaram, COO & Co-Founder",
            "description": "Nitish Chellaram is the co-founder and COO of Sekilo. His vision is for Sekilo to be Indonesia's leading Poultry distributor that helps deliver poultry to the Warungs (SME's) across Indonesia. Giving them access to not only competitive pricing & good quality but also the opportunity to attain a HALAL certificate, purchase in low MOQ's as well as financing options to further accelerate their growth.",
            "linkedin": "https://www.linkedin.com/in/nitishchellaram/"
        }
    ],
    "status": true,
    "generated_description": "**Sekilo: Revolutionizing Poultry for SMEs in Indonesia**\n\nFounded in 2019 and part of Y Combinator's W22 batch, Sekilo is a startup based in Jakarta, Indonesia, that’s making waves in the poultry processing and supply chain industry. Its mission? To streamline and innovate the poultry supply for small and medium-sized enterprises (SMEs) in the food service sector.\n\nAt its core, Sekilo is about rethinking how poultry is processed and distributed. They offer a robust supply chain fortified with a stringent cold chain control, ensuring that quality, hygiene, and freshness are never compromised. With a focus on technology, Sekilo optimizes logistics, warehouse management, and inventory control to create a seamless experience from procurement to delivery. They cater to a diverse clientele, including caterers, hotels, restaurants, e-grocery startups, and processed meat factories.\n\n### What Sets Sekilo Apart?\n\n1. **Tailored Solutions**: Sekilo understands that the food service industry is diverse. They offer customization options—from marination and repackaging to low minimum order quantities (MOQs) and hyper-local deliveries. This flexibility enables them to cater to the unique needs of their clients, which can range from small deliveries of just 25 kilograms to large orders of 20 tonnes.\n\n2. **Cutting-Edge Technology**: The company leverages advanced technologies to manage operations, ensuring a quality-driven process. Their commitment to Halal and NKF certifications reflects their dedication to compliance and quality assurance, providing trust to their partners.\n\n3. **Personal Touch**: With a small team of 11 people, Sekilo prides itself on personalized customer support. Dedicated sales agents ensure that each client's unique needs are met efficiently, enhancing the overall buying experience.\n\n4. **Strong Logistics Backbone**: Their logistics model is designed for reliability, with end-to-end inventory management and attentive customer care, ensuring timely deliveries tailored to buyer protocols.\n\nAs the poultry industry continues to evolve, Sekilo stands at the forefront, committed to excellence in every step of the supply chain. Their network and expertise make them a trustworthy partner for SMEs looking to enhance their poultry sourcing.\n\nFor more details about Sekilo and their offerings, check out their website: [Sekilo](https://sekilo.com/en/).\n\nSo, if you're in the food service industry in Indonesia and need a partner that truly understands your challenges, Sekilo might just be the solution you’re looking for.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/15587fbf2302f9aa17c74d21bff9312343dd627b.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191915Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=29d61c96899fdd42c9ec34dc145331d528d070ece98574e56aa9511dcdb1717d",
    "social_links": [
        "https://id.linkedin.com/company/sekilo",
        "https://www.crunchbase.com/organization/dropezy"
    ],
    "logo_path": "data/logos\\Sekilo_logo.png"
}