{
    "links": "https://www.ycombinator.com/companies/sensible-biotechnologies",
    "name": "Sensible Biotechnologies",
    "headline": "Unlocking the next generation of mRNA medicines",
    "batch": "S21",
    "description": "The future of mRNA therapeutics is hampered by manufacturing challenges and unless solved, its exciting potential may never be realised. Sensible enables the next generation of mRNA medicines by turning living cells into factories producing abundant, highly stable and non-immunogenic mRNA in a scalable and cost-effective way.",
    "activity_status": "Active",
    "website": "https://sensible.bio",
    "founded_date": 2021.0,
    "team_size": 22.0,
    "location": "Oxford, United Kingdom",
    "group_partner": "Jared Friedman",
    "group_partner_yc": "https://www.ycombinator.com/people/jared-friedman",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:synthetic-biology; industry:biotech; industry:manufacturing; industry:therapeutics; industry:biotechnology",
    "founders": [
        {
            "name": "Miroslav Gasparek, Founder",
            "description": "I am Miro, CEO and Co-Founder of Sensible Biotechnologies. We build a cell-based platform for cost-efficient and scalable production of high-quality mRNA to unlock next generation of mRNA medicines.\n\nMy background is in computational modeling of biological systems and bioengineering. I have worked on developing Slovak national biosecurity policies - I am passionate about building biotech ecosystem in Eastern Europe. I studied Bioengineering at Imperial College London and Engineering at Oxford.",
            "linkedin": "https://www.linkedin.com/in/miroslavgasparek/"
        },
        {
            "name": "Marian Kupculak, Founder",
            "description": "I am Marian, the Chief Scientific Officer and co-founder of Sensible Biotechnologies. We are building a new platform for cost-efficient and scalable manufacturing of high-quality mRNA.\n\nI have more than 9 year of experience in biochemistry and molecular biology, more specifically in cellular engineering and downstream processing. I am interesting in engineering cells to produce high-quality proteins and nucleic acids.\n\nI did my  PhD in Biochemistry at the University of Oxford, UK.",
            "linkedin": "https://www.linkedin.com/in/marian-kupculak-34468a85/"
        }
    ],
    "status": true,
    "generated_description": "### Sensible Biotechnologies: A New Era in mRNA Manufacturing\n\n**Overview**\n\nFounded in 2021 and part of Y Combinator’s Batch S21, Sensible Biotechnologies is on a mission to revolutionize mRNA medicines. Headquartered in Oxford, UK, the company employs 22 talented individuals, bringing together expertise from various fields of biotechnology and synthetic biology.\n\n**Mission**\n\nSensible Biotechnologies aims to unleash the full potential of mRNA therapeutics, which have been largely constrained by outdated manufacturing methods. They plan to address manufacturing challenges by creating a new paradigm for producing high-quality, non-immunogenic, and scalable mRNA. This innovation not only promises enhanced efficacy in treatments but also focuses on strengthening global biosecurity through improved manufacturing infrastructure.\n\n**The Platform**\n\nThe company leverages a cutting-edge cell-based platform that facilitates rapid and efficient production of mRNA:\n- **Long mRNA**: Enabling novel mRNA modalities.\n- **Naturally Modified mRNA**: Boosting therapeutic efficacy.\n- **Cost-effective Manufacturing**: Increasing accessibility to mRNA technology.\n- **Scalability**: Reinforcing supply chain resilience.\n\nSensible is integrating approaches from cell engineering, computational biology, and precision fermentation to realize these objectives.\n\n**Founders & Key Team Members**\n\n- **Miroslav Gasparek** (CEO): With a bioengineering background from Imperial College and experience consulting in life sciences, Miro’s work includes tie-ins with the WHO and biosecurity innovations.\n  \n- **Dr. Marian Kupculak** (CSO): An expert in Molecular Biology from Oxford, Marian has extensive cellular engineering experience from prominent European research centers.\n  \n- **Paul Sobotka, MD** (VP of Clinical Research): A seasoned entrepreneur and medical expert with over 200 publications, he has also held C-suite roles in several medical startups.\n\n- **Anton McCaffrey, PhD** (VP of Manufacturing Strategy): A veteran in mRNA production, Anton brings a decade of experience from TriLink BioTechnologies.\n\nThe team also includes experts in various scientific fields, including manufacturing, operations, and computational biology, each with impressive academic and professional backgrounds.\n\n**Investments and Partnerships**\n\nSensible has already raised $4.2 million in a pre-seed round to enhance its innovative manufacturing technology. Partnerships with notable organizations like Ginkgo Bioworks are paving the way for creating an in vivo mRNA manufacturing platform, showcasing their ambition to be at the forefront of this booming sector.\n\n**Why It Matters**\n\nSensible Biotechnologies stands at the intersection of innovative science and public health. Their focus on mRNA manufacturing not only promises to improve the therapeutic landscape but also aims to ensure that the benefits of these advancements are accessible and secure for global health. With their groundbreaking work, they are positioned to unlock the potential of mRNA therapeutics in ways we’ve only begun to imagine.\n\nTo learn more about their innovative approach, explore their [website](https://sensible.bio).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/8bf8a471fd5530edf4be59ed8109b34875b4fe84.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191918Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=993d996194c1a85342cb87ac5ec8b46feff7e4f9509784ec9bf7202bec3e681e",
    "social_links": [
        "https://www.linkedin.com/company/sensible-biotechnologies/",
        "https://twitter.com/sensible_bio",
        "https://www.facebook.com/SensibleBiotechnologies",
        "https://www.crunchbase.com/organization/sensible-biotechnologies"
    ],
    "logo_path": "data/logos\\Sensible_Biotechnologies_logo.png"
}