{
    "links": "https://www.ycombinator.com/companies/senso",
    "name": "Senso",
    "headline": "AI-Powered Knowledge Base for Customer Support",
    "batch": "W24",
    "description": "Senso is building an AI-powered knowledge base for customer support, starting in the Credit Union space.  Our product reduces contact time by over 10x by enabling support teams to make decisions about customer requests in seconds.  Bringing service automation to the financial services industry is a $6B opportunity, and we’re building for all regulated industries where Senso's founders have spent over a decade building enterprise software.",
    "activity_status": "Active",
    "website": "http://www.senso.ai",
    "founded_date": 2017.0,
    "team_size": 2.0,
    "location": null,
    "group_partner": "Tom Blomfield",
    "group_partner_yc": "https://www.ycombinator.com/people/tom-blomfield",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": null,
    "founders": [
        {
            "name": "Saroop Bharwani, Founder",
            "description": "Saroop Bharwani, a tech entrepreneur and AI thought leader, is the co-founder of Senso.ai, a company that delivers generative AI solutions to enterprises preparing to compete in the Age of AI.",
            "linkedin": "https://linkedin.com/in/saroopbharwani"
        },
        {
            "name": "Thomas Nelson, Founder",
            "description": "Innovative tech leader and AI enthusiast, Thomas is passionate about harnessing technology to enhance business intelligence and productivity. His diverse background in computer science and neuroscience, coupled with hands-on experience in startups and tech development, drives his success at Senso.ai.",
            "linkedin": "https://ca.linkedin.com/in/thomas-nelson-35137b155"
        }
    ],
    "status": true,
    "generated_description": "### Senso: Transforming Customer Support with AI\n\n**Company Overview:**\nSenso is a startup founded in 2017, operating out of an undisclosed location, and it’s backed by the prestigious Y Combinator (Batch W24). The company specializes in creating an AI-powered knowledge base focused on enhancing customer support, particularly within the financial services sector, with initial efforts aimed at credit unions. Senso operates with a small team of two, harnessing years of experience in enterprise software development.\n\n**Mission:**\nSenso's mission is to revolutionize customer support with cutting-edge AI technology, enabling organizations to respond to customer inquiries and requests much faster, ultimately reducing contact time by over tenfold. The AI platform is built to serve all regulated industries, tapping into a $6 billion market opportunity for service automation.\n\n**Product Offerings:**\nSenso's primary solution allows support teams to make decisions regarding customer requests in mere seconds. The highlights of their offerings include:\n- **Agent Echo**: This AI agent automates the tagging of calls and queries across various platforms, streamlining processes.\n- **Agent Fetch**: Designed to quickly identify missing information in essential documents such as policies or user guides, making the retrieval of necessary details seamless.\n\n**Impact and Results:**\nThrough Senso's platform, organizations can drastically cut down on the time staff spends trying to retrieve information, achieving up to 12 times faster document retrieval. Feedback from credit union partners indicates that support teams now provide answers in seconds instead of minutes, significantly enhancing member satisfaction and operational efficiency.\n\n**Testimonials:**\nSeveral leaders in the credit union space have praised Senso for its transformative impact:\n- Whitney Hawks, VP of Mortgage Operations, emphasized the ease of access to crucial job aids and guides.\n- Joey Rudisill, CIO, noted the real-world effectiveness of Senso's AI initiatives, highlighting the company's commitment to practical applications.\n- Steve O’Donnell, CFO, pointed out how Senso is not just keeping pace with technology but is positioning his organization as a leader in innovation.\n\n**Future Prospects:**\nWith a focus on continuous improvement and real-world applicability, Senso is poised to lead the charge in future-proofing the operational capabilities of credit unions and other financial services through AI. The groundwork laid by Senso indicates a promising shift toward a smarter, more agile customer service infrastructure across regulated industries.\n\nFor more information or to schedule a demo, visit their website at [Senso.ai](http://www.senso.ai).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/8a66a26442c973c52e74c5fca7d5d716f442c797.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191917Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=986dd0ee51d5d24394ef8e5b6eea9a37c3a49d0a68dc761d77d216e3e9dd506d",
    "social_links": [
        "https://www.linkedin.com/company/senso.ai",
        "https://twitter.com/gosenso",
        "https://www.facebook.com/sensoai",
        "https://www.crunchbase.com/organization/senso-2"
    ],
    "logo_path": "data/logos\\Senso_logo.png"
}