{
    "links": "https://www.ycombinator.com/companies/sequence-bio",
    "name": "Sequence Bio",
    "headline": "Discovering the true signals of disease to power life-changing drugs.",
    "batch": "S19",
    "description": "90% of drug candidates fail, delaying help for those in need. We’re on a mission to change that. Better drug target discovery powered by the Newfoundland founder effect.",
    "activity_status": "Active",
    "website": "https://www.sequencebio.com/",
    "founded_date": 2013.0,
    "team_size": 52.0,
    "location": "St. John's, Canada",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:genomics; industry:therapeutics; industry:drug-discovery",
    "founders": [
        {
            "name": "Jeremy Grushcow",
            "description": "Ph.D. in Molecular Genetics and Cell Biology (University of Chicago, 2000); J.D. with Honors (University of Chicago Law School, 2003).\n\nPreviously: CBO, Sequence Bio S19 (Raised >$10m; LOIs signed with Sema4, Helix and Biogen); EVP, Strategic Development, Antibe Therapeutics (International partnerships, public company financings and disclosures; preclinical through Phase 1 for a novel pain therapeutic)\n\nBest dog dad ever; 7 out of 10 human dad.",
            "linkedin": "https://www.linkedin.com/in/jeremygrushcow/"
        },
        {
            "name": "Chris Gardner",
            "description": null,
            "linkedin": "https://www.linkedin.com/in/chriscgardner/"
        }
    ],
    "status": true,
    "generated_description": "Sequence Bio is a biotech company headquartered in St. John's, Newfoundland and Labrador, Canada. Founded in 2013, they emerged from Y Combinator's Batch S19 with a mission to revolutionize drug discovery. Their goal? To tackle the staggering statistic that 90% of drug candidates fail, leading to delays in delivering lifesaving treatments to those in need. By focusing on better drug target discovery informed by the unique genetic landscape of Newfoundland, they’re redefining the way we approach therapeutics.\n\nThe company boasts a team of 52 dedicated professionals, all united under the vision of transforming disease signals into actionable insights for drug development. With a focus on genomics, therapeutics, and drug discovery, Sequence Bio uses an integrated approach combining multi-omics data, real-world patient information, and well-characterized health records. This methodology allows them to identify low-frequency, high-impact genetic variants much more efficiently than traditional methods can.\n\nIn recent developments, they’ve made headlines by appointing Dr. Tom Barber as their Chief Scientific Officer and collaborating with Memorial University on studying the genetics of multiple sclerosis. Such collaborations underscore their commitment to leveraging local insights for global health advancements.\n\nTheir leadership team includes experts in various fields, from data science to policy planning, ensuring a robust framework to support their ambitious goals in research and development. They emphasize a commitment not just to scientific excellence, but to improving health outcomes faster through custom discovery cohorts, working closely with leading pharmaceutical and biotech firms.\n\nFor anyone intrigued by the blend of innovation in genomics and practical therapeutic applications, Sequence Bio is a company to watch. They’re not just another biotech firm; they’re positioning themselves as catalysts for change in a field where the stakes are literally life and death. \n\nIf you're keen to learn more, check out their website at [Sequence Bio](https://www.sequencebio.com/) for the latest on their research, press releases, and career opportunities.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/608772defc63e9bc94d90bd54e4d49f790ceddef.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191917Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=879d6a907ba755293e6fbf14476c681b787ca50a0e59286bff226f0d961282e1",
    "social_links": [
        "https://www.linkedin.com/company/sequencebioinformatics",
        "https://twitter.com/sequencebio",
        "https://www.crunchbase.com/organization/sequence-bio",
        "https://github.com/SequenceBio"
    ],
    "logo_path": "data/logos\\Sequence_Bio_logo.png"
}