{
    "links": "https://www.ycombinator.com/companies/sequin",
    "name": "Sequin",
    "headline": "Sequin is the first debit card designed for women.",
    "batch": "S21",
    "description": "Sequin (Y Combinator) is the first debit card designed to reward women where we're spending with up to 6% cashback on beauty, drugstores, gyms, local salons, and more! Cardmembers gain access to high interest checking, financial education, and a community of ambitious women. Plus, each Sequin Card is customized with a money mantra!\r\n\nVrinda Gupta, the founder and CEO, launched the Chase Sapphire Reserve at Visa, where she was rejected from the credit card she built! She learned that 70% of women today were making avoidable financial mistakes like she was, and embarked on a mission to close gender-based financial gaps. She teamed up with ex-PayPal engineering leader, Mark Thomas, co-founder and CTO, to build a membership-based banking designed to empower women financially.\r\n\nSequin is backed by high-profile investors such as the Schwab Family, Y Combinator, and IDEO Ventures and is an official Visa partner. The team plans to expand its offerings into a $65B largely untapped market for women's financial products from first bank account to retirement products.",
    "activity_status": "Active",
    "website": "http://www.sequincard.com",
    "founded_date": 2019.0,
    "team_size": 3.0,
    "location": "San Francisco",
    "group_partner": "Dalton Caldwell",
    "group_partner_yc": "https://www.ycombinator.com/people/dalton-caldwell",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:consumer; industry:consumer-finance; industry:femtech; industry:diversity-&-inclusion; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Vrinda Gupta, Founder",
            "description": "Vrinda Gupta is the CEO & Co-Founder of Sequin, a fintech on a mission to empower women financially. She founded Sequin after being rejected from the very credit card she helped launch (the Chase Sapphire Reserve) at Visa Inc. Vrinda holds an M.B.A from Berkeley Haas and a B.A. from UCLA. She is a proud first-generation Indian immigrant and currently lives in San Francisco, California.",
            "linkedin": "https://www.linkedin.com/in/vrindag/"
        },
        {
            "name": "Mark Thomas, Founder",
            "description": "CTO & Co-founder at Sequin Financial",
            "linkedin": "https://www.linkedin.com/in/markmthomas/"
        }
    ],
    "status": true,
    "generated_description": "Sequin is a groundbreaking fintech company based in San Francisco, founded in 2019 as part of Y Combinator's Batch S21. Led by CEO Vrinda Gupta, who previously played a pivotal role in launching the Chase Sapphire Reserve card at Visa, Sequin set out to address a significant gap in financial products designed specifically for women. After experiencing a rejection from the card she helped create, Gupta recognized that women often encounter unique challenges in navigating the financial landscape, contributing to common financial mistakes.\n\nThe Sequin debit card rewards its users with up to 6% cashback on purchases from beauty stores, gyms, local salons, and more, intentionally targeting the spheres where women spend most. Beyond this, cardholders benefit from high-interest checking accounts, access to financial education, and a supportive community of ambitious women. Each card is personalized with a motivational money mantra.\n\nSequin is well-backed, boasting investors like the Schwab Family, IDEO Ventures, and Y Combinator. About 92% of its investors are female angels, demonstrating a commitment to diversity. The company's mission involves tapping into the $65 billion market for women's financial products, including everything from basic bank accounts to retirement plans.\n\nSequin's core mission is to recognize women's financial power and fight against inequities, such as the notorious Pink Tax, which disproportionately affects women. The small team of three is ambitious, aiming to reshape how women engage with their finances, combining head, heart, and practical action into their approach.\n\nFor more information, you can check out Sequin's website at http://www.sequincard.com.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/c32432663a1688146573da602743c783ff8704bf.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191918Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=b33be663e3b082cf5b3c8607f5a93b9e24c520d5db96c0742defb7726f594680",
    "social_links": [
        "https://www.linkedin.com/company/sequin-financial",
        "https://twitter.com/sequin_card",
        "https://www.facebook.com/sequincard/",
        "https://www.crunchbase.com/organization/sequin-financial"
    ],
    "logo_path": "data/logos\\Sequin_logo.png"
}