{
    "links": "https://www.ycombinator.com/companies/sfa-therapeutics-inc",
    "name": "SFA Therapeutics",
    "headline": "Regulating the immune system to block cancer & autoimmune diseases",
    "batch": "S21",
    "description": "SFA Therapeutics is creating therapeutically-tailored oral drugs that regulate the immune system; with a focus on autoimmune diseases and cancers that originate from chronic inflammation. There are over 300 million patients who suffer from autoimmune diseases. Our treatment is designed to block the root cause of many of these chronic inflammatory diseases, with safe oral drugs. We have strong clinical data from a phase 1b clinical trial in psoriasis, and human data in pancreatic cancer, uveitis and NASH. we have a total of 9 drugs in our pipeline and 15 patents.",
    "activity_status": "Active",
    "website": "https://sfatherapeutics.com/",
    "founded_date": 2016.0,
    "team_size": 4.0,
    "location": "Philadelphia, PA",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:ai-powered-drug-discovery; industry:anti-aging; industry:biotech; industry:health-&-wellness; industry:biotechnology",
    "founders": [
        {
            "name": "Ira Spector, Founder",
            "description": "Dr. Spector is the co-founder of SFA, a microbiome-derived pharmaceutical company focused on new advancements in the treatment inflammatory diseases. An experienced drug developer with over 30 years of experience, he helped develop 34 drugs and 12 medical devices, including Enbrel, Effexor, Protonix, Prevenar, Ozurdex, Botox for Overactive Bladder, Chronic Migraine and Cerebral Palsy. He holds BS degrees in Physics and EE from Washington University, an MBA from Drexel, and a PhD from Rutgers.",
            "linkedin": "https://www.linkedin.com/in/ira-spector-00414310/"
        },
        {
            "name": "Alla Arzumanyan, Founder",
            "description": "MS is Microbiology,\nPhD in Biotechnology,\nAssistant Professor at Temple University,\nCo-Founder and Co-Inventor at SFA Therapeutics, Inc.\nPerformed a case-control, Proof-of-Activity Human study to evaluate treatment effect of SFA002 drug (proprietary of SFA Therapeutics, Inc.) on patients with plaque psoriasis.\nWorked with Axella Research on pre-IND application for SFA002.\nWorked with HEC (Sunshine Lake Pharma Co., China), Theravectys, and ThirdLaw LLC (still collaborating with the latter)",
            "linkedin": "https://www.linkedin.com/in/alla-arzumanyan-66a79a18b"
        },
        {
            "name": "Mark Feitelson, Founder",
            "description": "Mark Feitelson received his Ph.D. in Microbiology/Immunology from UCLA. He began his work with hepatitis B at Stanford University, and was then recruited to the Fox Chase Cancer Center by Dr. Baruch Blumberg (Nobel laureate). In 1991, Dr. Feitelson moved to Thomas Jefferson University, and in 2007, to Temple University as a Professor of Biology.  His work has been supported by NIH, industry and foundations. He has more than 150 publications and 180 abstracts. He is also CSO of SFA Therapeutics.",
            "linkedin": "https://www.linkedin.com/in/mark-feitelson-707771a"
        }
    ],
    "status": true,
    "generated_description": "### SFA Therapeutics Overview\n\nSFA Therapeutics, founded in 2016 and a proud member of Y Combinator Batch S21, is shaking up the biotech landscape from its base in Jenkintown, Pennsylvania. This clinical-stage biotech company is on a mission to harness the body's immune system to battle cancer and autoimmune diseases, focusing on conditions exacerbated by chronic inflammation—an area affecting over 300 million people globally.\n\n### What Do They Do?\n\nAt its core, SFA Therapeutics is developing therapeutically-tailored oral treatments that aim to regulate the immune response. They're particularly interested in creating drugs that attack the root causes of autoimmune diseases, offering a safer, oral alternative to existing therapies. Their current pipeline features nine distinct drugs and 15 patents, anchored by solid clinical data from a Phase 1b trial on psoriasis and promising findings in pancreatic cancer, uveitis, and nonalcoholic steatohepatitis (NASH).\n\n### The Science Behind SFA Therapeutics\n\nThe founders of SFA Therapeutics were drawn into the complex interplay between the human gut microbiota and overall health. They recognized the potential of biosynthetic molecules to act as a communication bridge between the gut and the immune system, influencing critical cellular processes. Their innovative platform not only allows them to create disease-specific drugs but also emphasizes safety and efficacy by mimicking molecules naturally found in the body.\n\n### Unique Selling Points\n\n1. **Innovative Oral Formulations**: These aim for consistent clinical outcomes while keeping costs low thanks to seamless manufacturing processes.\n2. **Targeted Approach**: Their small molecules selectively interact with disease-specific targets, driving the immune system back into balance.\n3. **Robust Clinical Evidence**: With strong data supporting their efforts, they stand ready to challenge the status quo in autoimmune and chronic inflammatory disease treatments.\n\n### Pipeline and Future Directions\n\nCurrently, SFA Therapeutics is focused on treating a broad spectrum of health challenges. Their target diseases include:\n\n- **Autoimmune Diseases**: Such as psoriasis and rheumatoid arthritis\n- **Cancers**: Including hepatocellular carcinoma and pancreatic cancer\n- **Infectious Diseases**: Particularly addressing post-viral inflammatory complications\n- **Liver Diseases**: Like fibrosis and NASH\n\n### Who's Behind SFA Therapeutics?\n\nDespite its compact size—just four employees—SFA is led by a passionate team backed by various venture capital firms, including Asymmetry Ventures and Ben Franklin Technology Partners. Their commitment to innovation puts them on a promising path to making significant impacts in healthcare.\n\n### Get Involved\n\nSFA Therapeutics is on a journey to redefine therapeutic options for complex diseases. If you're intrigued by their mission, explore their [website](https://sfatherapeutics.com/) for more information on their science, pipeline, and recent news updates.\n\nIn summary, SFA Therapeutics is not just another biotech firm; they are pioneers at the confluence of gut health and immunology, shaping the future of treatments for autoimmune diseases and cancer one drug at a time.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/8e5c7369697913387b2ccedc56d16e7b09ef739d.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191918Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=efa8d559b546af3be7fb7b6faae0fb48db5edad2f6dad21bfccfe722012ceda1",
    "social_links": [
        "https://www.linkedin.com/company/sfa-therapeutics/",
        "http://twitter.com/@sfatherapeutics"
    ],
    "logo_path": "data/logos\\SFA_Therapeutics_logo.png"
}