{
    "links": "https://www.ycombinator.com/companies/sfox",
    "name": "SFOX",
    "headline": "Crypto-currency trading platform.",
    "batch": "S14",
    "description": "SFOX, a YC-backed company, makes it easy for enterprises to trade bitcoin.  We started with an advanced trading platform that uses algorithms to provide a competitive advantage to our customers. SFOX now aims to expand international commerce by making it easy to trade any currency and settle in real time.",
    "activity_status": "Active",
    "website": "http://sfox.com",
    "founded_date": 2014.0,
    "team_size": 40.0,
    "location": "Los Angeles, CA",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:crypto-web3; location:los-angeles",
    "founders": [],
    "status": true,
    "generated_description": "### Overview of SFOX\n\nFounded in 2014, SFOX is a cryptocurrency trading platform that emerged from the prestigious Y Combinator's Summer 2014 batch. Based in Los Angeles, California, the company has grown to a dedicated team of 40 employees, all focused on transforming how enterprises engage in cryptocurrency trading.\n\n### Mission\n\nSFOX's mission is simple yet ambitious: they aim to facilitate and simplify cryptocurrency trading for enterprises and institutional investors across the globe. Initially designed for trading Bitcoin, their platform has evolved to support multiple currencies, boasting the capacity for real-time trading and settlement. \n\n### Key Offerings\n\nAt its core, SFOX operates as a full-service crypto prime dealer catering specifically to institutional clients. They offer a sophisticated trading platform that leverages advanced algorithms to provide competitive advantages in trading. Key offerings include:\n\n- **Trading Solutions**: Advanced trading capabilities tailored for diverse institutional needs.\n- **Liquidity**: Access to a wide array of liquidity providers, ensuring superior trade execution.\n- **SAFE Custody**: Secure management of client assets with robust testing for security compliance.\n- **Staking**: Opportunities for clients to earn rewards on their crypto assets.\n- **Post-trade Settlement**: A streamlined approach for settling trades effectively.\n- **API Integration**: Allowing clients to seamlessly integrate SFOX’s services into their existing platforms.\n\n### Unique Selling Proposition\n\nSFOX prides itself on its capability to aggregate liquidity. This means clients gain access to numerous markets and liquidity providers from a single account. With advanced order types and smart routing technologies, SFOX ensures trades are executed at optimal prices with minimal market impact.\n\n### Security and Compliance\n\nSafety and reliability are paramount in the crypto space, and SFOX stands out with its robust security protocols:\n- Zero security incidents in company history.\n- Deposits are securely stored using encrypted cold wallets.\n- Insured protections against physical destruction of cryptocurrency keys, amounting to $200 million.\n\n### Who They Serve\n\nSFOX is designed for institutional clients including hedge funds, family offices, crypto exchanges, and sophisticated individual traders. Their large-scale approach provides agility and efficiency that institutional investors often require.\n\n### Conclusion\n\nIn a fast-evolving landscape of cryptocurrency trading, SFOX continues to innovate and expand its offerings. They are committed to unlocking the potential of digital assets through a secure, efficient, and comprehensive trading platform. For more information or to explore their services, visit [SFOX's website](http://sfox.com). \n\nBy focusing on liquidity, technology, and robust security, SFOX is positioning itself as a significant player in the increasingly competitive world of crypto finance.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/e0182ce042d0b10b29e9746cd60c2984697af056.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191918Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=0b6f02aa174097cdf0167c66d724b88463025e3295236a677c63b2a21093fab4",
    "social_links": [
        "https://twitter.com/sfox",
        "https://www.crunchbase.com/organization/sfox",
        "https://github.com/sfoxhq"
    ],
    "logo_path": "data/logos\\SFOX_logo.png"
}