{
    "links": "https://www.ycombinator.com/companies/shasta-health",
    "name": "Shasta Health",
    "headline": "Get physical therapy at home, covered by insurance",
    "batch": "S23",
    "description": "Shasta Health enables physical therapists to go independent, so they make 3X more than working for a traditional clinic. Our AI agents automatically find patients, handle scheduling, and bill insurance so our PTs can focus on providing care.\r\n\nPatients get a concierge in-home appointment that's fully covered by insurance, instead of being stuck on endless waitlists. Book an appointment today at www.shasta.health",
    "activity_status": "Active",
    "website": "https://www.shasta.health",
    "founded_date": 2023.0,
    "team_size": 2.0,
    "location": "San Francisco",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:generative-ai; industry:computer-vision; industry:digital-health; industry:healthcare; industry:ai; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Srinjoy Majumdar, Founder",
            "description": "Srinjoy is co-founder and CEO at Shasta Health. Previously, he was a Senior Software Engineer at Microsoft on the HoloLens AR Headset. He led and delivered several computer-vision projects at Microsoft while working closely with companies in healthcare and construction. In college, he studied ECE at UT Austin while working part-time as a Software Engineer at GitHub and an undergraduate researcher at two healthcare robotics labs.",
            "linkedin": "https://linkedin.com/in/srinjoym"
        },
        {
            "name": "Pransu Dash, Founder",
            "description": "Pransu is the co-founder of Shasta Health. He was most recently an engineer at Athelas (YC W16) building medical billing and AI software while working with many healthcare customers. He also brings experience in telehealth research from his time studying computer science at UC Berkeley. In previous roles, Pransu also was a key member leading software development at a series of companies including Atlassian and Cockroach Labs.",
            "linkedin": "https://linkedin.com/in/pransudash"
        }
    ],
    "status": true,
    "generated_description": "**Shasta Health: Transforming Physical Therapy with Convenience and Innovation**\n\nFounded in 2023 and part of Y Combinator's Batch S23, Shasta Health is revolutionizing the way patients receive physical therapy by bringing it right to their doorstep. Based in San Francisco, this nimble startup operates with a small but dedicated team of just two employees, focused on a considerable mission: to make physical therapy accessible, convenient, and fully covered by insurance.\n\n### Mission\nAt its heart, Shasta Health aims to provide physical therapy at home, eliminating the cumbersome process of waitlists and tedious clinic visits. Their service is covered by various insurance plans, often leading to co-pays as low as $0 for patients.\n\n### How It Works\nShasta Health enables physical therapists (PTs) to operate independently, allowing them to earn three times more than in traditional clinics. The company's intelligent AI agents streamline the process by automatically finding patients, handling scheduling, and managing insurance billing. This allows PTs to focus on what they do best: providing personalized care.\n\nPatients can book appointments directly through the website (www.shasta.health), enjoying an in-home, concierge-level service. Each session boasts an hour of one-on-one time with a licensed professional, free from assistants or aides—just pure, focused therapy.\n\n### What They Treat\nShasta Health caters to a range of conditions, from surgery rehabilitation to long COVID recovery, ensuring that every patient’s needs are met with expertise and care. Their tailored approach results in personalized treatment plans that expedite recovery while addressing specific patient goals.\n\n### Why Choose Shasta Health?\n1. **Immediate Care**: Say goodbye to waitlists. Get treatment without delay and without needing a referral.\n2. **No Commute**: Access therapy from the comfort of your home. Save time by eliminating travel.\n3. **Personalized Attention**: Enjoy dedicated time with experienced PTs who prioritize your needs and develop tailored plans.\n4. **Comfort & Convenience**: Each session takes place at home or via virtual appointments—no more cramped clinic rooms.\n\n### Success Stories\nPatients rave about the turnaround in their health journeys thanks to Shasta Health. From marathon training breakthroughs to recovery from nagging injuries, the feedback highlights how this approach has reshaped their experiences with physical therapy.\n\n### The Team Behind Shasta Health\nWith the backing of a visionary partner and a commitment to healthcare innovation, Shasta Health is not just another health startup—it's a transformational service aiming to redefine rehabilitation. \n\nFor anyone seeking relief from pain or a better way to approach their recovery, Shasta Health offers a clear path: expert care, tailored plans, and a level of service that prioritizes the patient's experience above all.\n\nIf you're interested in scheduling an appointment or simply exploring how home physical therapy can help you, visit [Shasta Health](https://www.shasta.health) or call their friendly concierge team at (833) 270-9820. Don’t let pain hold you back. Let Shasta Health guide you toward recovery today.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/32dcbe79c489122dca4aa19435e069d3ba708e29.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191920Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=8ed1dc92bff590b748e439b305130c52f85412ce270ef200a67913c4abf7c5d4",
    "social_links": [
        "https://www.linkedin.com/company/shasta-health",
        "https://twitter.com/getshastahealth",
        "https://www.facebook.com/people/Shasta-Health-Tech-Enabled-Physical-Therapy/100094633298590/",
        "https://github.com/shastahealth"
    ],
    "logo_path": "data/logos\\Shasta_Health_logo.png"
}