{
    "links": "https://www.ycombinator.com/companies/shef",
    "name": "Shef",
    "headline": "Shef is a Marketplace for Homemade Food",
    "batch": "W19",
    "description": "At Shef, we’re rebuilding the food system from scratch, redefining who can participate in the food economy, and returning personal connection to the making, eating, and sharing of food. \r\n\nShef is an online marketplace for local, food safety certified cooks to connect with customers in their community and earn a meaningful income selling homemade dishes. \r\n\n75% of shefs are women and 80% are people of color. Together, they represent nearly 100 countries around the world, from Algeria to Korea, to India and Venezuela. Shefs are aunties and abuelas, immigrants and refugees, stay-at-home parents and restaurant dreamers. They’re passionate local cooks in your community who are doing what they love most — sharing their food and culture with you. \r\n\nShef is also part of a growing movement to build a more inclusive food system for all. We are proud to support and champion advocacy efforts to expand home cooking laws across the country so that talented cooks everywhere can earn a meaningful income from their own kitchens. \r\n\nJoin us: https://jobs.lever.co/shef",
    "activity_status": "Active",
    "website": "https://www.shef.com",
    "founded_date": 2019.0,
    "team_size": 100.0,
    "location": "San Francisco",
    "group_partner": "Michael Seibel",
    "group_partner_yc": "https://www.ycombinator.com/people/michael-seibel",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:marketplace; industry:consumer; industry:food; industry:food-tech; location:san-francisco-bay-area",
    "founders": [],
    "status": true,
    "generated_description": "**Shef: Rebuilding Community Through Food**\n\nFounded in 2019 as part of Y Combinator's Batch W19, Shef is a San Francisco-based online marketplace revolutionizing the homemade food scene. The mission is simple yet profound: rebuild the food system from the ground up by empowering local cooks—referred to as “shefs”—to connect with customers in their communities. This platform not only offers delicious meals but also supports home chefs in earning a meaningful income while sharing their culinary heritage.\n\nDiversity is at the heart of Shef. With 75% of its shefs being women and 80% identifying as people of color, they represent nearly 100 countries—bringing flavors from Algeria to Korea, India to Venezuela right into customers’ homes. These shefs are everyday heroes: aunties, abuelas, immigrants, refugees, and ambitious culinary dreamers, all passionate about crafting cultural meals that tell their stories.\n\nWhat sets Shef apart? The company champions a movement for a more inclusive food economy. They advocate for expanded home cooking laws across the U.S., ensuring that anyone with the passion and talent to cook can share their dishes and thrive financially.\n\nShef offers a “Weekly Shef Service,” allowing customers to set up regular deliveries of freshly prepared meals tailored to diverse dietary preferences—from vegan and gluten-free to paleo and kosher. Why? Because it just tastes better when someone else makes it.\n\nWith a growing team of around 100 employees, Shef is dedicated to logistical excellence, ensuring meals are delivered stress-free, fresh, and ready to heat. They believe that cooking is a deep form of care, connecting individuals with their communities and fostering humanity around mealtimes.\n\nIn just a few years, Shef has become a pivotal player in the food-tech space, urging all of us to rethink where our meals come from and who gets to provide them. So whether you're in New York, Chicago, or Seattle, your next meal could be steeped in tradition, love, and a sprinkle of community spirit. \n\nCurious to learn more? Visit [Shef.com](https://www.shef.com) or check out their career opportunities [here](https://jobs.lever.co/shef).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/2d1d62bea3030b6b577d9f505853d2fb67020041.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191921Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=05fca50578dc9e80fce688a47a9bb78aee6dd1644ee88e8c094f8e8ad83e0600",
    "social_links": [
        "https://www.linkedin.com/company/ordershef",
        "https://twitter.com/ordershef",
        "https://www.facebook.com/ordershef",
        "https://www.crunchbase.com/organization/shef"
    ],
    "logo_path": "data/logos\\Shef_logo.png"
}