{
    "links": "https://www.ycombinator.com/companies/shimmer",
    "name": "Shimmer",
    "headline": "1:1 ADHD coaching, 5-10X More affordable than alternatives",
    "batch": "S21",
    "description": "Shimmer provides ADHD coaching to people with ADHD or executive function challenges. Shimmer was born from a group of ADHD coaches, psychiatrists, doctors, and engineers to create a personalized, action-oriented playground for you and your coach to explore. We're not another list, calendar, or app: we're real human interactions paired with expert strategies, so that you can make real changes in your life. Come check us out!\r\n\nOur ADHD coaches partner with you to co-design a plan to achieve your goals. You'll experiment with strategies on a weekly basis to implement a routine fit specifically for you. Our program has been designed off science-backed methods in partnership with NYU, UC Berkeley, and UCSF. \r\n\nGet your free ADHD Mastery Score > https://www.shimmer.care/assessment",
    "activity_status": "Active",
    "website": "https://shimmer.care",
    "founded_date": 2021.0,
    "team_size": 9.0,
    "location": "San Francisco",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:mental-health-tech; industry:community; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Christal Wang, Founder",
            "description": "Co-Founder/CEO @ Shimmer | Forbes 30 Under 30 | Ex: Consultant @ Bain, International Launch + Growth @ Drop",
            "linkedin": "https://www.linkedin.com/in/wangchristal/"
        },
        {
            "name": "Vikram Sreedhar, Founder",
            "description": "Stanford Alumni c/o 2018\nCo-Founder/CTO @ Shimmer\nCo-Founder @ M.A.D. Together, 501(c)(3)",
            "linkedin": "https://www.linkedin.com/in/vikramsreedhar/"
        }
    ],
    "status": true,
    "generated_description": "**Shimmer: A Bright New Approach to ADHD Coaching**\n\nFounded in 2021 and now part of Y Combinator's Batch S21, Shimmer is redefining how people tackle ADHD through personalized, one-on-one coaching. Located in the heart of San Francisco and fueled by a dedicated team of nine professionals — including ADHD coaches, psychiatrists, engineers, and psychologists — Shimmer aims to break free from the conventional methods of ADHD management. Instead of just apps and to-do lists, they focus on real interactions and scientifically-backed techniques to instigate meaningful change.\n\n### Core Mission\nShimmer’s mission is simple yet compelling: to provide 1:1 ADHD coaching that’s 5-10 times more affordable than traditional options. They’ve engineered a coaching program that allows you to partner with expert coaches who will collaboratively design a tailored plan to help you achieve your personal goals. \n\n### How It Works\nHere's the gist of it: Shimmer isn’t about throwing a bunch of strategies at you hoping something sticks. You’ll meet weekly with your coach to explore and experiment with action-oriented strategies specifically designed for you. This continuous loop of experimentation and feedback is supported by a wealth of resources, including tools crafted for productivity and learning modules rooted in the latest ADHD research from institutions like NYU and UC Berkeley.\n\n### Pricing and Structure\nShimmer’s pricing is refreshingly accessible. While most coaching services run north of $500 a month, Shimmer offers their expertise for just $230 per month, with an enticing 25% off your first month. This plan includes weekly sessions, a comprehensive assessment, and access to a suite of resources, all aimed at developing sustainable habits that lead to real-life improvements.\n\n### Community and Support\nBuilding a community around ADHD is another aspect that sets Shimmer apart. Members are encouraged to share experiences, support one another, and participate in group activities like “body doubling” sessions, which can help with focus and follow-through.\n\n### Testimonials\nFeedback from Shimmer's users speaks volumes. Members appreciate the personalized support, noting that the coaching is tailored to their unique needs and situations. Many report feeling empowered, more in control of their lives, and excited about the prospects of personal growth.\n\n### In Closing\nIf you're looking for a coaching platform that merges empathy with expert strategies, while also making it financially viable, Shimmer could be the answer you've been searching for. Their commitment to understanding ADHD not only from a theoretical perspective but from true life experience makes them a standout choice in the mental health tech landscape.\n\nCheck them out here: [Shimmer](https://shimmer.care) and see how you can take control of your ADHD with actionable insights and caring support.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/b95ad12ddbfc30c9a6ecd27a0308e74c281a71b2.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191921Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=60b3d315155f0f42e32ece076ddf1ab8bbcea6861187c288f20a6dfb71e54680",
    "social_links": [
        "https://www.linkedin.com/company/shimmer-care/",
        "https://twitter.com/shimmer_care",
        "https://www.facebook.com/shimmer.health",
        "https://www.crunchbase.com/organization/shimmer-76ec"
    ],
    "logo_path": "data/logos\\Shimmer_logo.png"
}