{
    "links": "https://www.ycombinator.com/companies/shinkei-systems",
    "name": "Shinkei Systems",
    "headline": "Robots for longer-lasting, better-tasting fish at scale.",
    "batch": "W22",
    "description": "1.2B lbs of fish are caught everyday yet as little as 1 in 3 fish make it to a plate — most of this waste arises because fish are suffocated on boats or electrocuted on farms. \r\n\nSuffocation and inaccurate electrocution create stress and so acidify meat, damage quality and significantly reduce shelf-life. \r\n\nArtisanal techniques in high-end sushi multiply shelf-life and taste but, because of the variation in fish, are difficult to perform in a mechanical fashion. \r\n\nShinkei automates traditional techniques using robotics to provide long-lasting and delicious fish for farmers and harvesters at scale.",
    "activity_status": "Active",
    "website": "http://www.shinkei.systems",
    "founded_date": 2021.0,
    "team_size": 9.0,
    "location": "New York",
    "group_partner": "Jared Friedman",
    "group_partner_yc": "https://www.ycombinator.com/people/jared-friedman",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:hardware; industry:robotics; industry:food-tech; industry:agriculture; location:new-york",
    "founders": [],
    "status": true,
    "generated_description": "**Shinkei Systems: Revolutionizing Seafood Processing with Robotics**\n\nShinkei Systems, founded in 2021 and based in New York, is on a mission to provide \"Robots for longer-lasting, better-tasting fish at scale.\" The problem they’re tackling is profound: every day, 1.2 billion pounds of fish are caught, yet only about one in three reach our plates. Much of this waste comes from fish suffocated on boats or improperly stunned in farms, leading to stress that damages meat quality and shortens shelf life.\n\nWhat’s key here is the comparison with artisanal sushi practices, which enhance flavor and longevity but are labor-intensive and not easily automated due to natural variability in fish. Shinkei inherits these traditional techniques but supercharges them with technology, using robotics to maintain consistency and quality on a grand scale.\n\nThey boast a small but mighty team of nine and operate as part of Y Combinator’s Batch W22. Their focus areas include hardware, robotics, food tech, and agriculture, with an aim to automate fish processing completely. By integrating sensor fusion, edge computing, and machine learning, Shinkei’s platform—called ulmOs—turns data into actionable insights, all while simplifying and reducing labor needs by potentially up to 85%. This not only benefits fishers and farmers economically but also elevates the quality of the seafood we enjoy.\n\nThe company’s promise? Significant improvements in product quality—in some cases, chefs can’t even tell the difference between machine-processed and hand-prepared fish. Their intelligent robotics systems aim to mitigate waste and maximize revenue while evolving the seafood supply chain to meet modern demands.\n\nCurious to know more about how they’re transforming this vital industry? Check out their website at [Shinkei Systems](http://www.shinkei.systems). It’s clear they’re at the forefront of a much-needed evolution in seafood processing.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/c5fd9e1a63853b019d228bc2c97d4aa66820da8b.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191921Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=f69cbe9207c2c15c0453f9d3fbfdf2febc9ed58ed0fda9eb065cac1a0a3b1c2e",
    "social_links": [
        "https://www.linkedin.com/company/shinkeisystems",
        "https://twitter.com/ShinkeiSystems"
    ],
    "logo_path": "data/logos\\Shinkei_Systems_logo.png"
}