{
    "links": "https://www.ycombinator.com/companies/shipmates",
    "name": "Shipmates",
    "headline": "Shipping platform for online merchants in the Philippines",
    "batch": "S22",
    "description": "Shipmates is a shipping platform that enables online business owners to book on-demand and standard orders using multiple couriers in the Philippines. An alternative to the hassles of manual booking and shipping. Shipmates helps e-commerce businesses grow by making their shipping process easier and faster.\r\n\nLaunched in 2021, Shipmates was engineered to simplify logistics and scale businesses by allowing business owners to book shipments in bulk from different couriers in just a few clicks. Users have the option to connect their Shopify website to our platform or upload their orders using an excel file. Shipmates is currently in partnership with six couriers: Lalamove, Borzo, Grab, XDE, Entrego, and J&T as we work on adding more courier options. The platform also allows for nationwide shipping, Cash on Delivery and free courier pick-ups for the convenience of business owners.\r\n\nWe believe that online businesses deserve more support for shipping which is why we built solutions through continuous product development and simplicity in design.",
    "activity_status": "Active",
    "website": "https://shipmates.app",
    "founded_date": 2021.0,
    "team_size": 12.0,
    "location": "Makati, Philippines",
    "group_partner": "Gustaf Alstromer",
    "group_partner_yc": "https://www.ycombinator.com/people/gustaf-alstromer",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:logistics",
    "founders": [
        {
            "name": "David Marquez, Founder",
            "description": "CTO of Shipmates",
            "linkedin": "https://ph.linkedin.com/in/dayvough"
        },
        {
            "name": "Josh Supan, Founder",
            "description": "CEO of Shipmates",
            "linkedin": "http://www.linkedin.com/in/joshsupan/"
        }
    ],
    "status": true,
    "generated_description": "**Shipmates: Simplifying Shipping for Online Merchants in the Philippines**\n\nWelcome to Shipmates, a game-changing shipping platform designed specifically for online merchants in the Philippines. Founded in 2021 and backed by Y Combinator (Batch S22), Shipmates is on a mission to streamline the shipping process for e-commerce businesses, allowing them to focus more on growth and less on logistics.\n\n### What Does Shipmates Do?\n\nInitially launched to eliminate the complexities of manual booking, Shipmates enables online store owners to book on-demand and standard orders through various couriers—think Lalamove, Grab, and J&T, among others—all in one place. With a user-friendly platform, business owners can connect their Shopify store or simply upload orders via an Excel file. In just a few clicks, they can manage bulk shipments seamlessly.\n\n### Key Features:\n\n- **Multi-Courier Access**: Easily compare rates and choose from multiple couriers. Now, shipping isn’t just a chore; it’s a streamlined process.\n- **Cash on Delivery & Free Pick-Ups**: Take advantage of nationwide shipping plus cash-on-delivery options, all with no additional pick-up fees.\n- **Tracking & Automation**: Track all shipments from one dashboard and enjoy automatic waybill generation, saving you precious time and hassle.\n\n### Pricing Structure:\n\nShipmates operates on a pay-per-use model, ensuring you only pay for what you use. This is structured into three tiers based on monthly shipment volumes:\n\n1. **Level 1**: No minimum shipments required – ₱10.00 per booking.\n2. **Level 2**: Minimum of 500 shipments per month – ₱7.50 per booking.\n3. **Level 3**: Minimum of 1,000 shipments per month – ₱5.00 per booking.\n\n### Our Philosophy:\n\nAt Shipmates, we believe that online businesses deserve robust support in shipping. Our team, based in Makati and comprised of just 12 employees, prioritizes continuous product development and user-friendly design, ensuring that every feature enhances the shipping experience for our users.\n\nIn the crowded field of logistics, Shipmates stands out not just because of what we offer, but also because of the valuable partnerships we've forged with leading couriers and the commitment we have to our clients.\n\n### Client Testimonials:\n\nUsers rave about how Shipmates has transformed their workflow. For instance, Chrislyn from HGHMNDS CLOTHING highlights the convenience of having everything in one platform, while Alexa from Twin Starr Tailoring appreciates the intuitive design and responsive customer support.\n\nTo sum it all up, if you're in the business of e-commerce in the Philippines and looking to simplify your shipping process, Shipmates is ready to be your co-pilot. Check us out at [shipmates.app](https://shipmates.app) and start your shipping journey today!\n\n---\n\nFeel free to reach out for a demo or sign up for free—let's get your products on their way!",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/52ec8ea6519a0beab84e9e86c76f0dfd56eedb5f.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191921Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=192abd466f3e4b1bdf353894e08b92548869ea9891a865161005177c66bd6da2",
    "social_links": [
        "https://www.linkedin.com/company/shipmatesapp/",
        "https://mobile.twitter.com/ShipmatesHQ",
        "https://www.facebook.com/shipmatesapp",
        "https://www.crunchbase.com/organization/shipmates-7b21"
    ],
    "logo_path": "data/logos\\Shipmates_logo.png"
}