{
    "links": "https://www.ycombinator.com/companies/shogun",
    "name": "Shogun",
    "headline": "Shogun empowers brands to create exceptional ecommerce experience.",
    "batch": "W18",
    "description": "Shogun is an ecommerce experience platform empowering brands to drive higher conversions, revenue, and brand loyalty. Our products Shogun Page Builder and Shogun Frontend help teams build and optimize their online stores to deliver exceptional experiences. Our products integrate with ecommerce platforms like Shopify and BigCommerce, and our 20,000+ customers include Leesa, MVMT, Timbuk2, and Chubbies. Visit www.getshogun.com for more.\r\n\nWe're an inclusive, remote, diverse, and globally distributed team. And we’re hiring!",
    "activity_status": "Active",
    "website": "https://getshogun.com/",
    "founded_date": 2015.0,
    "team_size": 90.0,
    "location": "San Carlos, CA",
    "group_partner": "Michael Seibel",
    "group_partner_yc": "https://www.ycombinator.com/people/michael-seibel",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:saas; industry:b2b; industry:e-commerce",
    "founders": [
        {
            "name": "Nick Raushenbush, Founder",
            "description": "CEO at Shogun, fmr Cofounder, COO. Fmr Cofounder, COO @ Glass + Marker.",
            "linkedin": "https://www.linkedin.com/in/nickraushenbush"
        },
        {
            "name": "Finbarr Taylor, Founder/CEO",
            "description": "CTO at Shogun (YC W18). Former Software Engineer at Y Combinator. Scottish in California.",
            "linkedin": "https://linkedin.com/in/finbarrtaylor"
        }
    ],
    "status": true,
    "generated_description": "**Shogun: Crafting Exceptional E-commerce Experiences**\n\nFounded in 2015, Shogun began as an e-commerce experience platform and has since evolved into a powerhouse for brands looking to optimize their online stores for better engagement and conversions. The mission is straightforward: Shogun empowers brands to create exceptional e-commerce experiences. By providing tools like the Shogun Page Builder and Shogun Frontend, they enable businesses to build and personalize their online presence efficiently.\n\nThe company operates seamlessly with popular platforms like Shopify and BigCommerce, boasting a clientele of over 20,000 brands, including notable names like Leesa, MVMT, Timberland, and Chubbies. Based in San Carlos, California, Shogun has grown to a diverse team of around 90 members and is currently part of Y Combinator’s Batch W18, with Michael Seibel as one of the group partners guiding their journey.\n\n### Key Features and Capabilities:\nShogun's product suite includes essential features such as:\n\n- **Visual Editor:** An intuitive drag-and-drop interface that removes the coding barrier, allowing businesses to craft beautiful pages effortlessly.\n- **CMS Functionality:** Enables brands to create and manage dynamic content at a scalable level.\n- **A/B Testing:** A feature that allows users to experiment with various layouts and elements to find the best performing configurations.\n- **Personalization Tools:** Engage customers with tailored content based on their preferences and browsing behavior.\n- **Integrated Page Analytics:** Provides insights into how pages are performing, enabling data-driven decisions.\n\n### Target Audience:\nShogun primarily serves e-commerce managers and agencies, giving them the tools to drive growth and improve customer engagement through richer, more immersive content experiences. They also support companies in managing multiple brand sites and optimizing for SEO, ensuring that client brands stand out in the crowded digital marketplace.\n\n### Workplace Culture and Recruitment:\nAdopting a model that encourages inclusivity, Shogun operates as a remote and globally distributed team. Their culture emphasizes diversity and innovation as they continue to expand. They're actively hiring, offering opportunities to individuals who share a passion for enhancing e-commerce.\n\nIn the rapidly changing world of online retail, Shogun stands out not just for its powerful tools but also for its commitment to supporting brands and agencies in crafting memorable shopping experiences. Whether you’re looking to try out their features or dive deeper into e-commerce strategies, Shogun presents a comprehensive solution.\n\nFor more information, visit [Shogun's website](https://getshogun.com/).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/23701db7e1b13580819f84c455c19edf41c608ea.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191922Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=21dd3e390a63d405bc6c04a46f84c13aba6dbc187bf1e369c39218b9b5e59bd8",
    "social_links": [
        "https://www.linkedin.com/company/shogun",
        "https://twitter.com/shogun",
        "https://www.crunchbase.com/organization/shogun",
        "https://github.com/shogun-toolbox"
    ],
    "logo_path": "data/logos\\Shogun_logo.png"
}