{
    "links": "https://www.ycombinator.com/companies/short-story",
    "name": "Short Story",
    "headline": "Modern ecommerce for petite women",
    "batch": "S19",
    "description": "Short Story is a style discovery platform to help petite women find clothes that fit. The average American woman is 5'4\" and petite, yet this remains an enormously underserved segment. We’re a team of curators passionate about finding style, quality, and fit for petite women. Our mission is to remove the “ugh” from the shopping equation and support petite women in telling their stories, stylishly and confidently.",
    "activity_status": "Active",
    "website": "https://shortstorybox.com",
    "founded_date": 2019.0,
    "team_size": 120.0,
    "location": "San Francisco",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:machine-learning; industry:marketplace; industry:e-commerce; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Samuel Hoffstaetter, Founder",
            "description": "I'm the cofounder and CTO of Short Story. I also invest in YC companies and try to be as supportive as I can. In college, I co-founded a startup that sold textbooks to students across 117 campuses. Before Short Story, I worked at Tower Research and Waymo.",
            "linkedin": "https://www.linkedin.com/in/hoffstaetter/"
        },
        {
            "name": "Isabella Sun, Founder",
            "description": "I'm the cofounder of Short Story. I also invest in YC companies through Pioneer Fund.",
            "linkedin": "https://www.linkedin.com/in/isabellasun/"
        }
    ],
    "status": true,
    "generated_description": "**Short Story: Tailored for Petites**\n\nFounded in 2019, Short Story is a fresh and dynamic player in the e-commerce realm, specifically catering to petite women—those 5'4\" and under. It's founded on a simple yet impactful mission: to make modern e-commerce work for this often-overlooked demographic. Picture this: the average American woman is petite, yet the fashion world largely ignores her. Short Story aims to change that.\n\nInitially conceptualized as a style discovery platform, Short Story serves as a personalized subscription-based service where customers receive curated clothing selections tailored to their unique body proportions and style preferences. Their approach helps eliminate the common frustrations that come with shopping for petite sizes.\n\n**What Makes Them Special?**\n- **Personalization**: Customers take a \"style quiz\" to express their preferences, and the team of expert curators finds five perfectly fitted clothing items, shipped directly to the customer's door.\n- **Quality Focus**: The clothing is selected not just for fit, but also for style and quality. This is about more than just buying clothes; it’s about finding outfits that empower petite women to express themselves confidently.\n- **Versatile Range**: Sizes range from 00P to 20P, ensuring that a broad spectrum of petite women can find their perfect fit.\n\nShort Story has a substantial backing, having been part of the Y Combinator Batch S19, and is based in San Francisco with a growing team of around 120 enthusiastic employees. Their group partner, Nan, backs this venture, emphasizing its strong leadership and vision.\n\nWith tags like 'machine-learning', 'marketplace', and 'e-commerce', Short Story is not just a shopping service; it's a data-driven approach that harnesses technology to provide a satisfying shopping experience. \n\n**Community and Culture**\nShort Story isn’t merely about selling clothes—it’s about building community. They celebrate petiteness and encourage expression through fashion. Each piece is selected for its ability to flatter petite frames, helping women shed the feeling of shopping in the kids’ department. \n\nCustomer testimonials reflect genuine enthusiasm: \"The way everything fits… it’s magical,\" says Anna W, 4’10\", while Michele L, 5’2”, gushes, \"Oh my goodness, I’m going to be living in this outfit.\" \n\nIn a world that often overlooks their needs, Short Story is a dedicated ally for petite women, transforming the shopping experience into something positive and tailored. It’s not just about clothing—it’s about the confidence that comes from finding styles made just for them. \n\nIf you're ready to embrace a more fitting wardrobe saga, check out Short Story at [shortstorybox.com](https://shortstorybox.com) and join the movement of \"proudly petite.\"",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/2447484d6ec0323511b61631ca24db771989e60a.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191924Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=a2c0f9d3ef13926a95eb3d6e100b64d2b0bceb94230ca00e8233c6074c133f73",
    "social_links": [
        "https://www.linkedin.com/company/shortstorybox",
        "https://www.facebook.com/shortstorybox",
        "https://www.crunchbase.com/organization/short-story"
    ],
    "logo_path": "data/logos\\Short_Story_logo.png"
}