{
    "links": "https://www.ycombinator.com/companies/showbie",
    "name": "Showbie",
    "headline": "Showbie is a lighter learning management system designed for schoolsâ\u0080¦",
    "batch": "IK12",
    "description": "Showbie makes it easy for more than 1.5 million teachers and students to organize classroom workflow and improve productivity and communication in one convenient place.\n\nUsing Showbie, teachers can create, assign and review paperless assignments that students can complete using Showbieâ\u0080\u0099s in-app tools or by getting creative with thousands of compatible iPad and web applications.\n\nWith additional features such as the built in annotation tools, voice notes and gradebook, Showbie is the complete solution for any 1:1 classroom.",
    "activity_status": "Active",
    "website": "http://www.showbie.com",
    "founded_date": null,
    "team_size": 11.0,
    "location": "Edmonton, Canada",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": null,
    "founders": [],
    "status": true,
    "generated_description": "Showbie is an innovative learning management system that’s all about simplifying classroom management for educators and students alike. Founded in Edmonton, Canada, Showbie has gained traction with over 1.5 million users—drawing on the need for more effective communication and collaboration in educational settings. It emerged from Y Combinator’s Batch IK12, which is a testament to its credibility and potential.\n\nAt its core, Showbie offers teachers the tools to create, assign, and review paperless assignments. This isn’t just about going digital; it’s about enhancing productivity and fostering better communication between teachers and students. The platform provides built-in tools for annotation, voice notes, and a gradebook—all essential features for any 1:1 classroom environment.\n\nThe mission of Showbie is clear: it strives to create a lighter, more intuitive learning experience, making it easier for educators to connect with their students. With Showbie, students can leverage a variety of iPad and web apps to submit their work creatively, ensuring that the classroom workflow is seamless.\n\nThe application doesn’t just help with assignments; it crafts an entire ecosystem for learning. It incorporates four essential building blocks: direct instruction, independent practice, personalized feedback, and real-time assessment. These components work together to bolster student success and enhance learning experiences.\n\nShowbie emphasizes community building among students, allowing them to engage in group projects, peer reviews, and class discussions. Some educators have noted dramatic improvements in classroom dynamics, reporting that they're able to maintain a paperless environment and keep track of assignments more efficiently than ever before.\n\nFor those interested in modernizing their approach to education, Showbie offers a suite of powerful features that promise to make learning more accessible, engaging, and efficient. If you’re curious to dive deeper, you can find them online at [Showbie.com](http://www.showbie.com). \n\nIn summary, Showbie is about more than just management; it’s about redefining the classroom experience for both teachers and students, merging technology with effective educational practices to carve out a path for a more connected and productive classroom of the future.",
    "logo": "/logos/medium/missing.png",
    "social_links": [
        "https://www.crunchbase.com/organization/showbie",
        "https://github.com/showbie"
    ]
}