{
    "links": "https://www.ycombinator.com/companies/shred-video",
    "name": "Shred Video",
    "headline": "Shred Video builds automated video & photo systems that allowâ\u0080¦",
    "batch": "S15",
    "description": "Shred Video, a new startup launching out of Y Combinator, allows users to take footage from their iPhone, GoPro or drone and simply match it with a song from the userâ\u0080\u0099s iTunes library. Thatâ\u0080\u0099s all. Shred Video does the rest of the work.\r\n\nTaking into account the acceleration of the camera itself, Shred Video can pin-point the moments of action for surfers, snowboarders, skaters and other acceleration-based sports to highlight all of the coolest clips in your footage. And beyond that, Shred Video matches those epic moments with the beat-drop of the song.",
    "activity_status": "Active",
    "website": "https://shredvideo.com",
    "founded_date": null,
    "team_size": 2.0,
    "location": "San Francisco",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:travel; industry:video; location:san-francisco-bay-area",
    "founders": [],
    "status": true,
    "generated_description": "### Shred Video: Revolutionizing Adventure Videography\n\nShred Video is a dynamic startup that automates the creation of high-quality video and photo experiences specifically tailored for adventure sports. Founded during the Y Combinator Summer 2015 batch (S15) and currently based in San Francisco, the company is on a mission to enhance the way thrill-seekers capture and share their experiences.\n\n#### The Core Idea\n\nImagine you’ve just gone skydiving or bungee jumping, and rather than waiting for hours—or days—for your footage, you instantly receive a professionally edited video perfectly synced to your favorite track. That’s exactly what Shred Video offers. Users can upload footage from their iPhone, GoPro, or drone, select a song from their iTunes library, and let the technology do the rest. The platform utilizes advanced algorithms and smart camera technology to highlight moments of action, ensuring that every adrenaline-fueled thrill comes together in a cinematic display.\n\n#### Key Features\n\n1. **Instant Video Delivery**: No more waiting for your media. Shred Video delivers content immediately after the customer's experience—perfect for those who can't wait to share.\n  \n2. **Revenue Generation**: Partner organizations can sell high-quality videos and photos directly to customers, increasing income without additional staffing costs.\n\n3. **Cloud-Based Sharing**: Forget about USB sticks and complicated downloads. Customers get instant access to their footage via the cloud, ready to share across social media platforms.\n\n4. **Customization**: The system is tailored to fit into existing businesses, allowing for seamless integration and the potential to enhance current staff capabilities.\n\n5. **Ongoing Support and Upgrades**: Shred Video continuously improves its systems and provides robust support to ensure partners are always in top shape.\n\n#### Applications\n\nShred Video is already making waves in the adventure tourism space, serving companies in activities like skydiving, bungy jumping, white-water rafting, and more. Their partnership with organizations—such as Skydive Utah—highlights their ability to produce multiple unique video edits shortly after a jump, making the service not just convenient but also a massive customer delight.\n\n#### Conclusion\n\nIn a world where experience is king, Shred Video is leading the charge to make those experiences immortal. By marrying cutting-edge technology with an understanding of adventure sports, Shred Video is not just filming; they're reshaping the way memories are captured and shared. If you’re keen on seeing it in action, you can check out their offerings and request a demo at [Shred Video's website](https://shredvideo.com). \n\nSo, if you're ready to take your adventure tours to the next level, it might be time to get your Shred on!",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/9f7f300b9e9d7a8efbcca1e3f896dabce1557727.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191925Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=8c060100ad9c5e32225fd7d365ff8b1919370c6d221acc2d9366058e98e995dd",
    "social_links": [
        "https://twitter.com/shredvideo",
        "https://facebook.com/shredvideo",
        "https://www.crunchbase.com/organization/shred-video",
        "https://github.com/shredvideo"
    ],
    "logo_path": "data/logos\\Shred_Video_logo.png"
}