{
    "links": "https://www.ycombinator.com/companies/shuttle",
    "name": "Shuttle",
    "headline": "Build Backends. Fast.",
    "batch": "S20",
    "description": "# Our Mission 🎯\r\n\nAt Shuttle, we’re on a mission to revolutionise developer experience for building web apps. Everything we do is about crafting an exceptionally simple, satisfying and effective way to do cloud development. We are open source community-driven and loved by thousands of engineers. Our vision: the ultimate platform to supercharge developers’ productivity.\r\n\n# About Shuttle 🚀\r\n\nWe are building the fastest backend development experience. [Shuttle](https://shuttle.rs/) is an open source cloud platform for developing and deploying apps with zero infra hassle. \r\n\nAt [Shuttle](https://www.shuttle.rs/), we're on a mission to redefine the developer experience for building cloud applications. We want to empower the next generation of builders to make use of the latest and greatest cloud technologies, by crafting the simplest, fastest, and most enjoyable development experience. \r\n\nShuttle is open source and our [Infrastructure from Code](https://www.shuttle.rs/blog/2022/05/09/ifc) framework paired with our cloud platform eliminates the infra hassle and accelerates app development and deployment. This is a game-changer for developer productivity - think Vercel for the backend.\r\n\nWe have thousands of developers in our community incl. engineers from some of the top companies and have just launched Shuttle beta. We’re backed by some of the best investors in the world, including Y Combinator, HorizonVC, Abstraction Capital, Global Founders Capital, Founders of Segment, Sendbird, Head of Product at DataDog and other successful founders and executives.\r\n\n# Working With Us 😎\r\n\nWe’re a growth mindset company. We’re honest, open-minded, driven, and ambitious and we are only looking for people who share these qualities with us.\r\n\nWe care. About each other and about our mission.\r\n\nWe are building a culture that brings out the best in people and we truly believe that the company you work at should be the launch pad for unleashing your full potential.\r\n\nWe keep a light and fun work environment, without unnecessary stress or anxiety. Yet we hold ourselves to very high standards and keep pushing the bar up. Continuous improvement is a must if you don’t want to be left behind. Mistakes are OK, not being willing to learn from them is not OK.\r\n\nCollaboration is at the core of what we do and we treat each other with respect and kindness - supportive, yet firm and ready to provide accountability where needed.\r\n\nWe’re early stage so expect many opportunities to shape the company’s future. The best ideas win.\r\n\nWe maintain a hacker mentality - no problem is unsolvable with the right mindset. As a team, we work on hard challenges under tight constraints and are constantly pushed out of our comfort zones - if reading this excites you, let’s talk.\r\n\n# Perks 🎁\r\n\n- Remote-friendly, flexible working hours and workdays\r\n- Flexible holidays and paid time off\r\n- Mental and physical health stipend\r\n- Educational and self-development budget\r\n- Support for attending and presenting at relevant conferences\r\n- Health insurance\r\n- Awesome work-from-home setup & equipment\r\n- Regular company off-sites\r\n- Regular remote-friendly socials (games and more)",
    "activity_status": "Active",
    "website": "https://www.shuttle.rs",
    "founded_date": 2019.0,
    "team_size": 12.0,
    "location": "London, United Kingdom",
    "group_partner": "Dalton Caldwell",
    "group_partner_yc": "https://www.ycombinator.com/people/dalton-caldwell",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:developer-tools; industry:saas; industry:open-source; industry:api",
    "founders": [
        {
            "name": "Nodar Daneliya, Founder",
            "description": "Founder and CEO at Shuttle. Previously worked at Google and led trading for an ML-driven quant hedge fund.",
            "linkedin": "https://www.linkedin.com/in/ndaneliya/"
        }
    ],
    "status": true,
    "generated_description": "Shuttle is a dynamic startup that focuses on simplifying the backend development experience. Founded in 2019 and part of Y Combinator's Batch S20, Shuttle has gained traction as a go-to open-source cloud platform for developers looking to build and deploy applications without the headache of managing infrastructure.\n\n### Mission\nShuttle's mantra is \"Build Backends. Fast.\" They aim to transform the developer experience by providing tools that make cloud development not just simpler, but also more enjoyable. The team believes that the best development environment should empower users with the most efficient and satisfying solutions.\n\n### What They Do\nAt its core, Shuttle offers a cloud platform that allows developers to build and deploy applications using Rust—one of the fastest-growing programming languages known for its safety and performance. The platform eliminates many of the traditional hassles associated with infrastructure, allowing developers to focus on creating great code rather than managing servers. Imagine the ease of Vercel, but for backend development.\n\nThe Infrastructure from Code framework allows developers to define their infrastructure directly within their code. This innovative approach means that you can initiate from simple function signatures, enabling you to deploy and manage databases, secrets, and other resources seamlessly.\n\n### Community and Backing\nShuttle is not just about technology; it’s about the people behind it. The platform has cultivated a vibrant community of thousands of developers, including engineers from top companies. Shuttle is backed by influential investors such as Y Combinator, Global Founders Capital, and other notable tech leaders. \n\n### Company Culture\nShuttle prides itself on fostering a growth mindset among its team members. They are committed to honesty, collaboration, and respect while maintaining a fun and low-stress work environment. They believe in high standards, continuous learning, and giving people the autonomy to shape the company's future.\n\n### Perks\nShuttle offers an attractive set of benefits that cater to the well-being of its employees, including:\n- Remote-friendly and flexible working hours\n- Generous paid time off and mental health stipends\n- A budget for education and professional development\n- Health insurance\n- Regular team-building socials and off-sites\n\n### Conclusion\nShuttle is not just another startup; it's an innovative platform poised to reshape how developers build backend applications. If you're excited about empowering developers and pushing the limits of what's possible with Rust and cloud tech, Shuttle is the place to be. \n\nIf you want to learn more or get involved, check them out on their [website](https://www.shuttle.rs) or join their thriving community on [Discord](https://www.shuttle.rs/<https:/discord.gg/shuttle>).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/f4d16eeb7e610465ecc0f8362ee8d91d79485e5b.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191925Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=6cd38a07585dac7a085fd52af6b4647709785fbba080b019606026fa924a12ce",
    "social_links": [
        "https://twitter.com/shuttle_dev",
        "https://github.com/shuttle-hq"
    ],
    "logo_path": "data/logos\\Shuttle_logo.png"
}