{
    "links": "https://www.ycombinator.com/companies/sift",
    "name": "Sift",
    "headline": "The Leader in Digital Trust & Safety",
    "batch": "S11",
    "description": "Sift is the leader in Digital Trust & Safety, empowering digital disruptors to Fortune 500 companies to unlock new revenue without risk. Sift dynamically prevents fraud and abuse through industry-leading technology and expertise, an unrivaled global data network of 70 billion events per month, and a commitment to long-term customer partnerships. Global brands such as DoorDash, Twitter, and Wayfair rely on Sift to gain a competitive advantage in their markets.",
    "activity_status": "Active",
    "website": "https://sift.com/",
    "founded_date": 2011.0,
    "team_size": null,
    "location": "San Francisco",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:machine-learning; industry:saas; industry:b2b; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Jason Tan, Founder/Executive Chairman",
            "description": "I'm an engineer/entrepreneur with a passion for great products and amazing people. I love to learn, whether it be from books or people, and constantly challenge myself and others to be better. I thrive off positive energy and feed it right back. I believe there's opportunity everywhere you look -- the world is only as small as you make it.",
            "linkedin": "http://www.linkedin.com/in/jas0ntan"
        }
    ],
    "status": true,
    "generated_description": "**Company Overview: Sift**\n\nFounded in 2011, Sift is a San Francisco-based company that's established itself as a leader in Digital Trust & Safety. Originally part of Y Combinator's Batch S11, Sift has evolved from its beginnings to serve a wide range of clients, from ambitious digital disruptors to Fortune 500 companies. The core mission? To help these businesses unlock new revenue streams while dynamically preventing fraud and abuse. \n\n### What They Do\nSift harnesses cutting-edge technology alongside vast expertise to combat digital threats. Their impressive global data network processes around 70 billion events each month, enabling a robust fraud detection and prevention framework. Major brands such as DoorDash, Twitter, and Wayfair trust Sift to enhance their security measures, securing a competitive edge in their respective markets.\n\n### Key Features\n- **AI-Powered Decisioning**: Sift uses advanced machine learning and AI to provide precise insights, transforming risk management from a liability into a growth opportunity.\n- **Comprehensive Solutions**: They offer tailored approaches to various sectors, addressing cases like account takeovers, payment fraud, chargeback fraud, and policy abuse, spanning industries like e-commerce, fintech, and iGaming.\n- **Platform Capabilities**: The Sift platform includes functions for robust Payment Protection, Account Defense, Dispute Management, and Content Integrity—all designed to streamline user experience while mitigating fraud risks.\n\n### Community and Partnerships\nSift’s strength lies in its community and partnerships. They boast collaboration with numerous professionals and organizations in the space, which enriches their collective intelligence around fraud prevention. This is bolstered by over 700 global brands using their technology, highlighting their reliability and effectiveness across different markets.\n\n### Recognition\nSift continues to be recognized for its innovation and leadership in digital fraud management. Recently, they were named a \"Strong Performer\" by Forrester and also clinched the number one spot in G2’s Fall 2024 Fraud Reports, underscoring their influential position in the fintech landscape.\n\n### Learn More\nTo explore Sift's offerings and how they can benefit your business, visit their [official website](https://sift.com/). Whether you're looking to enhance your fraud prevention strategies or navigate the complexities of digital risk, Sift provides the tools and insights to grow fearlessly in a digital world. \n\nIn a nutshell, Sift transforms how companies deal with risk by turning challenges into pathways for growth—ultimately redefining the narrative around digital safety.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/613166638862376fa796e935f3ada96c20e213d8.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191925Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=bb091cf263986a309faf5fa25274b11f1a294f98c2ce24a121d7798dd38e1c5b",
    "social_links": [
        "https://www.linkedin.com/company/getsift/",
        "https://twitter.com/GetSift",
        "https://www.facebook.com/GetSift",
        "https://www.crunchbase.com/organization/sift-science",
        "https://github.com/SiftScience"
    ],
    "logo_path": "data/logos\\Sift_logo.png"
}