{
    "links": "https://www.ycombinator.com/companies/sigmaos",
    "name": "SigmaOS",
    "headline": "The new home for your internet ð\u009f\u008f¡",
    "batch": "S21",
    "description": "SigmaOS is a new type of browser designed for founders, researchers, and content creators to make you better and faster at working on the web.\r\n\nYou work 7+ hours a day on the web. Buried in a sea of 100+ tabs and 10+ web-apps ð\u009f¤¯, you constantly lose context for why you did what you did, and are always one click away from being distracted.\r\n\nWe took apart the browser for you, and rebuilt a new experience from the ground-up, for the FASTEST and most PRODUCTIVE work. â\u009a¡",
    "activity_status": "Active",
    "website": "https://www.sigmaos.com",
    "founded_date": 2021.0,
    "team_size": 5.0,
    "location": "London, United Kingdom",
    "group_partner": "Gustaf Alstromer",
    "group_partner_yc": "https://www.ycombinator.com/people/gustaf-alstromer",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:saas; industry:productivity; industry:collaboration",
    "founders": [
        {
            "name": "Mahyad G, Founder",
            "description": "Founder | CEO | Magician ð\u009f§\u0091ð\u009f\u008f½â\u0080\u008dð\u009f\u009a\u0080\n\n4x founder with 10 years experience as a Software Engineer.\n\nGoogle Developer Club Lead & Facebook product award winner",
            "linkedin": "https://www.linkedin.com/in/mahyad-ghassemi/"
        },
        {
            "name": "Ali Attar, Founder",
            "description": "Founder | CPO | Crazy ð\u009f\u0091¨ð\u009f\u008f½â\u0080\u008dð\u009f\u008e¨\n\n4x founder, launched 10 different products (100K+ users). \n\nMathematics MSci @Imperial College London.",
            "linkedin": "https://www.linkedin.com/in/attarali"
        },
        {
            "name": "Saurav Mitra, Founder",
            "description": "Founder | CTO | Pedantic ð\u009f\u0091¨â\u0080\u008dð\u009f\u0092»\n\n3x startup founder, managed $1M+ machine learning project for one of the biggest insurance providers in the world.\nComputer Science MSci @Imperial College London with 9 excellence awards.",
            "linkedin": "https://www.linkedin.com/in/thesauravmitra/"
        }
    ],
    "status": true,
    "generated_description": "**SigmaOS: Your New Internet Home**\n\nSigmaOS is a next-generation web browser crafted specifically for those who spend extensive hours online—think founders, researchers, and content creators. The company, founded in 2021 and a proud member of Y Combinator’s Batch S21, aims to transform how we engage with the internet, offering a refreshing user experience that keeps productivity at its core.\n\nLocated in London and operating with a compact team of just five people, SigmaOS has swiftly become a contender in the crowded browser market. Their mission is clear: to build a browser that makes you work faster and smarter, eliminating distractions in a sea of tabs and web applications. You know that feeling when you lose track of why you opened 50 tabs? SigmaOS is here to put an end to that.\n\n### Key Features that Set SigmaOS Apart\n1. **Workspaces**: Organize your tabs like rooms in a house. Group them for specific projects and easily switch between different workspaces without losing context.\n   \n2. **Vertical Tabs**: Say goodbye to the chaotic horizontal tab layout. Vertical tabs provide a clearer overview, making it easier to manage multiple pages.\n   \n3. **Tabs as Tasks**: Your tabs can be treated as tasks. Mark them as done, or keep them locked for reference, helping you prioritize your work effectively.\n   \n4. **Split Screen**: Need to view two sites simultaneously? SigmaOS allows seamless multitasking with split-screen views.\n\n5. **AI Features**: With tools like Airis, a context-aware assistant, SigmaOS transforms how you interact with information. Ask it anything, and it will provide answers based on the current web page, streamlining your research and learning process.\n\n6. **Focus Mode**: Eliminate distractions by hiding everything but your current page. This helps you zero in on what really matters.\n\n7. **Magic Theme**: This feature beautifies your browsing experience by matching SigmaOS's colors to the websites you're visiting. A nice touch for those who appreciate aesthetics.\n\n8. **No Ads**: Dive into a distraction-free browsing experience without the annoyance of ads, thanks to SigmaOS's built-in ad blocker.\n\n9. **Chrome Extension Support**: Enjoy the best of both worlds. SigmaOS supports popular Chromium extensions, so you can enhance your workflow without missing a beat.\n\n10. **Easy Migration**: Switching over from your old browser? SigmaOS will import your logins, cookies, and history effortlessly.\n\n### Plans and Pricing\nSigmaOS offers a freemium model. The basic version is free, providing all essential features, while the Pro version, starting at $20/month, unlocks advanced tools like unlimited AI usage and interactive summaries. There’s even a 50% discount for students and educators.\n\n### The Target Audience\nSigmaOS is built for anyone who's serious about improving their web experience—students grappling with coursework, founders running startups, academics navigating research, and creative professionals expressing their artistry.\n\n### Security First\nBuilt on privacy-centric principles, SigmaOS incorporates features like the Apple Keychain for secure password management and utilizes the WebKit engine for top-notch security.\n\nIn conclusion, SigmaOS isn't just another browser; it’s a tool intended to reshape how we interact with the web, focusing on user experience and productivity. Whether you're downloading it for free or opting for a paid plan, SigmaOS promises to be the new home for your internet endeavors. \n\nCurious to try it out? [Get SigmaOS for free here](https://www.sigmaos.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/986502e26bb5a8ba425d0267c7c20970fc93fc7d.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191926Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=a4f84e8d8044a8115ee40eace61fdb696720577177c49198222bff750d899dda",
    "social_links": [
        "https://www.linkedin.com/company/sigmaos/",
        "https://twitter.com/sigmaos",
        "https://www.crunchbase.com/organization/sigmaos"
    ],
    "logo_path": "data/logos\\SigmaOS_logo.png"
}