{
    "links": "https://www.ycombinator.com/companies/simplyinsured",
    "name": "SimplyInsured",
    "headline": "We sell health insurance to small businesses 100% online.",
    "batch": "W13",
    "description": "SimplyInsured was founded with one mission: to eliminate fear from health insurance. By changing the way small business owners purchase health insurance with our 100% online platform, we’re transforming a $20 billion dollar industry and delighting thousands of customers. \r\n\nOur unique values-based culture (and extremely talented team) is our core competitive advantage, and each person on our team makes a direct, immediate impact on our business. \r\n\nWe value transparency, feedback, bias to action, growth, and an obligation to dissent. Every opinion is respected, we hold each other to extremely high standards, we’re driven by the diversity in our backgrounds, and unified by 100% alignment on our mission. \r\n\nWhat’s best for the customer is the heart of everything we do, and our customer stories prove it: by changing health insurance we’re literally saving lives. \r\n\nBased in San Francisco, SimplyInsured was founded in 2012 and is back by Bessemer Venture Partners, Polaris Ventures, and Y-Combinator. If you’re up for the challenge of improving health insurance for millions of Americans, we’re just getting started, and we’re growing!",
    "activity_status": "Active",
    "website": "http://simplyinsured.com",
    "founded_date": 2012.0,
    "team_size": 35.0,
    "location": "San Francisco",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:health-insurance; location:san-francisco-bay-area",
    "founders": [],
    "status": true,
    "generated_description": "SimplyInsured is on a mission that resonates deeply in today’s world: to eliminate the fear and complexity often associated with health insurance, particularly for small businesses. Founded in 2012 and hailing from San Francisco, this innovative company has leaned into the digital landscape to provide a 100% online platform for health insurance procurement. Backed by reputable investors such as Bessemer Venture Partners, Polaris Ventures, and Y Combinator, SimplyInsured is transforming a $20 billion industry in ways that matter—delighting thousands of customers along the way.\n\nAt the core of SimplyInsured’s approach is a values-driven culture. They emphasize transparency, feedback, and a strong commitment to action and growth. This culture empowers every employee—and there are about 35 of them—to directly impact the business, fostering both individual and collective excellence. The company prides itself on respecting diverse opinions and encourages dissenting voices to ensure they are always improving.\n\nTheir platform sets users up with the ability to compare health insurance plans from major carriers like United Healthcare, Blue Cross Blue Shield, and Kaiser Permanente, all within minutes and without the back-and-forth typically associated with traditional brokers. SimplyInsured offers a unique value proposition: free, unbiased recommendations tailored to each business's needs, and everything can be completed online. This means busy owners can secure health coverage with just a few clicks, saving time and avoiding headaches along the way.\n\nSupport is another strong pillar for SimplyInsured. Their dedicated customer support team works for the customers, not the insurance carriers. This approach has proven effective, with testimonials highlighting their responsiveness and effectiveness in resolving issues—sometimes with life-saving outcomes for their customers.\n\nIf you're a small business owner looking to navigate the often daunting waters of health insurance, SimplyInsured offers a way to do it without losing your mind or your wallet. Their services are designed to align perfectly with what’s best for the customer—because that’s truly at the heart of everything they do.\n\nTo explore their offerings or to get an instant quote, visit [SimplyInsured.com](http://simplyinsured.com). They are just getting started, and it’s clear they have ambitious plans for the future.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/8c12e053258438a86a39b600c4628eb10380aca2.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191928Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=d9d50a839fca68cb6f2ddaede6f52c54878dde704627973eb5977444efd1c964",
    "social_links": [
        "https://twitter.com/simplyinsured",
        "https://www.crunchbase.com/organization/simplyinsured",
        "https://github.com/SimplyInsured"
    ],
    "logo_path": "data/logos\\SimplyInsured_logo.png"
}