{
    "links": "https://www.ycombinator.com/companies/simplify",
    "name": "Simplify",
    "headline": "Helping a billion people build their dream career",
    "batch": "W21",
    "description": "Simplify is building the AI-enabled infrastructure to power the next generation of hiring – reimagining how people discover and secure their next career opportunity. We believe that everyone deserves an all-star talent agent helping them plan, manage, and accomplish their career goals, no matter their background, location, or education.\r\n\nThrough our flagship product, Copilot, we've helped over 1M+ job seekers discover and apply to over 100 million jobs - and we've done this with a tight-knit team of just 7 people. We're rapidly expanding on both the candidate and recruiter fronts, focused on our vision of building a common app and personal AI agent for your career.\r\n\nBacked by top-tier investors including Craft and YCombinator, we're a mission-driven team working to democratize the job search and disrupt the way hiring works today.",
    "activity_status": "Active",
    "website": "https://simplify.jobs/",
    "founded_date": 2020.0,
    "team_size": 5.0,
    "location": "San Francisco",
    "group_partner": "Harj Taggar",
    "group_partner_yc": "https://www.ycombinator.com/people/harj-taggar",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:generative-ai; industry:machine-learning; industry:marketplace; industry:recruiting; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Michael Yan, Founder",
            "description": "Prev @ Stanford. West Virginia native.",
            "linkedin": "https://www.linkedin.com/in/myan/"
        },
        {
            "name": "Ethan Horoschak, Founder",
            "description": "Stanford CS. Passionate about automation, XR, and blockchain!",
            "linkedin": "https://www.linkedin.com/in/ethanhoroschak/"
        },
        {
            "name": "Rushil Srivastava, Founder",
            "description": "CS @ Berkeley | Sneakerhead",
            "linkedin": "https://www.linkedin.com/in/rushilsrivastava"
        }
    ],
    "status": true,
    "generated_description": "**Company Overview: Simplify**\n\nFounded in 2020, Simplify is on a mission to revolutionize how people navigate their careers, aspiring to help a billion individuals achieve their dream jobs. Starting life with a small yet dedicated team of just seven, the company has made significant strides, assisting over one million job seekers to apply for more than 100 million job positions. That's no small feat.\n\n**What They Do**\n\nAt the core of Simplify’s offerings is their flagship product, *Copilot*, which acts like a personal assistant for your career. It provides tailored job recommendations, assists in crafting optimized resumes, and tracks applications—all while striving to simplify the often overwhelming job search process. Unlike traditional job boards, Simplify matches users with relevant job opportunities based on their profile, skills, and preferences, which improves the chances of receiving feedback by 25% compared to other platforms.\n\nTheir tools include:\n- **Job Matches:** Personalized job recommendations to fit your skills and preferences.\n- **Autofill Applications:** A browser extension that saves time by autofilling repetitive application fields.\n- **AI Resume Builder:** Create tailored resumes quickly and easily.\n- **Job Tracker:** Organize and track all your job applications in one place.\n\nIn essence, Simplify operates like a Hollywood agent for your career, aiming to democratize the hiring process through cutting-edge technology, all while maintaining user privacy.\n\n**Backed by Giants**\n\nThe company is supported by prominent investors, including Craft Ventures and Y Combinator, and considers itself part of a movement to disrupt standard hiring practices. Its base model is free for users, as they charge companies for job postings, ensuring that users’ data remains confidential and is not sold.\n\n**Location and Leadership**\n\nBased in San Francisco, Simplify is not just another tech startup. With a close-knit team of five, they maintain a lean operational structure that allows for agility and speed in the ever-changing job market. Harj Taggar, a partner at the group, lends his expertise to guide their growth.\n\n**The Future: Expanding Horizons**\n\nLooking ahead, Simplify is geared towards building a comprehensive career platform, deploying its technology to enhance both the job seeker experience and support recruiters. As they scale, their vision is to create a personal AI agent that operates like a career consultant, accessible regardless of users’ backgrounds or locations.\n\nIn a world that's complicated enough, Simplify makes the career journey clearer and more accessible—truly, a tool for this generation of job seekers. If you're curious about simplifying your job search, you might want to check them out at [Simplify Jobs](https://simplify.jobs/).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/34d451da3e64433e729d43c788ca9bead4b6536d.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191929Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=8f7cb882964381c3969dec3e303a057a62c965cc68aaab7f7c071ef3df8856c5",
    "social_links": [
        "https://www.linkedin.com/company/simplifyjobs/",
        "https://twitter.com/joinsimplify",
        "https://www.crunchbase.com/organization/simplify-d633",
        "https://github.com/SimplifyJobs"
    ],
    "logo_path": "data/logos\\Simplify_logo.png"
}