{
    "links": "https://www.ycombinator.com/companies/sirum",
    "name": "SIRUM",
    "headline": "SIRUM is a â\u0080\u009cmatch.comâ\u0080\u009d for unused medicine. We connect institutionalâ\u0080¦",
    "batch": "W15",
    "description": "SIRUM uses technology to connect, prioritize and simplify various sources of medicine. We help safety-net clinics access this medicine for their patients.\r\n\nSIRUM is an innovative nonprofit organization committed to reducing barriers to health for underserved populations. Incubated at Stanford University, SIRUM draws from the academic and technology expertise of faculty and alumni to strengthen its impact and efficiency. \r\n\nSIRUM has become a leader in prescription drug donations, providing consulting and technical assistance to county governments, community clinics and multiple drug donor groups to establish redistribution programs",
    "activity_status": "Active",
    "website": "http://sirum.org",
    "founded_date": null,
    "team_size": 15.0,
    "location": "Palo Alto",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:consumer-health-services; industry:nonprofit; location:san-francisco-bay-area",
    "founders": [],
    "status": true,
    "generated_description": "### Company Overview: SIRUM\n\n**Mission**\nSIRUM is essentially a \"match.com\" for unused medicine. Its mission is to connect surplus medications with those who need them most, particularly underserved populations who struggle with healthcare access. By simplifying and streamlining the donation process, SIRUM helps safety-net clinics to obtain vital medications for their patients.\n\n**Background**\nFounded in 2015 and incubated at Stanford University, SIRUM has leveraged its academic roots to become a key player in the nonprofit sector focused on healthcare. With the guidance of Stanford faculty and alumni, SIRUM has grown into a leader in prescription drug donations and has provided critical consulting and technical assistance to various stakeholders including county governments, community clinics, and drug donor organizations.\n\n**Location and Team**\nBased in Palo Alto, California, SIRUM currently employs a team of 15 dedicated individuals.\n\n**Core Activities**\nSIRUM operates as a national redistributor of surplus medicine, handling what is estimated to be around $11 billion worth of unexpired, unopened medications that go to waste each year. The organization facilitates the donation process by:\n\n1. **Collecting Surplus Medicine**: Individuals and organizations can donate excess medications instead of discarding them.\n2. **Matching Donated Medicine**: SIRUM utilizes technology to connect this surplus with community partners that need it.\n3. **Distributing to Patients**: Community partners provide the medications to patients who lack access otherwise.\n\nBy coordinating the donation and redistribution of medicines, SIRUM plays a vital role in enhancing healthcare access.\n\n**Current Initiatives**\nRecently, SIRUM has partnered with Good Pill to expand its impact into Illinois, showcasing its commitment to reaching more communities. They actively encourage all stakeholders, including individuals, manufacturers, and pharmacies, to get involved through their donation and medicine distribution efforts.\n\n**Impact**\nSIRUM proudly showcases its impressive metrics, which highlight the sheer volume of medicine redistributed and the number of individuals positively affected. The commitment to capturing real-time impacts is a cornerstone of their transparency and accountability.\n\n**Why It Matters**\nIn a landscape where 50 million Americans forgo necessary medications due to prohibitive costs, SIRUM addresses a critical healthcare crisis. Their approach not only saves medicine but also lives, allowing individuals to prioritize their health without the financial burden that often accompanies it.\n\n**Get Involved**\nTo learn more or participate, visit SIRUM’s website at [sirum.org](http://sirum.org). Your involvement can make a significant difference in the lives of those in need.\n\n### Conclusion\nSIRUM stands out as an innovative nonprofit that leverages technology to tackle the critical issue of medicine waste while enhancing access to life-saving medications for the underserved. If you're looking to make a tangible difference in healthcare, consider supporting their mission.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/5e5c73c920c6c877b7dd10f37c0c8ed165a66e89.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191930Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=7fb6b8af5b1c2923cf5b7da989f2b41dd0bf3602fbbd0ccac7fdbe4ecc02cf86",
    "social_links": [
        "https://twitter.com/sirum",
        "https://www.facebook.com/sirumnews",
        "https://www.crunchbase.com/organization/sirum"
    ],
    "logo_path": "data/logos\\SIRUM_logo.png"
}