{
    "links": "https://www.ycombinator.com/companies/sitenna",
    "name": "Sitenna",
    "headline": "B2B SaaS for modern infrastructure to deploy and manage sites",
    "batch": "S21",
    "description": "Modern infrastructure (incl. 5G wireless and EV charging) has a problem. Whilst analysts are claiming exponential growth in deployments in the coming years, the truth is that the process of site acquisition and management is currently manual, archaic and painful. Sitenna has developed software to digitise the process reducing site acquisition from currently 24 months to a matter of weeks. We work with Real Estate, Local Government, Infrastructure Providers and Operators.\r\n\nSitenna launched in the UK in late 2021 and was selected as the leading software vendor to a UK government sponsored infrastructure project, with over 1m assets on the platform and all major telecom players active, including BT, EE and BAI. \r\n\nThe team is led by a group of industry veterans with C-Suite level access to telecom companies worldwide. Daniel has worked in the telecoms industry for over 12 years and he has supported $100bn in transactions in over 30 countries. Brian has over 12 years’ experience as a technical consultant including BAE Systems Applied Intelligence, Norkom and Ericsson. Both are multiple time founders, execs and non-execs in start-ups including exits.",
    "activity_status": "Active",
    "website": "http://www.sitenna.com",
    "founded_date": 2020.0,
    "team_size": 7.0,
    "location": "Birmingham, United Kingdom",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:marketplace",
    "founders": [
        {
            "name": "Daniel Campion, Founder",
            "description": "I've worked in the telecoms industry for over 12 years specialising in strategy, M&A, spectrum auctions and network sharing. Working for Orange Group, Aetha Consulting and KPMG, I have helped clients in over 30 countries supporting over $100bn in deals. I've also founded businesses in consulting and esports, and was a board member of a enterprise software business in the Oil & Gas sector that was acquired in 2021.",
            "linkedin": "https://www.linkedin.com/in/danielcampion/"
        },
        {
            "name": "Brian Sexton, Founder",
            "description": "I have over 15 years experience as a technical consultant with BAE systems,\nEricsson and Norkom. I specialize in the development of technology platform\nand machine learning algorithms, implementing complex systems for private and\npublic clients around the world. Recently I have led the engineering teams for a\nnumber of start-ups",
            "linkedin": "https://www.linkedin.com/in/briansexton-ire/"
        }
    ],
    "status": true,
    "generated_description": "**Sitenna: Revolutionizing Infrastructure Management**\n\nFounded in 2020 and launched in the UK in late 2021, Sitenna is on a mission to transform site acquisition and management within the B2B SaaS landscape. Their focus is modern infrastructure—think 5G networks and EV charging stations. The common thread? A notoriously painful, manual process that used to take up to 24 months is now being streamlined to mere weeks thanks to Sitenna's innovative software.\n\nThe founders, Daniel and Brian, come with extensive industry backgrounds—Daniel with over 12 years in telecom, having been involved in transactions worth $100bn across 30 countries, and Brian with solid technical consulting credentials. They have proven themselves as repeat entrepreneurs, leading startups through the entire life cycle, including successful exits.\n\nSitenna was notably selected as the leading software vendor for a UK government-sponsored infrastructure initiative, which speaks volumes about its credibility and market potential. The platform currently supports over 1 million assets and counts all major UK telecom players like BT and EE among its users.\n\nOperating from Birmingham, Sitenna boasts a lean team of 7 dedicated employees and is backed by Y Combinator's Batch S21. It focuses on several key product areas including site acquisition, site control, project management, asset management, asset marketing, and leasing operations. \n\nTheir offerings are designed to facilitate every step of the infrastructure lifecycle, ensuring collaboration among stakeholders and delivering actionable insights. With capabilities like automating contract workflows and real-time asset management, Sitenna helps organizations not just to keep pace but to thrive in the rapidly evolving infrastructure landscape.\n\nSitenna’s platform is not just robust; it’s also user-centric, compliant with standards like SOC II for security. This positions Sitenna as a critical ally for real estate firms, local governments, infrastructure providers, and telecommunications operators seeking efficiency. \n\nIn a world increasingly dependent on quick and efficient deployment of essential infrastructure, Sitenna is poised to unlock a world of opportunities. Whether you're in telecoms, energy transition, real estate, or local government, their tools are tailored to keep you ahead of the curve. \n\nFor more information about how Sitenna can optimize your infrastructure management processes, visit [Sitenna.com](http://www.sitenna.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/67d2fe40342befb529a3ae412b881f3bc4028e82.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191930Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=3c5e9533059bd4e8d3f7151dfe6d49f49f71a366418aa668a4a856bd9dbc9eff",
    "social_links": [
        "https://www.linkedin.com/company/sitenna/"
    ],
    "logo_path": "data/logos\\Sitenna_logo.png"
}