{
    "links": "https://www.ycombinator.com/companies/skyscrape",
    "name": "Skyscrape",
    "headline": "Skyscrape makes temperature-responsive insulation",
    "batch": "S17",
    "description": "Skyscrape makes temperature responsive fabrics for a new type of clothing. These fabrics literally change shape in response to a change in temperature: the fabrics become thicker and insulate more as the temperature drops, and they become thinner and insulate less as the temperature rises again. This \"intelligent insulation\" has no wires or sensors, and the fabric's shape-changing behavior comes from a natural materials response. \r\n\nSkyscrape’s fabrics offer expanded thermal comfort across a wider temperature range than conventional clothing. Creating textiles that could change shape with changing temperatures required years of laboratory work by an interdisciplinary team of scientists, engineers, designers, and weavers, designing and refining machines and processes to make yarns and fabrics that could adapt to the environment.\r\n\nSkyscrape's first market entry was with Ralph Lauren in the 2022 Team USA Winter Olympics Opening Ceremony.",
    "activity_status": "Active",
    "website": "http://skyscrape.us",
    "founded_date": 2017.0,
    "team_size": 3.0,
    "location": "Portland, OR",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:smart-clothing; industry:sustainable-fashion",
    "founders": [],
    "status": true,
    "generated_description": "Skyscrape, founded in 2017 in Portland, OR, is on a mission to redefine insulation with its innovative temperature-responsive fabrics. Initially, the company aimed to create smart fabrics for clothing that would adapt to temperature changes. Imagine wearing a jacket that automatically becomes thicker and more insulating when it's cold, then thins out when the weather warms up—no wires, no sensors, just a clever use of natural materials reacting to their environment.\n\nThe engineering behind this idea is impressive. Skyscrape's fabric structure is such that the yarns expand and contract in response to heat, allowing the garment to adjust its thickness accordingly. After rigorous years of research by a diverse team of scientists, engineers, and designers, Skyscrape was successful in bringing this technology to life. Their breakthrough was showcased during the 2022 Team USA Winter Olympics, where they collaborated with Ralph Lauren.\n\nWith only three employees, Skyscrape has already caught the eye of major brands through Y Combinator (Batch S17) and has received backing from the U.S. Department of Energy. Their fabrics not only promote thermal comfort but are also positioned within the larger context of sustainable fashion (you can check them out at [skyscrape.us](http://skyscrape.us)).\n\nAs they forge ahead, Skyscrape is not just about making clothing; they aim to influence how we think about warmth and energy efficiency—both personally and in the context of heating and cooling our buildings. Their vision speaks to a future where comfort and sustainability can comfortably coexist.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/0cb5fa7c2c31676480562eee209315004814bdbb.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191930Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=8cc22ab15c7bcdad14d16ebf7b4cec1eb0608bfb9fc870e2cac5335bd9dd8dc6",
    "social_links": [
        "https://twitter.com/skyscrape_usa",
        "https://www.crunchbase.com/organization/kestrel-materials"
    ],
    "logo_path": "data/logos\\Skyscrape_logo.png"
}