{
    "links": "https://www.ycombinator.com/companies/skyvern",
    "name": "Skyvern",
    "headline": "Open Source AI Agent to automate browser workflows via an API",
    "batch": "S23",
    "description": "Skyvern helps companies automate browser based workflows using LLMs and Computer Vision, fully automating manual workflows and replacing brittle or unreliable scripts.\r\n\nExamples include:\r\n1. Automating materials procurement from commerce websites\r\n2. Completing complex multi-step workflows (ie getting an insurance quote from Geico.com)\r\n3. Automatically logging into portals and downloading invoices\r\n4. Navigating legacy content systems to do data extraction or data entry",
    "activity_status": "Active",
    "website": "https://www.skyvern.com/",
    "founded_date": 2023.0,
    "team_size": 3.0,
    "location": "San Francisco",
    "group_partner": "Nicolas Dessaigne",
    "group_partner_yc": "https://www.ycombinator.com/people/nicolas-dessaigne",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:robotic-process-automation; industry:workflow-automation; industry:open-source; industry:api; industry:ai; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Suchintan Singh, Founder",
            "description": "I'm the founder of Skyvern. We help companies automate complex workflows using AI agents and computer vision.\n\nIn the past, I've built the ML Platforms at both Faire and Gopuff, which generated over $100M of GMV across their two businesses, \n\nI also love bad jokes and puns, so if you have any or are in the need of any feel free to hit me up!",
            "linkedin": "https://www.linkedin.com/in/suchintansingh/"
        },
        {
            "name": "Shuchang Zheng, Founder",
            "description": "I am the CTO and cofounder of Skyvern. For the past 5 years, I've been building developer and platform tools.\n\nAt Lyft, I built testing tools (simulation platform, load test framework, and end to end test framework) used by 1000+ engineers to boost dev productivity, ensure Lyft doesn't go down during peak events, and reduce infra cost.\n\nAt Patreon, I helped scale the payment and db infra to process 20M+ transactions per month and free 100+ engineers from the 3-day monthly code freeze",
            "linkedin": "https://linkedin.com/in/shuchang-zheng-76784958"
        }
    ],
    "status": true,
    "generated_description": "**Skyvern: Simplifying Browser Automation with Open Source AI**\n\nFounded in 2023 and part of Y Combinator's Batch S23, Skyvern is a pioneering startup based in San Francisco with a mission to automate browser workflows using an open-source AI agent. With a small team of three, Skyvern is making significant strides in the field of robotic process automation, leveraging large language models (LLMs) and computer vision.\n\n### What They Do\n\nSkyvern primarily focuses on transforming mundane browser-based tasks into automated processes. This is accomplished through their API, which enables businesses to streamline various workflows without succumbing to the pitfalls of brittle or unreliable scripts. Some notable use cases include:\n\n1. **Materials Procurement**: Automatically gather materials from e-commerce sites.\n2. **Complex Workflows**: Generate insurance quotes from sites like Geico.com via a multi-step process.\n3. **Invoice Management**: Log into financial portals and retrieve invoices autonomously.\n4. **Data Handling**: Extract or input data into legacy content systems effortlessly.\n\n### Technical Features\n\nSkyvern’s platform offers a wealth of features that set it apart:\n\n- **Multi-tasking**: Users can execute hundreds of tasks simultaneously, all triggered by a simple API call.\n- **CAPTCHA & 2FA Support**: Overcome popular security obstacles to seamlessly interact with web applications.\n- **Explainable AI**: Users can scrutinize each run with built-in summaries detailing every action taken, allowing for transparent automation.\n- **Tailored Data Extraction**: Extract data in preferred formats, such as CSV or JSON, to fit specific business needs.\n\n### User-Friendly Approach\n\nSkyvern's no-code and low-code options make it accessible for non-developers, while its robust architecture supports advanced users who appreciate the power and flexibility of an API-driven approach. With a transparent pricing model, Skyvern operates on a freemium basis: it’s free for open-source users and charges a minimal fee of $0.10 per page for cloud services.\n\n### Community and Support\n\nAs an open-source project, Skyvern encourages community participation and discourse, providing support resources and documentation for a wide range of users. Their commitment to transparency is mirrored in their operations and pricing strategy—there are no hidden fees.\n\n### Customer Feedback\n\nSkyvern has garnered positive responses from users who appreciate its efficiency and clear functionality in solving complex automation tasks. The company has built a reputation for attention to user experience and responsiveness, often receiving compliments for their customer service.\n\n### Why Skyvern Matters\n\nSkyvern taps into a pressing need in every industry: automating repetitive and labor-intensive web tasks while harnessing cutting-edge AI technology. As businesses do more online, the ability to seamlessly integrate automation into daily workflows becomes essential.\n\nFor more information, to see demos, or to get started, visit [Skyvern's official website](https://www.skyvern.com). If you're handing over tedious tasks to an AI, Skyvern could be working for you—making your workflows smarter, faster, and more efficient. \n\nAs Skyvern continues to grow and innovate, it's poised to redefine how companies interact with digital environments, one automated workflow at a time.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/545215058f585c8e167f649e8675e03389eccaa0.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191931Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=0823b92fe8324f9698f40cf824595d5355f467aa38c6c887956e7cbd6ed6aae5",
    "social_links": [
        "https://www.linkedin.com/company/95726232",
        "https://x.com/skyvernai"
    ],
    "logo_path": "data/logos\\Skyvern_logo.png"
}