{
    "links": "https://www.ycombinator.com/companies/sleep-reset",
    "name": "Sleep Reset",
    "headline": "Sleep Reset is a clinically proven CBT-i program for better sleep",
    "batch": "W17",
    "description": "Our mission is to improve quality of life for millions of people by providing easy, immediate access to the world’s best sleep care.\r\n\nSleep Reset is a digital, personalized sleep clinic, available in a convenient mobile app for iOS and Android. Our program was designed in partnership with leading sleep experts from top sleep clinics and universities. The program improves sleep and reduces sleep anxiety with the most effective methods from sleep clinics, including strategies based on Cognitive Behavioral Therapy for Insomnia (CBT-i) which are proven to be more effective than sleeping pills. Throughout our program, each member is paired with a dedicated sleep coach who personalizes their program. It’s a life-long, sustainable solution to sleep better in weeks, with no pills or melatonin needed – which means no grogginess, side effects, or dependency.\r\n\nSleep Reset has been covered in Forbes, TechCrunch, and INSIDER. The company was founded by Yunha Kim, a serial entrepreneur recognized by Forbes as 30 Under 30 and is backed by top Silicon Valley investors including YCombinator, Foundation Capital, New Enterprise Associates, Stanford University and 20+ founders/executives of leading companies.",
    "activity_status": "Active",
    "website": "https://www.thesleepreset.com/?utm_source=yc",
    "founded_date": 2023.0,
    "team_size": 8.0,
    "location": "San Francisco",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:mental-health-tech; industry:sleep-tech; industry:consumer-health-services; industry:health-tech; industry:digital-health; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Yunha Kim, Founder/CEO",
            "description": "....",
            "linkedin": "https://www.linkedin.com/in/yunhajudykim"
        }
    ],
    "status": true,
    "generated_description": "Sleep Reset is a forward-thinking company committed to improving sleep quality through a clinically-proven program based on Cognitive Behavioral Therapy for Insomnia (CBT-i). Founded in 2023 by Yunha Kim—a noteworthy serial entrepreneur recognized in Forbes 30 Under 30—Sleep Reset is situated in the vibrant San Francisco Bay Area and operates with a dedicated team of eight.\n\n**Mission & Vision:**\nSleep Reset's overarching aim is remarkable: to enhance the quality of life for millions by democratizing access to top-notch sleep care via a user-friendly mobile app for both iOS and Android. The aim is clear—provide effective sleep training without reliance on medication, ensuring users can achieve restful slumber without side effects or dependency.\n\n**Program Highlights:**\nThe program pairs each member with a dedicated sleep coach who tailors strategies to individual needs. This blend of personalized support and scientifically-backed methods ensures that users experience sustainable improvements in their sleep in as little as two weeks. The app combines features like sleep assessments, progress tracking, a library of mindfulness resources, and more, all designed with insights from leading sleep experts across top institutions.\n\n**Backed by Expertise:**\nThe program's strength lies in its foundation; it's built on research developed alongside experts from institutions like Stanford University and Yale. Its unique approach prioritizes proven techniques over temporary fixes like sleeping pills, garnering attention from platforms such as Forbes, TechCrunch, and INSIDER.\n\n**Investor Confidence:**\nBacked by a prestigious portfolio of investors including Y Combinator and notable Silicon Valley venture firms, Sleep Reset is positioned as a standout in the health-tech landscape, particularly in the burgeoning fields of mental health and sleep technology.\n\n**User Success:**\nUsers have reported significant improvements, averaging an additional 1.5 hours of sleep per night and less time awake during the night. The program aims to empower individuals not just to catch up on sleep, but to understand and manage their sleep health better.\n\nIf you’re curious about how your sleep patterns stack up, Sleep Reset offers a welcoming invitation to start with a free assessment. With Sleep Reset, you’re stepping into a solution that could redefine your nightly routine—because better sleep means a better you. For more details, head to [Sleep Reset](https://www.thesleepreset.com/?utm_source=yc).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/1322db7f8dd788cec3f70f5bc33f9f8ed0e6d9e3.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191931Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=77b44ad77274e5cf71e92880774504d1c7298e6d991117957a56808119efbd01",
    "social_links": [
        "https://www.linkedin.com/company/sleep-reset/",
        "https://twitter.com/SleepReset",
        "https://www.facebook.com/sleepreset"
    ],
    "logo_path": "data/logos\\Sleep_Reset_logo.png"
}