{
    "links": "https://www.ycombinator.com/companies/solidroad",
    "name": "Solidroad",
    "headline": "AI-powered coaching platform for customer facing teams.",
    "batch": "W25",
    "description": "Solidroad provides quality scoring, personalised coaching, and feedback for your customer conversations in both training and live environments.\r\n\nCustomer-facing reps can practice realistic conversations (phone, email, live chat & video call) with AI customers and receive personalised coaching and feedback in a risk-free environment. Solidroad also integrates with your live channels to score conversations and find skill gaps for continuous improvement.\r\n\nWe are working with large sales and support orgs to reduce time to proficiency during onboarding, provide massive efficiency gains for enablement and operations teams and improve go-live CSAT scores.\r\n\nSolidroad reviews and evaluates 100% of your mock and live customer conversations meaning no more need for you to run manual role-play sessions or manually review calls/chats all day.",
    "activity_status": "Active",
    "website": "https://solidroad.com",
    "founded_date": 2023.0,
    "team_size": 6.0,
    "location": "Dublin, Ireland",
    "group_partner": "Brad Flora",
    "group_partner_yc": "https://www.ycombinator.com/people/brad-flora",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:artificial-intelligence; industry:saas",
    "founders": [
        {
            "name": "Patrick Finlay, Founder",
            "description": "Co-founder and CTO of Solidroad (W2025) and a second-time founder. Previously co-founded Monaru (S2019), where we helped individual creators earn $100k+ each by selling live classes online.\n\nBefore that, I was as a product engineer at Intercom. I hold a BAI in Computer Engineering from Trinity College Dublin; my research focus was on dispute resolution mechanisms for Ethereum smart contracts.",
            "linkedin": "https://www.linkedin.com/in/patjfin/"
        },
        {
            "name": "Mark Hughes, Founder",
            "description": "Co-founder and CEO of Solidroad (W2025), an AI-powered coaching platform for customer-facing teams. Before Solidroad, I founded Gradguide, a coaching and mentorship network for recent grads, where I raised €2M, grew the team to 20, and exited in late 2022.\n\nEarlier in my career, I led Sales, Support, and Customer Success for EMEA at Chargify (now Maxio) and worked as an early sales rep at Intercom. I studied Business at Trinity College Dublin and spent a year at HEC Paris.",
            "linkedin": "https://www.linkedin.com/in/mark-hughes-a36915a7/"
        }
    ],
    "status": true,
    "generated_description": "**Solidroad: Streamlining Customer Conversations with AI**\n\nFounded in 2023 and based in Dublin, Ireland, Solidroad is a fresh face in the tech scene, emerging from the Y Combinator Batch W25. At its core, Solidroad is about optimizing the way customer-facing teams interact by leveraging AI technology. Their mission? To provide an AI-powered coaching platform specifically designed for sales and support organizations.\n\nWhat sets Solidroad apart is its comprehensive approach to quality assurance and training. The platform allows customer-facing reps to practice real conversations in a controlled environment, covering all major communication channels—phone, email, live chat, and video. By interacting with AI-generated customer personas, teams can hone their skills without the risk of disappointing actual customers.\n\nThe platform’s capabilities don't stop there. Solidroad actively reviews and evaluates 100% of customer conversations—whether live or mock—eliminating the need for manual role-play sessions. This results in faster onboarding, improved efficiencies for enablement teams, and enhanced overall customer satisfaction scores (CSAT).\n\nWith a small but focused team of six, Solidroad aims to transform how organizations assess skills and identify gaps in training through continuous feedback loops. Their system integrates seamlessly with popular tools like Salesforce, Zoho, and Intercom, which enhances efficiency even further.\n\nSolidroad is all about driving tangible results: think reduced ramp-up times for new agents, higher CSAT scores, and lower operational costs. These are critical metrics in the fiercely competitive landscape of customer service.\n\nSo, if you're looking to elevate your customer interactions and streamline training processes, Solidroad is positioned as a nimble, powerful ally in your quest for excellence. For more information or to witness the platform in action, check out their website at [solidroad.com](https://solidroad.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/234388fb0d70ecf3c39667c6466a1c51a001af1d.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191935Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=9fe3a4f1bb5fec53e3e72583edceffd4335040e5df4e3595dd309f4c2a9a5228",
    "social_links": [
        "https://www.linkedin.com/company/solidroad/?viewAsMember=true",
        "https://x.com/getsolidroad"
    ],
    "logo_path": "data/logos\\Solidroad_logo.png"
}