{
    "links": "https://www.ycombinator.com/companies/solve-intelligence",
    "name": "Solve Intelligence",
    "headline": "AI patent drafting, prosecution, harvesting and more for legal teams.",
    "batch": "S23",
    "description": "We provide an in-browser document editor that any patent attorney can start using straight away. It works just like Google Docs but, under the hood, is powered by an AI copilot to help the attorney draft, prosecute, and harvest high-quality patents efficiently.\r\n\nOur product can help with all stages of the patent life cycle, from drafting and filing to prosecution and opposition.",
    "activity_status": "Active",
    "website": "https://www.solveintelligence.com/",
    "founded_date": 2023.0,
    "team_size": 9.0,
    "location": null,
    "group_partner": "Tom Blomfield",
    "group_partner_yc": "https://www.ycombinator.com/people/tom-blomfield",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": null,
    "founders": [
        {
            "name": "Chris Parsonson, Founder",
            "description": "Chris did his PhD in machine learning at UCL, publishing and winning awards in top AI conferences and journals. He holds an MRes from the University of Cambridge and an MEng from Imperial College London. Prior to founding Solve Intelligence, Chris worked at leading tech organisations, including The Alan Turing Institute, InstaDeep, and Dyson.",
            "linkedin": "https://linkedin.com/in/christopher-parsonson-381830a3"
        },
        {
            "name": "Sanj Ahilan, Founder",
            "description": "Sanj completed his PhD in machine learning at UCL, won awards at top AI conferences, and developed popular open-source code for fine-tuning large language models. Before founding Solve Intelligence, he worked at Magic Carpet AI and Huawei Technologies. He holds an MSci in Physics from the University of Cambridge.",
            "linkedin": "https://linkedin.com/in/sanjeevan-ahilan-844b33137"
        },
        {
            "name": "Angus Parsonson, Founder",
            "description": "Angus completed his MEng degree in computer science at the University of Bristol, during which he received a cyber security scholarship from GCHQ. He has since worked as a Quantitative Developer at Coremont LLP, a spin-off from hedge fund Brevan Howard.",
            "linkedin": "https://linkedin.com/in/angus-parsonson-24935914b"
        }
    ],
    "status": true,
    "generated_description": "**Solve Intelligence: Revolutionizing Patent Drafting Through AI**\n\nFounded in 2023 and part of Y Combinator’s Batch S23, Solve Intelligence is reshaping the landscape of patent law with its cutting-edge AI technology. The mission? To streamline the entire patent lifecycle for legal teams, making the process of drafting, prosecuting, and harvesting patents not just more efficient, but also more intelligent.\n\n**What They Offer**\n\nAt its core, Solve Intelligence provides a user-friendly, in-browser document editor that patent attorneys can dive into immediately. Think of it as the Google Docs of patent drafting, but with an AI copilot that enhances the user’s capabilities. This tool is tailored to assist with every phase of the patent process—from initial drafting and filing to prosecution and opposition.\n\n**Efficiency Meets Customization**\n\nTheir product stands out by not only increasing drafting efficiency—users report improvements of 60-90%—but also allowing for a high degree of customization based on specific legal requirements, styles, and regional nuances. This adaptability means that legal professionals can focus more on the substance of their patents and less on the mechanical aspects of writing.\n\n**Security First**\n\nWith so much sensitive information at stake, Solve Intelligence doesn’t take security lightly. Their platform adheres to strict regulations and certifications, including SOC 2 and GDPR. Notably, they never train their AI on user data, ensuring absolute confidentiality and peace of mind for legal teams.\n\n**A Growing Team**\n\nOperating out of an unnamed location, Solve Intelligence is small yet mighty with a team of nine and guided by Group Partner Tom Blomfield. Their collective experience and passion drive the continuous evolution of their product, bringing new features on a regular basis that further enhance workflow and patent quality.\n\n**Feedback from the Field**\n\nThe testimonials from users speak volumes. Legal professionals have described the platform as \"incredibly powerful\" and a \"game changer,\" highlighting how it allows them to reclaim valuable time and improve the quality of their outputs.\n\nFor those looking to stay competitive in the fast-evolving world of patent law, Solve Intelligence is a tool well worth exploring. Whether you're drafting a fresh patent or navigating complex legal waters, having AI as a copilot can make a world of difference. \n\nDiscover more about their technology and request a demo at [Solve Intelligence's website](https://www.solveintelligence.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/4972d9dfc6d6b79cae4f344a1b28e513b64601cf.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191937Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=3af74247a966e9be80cf700bd81473e8c9527299c9cf2de802811182f775b220",
    "social_links": [
        "https://www.linkedin.com/company/solve-intelligence/",
        "https://twitter.com/solveintel",
        "https://www.crunchbase.com/organization/solve-intelligence"
    ],
    "logo_path": "data/logos\\Solve_Intelligence_logo.png"
}