{
    "links": "https://www.ycombinator.com/companies/soraban",
    "name": "Soraban",
    "headline": "Automates data intake and service delivery process for tax firms.",
    "batch": "W21",
    "description": "Soraban's building a copilot for accounting firms. We're first automating the client data gathering and service delivery process with software and AI.\r\n\nWe are looking for ambitious people to build the best piece of software for accountants.",
    "activity_status": "Active",
    "website": "https://www.soraban.com",
    "founded_date": 2021.0,
    "team_size": 30.0,
    "location": "Tempe, AZ",
    "group_partner": "Gustaf Alstromer",
    "group_partner_yc": "https://www.ycombinator.com/people/gustaf-alstromer",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:ai-enhanced-learning; industry:robotic-process-automation; industry:saas",
    "founders": [
        {
            "name": "Enoch Ko, Founder",
            "description": "Enoch is the founder and CEO at Soraban. He studied Computer Science at Arizona State University and spent four years doing software engineering work for companies like AppOmni, Sophos. Prior to Soraban, he started and ran a tech-enabled accounting firm for two years.",
            "linkedin": "https://www.linkedin.com/in/koenoch/"
        }
    ],
    "status": true,
    "generated_description": "## Soraban: The Future of Tax Firm Efficiency\n\n### Overview\nFounded in 2021 and part of Y Combinator's W21 batch, Soraban is a tech start-up based in Tempe, Arizona. Their mission? To automate the data intake and service delivery processes for tax firms, essentially modernizing the back-office operations that often lag behind in technology.\n\n### The Vision and Product Offering\nInitially set out to create a co-pilot for accounting firms, Soraban has developed an intelligent client coordinator specifically designed for tax compliance. By harnessing the power of AI and software automation, they aim to help tax professionals drastically cut down the time they spend on administrative tasks—up to 50% of administrative workload can be reduced, allowing staff to focus on client relationships and service delivery instead.\n\n**Key Products Include:**\n1. **Collect**: An intelligent, dynamic questionnaire for document collection.\n2. **Deliver**: A streamlined workflow for sending tax returns efficiently.\n3. **Connect**: A platform designed to integrate seamlessly with existing tax software for a faster client experience.\n\n### The Team and Culture\nWith a team of 30 ambitious individuals, Soraban encourages a work environment where innovation is key. They are in search of talent eager to build the best accounting software on the market. The leadership includes Gustaf Alstromer, a group partner from Y Combinator, ensuring a strong foundation for growth and expertise.\n\n### Key Features and Security\n- **Automation**: Automates the tedious tasks associated with document collection and communication with clients.\n- **Integration**: Works with various tax software solutions, significantly improving workflow efficiency.\n- **Security**: Meets strict compliance standards with SOC 2 Type I certification, ensuring data privacy and security.\n\n### Pricing Strategy\nSoraban's pricing model reflects its efficiency; firms only pay for active client engagements, making it cost-effective. The base prices are competitive, starting at $20 per return and allowing scalability as a firm grows.\n\n### Moving Forward\nSoraban is not just about automation; it's about enhancing the relationship between tax professionals and their clients. By built-in reminders, seamless integrations, and a user-friendly interface, they not only cater to the immediate needs of tax firms but also anticipate the future demands of an increasingly digital economy.\n\nFor more information and demonstrations, check out [Soraban's official website](https://www.soraban.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/506fb1e3b8009e82d6b62ddce26342a4f82f65af.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191937Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=070247a2ecbeb988328a602610a66d389aad7bae26ebf6f2a353b95fd8a42ff7",
    "social_links": [],
    "logo_path": "data/logos\\Soraban_logo.png"
}