{
    "links": "https://www.ycombinator.com/companies/soteri-skin",
    "name": "SOTERI SKIN",
    "headline": "D2C Skincare for Eczema",
    "batch": "W22",
    "description": "Soteri Skin is D2C skincare for chronic skin conditions like eczema. We’re the only non-prescription product proven to provide long-lasting relief for the 30 million Americans who suffer from eczema.\r\n\nHow it works:\r\nSkin surface pH is constantly in flux, and many of your daily activities can throw it out of balance. People with chronic skin conditions such as eczema have a harder time regulating their skin's pH. \r\n\nSoteri's patented pH/LOCK™ locks skin in at a therapeutic pH for 12+ hours, which is shown to help break the cycle of skin sensitivity, whether you have eczema, psoriasis, or just a bad sunburn.\r\n\nOur formulations are aesthetically elegant (non-sticky, sit well under makeup, etc), safe for anyone to use, and don't require a prescription. Most people see skin health improvements within the first few weeks of application, even for tricky, chronic skin conditions like eczema and psoriasis.\r\n\nWith Soteri Skin, anyone can enjoy healthy, glowing, pH-enomenal skin!",
    "activity_status": "Active",
    "website": "https://soteriskin.com/",
    "founded_date": 2021.0,
    "team_size": 2.0,
    "location": "San Francisco",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:e-commerce; industry:skincare; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Rafal Pielak, Founder",
            "description": "My background is in product and business development. I received Ph.D. in Biomedical Chemistry and Molecular Pharmacology from Harvard Medical School and went on to complete my postdoctoral fellowship at UC Berkeley. Later I worked for biopharma identifying business opportunities in the rare disease space. Before launching Soteri Skin, I spent 7 years leading a product innovation team at L'Oreal where I helped to launch and grow L'Oreal Tech Incubator in San Francisco.",
            "linkedin": "https://www.linkedin.com/in/rafal-pielak-953704a/"
        }
    ],
    "status": true,
    "generated_description": "### Soteri Skin: A New Hope for Eczema Relief\n\n**Overview**  \nFounded in 2021 and part of Y Combinator's W22 batch, Soteri Skin is a San Francisco-based Direct-to-Consumer (D2C) skincare brand dedicated to offering a solution for chronic skin conditions, particularly eczema. They’re tackling a huge pain point for the 30 million Americans who suffer from this sometimes debilitating condition.\n\n**Mission**  \nSoteri Skin’s mission is straightforward: provide long-lasting relief for eczema and similar skin disorders without needing a prescription. The brand has developed a unique, patented technology known as pH/LOCK™ that stabilizes skin pH to a therapeutic level for over 12 hours, aiming to break the cycle of skin sensitivity related to conditions such as eczema and psoriasis.\n\n**How It Works**  \nFor people with eczema, maintaining the right skin pH is crucial. Various daily activities can disturb this balance, leading to flare-ups and discomfort. Soteri Skin’s innovative formulations not only restore this balance but also do so without leaving a sticky residue, making them ideal for daily use and even compatible with makeup.\n\n**Product Line and Features**  \nSoteri Skin’s range includes:\n\n- **2-Step Eczema Starter Kit**\n- **Gentle Start Body & Face Cream**\n- **No More Rough Patches Cream**\n- **BÉBÉ SKIN Baby Eczema Cream**\n\nThese products are designed to be effective for everyone, including children, and customers often report noticeable improvements relatively quickly—typically within a few weeks.\n\n**The Story Behind the Brand**  \nSoteri is the brainchild of Rafal, a Harvard-trained Biomedical PhD. His inspiration came from witnessing the struggles of his wife and daughter with eczema and the ineffectiveness of available topical treatments. By diving into the science of skin health, Rafal discovered a critical relationship between skin pH and eczema symptoms, leading to the development of the pH/LOCK™ technology.\n\n**Current Operations**  \nSoteri Skin operates with a lean team of two and emphasizes an e-commerce strategy to reach its audience effectively. Their website not only offers product sales but is also a rich resource for information on skincare and the science behind their formulations.\n\n**Conclusion**  \nSoteri Skin is making waves in the skincare industry with its unique focus on eczema and its evidence-backed approach to treatment. The combination of innovative science, personal motivation, and a commitment to quality positions them as serious contenders in the skincare market. Anyone looking for reliable eczema relief now has a promising option in Soteri Skin.\n\nFor more information, visit their website at [Soteri Skin](https://soteriskin.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/587168b0de735ec7881235a9bf298a823da5651e.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191943Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=98370a9efd2710a652e7b6ff29b62fb16f0c16df7c33c1466f752d79256d0b9d",
    "social_links": [
        "https://www.linkedin.com/company/73029618/",
        "https://twitter.com/SoteriSkin",
        "https://www.instagram.com/soteriskin/"
    ],
    "logo_path": "data/logos\\SOTERI_SKIN_logo.png"
}