{
    "links": "https://www.ycombinator.com/companies/spaceium-inc",
    "name": "Spaceium Inc",
    "headline": "In-Space Refueling",
    "batch": "S24",
    "description": "Spaceium builds fully automated space stations to refuel and repair spacecraft. We have secured $86.1 million in binding commercial contracts and have an additional $230 million in the pipeline. Additionally, we have 1 billion dollars in letters of intent. We have successfully tested our hardware, which will launch to space next year. \r\n\nOur fully automated space stations will efficiently store and transfer both cryogenic (extremely cold) and non-cryogenic fuels with zero loss during storage and transfer. And they can transfer fuel seamlessly to any spacecraft design using our proprietary modular robotic arm.\r\n\nOur customers include launch vehicles, orbital transfer vehicles, moon landers, and spacecraft that benefit from increased payload capacity and extended travel capabilities. Our long-term vision is to build service hubs along the space superhighway to connect Earth to Moon and Mars and help humanity to become multi multi-planetary species",
    "activity_status": "Active",
    "website": "https://spaceium.com",
    "founded_date": 2023.0,
    "team_size": null,
    "location": "Long Beach, CA",
    "group_partner": "Brad Flora",
    "group_partner_yc": "https://www.ycombinator.com/people/brad-flora",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:hard-tech; industry:robotics; industry:space-exploration; industry:aerospace",
    "founders": [
        {
            "name": "Ashi Dissanayake, Founder",
            "description": "Co-Founder & CEO @ Spaceium (S24) \nI love space and grew up wanting to be an astronaut one day. I co-founded Spaceium to build space infrastructure for a better new space economy. \u2028\nI specialize in orbital mechanics and rocket propulsion systems. Previously, I worked on Aerodynamic models for NASA, built models for interplanetary transfers for an unmanned return mission to an asteroid in real time, and built rocket engines, payload structures, and recovery systems.",
            "linkedin": "https://linkedin.com/in/ashi-dissanayake"
        },
        {
            "name": "Reza Fetanat, Founder",
            "description": "Co-founder & CTO @ Spaceium (S24).\nBelieve in developing in-space infrastructure to sustainably explore space and find a better place to call home, like the first caveman stepping out of their cave. Help humanity become a multiplanetary species.\nI led a rocket program at university. We successfully launched 3 rockets and became fastest growing team. \nFully developed 4 rocket engines and built a propulsion stability model. \nBuilt many robots including rocket tracker for recovery.",
            "linkedin": "https://linkedin.com/in/rezafetanat"
        }
    ],
    "status": true,
    "generated_description": "### Summary of Spaceium Inc\n\n**Company Overview**  \nSpaceium Inc, founded in 2023, is on an audacious mission: In-Space Refueling. Based in Long Beach, California, and part of Y Combinator's Batch S24, Spaceium has quickly carved out a niche in the aerospace sector, specifically in in-orbit fuel management.\n\n**What They Do**  \nSpaceium builds fully automated space stations designed to refuel and repair various types of spacecraft. This tech is a game-changer; their stations can efficiently store and transfer both cryogenic and non-cryogenic fuels with zero loss—talk about eliminating waste! The technology includes a proprietary modular robotic arm that seamlessly connects with any spacecraft design for fuel transfer.\n\nThe company isn’t just rolling with the concepts; they’ve made significant headway. They've secured **$86.1 million** in binding commercial contracts with an ambitious **$230 million** more waiting in the pipeline. Plus, there's an impressive **$1 billion** in letters of intent. Their hardware is set to launch into space next year, marking a critical milestone in their journey.\n\n**Target Audience**  \nSpaceium's customers range from launch vehicles and orbital transfer vehicles to moon landers. Each of these partners stands to gain from increased payload capacities and extended mission durations, all thanks to better fuel infrastructure.\n\n**Future Aspirations**  \nLong-term, Spaceium envisions a network of service hubs along what they call the \"space superhighway.\" This system would connect Earth to the Moon and Mars, aspiring to aid humanity’s quest to become a multi-planetary species.\n\n**Team and Support**  \nWith an enthusiastic team of **nan employees** and guidance from **Brad Flora** as their Group Partner, Spaceium taps into a rich vein of innovation and expertise in hard-tech, robotics, and space exploration.\n\n**Website**  \nFor more details, check out their official site: [Spaceium Inc.](https://spaceium.com).\n\n---\n\nIn essence, Spaceium is driving a revolution with in-orbit refueling, setting the stage for a new era of space exploration and interplanetary travel. If they succeed, they won’t just change how space missions are conducted—they might redefine what it means to be human in a vast, cosmic playground.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/0afcdd82fc56119b04498f8d8094fe15cb11dd10.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191939Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=d5e2e9791ee6e8d99d2dada4139efbe7a0eb73f57f3860115a01a92827262ce7",
    "social_links": [
        "https://www.linkedin.com/company/spaceium-inc"
    ],
    "logo_path": "data/logos\\Spaceium_Inc_logo.png"
}