{
    "links": "https://www.ycombinator.com/companies/spark",
    "name": "Spark",
    "headline": "AI-powered workflows for large-scale clean energy",
    "batch": "W24",
    "description": "Spark is an AI-powered planning and workflow tool for large-scale clean energy developers that lets them break ground faster. With Spark, developers can search across thousands of PDFs, maps, and websites to identify requirements and screen locations in seconds, not weeks.\r\n\nJulia and Tae were previously engineering and product managers at Brex, Tesla, and Apple. They grew up within 10 minutes of each other in Brazil but met in the US through a shared passion for software and infrastructure for society.",
    "activity_status": "Active",
    "website": "https://www.sparkhq.ai",
    "founded_date": 2023.0,
    "team_size": 2.0,
    "location": null,
    "group_partner": "Gustaf Alstromer",
    "group_partner_yc": "https://www.ycombinator.com/people/gustaf-alstromer",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:climate",
    "founders": [
        {
            "name": "Julia Wu, Founder",
            "description": "Julia is the co-founder and CEO of Spark, an AI-powered planning and workflow solution for large-scale clean energy developers.\nBefore Spark, Julia was an engineering manager and early engineer at Brex, where she led teams like Card Fraud, Growth, and Rewards. She was also an engineer at Apple Siri and Microsoft Azure. Julia studied computer science & economics at Brown, speaks 3 languages natively, and grew up between Brazil and China.",
            "linkedin": "https://linkedin.com/in/wu-julia"
        },
        {
            "name": "Tae Kim, Founder",
            "description": "Founder/CTO of Spark AI. Before that Tae was at Tesla (factory, warehousing software), Lucid Motors (payments), and Tinder (experiments for Gen Z). Tae lived in 4 countries, speaks 4 languages, and is passionate about pastry.",
            "linkedin": "https://linkedin.com/in/taehnkim"
        }
    ],
    "status": true,
    "generated_description": "**Spark: Accelerating Clean Energy Development with AI**\n\n**Overview:**\nFounded in 2023 and a part of Y Combinator Batch W24, Spark is a startup that's tactical about tackling climate challenges through technology. Their mission is clear: to create AI-powered workflows that help large-scale clean energy developers expedite their planning and execution processes significantly. This innovative approach transforms tedious data sifting—think thousands of PDFs, zoning maps, and various regulations—into a matter of seconds.\n\n**Founders:**\nJulia Wu and Tae Kim lead Spark, each bringing a wealth of experience from top-tier tech companies like Tesla, Apple, and Brex. Interestingly, they grew up close to each other in Brazil but connected in the U.S. through their shared vision for software that fuels social progress. Julia, formerly one of the youngest engineering managers at Brex, holds a degree from Brown University, while Tae, who developed crucial software for Tesla and Lucid Motors, graduated from Georgia Tech.\n\n**What Spark Does:**\nSpark’s platform enables energy developers to:\n- **Screen Sites Rapidly:** Identify zoning regulations and permitting processes for potential project sites in seconds.\n- **Automate Workflows:** Streamline repetitive tasks such as data extraction, due diligence, and document preparation.\n- **Analyze Sentiment and Regulations:** Leverage real-time data regarding community sentiment and local regulations to make informed decisions quickly.\n\n**Key Features:**\n- **Instant Research:** Easy exploration of zoning ordinances and project sentiment.\n- **Document Diligence:** Utilize AI to retrieve critical information from complex documents without the hassle of excessive manual searches.\n- **Comprehensive Requirements Handling:** Extract necessary permitting pathways seamlessly.\n\n**Recognition:**\nSpark has garnered attention from significant players in the clean energy sector, with a growing roster of trusted partners that includes Dynamic Energy and Stellera. Not to forget, they've already secured credibility through important accreditations—like being SOC 2 certified.\n\n**Join the Movement:**\nIf you're looking to optimize your clean energy development efforts, Spark is poised to be an invaluable partner. They invite you to experience their platform firsthand through demonstrations and consultations, fostering a collaborative approach to sustainable energy solutions.\n\nVisit [Spark's website](https://www.sparkhq.ai) to learn more and get in touch. Transforming energy workflows isn’t just a tagline; it’s the reality Spark is crafting for the future of clean energy.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/a8b2ced99cc523e79882b6b72553fa72464b7f7c.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191940Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=971935d9a314e776edd6107e299aa542443d616aba17b446b6ee38304be8ffc8",
    "social_links": [
        "https://www.linkedin.com/company/sparkhqai/"
    ],
    "logo_path": "data/logos\\Spark_logo.png"
}