{
    "links": "https://www.ycombinator.com/companies/spark-studio",
    "name": "Spark Studio",
    "headline": "The most magical personal Voice-Led AI English Learning Buddy for Kids",
    "batch": "S21",
    "description": "Meet Sparky, a fun and quirky AI buddy in the avatar of a friendly fox who kids can just speak with to build fluency and confidence with English speaking. \r\nPowered by Generative AI, and made magical with child-appropriate experience, features and topics, Sparky brings a whole world of knowledge and a judgement-free environment for kids to become comfortable with speaking English. \r\n\n142 countries (outside English dominant countries) mandate English learning as part of the national education policy. These kids have exposure to English but feel underconfident and embarrassed to speak. The biggest problem across the classes and books they get, is the lack of real conversational practice. With AI, we're making this affordable accessible and enjoyable for kids across the world. \r\n\nWe're a passionate team of educators with over 30 years of combined experience in building education products for kids and have held leadership positions are India's biggest education companies - Byju's and LEAD.",
    "activity_status": "Active",
    "website": "https://sparkstudio.co",
    "founded_date": 2021.0,
    "team_size": 27.0,
    "location": "Bengaluru, India",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:ai-enhanced-learning; industry:education; industry:generative-ai; industry:elearning; industry:ai",
    "founders": [
        {
            "name": "Anushree Goenka, Founder",
            "description": "CoFounder and CEO, Spark Studio.\n10 years of experience across business leadership roles at early stage and unicorn stage consumer tech start-ups in India (Swiggy, Scroll) and business consulting (Monitor Group)\nMBA from IIM-Ahmedabad. B. Tech in Comp. Sc from DAIICT.",
            "linkedin": "https://www.linkedin.com/in/anushreegoenka/"
        },
        {
            "name": "Namita Goel, Founder",
            "description": "I have 12+ yrs of work experience, with a decade of it in education and ed-tech. I was among the founding team members of LEAD Schools, and has been leading their curriculum and academic strategy for the last 4 years. I have worked on 0-1 products catering to K-10 at organisations such as LEAD School, Uplift Education, Teach For India. I have deep experience in curriculum design, utilizing and guiding tech to deliver learning outcomes, teacher training and thinking of quality at scale.",
            "linkedin": "https://www.linkedin.com/in/namita-goel-33918b5/"
        },
        {
            "name": "Kaustubh Khade, Founder",
            "description": "Co-Founder | CPO.\n2x TedX Speaker.\n2 Silver & 1 Bronze medal for India at the Asians.\nKayaked the West Coast of India solo.\nIIT Delhi Computer Science.\nex-AVP Product, BYJU'S",
            "linkedin": "https://www.linkedin.com/in/kaustubhkhade/"
        },
        {
            "name": "Jyothika Sahajanandan, Founder",
            "description": "I'm a software engineer with 10 years of experience building products at companies like Zynga, Housing and BYJU'S. I have a Master's degree in Computer Science from IISc, Bangalore.",
            "linkedin": "https://www.linkedin.com/in/jyothikas/"
        }
    ],
    "status": true,
    "generated_description": "**Spark Studio: Your Child’s Magical AI English Buddy**\n\nFounded in 2021 and located in Bengaluru, India, Spark Studio is carving out a fun and innovative space in the world of online education for kids. At its core, the mission is simple yet profound: to provide kids with the most magical, personal Voice-Led AI English Learning Buddy. Initially introduced as \"Meet Sparky,\" a friendly fox avatar, the platform helps children build fluency and confidence in speaking English, all in a judgment-free environment.\n\nWith over 30 years of combined experience in creating educational products at leading companies like Byju's and LEAD, Spark Studio’s founders recognize a pivotal issue in English language learning—especially in non-English dominant countries. Despite policies mandating English education in 142 countries, many kids grapple with low confidence, lacking real conversational practice. Here’s where Spark Studio steps in, making the process not only affordable but also enjoyable through AI.\n\nThe team, consisting of 27 passionate educators, emphasizes the need for interactive learning. They’ve tailored a curriculum that promotes personal attention through small class sizes, engaging activities, and diverse course offerings, including Art, Music, Public Speaking, and Animation among others. \n\nEach course is designed to foster creativity, communication skills, and confidence—a recipe for children to express themselves freely. Imagine your child learning to speak English by creating digital animations or participating in a storytelling class—it’s learning through creativity.\n\nWhat makes Spark Studio stand out is its expert faculty composed of movers and shakers in their respective fields—from a professional vocalist recognized at the Indies to a storytelling expert with years of teaching experience. This ensures that your child learns from the best, receiving personalized feedback and certificates upon course completion.\n\nTheir approach isn't just about language; it’s about nurturing well-rounded, confident, and creative individuals. Programs encourage interaction among kids, enabling them to form friendships while learning crucial skills. This isn’t just education; it's an experience that kids look forward to.\n\nWant to start the journey? You can book a free trial and dive into a world where learning English becomes an adventure. More than 10,000 parents vouch for Spark Studio, describing the transformative impact it has had on their children's confidence and communication skills.\n\nIn summary, Spark Studio is not just about learning English; it's about fostering confidence, encouraging creativity, and providing kids with an engaging learning experience that will last a lifetime. So if you're looking for a unique educational experience for your child, Spark Studio might just be the magical place you need. \n\nFor more information, visit [Spark Studio’s website](https://sparkstudio.co).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/e441d50c6ec4eb48ce67f58fb4da5c5e6dc8b71e.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191940Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=2bf6d9539887fb208f4d5c4cb27f88e20fe2c64bed629d317d9314ad7fd97fe4",
    "social_links": [
        "https://in.linkedin.com/company/spark-studio-co",
        "https://twitter.com/sparkstudio_co",
        "https://www.facebook.com/TeamSparkStudio"
    ],
    "logo_path": "data/logos\\Spark_Studio_logo.png"
}