{
    "links": "https://www.ycombinator.com/companies/speccheck",
    "name": "SpecCheck",
    "headline": "Unifying how the optical industry does business.",
    "batch": "W23",
    "description": "SpecCheck is an all-in-one solution that provides accurate prescription eyewear ordering and tracking, seamless billing, and streamlined communication between patients, eye doctors, and their lab partners. SpecCheck’s users work more efficiently and make fewer costly errors, increasing productivity and improving their overall workflow.",
    "activity_status": "Active",
    "website": "https://www.speccheckrx.com/",
    "founded_date": 2022.0,
    "team_size": 5.0,
    "location": "Los Angeles, CA",
    "group_partner": "Diana Hu",
    "group_partner_yc": "https://www.ycombinator.com/people/diana-hu",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:saas; industry:payments; industry:health-tech; industry:b2b; industry:api; location:los-angeles",
    "founders": [
        {
            "name": "Joe DeMaria, Founder",
            "description": "Joe is the co-founder and CEO of SpecCheck. Beginning his career as an optician, Joe has worked on all sides of the optical industry and most recently managed top territories for Johnson and Johnson Vision. Joe’s ultimate vision (pun intended) is to create a piece of technology which unifies the patient, doctor, and third party vendors in a single elegant solution. When he’s not busy with SpecCheck, you can find Joe cooking in the kitchen, sailing, or playing video games.",
            "linkedin": "https://www.linkedin.com/in/joe-demaria-15a15943/"
        },
        {
            "name": "Arnold Villatoro, Founder",
            "description": "Arnold is the co-founder and CTO of SpecCheck. Arnold has been a software engineer for almost a decade, starting his career at Workday. Most recently, he lead the payments team at Lyft. Outside of work and tech, Arnold enjoys working out, is a big foodie, has a cat named Peanut, and loves Super Smash Brothers. Fun fact: Arnold was born in Honduras!",
            "linkedin": "https://www.linkedin.com/in/arnold-villatoro-85629330"
        }
    ],
    "status": true,
    "generated_description": "### SpecCheck: Revolutionizing the Optical Industry\n\n**Mission:**  \nSpecCheck is on a mission to unify how the optical industry operates. Founded in 2022 and part of Y Combinator's W23 batch, this innovative company is based in Los Angeles, CA.\n\n**What They Do:**  \nSpecCheck is essentially the Swiss Army knife for optical professionals. It equips users with a comprehensive platform that facilitates accurate prescription eyewear ordering and tracking, seamless billing processes, and streamlined communication among patients, eye doctors, and lab partners. By enhancing efficiency and reducing costly errors, SpecCheck aims to boost productivity and improve workflow across the board.\n\n**Key Features:**  \n- **Order Management:** Users can view all Rx orders and their statuses in one place.\n- **Dynamic Order Entry:** Designed for both seasoned and novice opticians, it features built-in validations that minimize errors.\n- **Secure Online Payments:** Offers an easy billing portal that ensures payment data security with advanced encryption.\n- **Rewards Program:** Users can earn Amazon gift cards simply by submitting orders through the platform.\n- **Real-Time Support:** Integrated live chat for immediate assistance and troubleshooting.\n\n**Target Audience:**  \nThe primary users include eye care professionals, optical labs, and enterprises looking for tailored solutions. The platform is designed to work across various devices, making it accessible and user-friendly.\n\n**Team and Support:**  \nWith a small team of five, including Group Partner Diana Hu, SpecCheck is agile and focused. They offer robust customer service and numerous resources, including support articles and video walkthroughs to help users maximize their experience.\n\n**Why It Matters:**  \nIn an industry where precision is paramount, SpecCheck is changing the game by making the ordering and management processes simpler and more efficient. The goal is to make the optical business not just easier, but also more collaborative and transparent.\n\n**Curious to Learn More?**  \nVisit [SpecCheck's website](https://www.speccheckrx.com) to explore their offerings and see how they can transform your optical practice.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/d603691f09af4adf528776a32b42b4f2f5d194d0.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191940Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=5043da55f133071b63e5a5addd9d555222faf0183385d97597cdae3fd5200bb3",
    "social_links": [
        "https://www.linkedin.com/company/speccheck/",
        "https://twitter.com/SpecCheckRx"
    ],
    "logo_path": "data/logos\\SpecCheck_logo.png"
}