{
    "links": "https://www.ycombinator.com/companies/spect",
    "name": "Spect",
    "headline": "Value-based retinal screening in primary care to prevent blindness.",
    "batch": "S17",
    "description": "Vision Disease cause innumerable cases of preventable blindness globally - 415 million diabetic patients worldwide are susceptible to Diabetic Retinopathy (DR), Glaucoma, and more. Current screening protocols for vision disease require ophthalmologists to manually diagnose patients through visual assessment of the fundus. Given the large number of diabetes patients in various communities, this process is expensive, inefficient, and an undue burden on eye clinics.",
    "activity_status": "Active",
    "website": "http://www.getspect.com",
    "founded_date": 2017.0,
    "team_size": 7.0,
    "location": "Palo Alto",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:digital-health; industry:ai; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Ankur Gupta, Founder/CEO",
            "description": "After undergrad and a Master's at Stanford University, where I completed the Biodesign program, I started my career in healthcare venture capital. Afterward, I went to medical school at UT Southwestern in Texas and did my residency training in Ophthalmology at the National Eye Institute (NIH), University of Chicago, Geisinger, and Stanford Medicine. I’ve mentored several and started three companies, including Spect.",
            "linkedin": "https://www.linkedin.com/in/regenmd"
        }
    ],
    "status": true,
    "generated_description": "**Company Overview: Spect**\n\n**Founded:** 2017  \n**Location:** Palo Alto, California  \n**Team Size:** 7 employees  \n**Batch:** Y Combinator S17  \n**Website:** [getspect.com](http://www.getspect.com)  \n\n**Mission:** Intend to prevent blindness through value-based retinal screening in primary care settings.\n\n### The Problem\nVision diseases cause immeasurable suffering. Globally, 415 million people with diabetes are at risk of conditions like Diabetic Retinopathy (DR) and Glaucoma. Currently, screening for these conditions relies heavily on ophthalmologists, making the process inefficient and costly, especially as the number of patients rises. \n\n### The Solution\nSpect offers a solution that transforms retinal exams into a streamlined, efficient process without needing specialized training for staff. Their portable retinal camera allows screenings for diseases right in the primary care setting—after just 15 minutes of training, existing medical staff can conduct exams with a 95% success rate.\n\n**Efficiency:**\n- **Quick Exam Duration:** Retinal exams can be conducted in under 3 minutes.\n- **Rapid Reporting:** Results are processed and reported back to healthcare providers within 24 hours.\n- **High Gradability:** Over 95% of the images captured are gradable on the first attempt.\n\n**Why it Matters:** Early detection can prevent up to 90% of diabetes-related blindness, and currently, fewer than 40% of diabetes patients receive the recommended annual eye exams. Spect directly addresses this gap by making eye care accessible and integrating seamlessly into existing healthcare workflows.\n\n### Current Partnerships\nSpect collaborates with various healthcare providers, including:\n- Accountable Care Organizations (ACOs)\n- Community Health Centers\n- Independent Physician Associations (IPAs)\n- Health Systems and more\n\nNotable partners include **DocGo**, which has leveraged Spect's technology to increase diabetic retinal screenings significantly, and **Maryland Community Health System**, where Spect's solutions have enhanced the implementation of diabetic eye examinations.\n\n### Recent Highlights\n- In 2024, Spect partnered with DocGo to address care gaps and enhance eye and vision health.\n- Featured in the UCSF Healthhub Digital Health Awards for innovative solutions.\n\n### Conclusion\nSpect isn’t just another health tech company; it’s a response to a critical healthcare challenge. With a value-driven approach to retinal screening, Spect’s mission to prevent blindness is not only admirable but also achievable with their cutting-edge solutions. The combination of technology, ease of use, and rigorous focus on data privacy positions them for significant impact in healthcare. If you're interested in adopting their solutions, there’s no better time than now.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/d98249149422f07bd7c5922de17fab34a650ccd5.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191940Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=5359b82eae71bcd30716c5a0848932a49bc73378d7f4ddc2fc9fc4c82a05013f",
    "social_links": [
        "https://www.crunchbase.com/organization/spect"
    ],
    "logo_path": "data/logos\\Spect_logo.png"
}