{
    "links": "https://www.ycombinator.com/companies/spenny",
    "name": "Spenny",
    "headline": "Acorns for India. Every time you swipe you make a digitalâ\u0080¦",
    "batch": "W20",
    "description": "Spenny is the Acorns for India. Every time a user make any digital transaction, we round off the amount to the nearest 10 INR and invest it for them into a diversified portfolio, automatically.\r\n\n400M millennials in India don't invest because they don't have enough time, knowledge or access to large capital. With Spenny, they just connect the card and invest every time they spend.\r\n\nWe're growing 67% WoW since launch, with 3,000+ users and $15,000 in AUM. Indians put $500Bn into their bank accounts annually. We chargeÂ 1.75%Â of the AUM for investments. That's a direct ~$9Bn market in India alone.\r\n\nPotentially every time a user makes a transaction, we make money. And in that sense, the timing for Spenny couldn't have been better: 1 Trillion+ transactions are expected in 2021 because of factors like Whatsapp launching its P2P payments in India for its 400M users. And the emergence of UPI means every Indian has a virtual bank account now. \r\n\nMore interesting revenue models develop from the transaction data insights of our users. We analyse the rich data to A) up-sell more financial products like insurance etc., and B) create brand loyalty programs & partnerships.\r\n\nWe acquire customers at minimal CAC by bank partnerships. We leverage the banks' existing users, by integrating with their mobile app. In turn, we invest into their mutual funds.\r\n\nOur long-term vision is to become a one-stop asset management solution for millennials.",
    "activity_status": "Active",
    "website": "http://spennyapp.com",
    "founded_date": null,
    "team_size": 2.0,
    "location": "Bengaluru, India",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:india; industry:investing",
    "founders": [
        {
            "name": "Rathin Shah, Founder",
            "description": "Founder & CEO, Spenny",
            "linkedin": "http://www.linkedin.com/in/rathinshah/"
        },
        {
            "name": "Gaurav Arora, Founder",
            "description": null,
            "linkedin": "https://linkedin.com/in/whogaurav"
        }
    ],
    "status": true,
    "generated_description": "**Spenny: The Acorns for India**\n\nSpenny is redefining how millennials in India approach investing. Founded in Y Combinator's Winter 2020 batch, Spenny’s mission—dubbed \"Acorns for India\"—is simple yet powerful: every time you make a digital transaction, Spenny rounds up your expenditure to the nearest 10 INR and automatically invests that spare change into a diversified portfolio. \n\nThis automated investment model targets the staggering 400 million Indian millennials who typically shy away from investing, citing reasons like lack of time, knowledge, and capital. With Spenny, all you need to do is connect your card, and every swipe could potentially grow your wealth.\n\nSince launching, Spenny has been making impressive strides, achieving a growth rate of 67% week-over-week, amassing over 3,000 users and $15,000 in assets under management (AUM). The opportunity is massive—Indians collectively deposit $500 billion into their bank accounts every year, and Spenny capitalizes on this with a modest fee of 1.75% of AUM, translating to an estimated $9 billion market niche within India.\n\nThe timing for Spenny is also fortuitous, with over 1 trillion expected transactions in 2021 alone. Factors such as WhatsApp's introduction of P2P payments and the widespread adoption of UPI have effectively furnished every Indian with access to a virtual bank account, creating fertile ground for Spenny's operations.\n\nMoreover, Spenny's revenue model isn't solely reliant on transaction fees. The company leverages user transaction data to broaden their offerings, potentially upselling financial products like insurance and forging partnerships for brand loyalty programs. This dual revenue stream not only enhances customer engagement but also broadens the financial ecosystem Spenny operates within.\n\nCustomer acquisition is streamlined through strategic partnerships with banks, effectively tapping into their existing user bases by integrating Spenny's services into their mobile apps, while simultaneously investing capital into their mutual funds.\n\nLooking ahead, Spenny aims to evolve into a comprehensive asset management solution tailored for millennials, providing all the financial tools they need at their fingertips.\n\nWith a nimble team of just two based in Bengaluru, Spenny is on an exhilarating journey. To learn more about Spenny and explore the investment journey that awaits, visit [Spenny's website](http://spennyapp.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/52d0ca52acfd8d17e7b2fde94a279a2c3c94ae0e.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191940Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=3a810ea4f9e451c6b87cfd6150a23dbb9d94bdb18294bcac3f55c7b6e4dbcac8",
    "social_links": [
        "https://www.linkedin.com/company/spenny/"
    ],
    "logo_path": "data/logos\\Spenny_logo.png"
}