{
    "links": "https://www.ycombinator.com/companies/sphere",
    "name": "Sphere",
    "headline": "AI-powered sales tax, VAT and GST compliance",
    "batch": "W22",
    "description": "Sphere helps US software companies manage their global sales tax / VAT / GST compliance requirements.\r\n\nOur platform helps with everything from nexus monitoring, registration, calculation and filing/remittance.\r\n\nCompanies like Runway AI choose our platform because we’re the only product that offers true global coverage, is easy to implement and reasonably priced.\r\n\n- We're growing rapidly (20%+ MoM revenue growth) and have signed customers like Runway AI, Sierra AI, Codeium + many more\r\n- We're building the world's first tax-focused LLMs (which we believe will be the foundation for a broader cross border compliance platform; think Deel for international billing)\r\n- We're well funded by Felicis Ventures and the founders of Flexport, Lyft, Betterup, Go1 and Xendit",
    "activity_status": "Active",
    "website": "https://www.getsphere.com/",
    "founded_date": 2021.0,
    "team_size": 7.0,
    "location": "San Francisco",
    "group_partner": "Aaron Epstein",
    "group_partner_yc": "https://www.ycombinator.com/people/aaron-epstein",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:finance; industry:b2b; industry:ai; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Nicholas Rudder, Founder",
            "description": "I'm the Co-Founder and CEO of Sphere, living in SF but originally hailing from the sunny shores of Sydney, Australia. My background is in both tech and finance.",
            "linkedin": "https://www.linkedin.com/in/nicholasrudder/"
        }
    ],
    "status": true,
    "generated_description": "**Sphere: Redefining Global Sales Tax Compliance**\n\nFounded in 2021 and based in San Francisco, Sphere is a nimble player in the fintech arena, laser-focused on making international sales tax compliance a breeze. They’re all about using AI technology to tackle the complexities of tax regulations, whether it’s sales tax in the U.S. or VAT and GST abroad. \n\nAt its core, Sphere’s mission is straightforward yet critical: simplify compliance for global software companies. Initially targeting U.S. software firms, Sphere has built a robust platform that offers everything from monitoring nexus points to registration, calculation, filing, and remittance. This is especially vital for companies like Runway AI, who value Sphere's unique global coverage and the ease of integration into existing systems.\n\nGrowth is the name of the game for Sphere, boasting an impressive 20% month-over-month revenue growth. With a customer roster that includes notable names such as Sierra AI and Codeium, they are positioned for even greater expansion. Sphere is diving into ambitious territory, developing the world’s first tax-focused language models (LLMs) to bolster their cross-border compliance offerings. Think of it as Deel, but tailored for international billing.\n\nBacked by heavyweights like Felicis Ventures and founders from companies like Lyft and Flexport, Sphere is well-resourced for its ambition. The team, although small with just seven employees, is dynamic and agile, a configuration that allows for rapid iteration and adaptation in a fast-evolving market.\n\nTheir platform is designed for swift implementation, enabling finance teams to scale operations internationally with minimal friction. Sphere integrates seamlessly with billing solutions, so compliance becomes an autopilot function rather than a constant worry.\n\nIf you’re in the SaaS space but feeling bogged down by tax complexities, Sphere could very well be your ally in the ever-changing landscape of global tax regulations. They’re not just solving a problem; they’re innovating how companies manage tax compliance across borders. \n\nTo learn more about Sphere and what they can do for your business, swing by their website: [Sphere](https://www.getsphere.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/b34f94dca22848e58cb3c6bfca1ebaabf173c5e2.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191942Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=bf35d8cc5cafebe853f0123ee251a61d09d4b725d7c1950ba9b57841e3047778",
    "social_links": [
        "https://www.linkedin.com/school/getsphere/",
        "https://twitter.com/get_sphere"
    ],
    "logo_path": "data/logos\\Sphere_logo.png"
}