{
    "Links": "https://www.ycombinator.com/companies/splash-inc",
    "Name": "Splash Inc.",
    "Headline": "Self-driving patrol boats for National Security",
    "Batch": "W25",
    "Description": "Splash is developing the next generation of autonomous surface vessels (ASVs) to provide National Security and defend critical assets such as oil rigs and shipping terminals. Our long-term vision is to make traditional naval vessels obsolete by creating a fleet of low-cost and versatile boats which will be able to dominate the seas. Our expertise in mass manufacturing, engineering and quickly scaling operations will make this vision a reality.",
    "Activity_Status": "Active",
    "Website": "https://splash9.com/",
    "Founded_Date": "2024",
    "Team_Size": "2",
    "Location": "Los Angeles, CA",
    "Group_Partner_YC": "https://www.ycombinator.com/people/aaron-epstein",
    "Group_Partner": "Aaron Epstein",
    "Company_Linkedin": "https://www.linkedin.com/company/105801839/admin/feed/following/",
    "Company_Twitter": "",
    "Tags": "industry:artificial-intelligence; industry:autonomous-delivery; industry:drones; industry:govtech; industry:automation; location:los-angeles",
    "social_links": [
        "https://www.linkedin.com/company/105801839/admin/feed/following/"
    ],
    "logo_path": "data\\logos\\Splash_Inc..png",
    "Active_Founders": [
        {
            "Name": "Ivan Avanesov, Founder",
            "Description": "Co-Founded Splash with the mission of building the Navy of the future after working on marine robotics research projects for the past 8 years. Previously founded Vosentech and grew it to become the largest supplier of mini smoke machines in the world. Designed, manufactured and sold 10,000+ generators to companies such as SpaceX and Apple as well as to many military customers and agencies such as NASA and Los Alamos to check airflow movements in complicated systems.",
            "LinkedIn": "https://www.linkedin.com/in/ivan-avanesov-2b511515a/"
        },
        {
            "Name": "Marcell Veszpremi, Founder",
            "Description": "Co-Founded Splash Inc. with the mission of building the Navy of the future, leveraging 6+ years in robotics, embedded systems, and IoT. At UCLA’s RoMeLa, I worked on Artemis—the award-winning humanoid champion of RoboCup 2024. Previously at Verkada, I engineered embedded software and battery management for enterprise security alarms. My work at the Ozcan Research Lab, highlighted in multiple publications, has driven breakthroughs in low-cost, point-of-care medical devices.",
            "LinkedIn": "https://www.linkedin.com/in/veszpremimarcell/"
        }
    ],
    "crawl_status": true,
    "generated_description": "**Company Name:** Splash Inc.  \n**Founded:** 2024  \n**Location:** Los Angeles, CA  \n**Team Size:** 2 employees  \n**Y Combinator Batch:** W25  \n**Website:** [splash9.com](https://splash9.com/)  \n\n**Mission:**  \nSplash Inc. is on a mission to revolutionize national security with self-driving patrol boats designed to defend critical assets like oil rigs and shipping terminals. Their long-term vision aims to make traditional naval vessels obsolete by deploying a fleet of cost-effective and versatile autonomous surface vessels (ASVs) that can dominate maritime activities.\n\n**Core Technologies and Innovations:**  \n- **Maritime Autonomy:** Leading the charge in unmanned patrol boats.\n- **State-of-the-Art Sensors:** Capable of executing missions autonomously, even in communication-denied areas.\n- **High Performance:** ASVs achieve speeds of up to 50 knots and boast an impressive operational range of 800 miles.\n- **Multi-Mission Capability:** Designed for a variety of roles including coastal defense, seabed mapping, harbor patrols, and more.\n- **Scalable Production:** Utilizing expertise in mass manufacturing to produce boats at scale without excessive costs.\n\n**Key Features of ASVs:**\n- **Coastal Patrol:** Effective for securing maritime borders and monitoring activity over vast areas.\n- **Infrastructure Security:** Autonomous enforcement of secure zones around critical infrastructure.\n- **Naval Operations:** Decision-making capabilities that allow complex operations without real-time human input.\n- **Commercial Flexibility:** Easily adapted for diverse tasks such as surveys and deliveries.\n\n**Backed By:**  \nSplash Inc. is supported by notable partners and investors reflecting confidence in their innovative approach to maritime security.\n\n**Tags:**  \nThe company is associated with key industries, including artificial intelligence, autonomous delivery, drones, and government technology.\n\n**Final Thoughts:**  \nSplash Inc. is not just about building boats; it's about redefining how we think about maritime security in an era dominated by automation and technology. With a clear focus on the future and a manageable team, they are poised to make waves—quite literally—in the defense sector."
}