{
    "links": "https://www.ycombinator.com/companies/splendor",
    "name": "Splendor",
    "headline": "Splendor helps nonprofits find and win grants.",
    "batch": "W22",
    "description": "Powered by thousands of successful proposals, Splendor's AI platform helps nonprofits write winning grant narratives and find the best funders. Our proposals capture every funder priority and maximize success rates.",
    "activity_status": "Active",
    "website": "https://trysplendor.com",
    "founded_date": 2024.0,
    "team_size": 1.0,
    "location": "Cambridge, MA",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:nonprofit; industry:b2b; industry:productivity",
    "founders": [
        {
            "name": "Tiwa Aina, Founder",
            "description": "Tiwa studied math, computer science, and molecular biology at MIT. He has used his statistical learning theory, AI, and biology experience at MIT CSAIL, the Broad Institute, and Dyno Therapeutics. He also did software engineering at Stripe.\n\nPreviously, he was into finance & fintech: he interned at Morgan Stanley's automated options market making desk and holds Series 7, 63, and 24 licenses. Before that, he was into astrophysics and discovered a variable star the summer before starting college.",
            "linkedin": "https://www.linkedin.com/in/tiwaaina/"
        }
    ],
    "status": true,
    "generated_description": "### Meet Splendor: Transforming Nonprofit Grant Applications\n\n**Overview**: Founded in 2024 and hailing from Cambridge, MA, Splendor is a single-member startup that has big ambitions: to revolutionize how nonprofits secure funding through grants. They started as a company dedicated to helping nonprofits craft successful grant narratives using an AI-powered platform. This technology assists organizations in precisely tailoring their proposals to meet funder priorities, fundamentally optimizing their chances of success.\n\n**Mission**: Splendor’s mission is straightforward and impactful: they help nonprofits find and win grants. By leveraging AI, they streamline the often-tedious writing and submission process, turning grant applications from a daunting chore into a more manageable task.\n\n**Key Features**:\n- **AI-Powered Proposals**: Splendor analyzes countless successful proposals to guide nonprofits in writing their narratives, effectively maximizing success rates.\n- **Integration and Customization**: The platform easily integrates into existing systems, requiring minimal setup. It adapts to various verification forms and manages complex insurance details.\n- **Efficiency Boost**: By automating the time-consuming tasks of verification and eligibility checks, Splendor empowers administrative staff to focus on higher-value patient interactions and care.\n- **Cost Savings**: Practices using Splendor can save over $20,000 annually, which is a significant boost for resources often stretched thin.\n\n**Current Endeavors**: Splendor isn’t just targeting nonprofits; they’ve recently expanded into the medical field with Splendor Dental and Splendor Psych. This expansion aims to alleviate the insurance verification hassle that many healthcare practices face.\n\n**Target Audience**: Primarily catering to the nonprofit sector, Splendor is also reaching out to institutions and practices dealing with healthcare billing and insurance, making it a versatile player in the productivity space.\n\n**Partnerships**: The company is associated with Y Combinator's Batch W22, linking them to an extensive network of resources and mentorship.\n\n**Conclusion**: In a world where grants can mean the difference between thriving and merely surviving for nonprofits, Splendor is positioned as a game-changer. By simplifying the grant application process, they’re not just saving time and reducing frustration—they're empowering organizations to pursue their missions with renewed vigor. Whether you're in the nonprofit sector or face the challenges of healthcare insurance verification, Splendor is worth a look.\n\nFor more information, visit their website at [trysplendor.com](https://trysplendor.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/1b2be0e90eacc4543a7e0f40cc9cca8d63c68f21.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191942Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=370b891c609e1727e1c5e075bd1180efa2449a41c392c3c672a61908bab84ac5",
    "social_links": [],
    "logo_path": "data/logos\\Splendor_logo.png"
}