{
    "links": "https://www.ycombinator.com/companies/spokn",
    "name": "Spokn",
    "headline": "Easy employee video-maker for People teams",
    "batch": "W21",
    "description": "Spokn makes it easy for People and Comms teams to make videos starring their own employees and leaders - no editing skills or special equipment necessary.  In minutes, you can create videos that feel as engaging as TikTok, and share them anywhere: Slack/Teams, your LMS, intranet, careers page, or job offer emails.  \r\n\nCompanies like Udemy, SiriusXM, Sonos, GoFundMe and more use Spokn to create engaging videos for their learning & development, internal comms, recognition, DEI and employer branding.",
    "activity_status": "Active",
    "website": "https://getspokn.com/",
    "founded_date": 2020.0,
    "team_size": 20.0,
    "location": "New York",
    "group_partner": "Gustaf Alstromer",
    "group_partner_yc": "https://www.ycombinator.com/people/gustaf-alstromer",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:elearning; industry:b2b; industry:culture; location:new-york",
    "founders": [],
    "status": true,
    "generated_description": "**Spokn: Your Go-To Solution for Employee Video Creation**\n\nFounded in 2020 and based in New York, Spokn makes it astonishingly simple for People and Communications teams to produce shareable, engaging videos featuring their own employees and leaders. Essentially, if you’ve ever wanted to create impactful content without the hassle of video editing skills or fancy equipment, Spokn is your answer.\n\nThink about it: in just minutes, you can whip up videos that capture attention like TikTok clips. Companies like Udemy, SiriusXM, Sonos, and GoFundMe are already leveraging Spokn to enhance their internal communications, talent acquisition, employee recognition, and even DEI (Diversity, Equity, and Inclusion) initiatives.\n\n### Mission\nSpokn's mission is clear: Empower HR and communication teams to create authentic video content with ease.\n\n### Key Features\n1. **User-Friendly Video Creation**: The tool allows anyone to easily collect, record, and share videos. You can gather content from employees or leaders no matter where they are, using either desktop or mobile.\n   \n2. **Effortless Editing**: No editing experience? No problem. Spokn includes intuitive tools to stitch clips together, remove mistakes with its “Magic Editor,” and add branding without needing design skills.\n\n3. **AI Enhancements**: Automatically refine your videos with AI features that improve lighting, generate captions, and even translate those captions into multiple languages.\n\n4. **Versatile Sharing Options**: Whether it’s directly in your LMS, through email, or on platforms like Slack and Teams, Spokn ensures your videos reach your audience wherever they are.\n\n### Why Spokn?\nWith only a small team of 20 employees, Spokn has quickly become vital for internal communications teams, helping organizations to boost employee engagement and cultivate a strong company culture. It packages everything you need into one solution, making video content creation less of a chore and more of an engaging experience for both creators and viewers.\n\nAnd if you’re wondering about credibility, Spokn is loved by notable organizations—enabling them to amplify diverse voices, recognize employee achievements, and humanize their employer brand, all while becoming more efficient.\n\nIn essence, Spokn is not just about making videos; it’s about transforming how organizations communicate internally and celebrate their people. Check it out at [getspokn.com](https://getspokn.com) to see how it can make your internal communications shine.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/2917fcac665204bc006aa7f72ac2c6b3720a25b5.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191943Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=0970a30e8b6bccb42632ce8f1d5fb70944149c74ed6d2601c882273bfb721e5c",
    "social_links": [
        "https://www.linkedin.com/company/getspokn",
        "https://twitter.com/getSpokn",
        "https://www.crunchbase.com/organization/spokn"
    ],
    "logo_path": "data/logos\\Spokn_logo.png"
}