{
    "links": "https://www.ycombinator.com/companies/spotless-materials",
    "name": "spotLESS Materials",
    "headline": "Repellent coatings without PFAS",
    "batch": "S19",
    "description": "Surface fouling is a costly challenge across industries, impacting medical consumables, diagnostic devices, and automotive components. Contamination from substances like mud, ice, and sludge can compromise performance and lead to frequent cleaning, repairs, and replacements.\r\n\nOur PFAS-free coating, which we first launched as a consumer product, has quickly expanded into industrial partnerships. It dramatically reduces contamination on critical surfaces such as glass, metal, ceramic, and now plastics too. Whether for medical devices or automotive components, our coating protects against surface fouling\r\nCurrently our coatings work best on glass, metal, and ceramic surfaces.",
    "activity_status": "Active",
    "website": "https://www.industry.spotlessmaterials.com",
    "founded_date": 2018.0,
    "team_size": 6.0,
    "location": "State College, PA",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:hard-tech; industry:nanotechnology; industry:advanced-materials",
    "founders": [],
    "status": true,
    "generated_description": "**Company Summary: spotLESS Materials**\n\nFounded in 2018 and part of Y Combinator Batch S19, spotLESS Materials is a pioneering company located in State College, PA, with a small but agile team of six employees. Their mission? To provide repellent coatings that are free from per- and polyfluoroalkyl substances (PFAS), a harmful category of chemicals often associated with environmental and health concerns.\n\nThe problem they're tackling is significant: surface fouling. Across various industries—think medical, automotive, and beyond—substances like mud, ice, and sludge can severely hamper the performance of crucial components, leading to costly cleaning and replacements. Recognizing this challenge, spotLESS has developed an advanced nanotechnology coating, initially launched as a consumer product, which rapidly found traction in industrial applications.\n\nWhat sets spotLESS apart is their innovative \"liquid-entrenched smooth surface\" (LESS) technology. They're drawing inspiration from nature—observing the properties of plants and insects—to craft a state-of-the-art, bio-inspired, liquid- and sludge-repellent surface that works wonders on glass, metal, ceramic, and now even plastics. This coating can reduce sludge by up to 90% and mineral deposits by 96% compared to untreated surfaces, while also minimizing the amount of water needed for cleaning.\n\nTheir key markets include medical devices (ensuring patient safety and device efficacy), automotive components (enhancing performance under challenging conditions), and sanitation (providing durable, easy-to-clean surfaces). They offer tailored solutions for different industrial needs and emphasize collaboration with clients to understand their specific fouling issues.\n\nSpotLESS Materials operates under several appealing tags in the startup ecosystem: hard-tech, nanotechnology, and advanced materials—hallmarks of innovation driving modern industry challenges.\n\nTo learn more or to explore potential collaborations, you can check out their website at [spotLESS Materials](https://www.industry.spotlessmaterials.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/1631fab19e0b5af8f4c95843c35ec4435187bbd8.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191943Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=27bc4444290ea7098d564a442d8f51687c593d61036d8ec2d926ca6e14fbe0dd",
    "social_links": [
        "https://www.linkedin.com/company/69636574/",
        "https://twitter.com/spotlessCoating",
        "https://facebook.com/spotless.materials",
        "https://www.crunchbase.com/organization/spotless-materials"
    ],
    "logo_path": "data/logos\\spotLESS_Materials_logo.png"
}