{
    "links": "https://www.ycombinator.com/companies/squire-technologies",
    "name": "Squire Technologies",
    "headline": "Platform to grow your barbershop and maximize profitability.",
    "batch": "S16",
    "description": "Squire is a booking and payment platform that connects people with great barbers worldwide. Squire makes it easy to discover and book the best barbers wherever you are, in just a few taps. \r\n\nSquire is also the premier management platform for barbershops. Using Squire, barbers are able to engage their customers, process bookings and payments and better market their business through Squire’s “barbershop discovery” capabilities. Fully integrated with a point of sale, inventory management and payroll systems, Squire is a one-stop solution for barbershop owners to efficiently operate their business.  \r\n\nWith headquarters in New York and a presence in major cities in the United States, United Kingdom, Australia, and Canada, Squire has quickly become a market leader in technology solutions for the barbershop industry worldwide.\r\n\nFor more information, please visit getsquire.com or download the Squire iOS app from the App Store.",
    "activity_status": "Active",
    "website": "http://getsquire.com/",
    "founded_date": 2015.0,
    "team_size": 150.0,
    "location": "New York",
    "group_partner": "Michael Seibel",
    "group_partner_yc": "https://www.ycombinator.com/people/michael-seibel",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:beauty; industry:smb; location:new-york",
    "founders": [],
    "status": true,
    "generated_description": "Squire Technologies is shaking up the barbershop scene with a mission to help barbershops grow and enhance their profitability through a comprehensive platform. Founded in 2015 and emerging from Y Combinator's S16 batch, Squire has its roots in New York and has expanded to major cities across the United States, Canada, the United Kingdom, and Australia. The company boasts a team of 150 dedicated employees, including prominent Group Partner, Michael Seibel.\n\nInitially developed as a booking and payment platform, Squire connects customers with barbers globally, simplifying the process of finding and scheduling appointments with top barbers. But Squire is more than just a booking service—it’s an all-in-one management platform tailored for barbershops. With robust features for customer engagement, booking and payment processing, marketing tools, and fully integrated point-of-sale systems, Squire empowers barbershop owners to manage their operations efficiently.\n\nHere are some highlights of what Squire offers:\n\n1. **Client Experience**: Users benefit from branded apps, online booking, appointment notifications, loyalty programs, and gift card functionalities—all designed to enhance customer satisfaction and retention.\n\n2. **Barber Tools**: Barbers can enjoy features like no-show protection, client management, Instagram booking links, and streamlined scheduling to handle their appointments more smoothly.\n\n3. **Business Operations**: The platform includes tools for inventory management, staff scheduling, marketing, and payroll processing, all aimed at simplifying day-to-day operations for barbershop owners.\n\nWith over 32,000 barbers utilizing Squire to streamline their workflows and increase revenue, it’s clear that Squire is making a significant mark in the beauty tech space. The company emphasizes measurable outcomes, claiming reductions in no-shows and the ability to grow revenue by up to 29%.\n\nIn essence, Squire isn’t just a tool—it's a partner in elevating barbershops into the future. For further details or to explore potential partnerships, you can check them out at [getsquire.com](http://getsquire.com).\n\nIf you're a barber or a shop owner looking to simplify your business and make more money, Squire may just be what you need to stay sharp in a competitive landscape.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/b1ce076db2446bb326a68fd1d1c2781e9b2c1ea4.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191944Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=9cb89a7902ce388d0e441da7154b8f08e70ec7e64cf01f426506766de641e9c3",
    "social_links": [
        "https://www.linkedin.com/company/squ%C4%ABr-technologies",
        "https://twitter.com/getsquire.com",
        "https://www.crunchbase.com/organization/squir-technologies-4"
    ],
    "logo_path": "data/logos\\Squire_Technologies_logo.png"
}