{
    "links": "https://www.ycombinator.com/companies/stacker",
    "name": "Stacker",
    "headline": "Turns spreadsheets into internal apps and customer portals",
    "batch": "S20",
    "description": "We let you create applications for your team, your partners or your customers, powered by the data you're already using.\r\n\nConnect in your spreadsheets, Airtable or database and we'll automatically create an app for you.",
    "activity_status": "Active",
    "website": "https://stackerhq.com",
    "founded_date": 2017.0,
    "team_size": 7.0,
    "location": "London, United Kingdom",
    "group_partner": "Garry Tan",
    "group_partner_yc": "https://www.ycombinator.com/people/garry-tan",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:saas; industry:b2b; industry:no-code",
    "founders": [
        {
            "name": "Michael Skelly, Founder",
            "description": "Narcoleptic Brit from Northumberland living in London.\n\nCS at Oxford. AI at Imperial. Pistols at Dawn.\n\nI like cryptic crosswords, no code, and calligraphy. Working on combining all three.",
            "linkedin": "https://www.linkedin.com/in/skellymichael/"
        },
        {
            "name": "Sam Davyson, Founder",
            "description": "Physics at Cambridge. Worked for ~ 10 years in the Salesforce ecosystem in Finance, Events, and NGOs before founding Stacker convinced there must be a better way to create business software. British but left the UK 10 yrs ago for Switzerland and settled in Geneva. Married and have 3 beautiful kids. Love mountains and swimming in cold lakes.",
            "linkedin": "https://www.linkedin.com/in/davyson/"
        }
    ],
    "status": true,
    "generated_description": "**Stacker: Your Go-To No-Code Powerhouse for Application Building**\n\nFounded in 2017, Stacker is a London-based startup that emerged from Y Combinator’s Summer 2020 batch. With a lean but effective team of just seven, it’s on a mission to help businesses turn their spreadsheets into powerful internal apps and dynamic customer portals, dramatically simplifying how teams operate.\n\nAt its core, Stacker allows you to connect whatever data you're already using—be it Google Sheets, Airtable, or any other database—and with absolutely zero coding, automatically generates customized applications. This means that users can roll out tools that might traditionally take months or even years to develop—within minutes.\n\nStacker identifies itself in the software ecosystem with tags like ‘SaaS’, ‘B2B’, and ‘No-Code’. What does this mean for you? If you're juggling multiple spreadsheets, Stacker liberates you from the tedious workflow while ensuring your operations remain agile and adaptable. \n\nOne of the standout features recently introduced is Stacker AI, which helps automate tasks through AI agents, allowing you to streamline processes further. The platform caters to a variety of use cases, from building custom CRMs to managing internal workflows and creating user-friendly client portals.\n\nGarry Tan, the group partner associated with Stacker, brings valuable experience and mentorship to the table, reflecting the company’s commitment to innovation and growth.\n\nFor anyone grappling with the complexity of various platforms and unifying their data, Stacker provides a refreshing solution. Also, for those who are inspired by real-world applications, Stacker showcases transformative case studies, such as TED’s implementation that reportedly saved each user about eight hours a week, highlighting the practical impact of their tools.\n\nIf you want to take your business operations to the next level without getting bogged down in technicalities, Stacker is worth a look. Their website, [stackerhq.com](https://stackerhq.com), offers free trials and demos that might just help you realize the potential of going code-free in your operations. \n\nSo here’s the bottom line: If you’re tired of being chained to your spreadsheets, give Stacker a whirl. It’s time to ditch the manual processes and empower your team with intuitive software solutions that adapt to your unique workflow needs.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/d71624cffbfc06d4e4223888daed0f543c054360.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191947Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=aad0b57c980eeb437ab505e90c42e9b1f4cc21f91dd5599609ab21af01494a58",
    "social_links": [
        "https://www.linkedin.com/company/stackerhq",
        "https://twitter.com/stackerhq",
        "https://www.crunchbase.com/organization/stacker-79fe"
    ],
    "logo_path": "data/logos\\Stacker_logo.png"
}