{
    "links": "https://www.ycombinator.com/companies/statiq",
    "name": "Statiq.",
    "headline": "India's Largest EV charging network",
    "batch": "S20",
    "description": "Statiq connects electric vehicle owners to EV chargers. EV owners can discover chargers near them, pre-book a slot and pay for the usage conveniently. Property owners can buy, share their chargers, manage them and earn by becoming charger hosts with Statiq. Our EV chargers can be found at shopping malls, workplaces, restaurants , hotels, residential spaces.",
    "activity_status": "Active",
    "website": "https://statiq.in/",
    "founded_date": 2020.0,
    "team_size": 200.0,
    "location": "Gurugram, India",
    "group_partner": "Gustaf Alstromer",
    "group_partner_yc": "https://www.ycombinator.com/people/gustaf-alstromer",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:marketplace; industry:climate; industry:electric-vehicles",
    "founders": [
        {
            "name": "Akshit Bansal, Founder",
            "description": "I am an Electrical engineer by education , conservationist by heart. \nI believe that electric vehicles are the future and catalysts for positive environmental change.\nI, along with my team are tackling the problem of EV adoption in developing economies and building sustainable and affordable EV charging infrastructure.",
            "linkedin": "https://www.linkedin.com/in/akshit-bansal7/"
        },
        {
            "name": "Raghav Arora, Founder",
            "description": "I have been a data scientist with Wipro before being the CTO of Statiq.\nTrained around 1500 people in India on Data Analysis  using python.",
            "linkedin": "https://www.linkedin.com/in/raghav-arora-ab5087192/"
        }
    ],
    "status": true,
    "generated_description": "**Company Overview: Statiq**\n\nStatiq is on a mission to power India's electric vehicle (EV) revolution with the country’s largest network of EV chargers. Founded in 2020 and based in Gurugram, India, Statiq emerged from Y Combinator's Batch S20 to streamline the charging experience for EV owners. With a team of about 200 employees, the company provides an intuitive platform for users to discover, reserve, and pay for charging stations nearby. \n\n### What They Offer\n\nStatiq connects EV owners to over 7,000 charging stations spread across more than 63 cities in India. Their service can be found at popular venues like shopping malls, workplaces, and hotels, making it incredibly convenient for users to charge their vehicles.\n\nThe company not only focuses on the needs of electric vehicle owners but also empowers property owners by providing them with the opportunity to host charging stations. Property hosts can manage their chargers via Statiq’s platform, creating a win-win situation that promotes wider adoption of electric vehicles.\n\n### Products and Solutions \n\nStatiq offers a variety of products designed to cater to different charging needs:\n\n- **Hardware Products**: Their hardware solutions include fast chargers, like the 60kW dual gun and the 22kW charger, as well as innovative solutions like the Statiq Circle and AdWall.\n  \n- **Software Solutions**: They offer a White Label solution for businesses and a Charger Station Management System (CSMS) that enables hosts to monitor and optimize charger utilization.\n\nApart from these, their mobile app simplifies EV charging by allowing users to discover, book, and pay for charging sessions seamlessly.\n\n### The Bigger Picture \n\nStatiq is not just another startup; it symbolizes the paradigm shift towards a more sustainable future. The EV infrastructure they’re building is crucial to reducing carbon emissions and promoting cleaner air across urban environments. With a target to install over 25,000 charging stations by the end of 2024, they are set to expand their accessibility even further.\n\n### Fun Facts\n\n- **Cost Efficiency**: Traveling via an electric vehicle costs about Rs. 1-1.5 per kilometer, significantly less than the Rs. 7-8 per kilometer of petrol/diesel vehicles.\n- **Growing Market**: Over 1 million electric vehicles were sold in India during the fiscal year 2022—a clear indicator of a booming market.\n- **Innovation in Lithium**: The recent discovery of lithium deposits in India can potentially lessen reliance on imports, boosting the domestic EV manufacturing sector.\n\nBy providing robust charging solutions and streamlining the user experience, Statiq isn’t just enhancing the convenience of electric vehicle ownership; it’s actively contributing to a greener planet. \n\nTo learn more or to join the EV revolution with Statiq, visit their website [Statiq](https://statiq.in/).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/7ee22e0f135a222811c1165dcffbf5814b9fb699.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191950Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=097fa8f5c9259573beb439289a699ec409f05d4d922c937c7d80c0ca21357766",
    "social_links": [
        "https://www.linkedin.com/company/statiqcharge"
    ],
    "logo_path": "data/logos\\Statiq._logo.png"
}