{
    "links": "https://www.ycombinator.com/companies/stayqrious",
    "name": "StayQrious",
    "headline": "StayQrious helps kids in India learn through online group classes,â\u0080¦",
    "batch": "W20",
    "description": "Imagine doing personalised workouts with a fitness coach, but for school subjects. Students log into their session that has been scheduled with their coach, they can see their learning workout for the day. Their workout typically consists of watching an interactive video, writing explanations, giving feedback to other students, making an explainer video etc. They get constant feedback and encouragement from the coach and progress only after they have understood the pre-requisites.",
    "activity_status": "Active",
    "website": "https://StayQrious.com",
    "founded_date": null,
    "team_size": 29.0,
    "location": "Bengaluru, India",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:elearning; industry:india; industry:kids",
    "founders": [],
    "status": true,
    "generated_description": "StayQrious is reengineering education for kids in India through innovative online group classes. Founded by Aanand Srinivas, former learning head at Khan Academy, and backed by curriculum advisor Dr. Brian Johnsrud from Stanford, this Bengaluru-based startup aims to transform how children aged 7 to 12 learn.\n\nForget the traditional classroom model; StayQrious combines personalized education with interactive activities, akin to a workout regime but for academic subjects. Students log in for sessions where they engage with interactive videos, provide feedback to peers, create explainer videos, and receive continuous, tailored feedback from coaches. This method emphasizes deep understanding before moving on to new concepts.\n\nBy focusing on real-world skills, the curriculum allocates substantial time for emotional intelligence, social skills, and independent learning. The classes, typically involving small groups of 8 students led by two coaches—a senior and a junior—are designed to mimic a workplace environment, enhancing collaboration and problem-solving skills.\n\nStayQrious stands out by rejecting rote learning and conventional schooling pains. Instead, it ensures that kids actively engage with their education, working on projects like creating an investor pitch for a chocolate business or simulating historical figures to learn about evolution—all while being mindful of their mental health through regular check-ins and consultations with trained psychologists.\n\nWith a team of 29 and part of Y Combinator's W20 cohort, StayQrious is poised to cultivate a new generation of learners equipped for the complexities of the modern workforce. Their approach blends personalized attention with rigorous academic standards, preparing students not just to learn but to thrive.\n\nFor more information, visit [StayQrious](https://StayQrious.com) or call them at +91-9150933505.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/ffc9185831d14bbdab8e6ac23df0720ea5fb520f.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191949Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=fab4d768e57fdc1a553495c409738299a6b9e06c07f16c4eeec2fef41a646f05",
    "social_links": [
        "https://github.com/stayqrious"
    ],
    "logo_path": "data/logos\\StayQrious_logo.png"
}