{
    "links": "https://www.ycombinator.com/companies/stellar-sleep",
    "name": "Stellar Sleep",
    "headline": "We help people with chronic insomnia sleep better, using psychology.",
    "batch": "S23",
    "description": "25 million Americans with chronic insomnia are getting inadequate and superficial care advice (e.g. cutting coffee, meditation etc.), when in reality, their sleep problems are often driven by deeper psychological challenges like unresolved anxiety. Stellar Sleep uses psychology to help these people break the insomnia cycle.",
    "activity_status": "Active",
    "website": "https://stellarsleep.com/",
    "founded_date": 2021.0,
    "team_size": 5.0,
    "location": null,
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": null,
    "founders": [
        {
            "name": "George W, Founder",
            "description": "George's founder bio",
            "linkedin": "https://linkedin.com/in/wang-george"
        },
        {
            "name": "Edrei Chua, Founder",
            "description": null,
            "linkedin": "https://linkedin.com/in/edreichua"
        }
    ],
    "status": true,
    "generated_description": "**Stellar Sleep: Your Partner in Overcoming Insomnia**\n\nFounded in 2021 and part of Y Combinator's Batch S23, Stellar Sleep is revolutionizing how we approach chronic insomnia—an issue that plagues 25 million Americans with often overlooked psychological roots. The company's mission is straightforward: to help people conquer insomnia through tailored psychological strategies rather than superficial remedies like cutting coffee or resorting to meditation.\n\n### The Problem\n\nChronic insomnia is more than just a sleep issue; it’s a complex challenge that frequently stems from deeper psychological problems such as anxiety and stress. Many traditional treatments miss this mark, leaving sufferers with barely scratched surfaces. This is exactly why Stellar Sleep exists—to address these root causes head-on.\n\n### How It Works\n\nTheir approach is clear and effective. Users begin by taking a free online sleep quiz designed to assess their unique sleep patterns and life factors. Based on the results, Stellar Sleep then crafts a personalized program rooted in proven behavioral therapy techniques. \n\nHere’s the gist:\n1. **Online Sleep Quiz**: Understand your sleep state.\n2. **Personalized Program**: Get a bespoke plan focused on psychological solutions.\n3. **Long-lasting Results**: Cultivate skills that lead to sustainable sleep improvements rather than quick fixes.\n\n### The Science Behind Stellar Sleep\n\nStellar Sleep isn’t just throwing random tips at you. Their strategies utilize evidence-based techniques from Cognitive Behavioral Therapy for Insomnia (CBT-I). These methods address various aspects of insomnia, employing techniques like Sleep Restriction Therapy, Cognitive Restructuring, and more. \n\n### Not Just Another App\n\nThis isn’t just any sleep app. Stellar Sleep has been recognized with multiple awards, including the first place in the 2022 Digital Health Innovation Awards for Best Overall SleepTech Solution. Users rave about the app, with an impressive average rating of 4.8 from over 500 reviews. Feedback echoes a common sentiment: it works—really works.\n\n### Real User Experience\n\nA user noted a substantial turnaround after weeks of sleepless nights. “I literally had slept 0 minutes for weeks,” they said. But, after utilizing Stellar Sleep, they began to see real improvement—sleep every night. Another user shared how the app’s focus on psychological techniques rather than generic meditation profoundly changed their sleep quality, increasing their nightly rest from 6 to a solid 7-8 hours.\n\n### Join the Sleep Revolution\n\nIf you're among the millions struggling with sleep, Stellar Sleep offers a lifeline. The app promises not just to help you fall asleep but to transform your relationship with sleep—forever. With techniques that only take about 10 minutes a day, it's designed to fit seamlessly into your life.\n\nSo why wait? Explore their offerings and take that initial step towards better sleep today. Check out their website at [Stellar Sleep](https://stellarsleep.com) and embark on your journey to healthier sleep!",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/7c42e9f3ac70140c1d1bab0d9ac4958964667a74.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191949Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=1972a62d9c31b655428262a2945ce23b22f1cc1f23b107e673dc5c1e346c9137",
    "social_links": [
        "https://www.linkedin.com/company/stellar-sleep"
    ],
    "logo_path": "data/logos\\Stellar_Sleep_logo.png"
}