{
    "links": "https://www.ycombinator.com/companies/stempad",
    "name": "Stempad",
    "headline": "Notion for science",
    "batch": "S24",
    "description": "You can think of Stempad as a Notion for science. It is the world's first true pen-and-paper alternative to fast scientific writing and collaborating. Quickly switch between different forms of technical visualization with the ease of a whiteboard and the convenience of your keyboard.\r\n\nStempad allows you to share your work, collaborate in real time, store your data, annotate, write papers, plan, takes notes, create presentations, and so much more. Our vision is to make it easier and faster for students and scientists to digitize and share their scientific ideas.",
    "activity_status": "Active",
    "website": "https://www.stempad.com",
    "founded_date": 2024.0,
    "team_size": 1.0,
    "location": null,
    "group_partner": "Harj Taggar",
    "group_partner_yc": "https://www.ycombinator.com/people/harj-taggar",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": null,
    "founders": [
        {
            "name": "Ralph Rouhana, Founder",
            "description": "Hey, I'm Ralph 👋 I founded Stempad in early 2024 to help me take notes in my final year of school. After getting it to several hundred users and a few paying subscribers, I saw the potential for schools, research teams, pharmaceutical companies, tutoring companies, and more. I've previously interned at BioRender (W18), Microsoft, and 5 other companies.",
            "linkedin": "https://www.linkedin.com/in/ralph-rouhana"
        }
    ],
    "status": true,
    "generated_description": "**Stempad: The Notion for Science**\n\nFounded in 2024 and part of Y Combinator's Batch S24, Stempad aims to revolutionize the way students and scientists approach scientific writing and collaboration. Think of it as the \"Notion for science\"—a versatile platform that combines the flexibility of a whiteboard with the precision and convenience of a digital workspace.\n\n### What Stempad Offers\nStempad is the world’s first true pen-and-paper alternative tailored for fast scientific writing. It empowers users to seamlessly switch between various technical visualizations, annotate work, write papers, plan projects, take notes, create presentations, and collaborate in real-time. In essence, it’s an all-in-one tool for anyone in the STEM fields.\n\nSome standout features include:\n- **Markdown Formatting**: Effortlessly format equations with LaTeX support.\n- **Interactive Elements**: Integrated tools like an executable Python environment, graphing calculators, and even circuit drawing capabilities.\n- **Collaboration**: Real-time editing makes it ideal for team projects and discussions.\n\nIn its initial stages, Stempad is operated by a nimble team of one (the founder) and is based in [location: \"nan\"]. Harj Taggar, a veteran from Y Combinator, serves as their group partner, lending invaluable guidance as they grow.\n\n### The Vision\nStempad's mission is clear: make it faster and easier for STEM students and researchers to digitize and share their scientific ideas. In a world where collaboration and efficiency are paramount, Stempad is poised to become an essential tool in the scientific community, allowing ideas to flow as freely as the ink on paper.\n\nWant to get started? Head over to [Stempad’s website](https://www.stempad.com) to try it for free and experience the new frontier of scientific documentation.\n\nIn summary, whether you're drafting a complex research paper or just jotting down notes, Stempad is here to redefine what a scientific workspace looks like. It's more than just a tool; it's a movement toward more fluid and interactive scientific collaboration.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/46080a77390ebd01f9e7ee5b04aebf8d4e62935c.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191949Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=6a77e4868128e95c1c6d21e7751f5fd19e50f6bd7ae46c8a2ac592b02d8b9e06",
    "social_links": [
        "https://www.linkedin.com/company/stempad"
    ],
    "logo_path": "data/logos\\Stempad_logo.png"
}