{
    "links": "https://www.ycombinator.com/companies/stepful",
    "name": "Stepful",
    "headline": "Online Training for Healthcare Jobs",
    "batch": "S21",
    "description": "Stepful trains people with a high school education in 4 months and places them into healthcare jobs. Healthcare is the fastest growing industry in the US accounting for 40% of all jobs added including medical assistants, nursing assistants, and phlebotomists.",
    "activity_status": "Active",
    "website": "https://www.stepful.com",
    "founded_date": 2021.0,
    "team_size": 45.0,
    "location": "New York",
    "group_partner": "Michael Seibel",
    "group_partner_yc": "https://www.ycombinator.com/people/michael-seibel",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:elearning; industry:healthcare; location:new-york",
    "founders": [
        {
            "name": "Carl Madi, Founder",
            "description": "Carl worked at both Uber and Handy acquiring 100,000+ workers to take on new jobs. He is also a seasoned operator managing a $75M P&L at Handy. He leads user acquisition and employer partnerships at Stepful.",
            "linkedin": "http://www.linkedin.com/in/carlmadi"
        },
        {
            "name": "Tressia Hobeika, Founder",
            "description": "Tressia led product teams at Udacity and Triplebyte, where she built online learning experiences that helped reskill and place 200k+ job seekers in tech jobs. She leads Product and Operations at Stepful.",
            "linkedin": "https://www.linkedin.com/in/tressia-hobeika/"
        },
        {
            "name": "Edoardo Serra, Founder",
            "description": "Serial founder with two exits, Edoardo joined Stepful from Apple where he helped scaling the Siri International engineering team from inception to hundreds of people. He is in charge of building the technology.",
            "linkedin": "https://www.linkedin.com/in/eserra/"
        }
    ],
    "status": true,
    "generated_description": "Stepful is a forward-thinking company focused on empowering individuals to enter the healthcare job market through online training. Founded in 2021 and based in New York, Stepful aims to train people with just a high school education in as little as four months, providing a fast track into roles like medical assistants, nursing assistants, and pharmacy technicians. This mission is particularly relevant given that healthcare accounts for 40% of all jobs added in the US—it's a booming industry.\n\nWith a team of 45 and part of Y Combinator Batch S21, Stepful has garnered attention and support from key investors, including Michael Seibel. The company's platform offers affordable, accessible training options at a fraction of the cost of traditional programs. The goal is straightforward: to help job seekers gain certification and secure employment in healthcare, which is increasingly vital in today's economy.\n\nTheir core programs include training for Medical Assistants, Pharmacy Technicians, Medical Administrators, and Surgical Technologists—all designed to be completed in four months or less. The courses combine online learning with hands-on clinical experience at partner clinics, ensuring that graduates are well-prepared for real-world challenges.\n\nStepful is not just about education; it's also about career placement and support. Graduates benefit from job coaching services, helping them navigate the employment landscape post-training. With a commitment to economic opportunity, Stepful aims to transform the lives of a million job seekers in healthcare by creating pathways into fulfilling careers.\n\nTheir impact is visible through the testimonials of thousands who have gone on to succeed in various healthcare roles. Featured in outlets like Axios, Forbes, and the Wall Street Journal, Stepful is not just a training program; it’s a launchpad for those looking to make their mark in a growing industry.\n\nIn essence, if you’re looking to break into the healthcare field without the lengthy and expensive commitment of traditional education, Stepful is a compelling option. The journey from student to healthcare professional starts here—bringing knowledge, support, and real-world experience together for aspiring job seekers. For more details, visit [Stepful's website](https://www.stepful.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/b12c03db8fa638ee9d465eb216cf8fbc69d3eef7.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191949Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=4a8c60c7e2305424583b3c4abb7fbd5f0344bbc85a89c03a34ee2bb534108f3f",
    "social_links": [
        "https://www.linkedin.com/company/stepful/",
        "https://twitter.com/StepfulTraining",
        "https://www.facebook.com/stepful/",
        "https://www.crunchbase.com/organization/stepful",
        "https://github.com/stepful"
    ],
    "logo_path": "data/logos\\Stepful_logo.png"
}