{
    "links": "https://www.ycombinator.com/companies/storyboarder",
    "name": "Storyboarder",
    "headline": "Tool and platform to create and sell webcomics",
    "batch": "W23",
    "description": "Storyboarder is a tool and a platform for anyone to create, share, and sell webcomics.\r\n\nIn East Asia, the webcomic (or digital manga) industry is an $12B market and rapidly growing to the rest of the world. Webtoon, the largest company in the space, generates $100M / month in revenue. However, their addressable market is limited by their content creators, who need know how to draw. Readers are desperate for a greater variety of stories in webcomics.\r\n\nThrough years of working with filmmakers, we’ve built extremely easy to use storyboarding software  that has 700K users. We’re democratizing visual storytelling to everyone. We’re working on the next generation that, through advances in video game interfaces, ubiquitous 3D compute, and AI, will allow anyone to easily create scenes, pose characters, to create webcomics. \r\n\nStoryboarder is backed by Y Combinator (W23), David Karp (Tumblr Founder), Andrew Kortina (Venmo Founder), and other product focused investors.",
    "activity_status": "Active",
    "website": "https://storyboarder.com",
    "founded_date": 2022.0,
    "team_size": 2.0,
    "location": "New York",
    "group_partner": "Aaron Epstein",
    "group_partner_yc": "https://www.ycombinator.com/people/aaron-epstein",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:entertainment; industry:media; industry:creator-economy; location:new-york",
    "founders": [
        {
            "name": "Charles Forman, Founder",
            "description": "Charles Forman is the co-founder of Storyboarder. With a background in computer science and design, Charles is passionate about building great product experiences that make the world a more enjoyable place. Prior to co-founding Storyboarder, Charles was the founder of OMGPOP (YCS06), a gaming startup that gained international recognition for its popular game \"Draw Something\". OMGPOP attracted millions of users and was ultimately acquired by Zynga for $210 million.",
            "linkedin": "https://www.linkedin.com/in/iminlikewithyou/"
        },
        {
            "name": "Joe Watkins, Founder",
            "description": "Joe Watkins is the co-founder and CTO of Storyboarder. Prior to Storyboarder, Joe lead a computer vision/machine learning team at Google before working on generating maps with machine learning at Waymo.\nJoe's passion for web-native fiction played a significant role in inspiring Storyboarder's design. As a teenager, he was captivated by the potential of the internet to tell stories in new and exciting ways, and spent countless hours exploring different forms of digital storytelling.",
            "linkedin": "https://www.linkedin.com/in/joe-watkins-06925295"
        }
    ],
    "status": true,
    "generated_description": "### Storyboarder: Your Gateway to Webcomic Creation\n\n**Company Overview**\nFounded in 2022 and hailing from New York, Storyboarder is on a mission to democratize digital storytelling. Backed by Y Combinator (W23) and notable investors like David Karp and Andrew Kortina, this tool is designed for anyone — whether you’re a budding artist or a seasoned storyteller — to create, share, and sell webcomics easily. \n\n**The Opportunity**\nThe webcomic industry is booming, particularly in East Asia, where it’s a $12 billion market. Yet, the biggest player, Webtoon, faces a limitation: the need for creators who can draw. Storyboarder aims to fill this gap by providing an intuitive platform that doesn’t require advanced artistic skills, thus unlocking a much wider range of stories and creators.\n\n**The Tool**\nStoryboarder is not just any creation software; it combines advanced 3D interfaces with user-friendly features, catering to over 700,000 users who've used its storyboarding software for various film and television projects. Now, they’re moving into the realm of webcomics, aiming to empower storytellers to craft visually stunning narratives without the typical barriers.\n\n**Features You’ll Love**\n- **Ease of Use**: Designed to quickly turn ideas into stories with minimal hassle.\n- **Web-Based**: No downloads required. Access from anywhere, even on mobile devices.\n- **Collaboration Tools**: Work with others in real-time.\n- **Character Creator and Posing**: Simply describe your characters, and create poseable versions of them quickly.\n- **Dynamic Visuals**: Automatic shot composition, ray tracing for beautiful lighting, and facial expressions to convey emotions.\n- **Social Engagement**: A platform that fosters community interactions, daily challenges, and even a marketplace for assets.\n\n**Monetization for Creators**\nThe platform allows creators to release webcomics episodically, charging a small fee (around $0.20) for subsequent episodes after the initial ones are free. This creates an engaging way for viewers to connect with stories, ensuring that creators can earn a living doing what they love.\n\n**What’s Next?**\nStoryboarder embraces advances in technology like AI to enhance its features continuously. Their vision is to equip storytellers with unparalleled tools that turn simple ideas into vivid, engaging stories for an increasingly visual audience.\n\nIf you’ve got a story inside you waiting to be told, Storyboarder could be your ticket from idea to engagement. The future of visual storytelling is just a click away—are you ready to join the waitlist? \n\nYou can find out more at [Storyboarder.com](https://storyboarder.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/ef33f69a1792cee377469cc159b05a2e80b1aafe.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191950Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=18adea9b62215fe5722e9482647c604e68da5f19d33305c421cf255ed77706c0",
    "social_links": [
        "https://www.linkedin.com/company/storyboarder"
    ],
    "logo_path": "data/logos\\Storyboarder_logo.png"
}