{
    "links": "https://www.ycombinator.com/companies/stream",
    "name": "Stream",
    "headline": "AI-Powered Medical Document Review for Workers' Comp",
    "batch": "S22",
    "description": "Stream enables insurance and adjacent professionals such as lawyers, nurses, and claim adjusters to review medical documents faster and better than ever before.",
    "activity_status": "Active",
    "website": "http://www.stream.claims",
    "founded_date": 2022.0,
    "team_size": 12.0,
    "location": "San Francisco",
    "group_partner": "Jared Friedman",
    "group_partner_yc": "https://www.ycombinator.com/people/jared-friedman",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:saas; industry:b2b; industry:insurance; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Eric Yen, Founder",
            "description": "Workers' comp claims adjuster turned builder.",
            "linkedin": "https://www.linkedin.com/in/yeneric"
        },
        {
            "name": "Eilam Levitov, Founder",
            "description": "Originally from Israel I moved to the Bay Area back in 2014 to attend UC Berkeley and never left.",
            "linkedin": "https://linkedin.com/in/eilamlevitov"
        }
    ],
    "status": true,
    "generated_description": "**Stream: Revolutionizing Medical Document Review with AI**\n\nFounded in 2022 and based in San Francisco, Stream is an innovative company tackling a significant pain point in workers' compensation: the overwhelming backlog of medical documents. It emerged from Y Combinator's Batch S22, gathering momentum as it aims to streamline the process for insurance professionals, lawyers, nurses, and claims adjusters, allowing them to review medical documents with unprecedented speed and efficiency.\n\n**Mission and Services**\n\nStream's mission centers around providing AI-powered medical document review specifically for workers' compensation cases. With their cutting-edge platform, they transform sprawling stacks of medical paperwork into concise, actionable summaries. This helps alleviate the 10 billion pages of documents that are hampering timely decision-making in the industry.\n\nTheir product offerings include:\n- **Stream Chrono**: A real-time document processing platform.\n- **Stream Chrono+**: An end-to-end medical document review service, paired with human expertise to ensure accuracy.\n- **Stream Sift**: A deduplication and decluttering service that rationalizes document sets to save time and costs.\n\nBy leveraging machine learning models trained on over a million pages of workers' compensation records, Stream guarantees best-in-class results tailored specifically for this niche.\n\n**Impact and Efficiency**\n\nWhat really sets Stream apart is its operational impact. Users have reported a staggering 4x return on investment by eliminating manual reviews, a 24-hour turnaround for summaries, and a 27% reduction in costs associated with med-legal record reviews. This is made possible through their team of experts—including MDs, nurses, and lawyers—who verify the AI-generated summaries for additional assurance.\n\n**Trust and Compliance**\n\nPrivacy and data security are paramount in healthcare, so Stream proudly carries SOC 2 Type II and HIPAA certifications. This ensures that any data processed through their platform remains secure and compliant.\n\n**The Team Behind Stream**\n\nWith a lean but dedicated team of 12 employees, Stream is led by Group Partner Jared Friedman. They are carving out a significant space in the growing intersection of fintech, SaaS, B2B, and insurance sectors.\n\n**Customer Testimonials and Recognition**\n\nThe company's innovation hasn't gone unnoticed. Industry leaders trust Stream for its quality and efficiency. As noted by clients like Tina Perez from Arrowhead Evaluation Services, Stream's customizations and responsiveness have exceeded expectations, while others like Thomas Smith from Matrix Document Imaging highlight its impact on revenue opportunities and customer satisfaction.\n\nArticles highlighting Stream's efforts have appeared in reputable outlets like The Wall Street Journal and Axios, confirming its relevance and potential for transforming the workers' compensation landscape.\n\nTo see how Stream can enhance your operations, you can [request a demo](http://www.stream.claims/#).\n\nIn short, Stream is not just another tech company; it’s a game-changer that's applying AI to cut through the clutter in medical document review, creating real value for professionals in a field often bogged down by paperwork.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/6a7854e9b8e20c92b30d71a6cd6793b84d48648a.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191952Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=d6a6ccbb90c7ec9c78a48f0ffee2f46ad769a8d30cd0ec5ab606fbaa9741a696",
    "social_links": [
        "https://www.linkedin.com/company/streamclaims/"
    ],
    "logo_path": "data/logos\\Stream_logo.png"
}