{
    "links": "https://www.ycombinator.com/companies/strive-math",
    "name": "Strive Math",
    "headline": "Online Coding School for Kids 8-16",
    "batch": "S21",
    "description": "Strive is an online coding school for kids (8-16). We help students start and commit to their coding journeys by making coding fun and exciting. We focus, above all else, on making the process of learning joyful. \r\n\n- We’re starting with coding, but we’re building the content and platform to redefine **STEM education globally** by teaching math, science, and other school subjects **through coding.**\r\n- We believe we can only make education joyful if we ourselves are joyful, so creating a fun and exciting work environment is one of our core values. We’re a remote-first company with teachers and employees from South Africa, Singapore, India, the USA, and the Philippines.\r\n- **We’re a well-funded startup backed by YCombinator and early investors of Spotify and Facebook.**",
    "activity_status": "Active",
    "website": "https://www.strivemath.com/",
    "founded_date": 2020.0,
    "team_size": 13.0,
    "location": "Singapore, Singapore",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:education",
    "founders": [
        {
            "name": "Pulkit Agarwal, Founder",
            "description": "I finished high school at the age of 16. I then studied Mechanical Engineering at Georgia Tech and graduated ranked 1st of 5794 students, with straight As and a 4.0 GPA. \n\nI graduated from Stanford University with an MBA as one of the youngest: at the age of 25. \n\nI absolutely love teaching! I was a Teacher Assistant for the Linear Algebra class at Georgia Tech and a Course Assistant for an Optimization Modeling in Python class at Stanford.",
            "linkedin": "https://www.linkedin.com/in/agarwalpulkit/"
        }
    ],
    "status": true,
    "generated_description": "**Strive Math: Transforming STEM Education through Coding for Kids**\n\nFounded in 2020 and operating out of Singapore, Strive Math is an innovative online coding school dedicated to helping children aged 8-16 embark on their coding journeys. The company emerged from the belief that learning should be joyful and engaging, and it aims to redefine STEM education globally by intertwining coding with mathematics and science.\n\n### The Mission\nStrive Math's mission is clear: to make coding not just a skill, but a fun and exciting part of a child's education. The company's ethos centers around joy—the joy of learning, teaching, and working. This approach not only nurtures budding programmers but also fosters a lively work environment for its remote-first team. \n\n### The Offerings\nThe core offerings at Strive Math include tailored 1-on-1 coding classes where students can learn to create real-world projects like games, apps, and animations. The curriculum is structured in four levels—Head Start, Foundations, Fluency, and Mastery—catering to various skill levels and interests. Strive Math stands out with its hands-on learning philosophy; kids learn by doing rather than just listening—a crucial factor that keeps them engaged.\n\n### The Team\nThe company boasts a diverse and talented team of 13 instructors sourced from locations such as South Africa, Singapore, India, the USA, and the Philippines. These educators are not just coding experts; they have the unique ability to connect with young learners, making complex concepts accessible and enjoyable. Their collective experience ensures that kids receive personalized education tailored to their individual needs and inclinations.\n\n### Backing and Growth\nStrive Math is proudly backed by Y Combinator and early investors from Spotify and Facebook, indicating a strong belief in its potential to disrupt traditional education paradigms. Currently acknowledged as a well-funded startup, the company is on a path for significant growth—a journey that has just begun.\n\n### Getting Started\nFor those interested, Strive Math provides a risk-free trial class. Parents can book a session and if, after the first class, they find it isn’t the right fit, a full refund is guaranteed—no questions asked. This initiative showcases Strive Math's commitment to confidence in their educational offerings.\n\nTo explore their programs or learn more, visit [Strive Math](https://www.strivemath.com/). \n\nIn short, Strive Math isn’t just teaching kids to code; it’s instilling a love for learning that could last a lifetime, redefining how STEM subjects are perceived and taught in the digital age.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/aa165633b19923d00c5b33d70a329f2aaa641c92.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191952Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=f71474f0b7aef099ae65030c036ac5714259807b083df6cea6686d4a5f2a7cca",
    "social_links": [
        "https://www.linkedin.com/company/strivemath",
        "https://github.com/StriveMath"
    ],
    "logo_path": "data/logos\\Strive_Math_logo.png"
}