{
    "links": "https://www.ycombinator.com/companies/striga",
    "name": "Striga",
    "headline": "Compliant Crypto and Banking Infrastructure",
    "batch": "W21",
    "description": "Striga is building infrastructure for digital assets and financial services as a single set of APIs doing the heavy lifting of security and regulatory compliance. Striga's customers include early stage FinTech's, Web3 innovators, Banking Institutions and Crypto Exchanges utilizing services spanning the range of Crypto Custody, Trading, Card Issuing and Banking. Building a crypto business today is a highly regulated space unlike a few years ago and maintaining a compliance program and building technology presents a huge barrier to entry for startups and mid-size businesses alike and the Striga platform solves the problem with a single set of APIs and a single contract to deliver services to 30 countries today.",
    "activity_status": "Active",
    "website": "https://striga.com/",
    "founded_date": 2018.0,
    "team_size": 10.0,
    "location": "Tallinn, Estonia",
    "group_partner": "Nicolas Dessaigne",
    "group_partner_yc": "https://www.ycombinator.com/people/nicolas-dessaigne",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:crypto-web3; industry:compliance",
    "founders": [
        {
            "name": "Prashanth Balasubramanian, Founder/CTO",
            "description": "Passionate early Bitcoin-er and developer. Left ETH Zurich mid-way through my MSc to build Lastbit/Striga. Working with bitcoin and playing a European tour with a German band, evidently illustrated the horrors of only legally having access to an Indian bank account but attempting to use multiple currencies on a daily basis, whilst bitcoin was promised to solve this problem. Striga solves this and enables businesses to solve this.\n\nIn my \"free\" time - semi-pro drummer & full time metalhead",
            "linkedin": "http://linkedin.com/in/pbio"
        }
    ],
    "status": true,
    "generated_description": "### Striga: Building Compliant Crypto and Banking Infrastructure\n\nFounded in 2018, **Striga** emerged from the Y Combinator Batch W21 and has set up its headquarters in Tallinn, Estonia. The company is a game-changer in the digital assets space, providing a **compliant and secure infrastructure for financial services** through a streamlined set of APIs. This means they handle the heavy lifting related to **security and regulatory compliance**, which is a huge hurdle for startups in today's highly regulated environment.\n\n#### Mission and Offerings\n\nStriga's mission is clear: to make crypto and banking infrastructure compliant and accessible. They serve a range of customers, including early-stage fintechs, Web3 innovators, traditional banking institutions, and crypto exchanges. Their offerings cover a broad spectrum, from **crypto custody** and **trading** to **card issuing** and various banking services. It's no small feat; their platform currently assists businesses operating in **30 countries**, solving a significant problem for startups and mid-sized businesses struggling with compliance and technology integration.\n\n#### The Striga Platform\n\nThe heart of Striga’s solution lies in its **modular platform**, crafted for developers, with a focus on flexibility. This means clients can quickly build and scale crypto and financial products without diving into the complexities of regulation and security—because Striga does that for them. Some key features include:\n\n- **Crypto wallets**: Issue dedicated wallets with top-tier custody support.\n- **Crypto exchange**: Access competitive prices for trading pairs.\n- **Payments**: Facilitate instant transactions with minimal compliance overhead.\n- **Card Issuing**: Customizable virtual and physical payment cards.\n\n#### Growing the Ecosystem\n\nStriga is keen to enable innovation. Their **API-first approach** allows customers to integrate various functionalities, such as KYC and onboarding, without reinventing the wheel. They also provide **Compliance as a Service**, which means they’re not just a vendor—they’re a partner in ensuring businesses can innovate efficiently while remaining compliant.\n\nWith a compact team of 10 and support from industry figures like Nicolas Dessaigne, Striga is well-equipped to scale its impact alongside the growing demand for robust crypto and banking solutions.\n\n#### Why Striga?\n\nIn a world where building a compliant crypto business comes with hefty barriers, Striga simplifies the process. They handle regulatory relationships and compliance, empowering businesses to focus on what they do best—innovation. If you're a startup looking to integrate crypto capabilities without the added complexity, Striga might just be the partner you're looking for.\n\nFor more insights and to see how you can start your journey with Striga, visit [Striga's official website](https://striga.com/) and check out their extensive API documentation and use cases.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/5b1a7c754c66901b1ed35a52881fbc360f9e9df2.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191952Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=11935a490c6e3e53c78bb3ac66edf0883edf9b55099d1a1b0f9eb2ccfddcc98d",
    "social_links": [
        "https://www.linkedin.com/company/striga",
        "https://twitter.com/lastbitpay",
        "https://www.crunchbase.com/organization/striga",
        "https://github.com/lastbit-io"
    ],
    "logo_path": "data/logos\\Striga_logo.png"
}