{
    "links": "https://www.ycombinator.com/companies/strikingly",
    "name": "Strikingly",
    "headline": "The easiest way to create a beautiful, mobile optimized website.",
    "batch": "W13",
    "description": "Strikingly lets you build a gorgeous, mobile optimized website in minutes. For your business, organization, or personal branding, a good-looking site is necessary for your online legitimacy in the Mobile Age.\r\n\nWith no code or design at all, you can set up a professional website in under 30 minutes, and it'll look great on your phone, tablet, and computer. Check it out at http://www.strikingly.com/. We're hiring! Please see: http://www.strikingly.com/s/careers .\r\n\nOur mission is to give everyone the power to turn their creative ideas into reality and build brands around them. See why: http://www.strikingly.com/s/manifesto",
    "activity_status": "Active",
    "website": "https://www.strikingly.com",
    "founded_date": 2012.0,
    "team_size": 99.0,
    "location": "Shanghai, China",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:e-commerce",
    "founders": [],
    "status": true,
    "generated_description": "### Strikingly: Empowering Web Presence in the Mobile Age\n\nFounded in 2012 and honed through Y Combinator's Batch W13, Strikingly offers a streamlined solution for anyone wanting to establish a stunning online presence without getting bogged down by coding or intricate design work. Based in Shanghai, China, and boasting a dedicated team of 99 employees, Strikingly purports to be the easiest way to create beautiful, mobile-optimized websites in just minutes.\n\n#### Mission and Vision\n\nStrikingly's mission is simple yet profound: to give everyone the power to turn creative ideas into reality. It underscores the importance of a well-crafted website for businesses, organizations, and personal branding in an increasingly mobile-centric world. The tool allows users to set up a fully functional and professionally-looking site within 30 minutes, all from a single, user-friendly platform.\n\nYou can visit Strikingly and start building your site quickly at [strikingly.com](http://www.strikingly.com/).\n\n#### Key Features\n\n1. **Rapid Setup**: Create a website in under 30 minutes with no coding or design skills required.\n2. **Mobile Optimization**: All sites are beautifully optimized for smartphones, tablets, and desktops.\n3. **E-commerce Integration**: Users can easily add a Simple Store to sell products with PayPal or Stripe integration.\n4. **Custom Tools**: From forms and newsletters to social media feeds, all tools necessary for audience engagement are included.\n5. **24/7 Support**: The 'Happiness Team' offers continuous support via email or live chat, ensuring users get assistance whenever they need it.\n\n#### Current Promotions\n\nStrikingly is currently running a limited-time offer for a free domain with any yearly plan, adding another incentive for potential users to dive in.\n\n#### Community and Trust\n\nThe platform is praised by numerous entrepreneurs and professionals who appreciate its intuitive interface and the ability to create stunning sites effortlessly. Notable users like Seth Godin and others have vouched for its beauty and ease of use. Strikingly has been featured in prominent publications, highlighting its role in helping individuals and businesses craft captivating online experiences.\n\nFor those looking to join a dynamic team contributing to the digital landscape, Strikingly is also actively hiring. You can explore career opportunities at [Strikingly Careers](http://www.strikingly.com/s/careers).\n\nIn summary, if you're looking to establish a solid web presence quickly and efficiently, Strikingly might just be the toolkit you need. With an easy-to-navigate platform, robust features, and a focus on mobile-first design, it empowers creators from all walks of life to make their visions a reality.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/60aa746e10a34b7737d78a1fe8a7f5040367f35a.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191952Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=96dee1e08591f7c4fcbd90e91dfd69508955f2a1f208497086a75730c7f1887e",
    "social_links": [
        "https://twitter.com/strikingly",
        "https://facebook.com/strikingly",
        "https://www.crunchbase.com/organization/striking-ly",
        "https://github.com/strikingly"
    ],
    "logo_path": "data/logos\\Strikingly_logo.png"
}