{
    "links": "https://www.ycombinator.com/companies/subsets",
    "name": "Subsets",
    "headline": "AI-driven Retention Automation for subscription media businesses.",
    "batch": "S23",
    "description": "Subsets is the leading AI-driven retention automation platform purpose-built for commercial teams in subscription businesses.\r\n\nSubscription media companies like The Atlantic, TuneIn, Daily Mail, McClatchy, and The Athletic use Subsets to predict churn, experiment with retention strategies, and confidently automate what works to drive engagement and retention.\r\n\nLaunched out of Y Combinator’s 2023 Summer batch in San Francisco, Subsets is building the AI-driven retention platform for subscription businesses focused on sustainable growth and profitability.",
    "activity_status": "Active",
    "website": "https://www.subsets.com",
    "founded_date": 2023.0,
    "team_size": 7.0,
    "location": "Copenhagen, Denmark",
    "group_partner": "Tom Blomfield",
    "group_partner_yc": "https://www.ycombinator.com/people/tom-blomfield",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:artificial-intelligence; industry:machine-learning; industry:b2b; industry:enterprise-software",
    "founders": [
        {
            "name": "Martin Johnsen, Founder",
            "description": "Martin is the co-founder and CEO of Subsets (S23). Previously worked in management consulting helping large organizations scale AI initiatives across different business functions and industries. Holds an MSc in Mathematical modeling from The Technical University of Denmark.",
            "linkedin": "https://linkedin.com/in/martin-johnsen-subsets"
        },
        {
            "name": "Oliver Brandt, Founder",
            "description": "Oliver is the co-founder and CTO of Subsets.com (S23). Previously worked as an ML engineer at DSV (the world 3rd largest transport and logistics company) leading the development of their MLOps platform and building products. Holds an MSc in Data Science from The Technical University of Denmark and loves sailing⛵, diving🤿  and Skiing⛷️",
            "linkedin": "https://dk.linkedin.com/in/oliver-brandt-93b1b8110"
        },
        {
            "name": "Nikolai Skelbo, Founder",
            "description": "I'm Nikolai, co-founder and COO at Subsets. Before we founded Subsets, I spent two years at Contractbook building the Revenue Operations team, and leading growth initiatives such as Account Based Marketing (ABM). \n\nSpending most of my time in front of my laptop, I enjoy doing all sorts of sports and being in the nature in my spare time :)",
            "linkedin": "https://linkedin.com/in/nikolaiskelbo"
        }
    ],
    "status": true,
    "generated_description": "# Subsets Overview\n\n**Company Name:** Subsets  \n**Founded:** 2023  \n**Location:** Copenhagen, Denmark  \n**Team Size:** 7 employees  \n**Y Combinator Batch:** S23  \n\n## Mission\nSubsets aims to revolutionize the subscription media landscape with its AI-driven retention automation platform. Designed specifically for commercial teams, the platform focuses on increasing customer engagement and retention, thereby fostering sustainable growth for subscription businesses.\n\n## What They Do\nSubsets provides cutting-edge solutions that empower subscription media companies like The Atlantic, TuneIn, Daily Mail, McClatchy, and The Athletic to:\n- **Predict Churn:** Use AI to identify potential subscription cancellations before they happen.\n- **Experiment with Retention Strategies:** Easily run A/B tests and analyze the results to see what resonates with subscribers.\n- **Automate Proven Strategies:** Turn successful experiments into automated workflows without needing engineering support.\n\nBy leveraging proprietary first-party data, Subsets custom-trains machine learning models that surface actionable insights tailored to each business’s unique needs.\n\n## Backing and Support\nSubsets has already secured $1.65 million in funding to further develop its platform. It’s gaining traction by positioning itself as a vital tool for those in the subscription business looking to optimize their revenue from existing customers without the need for complex engineering interventions.\n\n## Key Features\n1. **Audience Insight:** Understand your most important audiences throughout their subscription lifecycle.\n2. **Experimentation Made Easy:** Run experiments in a user-friendly interface and automate analysis across key metrics.\n3. **Retention Automation:** Streamline successful retention strategies into scalable automations that actively engage subscribers.\n\n## Notable Quotes\n- Andy Wilson, Head of Subscriber Retention at Daily Mail, praises the platform for its comprehensive results analysis and ability to keep campaigns 'always on.'\n- Camilla Vilby-Mokvist, Marketing Automation Manager at Børsen, highlights how Subsets allows for a proactive approach in managing churn.\n\n## Labels\n- **Tags:** Artificial Intelligence, Machine Learning, B2B, Enterprise Software\n\n## Conclusion\nSubsets is positioning itself as a leader in the burgeoning field of retention automation for subscription media. If you're in this space and looking to optimize your strategies without the technical overhead, Subsets could be just what you need.\n\n**Website:** [Subsets](https://www.subsets.com)",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/26c4a1a45d3637d7fe96021932fba693ebdba4af.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191954Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=d849329e9861a89903188eeb1d8db8b25a4706df18e6dc155c2714cc922740ba",
    "social_links": [
        "https://linkedin.com/company/subsets"
    ],
    "logo_path": "data/logos\\Subsets_logo.png"
}