{
    "links": "https://www.ycombinator.com/companies/sunlight",
    "name": "Sunlight",
    "headline": "The Universal Card-On-File API",
    "batch": "S22",
    "description": "Sunlight is an API to change the card-on-file with apps and subscription services. Fintechs use Sunlight to automatically make their cards top-of-wallet as soon as they're issued. \r\n\nMerchants, service providers and subscriptions-based businesses everywhere now offer their customers the ability to save a debit/credit card on file, so they can pay their bills on time, buy in one click, or earn rewards. In 2021, 79% of consumers worldwide reported already having at least one payment card saved with a service or being open to doing so. \r\n\nIn recent years, card-issuing as-a-service has become mainstream: any company can now start their own card business in a matter of weeks. Last year, the number of new payment cards issued was at an all-time high. For users, however, switching banks or opening a new card now comes with an additional hurdle: they need to update their payment info across the internet. On the other side of that equation, card issuers have no visibility or control over the card-on-file updating process, and as a result struggle to get their new users to switch their spend from their old card to the new one, leading to low conversion rates and missed revenue opportunities.\r\n\nUntil Sunlight.\r\n\nWith our universal get-your-card-on-file API, FIs can now offer their users, at any point in their journey, a quick and easy way to update their debit/credit card info everywhere they shop or pay online, without ever leaving their Apps.\r\n\nThe Sunlight API works on every platform that has a card-on-file option (think Uber, Amazon, Netflix, DoorDash, Starbucks and so many more…), is as seamless as a Plaid connection, and always gets the card number and CVV code right on the first try!",
    "activity_status": "Active",
    "website": "https://www.sunlightapi.com/",
    "founded_date": 2021.0,
    "team_size": 6.0,
    "location": "New York",
    "group_partner": "Dalton Caldwell",
    "group_partner_yc": "https://www.ycombinator.com/people/dalton-caldwell",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:payments; industry:b2b; industry:api; location:new-york",
    "founders": [
        {
            "name": "Guy Ziv, Founder",
            "description": "Guy Ziv is the Co-Founder and CEO of Sunlight, a seasoned business executive, and entrepreneur with a wealth of experience in introducing disruptive technologies to medium and large financial institutions worldwide. With a robust background in product delivery, sales strategy, and execution, Guy has a track record of successfully forming dozens of strategic partnerships and delivering innovative solutions in the ever-evolving realm of financial technology.",
            "linkedin": "https://www.linkedin.com/in/gyziv/"
        },
        {
            "name": "Leo Chanea, Founder",
            "description": "Product executive, entrepreneur & community expert with a versatile experience in building sticky products. Ex-Moovit (acquired by Intel)",
            "linkedin": "https://www.linkedin.com/in/leo-chanea-12545a40/"
        },
        {
            "name": "Gil Peretz, Founder",
            "description": "Gil Peretz is an experienced and passionate entrepreneur in the tech space. With a background in R&D, he has held positions such as Group Manager at Moovit, and has a wealth of experience in building high performance systems serving 1B+ users. His expertise spans from integrating systems, data scraping, and modeling on a large scale.",
            "linkedin": "https://www.linkedin.com/in/gil-peretz-25404031/"
        }
    ],
    "status": true,
    "generated_description": "**Sunlight: The Universal Card-On-File API for Fintechs**\n\nFounded in 2021 and part of Y Combinator's Batch S22, Sunlight is revolutionizing the way consumers manage their payment methods. At its core, Sunlight is an API crafted to simplify the process of updating card-on-file information across various platforms—from Netflix to Starbucks—without leaving the app. \n\n### Why Sunlight Matters\n\nThe payment landscape is evolving. In 2021, a staggering 79% of consumers had at least one card saved with an online service. For banks and fintechs, this shift has created a new challenge: when customers switch banks or issue new cards, they face the daunting task of updating their payment details everywhere they shop. Without an efficient way to do so, card issuers often struggle with low conversion rates and lost revenue opportunities.\n\nThat's where Sunlight comes in. By offering a universal Card-On-File API, financial institutions (FIs) can provide their users with an easy solution to keep their payment information up-to-date. Imagine a world where switching to a new debit or credit card is as seamless as a quick tap on a button. That’s the future Sunlight is building.\n\n### How It Works\n\nSunlight allows users to select their vendors directly within the app of their financial institution, enabling them to update card details across the board effortlessly. The API is integrated with major platforms—think Uber, Amazon, DoorDash—making it a versatile tool for any business with a card-on-file model. This integration ensures the card number and CVV code are entered correctly every time, significantly reducing friction in the payment process.\n\n### What Can Sunlight Do for You?\n\n1. **Increased Share of Wallet**: Sunlight empowers users to set your card as their preferred payment method across various vendors, effectively increasing your transaction volume.\n   \n2. **Streamlined Customer Experience**: For your customers, this means fewer hurdles when managing their recurring transactions, which can lead to higher customer satisfaction and loyalty.\n\n3. **Enhanced Revenue Opportunities**: With more transactions routed through your card, you'll see a boost in interchange revenue, offering an advantage in the competitive corporate card market.\n\n4. **Security and Privacy First**: Data protection is non-negotiable. Sunlight adheres to the highest standards of security and privacy, ensuring that user information is safeguarded at all times.\n\n### Why Choose Sunlight?\n\nWith just a small team of six based in New York, Sunlight is already making waves in the fintech sector. Their innovative solution enables merchants and service providers to enhance their payment offerings while providing a crucial service to consumers. Whether you're a financial institution looking to enhance your card offerings or a consumer who values simplicity, Sunlight is driving the change you need.\n\nFor more information, visit their website at [Sunlight API](https://www.sunlightapi.com/) and see how they can transform your billing experience.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/ebfb47387f50c508d7d6552f2d91361836576e99.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191955Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=896b925f5a64d0cf5bf04c56b2191e53d19b7f9431a964c063e019dd59b81bab",
    "social_links": [],
    "logo_path": "data/logos\\Sunlight_logo.png"
}