{
    "links": "https://www.ycombinator.com/companies/sunsama",
    "name": "Sunsama",
    "headline": "Daily planner for busy professionals",
    "batch": "W19",
    "description": "Sunsama organizes your work one day at a time.\r\n\nIn the morning, plan your day. Pick out what you want to work on today by importing your tasks and meetings for the day from your various tools. Decide how much time you want to spend on each item to make sure you're setting realistic goals for yourself.\r\n\nAs the day goes on, stay focused. Concentrate on one task at a time. Keep track of how long you've been working, and when it's time to shift your attention to something else.\r\n\nWhen you're done, shut down for the day. Reflect on what you were able to accomplish. End the day feeling satisfied with what you could do rather than consumed by what you couldn't.\r\n\nSunsama is built to improve your relationship with your work. Work should be an engine for fulfillment, not for stress and anxiety.",
    "activity_status": "Active",
    "website": "https://sunsama.com",
    "founded_date": null,
    "team_size": 7.0,
    "location": "Kailua, HI",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:productivity; industry:scheduling",
    "founders": [
        {
            "name": "Ashutosh Priyadarshy, Founder",
            "description": "Founder at Sunsama",
            "linkedin": "https://www.linkedin.com/in/ashutoshpriyadarshy"
        },
        {
            "name": "Travis Meyer, Founder",
            "description": null,
            "linkedin": "https://www.linkedin.com/in/travis-s-meyer"
        }
    ],
    "status": true,
    "generated_description": "Sunsama is the digital assistant for busy professionals who want to take charge of their daily productivity. Envision it as your personal daily planner, designed to help you organize your work one day at a time. Located in the picturesque town of Kailua, Hawaii, and a proud member of Y Combinator's W19 batch, Sunsama is a small but mighty team of seven dedicated to transforming the way you manage your tasks and time.\n\n### What Does Sunsama Do?\n\nEvery morning with Sunsama, you can kickstart your day by importing tasks and meetings from various tools—think Asana, Trello, Gmail, and more—into a unified daily view. This feature allows you to prioritize what to focus on and realistically allocate time for each item, so you’re not just busy, but effective.\n\nAs your day unfolds, Sunsama encourages a focused approach: one task at a time. It’s about maintaining concentration and tracking how long you’ve been working. When the day winds down, Sunsama helps you reflect—not with regret on what you didn’t do, but with satisfaction on what you accomplished. It’s a refreshing shift that aims to improve your relationship with work, fostering fulfillment over stress.\n\n### Key Features\n\n1. **Guided Daily Planning:** Sunsama provides a structured routine for planning your day, helping you be intentional with your time.\n2. **Unified Daily View:** Streamlines tasks, emails, and meetings into one place for easy access.\n3. **Realistic Daily Goals:** Set achievable objectives for your day and work-life balance.\n4. **Timeboxing:** Schedule tasks within your calendar to stay organized and on track.\n5. **Seamless Integrations:** Pull in tasks from popular tools and ensure everything stays in sync.\n6. **Focus and Dark Modes:** Adapt the interface to your preferences while you work.\n\n### Empirical Impact\n\nSunsama has garnered respect within the productivity sphere, with endorsements from notable figures like Paul Galatis, CEO of Names & Faces, and Geoff Ralston, President of Y Combinator, who highlight its significant impact on their daily efficiency. \n\n### Try Before You Buy\n\nWhether you’re looking for a structured planning approach or a way to harmonize multiple tasks across different platforms, Sunsama offers a 14-day free trial with no credit card required. It's time to set realistic goals, stay focused, and walk out of your workday feeling accomplished.\n\nIf managing your busy professional life resonates with you, head over to [Sunsama's website](https://sunsama.com) and take the first step toward a more organized and fulfilling work routine.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/bdb8f45bf8c2498498544d2b94c6cc71dfe06dc0.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191956Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=e6a4558443e077e4d33b5089c1df6077542edd1e6e320dca313381bea644c03f",
    "social_links": [
        "https://www.crunchbase.com/organization/sunsama",
        "https://github.com/sunsama"
    ],
    "logo_path": "data/logos\\Sunsama_logo.png"
}