{
    "links": "https://www.ycombinator.com/companies/supernova",
    "name": "Supernova",
    "headline": "Design system platform joins developers and designers together",
    "batch": "W19",
    "description": "Supernova connects to popular design editors and interprets design systems into data. These data can then be transformed in powerful ways to create code for product development, for literally any coding stack or platform imaginable. \r\n\nThese transformations can be fully automated so that when design changes occur, the code is automatically updated to reflect the changes. Developers can fully control how the code is rendered, literally down to the individual code characters. An ecosystem of Supernova-developed and community-maintained code export packages is available for popular stacks and platforms via the Supernova Store, or teams can choose to create their own — for instance, to support proprietary frameworks or to customize code output to meet any company guidelines.",
    "activity_status": "Active",
    "website": "https://supernova.io",
    "founded_date": 2016.0,
    "team_size": 20.0,
    "location": "Prague, Czech Republic",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:developer-tools; industry:design-tools",
    "founders": [],
    "status": true,
    "generated_description": "### Supernova: Bridging the Gap Between Design and Development\n\n**Overview:**  \nFounded in 2016 and part of Y Combinator's W19 batch, Supernova is a Prague-based company with a compact yet dynamic team of 20. Its mission is to create a design system platform that seamlessly connects developers and designers, enhancing collaboration and streamlining product development.\n\n**Core Offering:**  \nSupernova started with a simple yet powerful premise: to connect with popular design tools (like Figma) and convert design systems into actionable data. This data isn't just information; it's transformed into code that works across virtually any tech stack. What’s really striking here is the automation—when a design changes, the corresponding code gets updated without anyone lifting a finger.\n\nDevelopers maintain precise control over the output, down to individual characters, which means customization is not only possible, it's encouraged. Supernova also offers a marketplace—the Supernova Store—packed with code export packages crafted by both the team and the community for popular frameworks. This flexibility allows teams to implement their proprietary systems or tweak existing templates to fit their guidelines.\n\n**Why It Matters:**  \nIn a world where design and engineering often speak different languages, Supernova acts as a translator and unifier. By automating the updates from design changes to code, teams can focus more on creativity and less on mundane tasks. The platform not only facilitates communication but also provides extensive resources like documentation, integration options, and community support.\n\n**Use Cases and Features:**\n- **Seamless Integration:** Supernova connects with various tools in your existing ecosystem, making it easier for teams to find everything they need within their current workflows.\n- **Code Automation:** Automated pipelines reduce human error during development. This is particularly useful for teams that rely on fast iteration cycles—like in agile environments.\n- **Design System Management:** Supernova offers robust features for documentation and governance of design systems, ensuring consistency and clarity.\n- **Enterprise Solutions:** Their features scale beautifully from startups to large enterprises, allowing organizations to manage complex design systems effectively.\n\n**Customer Insight:**  \nClients have shared glowing reviews, emphasizing how Supernova not only serves as a reliable source of truth but also enhances collaboration. It's not just about creating documentation; it's about enabling teams to engage with the product actively and efficiently.\n\n**Conclusion:**  \nSupernova is more than just another tool in the developer's toolbox; it's a comprehensive solution aimed at accelerating the product development process by harmonizing design and engineering efforts. For any team looking to enhance collaboration and maintain flexibility in their design system, Supernova seems like a compelling option. \n\nFor more information, visit their website at [supernova.io](https://supernova.io).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/220bcc88b8e6eb4f0ce9b02dd4ab1d428824f74c.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191957Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=6f0aa3e89945407caf80d223e82d037ff7646f0f6bf34a6b6ae23c172fe86965",
    "social_links": [
        "https://www.linkedin.com/company/supernova-io",
        "https://twitter.com/supernova_io",
        "https://www.facebook.com/supernova.io",
        "https://www.crunchbase.com/organization/supernova-technology-ltd",
        "https://github.com/Supernova-Studio"
    ],
    "logo_path": "data/logos\\Supernova_logo.png"
}