{
    "links": "https://www.ycombinator.com/companies/supertokens",
    "name": "SuperTokens",
    "headline": "Open source alternative to Auth0 / AWS Cognito / Firebase Auth",
    "batch": "S20",
    "description": "SuperTokens is building open source authentication (as an alternative to Auth0, Firebase and AWS Cognito). Add secure, hassle free authentication to your app in 1 day. We enable startups to launch quicker and focus on their core product offering\r\n\n1. We're easier to implement as we take a modular approach - making it possible to pick only the features you need for your use case. This means you need not worry about complications associated with other features (eg: SSO and OAuth if you don’t need it) and this in turn makes it easier to implement and manage SuperTokens.\r\n2. Developer's can own and manage their user's data. \r\n3. SuperTokens can be run on your premise for free and also has a generous hosted tier for those who dont want to manage it themselves.\r\n\nSuperTokens is being used by hundreds of developers across the globe.",
    "activity_status": "Active",
    "website": "https://supertokens.com",
    "founded_date": 2019.0,
    "team_size": 10.0,
    "location": "San Francisco",
    "group_partner": "Brad Flora",
    "group_partner_yc": "https://www.ycombinator.com/people/brad-flora",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:developer-tools; industry:saas; industry:b2b; industry:open-source; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Advait Ruia, Founder",
            "description": "I am a cofounder at SuperTokens (a service to securely manage web user sessions). My background includes:\n\n- Venture Capital experience at $450M consumer tech fund\n\n- Head of $1.6 million (USD) crowdfunding campaign for BLOCKS smartwatch on Kickstarter\n\n- A BEng in Mechanical Engineering from Imperial College London\n\nI have a strong technical background in engineering and a broad set of leadership and teamwork skills that are demonstrated by my various roles and responsibilities.",
            "linkedin": "https://www.linkedin.com/in/advait-ruia-2aa52a85/"
        }
    ],
    "status": true,
    "generated_description": "**SuperTokens: The Open Source Authentication Powerhouse**\n\nFounded in 2019, SuperTokens is carving out a niche as a robust open-source alternative to giants like Auth0, AWS Cognito, and Firebase Auth. The mission? To enable developers and startups to integrate secure, hassle-free authentication into their apps in just a day, letting them focus on what they do best—building their core products.\n\n**Why Choose SuperTokens?**\n\n1. **Modular Approach:** Say goodbye to the bloat. SuperTokens allows developers to cherry-pick features that suit their needs—no unnecessary complexity. If you don’t need Single Sign-On (SSO) or OAuth, you don’t have to deal with it. This makes implementation straightforward and management a breeze.\n\n2. **Data Ownership:** In an era where data privacy is paramount, SuperTokens gives developers full control over their users' data. You can sleep easy knowing that your users' information is where you want it—under your management.\n\n3. **Flexible Hosting Options:** Want the freedom of running your authentication system on-premise? Go for it—SuperTokens can be run free of charge. Prefer a hands-off approach? They also offer a generous hosted tier for those who want to keep things simple.\n\nWith a vibrant community of users spanning the globe, SuperTokens is already a trusted partner for hundreds of developers. Based in San Francisco and part of Y Combinator's S20 batch, the company keeps a lean operation with about 10 talented employees led by Group Partner Brad Flora.\n\n**What They Offer:**\n\nTheir product line-up is impressively user-friendly, featuring:\n\n- **Magic Links**\n- **Passwordless Login**\n- **Email-Password Login**\n- **Social Login**\n- **Attack Protection Suite**\n- **Single Sign-On (SSO)**\n- **Multi-Tenancy**\n- **Account Linking**\n\nAll of these features can be implemented quickly, with SuperTokens boasting setup times of just five minutes using their prebuilt UI or frontend SDKs.\n\n**Join the Movement:**\n\nIf you’re keen to dive into a reliable, open-source authentication solution that doesn’t drain your resources, check out SuperTokens at [supertokens.com](https://supertokens.com). You'll find a wealth of resources—including updated documentation, customer support, pricing details, a roadmap for the future, and career opportunities.\n\nIn conclusion, SuperTokens is not just another SaaS tool; it's a movement towards greater control, security, and simplicity in authentication. Developers—all around the world—are adopting this solution, allowing them to build better, faster, and more securely. Want to be part of this? Start your journey today!",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/5bb00c512f4e4f1da3536bfdc803fb6a75aa8f0e.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191958Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=09d5e5804f164aab0742c26bdd034bbe28d41cdc1fcb63b1cd988d6d3c256c3c",
    "social_links": [
        "https://www.linkedin.com/company/supertokens/",
        "https://twitter.com/supertokensio",
        "https://github.com/supertokens"
    ],
    "logo_path": "data/logos\\SuperTokens_logo.png"
}