{
    "links": "https://www.ycombinator.com/companies/super-send",
    "name": "Super Send",
    "headline": "Super Send automates personalized outreach across email, LinkedIn,â\u0080¦",
    "batch": "W22",
    "description": "Super Send is a powerful outreach automation platform designed to streamline and scale your prospecting efforts across multiple channels, including email, LinkedIn, and Twitter. With features like dynamic personalization, email warming, inbox rotation, and advanced analytics, Super Send enables businesses to connect with leads efficiently while maintaining a human touch. Whether youâ\u0080\u0099re running A/B tests, managing campaigns, or optimizing deliverability, Super Send provides the tools you need to maximize engagement and grow your business",
    "activity_status": "Active",
    "website": "https://supersend.io/",
    "founded_date": 2020.0,
    "team_size": 8.0,
    "location": "Royal Oak, MI",
    "group_partner": "Brad Flora",
    "group_partner_yc": "https://www.ycombinator.com/people/brad-flora",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:b2b; industry:sales; industry:sales-enablement; industry:marketing",
    "founders": [
        {
            "name": "Kurtis Tryber, Founder",
            "description": "A proven leader who has co-founded 2 companies and led the sales organization of a tech startup in the logistics space. After his first career as an Air Traffic Controller for the United States Air force, he founded his first company Power Only Transit in 2013. Then in 2018, Kurtis spent 2.5 years with Parade then exited with a vision to create the first digital freight marketplace focused on open deck transportation, EXO Freight.",
            "linkedin": "https://www.linkedin.com/in/kurtistryber/"
        },
        {
            "name": "Kristopher Tryber, Founder",
            "description": "10+ years of logistics and transportation operational experience. Full stack engineer, building stuff to fix long haul trucking.",
            "linkedin": "https://www.linkedin.com/in/kris-tryber-42726625/"
        }
    ],
    "status": true,
    "generated_description": "**Super Send: Revolutionizing Outreach Automation**\n\nFounded in 2020 and a proud member of Y Combinator’s Winter 2022 batch, Super Send is making waves in the outreach landscape from its base in Royal Oak, MI. The company is a small yet agile team of 8, led by Group Partner Brad Flora, focusing on optimizing B2B sales efforts through automation.\n\nAt its core, Super Send is an outreach automation platform that allows businesses to streamline their prospecting across multiple channels, including email, LinkedIn, and Twitter. The mission is straightforward: to help users automate personalized outreach while keeping a human touch. With robust features like dynamic personalization, email warming, inbox rotation, and advanced analytics, Super Send ensures that campaigns are not just sent but seen and engaged with.\n\n### Key Features\n\n- **Automation:** Say goodbye to repetitive tasks. Super Send allows you to set campaigns on autopilot, freeing up valuable time to focus on nurturing leads and closing sales.\n  \n- **Optimization:** Fine-tune your campaigns for peak deliverability, increasing the chances that your messages land where they need to be—inbox folders rather than spam.\n\n- **Personalization at Scale:** Craft messages that resonate using dynamic content features, ultimately boosting your response rates significantly.\n\n- **Seamless Integration:** Connect easily with your favorite tools and existing workflows, ensuring a smooth user experience.\n\n### Why Super Send?\n\nSuper Send isn’t just another outreach tool; it’s a comprehensive platform designed for efficiency. It boasts impressive metrics, with an average reply rate of 16.78% and some campaigns hitting as high as 50%. With over 1,600 companies on board, it’s clear that Super Send is a trusted ally in the competitive sales landscape.\n\nThe service even offers a free trial, allowing potential users to explore all core features without any risk upfront. From contact list uploads to multi-channel outreach capabilities, Super Send enables businesses to hit the ground running.\n\n### Conclusion\n\nIn essence, Super Send is about transforming how we approach outreach. It blends automation with personal touchpoints, making it easier for businesses to connect with their audience meaningfully. So, if you're looking to scale your outreach efforts and enhance engagement effectively, Super Send might just be what you need.\n\nFor more details, visit their [website](https://supersend.io/) and take advantage of their free trial to experience the power of automated outreach for yourself.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/4be3404646da878a896c7a0b0d31a2391a44b57f.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191959Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=0a4220b60b7440060f24587d5aa532773ae7c15247b02f63a85f6320c31c61eb",
    "social_links": [
        "https://linkedin.com/company/supersend-io/",
        "https://www.crunchbase.com/organization/super-send"
    ],
    "logo_path": "data/logos\\Super_Send_logo.png"
}