{
    "links": "https://www.ycombinator.com/companies/superorder",
    "name": "Superorder",
    "headline": "AI customer reputation & performance management for restaurant chains.",
    "batch": "S19",
    "description": "Superorder enables restaurant chains to build customer loyalty, enhance operational efficiency, and maximize profitability. Superorder has a robust network of restaurant partners that include Marco's Pizza, KFC, Pizza Hut, Wow Bao, and Del Taco.",
    "activity_status": "Active",
    "website": "https://superorder.com/",
    "founded_date": 2021.0,
    "team_size": 30.0,
    "location": "New York",
    "group_partner": "Michael Seibel",
    "group_partner_yc": "https://www.ycombinator.com/people/michael-seibel",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:artificial-intelligence; industry:saas; industry:b2b; industry:restaurant-tech; industry:food-tech; location:new-york",
    "founders": [
        {
            "name": "Raghav Poddar, Founder",
            "description": "CEO at Superorder",
            "linkedin": "https://www.linkedin.com/in/poddarraghav/"
        }
    ],
    "status": true,
    "generated_description": "**Superorder: A Brief Overview**\n\nFounded in 2021 and part of Y Combinator's Batch S19, Superorder is revolutionizing how restaurant chains manage their customer interactions and operational efficiency through the power of AI. Based in New York, this innovative company operates with a dedicated team of 30 employees and boasts a diverse roster of partners, including well-known brands like KFC, Pizza Hut, and Marco's Pizza.\n\n**Mission and Vision**\nSuperorder's mission is straightforward yet ambitious: to enhance AI-driven customer reputation and performance management specifically for restaurant chains. By enabling these businesses to build customer loyalty, streamline their operations, and maximize profitability, Superorder is positioning itself as a leader in restaurant technology.\n\n**Current Endeavors**\nRecently, Superorder secured $10 million in Series A funding, which they plan to use to advance their generative AI order management tools for restaurants. Their products include:\n\n- A survey feedback system to gather customer input.\n- AI-powered review management solutions, helping restaurants respond to customer feedback quickly and effectively.\n- Real-time alerts about operational issues.\n- Integrations with third-party tools to enhance functionality.\n\nSuperorder's solutions have demonstrated considerable effectiveness, claiming to process over 3 million annual reviews while facilitating transactions totaling more than $10 billion in GMV from their clients.\n\n**Technology and Impact**\nSuperorder leverages artificial intelligence to not only manage reviews but also to provide actionable insights derived from customer data. By optimizing local SEO, engaging with customers post-visit for feedback, and even automating the response to reviews, the company helps restaurant chains improve both their reputation and operational efficiency. Reports suggest that businesses using Superorder see a 20% increase in revisit rates when engaging with customer reviews.\n\n**Client Testimonials**\nIndustry leaders have highlighted the transformative impact of Superorder's solutions. For instance, Geoff Alexander, President and CEO of Wow Bao, stated that Superorder has allowed for more effective customer connection and operational management. Kal Gullapalli, who runs multiple Marco's Pizza locations, emphasized the critical role Superorder plays in managing their online business efficiently at scale.\n\n**Future Outlook**\nAs Superorder continues to grow and innovate, its commitment to serving restaurant chains with AI-driven tools marks not only a significant advancement in restaurant tech but also a model for how AI can reshape customer interactions in any industry.\n\nIn a nutshell, Superorder is not just about supporting restaurant chains; it's about elevating the entire customer experience through strategic use of technology. If you're curious to learn more or explore how Superorder can impact your business, you can check out their website at [Superorder.com](https://superorder.com/).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/acbc6d0f723c7104198980b99706253d65484d42.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191957Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=a2593c790345577c8c2dec2795b162eeb87dea9082a2965d5e32776e2083afd9",
    "social_links": [
        "https://www.linkedin.com/company/superorderdotcom/"
    ],
    "logo_path": "data/logos\\Superorder_logo.png"
}