{
    "links": "https://www.ycombinator.com/companies/superunit",
    "name": "Superunit",
    "headline": "AI powered ERP for companies manufacturing or selling physical goods",
    "batch": "S24",
    "description": "Superunit is building an AI powered ERP for companies manufacturing or selling physical goods.  We’ve released our first module - AI accounting and supply chain management - to 7 customers in the last 6 weeks. We’ve booked $8.3k in MRR and just signed a pilot with a $200M apparel company. \r\n\nWe offer automated bookkeeping, supply chain management, inventory costs, and contribution margin analysis.  Our system seamlessly integrates with Quickbooks and ERPs, eliminating manual data entry and minimizing errors.\r\n\nUsers can interact with Superunit via Slack or email, avoiding the need to learn new software.\r\n\n(https://www.loom.com/share/1425f6802d774e1aa00a8ac4b64782ff)",
    "activity_status": "Active",
    "website": "http://superunit.ai",
    "founded_date": 2024.0,
    "team_size": 2.0,
    "location": "San Francisco",
    "group_partner": "Gustaf Alstromer",
    "group_partner_yc": "https://www.ycombinator.com/people/gustaf-alstromer",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:machine-learning; industry:saas; industry:b2b; industry:ai; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Peter Marler, Founder",
            "description": "Peter, CEO of Superunit, leads his second venture after founding the VC-backed Robin Golf. His career spans roles at Facebook, Quantifind, and NBCUniversal. He holds an MBA from Stanford.",
            "linkedin": "https://www.linkedin.com/in/marler/"
        },
        {
            "name": "Zach Yellin-Flaherty, Founder",
            "description": "Zach is a software engineer who spent years building payments infrastructure at Stripe and Index. He hold two Computer Science degrees from Stanford.",
            "linkedin": "https://www.linkedin.com/in/zachary-yellin-flaherty/"
        }
    ],
    "status": true,
    "generated_description": "Superunit is a promising startup based in San Francisco, freshly minted from Y Combinator’s Batch S24, having been founded in 2024. The company is on a mission to build an AI-powered Enterprise Resource Planning (ERP) system specifically designed for companies engaged in manufacturing or selling physical goods.\n\nIn just the last six weeks, Superunit has activated its first module, focusing on AI accounting and supply chain management, and it’s already gained traction with seven customers. The company has secured $8.3k in monthly recurring revenue (MRR) and recently signed a pilot agreement with a significant $200 million apparel company. This early traction indicates a strong product-market fit.\n\nSuperunit’s offerings include automated bookkeeping, comprehensive supply chain management, inventory cost management, and insightful contribution margin analysis. One of its significant advantages is seamless integration with existing systems like Quickbooks and other ERPs, which helps negate the headaches of manual data entry and the errors that accompany it.\n\nWhat sets Superunit apart is the user experience. Interactions with the platform can happen through Slack or email, removing the need for users to learn a new software interface. This simplicity makes it very appealing to organizations that may not want to overhaul their entire tech stack.\n\nThe team currently consists of just two employees, demonstrating a lean startup model focused on rapid development and deployment. Superunit is also tagged with several influential domains like fintech, machine learning, and SaaS, hinting at its broader ambitions in the tech landscape.\n\nIf you're keen on exploring Superunit’s offerings, visit their website at [superunit.ai](http://superunit.ai) or schedule a demo to see how their AI can supercharge background verifications and improve profitability for your operations. With cutting-edge technology and a clear focus on user needs, Superunit is not just another startup—it's a venture with the potential to reshape how businesses manage their resources.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/779fe77be55d79f237436ee01b974cb2bd71d0dd.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191958Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=c6cfa0fc72722a61026cce7735bd4a2fe7a6e92388bfd23a0820f6d0a9c63032",
    "social_links": [
        "https://www.linkedin.com/company/superunit-ai",
        "https://x.com/SuperunitHQ"
    ],
    "logo_path": "data/logos\\Superunit_logo.png"
}