{
    "links": "https://www.ycombinator.com/companies/surface-labs",
    "name": "Surface Labs",
    "headline": "Surface Labs helps B2B marketing teams optimize website conversionsâ\u0080¦",
    "batch": "S23",
    "description": "Weâ\u0080\u0099re building tools to help companies collect richer customer data and convert more website visitors to customers.\r\n\nEvery business site has some sort of a Contact Us, Talk to Sales, Request Demo, or other type of intake form designed to collect data from their users. But the majority of these forms are extremely under-optimized and lack the rich analytics and personalization capabilities needed to truly engage users. \r\n\nWe've optimized forms, self-serve pipelines, and ran experiments alongside growth teams at companies like Snowflake and various startups and know exactly what is needed to enable better business forms.",
    "activity_status": "Active",
    "website": "https://withsurface.com",
    "founded_date": 2023.0,
    "team_size": 5.0,
    "location": null,
    "group_partner": "Garry Tan",
    "group_partner_yc": "https://www.ycombinator.com/people/garry-tan",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": null,
    "founders": [
        {
            "name": "Saharsh Agrawal, Founder",
            "description": "Co-founder and CEO of Surface Labs.",
            "linkedin": "https://linkedin.com/in/saharshagrawal"
        },
        {
            "name": "Arjun Sahai, Founder",
            "description": null,
            "linkedin": "https://linkedin.com/in/arjun-sahai"
        }
    ],
    "status": true,
    "generated_description": "**Surface Labs: Revolutionizing B2B Conversions**\n\nSurface Labs is a fresh player in the B2B marketing landscape, founded in 2023 and part of the Y Combinator Batch S23. At its core, Surface Labs is dedicated to helping marketing teams enhance their website conversions by optimizing the often neglected intake forms—those \"Contact Us,\" \"Request a Demo,\" or \"Talk to Sales\" forms that are ubiquitous but, frankly, underwhelming in their current form.\n\n### The Problem\n\nMost forms are like poorly designed vending machines: you put something in and hope for the best, but good luck getting anything useful out. The result? High dropout rates and lost opportunities. Surface Labs recognized that these forms need robust analytics and personalization to truly engage users and capture valuable information. \n\n### The Solution\n\nWith a team of just five and led by Group Partner Garry Tan, Surface Labs has crafted tools that integrate seamlessly into existing websites. They promise to capture 50% more emails, de-anonymize website visitors, and auto-qualify leads without the heavy lifting traditionally required by marketing teams. They've previously collaborated with companies like Snowflake and various startups, gaining key insights into what makes conversion processes successful.\n\nTheir main offerings include:\n\n- **Intelligent Lead Forms**: These aren't your run-of-the-mill forms. They're multi-step, visually appealing, and able to collect partial information while enabling easy follow-ups.\n  \n- **De-Anonymization**: Forget the frustration of anonymous site visitors. Surface Labs provides person-level de-anonymization coupled with lead scoring, so businesses know exactly who’s visiting their site.\n\n- **Multi-Channel Ad Orchestration**: They can help generate conversion-optimized PPC and SEO pages automatically, making ad spends more effective.\n\n### What’s Next?\n\nIf you’re struggling to convert visitors into leads, Surface Labs claims to be a game-changer. They offer personalized demos to showcase how their tools can directly benefit businesses.\n\nYou can visit them online at [withsurface.com](https://withsurface.com) to see their products in action and learn more about their pricing, funnels, or even read their blog for tips on conversion optimization.\n\n### Testimonies of Trust\n\nTheir early adopters are singing praises, claiming significant increases in conversion rates and reduced customer acquisition costs. One CEO summed it up best by stating, \"80% of our enterprise deal flow is inbound. Surface Labs is an essential tool to ensure we capture every one of those leads.\"\n\nIn a nutshell, Surface Labs is tackling a big pain point in online B2B marketing with fresh solutions, and if their early results are any indication, they’re well on their way to making a notable impact in the industry.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/2fd1620073079e3db0b647e6b0951292403d6885.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191958Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=02e4f6295f5decfb33e87c635c11b475a9a87d0e54ceba721b3108cdf2301ebc",
    "social_links": [
        "https://linkedin.com/company/surface-labs",
        "https://twitter.com/surfacelabs_ai",
        "https://www.crunchbase.com/organization/surface-labs-cb05"
    ],
    "logo_path": "data/logos\\Surface_Labs_logo.png"
}