{
    "links": "https://www.ycombinator.com/companies/swadesh",
    "name": "Swadesh",
    "headline": "We setup Immigrants with a free US Bank Account, Credit Card, SIMâ\u0080¦",
    "batch": "S19",
    "description": "We offer a free US FDIC Insured Checking account, Free Credit Card (no interest rate, collateral, fees), Free AT&T SIM Card shipped to home with 40%+ cheaper plans than retail, and save thousands of dollars in remittances to our customers - all by opening a free Swadesh Account. \r\n\nWe enable new to America expats become \"American\" in the eyes of the US Financial system. \r\nWe're starting by serving the 150,000+ Indian expats migrating to the US each year. \r\n\nWe have a comprehensive solution that covers banking, credit building, communication, remittance, as well as value-add services such as insurance, housing etc. along with all the standard bells and whistles of neobanks.",
    "activity_status": "Active",
    "website": "http://www.swadesh.co",
    "founded_date": 2019.0,
    "team_size": 10.0,
    "location": "New York",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:remittances; industry:immigration; location:new-york",
    "founders": [
        {
            "name": "Prateek Swain, Founder",
            "description": "Building the US Bank for the Indian diaspora at Swadesh. Previously worked at Microsoft, Reactive Robotics, and Westbridge Capital. Started HackIndia (India's largest hackathon) and MakeVenturesPrinceton (Princeton's first student run incubator). Princeton University Computer Science '19.",
            "linkedin": "https://www.linkedin.com/in/prateekswain/"
        }
    ],
    "status": true,
    "generated_description": "Swadesh is a forward-thinking financial technology company based in New York, aiming to ease the transition for Indian expats moving to the United States. Founded in 2019 and backed by Y Combinator’s S19 batch, Swadesh is on a mission to help newcomers integrate into the U.S. financial system smoothly.\n\nAt its core, Swadesh offers a suite of services tailored for over 150,000 Indian expats who migrate to the U.S. each year. They provide a free, FDIC-insured checking account that can be opened even before arriving in the U.S. Additionally, they offer a no-fee credit card that helps users build credit without the usual interest rates or collateral requirements. Also included is a free AT&T SIM card shipped straight to your door, featuring cheaper plans than standard retail options. The goal? To save customers money across the board—from banking to remittance fees.\n\nSwadesh’s comprehensive solution encompasses banking, credit building, communication, and remittances, along with additional services like insurance and housing. They aim to empower newcomers by making them feel \"American\" in the eyes of the U.S. financial system.\n\nThe team at Swadesh consists of 10 committed employees and is growing rapidly. They understand the challenges immigrants face and have crafted a holistic approach to address these, making things easier and cheaper for their clients. With a bustling online platform, they also provide crucial services like scholarships and remittances, ensuring their clients have access to all the resources they need.\n\nFor more information, you can check out their [website](http://www.swadesh.co) and see how they’re transforming the immigration experience for Indians moving to the U.S.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/77ccadcb83dd0acf44639738c75aada95061e62f.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T191959Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=cc98f14a48523887748ebc4cd031e7f02190b3d4d031dd513e5d1bf7663dbeb2",
    "social_links": [
        "https://www.linkedin.com/company/swadesh",
        "https://twitter.com/SwadeshHQ"
    ],
    "logo_path": "data/logos\\Swadesh_logo.png"
}