{
    "links": "https://www.ycombinator.com/companies/swiftsku",
    "name": "SwiftSku",
    "headline": "Management and analytics software for convenience stores",
    "batch": "W21",
    "description": "SwiftSku connects the $650B convenience store industry with management and analytics. \r\n\nSwiftSku’s app connects to point of sales at convenience stores in real time, enabling owners to remotely manage and monitor their stores. We take the guesswork out of running a convenience store with predictive analytics, dashboards, and reports.\r\n\nSwiftSku's CEO, Mit Patel, grew up managing the inventory, pricebook, and reporting of his family’s convenience stores, and, when vendors would come by, he’d bridge the language barrier as a translator.  More than 85% of independent convenience stores are owned by Indian families like Mit’s.\r\n\nSolving convenience store owners' pains of today leads to SwiftSku's greater vision of optimizing the supply chain, facilitating a retailer agnostic consumer to brand relationship, and providing real time insights to brands and retailers.",
    "activity_status": "Active",
    "website": "https://swiftsku.com",
    "founded_date": 2019.0,
    "team_size": 35.0,
    "location": "New York",
    "group_partner": "Jared Friedman",
    "group_partner_yc": "https://www.ycombinator.com/people/jared-friedman",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:saas; industry:b2b; industry:analytics; industry:retail-tech; location:new-york",
    "founders": [
        {
            "name": "Mit Patel, Founder",
            "description": "I started SwiftSku because I saw an opportunity to solve the problems that stole time and money from my family and friends in convenience stores.\nAs co-founder and CEO of SwiftSku, I have a burning passion for product development and nothing satisfies me more than building software that delights our customers.\n\nMy technical background is in backend and network engineering.",
            "linkedin": "https://www.linkedin.com/in/mitpatel283"
        },
        {
            "name": "Daniel Mazur, Founder",
            "description": "As co-founder and COO of SwiftSku, I manage operations and strategy, however, I come from a background of analytics and design.\n\nFor pleasure, I enjoy playing tennis and learning about emergent technologies in the fields of additive manufacturing, machine learning, and decentralized applications.",
            "linkedin": "https://www.linkedin.com/in/danielmazur1"
        }
    ],
    "status": true,
    "generated_description": "**Company Overview: SwiftSku**\n\n**Mission:** SwiftSku provides management and analytics software for convenience stores, aiming to streamline operations and enhance profitability in the $650 billion convenience store industry.\n\n**Introduction:**\nFounded in 2019 and part of the Y Combinator Batch W21, SwiftSku is located in New York and has grown into a robust team of 35 employees under the leadership of CEO Mit Patel. His personal background in managing family-owned convenience stores gives him unique insights into the challenges faced by independent store owners—especially relevant since over 85% of these stores are run by Indian families like his own.\n\n**What They Do:**\nSwiftSku’s software connects directly with point-of-sale systems in real-time, allowing owners to:\n\n- Monitor and manage their stores remotely.\n- Simplify decision-making with predictive analytics.\n- Access comprehensive dashboards and reports that elucidate store performance.\n\nThe aim is to remove the guesswork from convenience store management and deliver actionable insights that help owners optimize their operations.\n\n**Vision:**\nBeyond aiding convenience store owners, SwiftSku aspires to revolutionize the supply chain dynamics, fostering a retailer-agnostic relationship between consumers and brands, while providing brands with real-time insights into their products’ performance in the stores.\n\n**Product Features:**\nSwiftSku’s platform allows users to:\n- View live POS activity and transaction history.\n- Update prices in bulk quickly and easily.\n- Access a real-time dashboard summarizing sales data with clear visual breakdowns.\n- Automate mundane tasks, focusing on enhancing profitability and customer engagement through loyalty programs.\n\n**Customer Experience and Support:**\nWith a 4.8/5 overall rating from approximately 2300 happy customers, SwiftSku prides itself on responsive, multilingual customer service—available in English, Hindi, and Gujarati. The company's dedication to customer support is echoed in numerous testimonials, highlighting the ease of use and effectiveness of their app.\n\n**Funding and Partnerships:**\nSupported by notable venture connections, including Jared Friedman as their group partner, SwiftSku collaborates with significant players in the retail-tech space.\n\n**Pricing Plans:**\nSwiftSku offers flexible pricing—starting at $25/month for essential features and going up to $40/month for expanded services like customer loyalty programs. This makes it an affordable option for independent store owners looking to modernize their operations without breaking the bank.\n\n**Final Takeaway:**\nIf you're part of the convenience store landscape and looking for a way to enhance management, SwiftSku seems like a compelling option—direct, data-driven, and positioned to help store owners navigate the complexities of modern retailing with ease.\n\n**Website:** [SwiftSku](https://swiftsku.com)",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/257d05c5f4d277df99bb1e698396f61b70465050.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192000Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=520d7d522fb9f84a75faf33b3e372feed7a396348adde5349a9f050162d3bd62",
    "social_links": [
        "https://www.linkedin.com/company/swiftsku/",
        "https://twitter.com/swiftsku",
        "https://www.facebook.com/swiftsku/"
    ],
    "logo_path": "data/logos\\SwiftSku_logo.png"
}