{
    "links": "https://www.ycombinator.com/companies/swing-education",
    "name": "Swing Education",
    "headline": "Swing Education is the on demand workforce for schools. We make itâ\u0080¦",
    "batch": "IK12",
    "description": "We believe in applying technology to take away the pain of K-12 operations. This means more time and focus available for students and families. Failing to fill a substitute teacher opening causes teachers, school leaders, and administrators to shuffle around to cover gaps. There's also the time spent on the tedious logistical issues of finding, recruiting, screening, scheduling and paying contract substitute teachers. That's why they introduced SwingSubs: so schools don't have to worry about any of those things and can focus on the important stuff.",
    "activity_status": "Active",
    "website": "http://www.swingeducation.com",
    "founded_date": null,
    "team_size": 52.0,
    "location": "San Mateo, CA",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "location:san-francisco-bay-area",
    "founders": [],
    "status": true,
    "generated_description": "**Swing Education: Bridging Schools and Substitute Teachers with Technology**\n\nSwing Education is a San Mateo, California-based startup that is revolutionizing the way schools manage substitute teachers. Founded as part of Y Combinator's Batch IK12, Swing believes that technology can alleviate the logistical burdens of K-12 educational operations, thereby allowing educators to focus on what truly matters: student learning.\n\n**The Problem: Teacher Absences and the Impact on Learning**\n\nTeacher absences can significantly disrupt student learning. When schools can't find a substitute, teachers and administrators are forced into a scramble to cover classes. This chaos detracts from the educational environment and adds unnecessary stress to school staff.\n\n**The Swing Solution: On-Demand Workforce for Schools**\n\nSwing Education's platform, SwingSubs, provides a seamless solution for connecting schools with a vetted pool of high-quality substitute teachers. For schools, this means easy access to reliable substitutes, eliminating the stress of last-minute coverage. For substitutes, Swing offers flexibility and autonomy, allowing them to choose when and where they want to teach.\n\n**Results and the Bigger Picture**\n\nBy leveraging technology in this way, Swing saves schools both time and money, enabling them to concentrate on improving full-time teaching staff and enhancing educational outcomes. Rather than being at the mercy of unexpected absences, schools can maintain continuity in learning, and substitutes can enjoy a more manageable work-life balance while making a meaningful impact in classrooms.\n\n**Quick Facts:**\n- **Location:** San Mateo, CA\n- **Team Size:** 52 employees\n- **Founded:** 2015\n- **Website:** [Swing Education](http://www.swingeducation.com)\n\nBy creating a tech-enabled marketplace that simplifies the hiring of substitute teachers, Swing Education represents a promising evolution in the educational landscape. Looking towards the future, they are poised to continue refining and expanding their services to meet the changing needs of schools and educators alike.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/66eeb30acd01f7086d043f84d1001e869b6f4c9a.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192000Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=74cc84164a4c7413b7ef9a68c30ab4645b26fea101cee75a8e06f85129ffd25d",
    "social_links": [
        "https://www.crunchbase.com/organization/swing-education"
    ],
    "logo_path": "data/logos\\Swing_Education_logo.png"
}