{
    "links": "https://www.ycombinator.com/companies/synapticure",
    "name": "Synapticure",
    "headline": "We deliver personalized medicine for neurodegenerative  patients",
    "batch": "S20",
    "description": "Personalized virtual clinical care is finally here for neurodegenerative diseases like Alzheimer's and related Dementias (Cognitive), Parkinson's and Huntington's (Movement), and ALS (Movement).\r\n\nWe provide a novel approach to care in these diseases, centering a patient and caregiver around a coordinator who quarterbacks patients through our full Multi-Disciplinary Care Resources to local aid, PT/OT and home health support. When you leave our clinic, it's not with a handful of paper referrals, but with our coordinators helping you book and find the best physicians, DME, trials, and even cheapest prescriptions. We are devoted to helping patients, from guidance on care and insurance to providing the full spectrum of investigational and clinical testing to improve outcomes. \r\n\nSynapticure was built by leading patient and caregiver advocates alongside leading  clinicians, biotech executives and telemedicine executives to bring the neurodegenerative disease care and treatment experience into the 21st century, and is backed by the leading Venture funds and Angel investors in the remote health and life sciences space.",
    "activity_status": "Active",
    "website": "http://www.synapticure.com",
    "founded_date": 2019.0,
    "team_size": 35.0,
    "location": "Chicago, IL",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:health-tech; industry:telehealth; industry:digital-health; industry:healthcare; industry:mental-health",
    "founders": [
        {
            "name": "Peter Wallach, Founder",
            "description": "Founder / Founding CEO, SynaptiCure Inc. Eternal optimist. Recovering Bain consultant and avid baseball fan.",
            "linkedin": "https://www.linkedin.com/"
        },
        {
            "name": "Brian Wallach, Founder",
            "description": "Brian Wallach is an attorney and ALS patient. In the aftermath of his diagnosis in November 2017, he and his wife founded I AM ALS, a patient-led, patient-centric movement to lead the fight for a cure to the disease. Wallach is also an associate at the law firm Skadden, Arps, Slate, Meagher & Flom LLP. From 2014 to 2018, he served as an assistant United States attorney in the Northern District of Illinois. From 2011 to 2013, he was senior vetting counsel in the Obama White House.",
            "linkedin": "https://www.linkedin.com/in/brian-wallach-351b79171"
        },
        {
            "name": "Martina de Majo, Founder",
            "description": "Martina is the director of research and development at Synapticure and she focuses on creating iPSC derived in vitro models to study neurodegenerative disorders. Martina received an undergraduate degree in biotechnology and a Master's degree in pharmaceutical biotechnology from the University of Rome \"La Sapienza\" (Italy), she then earned a PhD in clinical neuroscience from King's College London (UK) and deepened her knowledge of iPSC derived modelling in her postdoc at UCSF (US)",
            "linkedin": "https://www.linkedin.com/in/martina-de-majo-3478554a"
        }
    ],
    "status": true,
    "generated_description": "**Synapticure: Revolutionizing Neurodegenerative Care**\n\nFounded in 2019 and accelerated through Y Combinator's Batch S20, Synapticure is on a mission to redefine how neurodegenerative diseases are managed. Based in Chicago, IL, this health-tech startup focuses on providing personalized virtual clinical care for patients experiencing conditions such as Alzheimer's, Parkinson's, Huntington's, and ALS.\n\n### What Makes Synapticure Different?\n\nSynapticure offers a holistic and integrated approach to patient care. When you engage with them, you don't just receive referrals; you gain access to a personal care coordinator who will assist you in navigating the healthcare maze. This person—be it a nurse or social worker—will help you book appointments, locate specialized physicians, participate in clinical trials, and find the best medication pricing. The goal? To streamline the often overwhelming healthcare experience for both patients and their caregivers.\n\n### A Team Built on Real Experience\n\nWhat sets Synapticure apart is its leadership duo: Brian Wallach and Sandra Abrevaya, who have been living with ALS for over six years. Their personal experience as advocates in the healthcare space informs the very structure and mission of Synapticure. The team, which comprises 35 dedicated employees, collaborates closely with leading patient and caregiver advocates, clinicians, and biotech experts to ensure that their offerings remain deeply relevant and impactful.\n\n### Key Services Offered\n\n- **Personalized Neurodegenerative Care**: Tailored telehealth sessions for Alzheimer's, Parkinson's, Huntington’s, and ALS.\n- **Care Coordination**: Comprehensive support that includes clarifying insurance processes and facilitating genetic testing.\n- **Access to Clinical Trials**: Synapticure's neurologists are equipped to guide patients through investigational therapies to potentially improve outcomes.\n- **Payer Partnerships**: By collaborating with providers such as Pearl Health, Synapticure is expanding access to affordable care across the United States, while recognizing the importance of supporting caregivers as well.\n\n### Why Telehealth Works Here\n\nIn a landscape where traditional health systems often fail to meet the needs of neurodegenerative patients—frequently bookending support with long waits and inconsistent communication—Synapticure stands out. They promise quick, no-cost virtual consultations, 24/7 availability, and a commitment to treating patients with empathy and understanding. \n\nAccessible in all 50 states and accepting most insurance plans, Synapticure is a vital resource for both patients and families looking for support in managing complex health needs.\n\n### Explore More\n\nIf you're interested in Synapticure's services or would like to learn more about this innovative healthcare model, you can visit their website at [Synapticure](http://www.synapticure.com). Here, you can schedule consultations and discover an array of resources aimed at enhancing the lives of those dealing with neurodegenerative diseases.\n\n**In a world where the healthcare experience can feel disjointed and impersonal, Synapticure stands as a future-forward solution, making personalized care not just an ideal but a reality.**",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/0af2f63e3017cc4039490cb3a336ba9ee86efe82.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192001Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=1c957d9dd4fab22f2776a6bb6b6757c1700ef534d6272b99ee8c404758ae0949",
    "social_links": [
        "https://www.linkedin.com/company/71207928/admin/",
        "https://twitter.com/synapticure",
        "https://www.facebook.com/synapticure"
    ],
    "logo_path": "data/logos\\Synapticure_logo.png"
}