{
    "links": "https://www.ycombinator.com/companies/sync-2",
    "name": "sync.",
    "headline": "AI lipsync tool for video content creators",
    "batch": "W24",
    "description": "at sync. we're making video as fluid and editable as a word document\r\n\nhow much time would you save if you could *record every video in a single take?*\r\n\nno more re-recording yourself because you didn't like what you said, or how you said it.\r\n\njust shoot once, revise yourself to do exactly what you want, and post. that's all.\r\n\nthis is the future of video: *AI modified >> AI generated*\r\n\nwe're playing at the edge of science + fiction.\r\n\nour team is young, hungry, uniquely experienced, and advised by some of the greatest research minds + startup operators in the world. we're driven to solve impossible problems, impossibly fast.\r\n\nour founders are the original team behind the open sourced wav2lip — the most prolific lip-sync model to date w/ over 10k+ GitHub stars.\r\n\nwe \r\n[1] train state-of-the-art generative models, \r\n[2] productize + host them for scale\r\n[3] grow virally through content\r\n[4] upsell into enterprise",
    "activity_status": "Active",
    "website": "https://sync.so/",
    "founded_date": 2023.0,
    "team_size": 13.0,
    "location": "San Francisco",
    "group_partner": "Nicolas Dessaigne",
    "group_partner_yc": "https://www.ycombinator.com/people/nicolas-dessaigne",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Prady Modukuru, Founder",
            "description": "ceo & cofounder at sync. labs | product engineer obsessed w/ networks of people + products.\n\nbefore startups, I helped incubate, launch, and scale AI-powered cybersecurity products at Microsoft impacting over 500M consumers + $1T worth of publicly traded companies – and became the youngest product leader in my org.",
            "linkedin": "https://linkedin.com/in/prady-modukuru"
        },
        {
            "name": "Prajwal K R, Founder",
            "description": "Co-founder & Chief Scientist at sync. labs. Ph.D. from University of Oxford with Prof. Andrew Zisserman. Authored multiple breakthrough research papers (incl. Wav2Lip) on understanding and generating humans in video.",
            "linkedin": "https://www.linkedin.com/in/prajwalrenukanand/"
        },
        {
            "name": "Rudrabha Mukhopadhyay, Founder",
            "description": "I am the co-founder and CTO of Sync Labs. At Sync, We’re building audio-visual models to understand, modify, and synthesize humans in video. I am one of the primary authors of Wav2Lip, one of the most prolific lip syncing models in the world published in 2020. I have done my PhD at IIIT Hyderabad on Audio-visual deep learning and have been involved in several important projects in the community.",
            "linkedin": "https://linkedin.com/in/rudrabha"
        },
        {
            "name": "Pavan Reddy, Founder",
            "description": "Driving Sales/Operations and Finance/ Strategic roadmap at sync. 2x VC backed entrepreneur. IIT Madras Alumnus. Worked with IIIT Hyderabad in productising research work as per market orientation. Key strength is connecting dots/ identifying patterns across different fields to unlock the value",
            "linkedin": "https://linkedin.com/in/pavan-reddy-8bb85a67"
        }
    ],
    "status": true,
    "generated_description": "**Company Overview: sync.**\n\n**Mission:** At sync., our mission is ambitious yet simple: we aim to transform how video content is created by providing an AI lip-sync tool that makes the process as fluid and editable as writing a document.\n\n**Vision:** Imagine never having to re-record a video because of a small mistake. With sync., creators can record their content in a single take, refine it using our advanced AI capabilities, and publish it without the hassle of multiple takes. This is the future we're proposing: transitioning from AI-modified content to entirely AI-generated outputs, merging the realms of science and fiction.\n\n**Founders and Team:** Founded in 2023 and as part of Y Combinator Batch W24, sync. is led by a youthful and dynamic team of 13 employees, including the pioneering minds behind the open-sourced wav2lip, a cutting-edge lip-sync model that's already made waves with over 10,000 stars on GitHub. We pride ourselves on our blend of youthful energy and unique expertise, supported by noteworthy advisors from the research and startup communities.\n\n**Core Offerings:**\n1. **Generative Models:** We train state-of-the-art generative models to enhance video content.\n2. **Scalable Products:** We focus on productizing these models while ensuring they are accessible and scalable.\n3. **Viral Growth:** Our approach encourages viral growth through engaging content creation.\n4. **Enterprise Solutions:** We provide upselling opportunities for enterprise-level clients.\n\n**Key Features:**\n- **Instant Lip-Syncing:** With our technology, users can sync lips from any video to any audio seamlessly, creating natural and accurate results.\n- **Global Reach:** Say goodbye to language barriers! Our tool allows content creators to translate and lip-sync their videos in over 100 languages.\n- **Innovative Tools:** As part of our upcoming features, we’re launching a transcript-based real-time editing tool that allows users to change and edit previous footage without re-recording.\n\n**Location:** Sync. is based in San Francisco and is strategically positioned in the vibrant Bay Area tech scene.\n\n**Join Us:** Whether you're a content creator, podcaster, or running a faceless YouTube channel, sync. empowers your creativity and expands your global reach. We're reshaping the future of video creation, making it effortless and accessible for everyone. \n\nFor more details, explore our [website](https://sync.so/) and step into the future of video content creation!",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/aecc8b90e09e533f6c53ec551e18218371a23d66.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192001Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=54b8c5bd5cfa7abf5634509063574e5ebbd99643d23d301c76672b793779c60c",
    "social_links": [
        "https://www.linkedin.com/company/synclabs-ai/",
        "https://twitter.com/synclabs_so",
        "https://github.com/synchronicity-labs"
    ],
    "logo_path": "data/logos\\sync._logo.png"
}