{
    "links": "https://www.ycombinator.com/companies/tab",
    "name": "Tab",
    "headline": "Revolutionising the way travellers discover, plan and book a trip",
    "batch": "W15",
    "description": "At Tab, we’re revolutionising the way travellers discover, plan and book a trip.\r\n\nThe Guide lets travellers find and book anywhere — with helpful recommendations from friends & local experts, rather than bland listings with endless reviews. Planning your trip should be a joy, not a chore! We help people to travel responsibly, by booking direct instead of using traditional booking sites. Travellers get the best price and they help local businesses avoid unnecessary fees. \r\n\nTravel experts, content creators and the friends you always ask for recommendations can use The Guide to showcase their favourite places to stay and things to do. When you book one of their recommendations, you’ll get a discount from the business and they receive bonus credit to say thanks.\r\n\nThe Tab platform gives independent tourism businesses the tools to improve their online presence, be discovered, take direct bookings — and also to take payments. Our payment platform is uniquely designed for tourism businesses, handling over 100 currencies natively, and every payment type securely and easily.\r\n\nAs travel returns after a difficult period, it’s time for a fresh approach. That’s why we’re building a social commerce platform for tourism — helping to spread the benefits of tourism far and wide, and helping travellers make the most of their precious time abroad. \r\n\nWe're headquartered in London, and backed by Y Combinator (the investors behind Airbnb, Dropbox and Stripe).",
    "activity_status": "Active",
    "website": "https://www.tab.travel",
    "founded_date": 2015.0,
    "team_size": 9.0,
    "location": "London, United Kingdom",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:marketplace; industry:travel",
    "founders": [
        {
            "name": "Mark Datta, Founder/CEO",
            "description": "Mark worked in the finance industry, and at travel and fintech startups before founding Tab. He has an MBA from Harvard Business School.",
            "linkedin": "http://uk.linkedin.com/in/markdatta"
        }
    ],
    "status": true,
    "generated_description": "**Company Overview: Tab**\n\nTab, founded in 2015 and based in London, is on a mission to revolutionize the travel experience by changing the way people discover, plan, and book their trips. They’re tackling a common pain point: travel planning should be fun, not cumbersome. Instead of drowning in generic listings and endless reviews, travelers can use Tab’s platform, *The Guide*, to find places based on recommendations from friends and local experts. \n\n### Key Features:\n\n1. **The Guide**: This feature allows travelers to easily uncover and book local businesses with trusted recommendations, ensuring that the process is as enjoyable as the journey itself. By booking directly through the platform, they not only save money but also support local businesses by avoiding traditional booking fees.\n\n2. **Social Commerce**: Tab harnesses the power of social connections by letting travel experts and friends showcase their favorite spots. When someone books one of these recommended places, they often receive a discount, and the recommender earns a bonus.\n\n3. **Payment Solutions**: Tab offers a robust payment platform tailored for the tourism sector, handling transactions in over 100 currencies. This service simplifies everything from direct bookings to payment collection for tourism businesses, helping them enhance their online presence and connect with customers directly.\n\n4. **No More Commissions**: With Tab, travelers can book without incurring additional fees, and businesses can enjoy direct relationships with their customers.\n\nTab is backed by Y Combinator, a notable accelerator from which companies like Airbnb and Stripe emerged. This investment signals strong belief in Tab’s potential to reshape the travel industry.\n\n### The Team and Growth:\n\nCurrently, Tab employs a small yet nimble team of nine dedicated individuals. Their size allows them to maintain agility while pursuing their goal of providing an innovative travel experience.\n\n### Conclusion:\n\nAs travel regains its footing post-pandemic, Tab stands out with a fresh, appealing approach. By merging technology with the joys of travel exploration and local community support, they're paving the way for a new standard in travel planning. Travelers looking to make the most of their adventures should consider checking out what Tab has to offer at [tab.travel](https://www.tab.travel). \n\nIn essence, Tab is more than a marketplace; it’s a movement aimed at bringing joy back to travel through human connections and responsible practices.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/d3e507854d3a5e8441ab9a8ce813003039f950bd.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192003Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=3917e1950e358fd8139c84e3f4cbe60a62f1df1a0cdaa0cf94f3fa30654d3c4d",
    "social_links": [
        "https://www.linkedin.com/company/9397300/",
        "https://twitter.com/Tab_HQ",
        "https://www.crunchbase.com/organization/tab-5"
    ],
    "logo_path": "data/logos\\Tab_logo.png"
}