{
    "links": "https://www.ycombinator.com/companies/tablevibe-co",
    "name": "Tablevibe",
    "headline": "All-in-one digital ordering system for restaurants",
    "batch": "S21",
    "description": "We are on a mission to help restaurants go direct-to-consumer. Our direct online ordering system enables eateries to easily start their own webshop and sell directly to dine-in, pickup, and delivery customers without the high commission fees of third-party apps.\r\n\nOur system automatically books drivers from Uber, Doordash, Grab, Foodpanda and Lalamove for a low distance-based fee. In total, restaurants save up to 80% and build their own customer database by processing orders with Tablevibe.\r\n\nWe offer more than just an ordering system. We're creating an ecosystem around digital ordering and leveraging customer insights to maximise sales. Our solutions include innovative cashback programs, referral incentives, and marketing campaigns, combined with a singular platform to manage all online orders and menus. Plus, our feedback surveys are pivotal in growing customer satisfaction and online reviews.\r\n\nBacked by Global Founders Capital, Y Combinator, and Velocity Ventures, we’re here to redefine your restaurant’s future. Join the thousands of restaurants who are thriving with us by booking a call with one of our restaurant experts at tablevibe.co/democall or by contacting our team via hello@tablevibe.co.",
    "activity_status": "Active",
    "website": "https://www.tablevibe.co",
    "founded_date": 2020.0,
    "team_size": 10.0,
    "location": "Singapore, Singapore",
    "group_partner": "Brad Flora",
    "group_partner_yc": "https://www.ycombinator.com/people/brad-flora",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:saas; industry:e-commerce; industry:food-tech; industry:retail",
    "founders": [
        {
            "name": "Jeroen Rutten, Founder",
            "description": "With 6.5 years of product leadership experience at Google in Dublin, Singapore and Amsterdam, and with a passion for digital product development and entrepreneurship I started Tablevibe.co. \n\nTablevibe is the one-stop platform to help restaurants grow. We do this through smarter booking features, capturing guest experiences, and driving loyalty and online reputation.",
            "linkedin": "https://www.linkedin.com/in/jeroen-rutten-60499921/"
        },
        {
            "name": "Guido Caldara, Founder",
            "description": "CTO @ tablevibe.co\n\nTech enthusiast, developer and coding teacher with a management background @ Decathlon. \nI've spent the last few years teaching others how to code by sharing my passion with students from all over the world @ Le Wagon coding school.\n\nI'm in love with building tech products, addicted to ultramarathons and always ready to embrace new challenges.",
            "linkedin": "https://www.linkedin.com/in/guidocaldara/"
        },
        {
            "name": "Mathieu Sneep, Founder",
            "description": "Co-founder and head of growth @ tablevibe.co. \n\nI love and live internet businesses. I have ≈10 years of sales and people management experience at both start-ups and multinationals (Google, AdRoll, Fyber) in Europe and Asia.\n\nTrying to live by this motto: ”Twenty years from now, you will be more disappointed by the things you didn’t do than by the ones you did do. Explore. Dream. Discover.\"",
            "linkedin": "http://linkedin.com/in/mathieusneep"
        }
    ],
    "status": true,
    "generated_description": "**Company Overview: Tablevibe**\n\nFounded in 2020 and based in Singapore, Tablevibe is revolutionizing the way restaurants connect with their customers through a comprehensive digital ordering system. This innovative platform began with a mission to enable restaurants to sell directly to consumers, bypassing high commission fees typically associated with third-party delivery apps.\n\n**What They Do:**\nTablevibe's system not only facilitates direct online orders for dine-in, pickup, and delivery but also integrates with established delivery services like Uber Eats, DoorDash, and Foodpanda, automatically assigning drivers as needed for a modest distance-based fee. This can result in restaurants saving up to 80% on delivery costs, while also giving them the power to build their own customer databases — a valuable asset in today’s market.\n\n**Features and Benefits:**\nTablevibe offers an all-in-one ecosystem designed to enhance the digital ordering experience. Their suite of services includes:\n- **Cashback Programs & Referral Incentives:** Encouraging repeat business through targeted marketing strategies.\n- **Customer Feedback Surveys:** Gathering insights to improve customer satisfaction and boost online reviews.\n- **Single Platform Management:** A centralized system to handle all online orders and menu updates.\n\nUnlike traditional systems, Tablevibe charges no setup or fixed fees and works on a zero percent commission model, positioning itself as a cost-effective solution for restaurants of all sizes.\n\n**Investment and Growth:**\nBacked by reputable investors including Y Combinator and Global Founders Capital, Tablevibe is scaling quickly. With a team of around 10 passionate employees, they are committed to helping thousands of restaurants grow their sales, cut costs, and manage customer relationships effectively.\n\n**Final Thoughts:**\nIn an era where digital transformation is crucial, Tablevibe provides restaurants with the tools they need to thrive independently. If you're curious to see how this might work for your establishment, consider booking a demo or reaching out to their team at hello@tablevibe.co. Discover more on their website at [Tablevibe.co](https://www.tablevibe.co).\n\n---\n\nIf you're a restaurant looking for a way to enhance customer experience and profitability, Tablevibe could be the partner you’ve been waiting for.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/e1eab58ed383d1f443592efd1389b0cfb76d0bcb.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192003Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=b126635916d4fc6c0bd1e436d4b60f25dcafbaf3a44b7d464e908a0a6a5ea76a",
    "social_links": [
        "https://www.linkedin.com/company/tablevibe",
        "https://www.crunchbase.com/organization/tablevibe-co"
    ],
    "logo_path": "data/logos\\Tablevibe_logo.png"
}