{
    "links": "https://www.ycombinator.com/companies/tailor",
    "name": "Tailor",
    "headline": "Highly Customizable Headless ERP",
    "batch": "S22",
    "description": "Tailor is a backend platform that helps enterprises build their custom, enterprise grade ERP applications with less code.\r\n\n**Team**\r\n\nYo and Misato have previously built a retail-tech company together and sold it for $20M to Rakuten. Yo is a three-time-acquired serial entrepreneur with a McKinsey background. Misato is a previous head of R&D at Mercari.\r\nTailor is the first YC company fully based in Japan.\r\n\n**The Problem**\r\nIn today's business world, old ERP systems just don't keep up.\r\n\nTheir monolithic architecture makes it difficult for developers to tailor to the specific needs, even though that's what the enterprises want for ERP. \r\n\nAt the same time, legacy ERPs struggle to work well with the variety of cloud-based tools that modern businesses rely on.\r\n\nLegacy, monolithic systems make it very difficult to customize and hard to integrate. Every time the company wants to change something, it becomes a huge project.\r\n\nBuilding on these challenges, users of old ERP systems often face:\r\n* Hard-to-Use Interfaces: The screens and menus are old school... confusing, slowing down your work.\r\n* Wrong Set of Features: Too many unnecessary options for you and not enough of what you actually need.\r\n* Lack of Transparency: It's tough to understand what's happening behind the scenes.\r\n* High Cost: The expense of maintaining these systems eats into your budget.\r\n\n**The Solution**\r\n\nWhy Headless?\r\n\n- With our headless product, the frontend is easy to customize for clients\r\n- API-first approach makes it easy to connect with other existing systems or 3rd party services\r\n\nWhat does it mean to our clients?\r\n\n- Faster development\r\n- Reduced maintenance cost\r\n- Well-documented backend APIs\r\n\nTailor’s key capabilities:\r\n\n- GraphQL endpoint for flexible frontend development\r\n- Customizable data model templates to describe complex business logic of large enterprises\r\n- Customizable workflows depending on the client's specific business process\r\n- Directory service that can reflect complex organizational structure (e.g. matrix organization) to the workflow",
    "activity_status": "Active",
    "website": "https://www.tailor.tech/",
    "founded_date": 2021.0,
    "team_size": 25.0,
    "location": "Tokyo, Japan",
    "group_partner": "Nicolas Dessaigne",
    "group_partner_yc": "https://www.ycombinator.com/people/nicolas-dessaigne",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:developer-tools; industry:saas; industry:b2b; industry:api; industry:enterprise",
    "founders": [
        {
            "name": "Yo Shibata, Founder",
            "description": "Yo Shibata is co-founder/CEO of Tailor. Previously, Yo founded Smapo (Acquired by Rakuten, RetailTech), Shoppi (Acquired by IMJ, mobile app),  co-founded Funds (FinTech), and Watashikampo (HealthTech). Prior to being a serial entrepreneur, he worked for McKinsey.",
            "linkedin": "https://www.linkedin.com/in/yo-shibata-12742621/"
        },
        {
            "name": "Misato Takahashi, Founder",
            "description": "Co-founder/CTO of Tailor, previously co-founder/CTO of Speee (TSE IPO in 2020), CTO of Spotlight (Acquired by Rakuten), engineer at Rakuten and GREE, and head of R4D, a research institute at Mercari.",
            "linkedin": "https://www.linkedin.com/in/mistat/"
        }
    ],
    "status": true,
    "generated_description": "## Tailor: The Future of ERP\n\n### Overview\nTailor is transforming the landscape of Enterprise Resource Planning (ERP) with its highly customizable headless platform. Founded in 2021 and based in Tokyo, Japan, Tailor emerged from Y Combinator's Batch S22 as the first fully Japan-based startup in the accelerator's history.\n\n### The Founders\nThe driving force behind Tailor, Yo and Misato, aren't new to the entrepreneurship scene. They previously co-founded a retail-tech venture that was acquired by Rakuten for a cool $20 million. Yo is a seasoned entrepreneur with three successful exits under his belt, boasting experience from McKinsey. Misato brings a wealth of knowledge from her tenure as head of R&D at Mercari. Together, they combine deep industry insight with a knack for building successful tech solutions.\n\n### The Problem: Legacy ERPs\nIn a world where speed and adaptability are paramount, traditional ERP systems simply fall short. Their rigid monolithic architecture is a significant barrier, making it challenging for businesses to customize and integrate the systems with various cloud-based tools. Using outdated ERPs, companies are often bogged down by:\n- Clunky interfaces that frustrate users.\n- Feature sets that miss the mark—overloaded with unnecessary tools but lacking essential functionalities.\n- A lack of transparency that complicates issue resolution.\n- Exorbitant costs which strain budgets and resources.\n\n### The Solution: A Headless ERP\nEnter Tailor's headless ERP model, which allows clients to easily customize the frontend while maintaining a powerful backend. This API-first approach ensures seamless integration with existing systems, enabling businesses to rapidly evolve without the need for extensive overhauls. \n\nHere’s what Tailor offers:\n- **Faster Development**: Custom applications can be developed in days instead of months, thanks to an intuitive customizable platform.\n- **Reduced Maintenance Costs**: A well-documented backend and API framework mean less time and money spent on upkeep.\n- **Key Capabilities**:\n  - GraphQL endpoints for flexible frontend customization.\n  - Templates for complex business logic tailored to large enterprises.\n  - Workflow management that aligns with specific business processes.\n  - A directory service to mirror intricate organizational structures.\n\n### Why Tailor Stands Out\nTailor is built to respond to the complexities of modern enterprises without the headaches of yesteryear's systems. Its commitment to customization aligns perfectly with the needs of businesses looking to streamline operations and accelerate innovation. Importantly, Tailor isn’t just flexible; it’s also secure, with SOC2 certification ensuring that sensitive enterprise data is protected.\n\n### Get Involved\nFor those ready to ditch their outdated ERP systems and embrace the future, Tailor makes it easy to start customizing an ERP that actually fits your business model. Their platform supports various use cases, making it easier to adapt as your needs change.\n\nIf you’re interested in transforming your ERP experience, consider [getting a demo](https://www.tailor.tech/</demo>) or [joining the waitlist](https://www.tailor.tech/<https:/omakase.framer.website/>).\n\n#### Explore More\nTo learn more about Tailor and its offerings or to keep up with their latest developments and resources, check out their [website](https://www.tailor.tech/) or dive into their [blog](https://www.tailor.tech/</blog>) for insights on ERP systems and more.\n\nIn a world that's constantly evolving, Tailor is not just keeping pace but redefining what’s possible in enterprise technology.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/72fb9c2a16cd74a9ba181f7d1a78178436d1a69b.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192004Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=8a9940ff519bcf1bada93ba674f01820efc4a6a600ca6e0797a9a977dcd8940e",
    "social_links": [
        "https://www.linkedin.com/company/76263236/",
        "https://www.crunchbase.com/organization/tailor-a768",
        "https://github.com/tailor-platform"
    ],
    "logo_path": "data/logos\\Tailor_logo.png"
}