{
    "links": "https://www.ycombinator.com/companies/tajir",
    "name": "Tajir",
    "headline": "The one-stop shop for mom-and-pop stores in Pakistan to buy inventory.",
    "batch": "W20",
    "description": "In Pakistan, stores struggle to buy inventory. Stores waste hours dealing with dozens of suppliers and wait passively for salesmen to visit their stores. Deliveries are often late, incorrect, or never arrive at all. Stores often learn prices at the point of delivery and cannot compare across different suppliers.\r\n\nTajir solves this by offering a one-stop shop for all inventory purchasing with low prices, huge selection, and the convenience of 24/7 ordering with next-day delivery.\r\n\nMom-and-pop stores are the arteries of Pakistan's economy. Through empowering them with world class logistics & information tools, Tajir aims to refactor and simplify Pakistan's retail economy.",
    "activity_status": "Active",
    "website": "https://tajir.app",
    "founded_date": 2019.0,
    "team_size": 50.0,
    "location": "Lahore, Pakistan",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:marketplace; industry:b2b",
    "founders": [],
    "status": true,
    "generated_description": "**Tajir: Revolutionizing Inventory for Pakistan's Mom-and-Pop Stores**\n\n**Overview:**  \nTajir is a groundbreaking company based in Lahore, Pakistan, founded in 2019 as part of Y Combinator’s W20 batch. Its mission? To empower mom-and-pop retail stores across the country by streamlining their inventory purchasing process. It's designed to be a one-stop-shop for store owners tired of the chaos that comes with juggling multiple suppliers.\n\n**The Problem:**  \nIn Pakistan, small retail stores often face significant hurdles when sourcing inventory. Imagine spending hours dealing with numerous suppliers, enduring the frustration of late or incorrect deliveries, and receiving prices only at the point of delivery— all of which stifles both efficiency and profitability. This inefficiency can be crippling, especially for the backbone of the economy—these small shops.\n\n**The Solution:**  \nTajir offers a comprehensive platform that simplifies this arduous process. With a vast selection of products available at competitive prices, store owners can place orders 24/7 and enjoy next-day delivery. No more waiting around for salesmen or dealing with last-minute price changes. Tajir ensures transparency and speed, offering a user experience that feels modern and efficient.\n\n**Key Features:**  \n- **24/7 Ordering:** Store owners can place orders at their convenience without the limitations of supplier schedules.\n- **Next-Day Delivery:** Instead of waiting days or longer for essential inventory, stores receive their orders promptly.\n- **Transparent Pricing:** Real-time updates mean stores always know current prices, facilitating better comparison and decision-making.\n\n**Why It Matters:**  \nMom-and-pop stores are crucial not just to local communities, but to Pakistan's larger economy. By enhancing their access to inventory and providing first-class logistics and pricing transparency, Tajir is effectively refactoring and simplifying the retail economy. It's a service that not only supports these retailers but also strengthens the entire market.\n\n**Affiliation and Team:**  \nWith a diverse team of 50 employees, Tajir is led by a group that understands the nuances of the retail landscape in Pakistan, with support from partners like Nan.\n\n**Growth and Recognition:**  \nTajir is gaining traction and attention, having been featured in notable publications and receiving investments, including a considerable $17 million Series A round led by Kleiner Perkins. It’s quickly becoming a trusted resource for hundreds of both local and multinational brands.\n\n**Final Note:**  \nFor anyone involved in retail or interested in the evolving landscape of B2B marketplaces, Tajir represents a compelling case study. It's not merely about commerce; it's about transforming an ecosystem. If you're a retailer in Pakistan or just curious, check them out at [Tajir.app](https://tajir.app) and see how they're making waves in the retail sector. \n\n**Contact and Further Information:**  \n- For more insights: [Visit Tajir’s Website](https://tajir.app)  \n- Interested in partnering or selling? [Join the Marketplace](https://tajir.app/sellers)  \n- Have questions? [Contact via Whatsapp](https://tajir.app/<https:/wa.me/924232301497>) or call at +92 42 32301497.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/a964bd6d884c0f41d05a92400d28a93a2db9cf9a.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192004Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=287c990abe3c5b9564002a51dbc0f8eb29b4bd52969ddec51470ee6532672ee9",
    "social_links": [
        "https://www.linkedin.com/company/tajir-app/",
        "https://www.crunchbase.com/organization/tajir"
    ],
    "logo_path": "data/logos\\Tajir_logo.png"
}