{
    "links": "https://www.ycombinator.com/companies/tally-2",
    "name": "Tally",
    "headline": "AI agents for accounting firms",
    "batch": "W25",
    "description": "Tally is building AI agents for accounting firms. Tally agents operate autonomously in a firm’s existing systems, automating repetitive work across accounting, tax, and audit, helping teams be more efficient and focus their efforts on higher risk, more complex work.",
    "activity_status": "Active",
    "website": "https://tallyhq.com",
    "founded_date": 2025.0,
    "team_size": 1.0,
    "location": "San Francisco",
    "group_partner": "Jared Friedman",
    "group_partner_yc": "https://www.ycombinator.com/people/jared-friedman",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:artificial-intelligence; industry:b2b; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Rami Ghanem, Founder",
            "description": "Founder at Tally, building AI agents for accounting firms. Previously product lead at Rippling, driving accounting, spend growth and platform, and global payroll products. Also was product at Compound and DoorDash. Started and exited a payroll software startup before college. Coding since I was 10 years old.",
            "linkedin": "https://www.linkedin.com/in/ramighanem"
        }
    ],
    "status": true,
    "generated_description": "**Tally: Your AI Partner for Accounting Firms**\n\nTally is an innovative startup founded in 2025, based in San Francisco and a proud member of Y Combinator's Batch W25. Its mission? To revolutionize accounting firms with the power of AI. Tally focuses on creating AI agents that seamlessly integrate into existing systems within accounting, tax, and audit departments, automating repetitive tasks to enhance efficiency. With just one employee at the helm, Tally is small but mighty.\n\nThe beauty of Tally's AI agents lies in their ability to operate autonomously, meaning they take over tedious tasks such as financial statement reviews, document checks, and much more. This allows accounting teams to redirect their efforts toward higher-value work—think complex analyses and strategic decision-making—rather than getting bogged down in repetitive processes.\n\nHere's how it works: Tally agents can manage a range of responsibilities from AP reconciliation to trial balance adjustments, essentially acting as an extension of your existing team. They learn from real-time feedback and adapt accordingly, making themselves indispensable. And here's the kicker—they work right where your team already does, whether that's in Microsoft Teams or the Tally portal, without needing any new software or engineering.\n\nBacked by Y Combinator, Tally's cutting-edge technology promises a streamlined review process. The agents prepare deliverables and suggest remediation steps, thereby ensuring that quality is never compromised.\n\nSo if you’re an accounting firm looking to accelerate your processes and increase accuracy while scaling effectively, Tally offers a solution that seems too good to be true but is real and operational. You can check them out at [TallyHQ](https://tallyhq.com) and even join their waitlist to see how they can transform your workflows.\n\nIn a nutshell, Tally is a forward-thinking player poised to reshape how accounting firms approach their day-to-day tasks, combining artificial intelligence with human functionality in a way that could unleash unprecedented productivity in the sector.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/df30f9216aa7ac6182143a4b2547cad9f31cc596.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192005Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=1449517bca1c40b900097e8a3d60201caac6716c428e3d2db67bca952d351074",
    "social_links": [
        "https://www.linkedin.com/company/tallyhq",
        "https://www.twitter.com/tallyapp"
    ],
    "logo_path": "data/logos\\Tally_logo.png"
}