{
    "links": "https://www.ycombinator.com/companies/tall-poppy",
    "name": "Tall Poppy",
    "headline": "Protecting your employees against online harassment",
    "batch": "S18",
    "description": "Tall Poppy is building tools and services to make personal digital safety accessible to everyone. Founded in 2018, we work both proactively to help prevent harassment from escalating, and also provide expert incident response services when people come under attack.",
    "activity_status": "Active",
    "website": "https://tallpoppy.com",
    "founded_date": 2018.0,
    "team_size": 10.0,
    "location": "San Francisco",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:security; industry:hr-tech; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Leigh Honeywell, Founder/CEO",
            "description": "Leigh is the founder and CEO of Tall Poppy, where she helps companies protect their employees from online harassment. She was previously a Technology Fellow at the ACLU, and before that worked at a bunch of tech companies including Slack and Microsoft.",
            "linkedin": "https://www.linkedin.com/in/hypatia/"
        },
        {
            "name": "Logan Dean",
            "description": null,
            "linkedin": "https://www.linkedin.com/in/logan-dean-41b0192"
        }
    ],
    "status": true,
    "generated_description": "**Company Overview: Tall Poppy**\n\n**Mission:**  \nTall Poppy is on a crucial mission: protecting employees from online harassment. The company aims to ensure that digital safety is not just a technical issue but a pivotal aspect of workplace culture.\n\n**Background:**  \nFounded in 2018 and part of Y Combinator’s S18 batch, Tall Poppy set out to equip everyone with tools and services for personal digital safety. Their approach is twofold: proactively preventing harassment from escalating and providing expert response services for those under attack.\n\n**Location & Team:**  \nHeadquartered in San Francisco, Tall Poppy boasts a nimble team of ten dedicated individuals. This focused structure allows for agility and a specialized approach in an ever-evolving digital landscape.\n\n**Services Offered:**  \nTall Poppy provides a spectrum of services tailored to meet the needs of organizations facing online threats. Here are some of the key offerings:\n\n1. **Security Awareness Training:** Equip employees with the knowledge to recognize and mitigate threats.\n2. **Step-by-Step Safeguard Guidance:** Help organizations set up effective protection measures against cyber harassment.\n3. **Incident Response Support:** Assist victims with a seasoned team ready to step in during crises.\n4. **Crisis Resources:** Provide access to essential tools and strategies during acute harassment situations.\n5. **Social Listening and Hate Site Monitoring:** Keep a watchful eye on potential threats emerging online.\n\n**Values:**  \nTall Poppy believes in fostering an environment where employees feel safe and empowered enough to focus on their work without the looming threat of harassment. They argue that the healthier and safer your employees feel, the more effectively your organization can thrive.\n\n**Customer Trust:**  \nProminent names like Crunchyroll, Spotify, and Twitch are among the trusted organizations leveraging Tall Poppy’s services, indicating a robust market presence and trustworthiness.\n\n**Unique Insight:**  \nThe term \"Tall Poppy\" derives from the idiom referring to individuals who excel and are therefore often targeted—like tall poppies cut down in a field. This insight encapsulates the essence of the company: standing up for those who might be singled out for attention, negatively or otherwise.\n\n**Resources for Help:**  \nWhether you’re an employee seeking support or a manager handling a delicate situation, Tall Poppy provides extensive resources, including guides and response mechanisms designed to navigate the complexities of online harassment.\n\n**Conclusion:**  \nOverall, Tall Poppy is not just a service provider; they are advocates for a significant cultural shift towards personal and digital safety in the workplace. They offer not only tools but also the reassurance that someone is in your corner when online threats arise. In today's digital-first world, their work is not just important; it’s essential. \n\nFor more information and to explore how Tall Poppy can support your organization, visit their [website](https://tallpoppy.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/0943008871ea5dfe34eca76efe20365bfc1c00bd.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192005Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=275ec97358ad5930684524dddd7cc7dc99450d2b6268780244beef3b8ed7aa28",
    "social_links": [
        "https://www.linkedin.com/company/tallpoppysecurity/",
        "https://twitter.com/tallpoppyhq",
        "https://facebook.com/tallpoppyhq",
        "https://www.crunchbase.com/organization/tall-poppy"
    ],
    "logo_path": "data/logos\\Tall_Poppy_logo.png"
}