{
    "links": "https://www.ycombinator.com/companies/tandem-2",
    "name": "Tandem",
    "headline": "Marketplace to help companies lease and share office space",
    "batch": "S24",
    "description": "The pandemic reduced office use nationwide by 50%, and tenants have been left to deal with highly inflexible, long term lease agreements that don’t fit today’s office use patterns.\r\n\nThe traditional brokerage model works great for big spaces and long terms. But when you want to talk smaller units, short term lengths, shared and common areas, you’re out of luck. \r\n\nTandem is an AI-enabled office leasing platform. We’re using technology to unlock flexible, month-to-month agreements in quality, ready-to-go spaces.   Our AI co-pilot enables a white-glove-quality B2B office search experience, with a fraction of the human labor typically required.\r\n\nToday we’re serving two primary markets — NY & SF, with hundreds of active Hosts in each.  We’ve helped match more than 100 companies and have seen double-digit month-over-month growth.",
    "activity_status": "Active",
    "website": "https://tandem.space/",
    "founded_date": 2023.0,
    "team_size": 12.0,
    "location": "San Francisco",
    "group_partner": "Dalton Caldwell",
    "group_partner_yc": "https://www.ycombinator.com/people/dalton-caldwell",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:marketplace; industry:real-estate; industry:b2b; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Rafi Sands, Founder",
            "description": "Rafi is Co-Founder & CEO of Tandem. \n\nRafi is an 18-time marathon runner, Guinness World Record Holder, Oaklandian, and former management consultant (one of these things is less exciting than the others…).  He spent two years at Stanford researching the future of the office market after COVID under Professor Nick Bloom.  Read his blog at rafisands.substack.com",
            "linkedin": "https://linkedin.com/in/rafisands"
        },
        {
            "name": "Brendan Suh, Founder",
            "description": "Co-founder @ Tandem",
            "linkedin": "https://linkedin.com/in/brendansuh"
        }
    ],
    "status": true,
    "generated_description": "**Tandem: Redefining Office Leasing in a Post-Pandemic World**\n\nFounded in 2023 and part of Y Combinator’s Batch S24, Tandem is tackling the challenges that have emerged in the office leasing market following the pandemic. With office usage dropping by 50%, many companies find themselves tied to rigid long-term leases that don’t fit the dynamic nature of today’s work environment. Tandem recognized this gap and stepped in to offer a solution.\n\n**What Does Tandem Do?**\n\nTandem is an AI-enabled marketplace that simplifies the leasing and sharing of flexible office spaces. Unlike traditional brokerages that excel with large, long-term contracts, Tandem focuses on smaller units, short-term leases, and shared spaces—an essential service for hybrid teams. Their AI co-pilot facilitates a white-glove client experience, requiring less human intervention, which translates to efficiency and speed.\n\nCurrently operational in two bustling markets—San Francisco and New York City—Tandem has already matched over 100 companies with office spaces and has been experiencing impressive double-digit month-over-month growth. With a lean team of just 12 employees, led by Group Partner Dalton Caldwell, Tandem is poised for substantial impact in the real estate sector.\n\n**Why Choose Tandem?**\n\n1. **Flexibility and Convenience**: They offer month-to-month agreements with the ability to adjust space requirements as teams grow or shrink.\n   \n2. **Ready-to-Use Spaces**: Offices are furnished and ready to move in on day one, eliminating the hassle of setup.\n\n3. **No Hidden Fees**: Clients only pay when they’re happily settled in their new space, allowing for budget clarity.\n\n4. **Responsive Support**: Tandem provides on-demand concierge support to assist with move-ins and post-move queries.\n\n5. **Unique Inventory**: Their marketplace features a variety of unique office spaces that meet diverse team aesthetics and functional needs.\n\nOverall, Tandem represents a significant shift from traditional office leasing methods, making it easier for companies to adapt to the new normal of work. Their innovative approach is not just about finding an office, but about creating a workspace that enhances productivity and aligns with modern work demands.\n\nFor more information, visit their website: [Tandem](https://tandem.space/)",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/c2ab8fa0c9034c81c364bdb4567d71acca40b6cb.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192005Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=98944c14ff726a78a0a826ad21819adacd8bd8a43577df216c6f5c15372685a1",
    "social_links": [
        "https://www.linkedin.com/company/tandemspace",
        "https://x.com/Tandemspace"
    ],
    "logo_path": "data/logos\\Tandem_logo.png"
}