{
    "links": "https://www.ycombinator.com/companies/tank-payments",
    "name": "Tank Payments",
    "headline": "Modern financial infrastructure for the trucking industry.",
    "batch": "S22",
    "description": "Tank Payments is building modern financial infrastructure for the trucking industry. We offer payables automation software for logistics businesses that make hundreds of payments to trucking businesses every day. For trucking businesses, we provide a best-in-class banking platform, designed to meet the unique financial needs of the trucking sector.",
    "activity_status": "Active",
    "website": "https://www.tankpayments.com/",
    "founded_date": 2022.0,
    "team_size": 7.0,
    "location": "Austin, TX",
    "group_partner": "Gustaf Alstromer",
    "group_partner_yc": "https://www.ycombinator.com/people/gustaf-alstromer",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:saas; location:austin",
    "founders": [
        {
            "name": "Dane Cook, Founder",
            "description": "Dane is a co-founder of Tank Payments. Prior to Tank, Dane managed product teams at Amazon. Before that, he worked at a startup building a semantic knowledge graph and a startup that sold data to hedge funds. Dane started his career at a Wall Street investment bank.",
            "linkedin": "https://www.linkedin.com/in/dane-cook-b8402922/"
        },
        {
            "name": "Jad Rahbany, Founder",
            "description": "Jad is a co-founder of Tank Payments. Prior to Tank, Jad was a Software Engineer at Amazon working on the Alexa AI team, and a Product Manager at Google and Graphiq (acq. by Amazon). Originally from Lebanon, Jad graduated from Cornell University with a degree in Computer Science and a minor in Business.",
            "linkedin": "https://www.linkedin.com/in/jadrahbany/"
        },
        {
            "name": "Matthew Rybak, Founder",
            "description": "Matthew Rybak is the co-founder of Tank Payments. Matthew heads factor business development and product at Tank. He started out in financial services (Citigroup), but quickly moved to a tech startup in Santa Barbara CA (FindTheBest/Graphiq), which was acquired by Amazon Alexa AI in 2017. Since departing Amazon, he has started a RE development firm, a website (Truckinfo.net), and Tank Payments. He earned a Bachelors and Masters in Systems Engineering from the University of Pennsylvania.",
            "linkedin": "https://www.linkedin.com/in/matthewrybak/"
        }
    ],
    "status": true,
    "generated_description": "Tank Payments, founded in 2022 and based in Austin, TX, is revolutionizing the financial landscape for the trucking industry. As a member of Y Combinator's Batch S22, their mission is clear: to build a modern financial infrastructure specifically tailored to the unique needs of logistics businesses. With a small but agile team of seven, they’re focused on innovation in a sector that is often overlooked by traditional financial services.\n\nSo, what does Tank Payments offer? They provide payables automation software that streamlines payment processes for logistics companies that handle numerous transactions daily. Trucking businesses benefit from a banking platform built specifically for them—one that offers features and services that traditional banks typically don’t.\n\nIf you’re a freight carrier, Tank Payments provides full-service financial accounts designed around the fast-paced demands of your business. Their solutions enable you to get paid instantly—cheaper than traditional wire transfers and faster than ACH. Additionally, with a no-commitment, no-fee commercial Visa card, they make managing finances not just efficient but also hassle-free.\n\nOn the other side, for factors and brokers, they simplify and automate payments to freight carriers. Their system allows for instant funding to clients without the cumbersome process of uploading files or initiating wires. This innovation not only enhances service offerings but also opens up new revenue streams.\n\nWhat really sets Tank Payments apart is their focus on eliminating friction in the financial transactions of freight businesses. They understand that in this industry, time is money, and their tools are built to ensure that money moves as quickly as the freight itself.\n\nWith endorsements from satisfied customers and partnerships with leading financial technology firms, Tank Payments is not just a service provider; they're a partner in the growth of every trucking business they work with. If you're interested in exploring how they can benefit your operations, check out their website: [Tank Payments](https://www.tankpayments.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/c6645de87c773c721e7063826e794f6e5ddf382f.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192006Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=d2d622fdece1af5a8610df436cc29dd471e71561d72e51b5c40e640d40441469",
    "social_links": [
        "https://www.linkedin.com/company/82513538",
        "https://www.crunchbase.com/organization/tank-payments"
    ],
    "logo_path": "data/logos\\Tank_Payments_logo.png"
}