{
    "links": "https://www.ycombinator.com/companies/tarjimly",
    "name": "Tarjimly",
    "headline": "Translating for Humanity",
    "batch": "W18",
    "description": "Tarjimly is a YC-backed nonprofit (YC W18) that allows anyone to volunteer their language skills to help refugees and immigrants in need.  We connect the world's bilingual speakers with the 23 million refugees struggling to communicate with doctors, lawyers, and NGOs using chat, phone, and video calling.  We're building a new way for the world to help refugees by bridging language gaps.",
    "activity_status": "Active",
    "website": "https://tarjimly.org",
    "founded_date": 2017.0,
    "team_size": 4.0,
    "location": "Mountain View",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:nonprofit; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Aziz Alghunaim",
            "description": "Co-founder at Nash. Prior to Nash, I spent a couple of years building Tarjimly (YC W18), a mobile application to connect refugees with real, volunteer translators all over the world. Before that, I was a software engineer at Palantir working on a number of high-volume data problems. I received my Bachelors and Masters in Computer Science in 2015 from MIT.\n\nI love mission-driven work that is coupled with great technical execution. I am in the Bay Area, and love meeting new people, so say hello :)",
            "linkedin": "https://www.linkedin.com/in/azizkag"
        },
        {
            "name": "Atif Javed",
            "description": null,
            "linkedin": "https://www.linkedin.com/in/atifmjaved/"
        }
    ],
    "status": true,
    "generated_description": "### Tarjimly: Translating for Humanity\n\n**Overview:**\nFounded in 2017 and a proud Y Combinator W18 alumni, Tarjimly is a nonprofit based in Mountain View that has one clear mission: eliminating language barriers for refugees and immigrants worldwide. Their motto, \"Translating for Humanity,\" encapsulates their goal to enable communication for the 23 million refugees who struggle to navigate critical services like healthcare and legal aid.\n\n**How It Works:**\nTarjimly leverages the skills of bilingual volunteers through a free mobile app, connecting them directly with those in need of translation and interpretation support. These interactions occur via chat, phone, or video calls, helping refugees and asylum seekers communicate effectively. Their services are not just limited to individuals; they also cater to NGOs, providing specialized, affordable translation services that prioritize hiring refugees themselves.\n\n**Team and Impact:**\nDespite a small team of four, Tarjimly has managed to make significant strides in humanitarian assistance. They’ve established a community of volunteers ready to assist in real-time, ensuring that vital information reaches the people who need it most. Their recent 2023 Impact Report showcases their growth and the effectiveness of their platform.\n\n**Why Tarjimly?**\n1. **Direct Connection:** Human interpreters can navigate the nuances of conversation, ensuring that critical information isn’t lost—a limitation often found in machine translations.\n   \n2. **Cultural Sensitivity:** The app’s human-driven support helps close cultural gaps, fostering understanding and empathy in sensitive situations.\n\n3. **Flexibility for Volunteers:** Anyone with a smartphone and internet connection can volunteer their time without minimum time commitments. You simply respond to requests as they come in.\n\n4. **Broad Reach:** From refugee camps to resettlement agencies, Tarjimly's services enhance communication across varied humanitarian settings. \n\n**Get Involved:**\nVolunteers are always welcome at Tarjimly, and their need for more bilingual speakers is ongoing. Supporting Tarjimly can happen in several ways—volunteering, partnering, or making a donation.\n\n**Conclusion:**\nIn a world rife with communication barriers, Tarjimly stands as a beacon of hope and understanding. They're not just translating words; they're translating lives and opportunities for a brighter future for refugees worldwide. If you're bilingual and interested in making a tangible impact, Tarjimly is your venue. Check out their work at [tarjimly.org](https://tarjimly.org).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/4425c624a7feda23b858701738d9bebfe5eafb02.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192006Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=91f2221bdd57974f8cd6261bc71505c0f1c0df74e6236483dbf2158d2cb4286a",
    "social_links": [
        "https://www.linkedin.com/company/tarjimly",
        "https://twitter.com/tarjimly",
        "https://fb.com/tarjimlytranslate"
    ],
    "logo_path": "data/logos\\Tarjimly_logo.png"
}