{
    "links": "https://www.ycombinator.com/companies/teabot",
    "name": "teaBOT",
    "headline": "A robot that makes tea!",
    "batch": "S15",
    "description": "teaBOT offers an amenity-as-a-services to offices and showrooms. Your staff and clients will love coming to your space and sharing their custom-made tea blend with colleagues and guests! \r\n\nOffices like Google, HubSpot, and McKinsey use teaBOT as a recruiting and retention tool to have their teams love coming into the office!\r\n\nDetails at www.teabot.com",
    "activity_status": "Active",
    "website": "http://teaBOT.com",
    "founded_date": 2013.0,
    "team_size": 2.0,
    "location": "Toronto, Canada",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:food-service-robots-&-machines; industry:hardware; industry:robotics",
    "founders": [
        {
            "name": "Rehman Merali, Founder",
            "description": "PhD in Robotics. Passionate about helping in the developing world.",
            "linkedin": "https://www.linkedin.com/in/rehmanmerali"
        }
    ],
    "status": true,
    "generated_description": "**teaBOT Overview**\n\nFounded in 2013 and hailing from Toronto, Canada, teaBOT is at the crossroads of technology and hospitality, offering a unique solution that marries the two: a robot that makes tea! This isn't just about brewing; it's about crafting a memorable experience for employees and clients alike.\n\n**Mission and Initial Offering**\n\nAt its core, teaBOT aims to enhance the workplace environment. Initially launched as an amenity-as-a-service product, teaBOT serves offices and showrooms, providing an engaging platform for staff and clients to create custom tea blends. Imagine walking into a space where a friendly robot greets you and brews your personalized tea blend — it's both a talking point and a retention tool. Major players like Google, HubSpot, and McKinsey have already integrated teaBOT into their office culture, using it not just for tea, but as a means to foster connection and team bonding.\n\n**Company Insights**\n\nteaBOT is part of the renowned Y Combinator Batch S15, showcasing its potential in the startup ecosystem. Despite having a lean team of just two employees, the company has made notable strides in the food-service robotics space, focusing on hardware innovation and refining their robotics. \n\nTheir approach stands out by catering to the needs of modern workplaces — in a world of remote work and varying office attendance, teaBOT transforms the typical coffee break into a unique tea experience. Their clients can enjoy creating their own blends in three simple steps: visit a teaBOT, create a blend, and have the robot brew a cup of loose leaf tea.\n\n**Current Offerings and Engagement**\n\nBeyond the robot itself, teaBOT maintains an appealing product line including a selection of premium loose-leaf teas available for purchase. Their blends range from Choco Cherry to Moroccan Mint and are priced affordably at $10. These offerings are easily accessible through their website, and they engage customers with promotions and seasonal blends. \n\nIf you're curious to learn more, visit their website: [teaBOT.com](http://teaBOT.com), or check them out in various high-profile locations that have embraced this innovative tea solution.\n\n**In Conclusion**\n\nteaBOT is not just about the tea; it represents a shift in how companies can deliver value and hospitality in the workplace. By blending robotics with a personal touch, they are redefining office culture, making it more engaging and enjoyable. As they continue to grow, teaBOT is set to make their mark not just in Canada, but globally in the frontlines of food-service robotics.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/5494e9ee4abacb7427cd8ca62e52d76480574c7b.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192008Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=30e5ea9bcf39f9e425e881490e96ab14dc38304a62c6a1ebbf77370a187ef77a",
    "social_links": [
        "https://ca.linkedin.com/company/myteabot",
        "https://twitter.com/myteabot",
        "https://www.facebook.com/myteabot/"
    ],
    "logo_path": "data/logos\\teaBOT_logo.png"
}