{
    "links": "https://www.ycombinator.com/companies/teleo",
    "name": "Teleo",
    "headline": "Supervised Autonomous Heavy Equipment",
    "batch": "W20",
    "description": "Teleo converts heavy equipment, like dozers, trucks, and loaders, into supervised autonomous robots. This enables a single operator to remotely operate multiple machines while sitting at a remote control center, unlocking productivity gains for the General Contractor.",
    "activity_status": "Active",
    "website": "http://www.teleo.ai",
    "founded_date": 2019.0,
    "team_size": 30.0,
    "location": "Palo Alto",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:autonomous-trucking; industry:hard-tech; industry:robotics; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Vinay Shet, Founder",
            "description": "Vinay is the co-founder and CEO of Teleo. Prior to Teleo, he was the Director of Product Management at Lyft working on building Lyft's self-driving cars. Prior to Lyft, Vinay led Product Management at Google Street View, Google Maps, and Google reCAPTCHA launching several consumer products used by millions of users worldwide. Vinay has a Ph.D. in Computer Science, focusing on Computer Vision from the University of Maryland, College Park",
            "linkedin": "https://www.linkedin.com/in/vinayshet/"
        },
        {
            "name": "Rom Clément, Founder",
            "description": null,
            "linkedin": "https://www.linkedin.com/in/romclement/"
        }
    ],
    "status": true,
    "generated_description": "**Teleo: Revolutionizing Heavy Equipment Operations**\n\nTeleo is a pioneering company founded in 2019, nestled in Palo Alto and part of Y Combinator's W20 batch. Their mission is simple yet ambitious: to transform heavy equipment—think dozers, trucks, and loaders—into supervised autonomous machines. This innovation allows a single operator to manage multiple machines from a remote control center, opening the door to breathtaking productivity gains for general contractors. \n\nWhy does this matter? The construction industry has long struggled with labor shortages and safety concerns. Teleo's approach not only modernizes operations but also enhances the overall working environment. Their remote command center offers safer, more comfortable conditions for operators, ultimately making these jobs more appealing and accessible.\n\n**The Full Stack Solution**\nTeleo offers a holistic platform, which features:\n- A **Robust Mesh Network** for seamless connectivity.\n- A **Universal Retrofit Kit** that facilitates adaptation of existing heavy equipment.\n- A **Remote Command Center**, enabling operators to work from a secure location.\n- **Proprietary Software** to manage and analyze operations effectively.\n\nThe results speak for themselves: companies using Teleo’s technology report significant boosts in productivity as one operator can now efficiently supervise several machines instead of one. There's also increased operational visibility thanks to real-time data analytics, which empower better decision-making.\n\n**Client Testimonials**\nTeleo is already making waves globally, with success stories from North America to Europe and even Australia. Clients like Scott Lyons from Tomahawk Construction highlight that Teleo’s technology can get idle equipment back into action, ultimately running a more efficient operation. Meanwhile, Ryan Aarts from John Aarts Group underscores the importance of safety, noting that a more secure setup allows a wider range of people to participate in the industry.\n\n**Growing Recognition**\nSuccess has not gone unnoticed. Teleo has made headlines for its innovative approaches, with features on Fox Business and Equipment World, and has garnered accolades like the Bay Area Inno Award for being one of the nine startups poised to change the world.\n\nIn a nutshell, Teleo is not just about enhancing construction efficiency; it’s about rethinking how heavy machinery is operated in a safer, smarter, and more productive way. As they increasingly embed their solutions into the very fabric of construction operations, they stand to disrupt an industry that has remained largely unchanged for decades.\n\nTo learn more, check out their [website](http://www.teleo.ai) and see how they're driving change in the heavy equipment landscape.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/9e97006c919b7c86c33e7de3cd567c89535d8d72.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192008Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=311d2ca16e5d95f0e14de4d7a16a70194d8fd5790628826201dbb224d22d82ec",
    "social_links": [
        "https://www.linkedin.com/company/teleo-ai",
        "https://www.twitter.com/teleoai",
        "https://www.crunchbase.com/organization/teleo"
    ],
    "logo_path": "data/logos\\Teleo_logo.png"
}