{
    "links": "https://www.ycombinator.com/companies/telivy",
    "name": "Telivy",
    "headline": "Automate your cyber security risk assessments",
    "batch": "S21",
    "description": "Telivy helps small and medium businesses purchase the best cyber insurance coverage. Our proprietary ML-based risk platform assesses insurability gaps, offers remediation plans and brokers insurance quotes from A+ rated carriers.",
    "activity_status": "Active",
    "website": "https://www.telivy.com",
    "founded_date": 2021.0,
    "team_size": 6.0,
    "location": "San Francisco",
    "group_partner": "Gustaf Alstromer",
    "group_partner_yc": "https://www.ycombinator.com/people/gustaf-alstromer",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:security; industry:cybersecurity; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Naren Sathiya, Founder",
            "description": "Naren is interested in the intersection of finance and technology, and views the insurance industry as a data science problem to be optimized on. He joined Hippo Insurance as an early engineer and led its embedded distribution channel with homebuilders, which became over 20% of its revenue within 1.5 years. He hopes to build similar workflows and user experience for the commercial industry, starting with cyber and compliance companies. In his free time, he likes to mountain bike, swim and hike.",
            "linkedin": "https://www.linkedin.com/in/naren-sathiya-01197a19"
        }
    ],
    "status": true,
    "generated_description": "**Telivy: Streamlining Cybersecurity for SMBs**\n\nFounded in 2021 and backed by Y Combinator (Batch S21), Telivy is a San Francisco-based startup that’s shaking up the cybersecurity landscape for small and medium businesses. Its mission? To automate cyber security risk assessments and make it easier for these companies to manage their cybersecurity needs. \n\nInitially, Telivy focused on helping SMBs navigate the often murky waters of cyber insurance. Their proprietary machine learning-based risk platform identifies insurability gaps, provides clear remediation plans, and connects clients with quotes from A+ rated insurance carriers. It’s a one-stop-shop approach, simplifying what can often be an overwhelming process.\n\nAs of now, Telivy boasts a lean team of six and is led by Group Partner Gustaf Alstromer. They've earned trust and recognition in the industry, being relied upon by over 150 Managed Service Providers (MSPs) and virtual Chief Information Security Officers (vCISOs). Their current offerings provide comprehensive risk discovery and attack surface management, covering everything from network vulnerabilities to dark web monitoring.\n\nUsers rave about Telivy’s intuitive dashboard, which aggregates data from various sources, giving cybersecurity professionals the oversight they need without the hassle of juggling multiple tools. For many, it’s become a game-changer that frees them up to focus on critical security operations rather than getting stuck in tedious, time-consuming assessments.\n\nNotably, Telivy is also making strides toward expansion, as evidenced by their recent acquisition by Cytracom. This move reflects not only the platform's value but also the growing need for robust cybersecurity solutions.\n\nFor businesses looking for a reliable partner in cybersecurity risk management, Telivy stands out as an innovative choice. Curious to see how it works? Check out their website to book a demo or start with a free scan: [telivy.com](https://www.telivy.com/).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/90f04e683d430db631156e0e6fd6ecb4c827044f.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192008Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=d82143432b2b7e989d4b1057029bfb197c5e0db589ec719aba9802335720cc96",
    "social_links": [
        "https://www.linkedin.com/company/telivy/",
        "https://twitter.com/TelivyInsurance"
    ],
    "logo_path": "data/logos\\Telivy_logo.png"
}