{
    "links": "https://www.ycombinator.com/companies/ten-lives",
    "name": "Ten Lives",
    "headline": "Decarbonizing food proteins with AI.",
    "batch": "S22",
    "description": "We optimize microbial factories to produce proteins at the lowest possible cost and environmental impact. Our mission is to make sustainable protein sources a cost-viable alternative, for all members of the family.",
    "activity_status": "Active",
    "website": "https://tenlives.com",
    "founded_date": null,
    "team_size": 6.0,
    "location": null,
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": null,
    "founders": [
        {
            "name": "Vicki Mo, Founder",
            "description": "Vicki has experience ranging from finetuning SOTA machine learning models to shipping both digital and physical products. In 2015, she was the USA and French Div 1 National Champion in the sport of epee fencing. Vicki received her MS in Computer Science - Machine Learning from Columbia University.",
            "linkedin": "https://www.linkedin.com/in/victoriamo/"
        },
        {
            "name": "Ruby Yu, Founder",
            "description": "Ruby has spent the past decade investigating gene expression in organisms ranging from yeast to humans, and she is an industry-leading expert on high-throughput genetic screens for machine learning. She received both her BA and her PhD in Biological and Biomedical Sciences from Harvard University.\n\nHer extra-laboratorial activities include circus arts, climbing, and cat-sitting.",
            "linkedin": "http://www.linkedin.com/in/ruby-yu-h3k9"
        }
    ],
    "status": true,
    "generated_description": "**Company Overview: Ten Lives**  \n[**Ten Lives**](https://tenlives.com) is on a mission to decarbonize food proteins using artificial intelligence. The company's initial focus was on optimizing microbial factories to produce sustainable proteins that are both environmentally friendly and cost-effective. This mission aims to make sustainable protein sources accessible for everyone, particularly benefiting pet owners and their animals.\n\n**Founding and Background**  \nFounded in the Y Combinator Batch S22, Ten Lives is a startup that leverages the latest advancements in AI and biotechnology to innovate around food production. While specific founding details are marked as \"nan,\" it’s clear that the company is equipped with a small but dedicated team of six employees.\n\n**What They Do**  \nTen Lives specializes in creating **sustainable snacks for cats** that utilize clean protein derived from microbial fermentation. This process mimics the natural protein found in the diet of wild cats but does so without harming any animals. The company's ultimate goal is to mitigate the significant meat consumption by pets—currently about one-fifth of the world's meat—thereby saving animal lives and reducing carbon emissions equivalent to taking 27 million cars off the road.\n\nTheir product offerings include a range of tasty and health-conscious snacks designed for various cats, appealing even to the most discerning feline palates. Each lickable treat is created with ingredients chosen for their health benefits and sustainability, packaged in eco-friendly materials.\n\n**The Team**  \nThe creative team behind Ten Lives includes Ruby, a seasoned scientist with an impressive background from Harvard and UCSF, and Vicki, an engineer who shares a deep love for cats. Joined by veterinarians and other specialists, this passionate group is committed to delivering the highest quality and healthiest food for pets.\n\n**Future Plans**  \nTen Lives is gearing up for product launches in 2024 and is excited about offering early access to a limited number of snack packs. The company is keen to engage with its audience, emphasizing customer support and community involvement. They even invite cat enthusiasts to reach out for discussions—because who doesn’t love talking about their pets?\n\n**Conclusion**  \nIn a world that’s grappling with sustainability, Ten Lives is positioning itself as an innovative leader in the pet food market. By marrying technology and a love for animals, they strive to create a greener future—one snack at a time. If you're looking for a guilt-free way to treat your cat, keep an eye on Ten Lives; their approach could redefine what it means to feed our furry companions responsibly.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/49c42fcd82db3668ce5413c3718e70772ffe0dba.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192011Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=2d355ac8bd11822cc01fe601227deb7cb779935f34316159f559427a6d937347",
    "social_links": [],
    "logo_path": "data/logos\\Ten_Lives_logo.png"
}