{
    "links": "https://www.ycombinator.com/companies/tenderd",
    "name": "Tenderd",
    "headline": "AI Platform for Efficient and Sustainable Operations",
    "batch": "S18",
    "description": "The platform uses a combination of sensors and machine learning algorithms to increase the efficiency and sustainability of operations in the logistics, energy, and construction sector.",
    "activity_status": "Active",
    "website": "https://www.tenderd.com/",
    "founded_date": 2018.0,
    "team_size": 60.0,
    "location": "United Arab Emirates",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:construction; industry:logistics",
    "founders": [
        {
            "name": "Arjun Mohan, Founder",
            "description": "Arjun started his career as a strategy analyst at a technology company in Toronto, Canada. He later co-founded a software development company building ecommerce marketplaces.\nHe completed his undergrad at the University of Toronto and his Masters at the Richard Ivey School of Business.",
            "linkedin": "https://www.linkedin.com/in/mohanarjun"
        }
    ],
    "status": true,
    "generated_description": "Tenderd is an AI-driven platform founded in 2018, originally emerging as a player in the logistics, energy, and construction sectors. The company is based in the United Arab Emirates and is part of the Y Combinator Batch S18, which shows it’s got the support of a respected incubator program. With a team of around 60 employees, Tenderd is actively working to improve operational efficiency and sustainability in its target industries.\n\nTenderd's mission centers on harnessing the power of AI to create more efficient and sustainable operational processes. Their platform utilizes sensors and machine learning algorithms to optimize equipment and vehicle operations. The services provided include improving fleet utilization, managing fuel consumption, scheduling maintenance, and reducing carbon emissions. They are also focused on profitability, offering a straightforward way for users to meet equipment needs and potentially generate revenue by renting out idle resources.\n\nThe platform caters to various industries, including construction, logistics, energy, and marine, making it versatile enough to work across multiple asset types and brands. Their impressive case studies highlight significant improvements, such as a 20% increase in equipment utilization for a leading UAE construction company and a 38% reduction in emissions for a national oil company.\n\nTenderd is not just about immediate operational gains but also about making a longer-term impact on sustainability. They measure and track carbon emissions to help companies achieve net-zero goals.\n\nIn summary, Tenderd stands out as a forward-thinking player in the realm of AI and operational efficiency, positioning itself as a vital partner in the quest for sustainable industrial practices. If you're in any of the sectors they serve and are looking to enhance your operations while also being mindful of environmental impacts, Tenderd is definitely worth checking out. You can learn more at their website: [tenderd.com](https://www.tenderd.com/).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/c80477e71f63d5fd794522b3076fd299f2b4f199.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192010Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=6eb0615124c2a8d717c736517d7215cc3f784d78f36b479c4df01a95113f25ca",
    "social_links": [
        "https://www.linkedin.com/company/tenderd",
        "https://twitter.com/TenderdTrack",
        "https://www.facebook.com/tenderd",
        "https://www.crunchbase.com/organization/tenderd"
    ],
    "logo_path": "data/logos\\Tenderd_logo.png"
}