{
    "links": "https://www.ycombinator.com/companies/tennr",
    "name": "Tennr",
    "headline": "Turn your healthcare operations into growth",
    "batch": "W23",
    "description": "Tennr is a first-of-its-kind automations platform built to handle the nuances of human-decision making within healthcare operations.",
    "activity_status": "Active",
    "website": "https://www.tennr.com",
    "founded_date": 2021.0,
    "team_size": 44.0,
    "location": "New York",
    "group_partner": "Gustaf Alstromer",
    "group_partner_yc": "https://www.ycombinator.com/people/gustaf-alstromer",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "location:new-york",
    "founders": [
        {
            "name": "Trey Holterman, Founder",
            "description": "Former All-American rower, Computer science major and TA before going to work as a Software engineer at Strava. Left Strava to start a company with my former teammate Diego and former roommate Tyler. \n\nOutside of work, (pre-startup) I did standup whenever I had time",
            "linkedin": "https://www.linkedin.com/in/trey-holterman-09b904153/"
        },
        {
            "name": "Diego Baugh, Founder",
            "description": "Built cool things in undergrad. Then discovered a love for design — turns out I generally like the process of finding patterns — helps me in work and in poker. Also, software should probably be less painful to use than it is ;)\n\nRowed in college, now living in NYC.",
            "linkedin": "https://www.linkedin.com/in/diego-baugh/"
        },
        {
            "name": "Tyler Johnson, Founder",
            "description": "Tyler is the co-founder and CTO at Tennr. He met his co-founders, Trey and Diego, while studying at Stanford, and spent a year working in technical consulting before leaving to work with them. A dedicated midwesterner, he lives in Wisconsin with a lot of dogs!",
            "linkedin": "https://www.linkedin.com/in/tyler-johnson-482a42158/"
        }
    ],
    "status": true,
    "generated_description": "**Company Overview: Tennr**\n\nFounded in 2021 and based in New York, Tennr is a pioneering automation platform focused on optimizing healthcare operations—essentially turning cumbersome processes into engines for growth. Tackling the inefficiencies that plague the healthcare system, Tennr is on a mission to streamline operations so healthcare providers can focus on what truly matters: patient care.\n\n### Key Features\n\nTennr stands out with its proprietary technology called RaeLM™, a vision language model trained on an impressive dataset of over 4 million medical documents and 230 million data fields. This sophisticated model is designed to understand the intricacies of healthcare documentation, making it a powerful tool for automating tasks that typically require human decision-making.\n\nThe platform offers a suite of features that help healthcare operations:\n- **Rapid Patient Processing:** New patients can be registered in just 10 minutes, a stark improvement over the traditional 10-day timeline.\n- **Reduction of Billing Denials:** By catching missing or incorrect documentation upfront, Tennr enables billing teams to work more efficiently, reducing first-time denials by 98%.\n- **Workforce Optimization:** Tennr allows healthcare teams to operate with a fraction of the headcount, significantly increasing productivity without sacrificing quality.\n\n### Customer Impact\n\nTennr is already making waves in the healthcare sector, with testimonials underscoring its transformative impact:\n- **Efficiency Gains:** Healthcare leaders report that Tennr has expedited patient access to care and allowed staff to focus on patient-facing tasks.\n- **Operational Transformation:** Customers have noted that the automation provided by Tennr revolutionizes their workflows, greatly reducing processing times.\n\n### The Team and Support\n\nWith a workforce of 44 employees, Tennr is currently part of Y Combinator's Batch W23 and is guided by Group Partner Gustaf Alstromer. Their focus on innovation and customer-centric solutions positions Tennr not just as a tool but as a partner in the healthcare ecosystem.\n\n### Why It Matters\n\nIf you're finding yourself bogged down by portals, phone trees, or paperwork, Tennr promises a way out. By implementing their cutting-edge automation solutions, healthcare operations can transition from reactive to proactive management, ultimately enhancing patient care and streamlining administrative burdens.\n\nFor those looking to learn more or experience Tennr's solutions firsthand, they offer demos and ongoing webinars, like the recent *Tennr Refresh* series.\n\nWant to explore how you can turn your operations into growth? [Check out Tennr](https://www.tennr.com) and discover the future of healthcare automation.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/0053794d1f31ece31607b791ae3ce20d489d02f2.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192010Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=b738813d2fbd28fe4dfa873942c61f9c7ecd4ac0561e65c087fbd3f5d9aef9f5",
    "social_links": [
        "https://www.linkedin.com/company/tennrai/?viewAsMember=true"
    ],
    "logo_path": "data/logos\\Tennr_logo.png"
}