{
    "links": "https://www.ycombinator.com/companies/tenyks",
    "name": "Tenyks",
    "headline": "Data-Centric Co-Pilot for Computer Vision Engineers",
    "batch": "S21",
    "description": "Tenyks (YC'S21) is a University of Cambridge spin-out inventing the intelligence that powers the AI revolution to protect the world from the Terminator. Imagine Snowflake for Vision, helping ML Engineers build better, safer models, in a faster and more efficient way. \r\n\nSpecifically, our end-to-end platform is CV Engineers' Ultimate Productivity Tool to: \r\n\n1. Automate Data Quality Detection: It streamlines the process of identifying and rectifying data quality issues, ensuring the integrity of your datasets.\r\n2. Accelerate Data Curation: Our platform expedites the curation of similar images and objects, facilitating data collection and balancing.\r\n3. Catalog Vast Datasets: With its flexibility, the platform allows you to efficiently index and catalogue extensive datasets.\r\n4. Seamless CI/CD Integration: Tenyks effortlessly integrates with your CI/CD pipelines, reducing the risk of regressions and enhancing your development workflow.\r\n5. Security & Scalability: Securely orchestrated in the cloud to foster seamless cross-team collaboration and scale to millions of images & hundred of millions of objects. \r\n\nThe founders developed the technology (the result of 9 top-tier publications and a patented invention) during their PhD research in Safe & Explainable AI for Computer Vision.",
    "activity_status": "Active",
    "website": "http://tenyks.ai/",
    "founded_date": 2019.0,
    "team_size": 14.0,
    "location": "Cambridge, United Kingdom",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:aiops; industry:deep-learning; industry:developer-tools; industry:computer-vision; industry:api",
    "founders": [
        {
            "name": "Botty Dimanov, Founder",
            "description": "Botty holds a PhD in Explainable AI from the University of Cambridge. During his studies, he started 4 bootstrapped businesses with little external funding, while publishing 7 papers at Top Tier AI conferences. As the President of the Cambridge University Entrepreneurs Society, Botty turned around the organisation during its worst years to increase the annual KPIs by 50%.",
            "linkedin": "https://www.linkedin.com/in/botty-dimanov/"
        },
        {
            "name": "Dmitry Kazhdan, Founder",
            "description": "Dmitry is finishing his PhD in Explainable AI from the University of Cambridge. During his studies, Dmitry has co-authored over 8 academic papers, and supervised 4 student thesis projects. In addition to his academic expertise, Dmitry has gained relevant industry experience through Software Engineer and Machine Learning Researcher internships at companies such as Arm, Nokia Bell Labs, and Redgate Software.",
            "linkedin": "https://www.linkedin.com/in/dmitry-kazhdan/"
        }
    ],
    "status": true,
    "generated_description": "**Tenyks: Your Data-Centric Co-Pilot for Computer Vision Engineering**\n\nFounded in 2019 as a spin-out from the University of Cambridge and part of Y Combinator's Summer 2021 batch, Tenyks is at the forefront of revolutionizing how computer vision engineers manage and utilize their data. The mission is ambitious—creating a “Data-Centric Co-Pilot” that enhances productivity and model safety for machine learning engineers. Think of it as the Snowflake for vision.\n\n### What Tenyks Does\nAt its core, Tenyks provides an end-to-end platform that serves as a productivity tool specifically designed for computer vision engineers. Here’s a rundown of what it offers:\n\n1. **Automated Data Quality Detection**: Tenyks simplifies the identification and resolution of data quality issues, ensuring datasets remain robust and trustworthy.\n\n2. **Accelerated Data Curation**: The platform makes it faster to curate similar images and objects, which is essential for balanced and comprehensive data collection.\n\n3. **Cataloging Vast Datasets**: Users can efficiently index and organize extensive datasets, making them readily accessible for analysis.\n\n4. **Seamless CI/CD Integration**: Tenyks seamlessly fits into existing Continuous Integration/Continuous Deployment (CI/CD) pipelines, minimizing the risk of regressions and optimizing workflow.\n\n5. **Security & Scalability**: Cloud orchestrated for security, Tenyks fosters collaboration across teams while scaling to manage millions of images and hundreds of millions of objects.\n\n### The Founders' Expertise\nWhat's impressive about Tenyks is that the technology is grounded in research, stemming from nine top-tier publications and a patented invention developed during the founders’ PhD studies focused on Safe & Explainable AI for computer vision.\n\n### Team and Location\nWith a dedicated team of 14 employees based in Cambridge, UK, and backed by industry giants as group partners, Tenyks is poised for growth in the AI landscape. \n\n### Current Applications and Industry Focus\nTenyks is currently making its mark across various industries, including security and surveillance, media, quick-service restaurants (QSRs), and care homes. This versatile application demonstrates the broad utility and effectiveness of Tenyks's offerings.\n\n### Why Choose Tenyks?\nThis platform stands out not just for its robust functionalities but also for its customer-centric approach, which consistently emphasizes collaboration, security, and efficiency. Early user testimonials speak to its transformative impact on workflows, enabling teams to streamline processes and focus on strategic initiatives.\n\nThe stakes are high in the AI race, with concerns like the looming “Terminator” scenario frequently cited. Tenyks addresses these concerns head-on by helping engineers build safer AI systems with more reliable datasets and improved modeling techniques.\n\nSo, if you’re in the realm of computer vision and machine learning, Tenyks could very well be the co-pilot you didn’t know you needed.\n\nFor more information, check out their [website](http://tenyks.ai/) and explore how Tenyks can enhance your projects and peace of mind in this rapidly evolving AI landscape.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/52740ac7331dbb864b4763dbf7c9955fb46b8e45.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192011Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=b05f0460194413a7c77ca1057d4751dddc7a8336371a001c57501aa5e35aa0a7",
    "social_links": [
        "https://www.linkedin.com/company/tenyks/",
        "https://twitter.com/Tenyks_AI",
        "https://www.crunchbase.com/organization/tenyks"
    ],
    "logo_path": "data/logos\\Tenyks_logo.png"
}