{
    "links": "https://www.ycombinator.com/companies/tequitable",
    "name": "tEQuitable",
    "headline": "tEQuitable's mission is to create work culture that works for everyone",
    "batch": "W18",
    "description": "tEQuitable helps companies get in front of and prevent harassment. \r\nWe are an independent, confidential platform to address issues of bias, discrimination, and harassment in the workplace.\r\n\nFor employees, we provide a sounding board they can consult without fear of retribution on issues ranging from subtle, insidious slights and invalidations to overt discrimination and harassment.\r\n\nFor companies, we provide data and insights to identify systemic issues, track behavioral trends, and develop actionable recommendations.\r\n\ntEQuitable is using technology to make workplaces more equitable.",
    "activity_status": "Active",
    "website": "https://www.tEQuitable.com/",
    "founded_date": 2017.0,
    "team_size": 6.0,
    "location": "Oakland, CA",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:b2b; industry:hr-tech; industry:diversity-&-inclusion; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Lisa Gelobter, Founder/CEO",
            "description": "Lisa has pioneered Internet technologies that have been used by billions of people, including Shockwave and Hulu. Most recently, she worked at the Obama White House, serving as the Chief Digital Service Officer for the Department of Education. Previously, Lisa acted as the Chief Digital Officer for BET Networks.\n\nLisa is one of Inc.'s 100 Women Building America's Most Innovative and Ambitious Businesses, Fast Company’s Most Creative People, is spotlighted in Eric Ries’ book “The Startup Way”.",
            "linkedin": "https://www.linkedin.com/in/lisagelobter/"
        }
    ],
    "status": true,
    "generated_description": "tEQuitable is a forward-thinking company on a mission to create work cultures that truly serve everyone. Founded in 2017 and part of Y Combinator's Winter 2018 batch, this Oakland-based startup seeks to tackle the pervasive issues of bias, discrimination, and harassment in the workplace through a confidential and independent platform.\n\nAt its core, tEQuitable offers a safe space for employees to voice their concerns without fear of retaliation. Whether it’s addressing subtle slights or overt discrimination, their platform enables individuals to seek support and guidance, helping them navigate workplace complexities. On the company side, tEQuitable provides valuable data and insights that empower organizations to identify systemic problems and develop actionable strategies to foster a more inclusive environment.\n\nWith a small but dedicated team of six, tEQuitable combines technology and human insight to enhance psychological safety and employee engagement. The platform operates akin to an Ombuds service, leveraging informal conflict resolution methods which have been shown to dramatically reduce litigation rates for organizations.\n\nWhat’s compelling about tEQuitable is its ambitious vision: a workplace where everyone can bring their whole selves without fear. Given that studies show a staggering 78% of employees experience some form of unfair treatment, the need for such an initiative is undeniable. \n\nIn addition to their core services, tEQuitable offers myriad resources including blogs, webinars, and research papers to further educate and advocate for equitable practices in workplaces. Their work is backed by some industry-leading organizations, making it a trusted solution for many companies aiming to improve their workplace culture.\n\nSo if you’re looking to shift the dynamics in your organization towards a more equitable and inclusive environment, tEQuitable is a resource worth exploring. You can check them out at [tEQuitable.com](https://www.tEQuitable.com/).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/960fa1d40bcc97b8618edcd7ba1f45ca23823970.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192011Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=414d1d259d723dc4b4e1590562349cf8165b5578ff413e047bee64475c90facd",
    "social_links": [
        "https://www.linkedin.com/company/tequitable/",
        "https://twitter.com/t_equitable",
        "https://www.crunchbase.com/organization/tequitable"
    ],
    "logo_path": "data/logos\\tEQuitable_logo.png"
}