{
    "links": "https://www.ycombinator.com/companies/terrace",
    "name": "Terrace",
    "headline": "Trade Crypto Better",
    "batch": "S22",
    "description": "Terrace is the all-in-one trading terminal and portfolio management system for crypto. Terrace is a non-custodial crypto trading terminal and broker with better pricing, deeper liquidity, and broader asset coverage than any CEX, DEX, or MM. Terrace aggregates centralized and decentralized liquidity and abstracts away wallets, chains and venues.",
    "activity_status": "Active",
    "website": "https://www.terrace.fi",
    "founded_date": 2021.0,
    "team_size": 10.0,
    "location": "Los Angeles, CA",
    "group_partner": "Harj Taggar",
    "group_partner_yc": "https://www.ycombinator.com/people/harj-taggar",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:defi; industry:fintech; industry:saas; industry:crypto-web3; location:los-angeles",
    "founders": [],
    "status": true,
    "generated_description": "**Company Overview: Terrace**\n\nTerrace, founded in 2021 and part of Y Combinator Batch S22, has taken a bold step into the world of cryptocurrency. It's situated in Los Angeles, CA, with a compact team of 10. The mission? To revolutionize crypto trading under the banner “Trade Crypto Better.” \n\n### What is Terrace?\n\nAt its core, Terrace is an all-in-one trading terminal and portfolio management system designed specifically for the complexities of crypto. Unlike traditional crypto exchanges (CEXs) and decentralized exchanges (DEXs), Terrace operates as a non-custodial broker that provides more competitive pricing, deeper liquidity, and a broader range of assets. This means you can navigate the chaotic waters of crypto trading without the burdens of wallets, chains, or separate trading venues.\n\n### Key Features\n\nTerrace’s platform is built with traders in mind, offering:\n\n- **Advanced Trading Tools**: With smart order routing and live order books, users can execute both spot and derivatives trading more effectively.\n- **Pathfinder**: This feature ensures that the best route is chosen for executing trades across different token and chain combinations.\n- **Real-Time Portfolio Management**: Users can manage their portfolios across 13 blockchains seamlessly, tracking positions and historical trades with ease.\n- **Multi-Wallet Strategy**: The platform allows trading across multiple wallets at once, which is a significant advantage for active traders.\n\n### Why Choose Terrace?\n\nTerrace differentiates itself by consolidating advanced trading functionalities into one platform. You can manage assets, execute complex orders like limit and TWAP, and have the versatility to engage with various token chains—all from a single interface. This efficiency is particularly appealing for traders who want to streamline their operations in a market that's often fragmented.\n\n### The Bigger Picture\n\nTerrace aligns itself with several industry tags, including DeFi, fintech, and crypto Web3, underscoring its commitment to being at the forefront of the evolving cryptocurrency landscape. Their services are aimed at addressing common pain points in crypto trading—like fragmented liquidity and complex transaction processes—making it a more accessible arena for traders of all stripes.\n\nBacked by prominent investors and a well-connected team led by Harj Taggar, Terrace is setting out to change the way crypto trading works. For anyone looking to navigate the vast crypto waters more effectively, Terrace promises to be a valuable ally.\n\nFor more information, you can check out their website at [Terrace](https://www.terrace.fi).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/34e21441139d19847f1d92eeda4b54adc481a83a.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192011Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=c47a0a58355532e4faa288264d19a3b83620487042afb056b963bbd07e2937ba",
    "social_links": [
        "https://www.linkedin.com/company/terracefi"
    ],
    "logo_path": "data/logos\\Terrace_logo.png"
}