{
    "links": "https://www.ycombinator.com/companies/terra-2",
    "name": "Terra",
    "headline": "Terra is like Faire for custom goods",
    "batch": "S24",
    "description": "Enter Terra, a new world of product building. Connect with suppliers, expedite sampling, and track production in real-time, removing the uncertainties of overseas manufacturing.",
    "activity_status": "Active",
    "website": "https://useterra.com/",
    "founded_date": 2024.0,
    "team_size": 6.0,
    "location": "New York",
    "group_partner": "Diana Hu",
    "group_partner_yc": "https://www.ycombinator.com/people/diana-hu",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:manufacturing; industry:supply-chain; industry:procurement; industry:enterprise-software; location:new-york",
    "founders": [
        {
            "name": "Lev Glushkovskii, Founder",
            "description": "Previously co-founded SabersPro and bootstrapped the company from 0 to $10M+ in sales in 2.5 years, where he restructured the supply chain with factories increasing margins by 15% saving ~1M in profits. Dropped out from the Business, Technology, and Entrepreneurship program (BTE) at NYU Stern.",
            "linkedin": "https://www.linkedin.com/in/lev-glushkovskii/"
        },
        {
            "name": "Dylan McFarland, Founder",
            "description": "In high school bootstrapped a furniture startup and in under a year went from selling on Craigslist to running a 40-person factory in Shenzhen. Took those insights and dropped out NYU Stern BTE to run Terra, a platform that streamlines supply chain creation for growing companies.",
            "linkedin": "https://www.linkedin.com/in/dylan-mcfarland/"
        }
    ],
    "status": true,
    "generated_description": "**Company Summary: Terra**\n\n**Overview**  \nTerra is a startup established in 2024, operating out of New York and participating in Y Combinator's Batch S24. The company, with a small team of six, aims to transform the way businesses procure custom goods, positioning itself as the \"Faire for custom goods.\"\n\n**Mission & Vision**  \nTerra’s mission is to streamline the journey from design to production. By connecting suppliers, simplifying sampling, and allowing businesses to track production in real-time, they effectively eliminate the uncertainties typically associated with overseas manufacturing.\n\n**How It Works**  \nTerra leverages technology to act as a buying group. Here’s the gist: they receive individual orders from clients, bundle similar ones together, and negotiate bulk pricing without minimum order quantities (MOQs). This means businesses can order exactly what they need, when they need it, without being stuck with excess inventory. This model gives clients access to over 10,000 products at factory prices—far cheaper than typical retail rates.\n\n**Key Features**  \n- **Wholesale Pricing**: By bypassing traditional retail channels, Terra allows businesses to access products at significantly lower prices.\n- **No MOQs**: Say goodbye to the stress of minimum order requirements; clients can order only what they need.\n- **Quick Turnarounds**: Their system accommodates both standard and expedited shipping options, ensuring that businesses aren't left waiting around.\n\n**Market Position**  \nTerra competes against high-retail markups and the traditional supply chain inefficiencies. Their platform consolidates communications, avoids the hassle of dealing with multiple suppliers, and offers dedicated concierge support to provide a seamless experience.\n\n**Unique Selling Proposition**  \nImagine not having to worry about inventory management while also accessing quality products equivalent to those offered by big-name retailers, but without the hefty price tags. Terra's software bridges the gap by finding similar orders and consolidating them to meet factory requirements, which keeps costs low.\n\n**Fun Fact**  \nThrough Terra, you can buy quality furniture directly from manufacturers—often at prices that are a fraction of what you’d see in stores. For instance, a couch priced at $3,799 elsewhere might be available for just $1,664 through Terra.\n\n**Conclusion**  \nIn a nutshell, Terra is reshaping the procurement landscape for custom goods, making it easier and more affordable for businesses to access quality products. If you're in the market for custom items without the traditional headaches of supplier management, Terra is the solution you've been waiting for. Check out their offerings at [useterra.com](https://useterra.com/).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/8cbd1eed6db553d92000349c77ef2dc56488c263.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192012Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=c686f9d1a79627eff3315c6de61ed4194f3ff309553b776ef3989f9bfe90ab98",
    "social_links": [
        "https://www.linkedin.com/company/useterra"
    ],
    "logo_path": "data/logos\\Terra_logo.png"
}