{
    "links": "https://www.ycombinator.com/companies/stem-sugar",
    "name": "The Supplant Company",
    "headline": "A brand-new blend of sugars â\u0080\u0093 made from plant fiber!",
    "batch": "S18",
    "description": "The Supplant Company is defining a new category of food ingredient: sugars from fiber. Supplantâ\u0084¢ sugars from fiber is a brand-new blend of sugars found naturally in plant fiber. With Supplantâ\u0084¢ sugars from fiber, your favorite treats can look, feel and taste like theyâ\u0080\u0099re supposed to. Because itâ\u0080\u0099s made from fiber, Supplantâ\u0084¢ sugars from fiber is lower in calories, has a lower glycemic response (compared to glucose), and is prebiotic. Itâ\u0080\u0099s made by upcycling agricultural side-streams. For example, in corn (maize), itâ\u0080\u0099s made from the cob, not the kernel. In wheat and rice, itâ\u0080\u0099s made from the straw, not the grain. These fiber-rich parts of crops are hugely abundant and donâ\u0080\u0099t typically make their way into the food system.",
    "activity_status": "Active",
    "website": "https://supplant.com",
    "founded_date": 2017.0,
    "team_size": 15.0,
    "location": "Cambridge, United Kingdom",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:food-tech; industry:sustainable-agriculture",
    "founders": [],
    "status": true,
    "generated_description": "### The Supplant Company: Revolutionizing Sugar from Fiber\n\nFounded in 2017 and hailing from Cambridge, UK, The Supplant Company is on a mission to redefine how we think about sugar. Their innovative approach focuses on creating unique sugars derived entirely from plant fiber, thus carving out a new category in the food ingredient market. By upcycling agricultural by-products like corn cobs, wheat straw, and oat hulls—parts of crops that typically go to waste—they’re not only developing healthier sugar alternatives but also making strides toward sustainability.\n\n### What’s Unique?\n\nSupplant™ sugars are lower in calories, boast a reduced glycemic response compared to traditional glucose, and provide prebiotic benefits. The brilliance of their product lies in its ability to mimic the taste and texture of conventional sugars in our favorite treats without the associated health risks. This means you can have your chocolate cake and eat it too—guilt-free. As Chef Thomas Keller puts it, Supplant enables the creation of desserts just as delightful as those made with traditional sugar.\n\n### The Vision\n\nThe Supplant Company's ethos revolves around a radical reevaluation of food systems. They see the missed potential in what they call “The Forgotten Half of the Harvest.” By focusing on what’s often discarded, they not only promote a healthier diet but also contribute to better climate outcomes and food security.\n\nTheir team consists of 15 passionate employees, and they have been nurtured by Y Combinator in Batch S18, positioning them uniquely in the food-tech and sustainable agriculture sectors. They are guided by a philosophy that emphasizes sustainability without sacrificing taste—an approach that resonates deeply with today’s health-conscious consumers.\n\n### Why It Matters\n\nIn a world where the health implications of consuming high glycemic index sugars are becoming increasingly recognized, The Supplant Company is addressing an essential need. Their innovative products allow us to enjoy sweetness without the weighty consequences on our health or the planet. \n\nIf you're interested in their work or looking to explore products made with their groundbreaking sugars, check out their website [The Supplant Company](https://supplant.com) for more details on their impact, products, and processes.\n\n### Connecting with Supplant\n\nWant to stay updated? Follow them on social media or visit their news section to see how they’re shaping the future of food!\n\nIn a nutshell, The Supplant Company isn't just making a sugar replacement—it's nurturing a vital shift toward a more sustainable and health-focused food industry. And that’s something worth sweetening up to!",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/c1a2f1c05e703a092a635afcde1e86d162d65284.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192016Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=9fccba353bef94319f14776f29a7a61854e5f028849654c27bf200e0189931fe",
    "social_links": [
        "https://www.linkedin.com/company/supplantcompany/",
        "https://twitter.com/SupplantCompany",
        "https://www.facebook.com/supplantcompany"
    ],
    "logo_path": "data/logos\\The_Supplant_Company_logo.png"
}