{
    "links": "https://www.ycombinator.com/companies/the-human-utility",
    "name": "The Human Utility",
    "headline": "The Human Utility seeks to eliminate water service disconnections forâ\u0080¦",
    "batch": "W15",
    "description": "Founded July 2014, The Human Utility (formerly known as the Detroit Water Project) matches families needing help with utility bills to people who want to help through payments directly to utility companies.\r\n\nFor over 40 million families in the United States, water and other essential utilities may be unaffordable. In order to afford utilities, families often forgo medication, food, and transportation. The Human Utility's platform divides a bill similar to a loan syndicate expanding the possible number of donors from around the world able to join together to ensure families never lose access to utility service. Donors are matched with a specific family or donate to a universal assistance fund.\r\n\nLater, we use utility data to design interventions addressing the root causes of why people need help with their utility bills with the goal of never having them lose service again.",
    "activity_status": "Active",
    "website": "https://www.detroitwaterproject.org/",
    "founded_date": null,
    "team_size": 2.0,
    "location": "Oakland, CA",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:crowdfunding; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Tiffani Ashley Bell, Founder/Executive Director",
            "description": "Tiffani â\u0080\u008bis theâ\u0080\u008b Founder and Executive Director â\u0080\u008bof The Human Utility. Since July 2014, The Human Utility has helped thousands of people with their water bills.\n\nShe was a 2017 Technology & Democracy Fellow at the Harvard Kennedy School of Government.\n\nTiffani is a programmer who earned a BSc in Systems & Computer Science from Howard University. She is also a Stanford Graduate School of Business alumna having earned an MS in Management as a Sloan Fellow in 2021/22. \n\nAlways chewing gum.",
            "linkedin": "http://www.linkedin.com/in/tiffani"
        }
    ],
    "status": true,
    "generated_description": "**Company Overview: The Human Utility**\n\nFounded in July 2014, The Human Utility started its journey as the Detroit Water Project. Its mission is straightforward yet profound: to eliminate water service disconnections for families across the United States. It tackles a critical issue—over 40 million families face the harsh reality that essential utilities are often unaffordable. This leads families to make heart-wrenching choices between paying for water, food, or even medication.\n\nWhat is innovative about The Human Utility is its crowdfunding platform that connects donors directly to families in need, effectively acting like a loan syndicate for water bills. Donors can choose to contribute directly to a specific family or contribute to a universal assistance fund, enhancing the chances for families to regain and maintain access to water.\n\nThe Human Utility employs a data-driven approach to identify the root causes of water affordability issues. By analyzing utility data, the organization designs interventions aimed at ensuring families never face disconnections again.\n\n**Key Operations:**\n\n- The organization operates primarily in Oakland, CA, with a small team of just 2 employees.\n- As part of Y Combinator's Batch W15, The Human Utility has garnered support from more than 4,500 donors since its inception, enabling it to assist over 2,000 families so far.\n- They actively promote awareness around the idea that affordable water is a human right, particularly highlighting the struggles of families in cities like Detroit and Baltimore.\n\n**Community Engagement:**\n\nThe Human Utility encourages public participation through donations, highlighting that even small contributions can have a significant impact. Their platform allows individuals from anywhere to become agents of change, standing up for a cause that many believe is fundamental—access to clean water.\n\nIf you’re interested in supporting their mission, you can donate through their website, provide services if you're in a related profession, or partner with them if you’re part of a community organization in need of assistance.\n\nExplore more about their story and how you can help at [The Human Utility's website](https://www.detroitwaterproject.org/). Their work is not just about water—it's about dignity, equity, and ensuring that no one has to live without this essential resource.",
    "logo": "/logos/medium/missing.png",
    "social_links": [
        "http://www.twitter.com/humanutility",
        "http://www.facebook.com/thehumanutility",
        "https://www.crunchbase.com/organization/the-human-utility"
    ]
}