{
    "links": "https://www.ycombinator.com/companies/the-breakaway",
    "name": "The Breakaway",
    "headline": "The personal coach and companion for cyclists.",
    "batch": "S21",
    "description": "The Breakaway is a personal performance coach for cyclists, with the product, team, roadmap and vision to extend to be the mass market coaching platform for anyone tracking their performance.\r\n\nAs more and more people realize that exercise is the key not only to personal performance, but to health and wellness, the inevitable future is that everyone will have an AI driven personal performance coach & companion in their pocket. The Breakaway will be that Coach.",
    "activity_status": "Active",
    "website": "https://www.breakaway.app/",
    "founded_date": 2020.0,
    "team_size": 6.0,
    "location": "Truckee, CA",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fitness; industry:health-&-wellness",
    "founders": [
        {
            "name": "Jordan Kobert, Founder",
            "description": "CEO & Co-founder of The Breakaway. \n\nI founded The Breakaway in 2020 along with Kyle Yugawa. Our mission is to help people improve and we're starting with cycling, leveraging the explosive growth in platforms like Peloton, Zwift and Strava. We'll expand to all aspects of digital fitness to become the go-to coaching app for fitness enthusiasts. \n\nPreviously I was at: Urbandoor (Acq by Airbnb), Strava, Google, AdMob (Acq by Google), HomeGain.",
            "linkedin": "https://www.linkedin.com/in/jordankobert/"
        },
        {
            "name": "Kyle Yugawa, Founder",
            "description": "Product designer. Father of two. Recovering jiujiteiro. Weekend warrior cyclist. \n\nCo-founder & design leader at The Breakaway YCS21. Singularly focused on helping more people improve their fitness and finding joy in riding their bikes. \n\nPreviously at Strava, VSCO, and Tempo",
            "linkedin": "https://www.linkedin.com/in/kyleyugawa"
        }
    ],
    "status": true,
    "generated_description": "**The Breakaway** is your go-to personal coach and companion for cycling enthusiasts. Founded in 2020 and part of the Y Combinator Batch S21, this startup is based in Truckee, CA, and operates with a small but dedicated team of six.\n\nThe Breakaway recognized a broader trend: as more people embrace the importance of exercise for health and wellness, there’s a growing demand for AI-powered performance tracking. The vision here is ambitious yet straightforward: they’re set to evolve into a mass-market coaching platform that not only serves die-hard cyclists but anyone eager to enhance their performance.\n\nTheir mission is clear — to act as a personal coach that fits right into your pocket. Imagine having an intelligent coach that tailors your training regimen by learning from your data, adjusting to your busy schedule, and focusing on what really matters to you. The Breakaway integrates smoothly with various existing platforms and devices—think Zwift, Garmin, Peloton, and more—allowing users to analyze their performance without the usual complexities.\n\nYou can take advantage of features like simple weekly targets, guidance for daily workouts, and even a component for team motivation, which invites friends into the journey of individual improvement. It’s not just about riding; it’s about understanding your overall health—factors like heart rate variability and recovery are on the radar as they aim to provide a holistic view of your fitness journey.\n\nWant to check it out? You can find more information and download their app [here](https://www.breakaway.app/). The Breakaway is definitely one to watch in the evolving landscape of fitness technology, promising to be a game changer for cyclists and fitness enthusiasts alike. \n\nSo why is it called \"The Breakaway\"? Because just like breaking away in a race, it embodies the spirit of pushing ahead, breaking personal barriers, and finding your best performance. If you’re into fitness, don’t miss out on what they’re up to—reach out to them or dive right into using the app to see for yourself.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/fd6269fec3683b5cb6a3ad1a016859e6a87ff3db.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192015Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=22ed6cdcfd1765cfe24975b31f30082442fcc455e4b1196e092bf6e66a60cf99",
    "social_links": [
        "https://www.linkedin.com/company/the-breakaway/",
        "https://twitter.com/TheBreakawayApp",
        "https://www.crunchbase.com/organization/the-breakaway-7e7b"
    ],
    "logo_path": "data/logos\\The_Breakaway_logo.png"
}