{
    "links": "https://www.ycombinator.com/companies/the-rumie-initiative",
    "name": "The Rumie Initiative",
    "headline": "Weâ\u0080\u0099re a non-profit that brings the best free learning contentâ\u0080¦",
    "batch": "IK12",
    "description": "We're a non-profit tech startup with a mission to bring the surge of free learning content available online to communities least likely to access it but with the most to gain. \n\nOne billion children worldwide lack access to a quality education. A problem this big requires a new way of thinking about things.\n\nRumie innovates with technology to lower the cost of learning resources. We find and organize the best free learning content online on the LearnCloud, and deliver libraries of it to offline communities on low-cost tablets. \n\nOur vision is to lead a movement of people working to make education affordable. Join us!",
    "activity_status": "Active",
    "website": "http://www.rumie.org",
    "founded_date": null,
    "team_size": 11.0,
    "location": "Toronto, Canada",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": null,
    "founders": [],
    "status": true,
    "generated_description": "**The Rumie Initiative: Transforming Education Through Technology**\n\nThe Rumie Initiative is a non-profit organization based in Toronto, Canada, focused on tackling a pressing global issue: over one billion children lack access to quality education. Founded as a tech startup and part of Y Combinator Batch IK12, Rumie is on a mission to bridge the educational gap for those communities that are most in need but least likely to access free learning content.\n\n### The Mission and Vision\n\nRumie's mission is straightforward yet profound: to harness the vast reservoir of free learning content available online and make it accessible to the underserved. They’ve innovated a solution utilizing technology that significantly lowers the cost of educational resources. Instead of traditional online learning, they deliver libraries of curated content—called the LearnCloud—on low-cost tablets to offline communities. Their vision is not just to educate but to lead a movement that makes education affordable and accessible for everyone. \n\n### How It Works\n\nThrough a platform that organizes and curates learning materials, Rumie has created a wealth of resources called \"Bytes.\" These are compact, bite-sized modules designed for efficient learning. The beauty of Bytes lies in their ability to cover a topic in just minutes, making learning easily digestible and incredibly efficient—20% more so than conventional methods. Whether it’s personal finance, mental health, or job preparedness, Bytes target skills that people actively want to learn or improve.\n\n### Join the Movement\n\nWith a small but dedicated team of 11 employees, Rumie is inviting everyone to join their cause. They believe that education isn't just about learning—it's about empowerment, opportunity, and breaking barriers that prevent growth. If you're passionate about education and technology and want to be part of a change-making initiative, there’s a spot for you here. \n\nIn a world where education should be a right, not a privilege, The Rumie Initiative stands out as a beacon of hope and innovation, proving that with the right tools, anyone can learn—anywhere.\n\nFor more information or to get involved, you can check out their website at [Rumie](http://www.rumie.org).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/c500cc9481075f9c23ee5270ed132d0fc34ac6b9.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192015Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=b5659ea7dae0fa9bdbc7c622a3726c3f49d25bdc013e8c11a1d2716978d67b7c",
    "social_links": [],
    "logo_path": "data/logos\\The_Rumie_Initiative_logo.png"
}