{
    "links": "https://www.ycombinator.com/companies/therecraft",
    "name": "ThereCraft",
    "headline": null,
    "batch": "S17",
    "description": null,
    "activity_status": "Active",
    "website": "https://therecraft.com",
    "founded_date": null,
    "team_size": 1.0,
    "location": "Los Angeles, CA",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "location:los-angeles",
    "founders": [],
    "status": true,
    "generated_description": "### ThereCraft: Redefining Uncrewed Flight Services\n\n**Website**: [ThereCraft](https://therecraft.com)  \n**Location**: Los Angeles, CA  \n**Y Combinator Batch**: S17  \n**Team Size**: 1 employee  \n\n---\n\n**Overview**:  \nThereCraft is carving a niche in uncrewed flight services with an innovative approach that promises high endurance and low-cost operations across the globe. Founded in the Y Combinator S17 batch, this ambitious venture has its base in the vibrant tech landscape of Los Angeles.\n\n**What They Do**:  \nAt the core of their operations is a proprietary STOVL (Short Takeoff and Vertical Landing) lifting-body aircraft, which allows for a range of applications—significantly enhancing operational efficiency in various sectors. They cater to a variety of needs, including:\n\n- **Cargo transport**  \n- **Shore-to-ship logistics**  \n- **Underway replenishment**  \n- **Air data collection**  \n- **Intelligence, Surveillance, and Reconnaissance (ISR)**  \n- **Vertical replenishment**\n\nThis diverse portfolio showcases ThereCraft's capability to deliver essential services without compromise.\n\n---\n\n**Getting in Touch**:  \nIf you’re interested in their services or need a quote, don’t hesitate to reach out to them through their website. \n\n### Conclusion  \nIn an industry where the demand for uncrewed flight services is steadily rising, ThereCraft stands out with its unique technology and targeted applications. While their team may be small, their vision is anything but limited. Keep an eye on this company as they navigate the skies of innovation.",
    "logo": "/logos/medium/missing.png",
    "social_links": []
}