{
    "links": "https://www.ycombinator.com/companies/threshold",
    "name": "Threshold",
    "headline": "Network for decentralized threshold cryptography and end-to-endâ\u0080¦",
    "batch": "S16",
    "description": "NuCypher is one of two founding teams of the Threshold Network (market cap ~$370m), which hosts tBTC, TACo, Random Beacon & tUSD. Since 2017, NuCypher has pioneered cryptographic primitives for end-to-end encrypted data sharing, including Proxy Re-Encryption and Threshold Access Control (TACo), novel cryptoeconomic mechanisms (e.g. Stable Yield). and original network/governance architectures (including a historic on-chain merger). TACo, our flagship product, is running on over 120 nodes with ~$80m of associated economic security, has paying adopting developers and major infrastructure partners (Ceramic, Irys, Textile, Unlock), and has been decentralized from genesis (mainnet launch in Jan 2024).",
    "activity_status": "Active",
    "website": "https://threshold.network/",
    "founded_date": 2015.0,
    "team_size": 10.0,
    "location": "Austin, TX",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:cryptography; industry:privacy; location:austin",
    "founders": [],
    "status": true,
    "generated_description": "**Threshold Network: A Quick Overview**\n\nThreshold is a forward-looking company at the intersection of decentralized finance (DeFi) and cryptography, aiming to maximize the utility of Bitcoin within the burgeoning DeFi ecosystem. Formerly known as NuCypher, Threshold was established in 2015 and is part of Y Combinator's Batch S16. Currently based in Austin, Texas, their compact team of 10 employees is working closely with major players in the industry, including organizations like Ceramic, Irys, Textile, and Unlock. \n\n### What They Do\nThreshold is focused on decentralized threshold cryptography and privacy solutions. Their flagship product, Threshold Access Control (TACo), operates on over 120 nodes, maintaining around $80 million in economic security. This not only ensures robust privacy and data sharing capabilities but has also attracted paying developers and partners. Their mainnet launched in January 2024, and the technology enables significant innovations in end-to-end encryption and decentralized governance.\n\nThe company's current projects include:\n- **tBTC**: A bridge for Bitcoin in the DeFi space, allowing users to mint and utilize Bitcoin without intermediaries.\n- **Liquidity Provision**: For those looking to earn yields by supplying liquidity within the DeFi ecosystem.\n- **Token Holder Governance**: Engaging the community to participate in the governance of the network through their DAO.\n\n### The Vision\nThreshold's vision is clear: to develop a network designed for secure, decentralized, and permissionless operations. The underlying idea rests on creating a constructive ecosystem where developers can build DeFi applications that integrate robust encryption techniques, allowing for safe data sharing and custodianship of digital assets.\n\n### Market Context\nWith a market cap of approximately $370 million, Threshold is positioned as a significant player in the DeFi landscape, especially as the use of stable tokens and decentralized governance continues to grow in importance. Their proposals and community-driven decisions, like the recent TIP-101 and TIP-092 for enhancing governance and reducing token inflation, illustrate a proactive approach to adapting and evolving in the crypto space.\n\n### How to Get Involved\nFor developers and curious participants alike, Threshold offers avenues to mint tBTC, become liquidity providers, and engage in governance discussions via their community platforms. They are also running a $500K bug bounty program to encourage security enhancement of their network.\n\n### Conclusion\nThreshold Network encapsulates the exciting potential of DeFi while tackling the vital issues of privacy and encryption with innovative cryptographic approaches. With a clear mission and a passionate team ready to embrace the decentralized future, they are definitely one to watch as the landscape continues to evolve.\n\nFor additional details, you can explore their website at [Threshold.Network](https://threshold.network/).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/739abf841e4405be08ba4349e24b91976a293fe6.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192017Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=62121a5c939a68f3fc3b13036cee2d0f2b6dbb1f86d3f5084aa3e25c697dd599",
    "social_links": [
        "https://twitter.com/TheTNetwork",
        "https://www.crunchbase.com/organization/nucypher",
        "https://github.com/nucypher"
    ],
    "logo_path": "data/logos\\Threshold_logo.png"
}