{
    "links": "https://www.ycombinator.com/companies/thrive-agritech",
    "name": "Thrive Agritech",
    "headline": "We design and manufacture energy efficient LED lighting fixtures forâ\u0080¦",
    "batch": "S15",
    "description": "Thrive Agritech designs and manufactures advanced lighting fixtures for indoor agriculture. We have a patent pending LED lighting system that precisely targets various photosynthetic spectrums.\r\n\nMany thousands of our LED lighting fixtures have been installed in some of the world's leading indoor farms. Our products are saving millions of watt-hours of energy every day in vertical farms, greenhouses and cannabis production facilities.\r\n\nAgritech expands beyond lighting and so do we. Our R&D team is actively involved in creating advanced sensor and communications networks to work with both human and artificial intelligence to create the optimized farm of the future.",
    "activity_status": "Active",
    "website": "http://www.thriveagritech.com",
    "founded_date": 2015.0,
    "team_size": 8.0,
    "location": "New York",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:vertical-farming; industry:agriculture; industry:sustainable-agriculture; location:new-york",
    "founders": [],
    "status": true,
    "generated_description": "**Thrive Agritech** is a forward-thinking company specializing in energy-efficient LED lighting solutions for indoor agriculture. It was founded in 2015 and proudly features in the Y Combinator Batch S15. Headquartered in New York with a small team of eight, Thrive Agritech has made significant strides in optimizing the growth of plants in controlled environments.\n\nThe company's mission revolves around designing and manufacturing high-performance LED lighting fixtures that cater specifically to the needs of various agricultural sectors, including vertical farms, greenhouses, and cannabis cultivation. Their patent-pending LED system is notable for its precision in targeting photosynthetic spectrums, which is crucial for plant growth. With thousands of installations worldwide, Thrive Agritech's products are saving millions of watt-hours of energy each day, proving both effective and sustainable.\n\nBut Thrive Agritech isn't just about lighting; it’s pushing the boundaries of technology through research and development of advanced sensor and communication networks that integrate human and artificial intelligence. The vision? To create the optimized farm of the future.\n\nTheir product lineup includes various models, such as the **Pinnacle HP**, **Boost XE**, and **Infinity XE**, each tailored for specific farming applications, from leafy greens to multi-tier cannabis growth. They emphasize ease of installation and maintenance, supported by a five-year warranty, ensuring peace of mind for their users.\n\nWhat sets Thrive Agritech apart in the crowded agritech field is not just their innovative products, but their commitment to pushing the entire industry forward through advanced technology and energy efficiency. Their growing client base includes reputable names like Pharmacann and Vertical Harvest, which is a testament to their impact and credibility in the indoor agriculture space.\n\nFor more information, check out their website at [Thrive Agritech](http://www.thriveagritech.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/248f5eb50d1f3502b5f49c4b0b16c2ddafe71ccf.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192017Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=0f5ab631db9f248a8568f367a848276ce7ebe7e86b7843ccd7f8e80601c7b86f",
    "social_links": [
        "https://www.linkedin.com/company/transcend-lighting/",
        "https://twitter.com/thriveagritech",
        "https://www.crunchbase.com/organization/transcend-lighting"
    ],
    "logo_path": "data/logos\\Thrive_Agritech_logo.png"
}