{
    "links": "https://www.ycombinator.com/companies/thunkable",
    "name": "Thunkable",
    "headline": "Thunkable is the no-code platform to build powerful native mobile apps",
    "batch": "W16",
    "description": "From MIT's App Inventor and YCombinator's W2016 batch, Thunkable allows anyone to build powerful native apps. With Thunkable, it's simple to design, and simple to code-- simply drag and drop to create fast, native, reliable apps.\r\n\nYou don't need to download large development suites, command-line kits, or simulators. You can use the many built-in app templates as they are, or make changes. Make your changes online and see them on your device instantly with the Thunkable mobile app. Upload your apps directly to the Play Store or App Store or send them to friends!",
    "activity_status": "Active",
    "website": "http://thunkable.com",
    "founded_date": 2015.0,
    "team_size": 40.0,
    "location": "San Francisco",
    "group_partner": "Jared Friedman",
    "group_partner_yc": "https://www.ycombinator.com/people/jared-friedman",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:developer-tools; industry:saas; industry:design-tools; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Arun Saigal, Founder/CEO",
            "description": "Named to Forbes 30 Under 30 and a sought-after thought leader in the no code space, Arun Saigal is leading the revolution in no code mobile development. He is the co-founder and CEO of Thunkable, the no-code tool that allows anyone to design, develop, and deploy native Android, iOS, and mobile web applications. Through Thunkable, Arun has empowered more than three million people in 184 countries to build more than seven million apps with his company.",
            "linkedin": "https://www.linkedin.com/in/aksaigal"
        },
        {
            "name": "WeiHua Li, Founder/CTO",
            "description": null,
            "linkedin": "https://www.linkedin.com/pub/weihua-li/14/877/62b"
        }
    ],
    "status": true,
    "generated_description": "**Company Overview: Thunkable**\n\nThunkable is a no-code platform designed to empower users to create powerful native mobile applications without traditional programming skills. Founded in 2015, the company emerges from the legacy of MIT's App Inventor and was part of Y Combinator's W16 batch. Located in San Francisco and boasting a small but dedicated team of around 40 employees, Thunkable is on a clear mission: make app development accessible to everyone.\n\n### Mission\n\nThe core mission of Thunkable is simple yet impactful—*to democratize mobile technology by allowing anyone to build native apps without writing code*. This accessibility is crucial because it enables creators from varied backgrounds to bring their ideas to life easily and efficiently.\n\n### How It Works\n\nThunkable operates on an intuitive drag-and-drop interface, which means you don't need to grapple with cumbersome development suites or command line tools. Users can start by selecting from a variety of pre-built app templates or can start with a blank canvas. Changes made in the Thunkable platform appear instantly on your device, making the prototyping process quick and dynamic.\n\nOnce your app is ready, deploying it to the Apple App Store or Google Play is straightforward, allowing for easy sharing and distribution among users.\n\n### Features\n\n1. **User-Friendly Design**: With over 50 design components at your disposal, including buttons, maps, and video players, building an app is both fun and engaging.\n   \n2. **Real-Time Preview**: Thunkable Live enables you to test your app as you build it. Changes are reflected immediately, ensuring you can iterate quickly.\n\n3. **Direct Publishing**: Publishing your app is hassle-free; you can do it with just a few clicks. \n\n4. **Robust Logic Blocks**: Advanced logic capabilities allow users to create complex, feature-rich applications without touching a single line of code.\n\n### Use Cases\n\nThunkable's versatility means it caters to a wide array of users. Whether you're an entrepreneur looking to prototype a Minimum Viable Product (MVP), a student learning coding basics, or an enterprise seeking custom apps for operations, Thunkable provides tailored solutions.\n\n### Clientele\n\nThunkable is already trusted by innovative companies such as Nestlé, JP Morgan, Shopify, and Boeing. This illustrates the platform's capability and potential in handling complex and high-stakes applications.\n\n### Team and Leadership\n\nBacked by Jared Friedman as Group Partner, Thunkable exemplifies growth and innovation in the app development sphere. The team's focus on creativity and accessibility positions it well in a rapidly evolving tech landscape.\n\n### Conclusion\n\nIf you’re ready to turn that brilliant app idea into a reality, Thunkable makes it easy to get started—no coding required. With tools that empower you to create without boundaries, Thunkable is a game-changer for aspiring developers and seasoned professionals alike. \n\nFor more information, visit their website at [Thunkable.com](http://thunkable.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/f2705893a3166d1e2abbcbb738985627ad86b5ee.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192017Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=b97020fbf34c9a26e99ebfbb0e94e18571e5c996a4dc0c893101e2fe84722f0c",
    "social_links": [
        "https://www.linkedin.com/company/thunkable/",
        "https://twitter.com/thunkable",
        "https://www.facebook.com/thunkable",
        "https://www.crunchbase.com/organization/thunkable"
    ],
    "logo_path": "data/logos\\Thunkable_logo.png"
}