{
    "links": "https://www.ycombinator.com/companies/thyme",
    "name": "Thyme",
    "headline": "The OS for financial advisors",
    "batch": "S24",
    "description": "There are 300k+ financial advisors in the US using a digital Rolodex to manage their client relationships, and it's time for a makeover.\r\n\nAt Thyme we are building the OS for financial advisors that allows them to automatically take notes in meetings (in-person, online, and phone calls), manage their client records with the help of AI, and offer a client portal where clients can track their assets, manage tasks, and even pay for their services. \r\n\nOur users have replaced their legacy CRMs and billing solutions with us while deepening their clients' relationships thanks to our client portal and AI tooling that puts rich context at their fingertips.",
    "activity_status": "Active",
    "website": "https://www.meetthyme.com/",
    "founded_date": 2024.0,
    "team_size": 2.0,
    "location": "San Francisco",
    "group_partner": "Dalton Caldwell",
    "group_partner_yc": "https://www.ycombinator.com/people/dalton-caldwell",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:artificial-intelligence; industry:fintech; industry:finance; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Daniel Lantz, Founder",
            "description": "I am originally from Texas and currently reside in Richmond, VA. Prior to co-founding Thyme, I worked as a software engineer at Capital One, trovata.io, and meetcampfire.com (YC S23).\n\nIn my free time, I enjoy Brazilian Jiu-Jitsu, chess, and spending time with my wife and son.",
            "linkedin": "https://www.linkedin.com/in/dflantz/"
        },
        {
            "name": "Fernando San Martin, Founder",
            "description": "Electrical engineer from Spain. I moved to SF to start my career.\nFor the most part, I've worked at the intersection of finance, software, and data at places like Capital One, Zippi (YC s19), and Trovata.",
            "linkedin": "https://linkedin.com/in/fsanmartinjorquera"
        }
    ],
    "status": true,
    "generated_description": "**Thyme: Revolutionizing FinTech with AI for Financial Advisors**\n\nFounded in 2024 and currently part of Y Combinator’s Batch S24, Thyme is establishing itself as the go-to operating system for financial advisors—a sector that boasts over 300,000 professionals in the U.S. still clinging to outdated digital Rolodexes. The company, based in San Francisco, is laser-focused on transforming how financial advisors manage client relationships, leveraging artificial intelligence to replace cumbersome legacy systems.\n\n**Mission and Offerings**\n\nThyme aims to be more than just another CRM. Its innovative platform automates note-taking during meetings—whether in-person, online, or on the phone—thanks to an advanced AI tool. Moreover, Thyme enables advisors to maintain comprehensive client records effortlessly, while offering a client portal for tracking assets, managing tasks, and facilitating payments.\n\nWith features that include automated meeting notes, billing capabilities, document intelligence, onboarding tools, and robust CRM integrations, Thyme is positioning itself as an all-in-one solution for financial advisory firms. Advisors report significant efficiency gains, allowing them to concentrate more on nurturing client relationships rather than drowning in administrative tasks.\n\n**User Experience and Security**\n\nTestimonials from users underscore Thyme’s effectiveness; many describe it as a \"game changer\" that simplifies their tech stack and saves valuable time. The platform’s user-friendly interface makes onboarding a breeze, and its AI-enhanced features offer critical insights at the touch of a button.\n\nSecurity is paramount for Thyme. The company touts rigorous practices aligning with regulatory standards and utilizes seasoned engineers with over a decade of experience in finance. Further, it employs strong encryption protocols and authentication measures—ensuring that user data remains protected.\n\n**The Future of Thyme**\n\nWith a lean team of two and the strategic guidance of Group Partner Dalton Caldwell, Thyme is poised for growth within the evolving FinTech landscape. The founders' commitment to building a secure and efficient product means they are not just another startup—Thyme has the potential to redefine how financial advisors operate and engage with their clients.\n\nFor more information, you can visit [Thyme's website](https://www.meetthyme.com/). If you’re among the many financial professionals still entangled in outdated systems, perhaps it’s time to consider what Thyme has to offer.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/20db5b415c9275c682a86874fc3b1363b6f42e1b.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192017Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=cca1f921f485448c1e8b000c5569f4ea2d5efc319bfab575329bbaf7179d1d96",
    "social_links": [
        "https://www.linkedin.com/company/thyme-yc-s24/"
    ],
    "logo_path": "data/logos\\Thyme_logo.png"
}