{
    "links": "https://www.ycombinator.com/companies/titipku",
    "name": "Titipku",
    "headline": "Super Hyperlocal Marketplace for SMEs in Indonesia",
    "batch": "S21",
    "description": "Local market is a traditional wet market that consist with 200 - 1000 merchants who sell groceries located in every residential area. We  digitize all these merchants into our apps and provide personal shoppers. So every household can buy groceries from multiple merchants at one local market in one single order. There are 16.000 local markets in Indonesia with 8.000.000 merchants inside.",
    "activity_status": "Active",
    "website": "https://titipku.com",
    "founded_date": 2017.0,
    "team_size": 19.0,
    "location": "Jakarta, Indonesia",
    "group_partner": "Gustaf Alstromer",
    "group_partner_yc": "https://www.ycombinator.com/people/gustaf-alstromer",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:grocery; industry:marketplace; industry:delivery",
    "founders": [
        {
            "name": "Henri Suhardja, Founder",
            "description": "2nd time entrepreneur & Angel Investor in some food MSMEs.\n\nA food technologist graduate, experienced in entrepreneurship for the last 8 years by having small business and also invest in some small business.",
            "linkedin": "https://www.linkedin.com/in/henri-suhardja-1881a4109/?originalSubdomain=id"
        },
        {
            "name": "Ong Tek Tjan, Founder",
            "description": "I was born in Padang Indonesia year 1969. I have working experience mostly in banking sector for more than 26 years such BCA, Bank Danamon, Bank Sahabat Sampoerna. Handled SME and Commercial segments,   managed branches, sales teams, strategic planning, product developments, for example  financial supply chain system, credit origination system, digital saving, cross selling among subsidiaries.",
            "linkedin": "https://www.linkedin.com/in/ong-tek-tjan-533b2616/?originalSubdomain=id"
        }
    ],
    "status": true,
    "generated_description": "**Titipku: Bridging Tradition and Modernity in Indonesia's Grocery Market**\n\nFounded in 2017 and hailing from Jakarta, Indonesia, **Titipku** is carving out a niche as a super hyperlocal marketplace designed specifically for small and medium enterprises (SMEs) in the country's vibrant grocery sector. Initially rooted in the classic traditional wet market model—where anywhere between 200 to 1,000 merchants sell groceries in every neighborhood—Titipku is digitizing this entire ecosystem. Essentially, they are bringing old-school market shopping into the modern digital era.\n\nHere’s how it works: through the Titipku app, households can conveniently shop from various merchants within a local market, placing single orders for groceries sourced from multiple sellers. It’s a powerful concept when you consider there are 16,000 local markets across Indonesia, hosting around 8 million merchants. Titipku is tapping into a massive and often underrepresented segment of the retail market.\n\nAs a graduate of Y Combinator's S21 batch, Titipku has the guidance of industry leaders, including their group partner, Gustaf Alstromer. Growth is tangible, with a dedicated team of 19 employees driving operations and customer engagement.\n\nWhat makes Titipku particularly appealing is its clear commitment to both consumer convenience and support for local entrepreneurs. The platform guarantees fresh products, offers free shipping, and ensures a vast selection with over 900,000 product choices from 6,000 different stalls. You can even schedule your delivery to suit your needs—a feature that adds a level of flexibility apparently rare in traditional grocery shopping.\n\nThe testimonials from users, including notable Indonesian figures, spotlight the positive impact of Titipku. Customers appreciate the practicality of being able to shop from multiple vendors in one go, receiving fresh products, and ultimately supporting local businesses going digital. \n\nTitipku is not just another delivery app; it's a platform that acknowledges the value of community interaction in shopping. In supporting local merchants, the company is also fostering the digital growth of Indonesia’s SME sector. \n\nYou can explore their offerings by visiting [Titipku’s website](https://titipku.com). If you’re in Indonesia and want fresher groceries delivered efficiently, they could very well be your go-to marketplace. After all, grocery shopping doesn’t have to be a hassle; with Titipku, it’s a breeze.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/51067263ded134bc9c83cb43496f51627c036f07.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192018Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=e906ae3fa103fbd65437fc647936c92e4a258a5b2b1932563ffc54877f05ff96",
    "social_links": [
        "https://id.linkedin.com/in/titipku-pt-terang-bagi-bangsa-749b1b142",
        "https://www.facebook.com/titipkuofficial/"
    ],
    "logo_path": "data/logos\\Titipku_logo.png"
}