{
    "links": "https://www.ycombinator.com/companies/tizeti",
    "name": "Tizeti",
    "headline": "ISP for Africa",
    "batch": "W17",
    "description": "Tizeti provides broadband internet services to densely populated urban centers in Africa. Tizeti is leveraging the large wireless capacity available with Wi-Fi and plummeting cost of solar panels to create a low CAPEX/OPEX network of owned and operated towers to offer disruptive, customer-friendly pricing for unlimited internet service right across Africa.",
    "activity_status": "Active",
    "website": "http://www.tizeti.com",
    "founded_date": null,
    "team_size": null,
    "location": "Lagos, Nigeria",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:telecommunications",
    "founders": [
        {
            "name": "Ifeanyi Okonkwo, Founder/Co  & Chief Operating Officer",
            "description": "Co-founder and Chief Operating Officer for Tizeti Inc has  over 17 years experience in the telecommunication industry.\nPrior to Tizeti, he worked with Blackberry (Research in  Motion) part of the team that started Blackberry in Nigerian and expansion to Ghana. He also worked at Eircom Ireland.\nHe has a B.Sc from University of Benin, Benin City,Nigeria  and an M.Sc from the University of  Salford UK. Currently focused on expansion to Francophone Africa",
            "linkedin": "https://www.linkedin.com/in/ifeanyi-okonkwo-a5005429?trk=nav_responsive_tab_profile"
        }
    ],
    "status": true,
    "generated_description": "### Tizeti: Bridging Africa with Affordable Internet\n\n**Overview**  \nTizeti is an innovative Internet Service Provider (ISP) located in Lagos, Nigeria, on a mission to transform internet access across Africa. Founded as part of Y Combinator's W17 batch, Tizeti focuses on delivering broadband internet services primarily to densely populated urban areas. Imagine a world where high-speed internet is not a luxury, but a standard—Tizeti aims to make that a reality.\n\n**How They Do It**  \nTizeti stands out by harnessing the power of solar energy and Wi-Fi technology. By establishing a network of solar-powered base stations, they leverage cost-effective solar panels to minimize operational expenses. This approach allows them to offer unlimited internet access at surprisingly low prices—a genuine disruption in the traditional ISP landscape.\n\n**Services Offered**  \n- **Unlimited Wi-Fi Internet**: From residences to businesses, Tizeti provides high-speed broadband and deploys public hotspots across various locations in Africa.\n- **WIFI.COM.NG**: Their flagship internet service brand tailored for residential needs.\n- **GhanaWiFi**: A service expansion catering specifically to the Ghanaian market.\n- **Hotspot Wi-Fi**: In strategic locations, Tizeti is deploying community Wi-Fi solutions.\n\n**Why It Matters**  \nAccess to the internet is a game-changer, particularly in Africa, where traditional infrastructure has lagged behind. Tizeti's unique model not only connects families and businesses but also empowers innovation and drives socioeconomic development in the region. They recognize that every click can lead to new opportunities, and they’re committed to making those connections happen.\n\n**The Team**  \nThe leadership team is packed with telecom veterans with extensive experience in companies like ExxonMobil, Microsoft, and PwC. This blend of knowledge and ambition helps Tizeti navigate the complexities of the African telecom sector.\n\n- **Kendall Ananyi** (CEO): With a Master's in Computer Engineering, Kendall brings over 19 years of expertise to the table.\n- **Ifeanyi Okonkwo** (COO): A master in Quality Management, Ifeanyi has vast telecommunications experience.\n- **Ikenna Uche** (CTO): With years in tech management and networking, Ikenna is a crucial figure in driving Tizeti's technology forward.\n- **Amanosi Okhakhu** (CFO): A seasoned finance expert, Amanosi ensures the company's fiscal health while navigating diverse sectors.\n\n**Investors**  \nTizeti has attracted attention from notable investors, including Y Combinator, which signifies the potential impact and scalability of their business model.\n\n**Contact and Future Endeavors**  \nTizeti encourages inquiries via multiple channels and is always on the lookout for new opportunities to expand its footprint across Africa. Their vision is clear: By connecting more people with reliable internet, they are not just shaping the present but are also paving the way for the future.\n\nIf you're curious to know more or get involved, check them out at [Tizeti](http://www.tizeti.com).\n\nIn a nutshell, Tizeti isn't just about providing internet; they're about creating a connected Africa, where everyone has the opportunity to thrive in the digital age.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/d94b7960163fb726c3189b1697f770cc87f8155d.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192018Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=c401af88c8c91cc9d23318e884e9b6b74a9c37065bc0559e3e568a4525046120",
    "social_links": [
        "https://www.crunchbase.com/organization/tizeti"
    ],
    "logo_path": "data/logos\\Tizeti_logo.png"
}