{
    "links": "https://www.ycombinator.com/companies/todos-comemos",
    "name": "Todos Comemos",
    "headline": "Taking from 1 to 100 the premade food industry in LATAM",
    "batch": "S20",
    "description": "With the mission of improving people's lives in LATAM by enabling pre-made food access to millions of people, TodosComemos is pushing forward the actual barriers of the industry in LATAM by: \r\n\n1. Developing pre-made and ready-to-eat healthy food above-edge technologies for the region, \r\n\n2. Enabling established products and brands of prepared food to go from 1 to 1000, offering them a competitive distribution one-stop solution to reach millions of new customers in a multichannel strategy\r\n\n3. Building the first pre-made food subscription service including both pre-made and ready-to-eat meals for all needs.",
    "activity_status": "Active",
    "website": "https://todoscomemos.com",
    "founded_date": 2020.0,
    "team_size": 62.0,
    "location": "Bogotá, Colombia",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:b2b; industry:logistics; industry:e-commerce; industry:food-tech",
    "founders": [
        {
            "name": "Mateo Cardenas Huertas, Founder",
            "description": "I am very passionate about the food industry, I have spent several years developing business models and technology to transform and innovate it.",
            "linkedin": "https://www.linkedin.com/in/mateocardenas/?locale=en_US"
        },
        {
            "name": "Santiago Espinosa, Founder",
            "description": "Jesus follower, happily married,  Dad and entrepreneur. Building TodosComemos to transform the food industry in LATAM taking it from 1 to 1000 in the premade food spectrum.\n\nFormerly Co-founder & CEO of enlau.co now Ubanku, Delirato, El Cotero. M.A, B.A. Economist.",
            "linkedin": "https://www.linkedin.com/in/santiagoespinosam/"
        }
    ],
    "status": true,
    "generated_description": "# Todos Comemos: Revolutionizing the Pre-made Food Landscape in LATAM\n\nTodos Comemos, founded in 2020 and hailing from Bogotá, Colombia, is on a mission to expand the pre-made food industry from 1 to 100. As part of Y Combinator’s S20 Batch, this innovative company is determined to transform how people in Latin America access healthy, convenient meals.\n\n## What They Do\n\nAt its core, Todos Comemos seeks to enhance lives by providing better access to pre-made food options. Here’s how they’re doing it:\n\n1. **Cutting-Edge Solutions**: The company is developing advanced technologies specifically for the pre-made food sector in LATAM. This approach ensures that local producers can offer healthier meal options that appeal to a wider audience.\n\n2. **Scaling Businesses**: Todos Comemos acts as a booster for established food brands, providing a one-stop distribution solution that allows them to scale rapidly—from reaching a handful of customers to thousands—through a multichannel sales strategy.\n\n3. **Subscription Services**: They are building the region's first subscription service that offers a diverse range of pre-made and ready-to-eat meals, catering to varying dietary needs and preferences.\n\n## Business Model\n\nTodos Comemos describes itself as more than just a service provider—it's a growth partner. They utilize an open book model, which means they transparently charge producers for operational costs alongside a 10% fee for using their logistics \"highway.\" \n\nTheir platform integrates sales, logistics, and trade marketing, allowing food producers to streamline their operations and thrive in both traditional and new sales channels. This includes fast delivery services and a robust cold supply chain for perishable goods.\n\n## Target Audience\n\nThe company targets local food producers looking to grow their market reach without the headache of managing complex logistics. By improving access to various sales channels—including convenience stores, pharmacies, and direct-to-consumer sales—they empower these producers to optimize their operations and maximize sales potential.\n\n## Success Stories\n\nTodos Comemos has already begun creating success stories, helping some businesses—like Franui—transition from zero sales to generating $150,000 a month within just two months. Their management team blends experience from the food tech and marketplace industries, with co-founders Santiago Espinosa and Mateo Cárdenas bringing their significant expertise to the table.\n\n## Future Goals\n\nThe overarching dream of Todos Comemos is to contribute to the development of a robust pre-made food industry in LATAM, fostering healthier lifestyles across the region. Their vision involves creating the largest food highway, significantly enhancing the efficiency of food distribution and access.\n\nBy focusing on strategic partnerships and technological innovation, Todos Comemos is poised to lead the charge in making pre-made food accessible to millions, effectively taking the industry from 1 to 100. \n\nFor more insights or to learn how to partner with them, visit their website at [Todos Comemos](https://todoscomemos.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/df2b710faf26999dd0b8df467d47520cc36b1b3b.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192019Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=6e158a223b1fc5f54cc07acb9ae43b05bd496f833711dc31b93720b0f92a7f58",
    "social_links": [
        "https://www.linkedin.com/company/todos-comemos/mycompany/",
        "https://www.facebook.com/TodosComemos/",
        "https://www.crunchbase.com/organization/todos-comemos"
    ],
    "logo_path": "data/logos\\Todos_Comemos_logo.png"
}