{
    "links": "https://www.ycombinator.com/companies/toko",
    "name": "Toko",
    "headline": "Learn English by speaking with an AI",
    "batch": "W22",
    "description": "Toko helps English learners in East Asia achieve speaking fluency. Through our mobile app, learners engage in short, realistic conversations with an AI and receive feedback on their grammar.\r\n\nWith over 500 topics, learners can practice real-world scenarios ranging from small talk to workplace discussions. Toko offers a low-pressure environment to help learners build up their confidence.\r\n\nWe make language fluency accessible to everyone - not just those with the means to meet 1:1 with a tutor.\r\n\nIn Taiwan (our first market), Toko is ranked top 3 in the App Store for Education!",
    "activity_status": "Active",
    "website": "https://tokotutor.com/",
    "founded_date": 2021.0,
    "team_size": 6.0,
    "location": "New York",
    "group_partner": "Dalton Caldwell",
    "group_partner_yc": "https://www.ycombinator.com/people/dalton-caldwell",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:ai-enhanced-learning; industry:education; industry:generative-ai; industry:machine-learning; industry:consumer; location:new-york",
    "founders": [
        {
            "name": "Jen Liu, Founder",
            "description": "Jen is the co-founder and CEO of Toko. Previously, she was an early engineer and product manager at Quizlet, leading teams around AI-powered learning, mobile subscriptions and international growth. She also founded Uplevel, a coach-matching concierge service. Jen graduated from MIT with a degree in Computer Science and Engineering.",
            "linkedin": "https://www.linkedin.com/in/jenkliu/"
        },
        {
            "name": "Erica Du, Founder",
            "description": "👩🏻‍💻 Co-Founder and CTO @ Toko \n👩🏻‍💼 Previously: Engineering @ Palantir, Codecademy, & Google; Research @ MIT & Cornell Tech\n👩🏻‍🏫 Speaks: English, Mandarin Chinese, and Spanish",
            "linkedin": "https://linkedin.com/in/ericacdu/"
        }
    ],
    "status": true,
    "generated_description": "**Company Name: Toko**\n\n**Mission**: Toko aims to help users learn English by engaging in conversation with an AI.\n\n**Overview**: Founded in 2021 and part of Y Combinator's Batch W22, Toko started its journey in Taiwan, focusing on aiding English learners in East Asia to achieve speaking fluency. They recognized a gap in accessible language tutoring—where traditional one-on-one sessions could be cost-prohibitive. The solution? A mobile app that allows learners to practice speaking with an AI, providing instant feedback on grammar and language usage.\n\nWith over 500 topics at their disposal, Toko facilitates realistic conversations that cover a spectrum of scenarios from casual small talk to professional workplace discussions. This emphasis on real-world engagement creates a low-pressure environment, which is especially critical for building confidence among learners.\n\n**Unique Offerings**: \n- **Personal AI Tutor**: Users can converse with an AI, receiving suggestions for grammar improvements and pronunciation corrections, similar to a traditional tutor.\n- **Diverse Content**: Available topics range from career success to travel and conversational skills, all designed by expert educators.\n- **Flexible Learning**: Toko allows users to dictate the flow of their learning, adjusting their pacing and even experimenting with accents.\n\n**User Success**: Feedback from learners highlights significant improvements in their speaking abilities. Many have praised Toko for its personalized feedback, which they found even more specific than traditional tutoring methods.\n\n**Market Presence**: In Taiwan, Toko secured a place in the top 3 education apps on the App Store, and they boast over 15,000 five-star reviews from satisfied users.\n\n**Team and Location**: Based in New York, Toko operates with a compact team of six dedicated employees, co-founded by MIT alumni Jen and Erica, and backed by Group Partner Dalton Caldwell of Y Combinator.\n\n**Tags**: The company encapsulates several key themes including AI-enhanced learning, education, generative AI, and machine learning.\n\n**Website**: More details and resources can be found at [Toko's official website](https://tokotutor.com).\n\n**Conclusion**: Toko is carving out a unique niche in the language education market by harnessing AI to provide personalized, affordable, and flexible English-learning solutions. By focusing on user confidence and real-world conversation practice, Toko positions itself as a transformative tool for English learners across the globe.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/5add69997bce1dfdcc8022ec8270c3a43cf9e031.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192020Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=3cd84a416d8070029f21a2bfe95886f3676e7351088466992d6202d5dac7e73e",
    "social_links": [
        "https://www.facebook.com/tokotutor"
    ],
    "logo_path": "data/logos\\Toko_logo.png"
}