{
    "links": "https://www.ycombinator.com/companies/toma",
    "name": "Toma",
    "headline": "AI Workforce for Automotive Dealerships",
    "batch": "W24",
    "description": "At Toma, we aim to become the Microsoft/OpenAI of the Automotive industry by supplying a fully integrated AI + software suite to tens of thousands of profitable automotive dealers in America, and then worldwide.\r\n\nStep 1 is to provide the world’s best voice AI solution for the automotive industry, serving departments from service to sales to finance to information technology. Toma’s voice agents do thousands of AI calls every day and generate millions of dollars worth of revenue for auto dealerships.\r\n\nThe automotive industry is a sleeping giant contributing trillions of dollars to the GDP. The industry and its processes are ready for disruption. Toma is bringing AI to all operations in the industry while working hand-in-hand with some of the biggest names such as the Car Dealership Guy, and public companies like Lithia Motors and Cox Automotive. Toma is backed best investors in Silicon Valley and the Automotive industry.",
    "activity_status": "Active",
    "website": "http://www.toma.com/",
    "founded_date": 2024.0,
    "team_size": 4.0,
    "location": "San Francisco",
    "group_partner": "Tom Blomfield",
    "group_partner_yc": "https://www.ycombinator.com/people/tom-blomfield",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:saas; industry:operations; industry:ai; industry:automotive; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Monik Pamecha, Founder",
            "description": "Co-founder and CEO at Toma",
            "linkedin": "https://linkedin.com/in/monikp"
        },
        {
            "name": "Anthony Krivonos, Founder",
            "description": "Co-founder @ Toma",
            "linkedin": "https://linkedin.com/in/anthonykrivonos"
        }
    ],
    "status": true,
    "generated_description": "**Toma: The Future of AI in Automotive Dealerships**\n\nFounded in 2024 as part of Y Combinator's Batch W24, Toma has set its sights on revolutionizing the automotive industry with a cutting-edge AI workforce tailored specifically for dealerships. Based in San Francisco, this lean team of four is driven by a singular mission: to become the Microsoft or OpenAI of the automotive sector.\n\n### The Vision\n\nToma aims to leverage AI to transform the way automotive dealerships operate, tapping into an industry that's essentially a sleeping giant, contributing trillions to the GDP. Their plan? Start with a world-class voice AI solution that enhances all aspects of dealership operations—from service to sales, and beyond. Currently, Toma’s voice agents handle thousands of calls daily, generating millions in revenue for their clients. Think of them as digital assistants that seamlessly integrate into the existing workflows of dealerships, making processes easier and more efficient.\n\n### Strategic Partnerships and Backing\n\nToma has positioned itself alongside heavyweight players in the industry, including Car Dealership Guy and big public companies like Lithia Motors and Cox Automotive. Their technology isn’t just innovative; it’s backed by some of the best investors in Silicon Valley, which is crucial for credibility and growth.\n\n### Features and Capabilities\n\nWhat sets Toma apart is its robust, customizable AI suite that includes:\n\n- **Voice AI for All Departments**: Whether it’s service booking, sales inquiries, or financing questions, Toma’s technology is designed to cover it all, enhancing customer experience while saving precious time.\n  \n- **Natural and Multilingual Communication**: Toma’s voice agents are designed to sound human-like, complete with the ability to converse in over 30 languages. This is crucial in a diverse marketplace.\n\n- **Integrated Workflows**: Toma can connect with popular dealership management software and scheduling tools, minimizing disruption while maximizing efficiency.\n\n- **Self-Improving AI**: As Toma gathers data from interactions, it learns what works best, continually improving its responses and effectiveness.\n\n### The Early Impact\n\nFeedback from early adopters reveals remarkable results. For instance, one dealership reported saving around 43 hours per month in staff time, allowing their team to focus more on in-person engagements. Another dealership credits Toma with generating over $20,000 in additional monthly revenue.\n\n### The Takeaway\n\nToma is not just another tech startup; it represents a significant step forward in an industry that’s ripe for disruption. As the automotive sector embraces AI, Toma is positioned to lead the charge, helping dealerships unlock new levels of efficiency and revenue generation. For anyone in the automotive space looking to stay relevant, Toma’s offerings are worth exploring.\n\nFor more details, visit their website at [toma.com](http://www.toma.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/08510df37b5cc8b746c2db01223f8e6905d1014e.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192021Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=7033983aba9859cb6d5f574855a39f19e947209fa16947361cea56c7a7e84537",
    "social_links": [
        "https://www.linkedin.com/company/tomavoice/",
        "https://twitter.com/toma_voice",
        "https://www.facebook.com/tomavoiceai",
        "https://github.com/toma-so/toma"
    ],
    "logo_path": "data/logos\\Toma_logo.png"
}