{
    "links": "https://www.ycombinator.com/companies/topline-pro",
    "name": "Topline Pro",
    "headline": "Generative AI powered Shopify for home service professionals",
    "batch": "W21",
    "description": "Topline Pro (formerly ProPhone) is a Generative AI platform enabling home service businesses to be easily discovered, trusted and booked, directly. The AI-driven interface rapidly and affordably creates a custom, SEO-optimized website along with a application to help sync content to and from local listings, put social media communications on autopilot and enable the business owner to easily get paid online.",
    "activity_status": "Active",
    "website": "https://www.toplinepro.com",
    "founded_date": 2020.0,
    "team_size": 28.0,
    "location": "New York",
    "group_partner": "Dalton Caldwell",
    "group_partner_yc": "https://www.ycombinator.com/people/dalton-caldwell",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:saas; location:new-york",
    "founders": [
        {
            "name": "Nick Ornitz, Founder",
            "description": "Nick is the Co-Founder and CEO of Topline Pro. Nick has a background working and consulting in the construction industry focusing on building technologies. He has focused primarily on go-to-market strategy and sales. He graduated Cornell university with a degree in chemical engineering and has completed one year of Harvard Business School before taking leave to work on ProPhone full time. \n\nIn his free time, Nick likes almost anything in nature including hiking, sailing, skiing and scuba diving.",
            "linkedin": "https://www.linkedin.com/in/nick-ornitz-766935a5/"
        },
        {
            "name": "Shannon Kay, Founder",
            "description": "Shannon is the co-founder and CPO of ProPhone. Prior to ProPhone, she completed her first year of Harvard MS in Engineering Sciences / MBA dual degree. She has a background in data and analytics and systems engineering. She's an amateur photographer, ice cream aficionado, and swimming enthusiast.",
            "linkedin": "https://www.linkedin.com/in/shannonekay/"
        }
    ],
    "status": true,
    "generated_description": "### Topline Pro: Revolutionizing Home Service Marketing\n\n**Introduction:**\nTopline Pro, formerly known as ProPhone, is a trailblazing startup founded in 2020 and part of Y Combinator Batch W21. Based in New York and helmed by a team of 28, the company harnesses the power of Generative AI to streamline marketing for home service professionals. \n\n**Mission:**\nThe mission of Topline Pro is crystal clear: to create a Generative AI-powered Shopify experience tailored specifically for home service businesses, making them easily discoverable, trustworthy, and booked directly by consumers.\n\n**What They Do:**\nTopline Pro’s platform is designed to eliminate the headaches of online marketing for home service businesses. They rapidly generate custom, SEO-optimized websites at an affordable price. Once established, these websites effectively sync content across local listings, automate social media communications, and facilitate seamless online payments. In more tangible terms, their services help businesses:\n\n1. **Be Discovered** - Generate AI-optimized websites that make a strong online presence.\n2. **Be Trusted** - Collect and showcase customer reviews to enhance reputation.\n3. **Be Booked** - Simplify the booking process with features like automated messaging and online payments.\n\nIn just two years, Topline Pro has launched over 7,500 unique websites across the United States, demonstrating a clear commitment to helping small businesses thrive without the burdensome costs of traditional marketing strategies.\n\n**Services Offered:**\n- **ProSite:** A rapid website build service that establishes an online presence in a day.\n- **SEO Optimization:** Ensures that home service professionals rank higher in search results.\n- **Marketing Automation:** Autopilot social media campaigns optimize online engagement.\n- **Payment Solutions:** Built-in payment processing simplifies client transactions.\n\n**Company’s Unique Value:**\nTopline Pro's AI-driven approach allows it to offer free initial website samples and low monthly costs—without any hidden fees. Their promise of an easy, user-friendly experience enables business owners to focus more on what they do best: delivering excellent services, while Topline Pro manages their online visibility and client acquisition strategies.\n\n**Team and Leadership:**\nLed by an experienced group partnered with Dalton Caldwell as their Group Partner, the team at Topline Pro exemplifies innovation and dedication to empowering home service professionals.\n\n**Conclusion:**\nIn a world increasingly dominated by digital marketing, Topline Pro stands out as a supportive ally for home service professionals in their journey to modernize their businesses. By providing powerful tools to enhance discoverability, trust, and bookings, they are fundamentally changing the game for small service-based companies. Whether you’re a landscaper, contractor, or cleaner, Topline Pro is keen on proving that with the right technology, small businesses can thrive without getting bogged down by complex marketing challenges.\n\nFor those looking to supercharge their online presence and boost customer acquisition, Topline Pro is definitely worth a close look.\n\n[Learn more at Topline Pro's official site](https://www.toplinepro.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/9dd91517af026ad0d42248222c3db1c1217a035a.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192022Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=201b330aca3a7e39824ddc259c8c8eed87c7d38daed07d1b6dc32431846a65e7",
    "social_links": [
        "https://www.linkedin.com/company/prophoneapp",
        "https://www.facebook.com/gettoplinepro",
        "https://www.crunchbase.com/organization/prophone"
    ],
    "logo_path": "data/logos\\Topline_Pro_logo.png"
}