{
    "links": "https://www.ycombinator.com/companies/topship",
    "name": "Topship",
    "headline": "Flexport for African Merchants - Building the OS for Global Logistics",
    "batch": "W22",
    "description": "Topship is the easiest way for African businesses to export/import cargo, freight and parcels to their suppliers, distributors and customers.  We are building Flexport for Africa.\r\n\nOur goal is to build a Global Distribution System that makes delivery of parcels, cargo and freight easy for African businesses.",
    "activity_status": "Active",
    "website": "https://topship.africa/",
    "founded_date": 2020.0,
    "team_size": 20.0,
    "location": "Lagos, Nigeria",
    "group_partner": "Michael Seibel",
    "group_partner_yc": "https://www.ycombinator.com/people/michael-seibel",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:b2b; industry:logistics; industry:e-commerce; industry:supply-chain",
    "founders": [
        {
            "name": "Moses Enenwali, Founder",
            "description": "Moses spent over 8 years working at the intersection of technology and supply chain. \nHe has a background in finance and consulting, and worked as an Associate at EY, specialising in transfer pricing, tax planning, and corporate finance. As a college student, Moses founded Timewall Coffee, focused on importing and distributing coffee beans from rural Nigeria to local coffee shops in the UK.",
            "linkedin": "https://www.linkedin.com/in/moses-o-enenwali-b37694192/"
        },
        {
            "name": "Junaid Babatunde, Founder",
            "description": "• Built largest auto financing platform in Africa - Autochek.\n• Lead Engineer at Cars45 (acquired).\n• Ex founder of Nigeria’s first online ticketing platform - Ticketmax",
            "linkedin": "https://www.linkedin.com/in/junaid-babatunde-9a7929147/"
        }
    ],
    "status": true,
    "generated_description": "Topship is a logistics company based in Lagos, Nigeria, launched in 2020 with one clear mission: to be the \"Flexport for African Merchants.\" Essentially, they're out to revolutionize the shipping landscape for African businesses, creating an operating system for global logistics that simplifies the export and import processes.\n\nWith an energetic team of 20 and part of the Y Combinator Batch W22, Topship is focused on making cargo, freight, and parcel delivery a streamlined experience for African merchants. Their vision commits to establishing a Global Distribution System that makes shipping easy, affordable, and accessible, tailored specifically for the African context.\n\n### What They Offer\n\nTopship provides several services designed to cater to the diverse needs of businesses in the region:\n\n- **GateWay**: Tailored solutions for logistics companies.\n- **Shop & Ship**: A service that lets clients shop internationally without worrying about customs fees upon arrival in Nigeria.\n- **Exports & Imports**: Facilitated shipping for sending and receiving packages across borders.\n- **Sea Freight**: Solutions for larger shipments.\n- **Delivery Options**: They promise streamlined delivery routes both internationally (to over 200 locations) and inter-state within Nigeria (from major cities like Lagos, Abuja, and Ibadan).\n\n### Target Audience\n\nTopship's services are built for e-commerce brands, logistics companies, and businesses of all sizes looking to optimize their shipping operations. They also provide an API for developers, enabling easy integration into applications or websites, and plugins for platforms like Shopify and WooCommerce, making them a seamless choice for online businesses.\n\n### Why It Matters\n\nLogistics in Africa can be a convoluted landscape filled with hurdles. Topship is addressing this by leveraging technology and local insights, making shipping not just simpler, but also more reliable and efficient. Their approach is refreshing, particularly as they seek to empower small and medium enterprises across the continent to compete on a global scale.\n\n### Partnerships and Credibility\n\nBacked by reputable partners like UPS, FedEx, and DHL, Topship helps instill trust and reliability in their service. Testimonials from satisfied customers underscore their success in providing practical solutions for their shipping needs.\n\n### The Path Ahead\n\nLooking forward, Topship continues to enhance its offerings and optimize its platform, focusing on automation and innovation — essential for any logistics provider serious about making waves in an evolving global marketplace. \n\nIf you're in need of reliable shipping solutions or looking to simplify your logistics, Topship is a partner worth considering. You can learn more about their services on [Topship's website](https://topship.africa).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/0f594758634ce0f01c75f1b8afa481b55ef6da6f.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192022Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=6e936314f78e8bd612e53130be637f6cca65346188d9e80f4cfa0a0d7d875b44",
    "social_links": [
        "https://www.linkedin.com/company/68248774/admin/",
        "http://twitter.com/topshipafrica",
        "https://www.crunchbase.com/organization/topship"
    ],
    "logo_path": "data/logos\\Topship_logo.png"
}