{
    "links": "https://www.ycombinator.com/companies/torch",
    "name": "Torch",
    "headline": null,
    "batch": "W18",
    "description": "Torch is a learning and development company that helps employers manage and measure employee growth at scale. Customers can draw from a pool of over 6000 mentors and coaches to pair with high performers and new managers at any layer of the organization. \r\n\nTorch was founded by a team of executive coaches and experienced psychologists who are passionate about helping all professionals perform at their highest level.\r\n\nTorch is on a mission to empower managers to thrive in high growth, high-performance cultures by building the self-awareness and skills required to manage and lead effectively.",
    "activity_status": "Active",
    "website": "https://torch.io/",
    "founded_date": 2017.0,
    "team_size": 130.0,
    "location": "San Francisco",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:marketplace; industry:saas; industry:b2b; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Cameron Yarbrough, Founder/CEO",
            "description": "Cameron Yarbrough is cofounder/CEO at Torch.  Before cofounding Torch, he practiced for several years in the field of clinical psychology, and grew a team of over 50 psychologists and psychotherapists at his previous company.  He worked at Stanford Graduate School of Business as a leadership facilitator, where he developed the initial inspiration to launch Torch.  Cameron has blended years of training in Vipassana meditation into his approach to leadership and software development.",
            "linkedin": "https://www.linkedin.com/in/cameron-yarbrough-60579948/"
        }
    ],
    "status": true,
    "generated_description": "**Company Overview: Torch**\n\nFounded in 2017 in San Francisco, Torch operates as a learning and development company that specializes in leadership coaching and employee growth. Originally emerging from the enthusiasm of executive coaches and psychologists, Torch is aimed at scaling the management and measurement of employee development across organizations.\n\n**Mission and Approach**\n\nTorch is committed to empowering managers and fostering high-performance cultures. Their philosophy revolves around developing self-awareness and the essential skills needed for effective leadership. Torch provides organizations access to a pool of over 6,000 mentors and coaches, enabling tailored support for both high performers and new managers, irrespective of their level within the company.\n\n**Team and Reach**\n\nTorch has assembled a robust team of approximately 130 employees and has gained recognition through its participation in Y Combinator’s W18 batch. Their innovative approach is tagged as part of the B2B SaaS marketplace, highlighting its business model focused on creating valuable, actionable coaching experiences for enterprises.\n\n**Services**\n\nTorch offers a variety of leadership development and coaching solutions. Their offerings include:\n\n- **Individual Coaching:** Tailored one-on-one sessions designed to meet leaders where they are in their growth journey.\n- **Group Coaching:** Collaborative environments where leaders can learn from each other while aligning with organizational goals.\n- **Enterprise Solutions:** Coaching designed to suit the complexities of large organizations, ensuring personalized growth alongside variety at scale.\n\nThe platform truly stands out for its adaptability, allowing organizations to customize their coaching experience to fit specific cultural and operational needs.\n\n**Key Features and Values**\n\n1. **Contextual Coaching:** Aligns each coaching conversation with the unique dynamics and challenges of an organization.\n2. **Actionable Insights:** Leverages technology to surface leadership trends and growth patterns that enhance organizational performance.\n3. **Exceptional Coaches:** Torch boasts an impressive roster of coaches with profound professional experience and coaching expertise to drive significant outcomes.\n\n**Success Metrics**\n\nAccording to internal data, a solid 80% of leaders who have undergone Torch coaching report increased confidence when navigating change, showcasing the effectiveness of their tailored coaching approaches.\n\n**Conclusion**\n\nIn an age where leadership roles are more complex than ever, Torch is redefining how organizations cultivate their leaders. With their innovative coaching model, they are not just facilitating individual growth but transforming entire organizational cultures capable of adapting to the fast-paced business landscape. For more information, visit [Torch](https://torch.io).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/3383ecc3942cf93fc7e05f957ffc16ac2f588914.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192022Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=b9a36879a35e705bf642758d419990ad97c1e206b385a98d118b23a9ec45847e",
    "social_links": [
        "https://www.linkedin.com/company/torch-labs/",
        "https://twitter.com/torchlabs",
        "https://www.facebook.com/torchlabs/?ref=bookmarks",
        "https://www.crunchbase.com/organization/torch"
    ],
    "logo_path": "data/logos\\Torch_logo.png"
}