{
    "links": "https://www.ycombinator.com/companies/tower",
    "name": "Tower",
    "headline": "Legal due diligence platform powered by AI",
    "batch": "W24",
    "description": "Tower accelerates transactional due diligence via an AI-powered, centralized diligence platform. By consolidating disparate diligence workflows, Tower helps lawyers stay organized, spot issues earlier, and close deals faster.",
    "activity_status": "Active",
    "website": "https://withtower.com",
    "founded_date": 2024.0,
    "team_size": 2.0,
    "location": "San Francisco",
    "group_partner": "Harj Taggar",
    "group_partner_yc": "https://www.ycombinator.com/people/harj-taggar",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:artificial-intelligence; industry:workflow-automation; industry:legal; industry:legaltech; industry:ai-assistant; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Adam Dorfman, Founder",
            "description": "I am the co-founder & CEO of Tower; we're building an AI platform for legal due diligence. Previously I was an early engineer at Float (corporate card for Canada), built software for speaker & microphone manufacturing at Apple, built AI software & performed AI computer-vision research at DarwinAI (acq. Apple). I studied Mathematical Physics at the University of Waterloo, where I co-oped in data-science/ML and software engineering.",
            "linkedin": "https://linkedin.com/in/adam-dorfman"
        },
        {
            "name": "Andy Zhang, Founder",
            "description": "Co-founder and CTO @ Tower; we're building joyful software so in-house counsels can leave work at 5PM everyday. Before Tower I was the founding engineer of ArenaX Labs, a Web3 AI Gaming startup, where I helped the company from inception and zero users to Series A and a community of hundreds of thousands. Before this I did research at an investment trust, specializing in reinforcement learning and cool assets like crypto. I graduated from UWaterloo BCS and Laurier BBA.",
            "linkedin": "https://www.linkedin.com/in/andy-z/"
        }
    ],
    "status": true,
    "generated_description": "**Tower: Revolutionizing Legal Due Diligence with AI**\n\nFounded in 2024 and part of Y Combinator's Batch W24, Tower is a promising startup based in San Francisco that aims to transform the legal due diligence landscape. Its mission centers around creating a centralized diligence platform powered by artificial intelligence, which streamlines and accelerates transactional due diligence for legal professionals.\n\nThe problem Tower addresses is all too familiar in the legal field: the complexity and disorganization of traditional diligence workflows. By consolidating these disparate processes into one intuitive platform, Tower helps lawyers keep their tasks organized, identify issues much earlier in the transaction process, and ultimately close deals faster. In a world where speed and efficiency are paramount, Tower positions itself as a critical tool for law firms looking to optimize operations.\n\nWith a compact team of just two employees and supported by Group Partner Harj Taggar, Tower's nimble structure allows it to innovate and respond rapidly to the needs of its users. They're building something crucial for the legal tech space—a spot dedicated to artificial intelligence, workflow automation, and comprehensive legal solutions.\n\nCurrently, users interested in the platform can join a waitlist for early access, indicating a growing demand for what Tower is offering. As they continue to develop their capabilities, Tower is poised to become a key player in the legaltech arena.\n\nFor more information or to express interest, check out their website at [Tower](https://withtower.com).\n\nIn summary, Tower is not just another legal tech tool; it’s an ambitious endeavor with the potential to reshape how legal diligence is approached, all thanks to the power of AI. If you're in the legal field and feeling bogged down by the traditional processes, this might just be the innovation you’ve been waiting for.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/6f8fb0becfdab14f862607ff13f7afb353d731b4.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192022Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=f01de3acb3fe15a6978ad988a418700a20c8a6543351650f2e83e57228783e0d",
    "social_links": [
        "https://www.linkedin.com/company/tower-software-labs/",
        "https://twitter.com/trytower/",
        "https://github.com/tower-software-labs"
    ],
    "logo_path": "data/logos\\Tower_logo.png"
}