{
    "links": "https://www.ycombinator.com/companies/trackchain",
    "name": "TrackChain",
    "headline": "AI-Logistics Operating System for Shippers & 3PLs",
    "batch": "S21",
    "description": "TrackChain OS unifies all communications, data, and transportation processes into a single intelligent platform without disrupting existing workflows.\r\n\nOur platform revolutionizes end-to-end logistics operations through an intuitive interface, powered by advanced AI agents and seamless API integrations. With zero-training required and instant setup, teams can immediately begin using our freight management features, automating everything from carrier procurement, intelligent load assignment, real-time shipment tracking, automated freight audit & payments, to predictive transportation analytics.\r\n\nWe transform logistics operations, delivering proven results. Our customers reduce time spent on daily freight tasks by 80% (saving 40+ hours per week), freeing teams to focus on strategic initiatives. Through automated workflows and data-driven decisions, they achieve 30% reduction in transportation costs - translating to millions in annual savings.",
    "activity_status": "Active",
    "website": "https://trackchain.io",
    "founded_date": 2021.0,
    "team_size": 20.0,
    "location": "Monterrey, Mexico",
    "group_partner": "Harj Taggar",
    "group_partner_yc": "https://www.ycombinator.com/people/harj-taggar",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:generative-ai; industry:logistics; industry:supply-chain",
    "founders": [
        {
            "name": "Eduardo Narvaez, Founder",
            "description": "Founder and CEO\n\nWith over 10 years of experience in the logistics industry, I have had the privilege of being involved in our family's transport business, a company with over 20 years of standing in the sector. I've been engaged in projects centered on Environmental Economics, emission reductions in the Supply Chain, and Global Change. I've had the honor of collaborating with esteemed organizations such as the Caixa Bank Foundation, the Generalitat of Catalunya, and the Club of Rome.",
            "linkedin": "https://www.linkedin.com/in/eduardoakil/"
        },
        {
            "name": "Hugo Alvarez, Founder",
            "description": "Founder and CFO-Growth \n\nI worked as director of development of financial algorithms in Microbit, a company based in CDMX, and I was an advisor on investment strategies at Cretum Capital Partners, a company that specializes in investment management, corporate advisory services, and more informed decision making with Bigdata, a place were I learned software coding. My family is working in international trade for 10 years ago.",
            "linkedin": "https://www.linkedin.com/in/hugo-alvarez-248867132/"
        }
    ],
    "status": true,
    "generated_description": "TrackChain is a modern logistics startup that launched in 2021 and is part of Y Combinator’s S21 batch. Nestled in Monterrey, Mexico, the company has a lean team of 20 dedicated professionals, led by Group Partner Harj Taggar. Their mission? To create an AI-powered Logistics Operating System designed specifically for shippers and third-party logistics (3PL) providers.\n\nInitially branded as TrackChain OS, the platform integrates all communication, data, and transportation processes into a single, intelligent system. The goal is straightforward: streamline logistics without disrupting current workflows. This doesn’t just sound good on paper; it delivers actual results. Users report an astonishing 80% reduction in time spent on daily freight tasks—around 40 hours a week saved! Not only that, their automated features help to cut transportation costs by 30%, translating into millions in annual savings.\n\nSo what exactly does TrackChain do? The platform offers intuitive freight management capabilities that automate tasks like carrier procurement, intelligent load assignment, real-time shipment tracking, automated audits, payments, and predictive analytics. Its superintelligence AI tool, called Tiriel Copilot, is particularly noteworthy. This feature rapidly extracts critical data, automates Proof of Delivery audits, and provides real-time visibility, allowing teams to shift from reactive to proactive logistics management.\n\nTrackChain's overarching vision is to make logistics flexible, fast, and transparent. With their seamless integrations and zero-training setup, companies can enhance their operational efficiency almost immediately. They cater to a multi-industry market, helping businesses streamline their logistics processes comprehensively.\n\nIf you’re interested in reinventing your logistics workflow, TrackChain offers demos on their website [trackchain.io](https://trackchain.io). The future of logistics is about harnessing AI to create a more efficient and visible operation, and TrackChain is leading the charge.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/ac549fb1bb1854fb449a4b69ac3bfa3538198488.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192024Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=ecc9dc62b00c11c9049b3fab0885b06e31393bcb4c0e4b16a234244c95b60683",
    "social_links": [
        "https://www.linkedin.com/company/trackchain",
        "https://twitter.com/TrackChain_io",
        "https://www.facebook.com/trackchain.io/",
        "https://www.crunchbase.com/organization/trackchain"
    ],
    "logo_path": "data/logos\\TrackChain_logo.png"
}