{
    "links": "https://www.ycombinator.com/companies/tranqui-finanzas",
    "name": "Tranqui Finanzas",
    "headline": "Debt Management for Latin America.",
    "batch": "S19",
    "description": "Tranqui is a debt collection company that has revolutionized the industry with its digital-first approach. Utilizing cutting-edge analytics and machine learning, Tranqui offers a more efficient and effective debt collection experience for users.\r\n\nOur technology-driven approach enables us to analyze user data and behavior patterns to develop personalized communication and repayment plans. This ensures that our users receive a tailored experience that is optimized for their individual needs, resulting in a higher success rate for debt repayment.\r\n\nWith Tranqui, users can manage their debt repayment on their own terms, from the comfort of their own homes, thanks to our convenient and flexible digital channels. Our approach not only improves the debt collection experience for users but also helps to improve their overall financial health.\r\n\nChoose Tranqui for a better debt collection experience, with 2x the effectiveness of traditional debt collection methods.",
    "activity_status": "Active",
    "website": "https://tranquifinanzas.com/",
    "founded_date": 2018.0,
    "team_size": 27.0,
    "location": "Cali, Colombia",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech",
    "founders": [
        {
            "name": "Jorge Gallego, Founder",
            "description": "Engineer with master's degree in data science.",
            "linkedin": "https://www.linkedin.com/in/gallegojorge/"
        },
        {
            "name": "Andres Buitrago, Founder",
            "description": null,
            "linkedin": "https://www.linkedin.com/in/andresbuitragof/"
        }
    ],
    "status": true,
    "generated_description": "**Tranqui Finanzas: Revolutionizing Debt Management in Latin America**\n\n**Overview:**\nFounded in 2018 and based in Cali, Colombia, Tranqui Finanzas started as Tranqui, a forward-thinking debt collection company with a mission to reshape debt management across Latin America. As a proud member of Y Combinator’s Summer 2019 batch, the company combines innovative technology with a customer-centric approach to deliver superior debt collection services.\n\n**Mission:**\nTranqui's primary goal is straightforward: to provide effective debt management solutions in Latin America that cater to the unique needs of its users. By leveraging a digital-first methodology, they aim to enhance the overall debt repayment experience, making it more accessible and efficient.\n\n**Technology-Driven Approach:**\nAt its core, Tranqui harnesses cutting-edge analytics and machine learning to analyze user data and behavior patterns. This allows them to craft personalized communication and repayment plans that resonate with each user's circumstances. The result? A tailored experience that promotes higher success rates in collection, doubling the effectiveness of traditional methods. \n\n**User Experience:**\nTranqui empowers users to take control of their debt repayment from the comfort of their own homes via flexible digital channels. This not only streamlines the process but also fosters better financial health for their users, helping them manage debts on their terms.\n\n**Team & Structure:**\nWith a dedicated team of 27 employees, Tranqui is built on a culture of innovation and empathy. They collaborate with their partner, Nan, to continuously enhance their services and technology.\n\n**Why Choose Tranqui?**\nIf you’re looking for a debt collection service that prioritizes a personalized and efficient experience, Tranqui Finanzas offers a compelling choice. They exist to simplify, improve, and enrich the debt repayment journey, proving that with the right tools, debt management doesn’t have to be a headache.\n\nFor more details, check their website: [tranquifinanzas.com](https://tranquifinanzas.com). \n\nIn a world inundated with old-school debt collection practices, Tranqui Finanzas is a much-needed breath of fresh air, forging a path toward better financial health for individuals in Latin America.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/342cb98c9dd41a0d986d185a72947bc601f3a52e.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192025Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=3d17276485634a0d85d4376ec712938b1fa1929f54bfae54960d8f4be2186cf6",
    "social_links": [
        "https://www.linkedin.com/company/tranquifinanzas/",
        "https://www.facebook.com/TranquiFinanzas/",
        "https://www.crunchbase.com/organization/tranqui"
    ],
    "logo_path": "data/logos\\Tranqui_Finanzas_logo.png"
}