{
    "links": "https://www.ycombinator.com/companies/transastra-corporation",
    "name": "TransAstra Corporation",
    "headline": "Orbital logistics: Unleashing space industry, from Earth to asteroids",
    "batch": "S21",
    "description": "With five issued patents covering our core business lines, and more than a dozen additional patents pending this year and more than $5M in revenue, TransAstra is developing the technologies that will drive the rapidly expanding space economy. Our breakthrough Omnivore propulsion system can propel spacecraft, including our Worker Bee commercial OTV with water or virtually any other fluid as a propellant using only concentrated sunlight as a power source. Omnivore is faster, cheaper, and more practical than electric propulsion while being substantially less expensive, safer, and more operationally flexible than legacy chemical propulsion systems. Our Sutter Telescope System can identify and locate resource-rich asteroids and orbital debris that existing technologies can’t find and works synergistically with our Worker Bee OTV for orbital logistics. For government customers, Sutter can identify dark fast-moving objects between Earth and the Moon which currently evade detection, a critical issue for national defense and a key need of the Space Force. We are already using Sutter in ground-based observatories and will begin commercial sales of Sutter SDA data next month having tracked dozens of faint moving objects in space already. Once launched into space, Sutter will be 300,000 times more cost effective than any other known telescope design and will revolutionize sense making in space.",
    "activity_status": "Active",
    "website": "https://www.transastra.com",
    "founded_date": 2016.0,
    "team_size": 8.0,
    "location": "Los Angeles, CA",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:space-exploration; location:los-angeles",
    "founders": [
        {
            "name": "Joel Sercel, Founder",
            "description": "An engineer of several disciplines and a pioneer with a proven track record in innovation, team leadership, technical architectural design, software design, systems engineering,space mission design, space propulsion technology, satellite design, enterprise process engineering, training, teaching, and public speaking. PhD in space propulsion and plasma physics from Caltech. Have successfully built and led teams ranging in size from two people to over 100.",
            "linkedin": "https://www.linkedin.com/in/joelsercel/"
        }
    ],
    "status": true,
    "generated_description": "**TransAstra Corporation**: Unlocking the Future of Space\n\nFounded in 2016 and part of Y Combinator's Summer 2021 batch, TransAstra Corporation is a forward-thinking company based in Los Angeles, California. Its mission revolves around **orbital logistics**, focusing on the bold idea of expanding human presence in space, particularly to asteroids. With the belief that asteroids hold the key to sustainable resources for humanity, TransAstra is working to harness these celestial bodies to support life beyond Earth.\n\n### Innovative Technology\n\nTransAstra stands out for its cutting-edge technology and robust patent portfolio—five patents issued and many more pending. One of their marquee inventions is the **Omnivore propulsion system**. This system utilizes concentrated sunlight to power spacecraft using water or various other fluids as propellant. It's touted as a revolutionary alternative to traditional propulsion systems, bringing advantages such as faster operation and drastically lower costs.\n\nAnother notable product is the **Sutter Telescope System**. Named after the site of California's gold rush, this technology is designed to identify resource-rich asteroids and track orbital debris—objects that current technologies have a hard time detecting. This capability is particularly crucial for national defense, as the Sutter can identify fast-moving, dark objects that threaten safety between Earth and the Moon.\n\n### Growing the Space Economy\n\nWith over $5 million in revenue and a team of eight employees, TransAstra is already making notable strides in the burgeoning space economy. The company operates on four crucial capabilities in asteroid mining: **Detect, Move, Capture, and Process**. Each capability is geared towards meeting both government and commercial needs, ensuring that TransAstra is well-positioned to lead in this frontier.\n\nThe company is gaining traction, having already tracked dozens of moving objects in space, and is gearing up for the commercial launch of its Sutter data services.\n\n### The Outlook\n\nTransAstra's founder, Dr. Joel Sercel, emphasizes the importance of **mindset** in advancing economic potential beyond Earth. He believes that fostering an optimistic vision for the future—a belief in resource abundance in space—will be fundamental to humanity's success in developing sustainable livelihoods beyond our planet.\n\nAs we continue to explore the possibilities of space, TransAstra Corporation is right at the frontier, aiming to enable not just exploration, but a thriving presence in the cosmos.\n\nFor more information, visit [TransAstra Corporation](https://www.transastra.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/9aba328e6f91dd9302cca497b9d6f724fa13f0db.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192025Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=57f57c24ad1bc7f326cdeab63519c03fad9599184b18fdbd57d11a1e9e432223",
    "social_links": [],
    "logo_path": "data/logos\\TransAstra_Corporation_logo.png"
}