{
    "links": "https://www.ycombinator.com/companies/transformity",
    "name": "Transformity",
    "headline": "Point-of-sale & Vertical SaaS for the $75B Liquor Industry",
    "batch": "S23",
    "description": "Transformity is empowering beer, wine & liquor stores with amazing technology. We bring enterprise-level sophistication to liquor retailers, giving them one integrated operating system for every part of their business. Our product integrates with distributors, automates manual work, and opens new sources of revenue.",
    "activity_status": "Active",
    "website": "https://transformity.tech/",
    "founded_date": 2023.0,
    "team_size": 3.0,
    "location": null,
    "group_partner": "Michael Seibel",
    "group_partner_yc": "https://www.ycombinator.com/people/michael-seibel",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": null,
    "founders": [
        {
            "name": "Param Bidja, Founder",
            "description": "Co-founder and CEO @ Transformity. Previously senior engineer at AWS. Love my parents so much that I'm building a company for them :)",
            "linkedin": "https://linkedin.com/in/parambidja"
        },
        {
            "name": "Jay Patel, Founder",
            "description": "Co-Founder and CTO @ Transformity. Ex-Software Engineer at Amazon. Owner of multiple retail businesses. Active GitHub Contributor.",
            "linkedin": "https://www.linkedin.com/in/patel-jay/"
        }
    ],
    "status": true,
    "generated_description": "### Transformity: Revolutionizing the Liquor Store Experience\n\n**Overview:**  \nFounded in 2023 and part of Y Combinator's Batch S23, Transformity is on a mission to modernize the $75 billion liquor industry with a comprehensive point-of-sale (POS) and vertical software-as-a-service (SaaS) platform tailored for liquor retailers. Based in an undisclosed location, the young company boasts a lean team of three, including founder and CEO Param Bidja.\n\n**What They Do:**  \nTransformity is all about making liquor retail operations smoother and more profitable. They provide a single integrated operating system that connects beer, wine, and liquor stores with their distributors, streamlining invoice processing, inventory management, and sales reporting. It's built by people who understand the industry—both Param and co-founder Jay Patel grew up in liquor retail environments. Their tech aims to reduce manual tasks, enhance efficiency, and ultimately unlock new revenue streams for their users.\n\n**Key Features:**\n- **Personalized Customer Experience:** Transformity helps retailers craft unique deals based on individual purchase histories, fostering customer loyalty.\n- **Automated Invoice Handling:** The platform automates the reception of invoices, ensuring inventory accuracy without manual data entry.\n- **Operations-Centric Design:** Every part of the system is designed to ease daily operations, from inventory counts to sales tax reporting.\n- **Integrated Distributor Pricing:** Users can seamlessly access discounts, pricing, and catalogs from distributors.\n- **Cloud-Based Access:** Retailers can manage their stores remotely without cumbersome in-house servers.\n- **Responsive Customer Support:** Transformity promises quick response times and on-site installation assistance.\n- **Multi-Store Management:** Owners with multiple locations can share databases, facilitating efficient side-by-side reporting and operations.\n\n**Testimonials:**\nUsers rave about the platform's user-friendliness and speed, with many noting that it significantly enhances their operational efficiency. For instance, Ashar from RK Wine & Spirits claims it’s user-friendly and reliable, while Nick Conti, a top retailer, asserts that Transformity is essential for success in liquor retail.\n\n**The Team Behind Transformity:**  \n- **Param Bidja** (Founder & CEO): A former senior engineer at Amazon, Param’s background in technology and family ties to liquor retail create a compelling blend of insights.\n- **Jay Patel** (Founder & CTO): Also an ex-Amazon engineer, Jay brings a wealth of technical knowledge, underscored by his strong connection to the liquor industry through his family.\n- **Raj Patel** (Founding Engineer): With experience from Chewy and other startups, Raj complements the team with his full-stack development and design skills.\n\n**Connect:**  \nFor more information or to book a live demo, you can visit their website at [Transformity](https://transformity.tech/). Interested retailers can also sign up for updates or reach out at info@transformity.tech.\n\n---\n\nTransformity is well-positioned to become the go-to solution for liquor retailers looking to modernize their operations and strengthen their market presence. This approach—combining deep industry understanding with cutting-edge technology—is what differentiates them in an evolving marketplace.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/7d2e4f7df5f6721b58c65ec9fa764cc4ba409c8f.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192025Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=20caad521d520cf92df2ed2c6aa6413c1dad21e733b96329dd4a1c562ce11c63",
    "social_links": [
        "https://www.linkedin.com/company/transformitytech"
    ],
    "logo_path": "data/logos\\Transformity_logo.png"
}