{
    "links": "https://www.ycombinator.com/companies/trayd",
    "name": "Trayd",
    "headline": "A construction payroll platform designed for same-day pay.",
    "batch": "S23",
    "description": "Trayd is a B2B construction payroll platform and back office management system designed for same-day pay. We allow the 7M construction workers in the US to get access to their earned wages 7-10 days sooner than legacy payroll providers. With a unique spin on traditional payroll, Trayd is on a mission to create back office efficiencies for commercial subcontractors while simultaneously addressing the significant labor shortage affecting the $2.1TR North American construction industry. \r\n\nTrayd is bigger than construction payroll. It's the promise that the hardest working people get access to their money, as and when they need it, creating greater financial wellness across the board. Not only that, we are pioneering digital cash access for a demographic traditionally overlooked while simultaneously modernizing operations in an industry that has been slow to adapt. The challenges and opportunities with Trayd are abundant, promising an engaging journey ahead.",
    "activity_status": "Active",
    "website": "https://www.buildtrayd.com/",
    "founded_date": 2022.0,
    "team_size": 4.0,
    "location": "New York",
    "group_partner": "Jared Friedman",
    "group_partner_yc": "https://www.ycombinator.com/people/jared-friedman",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:saas; industry:construction; industry:proptech; industry:payroll; location:new-york",
    "founders": [
        {
            "name": "Anna Berger, Founder",
            "description": "2x founder | product and growth hacker",
            "linkedin": "https://linkedin.com/in/anna-berger-39497a72"
        },
        {
            "name": "Cara Kessler, Founder",
            "description": null,
            "linkedin": "https://linkedin.com/in/carakessler"
        }
    ],
    "status": true,
    "generated_description": "# Trayd: Revolutionizing Construction Payroll\n\n## Overview\nFounded in 2022 and based in New York, Trayd is reshaping how payroll functions in the construction industry with its innovative platform. Part of Y Combinator's Batch S23, Trayd focuses on providing a construction payroll and back office management system that enables same-day pay. This aims to address a significant need for the seven million construction workers in the U.S. who often face delays accessing their earned wages.\n\n## Mission\nTrayd's mission is simple yet powerful: empower the hardest working individuals in the construction sector by ensuring they can access their money when they need it. By providing wages 7-10 days sooner than traditional payroll providers, Trayd fosters greater financial wellness among workers. Beyond payroll, the company aims to streamline operations for commercial subcontractors while also tackling the urgent labor shortages faced by the $2.1 trillion North American construction industry.\n\n## Features\nTrayd's offering goes beyond basic payroll. The platform includes dynamic scheduling, real-time labor tracking, and comprehensive people management tools, allowing construction firms to enhance efficiency across their operations. Key features include:\n- **Effortless Payroll**: Options for weekly, bi-weekly, off-cycle, and instant pay, complete with automated wage overrides.\n- **Dynamic Scheduling**: Geolocation-based clock-ins and easy shift management.\n- **Real-time Reporting**: Customizable reports to track labor costs as they accrue.\n- **Simplified HR**: Onboarding for both W2 and 1099 workers, along with PTO tracking and expense reimbursement capabilities.\n\n## Customer Feedback\nTrayd has garnered positive testimonials from its users. Julian Perez, president of Nova Clean Solutions, noted the platform's unique ability to consolidate subcontractor, employee, and attendance data efficiently. Nick Singh, owner of Sky Rise Construction, praised Trayd as a game-changer, highlighting its user-friendly interface that streamlines operations.\n\n## The Team and Future\nWith a small but dedicated team of four, Trayd is poised to grow. Led by Group Partner Jared Friedman, the company is positioned to continue its trajectory of innovation in the payroll domain, particularly for the traditionally underserved construction workforce. \n\nFor those looking to revolutionize how they handle payroll in construction, Trayd is worth exploring. Their mission and offerings promise a brighter future for both workers and employers in the construction industry. Check them out at [buildtrayd.com](https://www.buildtrayd.com/).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/7ddedbebf77ec6352423a698ac38dd8c5bf1811b.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192025Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=8aa05fb4d649c095142003d02d929720866d6d62d45b118e316f4f1b34a7734f",
    "social_links": [
        "https://www.linkedin.com/company/buildtraydllc/"
    ],
    "logo_path": "data/logos\\Trayd_logo.png"
}