{
    "links": "https://www.ycombinator.com/companies/treasury-prime",
    "name": "Treasury Prime",
    "headline": "Embedded banking software platform and marketplace",
    "batch": "W18",
    "description": "Founded in 2017, Treasury Prime is an embedded banking software platform connecting enterprise companies to a vast marketplace of banks and product partners to launch next-gen payment ecosystems on their platform.  Our banking API offers the quickest, most secure way for fintechs and banks to partner, integrate and build modern financial products and increase revenue streams.\r\n\nWe power enterprise-class embedded banking solutions for a range of complex services including money transfer, risk mitigation and integration with bank infrastructure. It's these leading-edge capabilities that helped the company to win Best Banking-as-a-Service Platform from Tearsheet in 2021 and 2022. The company was also named to CB Insights’ annual 2021 Fintech 250 list.",
    "activity_status": "Active",
    "website": "https://treasuryprime.com",
    "founded_date": 2017.0,
    "team_size": 100.0,
    "location": "San Francisco",
    "group_partner": "Dalton Caldwell",
    "group_partner_yc": "https://www.ycombinator.com/people/dalton-caldwell",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:banking-as-a-service; industry:fintech; industry:b2b; industry:api; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Chris Dean, Founder/CEO",
            "description": "Founder of Treasury Prime.",
            "linkedin": "https://www.linkedin.com/in/ctdean/"
        }
    ],
    "status": true,
    "generated_description": "**Treasury Prime: Revolutionizing Embedded Banking**\n\nFounded in 2017 as part of Y Combinator's Winter 2018 batch, Treasury Prime is not just another fintech company; it’s a game changer in the embedded banking landscape. Headquartered in San Francisco, the company has grown to a dynamic team of around 100 employees, all working towards one mission: connecting enterprise companies with a vast marketplace of banks through a cutting-edge embedded banking software platform.\n\n**What They Do**\n\nTreasury Prime’s platform allows fintechs and banks to partner with ease, leveraging their banking APIs to integrate seamlessly and develop modern financial products. This means faster, more secure access to vital services such as money transfers, risk mitigation, and compliance. They’ve made such strides in the industry that they've been awarded Best Banking-as-a-Service Platform by Tearsheet not once, but twice—in 2021 and 2022—and were featured on CB Insights’ 2021 Fintech 250 list.\n\n**A Multifaceted Solution for Multiple Needs**\n\nBy offering a robust ecosystem, Treasury Prime empowers businesses across various sectors, including commercial neobanks, investment platforms, and vertical labor marketplaces. What sets them apart is their ability to provide tools for compliance, risk management, and customer acquisition—all while simplifying the backend experience for developers.\n\n**Achievements and Recognition**\n\nWith accolades to show for their efforts, Treasury Prime has facilitated notable successes for its partners, boasting an impressive $9.3 billion in new deposits and over 1.8 million new active accounts within just 12 to 18 months post-integration. This speaks volumes about their effectiveness in helping clients expand their reach and grow their financial offerings.\n\n**Looking Ahead**\n\nAs the world moves toward a more embedded finance model, Treasury Prime stands ready to help financial institutions transition smoothly. Their approach focuses on finding solutions that don’t require a complete overhaul of existing systems—modernizing instead of replacing. This modularity is not just smart; it's essential for agility in today’s fast-paced market.\n\nIf you’re in fintech or banking and want to explore how embedded banking can boost your business, **Treasury Prime** offers a demo and various resources on their website: [Treasury Prime](https://treasuryprime.com). \n\nIn the evolving world of finance, partnerships and seamless integrations are the cornerstone of success—and Treasury Prime is at the forefront of this revolution.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/2b4224168de50274068114cff2f3818291bb095f.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192026Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=a0c0e6edcfbcd78a94c24decc62816f8c44f866cf8297e7eec3532d3fee4b51e",
    "social_links": [
        "https://www.linkedin.com/company/treasuryprime/",
        "https://twitter.com/treasuryprime",
        "https://www.crunchbase.com/organization/treasury-prime",
        "https://github.com/treasuryprime"
    ],
    "logo_path": "data/logos\\Treasury_Prime_logo.png"
}