{
    "links": "https://www.ycombinator.com/companies/trellus",
    "name": "Trellus",
    "headline": "Real-time sales coach for SDRs",
    "batch": "W22",
    "description": "Trellus delivers simple coaching prompts to your salespeople in real time as they speak to prospects. Prompts are delivered in response to what is happening in a conversation. The goal of these prompts is to get more reps achieving quota and to reduce the time it takes to start attaining quota.\r\n\nPrompts are action-oriented steps toward empathetic listening and effective discovery. Examples include 'pause' (when talking too much), 'set next steps' (when wrapping up a call without them), and 'ask current state' (when encountering objections).\r\n\nTrellus is backed by Y Combinator and founded by former MIT researchers.",
    "activity_status": "Active",
    "website": "https://www.trellus.ai",
    "founded_date": 2022.0,
    "team_size": 3.0,
    "location": "New York",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:ai-enhanced-learning; industry:artificial-intelligence; industry:saas; industry:b2b; industry:sales; location:new-york",
    "founders": [
        {
            "name": "Ajinkya Nene, Founder",
            "description": "Ajinkya completed his masters and bachelors in computer science from MIT where he focused on applied ML systems. He has experience in running top-level strategy projects as part of his experience at McKinsey & Co. and has been programming for over a decade.",
            "linkedin": "https://www.linkedin.com/in/ajinkya-nene-6200b871/"
        },
        {
            "name": "Craig Bonnoit, Founder",
            "description": "Craig has nearly a decade of professional experience leading teams and developing software. His works has spanned multiple domains including real-time autonomous systems and financial derivative pricing. He previously completed a PhD in Physics at MIT focused on computational techniques for experimental data analysis in strongly correlated materials.",
            "linkedin": "https://www.linkedin.com/in/craig-bonnoit/"
        }
    ],
    "status": true,
    "generated_description": "### Trellus: Your Real-Time Sales Coach\n\nFounded in 2022 and launched through Y Combinator’s W22 batch, Trellus is armed with a mission: to provide real-time coaching for Sales Development Representatives (SDRs). This New York-based startup is on a mission to elevate the sales game by empowering reps with immediate, actionable coaching prompts during their conversations with prospects.\n\n#### The Problem\n\nSales is a tough game, and hitting quotas can feel like running a marathon without a plan. Many salespeople struggle to engage effectively during calls, where missteps can mean the difference between closing a deal or losing a prospect. That's where Trellus enters the picture.\n\n#### The Solution\n\nTrellus delivers simple yet effective coaching prompts exactly when they’re needed—while sales conversations are happening. Imagine being in the moment and getting nudges like “pause” when you're dominating the conversation or “set next steps” when wrapping up a call. These are not generic tips; they are tailored responses to real-time interactions. The goal? To help more salespeople meet or exceed their quotas faster and with less ramp-up time.\n\n#### The Tech Behind Trellus\n\nTrellus is built by former MIT researchers and leverages artificial intelligence to enhance the learning experience for sales teams. Not just about whispers in their ears, the platform offers analytical tools to track performance and improve skills over time. The tools include:\n\n- **AI Coach**: Provides live feedback on handling objections and competitor positioning.\n- **Parallel Dialing & Voice Agents**: Streamlines outbound calls, allowing for simultaneous dialing, and uses AI to simulate customer interactions for training.\n- **Sales Floor**: Creates a virtual space for teams to connect, share strategies, and celebrate wins collectively, making remote work feel less isolating.\n\n#### What’s Next for Trellus?\n\nWith a compact team of three, Trellus is already making waves in the B2B sales sector. As they continue to refine their approach, their aim is to further reduce barriers to effective communication in sales and transform SDR training into a more dynamic, results-oriented process.\n\nIf you’re looking to supercharge your sales team with real-time insights driven by artificial intelligence, Trellus is worth a look. For more information, check out their website: [Trellus](https://www.trellus.ai).\n\n---\n\nAbove all, Trellus embodies the spirit of innovation in sales coaching—effortlessly combining AI with empathy to create a smarter, more responsive sales force. ",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/342d0b5305f59030e92d6408f6f4ba16fbaa33af.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192027Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=2afbbf867c71851173fbfd0c9532ab48fb4d6f4ef1991a069c1d981c5ddb561d",
    "social_links": [
        "https://www.linkedin.com/company/trytrellus/about/",
        "https://twitter.com/trellusai"
    ],
    "logo_path": "data/logos\\Trellus_logo.png"
}