{
    "links": "https://www.ycombinator.com/companies/trendex-own-the-stars",
    "name": "Trendex - Own the stars",
    "headline": "Transforming billions of fans into active participants in the journeyâ\u0080¦",
    "batch": "S22",
    "description": "Trendex is a platform for fan engagement that enables billions of fans to actively follow the careers of top athletes and emerging talents.\r\n\nThis is achieved through digital limited edition cards created and owned by the athletes themselves, with their value linked to their performance. Fans can purchase, trade, and utilize these cards on the Trendex platform, connecting with their idols more than ever before. Unlike existing trading cards, on Trendex, the stars and emerging talents create their own cards, making them truly official, uniquely limited, and directly tied to their careers and success.\r\n\nWith Trendex, you have the opportunity to get involved early in the careers of promising athletes and actively engage with their daily performances through virtual competitions based on the real-life achievements of the talents you own.",
    "activity_status": "Active",
    "website": "https://trendex.tech",
    "founded_date": 2021.0,
    "team_size": 9.0,
    "location": "Paris, France",
    "group_partner": "Harj Taggar",
    "group_partner_yc": "https://www.ycombinator.com/people/harj-taggar",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:sports-tech; industry:gaming",
    "founders": [
        {
            "name": "Andrea Bonapersona, Founder",
            "description": "I am passionate about software engineering and game development since 12, graduating as an engineer in 2014.\n\nIn 2015, I launched a GUI-based Ethereum mining app called GoldMiner. Then worked as an advisor and consultant for many companies in the payments, finance and art sectors.\n\nPassionate about FinTech and Blockchain solutions, I now focus my expertise on Trendex.",
            "linkedin": "https://www.linkedin.com/in/andrea-bonapersona-719a2582/"
        },
        {
            "name": "Jean-Joseph MARIANI, Founder",
            "description": "Jean-Joseph has extensive experience in legal and consulting. He managed operations for large and mid-size business across Europe helping them scale while maintaining them focused, goal oriented and disciplined.",
            "linkedin": "https://www.linkedin.com/in/jeanjosephmariani"
        }
    ],
    "status": true,
    "generated_description": "**Trendex - Own the Stars: Unlocking Fan Engagement Through Unique Digital Cards**\n\n**Overview**  \nFounded in 2021 and situated in Paris, France, Trendex is part of Y Combinator's Batch S22, showing it's got the backing of one of the best startup accelerators out there. The company's mission is clear: transform billions of fans into active participants in the exciting journeys of top athletes and up-and-coming talents.\n\n**What They Do**  \nTrendex revolves around fan engagement using digital limited edition cards, which athletes create and own themselves. This isn’t your typical trading card setup; these cards’ value is directly tied to the athletes’ performance. Fans have the chance to purchase, trade, and utilize these unique cards on the Trendex platform, allowing them to connect with their sports idols more intimately than ever before.\n\n**How It Works**  \n1. **Build Your Collection**: Users can choose from over 200 talents across various sports and entertainment sectors, including soccer and basketball. You're not just collecting cards; you're curating a roster of potential champions.\n   \n2. **Track Performance**: Each talent gets a performance score that reflects their real-world success. This score guides fans in building the best possible team.\n   \n3. **Compete**: Trendex organizes competitions where fans can showcase their teams. The better your chosen athletes perform, the more you win. Prizes include signed jerseys, unique experiences, and gift cards.\n   \n4. **Support Talent**: Trendex commits a substantial portion of its profits to assist emerging athletes, reinforcing the bond between the stars and their supporters.\n\n**Current Momentum**  \nTrendex has already made waves with notable figures, like NBA defender Marcus Smart, joining the platform. They’ve distributed over $500,000 in prizes, attracted 75,000+ users, and partnered with big names supported by millions of fans. \n\n**The Team**  \nWith a small but focused team of nine, Trendex is lean and agile, able to pivot quickly in the fast-paced landscape of fintech, sports-tech, and gaming.\n\n**Why It Matters**  \nTrendex isn’t just about collecting cards; it’s about creating a community where fans become stakeholders in the success of their favorite athletes. It’s a novel blend of fandom and financial investment that taps into the growing trend of engagement-driven platforms.\n\nFor more information or to dive into the Trendex experience, visit their website at [trendex.tech](https://trendex.tech). \n\nIn short, if you’re a sports fan looking to blend passion with investment, Trendex just might be the game-changer you're waiting for.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/68d98f2b6d1de70625b9aa76830dcbbcbcf25355.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192027Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=08c11bc01adbcf1719e9d1848dd2155d37e623e64072038f81c751944d943629",
    "social_links": [
        "https://www.linkedin.com/company/74065663"
    ],
    "logo_path": "data/logos\\Trendex_-_Own_the_stars_logo.png"
}