{
    "links": "https://www.ycombinator.com/companies/trexo-robotics",
    "name": "Trexo Robotics",
    "headline": "Exoskeletons to help people walk, starting with children",
    "batch": "W19",
    "description": "Trexo Robotics is building exoskeletons to help people walk, starting with children with Cerebral Palsy. Our product allows children with disabilities like Cerebral Palsy, to walk, in many cases for the first time in their lives. Trexo was started when Manmeet found that his nephew was born with Cerebral Palsy and would never be able to walk. They are already commercial with customers all over US and Canada. Their vision is to replace the wheelchair, for children, adults, and the elderly.",
    "activity_status": "Active",
    "website": "http://trexorobotics.com",
    "founded_date": 2016.0,
    "team_size": 30.0,
    "location": "Toronto, Canada",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:medical-robotics",
    "founders": [],
    "status": true,
    "generated_description": "### Trexo Robotics: Empowering Mobility One Step at a Time\n\n**Company Overview**  \nFounded in 2016 and based in Toronto, Canada, Trexo Robotics is on a mission to revolutionize mobility for individuals with disabilities, primarily focusing on children with cerebral palsy. The idea was sparked when CEO Manmeet Maggu discovered that his nephew would not be able to walk due to his condition. This personal experience ignited a passion to create technology that would enable children like him to take their first steps, using exoskeletons designed specifically for this purpose.\n\n**Mission and Vision**  \nTrexo envisions a future where wheelchairs are replaced by robotic exoskeletons that empower everyone—from children to adults and seniors—to walk. Their commitment is to enhance the quality of life for individuals with mobility challenges through innovation and engineering.\n\n**Product Offerings**  \nTrexo Robotics offers two main products:\n\n1. **Trexo Home**: A robotic gait training device designed for use in the home. It allows children to improve their walking patterns and build strength and endurance, providing continuous support and accessories tailored to individual needs. \n\n2. **Trexo Plus**: Designed for clinical environments, this device allows physical therapists to assist patients with gait training, helping them regain mobility with the guidance of professionals.\n\nBoth offerings come with ongoing technical support, training for users, and a satisfaction guarantee.\n\n**Current Status and Impact**  \nTrexo Robotics has already made waves across the US and Canada with its innovative products. As of now, they have garnered substantial recognition in the realm of medical robotics and aim to reach more families looking for mobility solutions. They have a dedicated team of around 30 employees and are backed by the renowned startup accelerator Y Combinator, having joined Batch W19.\n\n**Customer Experience**  \nTrexo does not just stop at technology; they value the stories and feedback from the families using their products. Testimonials highlight incredible transformations where children, once unable to walk, have found new independence and opportunities for joy and play.\n\n**Future Aspirations**  \nLooking ahead, Trexo Robotics plans to expand their offerings and reach beyond current markets. They aim to provide more inclusive access to buoyant, active lifestyles for all, fostering healthier communities through ambulation.\n\nFor more information, you can visit their website at [Trexo Robotics](http://trexorobotics.com).\n\nThis is not just about robots; it's about redefining what's possible for children and individuals with mobility limitations. Trexo is building not just devices but dreams—one step at a time.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/0d77a36dc2dc02e51938727dcc5af4ba53c6e32d.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192027Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=837cdfea799e799bb6099dcb3c48aa1b6ee0498459b85d7077b671196968924d",
    "social_links": [
        "https://linkedin.com/company/trexo-robotics",
        "https://twitter.com/trexorobotics",
        "https://www.facebook.com/trexorobotics",
        "https://www.crunchbase.com/organization/trexo-robotics"
    ],
    "logo_path": "data/logos\\Trexo_Robotics_logo.png"
}