{
    "links": "https://www.ycombinator.com/companies/trm-labs",
    "name": "TRM Labs",
    "headline": "TRM is building a safer financial system for billions of people.",
    "batch": "S19",
    "description": "TRM is on a mission to build a safer financial system for billions of people. We deliver a blockchain intelligence data platform to financial institutions, crypto companies, and governments to fight cryptocurrency fraud and financial crime. We consider our business — and our profit — as a way to move towards our mission sustainably and at scale. \r\n\nJoin our mission ➔ www.trmlabs.com/careers",
    "activity_status": "Active",
    "website": "https://trmlabs.com/",
    "founded_date": 2018.0,
    "team_size": 250.0,
    "location": "San Francisco",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:machine-learning; industry:crypto-web3; industry:data-engineering; location:san-francisco-bay-area",
    "founders": [],
    "status": true,
    "generated_description": "**TRM Labs: A Quick Overview**\n\nFounded in 2018 as a part of Y Combinator's Summer 2019 batch, TRM Labs has emerged as a key player in the blockchain intelligence sector. Based in San Francisco with a team of 250, their mission centers around creating a safer financial ecosystem for billions across the globe.\n\n**Mission & Solutions**\n\nAt its core, TRM Labs strives to combat cryptocurrency fraud and financial crime. They provide a sophisticated blockchain intelligence platform tailored for financial institutions, crypto companies, and government entities. By integrating machine learning and extensive data engineering, TRM equips users with the tools necessary for investigations, compliance, and incident response. Their offerings include transaction monitoring, wallet screening, and forensic analysis, helping users to effectively track illicit activities across multiple blockchains—over 30 at last count.\n\nYou might be wondering, why is all this important? As our financial systems increasingly intertwine with cryptocurrencies, the need for robust security and compliance measures becomes paramount. TRM recognizes that as technology evolves, so do the tactics of cybercriminals, hence their commitment to staying ahead of the curve—particularly in combating the rise of AI-enabled crime.\n\n**Community & Learning**\n\nTRM Labs doesn't just offer a product; they aim to build a community around knowledge sharing through initiatives like the TRM Academy. Here, they provide training and certifications for industry professionals, fostering an environment where understanding crypto risk management and compliance is accessible to all.\n\n**Industry Reach & Partnerships**\n\nTRM has positioned itself as a trusted partner for global organizations, including law enforcement agencies and major financial institutions. They emphasize collaboration, evident from their partnerships with industry giants like Visa, PayPal, and various governmental bodies. Their commitment to transparency and trust is further illustrated through their comprehensive resources, including blogs, case studies, and an engaging podcast series titled TRM Talks.\n\n**Careers & Future Vision**\n\nWith growth ambitions fueled by their successful experiences in tackling financial crime, TRM Labs invites those who are passionate about making a difference to join their mission. They offer a variety of career opportunities, emphasizing the importance of integrity within the financial landscape.\n\nIn a world where digital currencies are rapidly evolving, TRM Labs stands out not just for its innovative technology but for its genuine ambition to forge a safer financial future for all. If you are curious to explore their work further or wish to join their ranks, jump to their [careers page](https://trmlabs.com/careers) and see what they have to offer.\n\n**Website**: [www.trmlabs.com](https://trmlabs.com/)",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/c7fc12bdffb1e0c0e4673afa4b83a3f54350125e.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192029Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=fd509e43ac9303788234acc08adfb873ff7d4a339bab9016bbb185749d7ec858",
    "social_links": [
        "https://www.linkedin.com/company/trmlabs/",
        "https://twitter.com/trmlabs",
        "https://www.crunchbase.com/organization/trm-labs",
        "https://github.com/trmlabs"
    ],
    "logo_path": "data/logos\\TRM_Labs_logo.png"
}