{
    "links": "https://www.ycombinator.com/companies/truemetrics",
    "name": "truemetrics",
    "headline": "Entrance and parking Location coordinates for faster deliveries.",
    "batch": "S23",
    "description": "truemetrics helps logistics companies to find their customer's faster. By detecting and mapping entrances, we help GLS, a key logistics company in Europe, save 2-10 minutes on each delivery.\r\n\nThe way couriers navigate is broken.\r\n\n“You Have Arrived At Your Destination!” — or so Google Maps thinks. In reality, the way couriers navigate is broken: No parking, hard-to-find entrances, and labyrinth-like apartment and office complexes can turn the last meters of delivery into a time-consuming puzzle.\r\n\ntruemetrics provides parking positions and entrance locations to enable faster drop-offs. Our data is generated by analyzing sensor data from drivers' smartphones, allowing truemetrics to identify precise parking and entrance locations, thereby simplifying the last meters of delivery.",
    "activity_status": "Active",
    "website": "https://www.truemetrics.io/",
    "founded_date": 2021.0,
    "team_size": 5.0,
    "location": "Berlin, Germany",
    "group_partner": "Dalton Caldwell",
    "group_partner_yc": "https://www.ycombinator.com/people/dalton-caldwell",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:delivery; industry:logistics; industry:ai; industry:ml",
    "founders": [
        {
            "name": "Ingo Boegemann, Founder",
            "description": "Studied mechanical engineering at the technical university of Hamburg and at UC Berkeley\nWorked in tech consulting for almost 10 years with a focus on supporting classical European tech companies (automotive, aerospace, etc. ) \nFounded my own consulting company which I exited to a competitor in 2020\nStarted working on sensor fusion technologies which are part of truemetrics core tech stack in 2020\nIn my free time I love to the outdoors, especially camping and surfing",
            "linkedin": "https://linkedin.com/in/ingo-boegemann-a78800bb"
        },
        {
            "name": "Jan Bischof, Founder",
            "description": "Jan Bischof is a highly skilled and accomplished software engineer with a strong background in artificial intelligence research. With a passion for developing innovative solutions, Jan has a proven track record of designing and implementing cutting-edge algorithms and software systems. He possesses excellent problem-solving abilities and a deep understanding of machine learning techniques, making him a valuable asset in the field of AI and software development.",
            "linkedin": "https://linkedin.com/in/jan-bischof"
        },
        {
            "name": "David Wulff, Founder",
            "description": "Co-Founder and CPO, truemetrics (S23).\n\nLove BJJ.\n\nFormer Navy Officer, ex-McKinsey and DoorDash Ops Manager",
            "linkedin": "https://linkedin.com/in/david-wulff"
        }
    ],
    "status": true,
    "generated_description": "**Truemetrics: Streamlining Last-Mile Deliveries**\n\nFounded in 2021 and hailing from the innovative hub of Berlin, Germany, Truemetrics is on a mission to redefine how last-mile deliveries are executed. In partnership with Y Combinator’s S23 batch, they’re tackling a crucial issue in delivery logistics: the often-broken navigation systems that cause delays and frustrations for couriers.\n\n**The Problem: Broken Navigation**\n\nThe statement \"You Have Arrived At Your Destination!\" doesn’t ring true for many couriers. They often find themselves stuck searching for parking space or figuring out complex building entrances. A staggering 15% of all navigation pins can be over 70 meters away from the actual entrance, wasting valuable delivery seconds—time that could mean the difference between a satisfied customer and a frustrated one.\n\n**The Solution: Entrance and Parking Location Data**\n\nTruemetrics provides a smart solution by harnessing sophisticated sensor data from drivers' smartphones. This allows them to generate precise coordinates for parking spots and building entrances. By integrating this data into their systems, couriers can save anywhere from 2 to 10 minutes on each delivery. Imagine that multiplied across hundreds of deliveries—it's a potential game changer for logistics companies.\n\nTheir technology isn't just about saving time. It’s about enhancing efficiency and improving the overall delivery experience for both couriers and customers. With Truemetrics, drivers can find optimal parking positions rapidly, enabling them to save an average of 32.7 seconds at each stop. This immediately translates into better performance metrics for logistics firms.\n\n**Engagement and Integration**\n\nTruemetrics positions itself as an indispensable partner for delivery startups and established logistics giants alike, working with notable names in the industry, like GLS and Toyota. Their system integrates seamlessly—with just a few lines of code—allowing logistics companies to adopt this technology with minimal downtime.\n\nAs part of a next-gen tech reshaping logistics, Truemetrics leverages AI and machine learning to curate delivery data that tracks real-world interactions. This innovative approach lets companies say goodbye to outdated methods like geofencing, and instead hello to real-time interaction tracking.\n\n**In a Nutshell**\n\nLocated in a city that embodies innovation, Truemetrics is pioneering solutions that address fundamental flaws in delivery systems. Their focused mission is clear: make deliveries faster, more efficient, and successful by providing essential data that simplifies the couriers' journey from the parking lot to the customer’s door.\n\nYou can check out their progress and explore their offerings at [truemetrics.io](https://www.truemetrics.io/). Whether you're a logistics company looking for a boost or a tech enthusiast keen on the delivery revolution, Truemetrics is one to watch.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/3a7ea44ef55ccd01b022c5879f0c20daa7bf1d4f.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192029Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=878b0c9d7d35613eff1805462344e02767df9bd8a7cfa2cefa0259802e3e1f6f",
    "social_links": [
        "https://www.linkedin.com/company/truemetricsio"
    ],
    "logo_path": "data/logos\\truemetrics_logo.png"
}