{
    "links": "https://www.ycombinator.com/companies/truebiz",
    "name": "TrueBiz",
    "headline": "Instant Background Checks for Businesses",
    "batch": "S22",
    "description": "TrueBiz helps financial service providers reduce manual review during business onboarding.\r\n\nWe add color to the company's background with 250+ data points on the company from around the web (such as industry and address), and summarize key risk indicators.\r\n\nThe process takes seconds – not days, so financial service providers can efficiently meet risk requirements and onboard new businesses faster.",
    "activity_status": "Active",
    "website": "https://truebiz.io/",
    "founded_date": 2022.0,
    "team_size": 6.0,
    "location": null,
    "group_partner": "Tom Blomfield",
    "group_partner_yc": "https://www.ycombinator.com/people/tom-blomfield",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:b2b; industry:identity; industry:regtech",
    "founders": [],
    "status": true,
    "generated_description": "**Company Overview: TrueBiz**\n\nFounded in 2022 and a proud member of Y Combinator’s S22 batch, TrueBiz is on a mission to revolutionize how businesses conduct background checks. The company primarily assists financial service providers in streamlining the onboarding process, allowing them to reduce manual review times from days to mere seconds. Imagine transforming potential roadblocks in business onboarding into a seamless digital experience—that’s what TrueBiz aims to achieve.\n\n**Core Offerings**\n\nTrueBiz specializes in providing instant background checks by leveraging over 250 data points from various online sources. These include critical details such as industry classification and business addresses, all boiled down into key risk indicators that help businesses make informed decisions quickly. Their automated tools ensure that the essential due diligence in verifying new merchants is both efficient and thorough.\n\n1. **Web Presence Review**: In less than 30 seconds, this API evaluates a merchant's online reputation by analyzing multiple signals from their website.\n   \n2. **Merchant Monitoring**: This feature keeps tabs on merchants' online visibility, alerting businesses to any major changes that could signal increased risk.\n\n3. **Risk Sharing Network & Smart Blocklist**: TrueBiz offers a unique mechanism to instantly flag businesses applying with similar credentials as known offenders, thus allowing collaboration and data sharing among financial institutions to combat fraud.\n\n**Recent Developments**\n\nTrueBiz has recently earned recognition from Mastercard as an official Merchant Monitoring Service Provider, marking a significant milestone in their growth trajectory. Their commitment to automating risk assessments has proven effective; for instance, collaboration with Visa resulted in a 56% increase in merchant onboarding automation—demonstrating their value proposition.\n\n**Team and Funding**\n\nThe company currently operates from its headquarters with a small but potent team of six, guided by experienced investor Tom Blomfield. As a fintech, B2B, identity, and regtech player, TrueBiz is positioned at the intersection of rapidly evolving technological solutions and stringent regulatory requirements.\n\n**Why It Matters**\n\nIn an era where speed is crucial, especially in financial services, TrueBiz not only meets the need for rapid background checks but also elevates the overall efficiency of onboarding processes. By helping businesses hedge against risk while simplifying compliance, it lays the groundwork for more robust and secure financial ecosystems.\n\nFor more information, you can visit [TrueBiz’s website](https://truebiz.io/) to explore their offerings further or schedule a demo to witness their solutions in action. \n\nTrueBiz isn’t just a tech company; it’s a game-changer in how businesses relate with risk and compliance—where waiting days for background checks becomes a thing of the past.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/13dc1680556864fba8a319561a643a7a9275de74.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192029Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=060a6cae7f6b13734ca0417e2c82051b2311a780810141fe7a02490563a3bead",
    "social_links": [
        "https://www.linkedin.com/company/truebiz-inc"
    ],
    "logo_path": "data/logos\\TrueBiz_logo.png"
}