{
    "links": "https://www.ycombinator.com/companies/trueclaim",
    "name": "TrueClaim",
    "headline": "Transparent, AI-powered healthcare TPA.",
    "batch": "W24",
    "description": "TrueClaim processes all payments between healthcare providers and companies that self-fund their insurance. TrueClaim's AI-enabled engine adjudicates and continuously reviews 100% of medical claims to save at least 7% of healthcare costs.",
    "activity_status": "Active",
    "website": "https://www.trytrueclaim.com",
    "founded_date": 2023.0,
    "team_size": 2.0,
    "location": null,
    "group_partner": "Gustaf Alstromer",
    "group_partner_yc": "https://www.ycombinator.com/people/gustaf-alstromer",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": null,
    "founders": [
        {
            "name": "Barbora Howell, Founder",
            "description": "Barbora got her MBA at Stanford. She joined Hinge Health as employee #30 where she built and ran a number of functions, including HR, benefits and customer billing. After scaling Hinge Health to >700 employees and hundreds of customers, Barbora ran clinical operations at Pine Park Health - a primary care provider for residents of assisted living facilities and a YC company - where she served on the executive team and was in charge of member support, care coordination and more.",
            "linkedin": "https://linkedin.com/in/podzimkovab"
        },
        {
            "name": "Bobby Bayer, Founder",
            "description": "Co-founder and CTO of TrueClaim (W24). Previously, Bobby spent 7 years as Senior Software Engineer building and scaling health tech solutions at pMD. He established and grew pMD’s RCM software and services divisions as Software Engineering Manager. Prior to that, he launched patient engagement software as a Senior Software Engineer. 30% of the revenue growth at pMD during his tenure could be directly attributed to a product that he launched.",
            "linkedin": "https://linkedin.com/in/rwbayer"
        }
    ],
    "status": true,
    "generated_description": "**TrueClaim: Revolutionizing Healthcare Transparency Through AI**\n\nFounded in 2023 and participating in the Y Combinator Batch W24, TrueClaim is on a mission to simplify the complexities of healthcare payments. As an AI-powered Third-Party Administrator (TPA), their aim is straightforward: provide transparent, efficient healthcare insurance solutions to companies that self-fund their plans.\n\n### The Core Offering\nTrueClaim processes all payments between healthcare providers and self-funding companies, leveraging a cutting-edge AI engine that rigorously adjudicates and reviews 100% of medical claims. This technology is not just jargon; it translates into tangible savings—at least 7%—on overall healthcare costs. For small businesses, especially, these savings could be the difference between a thriving workforce and spiraling costs.\n\n### User-Friendly Experience\nWhere traditional TPAs often present convoluted pricing and unexpected fees, TrueClaim commits to a fully transparent pricing model that is easy to understand. In a world where accessing your own health data can feel like pulling teeth, TrueClaim ensures that 100% of your data is available in real time. They marry modern technology with accessibility, featuring a state-of-the-art platform and app designed for simplicity.\n\n### The Team\nCurrently, the company is powered by a small but mighty team of just two employees. Their operations are backed by the expertise of Gustaf Alstromer, their Group Partner, who brings invaluable insight to their journey.\n\n### Why It Matters\nBeyond just numbers and claims, TrueClaim positions itself as a true benefits companion for businesses. With an impressive capacity to save hours each week and a promise of real-time data sharing, they’re changing the narrative of healthcare administration.\n\n### In Conclusion\nTrueClaim embodies a fresh approach to a sector fraught with opacity and inefficiencies. With a transparent model and AI-driven processes, they have the potential to alter how companies view healthcare spending—while making life a little easier for everyone involved along the way.\n\nTo learn more about their offerings, check out their website: [TrueClaim](https://www.trytrueclaim.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/362c69ad5a6828af62b6424e52ec5c92ea71dfb0.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192029Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=c11a7cd60b7dbd7d3787b3dfc24cb41fba182b23d011ef43ecfaec457deff497",
    "social_links": [
        "https://www.linkedin.com/company/trytrueclaim"
    ],
    "logo_path": "data/logos\\TrueClaim_logo.png"
}