{
    "links": "https://www.ycombinator.com/companies/trusty",
    "name": "Trusty",
    "headline": "Limitless Real Estate",
    "batch": "W22",
    "description": "Trusty is an agent-to-agent matchmaking network that searches every home, regardless of whether it's on the market. This means fresh inventory for buyers, private offers for homeowners, and happy real estate agents.",
    "activity_status": "Active",
    "website": "https://trustyhomes.com/",
    "founded_date": 2020.0,
    "team_size": 6.0,
    "location": "San Francisco",
    "group_partner": "Aaron Epstein",
    "group_partner_yc": "https://www.ycombinator.com/people/aaron-epstein",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:marketplace; industry:real-estate; industry:consumer; industry:b2b; industry:proptech; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Tim Hyer, Founder",
            "description": "Tim has a Design degree from Duke and raised over $10M for his last startup. He lives just north of San Francisco where he enjoys exploring the trails of Marin with his wife, four kids, and dog, Stella.",
            "linkedin": "https://www.linkedin.com/in/timhyer/"
        },
        {
            "name": "Nicholas Meyers, Founder",
            "description": "Co-founder & CTO @Trusty, \nSoftware Engineer - 20+ years,\nProduct Builder,\nTeam Builder,\nFormer Genentech, Charles Schwab",
            "linkedin": "https://www.linkedin.com/in/nicholasmeyers/"
        }
    ],
    "status": true,
    "generated_description": "**Company Overview: Trusty**\n\nFounded in 2020 and located in the heart of San Francisco, Trusty is a dynamic proptech startup that operates as an innovative agent-to-agent matchmaking network. As part of the prestigious Y Combinator Batch W22, Trusty is on a mission to revolutionize the real estate market by providing \"Limitless Real Estate\" solutions. In a landscape where homebuyers often face limited inventory, Trusty serves as a bridge, connecting agents to exclusive off-market properties, enabling them to discover fresh inventory that isn't visible to the average buyer.\n\n**What Trusty Does**\n\nAt its core, Trusty enhances the real estate transaction process with a unique approach: it allows real estate agents to search for homes that may not even be on the market. This capability not only brings new opportunities to buyers looking for their dream homes, but it also creates private offers for homeowners, resulting in a win-win for everybody involved—agents, buyers, and sellers alike. \n\nThe company's smart matching system utilizes advanced AI technology to facilitate searches in natural language. Agents can enter specific buyer preferences, and Trusty's algorithm does the heavy lifting, locating properties that match their clients’ desires. From high ceilings to spacious yards, Trusty ensures that properties are not just matches by criteria but also resonate with the aspirations of the buyers.\n\n**Collaborative Advantage**\n\nTrusty's network emphasizes collaboration among agents; it encourages them to leverage relationships with past clients and tap into each other's insights. By nurturing these connections, agents can turn past buyers into future sellers, thereby creating a continuous cycle of opportunity within their networks.\n\n**Current Status and Team**\n\nWith a compact team of six, Trusty is agile and focused. The Group Partner, Aaron Epstein, leads the charge in fostering innovation and growth. The startup's promising framework has already garnered the trust of agents from renowned brokerages like Sotheby's International Realty and Compass, showcasing its credibility and effectiveness in the competitive real estate landscape.\n\n**Why Trusty Matters**\n\nIn an industry often hampered by inefficiencies and limited visibility, Trusty emerges as a beacon of opportunity. By tapping into off-market properties and enhancing communication between agents, they’re not just fostering sales; they're nurturing relationships. \n\nIf you’re a real estate agent looking to unlock potential that others can’t see, Trusty might just be the partner you need to thrive in this evolving marketplace. You can learn more about their services or get started through their [website](https://trustyhomes.com).\n\nIn the end, Trusty is not just about finding homes; it's about creating a community of agents and clients who can navigate the ever-changing real estate landscape with greater ease and success.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/670ed5feba4db153d753aae3b5ac5058d2b0a67e.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192030Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=fbe48c78f1da406699a4e849355e4dbc7809b8a09b06f4a9dc25f5e485e84147",
    "social_links": [
        "https://www.linkedin.com/company/trustyhomes",
        "https://twitter.com/trustyhomes",
        "https://www.facebook.com/trustyco/",
        "https://www.crunchbase.com/organization/trusty-d818"
    ],
    "logo_path": "data/logos\\Trusty_logo.png"
}