{
    "links": "https://www.ycombinator.com/companies/tuesday",
    "name": "Tuesday",
    "headline": "Scale personalized outreach with AI.",
    "batch": "W22",
    "description": "First, build hyper-targeted B2B contact lists without needing any manual verification – we’ll verify the leads for you. Then, generate 1000s of personalized emails that get you 8x more replies within minutes using AI.\r\n\n**Reach more buyers with Triple-Verified contacts**\r\nOther data providers in the market sell you outdated contacts that waste your time. Tuesday offers unlimited triple-verified emails and mobile phone numbers to you at extremely low cost.All contact data are triple-verified at the time of request, making sure you can reach your buyers easily.\r\n\n**Book more meetings with AI-Personalized emails**\r\nStop wasting your precious time “personalizing” emails and LinkedIn messages. You didn’t sign up for this job to read the “About” section of everyone’s LinkedIn profile.Tuesday seamlessly integrates with LinkedIn profile data and uses cutting-edge AI models to generate personalized emails – in seconds.Send hyper-relevant 1:1 messages based on your prospects pain and your company’s offering, automatically.",
    "activity_status": "Active",
    "website": "https://tuesday.so",
    "founded_date": 2024.0,
    "team_size": 3.0,
    "location": "San Francisco",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:saas; industry:b2b; industry:sales; industry:marketing; industry:ai; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Kai Feng, Founder",
            "description": "Kai (Jiabo) Feng is the founder and CEO of Tuesday.\n\nPrior to that, Kai bootstrapped a B2C mobile subscription app studio as as an indie developer and grew it to 7-figure in annual revenue. \n\nKai graduated from Stanford University with a B.S. in Product Design in 2017, and later with a M.S. in Management Science in 2021, in between which he worked as a product manager at Pocket Gems, a mobile gaming company.",
            "linkedin": "https://www.linkedin.com/in/kaijiabofeng/"
        }
    ],
    "status": true,
    "generated_description": "**Tuesday: Revolutionizing B2B Outreach with AI**\n\n**Company Overview:**\nFounded in 2024 and part of Y Combinator Batch W22, Tuesday is based in San Francisco and consists of a lean team of three. With a mission to scale personalized outreach using AI, Tuesday primarily targets the B2B market, providing a solution that not only builds contact lists but also generates highly personalized emails that dramatically increase response rates.\n\n**What They Do:**\nTuesday stands out in a crowded market of data providers by ensuring that all contacts are triple-verified at the time of request. This means businesses receive accurate, reliable emails and mobile numbers without the hassle of manual verification. The platform truly shines when it comes to email personalization; it uses advanced AI to craft individual messages tailored to prospects' pain points, yielding up to eight times more replies.\n\n**Key Features:**\n1. **Triple-Verified Contacts:** Unlike competitors who sell outdated or questionable data, Tuesday provides unlimited access to triple-verified emails and phone numbers, ensuring contact accuracy and saving users valuable time.\n   \n2. **AI-Personalized Emails:** Say goodbye to the tedious task of personalizing emails for each lead. Tuesday automatically pulls data from LinkedIn, using AI to generate relevant email content in seconds. Users can focus on what matters most: closing deals.\n\n3. **Seamless Integrations:** The platform allows easy integration with popular CRMs and email tools, enabling users to push verified contacts directly into their systems efficiently.\n\n4. **Affordable Pricing:** With costs starting as low as 15 cents per mobile number, Tuesday positions itself as a budget-friendly alternative to more established services like Apollo.io and ZoomInfo.\n\n5. **User-Friendly Interface:** The site’s design is intuitive, enabling users to generate targeted lead lists and personalized emails quickly without extensive training or complex setups.\n\n**Client Success Stories:**\nUsers have praised Tuesday for dramatically improving their outreach efficiency. For example, one business reported a 60% increase in booked meetings after switching to Tuesday. Clients have described it as the best message generation tool they've used, highlighting its effectiveness in combining data-driven insights with personal touch.\n\n**Conclusion:**\nTuesday is more than just another AI tool; it’s a comprehensive solution for businesses looking to supercharge their outreach efforts. By combining high-quality data with innovative technology, Tuesday empowers sales teams to connect meaningfully with their prospects—making it a must-have in the modern sales toolkit. \n\nFor more information and to get started with your free trial, visit [Tuesday's website](https://tuesday.so).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/a585cbc8b9bd762e39311354c5a4d329fa4981e4.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192030Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=19f07444ff60b1ba93eb1d39c38619709444f9b19f96443cab0cbda9a239c6c1",
    "social_links": [
        "https://www.linkedin.com/company/tuesday-ai/",
        "https://twitter.com/Tuesday_AI"
    ],
    "logo_path": "data/logos\\Tuesday_logo.png"
}