{
    "links": "https://www.ycombinator.com/companies/tuli-health",
    "name": "Tuli Health",
    "headline": "Transforming pharmacies in the UK into diagnostic centers",
    "batch": "S21",
    "description": "Tuli health is turning all 11 000 independent pharmacies in the UK into diagnostic centers.  Our software makes it easy for these pharmacies to sell and fulfill COVID-19 tests today and other diagnostic tests tomorrow. Instead of waiting for a long time or travelling a long distance to receive the tests, customers can now receive tests in their neighbourhood, with results guaranteed in 24 hours. \r\n\nTuli Health was launched in June, had onboarded 147 pharmacies, performed over 7000 diagnostic tests, and helped pharmacies generate $1.3 million in incremental revenue per month. \r\n\nThe vision is to make every local pharmacy into a diagnostic center powered by Tuli Health.",
    "activity_status": "Active",
    "website": "https://tuli.health",
    "founded_date": 2021.0,
    "team_size": 4.0,
    "location": "London, United Kingdom",
    "group_partner": "Diana Hu",
    "group_partner_yc": "https://www.ycombinator.com/people/diana-hu",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:saas; industry:telemedicine; industry:primary-care",
    "founders": [
        {
            "name": "Jiawei Li, Founder",
            "description": null,
            "linkedin": "https://www.linkedin.com/in/jiawei-c-li/"
        },
        {
            "name": "Jialu Tu, Founder",
            "description": "Jialu is a massive nerd, hence why it came to no surprise to anyone when he decided to do Maths at Imperial College London. However, after Imperial College, he strayed to the wrong path by going into financial services, where he stayed for close to 10 years observing how bad the sector as a whole is in terms of their tech. Being disappointed in FS and himself, he is now atoning his sins by doing a startup in the healthcare space.\n\nAnd yes, that is a Red Hat red hat.",
            "linkedin": "https://www.linkedin.com/in/jialu-tu-b2295615/"
        }
    ],
    "status": true,
    "generated_description": "### Tuli Health: Transforming Pharmacies into Diagnostic Centers\n\n**Company Overview:**\nTuli Health, founded in 2021 and a participant in Y Combinator’s Batch S21, is on a mission to revolutionize healthcare by transforming the UK's 11,000 independent pharmacies into diagnostic centers. Primarily based in London, their innovative software streamlines the sale and fulfillment of diagnostic tests—starting with COVID-19 testing and expanding into a broader range of diagnostic services.\n\n**What They Do:**\nTheir core offering is to enable local pharmacies to perform diagnostic tests conveniently, allowing customers to get tested in their neighborhoods rather than traveling long distances. With a promise of 24-hour result delivery, Tuli Health is a game changer for both pharmacies and patients.\n\n**Achievements:**\nSince launching in June 2021, Tuli Health has successfully onboarded 147 pharmacies and conducted over 7,000 diagnostic tests, generating an impressive $1.3 million in additional revenue for pharmacies each month. Currently, they are working with 308 pharmacy partners across the UK, illustrating a rapidly growing network.\n\n**Team and Leadership:**\nThe company operates with a lean team of four employees, focused on maximizing impact. Their Group Partner, Diana Hu, brings strategic oversight to their mission-driven endeavors.\n\n**Services Offered:**\nTuli Health provides several key services, including:\n- **Phlebotomy Network:** Partnering with providers for blood draws.\n- **End-to-End Testing Solutions:** Comprehensive testing processes, including kit dispatch and result reporting.\n- **Health Checks:** Available for various health conditions and general wellness.\n\nTheir weight loss program is also tailored for those pursuing long-term health improvements, with ongoing pharmacist support.\n\n**Vision for the Future:**\nTuli Health envisions a future where every local pharmacy becomes a health hub, equipped to deliver essential diagnostic services right on the high street. By optimizing local access to healthcare, they aim to facilitate better health outcomes for the community.\n\n**Website:** For further information, visit [Tuli Health](https://tuli.health).\n\n**In Summary:**\nTuli Health is ambitious in its approach to local healthcare, remodeling community pharmacies into accessible diagnostic centers. They're addressing a critical need in modern healthcare—convenience—while supporting pharmacies through innovative technology and strategic partnerships.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/741453076916326ef87f781b922b9b8027aca818.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192031Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=3774b5dfef4370b3726c16df8df4575e5dda4947d645519c168789f56e94a702",
    "social_links": [
        "https://www.linkedin.com/company/tulihealth/",
        "https://twitter.com/tuli_health",
        "https://www.facebook.com/tuli.health/"
    ],
    "logo_path": "data/logos\\Tuli_Health_logo.png"
}