{
    "links": "https://www.ycombinator.com/companies/turing-college",
    "name": "Turing College",
    "headline": "AI-driven online tech school for busy professionals",
    "batch": "W21",
    "description": "Turing College is an online AI-driven school for busy professionals. We upskill & reskill in data science & AI, analytics, marketing and programming in 3-12 months with 1on1 support and flexibility.",
    "activity_status": "Active",
    "website": "https://www.turingcollege.com/",
    "founded_date": 2020.0,
    "team_size": 50.0,
    "location": "Vilnius, Lithuania",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:education",
    "founders": [
        {
            "name": "Lukas Kaminskis, Founder",
            "description": "Lukas created his first coding bootcamp at 16 years old. At 22, he became a lecturer in software engineering at ISM international university. Lukas has been the CEO of Turing School since 2017. He has continued working with the Harvard CS50 team and several top-tier academics on various EdTech projects up to this day.",
            "linkedin": "https://www.linkedin.com/in/lukaskaminskis/"
        },
        {
            "name": "Tomas Moska, Founder",
            "description": "Tomas started his first company at only 17. At 20, he joined his first startup at its founding as a core team member and quickly grew to become a CTO. He is a self-taught engineer with a background in business & economics who studied engineering at the prestigious tech university 42 in Paris, France. At only 27, Tomas already has a decade of management & founder experience. In Turing, Tomas leads product & operation. He also serves as a chairman of the board.",
            "linkedin": "https://www.linkedin.com/in/alanturing/"
        },
        {
            "name": "Benas Sidlauskas, Founder",
            "description": "Ben created a leading global tech network for the Lithuanian diaspora at 19. He organized an event that received attention and Twitter coverage from Tesla and Elon Musk. He also co-organized the biggest alternative investment event in the Baltics. As a CEO, he bootstrapped a startup studio from zero to 350k USD in revenue over one year at the age of 21. Today, together with  Lukas & Tomas and the whole team, Benas is accelerating the transition to data-driven IT learning with the EdTech startup.",
            "linkedin": "https://www.linkedin.com/in/turingalan/"
        }
    ],
    "status": true,
    "generated_description": "Turing College is an innovative online tech school based in Vilnius, Lithuania, founded in 2020 as part of Y Combinator Batch W21. The college is dedicated to providing AI-driven courses tailored for busy professionals looking to upskill or reskill in data science, AI, analytics, marketing, and programming within a nimble timeframe of 3 to 12 months. With a focused mission, Turing College emphasizes flexibility, offering personalized one-on-one support to ensure students can learn at their own pace.\n\nAs of now, the college boasts a team of around 50 employees and has expanded its curriculum to include various programs such as Data Analytics, Data Science & AI, Web Development, Digital Marketing & Analytics, and specialized short courses in AI for Business Analytics and AI Engineering.\n\nThe approach Turing College takes is quite unique: there are no lectures. Instead, it provides a self-paced learning environment where students simulate the actual work of a tech company, gaining practical experience alongside their theoretical studies. This innovative model has led to impressive outcomes—students report a 97.9% employment rate after graduating, with many finding roles at notable companies like Telia, Nasdaq, and Western Union.\n\nCommunity is also a vital component of the Turing College experience. Students benefit from a supportive network of peers and mentors, enhancing their soft skills while building a robust portfolio. The college’s personalized learning plans cater not only to new learners stepping into the tech field but also to experienced professionals seeking career advancement.\n\nIf you’re looking for a career change or aiming to enhance your skills in today’s digital landscape, Turing College is worth exploring. With programs designed by industry veterans and a commitment to preparing graduates for real-world challenges, it's a compelling option for anyone serious about their career in tech. \n\nYou can find more details on their offerings at their official website: [Turing College](https://www.turingcollege.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/dc67776a149dcdc5c2f3c7ea7ca58544724e1f82.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192031Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=c3f69dd6e8092ea273d406701b3294fb6e866bab039c54599b52843de7037b34",
    "social_links": [
        "https://www.linkedin.com/company/turingcollege2",
        "https://www.facebook.com/turingcollege",
        "https://www.crunchbase.com/organization/turing-college"
    ],
    "logo_path": "data/logos\\Turing_College_logo.png"
}