{
    "links": "https://www.ycombinator.com/companies/hannah-life-technologies",
    "name": "twoplus fertility",
    "headline": "An effective home-use fertility treatment for natural conception",
    "batch": "S20",
    "description": "We are making a new fertility treatment that infertile couples can order with a click of a\r\nbutton to help them conceive at home. Our technology increases the likelihood of pregnancy by guiding significantly higher number of sperms towards the ovum using a proprietary combination of surface features and microenvironment optimization.\r\n\nThe fertility treatments available today, such as in-vitro fertilization (IVF) and intra-uterine\r\ninsemination (IUI), are psychologically and financially draining and come with considerable treatment-associated risks. Furthermore, over 25 million women of reproductive age in the US\r\nhave limited nearby access to fertility treatment.",
    "activity_status": "Active",
    "website": "http://twoplusfertility.com",
    "founded_date": 2019.0,
    "team_size": 18.0,
    "location": "Singapore, Singapore",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fertility-tech; industry:medical-devices; industry:telemedicine",
    "founders": [
        {
            "name": "Prusothman Raja, Founder",
            "description": "Medical device innovator with experience in new product development and navigating FDA.",
            "linkedin": "https://www.linkedin.com/in/prusothman-sina-raja-93881440/"
        },
        {
            "name": "Benjamin Tee, Founder",
            "description": "Spent a few good years in StanfordU dreaming up crazy ideas, and decided to make them real by starting companies. Stanford Biodesign Fellow and serial entrepreneur. Also an academic trying to help others dream and achieve things they never thought possible. Current 10 year goal: Make 1M babies with Hannah Life Technologies.",
            "linkedin": "https://linkedin.com/in/benjamintee"
        }
    ],
    "status": true,
    "generated_description": "**twoplus Fertility: Revolutionizing Home-Based Fertility Solutions**\n\nFounded in 2019 and part of Y Combinator Batch S20, twoplus Fertility is based in Singapore and is on a mission to make fertility treatment accessible and effective for couples trying to conceive. This company has emerged as a game-changer in the fertility landscape, particularly appealing to those daunted by the financial and emotional toll of traditional fertility treatments like IVF and IUI.\n\nTheir innovative approach focuses on a user-friendly, at-home fertility treatment that facilitates natural conception. By guiding an increased number of sperm towards the ovum through its proprietary technology, twoplus aims to improve the likelihood of pregnancy for couples. Their tagline could very well be, \"Conceive from the comfort of your home, with just a click.\"\n\n### **Why twoplus?**\n\nIn the U.S. alone, over 25 million women of reproductive age face limited access to fertility treatment, underscoring a critical gap that twoplus seeks to fill. Their offerings include a range of products tailored to support couples on their journey to parenthood:\n\n- **Applicator Extra**: For self-assisted home insemination, designed to maximize attempts per cycle.\n- **5-Month Fertility Plan**: A structured approach to support couples throughout their conception journey.\n- **Fertility Essentials**: Includes supplements and meal plans crafted to optimize fertility.\n- **Test Kits**: Practical tools for monitoring fertility, including ovulation and sperm count test kits.\n\nThe company has sold over 85,000 kits and gained traction among couples frustrated with the complexities of existing options, effectively helping thousands succeed in their conception efforts.\n\n### **Impactful Founding Story**\n\nThe founder, Benjamin Tee, has a personal connection to the fertility struggles many face. Having endured a long journey with infertility himself, he understands firsthand the psychological burdens involved. This motivated him to create twoplus, providing a supportive alternative to invasive medical procedures and the emotional rollercoaster they often entail.\n\n### **Team and Values**\n\nThe team consists of 18 dedicated employees who share a passion for supporting couples in building their families. With a clear mission to help 1,000,000 couples through innovative, accessible home fertility solutions, twoplus is changing the conversation around infertility. It’s a blend of tech, compassion, and a truly innovative spirit. \n\nShould you wish to explore more about their products and stories of successful conception, feel free to visit their website: [twoplus Fertility](http://twoplusfertility.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/5899b5e00e6b6d75de4dfe6cf918e75b3fbceeaa.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192032Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=c8dacefdb570962a511e48e45c354012323b864189d614748c4954308c7d94e7",
    "social_links": [],
    "logo_path": "data/logos\\twoplus_fertility_logo.png"
}