{
    "links": "https://www.ycombinator.com/companies/tybr-health",
    "name": "TYBR Health",
    "headline": "Natural hydrogel to keep internal organs scar-free after surgery",
    "batch": "W22",
    "description": "TYBR is developing a hydrogel to limit internal scarring after surgery. The naturally derived material is applied to coat tendons at the end of surgery to improve healing outcomes for the millions Americans who undergo tendon or ligament surgery each year.",
    "activity_status": "Active",
    "website": "https://www.tybrhealth.com/",
    "founded_date": 2020.0,
    "team_size": 3.0,
    "location": "Houston, TX",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:b2b; industry:medical-devices",
    "founders": [
        {
            "name": "Tim Keane, Founder",
            "description": "Tim Keane is a co-founder & CEO of TYBR Health. He has expertise in regenerative medicine and biomaterials and over 30 publications to support the science behind TYBR's technology. Prior to co-founding TYBR, Tim completed a Biodesign Fellowship at Texas Medical Center. He has a PhD in bioengineering from the University of Pittsburgh and completed post-doctoral fellowships at Imperial College London.",
            "linkedin": "https://www.linkedin.com/in/timjkeanejr"
        },
        {
            "name": "Alex Smith, Founder",
            "description": "Alex is a cofounder and TYBR’s CTO. He has a BS and MEng in Biomedical Engineering from Texas A&M University and a PhD in Mechanical Engineering from University of Houston. He has nearly a decade of experience in medical device development for dialysis access, vaginal dilators, and ventricular assist pump design. At TYBR, he prototypes the delivery system for ECM spray, plans studies, and manages manufacturability & cost control of the delivery device.",
            "linkedin": "https://www.linkedin.com/in/palexsmith/"
        }
    ],
    "status": true,
    "generated_description": "**TYBR Health: Revolutionizing Post-Surgical Recovery**\n\nFounded in 2020 and located in Houston, TX, TYBR Health is at the forefront of medical innovation with a clear and impactful mission: to develop a natural hydrogel that prevents internal scarring after surgery, significantly improving recovery outcomes for patients. As part of Y Combinator's Batch W22, the company embodies the entrepreneurial spirit of turning visionary ideas into transformative solutions.\n\nEvery year, millions of Americans undergo tendon and ligament surgeries, and while these surgeries are often necessary, they come with a substantial downside—painful recoveries that can lead to complications like internal scarring. TYBR’s cutting-edge hydrogel is designed to be applied at the end of these surgeries, acting as a protective coating that enhances the body’s natural healing process. This approach not only helps in reducing the complications that arise from scarring but also allows patients to return to their daily lives more swiftly.\n\nTheir product is rooted in nature, using a biocompatible material that is free of synthetics. This commitment to harnessing the body's inherent healing capabilities is what sets TYBR apart in the medical devices landscape, which is typically crowded with synthetic solutions.\n\nThe company's small but dedicated team of three, supported by their Group Partner Nan, is focused on further developing this product. Despite being a startup, TYBR Health highlights that recovery doesn’t have to mean halting life’s activities; they aim to minimize downtime and maximize the moments that matter. \n\nWhile the hydrogel is still under development and not yet available commercially, the vision is bold: to redefine how we think about recovery after intense surgical procedures by making it smoother and more efficient—something that should resonate with anyone who's navigated the lengthy and often painful recovery process after surgery.\n\nFor more information about their mission and technology, you can check out their website at [TYBR Health](https://www.tybrhealth.com/).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/1836c2085ec0908f1e85d59cb775802cf1ad0089.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192032Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=e25caddcc65da496bdd940709faba334360a29344e20e47cb5a7092529285e46",
    "social_links": [
        "https://www.linkedin.com/company/tybr-health/",
        "https://www.crunchbase.com/organization/tybr-health"
    ],
    "logo_path": "data/logos\\TYBR_Health_logo.png"
}