{
    "links": "https://www.ycombinator.com/companies/tyltgo",
    "name": "TyltGO",
    "headline": "TyltGO powers retailers with same-day delivery.",
    "batch": "S20",
    "description": "TyltGO provides brick & mortar retailers and e-commerce brands with same-day delivery under their own brand name.",
    "activity_status": "Active",
    "website": "https://www.tyltgo.com/",
    "founded_date": 2019.0,
    "team_size": 15.0,
    "location": "Kitchener, Canada",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:saas; industry:b2b; industry:delivery",
    "founders": [
        {
            "name": "Aaron Paul, Founder",
            "description": "Ever since a young age Aaron has always had an entrepreneurial mindset, from selling study notes in Grade 9, to building TyltGO currently. With both an entrepreneurial mindset and his broad technical skillset Aaron is the perfect fit for TyltGO as the Chief Technology Officer. Aaron currently is in the University of Waterloo studying Engineering and applies what he learns from the world renowned university daily with TyltGO.",
            "linkedin": "https://linkedin.com/in/a29paul"
        }
    ],
    "status": true,
    "generated_description": "**TyltGO: Revolutionizing Delivery for Retailers**\n\nFounded in 2019 and proudly based in Kitchener, Canada, TyltGO emerged from Y Combinator's S20 batch with a bold mission: to empower brick-and-mortar retailers and e-commerce brands through seamless same-day delivery services. With a lean team of 15, the company has quickly carved a niche in the competitive delivery landscape, distinguishing itself with a 99.99% delivery success rate, underscored by a money-back guarantee.\n\nAt its core, TyltGO operates as a Software as a Service (SaaS) platform that allows retailers to offer their own branded delivery options. This focus on quality customer service and an intuitive platform enables businesses to reduce time spent micromanaging logistics while maximizing their operational efficiency. As retailers focus on growth, TyltGO handles the heavy lifting of delivery, making it an invaluable partner for local businesses across Ontario and British Columbia.\n\n**The Process: Simple, Intuitive, Effective**\n\nTyltGO simplifies the delivery experience with a straightforward five-step process:\n1. Customers place orders on the retailer's eCommerce site.\n2. Retailers submit the orders to TyltGO with preferred pickup details.\n3. They pack orders, applying TyltGO's labels.\n4. TyltGO picks up the packages at the scheduled time.\n5. Couriers deliver the items by the end of the same day — guaranteed.\n\nRetailers can also choose next-day delivery, ensuring flexibility based on their customer needs.\n\n**Broad Reach and Support for Diverse Products**\n\nTyltGO's services are robust, catering to a variety of product types, including perishables and items with special delivery requirements. They are actively working with over 200 cities across Ontario and British Columbia, covering a wide range of delivery options seven days a week.\n\nRetailers appreciate TyltGO not just for the efficiency but also for competitive pricing that often undercuts traditional carriers for timely services. Their unique proprietary routing technology helps maintain cost-effectiveness, especially for small businesses with smaller order volumes.\n\n**Join the Movement**\n\nFor retail leaders looking to elevate their delivery game, TyltGO represents an opportunity to boost customer satisfaction and streamline logistics. With their commitment to service excellence and a growing network of satisfied clients, TyltGO is not just a delivery service; it's a partner in retail success. \n\nFor more information or to get started, visit [TyltGO's website](https://www.tyltgo.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/8c1de8e8d0ed875ace5347654cd5e7bdc1baad5f.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192033Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=a74507f48be81a2bc4b592bce9310a7cf0ccf090cb8bb509137f1737b341ee19",
    "social_links": [
        "https://www.linkedin.com/company/tyltgo/",
        "https://www.facebook.com/Tyltgo"
    ],
    "logo_path": "data/logos\\TyltGO_logo.png"
}