{
    "links": "https://www.ycombinator.com/companies/uberduck",
    "name": "Uberduck",
    "headline": "Fast, professional content creation with AI audio, image, and video.",
    "batch": "W22",
    "description": "Uberduck makes tools high-quality audiovisual content creation tools for product companies, brands, agencies, and musicians.\r\n\nWe offer audio generation, image generation, and video generation functionality, including enterprise workflow APIs to power end-to-end video creation experiences.\r\n\nVocal samples and full songs produced by our text-to-speech, text-to-singing, text-to-rapping, lyric video generation, and voice conversion technologies power:\r\n- AI remixes and original songs for musicians ranging from hobbyists to the largest DJs in the world.\r\n- Personalized musical content in marketing campaigns.\r\n- A variety of music-related consumer experiences built on top of our APIs.",
    "activity_status": "Active",
    "website": "https://www.uberduck.ai",
    "founded_date": 2021.0,
    "team_size": 2.0,
    "location": "Seattle, WA",
    "group_partner": "Diana Hu",
    "group_partner_yc": "https://www.ycombinator.com/people/diana-hu",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "location:seattle",
    "founders": [
        {
            "name": "Zach Ocean, Founder",
            "description": "Software engineer and writer. I studied at MIT, wrote for The Atlantic, and wrote software at Mixpanel and Propel before founding Uberduck. Former WMBR late-night DJ and founder of the Garfield High School Freestyle Rap Club.",
            "linkedin": "https://www.linkedin.com/in/zachwe/"
        }
    ],
    "status": true,
    "generated_description": "### Uberduck: AI-Powered Creative Tools\n\nFounded in 2021 and hailing from the vibrant tech city of Seattle, WA, Uberduck is on a mission to revolutionize content creation through AI. Initially developed as a suite of high-quality audiovisual tools for brands, agencies, and musicians, Uberduck has rapidly expanded its offerings to encompass an impressive array of capabilities in audio, images, and video generation.\n\n**What do they offer?**\n\nUberduck's platform provides robust functionalities including:\n- **AI Audio Generation**: This includes features like text-to-speech, text-to-singing, and text-to-rapping, catering to diverse creative styles and needs.\n- **Image and Video Creation**: Users can produce eye-catching imagery and video content with ease, further enhanced by interaction through enterprise APIs that facilitate seamless end-to-end creation.\n- **Music Production**: From hobbyists to professional DJs, musicians can leverage Uberduck’s technology to generate unique remixes and original tracks, making personalized content for marketing campaigns more accessible than ever.\n\nThe technology underlying Uberduck is impressive. Their vocal samples and full songs produced by their advanced AI tools not only allow for creative musical explorations but also cater to a variety of industries that include marketing and consumer experiences. Imagine using custom voices for a campaign or generating a new song in seconds—all possible with Uberduck.\n\n**The Team and Support System**\n\nDespite being a small team of just two, Uberduck is part of Y Combinator’s Batch W22, a testament to its innovative capabilities and potential. Diana Hu acts as the Group Partner, bringing valuable insights and experience to the venture. \n\n**Community and Usage**\n\nUberduck fosters a community-centric approach, actively engaging creators through its platform. You can follow them on various social media outlets and join their community on Discord, where users share projects and tips, enhancing the creative experience.\n\nIf you're looking to spice up your content creation, dive into Uberduck. From creating catchy tunes to generating striking visuals, it's a versatile player in the AI content landscape. Check out their offerings and get started on your creative journey at [Uberduck.ai](https://www.uberduck.ai).\n\n### Summary\n\nTo sum it up: Uberduck is a sleek, AI-driven platform resourcing tools for anyone looking to craft high-quality audio-visual content efficiently. From musicians wanting unique songs to marketers seeking custom campaigns, Uberduck is geared up to make content creation fast, professional, and fun. And with its impressive toolset, the possibilities are limited only by your imagination.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/c301e8db3fbbf611f3337fbb9074103243a79123.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192033Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=8d5f72ced0563bcdb9bfeaca4d1f0ec967c0171b48e47a13e9b88fd36851efde",
    "social_links": [
        "https://www.linkedin.com/company/uberduck",
        "https://twitter.com/__UBERDUCK__"
    ],
    "logo_path": "data/logos\\Uberduck_logo.png"
}