{
    "links": "https://www.ycombinator.com/companies/undermind",
    "name": "Undermind",
    "headline": "An AI agent for scientific research",
    "batch": "S24",
    "description": "At Undermind, we're building a search engine that can handle extremely complex questions. It’s geared at experts, like research scientists and doctors, who need to find very specific resources to solve high-stakes problems. \r\n\nWe’ve rebuilt search from the ground up to address this. Our new approach employs high-quality LLMs to adaptively explore a database, mimicking how a human researcher carefully discovers information. This approach dramatically outperforms (by 10-50x) traditional keyword search and other modern AI-based retrieval methods.\r\n\nOur first target users are the 50 million researchers searching for scientific literature on PubMed and Google Scholar every month. We’ve have users paying us $200-$500 per seat per year, from fields like medicine, ML, biotech, finance, and more.",
    "activity_status": "Active",
    "website": "https://www.undermind.ai",
    "founded_date": 2023.0,
    "team_size": 2.0,
    "location": "San Francisco",
    "group_partner": "Tom Blomfield",
    "group_partner_yc": "https://www.ycombinator.com/people/tom-blomfield",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:artificial-intelligence; industry:machine-learning; industry:biotech; industry:search; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Joshua Ramette, Founder",
            "description": "Josh is the co-founder and CEO at Undermind. He has research experience in gravitational-wave astrophysics (LIGO), particle physics (CERN), atomic physics, and quantum information science. He did his PhD at MIT studying quantum computing architecture design and inventing techniques for generating entangled multi-particle states using atom-light interactions, with 3 patents pending and 6 peer-reviewed publications.",
            "linkedin": "https://linkedin.com/in/joshua-ramette-50984791"
        },
        {
            "name": "Tom Hartke, Founder",
            "description": "Tom is the co-founder and CTO at Undermind. He studied physics at Princeton, then did his PhD in quantum physics at MIT. His thesis was recognized by the American Physical Society as one of the top 4 theses in the field of atomic physics in 2022, and he has published 10 papers in the field, including two in Nature and Science. Tom has deep expertise in building and deploying complex systems.",
            "linkedin": "https://www.linkedin.com/in/thomas-hartke-229a0679/"
        }
    ],
    "status": true,
    "generated_description": "**Company Overview: Undermind**\n\n**Mission**: Undermind aims to revolutionize scientific research with an AI agent that acts as a powerful assistant, enabling researchers, doctors, and other experts to navigate complex questions efficiently.\n\n**Foundation**: Founded in 2023, Undermind is a part of Y Combinator's Batch S24, situated in San Francisco, and currently operates with a small but agile team of two.\n\n**Innovation in Search**: Traditional keyword searches just don't cut it for serious researchers. This is where Undermind steps in. It has completely reimagined the search engine experience tailored specifically for high-stakes scientific inquiry. Using sophisticated large language models (LLMs), Undermind can search through vast databases, simulating a thorough, human-like research methodology. Unlike traditional tools, Undermind can deliver results that are **10-50 times more accurate**, helping researchers swiftly find precise resources.\n\n**Target Audience**: The platform primarily caters to the 50 million researchers who rely on resources like PubMed and Google Scholar each month, charging between $200 and $500 annually per user from fields such as medicine, machine learning, biotech, and finance.\n\n**User Experience**: Undermind's design allows researchers to interact with the AI as they would with a smart colleague. It deciphers complex topics, digging through hundreds of academic papers to unearth exactly what's needed. Users gain access to accurate results presented with contextual explanations, complemented by the ability to ask follow-up questions—ensuring a deep understanding of the material.\n\n**Testimonials**: Early users, like researchers from prestigious institutions such as MIT and Harvard, emphasize the high-powered synthesis algorithms that deliver timely, relevant insights, drastically improving their research workflows.\n\n**Critical Features**:\n- **Autonomous Research**: Undermind doesn’t just search; it performs an independent investigation into intricate topics, improving accuracy with every query.\n- **Database Coverage**: It pulls from the extensive Semantic Scholar database containing over 200 million articles, enveloping numerous fields of science.\n- **Time Efficiency**: While typical searches may yield quick results, Undermind invests a few minutes to meticulously analyze and present the most relevant information—a game-changer for serious investigations.\n\n**Founders' Background**: Built by two MIT PhDs with deep expertise in quantum physics and AI, Undermind is rooted in an understanding of the daunting challenges researchers face in sifting through vast amounts of literature.\n\n**Contact and Engagement**: For research professionals looking to streamline their literature search or gain insights at a new level, Undermind offers a free trial, encouraging them to experience firsthand how it can transform their research experience.\n\nIn a nutshell, if you're in the business of complex research, Undermind is your new go-to assistant—ready to empower you to conduct deeper, faster, and more precise scientific exploration. \n\n**Website**: Explore Undermind at [undermind.ai](https://www.undermind.ai).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/32eecc0df268b1e23bbd4ffb11e7d47a96bfb55f.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192035Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=70145454adef58a9d73869cffccdb13a0ffc668106cbb7a3ddb9d9f87ff02caa",
    "social_links": [
        "https://www.linkedin.com/company/undermind-ai",
        "https://twitter.com/UndermindAI"
    ],
    "logo_path": "data/logos\\Undermind_logo.png"
}