{
    "links": "https://www.ycombinator.com/companies/union54",
    "name": "Union54",
    "headline": "Developers of ChitChat, an integrated messaging and payments walletâ\u0080¦",
    "batch": "S21",
    "description": "ChitChat by Union54 is an integrated messaging and payments platform designed specifically for Africa's unique needs.\r\n\nOur app combines secure instant messaging with USD card capabilities and cross-border payments, making international money movement more accessible and affordable.\r\n\nWe're tackling one of Africa's biggest financial challenges: the high cost of sending money across borders, where African senders often pay double the fees despite sending smaller amounts.\r\n\nAs a Y Combinator-backed startup, we're building technology that empowers African consumers and businesses to participate more fully in the global digital economy.\r\n\nOur mission is to create financial products that genuinely serve customer needs while challenging the status quo of traditional remittance providers.",
    "activity_status": "Active",
    "website": "https://union54.com",
    "founded_date": 2021.0,
    "team_size": 17.0,
    "location": "Lusaka, Zambia",
    "group_partner": "Michael Seibel",
    "group_partner_yc": "https://www.ycombinator.com/people/michael-seibel",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:finops; industry:fintech; industry:consumer; industry:b2b; industry:messaging",
    "founders": [
        {
            "name": "Perseus Mlambo, Founder",
            "description": "CEO at Union54, developers of ChitChat.",
            "linkedin": "https://www.linkedin.com/in/perseus"
        },
        {
            "name": "Alessandra Martini, Founder",
            "description": "Co-founder & COO at Union54",
            "linkedin": "https://za.linkedin.com/in/alessandra-martini-5bb15991"
        }
    ],
    "status": true,
    "generated_description": "**Union54: Empowering Financial Freedom in Africa**\n\nFounded in 2021 and hailing from Lusaka, Zambia, Union54 is a Y Combinator-backed startup on a mission to revolutionize how money moves across borders in Africa. At its core, Union54 develops ChitChat—an integrated messaging and payments platform tailored to the unique financial landscape of the continent. The founders are tackling one of the most pressing challenges in Africa: exorbitant remittance fees that often burden senders with costs twice as high as necessary. \n\n**The Vision Behind Union54**\n\nThe vision is clear: create a seamless blend of secure instant messaging and payment capabilities that cater specifically to African users. With ChitChat, the app not only allows users to exchange messages but also empowers them to manage their finances with features like a USD wallet and the ability to transfer funds across ~50 countries. This makes international money movement more accessible and dials down the often-overwhelming costs traditionally associated with remittances.\n\n**Innovative Solutions for Diverse Needs**\n\nUnion54’s product suite extends far beyond ChitChat. Alongside the consumer app, they offer GovChat—a secure chat and payment platform designed specifically for governmental use, ensuring that sensitive communications remain confidential. Additionally, their ChitChat API provides businesses the flexibility to build their own messaging applications with integrated wallet functionality, all while leveraging Union54’s robust infrastructure.\n\n**Building Digital Sovereignty**\n\nThus, the mission isn’t just about payments; it's about fostering digital sovereignty. Union54 envisions a future where both civilians and governments have the tools to engage in secure, meaningful discussions and transactions without fear of external interference. These goals are particularly crucial in socio-political climates experiencing instability.\n\n**The Team and Backing**\n\nWith a team of 17 passionate individuals, Union54 is poised to make a significant impact. Their partnership with Y Combinator comes with not just funding but mentorship that accelerates their growth and enhances their strategic direction. Their ethos is centered around genuine service to customer needs, setting them apart from traditional players in the remittance space.\n\n**A Call to Action**\n\nIf you’re looking to break down the barriers of financial transactions and engage in more meaningful communications, Union54 is at the forefront of this transformation. As they continue to develop their offerings, the emphasis remains on creating a digital financial landscape that serves Africa’s burgeoning needs.\n\nFor more information about their offerings, visit [Union54](https://union54.com).\n\nIn a world where communication and finance are increasingly integrated, Union54 is making sure that Africa doesn’t just participate in the global digital economy but thrives in it.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/73e539a4511d2c761560e7fd5e7394d15ac1da8e.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192035Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=2157ef3a41b2e5260f0799572135f8ff4d0f3115b0c83342914206c62cee25cc",
    "social_links": [
        "https://www.linkedin.com/company/union54"
    ],
    "logo_path": "data/logos\\Union54_logo.png"
}