{
    "links": "https://www.ycombinator.com/companies/unison",
    "name": "UNISON",
    "headline": "Live between worlds, in UNISON, using the headset we're building!",
    "batch": "W22",
    "description": "UNISON is building a unified reality headset to dive in and resurface from virtual worlds with new-found value.\r\n\nUNISON is a small team of passionate people from companies like Meta, Sony, Apple and research labs like the IARAI, based in the SF Bay Area and backed by some of the world’s best investors. Learn more about us, our product, and team here: in-unison.com.",
    "activity_status": "Active",
    "website": "https://www.in-unison.com/",
    "founded_date": 2021.0,
    "team_size": 15.0,
    "location": "Mountain View",
    "group_partner": "Diana Hu",
    "group_partner_yc": "https://www.ycombinator.com/people/diana-hu",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:hardware; industry:virtual-reality; industry:consumer; industry:gaming; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Maxim Perumal, Founder",
            "description": "I built Relativty, a popular open-source VR headset when I was 15 years old. The software and standards I created then are now used in many VR headsets. I built a team of ex-Head of Engineerings / CTOs / Founders, and Principal & Senior Engineers from companies like Apple, Nvidia, Intel, Activision, Meta, Sony.",
            "linkedin": "https://www.linkedin.com/in/maxim-perumal-8172a5260/"
        }
    ],
    "status": true,
    "generated_description": "### UNISON: Bridging Reality and Virtuality\n\n**Overview**  \nFounded in 2021 and part of Y Combinator's W22 batch, UNISON is a Mountain View-based startup on a mission to reshape how we interact with technology. The company is developing an innovative unified reality headset designed to seamlessly blend virtual and real worlds—something they refer to as living \"between worlds.\"\n\n**Mission and Philosophy**  \nUNISON believes that virtual reality (VR) should enhance our daily lives rather than serve as an escape. Their approach is to use VR headsets when they are truly beneficial—promoting creativity over passive consumption. This philosophy underpins their commitment to creating one of the most sophisticated consumer hardware and software experiences in the market.\n\n**Team and Expertise**  \nWith a compact but passionate team of 15 professionals hailing from prestigious companies like Meta, Sony, and Apple, along with leading research institutions, UNISON is well-equipped to tackle the complexities of VR technology. They've cultivated a team that includes engineers, designers, scientists, and thinkers who are all united by a common vision.\n\n**Investment and Backing**  \nUNISON is backed by notable investors including Y Combinator, Lachy Groom from LGF, and Jeannette zu Fürstenberg of General Catalyst—individuals with experience in funding some of the most successful tech companies today. These investors lend their expertise to ensure that UNISON not only develops cutting-edge technology but also remains grounded in a vision for the future.\n\n**Culture and Careers**  \nThe company is continually on the lookout for talented individuals in software, hardware, AI, and design. They offer competitive salaries, equity, and comprehensive benefits, including a fully-paid health insurance package. UNISON emphasizes a culture of collaboration and innovation, inviting interested candidates to explore their careers page.\n\n**Website and Social Media**  \nTo learn more about UNISON’s groundbreaking headset, philosophy, and career opportunities, visit their website at [in-unison.com](https://www.in-unison.com).\n\nIn summary, UNISON is positioning itself as a key player in the VR space with a message that resonates deeply in today's digital landscape. Their focus on utility, creativity, and a balanced approach to technology signals a thoughtful contribution to the evolving world of virtual experience.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/e18f64ac4a1461b89a6a39441e266fbb820c27c4.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192035Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=2232808d5ad03c449be443fe59bebccb1ee5cf2d35d0f694c47f324fdb0f7aae",
    "social_links": [
        "https://www.linkedin.com/company/unisoninc",
        "https://twitter.com/unison___inc"
    ],
    "logo_path": "data/logos\\UNISON_logo.png"
}