{
    "links": "https://www.ycombinator.com/companies/univerbal",
    "name": "Univerbal",
    "headline": "Language learning with a conversational AI Tutor",
    "batch": "W23",
    "description": "Univerbal is an AI-powered language learning app that helps people boost their confidence simply by talking. In unscripted and dynamic conversations, users can talk about anything they’d like using the microphone, with the AI responding as it adapts to their level and skills. Each user gets a personal AI Language Tutor that creates a custom learning plan based on the language goals they’d like to work towards and their own interests, offers instant corrections after every message and helps users in their own language.\r\nBased in the country with 4 official languages, Switzerland, in 2024 we were selected as one of WIRED’s Hottest 100 Startups in Europe.",
    "activity_status": "Active",
    "website": "https://univerbal.app",
    "founded_date": 2023.0,
    "team_size": 3.0,
    "location": "Zürich, Switzerland",
    "group_partner": "Jared Friedman",
    "group_partner_yc": "https://www.ycombinator.com/people/jared-friedman",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": null,
    "founders": [
        {
            "name": "Philipp Hadjimina, Founder",
            "description": "Philipp has a deep technical background from his Computer Science undergraduate degree from ETH Zurich and his graduate research experience on NLP at UC Berkeley. Wanting to learn Greek, he took 1-1 tutoring lessons and noticed how tailoring a session based completely on the student's interest and need can drastically accelerate learning as well as be more engaging.",
            "linkedin": "https://www.linkedin.com/in/pmhadjimina/"
        },
        {
            "name": "Samuel Bissegger, Founder",
            "description": "Co-founder of Univerbal and a master's graduate in general management at HSG with a great interest in understanding markets and people. I am driven by making a meaningful business into a growth case and revolutionizing language learning through AI.",
            "linkedin": "https://www.linkedin.com/in/samuel-bissegger/"
        },
        {
            "name": "David Niederberger, Founder",
            "description": "Co-Founder at Quazel and enthusiastic to revolutionize language learning through NLP. Currently finishing a graduate degree in Computer Science at ETH Zurich with specialization in data science and explainable AI.",
            "linkedin": "https://www.linkedin.com/in/david-niederberger-aba7a7177/"
        }
    ],
    "status": true,
    "generated_description": "### Univerbal: Your AI Language Tutor\n\n**Overview**  \nUniverbal, founded in 2023 and based in Zürich, Switzerland, is an innovative language learning platform that leverages the power of conversational AI. The company is part of the prestigious Y Combinator Batch W23 and has quickly garnered attention, being recognized as one of WIRED's Hottest 100 Startups in Europe in 2024.\n\n**Mission**  \nThe mission of Univerbal is to make language learning accessible and engaging through dynamic, unscripted conversations with an AI tutor. The platform seeks to help users boost their confidence simply by talking, aiming for real conversations that lead to real improvements.\n\n**How It Works**  \nAt the heart of Univerbal’s offering is a personalized AI language tutor. Upon joining, each user receives a custom learning plan tailored to their specific language goals and interests. Users can engage in conversations across more than 20 languages, speaking freely with the AI, which adapts to their skill level and provides immediate corrections after each interaction. This method not only allows users to learn at their own pace but also creates a non-judgmental environment where making mistakes is part of the learning process.\n\n**Team and Growth**  \nUniverbal operates with a small but dedicated team of three employees, including Jared Friedman as their Group Partner. This lean approach allows for agility and innovation, essential in the fast-paced tech startup landscape.\n\n**User Experience**  \nUniverbal emphasizes real-time feedback—users receive instant suggestions for improvement, enabling them to enhance their skills right away. Their unique approach has made it a hit among language learners, resulting in over 100,000 downloads and an impressive average rating of 4.7 on the App Store.\n\n**The Future**  \nWith its blend of cutting-edge AI technology and a deep understanding of language acquisition, Univerbal is poised to redefine how individuals approach language learning. By removing traditional barriers and focusing on conversational practice, it’s helping learners gain the confidence they need to speak like a native.\n\nIf you’re interested in trying out their platform and engaging in immersive language learning, head over to their website [Univerbal.app](https://univerbal.app) and get started today!",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/70b04e6158b17477cab22b1aa708188ef312239d.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192035Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=c5e6df517e4bbe668f2d7595c9530a4256081cbbb1268883af752ea6b6527ac6",
    "social_links": [
        "https://www.linkedin.com/company/quazel",
        "https://facebook.com/univerbalapp",
        "https://www.crunchbase.com/organization/quazel"
    ],
    "logo_path": "data/logos\\Univerbal_logo.png"
}