{
    "links": "https://www.ycombinator.com/companies/unravel-carbon",
    "name": "Unravel Carbon",
    "headline": "Enterprise software for companies to track & reduce their carbonâ\u0080¦",
    "batch": "W22",
    "description": "Unravel Carbon is a leading sustainability data management platform, used in 48+ countries. It uses AI/ML to help enterprises transform any operational data into full carbon supply chain data, helping them measure, track and report on their sustainability performance. It is already serving some of the worldâ\u0080\u0099s largest companies and is backed by Sequoia and Y Combinator.",
    "activity_status": "Active",
    "website": "http://unravelcarbon.com",
    "founded_date": 2021.0,
    "team_size": 42.0,
    "location": "Singapore, Singapore",
    "group_partner": "Gustaf Alstromer",
    "group_partner_yc": "https://www.ycombinator.com/people/gustaf-alstromer",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:saas; industry:b2b; industry:climate",
    "founders": [
        {
            "name": "Grace Sai, Founder",
            "description": "Founder (exited), turned VC (Kauffman Fellow), turned ClimateTech founder (YCW22). Oxford MBA, INSEAD; based in Singapore.",
            "linkedin": "https://www.linkedin.com/in/gracesai/"
        },
        {
            "name": "Marc Allen, Founder",
            "description": "I'm a chemical engineer with over 20 years' experience in a number of areas, including in operations and design of hydrogen facilities. Since 2007, I've been focussed on climate change and sustainability - helping organisations estimate their emissions, determine their exposure to climate risk and develop climate change strategies. I've worked extensively in low-carbon energy, large-scale decarbonisation and in carbon markets and offsets.",
            "linkedin": "https://www.linkedin.com/in/marc-allen-90697227/"
        }
    ],
    "status": true,
    "generated_description": "**Company Overview: Unravel Carbon**\n\nFounded in 2021 and based in Singapore, Unravel Carbon has quickly established itself as a crucial player in the realm of sustainability data management. Emerging from Y Combinator's Batch W22, this rapidly growing company now operates in over 48 countries, showcasing a commitment to helping enterprises track, reduce, and ultimately report on their carbon footprints.\n\n**Mission and Impact**\n\nUnravel Carbon's mission centers around providing enterprise software that transforms operational data into carbon supply chain insights. By leveraging AI and machine learning, the platform empowers companies to make data-driven decisions regarding their sustainability efforts. This innovative approach has attracted the attention of industry giants, positioning Unravel Carbon as a partner for some of the world's largest corporations, all while being financially backed by notable investors like Sequoia and Y Combinator.\n\n**Key Features and Offerings**\n\n1. **Carbon Management Platform:** Unravel Carbon provides a comprehensive platform for end-to-end carbon management. Clients can measure, manage, and report on their emissions, backed by robust analytics and insights.\n\n2. **Specialized Solutions:** The company offers tailored services across various industries, including fashion, manufacturing, food and beverage, and financial institutions. Each solution is crafted to meet the specific sustainability challenges these sectors face.\n\n3. **Proven Results:** With reported reductions in emissions of 19-36% through recommended solutions, and a 100% audit pass rate among its users, Unravel Carbon not only supports its clients in reducing their carbon footprints but also helps them seamlessly comply with growing regulatory standards.\n\n4. **Expert Support:** The team consists of seasoned sustainability consultants and data experts dedicated to providing ongoing guidance throughout the customer journey, ensuring that firms can confidently tackle their sustainability goals.\n\n**Recognition and Future Directions**\n\nUnravel Carbon’s efforts have garnered recognition, including being listed in the Asia 100 to Watch list, highlighting startups poised for significant impact. As the climate crisis intensifies, the demand for reliable and actionable carbon management tools is greater than ever. Unravel Carbon stands out not just for its technology but for its vision to transform the way businesses think about emissions, helping their clients navigate a sustainable future.\n\n**Conclusion**\n\nUnravel Carbon is more than just a tech company; it’s a catalyst for change in how businesses approach sustainability. For enterprises looking to take meaningful action against climate change, Unravel Carbon is a logical starting point. If you're interested in transforming your company's approach to sustainability, [request a demo here](http://unravelcarbon.com/request-demo).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/7d2033d074fb4990acd00ebbf0e4d577c23966a4.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192035Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=d8d9df4eb4e053e0aaec29feae8b79bac0ee6b91ae539619f0b099e8ec064a7d",
    "social_links": [
        "https://www.linkedin.com/company/unravelcarbon/"
    ],
    "logo_path": "data/logos\\Unravel_Carbon_logo.png"
}