{
    "links": "https://www.ycombinator.com/companies/unriddle",
    "name": "Unriddle",
    "headline": "AI for researchers, students and scientists",
    "batch": "S24",
    "description": "We build tools to help people think and work better.\r\n\nToday, Unriddle helps researchers and students quickly find insights in documents, video and audio so they can learn and write faster. \r\n\nWe started working on Unriddle 18 months ago. In that time:\r\n- we’ve grown to 3M users spanning hundreds of major colleges and research-led companies,\r\n- we hit $1.5M in yearly revenue and are fast approaching our next milestone of $2M,\r\n- 100M+ people have seen our content across Instagram, TikTok and YouTube,\r\n- and we raised a $2.4M seed with checks from YC and the founders of Github and Reddit.\r\n\nLooking ahead, we're expanding beyond just summarization and writing assistance to address the broader challenges of information overload faced by researchers and students.\r\n\nWe're a small, tight-knit team with huge ambitions. As a founding member of the team, you'll be instrumental in helping us scale revenue from $1M to $10M and then $10M to $100M+.\r\n\nIf you’re excited by the idea of being a part of that, definitely apply.",
    "activity_status": "Active",
    "website": "https://www.unriddle.ai/",
    "founded_date": 2023.0,
    "team_size": 5.0,
    "location": "San Francisco",
    "group_partner": "Tom Blomfield",
    "group_partner_yc": "https://www.ycombinator.com/people/tom-blomfield",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:consumer; industry:b2b; industry:ai; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Naveed Janmohamed, Founder",
            "description": "Naveed graduated top of his class from University College London with a master’s degree in Human-Computer Interaction. He has 10+ years of experience in product design and HCI research. He built and grew Unriddle to $800K ARR entirely solo before making his first hire.",
            "linkedin": "https://linkedin.com/in/naveedjanmo"
        }
    ],
    "status": true,
    "generated_description": "Unriddle is a promising startup with a clear mission: to leverage AI for enhancing the research capabilities of students, scientists, and academics. Founded in 2023 and currently part of Y Combinator's Batch S24, Unriddle started out with the idea of building tools to help people think and work better. In just 18 months, they've made impressive strides—growing to 3 million users across major colleges and research institutions, generating $1.5 million in annual revenue, and catching the attention of notable investors including YC and the founders of GitHub and Reddit.\n\nAt its core, Unriddle provides a suite of AI-driven solutions that help users swiftly glean insights from documents, videos, and audio materials. Whether you're trying to write faster, manage citations, or convert handwriting, their tools promise clear and actionable results in an instant. The platform supports various formats like PDFs and audio recordings, making it an adaptable ally for diverse academic needs. \n\nBut they're not stopping there. Unriddle is addressing the broader issue of information overload that many researchers face. They plan to expand their offerings beyond just summarization and writing assistance, increasing the value they provide to their user base.\n\nThe company currently operates with a small, passionate team of five, and they have strong ambitions to scale further, eyeing revenue milestones of $10 million and beyond. Their growth trajectory is bolstered by the visibility they've gained on social media, with over 100 million people engaging with their content across platforms like Instagram, TikTok, and YouTube.\n\nIn essence, Unriddle is making waves in the EdTech and AI spheres—transforming how research is conducted and empowering its users to work smarter, not harder. So if the thought of diving into AI for academia excites you, it might just be the perfect time to get involved with Unriddle as they continue to shape the future of research. For more insights, check out their website at [Unriddle](https://www.unriddle.ai/).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/682051f03c85e8752667d90148f824dbc865100d.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192036Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=fda9582229f524151ce7278652f3d7d99a6382781303eb8d0154990dfb9565cc",
    "social_links": [
        "https://www.linkedin.com/company/unriddle-ai/",
        "https://twitter.com/unriddle_ai"
    ],
    "logo_path": "data/logos\\Unriddle_logo.png"
}