{
    "links": "https://www.ycombinator.com/companies/upbanx",
    "name": "UpBanx",
    "headline": "Brex for D2C Brands and Content Creators in Indonesia",
    "batch": "W22",
    "description": "UpBanx is Brex for D2C brands and content creators in Indonesia. We help our customers open a high-yield business account, get financing, manage transactions, and launch Web3 projects, all in one place. There are over 700k D2C brands and content creators in Indonesia. If we serve all of them, that is a $14b/year market opportunity.\r\n\nWe've raised $5.6m so far from investors like Y Combinator, Alpha JWC, Alto Partners, CreditEase, Oliver Jung and lndonesia's biggest influencer Raffi Ahmad who has over 100m followers on social. We have also raised from 6 other Y Combinator founders. We are open to working with more investors that can bring strategic value to our long-term roadmap.",
    "activity_status": "Active",
    "website": "http://UpBanx.com",
    "founded_date": 2021.0,
    "team_size": 13.0,
    "location": "Jakarta, Indonesia",
    "group_partner": "Gustaf Alstromer",
    "group_partner_yc": "https://www.ycombinator.com/people/gustaf-alstromer",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:marketplace; industry:crypto-web3; industry:creator-economy",
    "founders": [
        {
            "name": "Wafa Taftazani, Founder",
            "description": "Award-winning Cambridge-educated executive, entrepreneur and investor with 10+ years of experience across technology, digital entertainment, corporate finance, public policy, and international relations.",
            "linkedin": "https://www.linkedin.com/in/wafataftazani/"
        },
        {
            "name": "Alif Jafar Fatkhurrohman, Founder",
            "description": null,
            "linkedin": "https://linkedin.com/in/alifjafar"
        },
        {
            "name": "Hendri Wijaya, Founder",
            "description": null,
            "linkedin": "http://linkedin.com/in/hendri-wijaya-b556901a5"
        }
    ],
    "status": true,
    "generated_description": "**UpBanx: Your Financial Ally in Indonesia's D2C and Creator Economy**\n\nFounded in 2021 and currently thriving out of Jakarta, UpBanx is on a mission to be the financial backbone for Direct-to-Consumer (D2C) brands and content creators in Indonesia. Think of UpBanx as a localized equivalent of Brex, providing a high-yield business account, financing options, transaction management, and support for Web3 projects—all in one user-friendly platform.\n\n### The Market Opportunity\n\nUpBanx is targeting a booming market. With over 700,000 D2C brands and content creators in Indonesia, it is hovering over a potential annual market opportunity of $14 billion. That's significant for a relatively young fintech startup.\n\n### Investment and Growth\n\nBacked by $5.6 million from notable investors, including Y Combinator and the Indonesian influencer Raffi Ahmad—who boasts a staggering 100 million followers—UpBanx is well-positioned to take on the market. Their funding also involves contributions from six other Y Combinator alumni, showcasing a strong network of entrepreneurial support.\n\n### Features That Matter\n\nUpBanx isn't just about banking; it's about empowering creators and brands with tools tailored for their unique challenges:\n\n- **Financing:** Access automatic invoice financing at an attractive admin fee of only 1.8–2.5% per month.\n  \n- **Invoice Management:** An intuitive invoice generator to streamline billing and reminders. No more missed payments.\n  \n- **Financial Statements:** Quick and easy generation of financial reports to help businesses track their performance effortlessly.\n\n- **UpThinx:** A cutting-edge AI-powered content generator that helps brands maintain their messaging and brand voice consistently.\n\n### Team and Community\n\nThe UpBanx team, currently composed of 13 talented individuals, collaborates under the guidance of Gustaf Alstromer from Y Combinator. They've surrounded themselves with a community that understands the creator economy, garnering trust and insights from top names in Indonesia’s entertainment landscape.\n\n### Safety and Accessibility\n\nRest assured; UpBanx prioritizes user security by partnering with licensed financial entities, ensuring compliance with regulations and offering peace of mind with its financial products. Users can download the app for free, with comprehensive features available upon meeting the minimum requirements.\n\n### Conclusion\n\nUpBanx is riding the wave of a digital transformation in Indonesia’s financial landscape. By addressing the specific needs of D2C brands and content creators, they're not just offering services but changing how financial power translates into creative freedom. It’s all about enabling creators to focus on what they love while empowering them with the financial tools they need.\n\nFor more information, check out their website at [UpBanx.com](http://UpBanx.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/fbff23f8fce30a236d1a1c0e0b2421321782e893.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192037Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=3fccbc1061296f64c525cd93e235485c31c658382e2af16d8bbe89227ed83d4e",
    "social_links": [
        "https://www.linkedin.com/company/upbanx",
        "https://www.crunchbase.com/organization/upbanx"
    ],
    "logo_path": "data/logos\\UpBanx_logo.png"
}