{
    "links": "https://www.ycombinator.com/companies/upchieve",
    "name": "UPchieve",
    "headline": "Connecting low-income HS students with free, 24/7 online tutoring",
    "batch": "W21",
    "description": "UPchieve is an edtech nonprofit that provides free, 24/7 online tutoring to low-income HS students. Using our app, students can request and get paired with a live volunteer in under 5 minutes. We’ve matched 100,000+ requests so far.\r\n\nRight now in the US, there are 8 million low-income HS students who don’t have anyone in their home who can help them with schoolwork. UPchieve is working to change that. Our vision is simple: we want to democratize access to academic support, so that every student has an equal opportunity to attend college and achieve upward mobility.",
    "activity_status": "Active",
    "website": "https://www.upchieve.org",
    "founded_date": 2016.0,
    "team_size": 15.0,
    "location": "New York",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:education; industry:nonprofit; location:new-york",
    "founders": [
        {
            "name": "Aly Murray, Founder",
            "description": "Former low-income student working to democratize access to academic support. Penn C'16, Forbes 30 Under 30 2021.",
            "linkedin": "https://www.linkedin.com/in/alymurray/"
        }
    ],
    "status": true,
    "generated_description": "**UPchieve: Bridging the Education Gap for Low-Income Students**\n\nFounded in 2016, UPchieve is an innovative ed-tech nonprofit headquartered in New York. The organization has a clear mission: to connect low-income high school students with free, 24/7 online tutoring. In a world where educational resources are often a privilege, UPchieve aims to democratize academic support, ensuring that every student has the opportunity to succeed.\n\n**The Need for UPchieve**\n\nIn the U.S., there are approximately 8 million low-income high school students who lack access to help with their schoolwork at home. Recognizing this significant gap, UPchieve has built a platform that allows students to request immediate, personalized tutoring. In under five minutes, they can be paired with a live volunteer tutor—making assistance readily available when they need it most. So far, UPchieve has successfully matched over 100,000 requests.\n\n**Core Features**\n\n1. **24/7 Availability**: Students can chat with certified tutors at any hour, ensuring support is just a click away.\n2. **One-on-One Sessions**: UPchieve offers tailored tutoring through interactive tools like whiteboards for a personalized learning experience.\n3. **Wide Range of Subjects**: With help available in subjects such as math, science, and college preparation, students have access to a breadth of resources that cater to their academic needs.\n\n**Engaging Volunteers**\n\nUPchieve not only supports students but also encourages qualified individuals to donate their time as volunteer tutors. The system is designed to fit into busy schedules, allowing volunteers to make a meaningful impact remotely at their convenience.\n\n**Vision for the Future**\n\nUPchieve envisions a world where every student, regardless of their socioeconomic background, can finish high school, attend college, and achieve upward mobility. They are committed to keeping their services free for students, fueled by donations and partnerships with schools, districts, and corporate entities.\n\nThrough its community-driven model, UPchieve is making strides to change the educational landscape, proving that support should be accessible to all. As they continue to grow, UPchieve maintains a dedicated team of 15 employees and is part of the Y Combinator W21 batch, showcasing a strong commitment to innovation and effective solutions in education.\n\nFor more information or to get involved, visit their website at [UPchieve.org](https://www.upchieve.org).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/60cf4b4e6f21305e49fc6bcffab9995c6c4d3dc4.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192037Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=daefc6a0a7c5ccea4da5faeb2f9a43031c5b9960a6dce29e585ee3678e81a9ff",
    "social_links": [
        "https://www.linkedin.com/company/upchieve/",
        "https://twitter.com/upchieve",
        "https://www.facebook.com/UPchieve/",
        "https://github.com/UPchieve"
    ],
    "logo_path": "data/logos\\UPchieve_logo.png"
}