{
    "links": "https://www.ycombinator.com/companies/upfort",
    "name": "Upfort",
    "headline": "Turnkey security & hassle-free cyber insurance from leading insurers",
    "batch": "S17",
    "description": "Upfort is a leading platform for cyber security and insurance that provides holistic protection from evolving cyber threats. Founded in 2017 to expand global access to cyber resilience, Upfort makes cyber risk easy to manage and simple to insure. Upfort delivers turnkey security proven to proactively mitigate risk and comprehensive cyber insurance from leading insurers. With proprietary data and intelligent automation, Upfort’s AI anticipates risk and streamlines mitigation for hassle-free underwriting. Insurers, brokers, and risk advisors partner with Upfort to offer clients resilience and peace of mind against cyber threats.",
    "activity_status": "Active",
    "website": "https://www.upfort.com",
    "founded_date": 2017.0,
    "team_size": 38.0,
    "location": "San Francisco",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:next-gen-network-security; industry:security; industry:insurance; industry:cyber-insurance; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Han Wang",
            "description": "US Army Officer turned startup founder, with an expertise in cybersecurity and computational mathematics.",
            "linkedin": "http://www.linkedin.com/in/hanwangcyber"
        },
        {
            "name": "Daniel Bilbao",
            "description": null,
            "linkedin": "https://www.linkedin.com/in/danielbilbao/"
        }
    ],
    "status": true,
    "generated_description": "**Company Overview: Upfort**\n\nFounded in 2017 and based in San Francisco, Upfort is reshaping the landscape of cybersecurity and cyber insurance. Emerging from the Y Combinator Batch S17, Upfort aims to simplify the complexities of cyber risk management and insurance, providing businesses with a comprehensive and proactive approach to their cybersecurity needs. \n\n**Mission and Vision**\n\nUpfort's mission is straightforward: to offer turnkey security solutions and hassle-free cyber insurance from top-tier insurers. The platform has been crafted to respond to the growing challenges posed by ever-evolving cyber threats, making it easier for organizations to manage risk and secure coverage.\n\n**Core Offerings**\n\n1. **Turnkey Cybersecurity Solutions:** Upfort delivers autonomous cybersecurity services through its Upfort Shield platform, which integrates features such as email protection, web protection, risk monitoring, and security training. This proactive approach aims to significantly reduce the likelihood of cyber incidents such as ransomware attacks and data breaches.\n\n2. **Cyber Insurance:** Upfort partners with leading insurance providers, leveraging intelligent automation to streamline the underwriting process and enhance the coverage options available to clients, including specialized packages tailored to specific business needs.\n\n3. **AI-Driven Insights:** Upfort employs proprietary data and intelligent automation to anticipate risks and facilitate quick action, making insurance underwriting painless and efficient. \n\n**Team and Culture**\n\nWith a dedicated team of 38 employees, Upfort values human connection and personalized service. Clients often report that Upfort's support isn’t just a faceless interaction; it involves real people who understand their unique circumstances and goals.\n\n**Market Positioning**\n\nUpfort targets a diverse audience that encompasses insurers, brokers, and risk advisors, helping them offer robust resilience strategies against cyber threats. The company is tagged under multiple categories such as next-gen network security, cyber insurance, and security solutions, positioning it at the forefront of the cybersecurity landscape.\n\n**Customer Testimonials**\n\nUpfort's user base includes a variety of organizations, from small startups to established enterprises. Users like Eleanor Griffith from Grey Genetics highlight how Upfort has been instrumental in enhancing their security posture, while Melissa Dias from the Student Leadership Network commends the platform for fostering a culture of cyber awareness among staff.\n\n**Take Control of Your Cyber Risk**\n\nFor businesses looking to assess their cyber risk, Upfort offers a free cyber risk assessment, advocating for proactive measures before incidents occur. This straightforward, sought-after service embodies their belief that preparation is the best defense in the cyber realm.\n\nIn a world where cyber threats loom large, Upfort stands out as a trusted partner. By combining cutting-edge technology with personalized support, they help organizations not just survive but thrive in today’s digital landscape. Interested parties can explore more at [Upfort's website](https://www.upfort.com) and start taking control of their cybersecurity today.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/6a92183d02f1da9c63bb193ffae93325ac83a676.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192037Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=b9a096b28070028239846f7b8da879ec80b6dbcd5587225d62d11a753973d9c5",
    "social_links": [
        "https://www.linkedin.com/company/upfort/",
        "https://www.crunchbase.com/organization/paladin-cyber"
    ],
    "logo_path": "data/logos\\Upfort_logo.png"
}