{
    "links": "https://www.ycombinator.com/companies/upkeep",
    "name": "UpKeep",
    "headline": "Mobile-first software for maintenance teams.",
    "batch": "W17",
    "description": "Mobile-First CMMS/Enterprise Asset Management System\r\n\nUpKeep is asset and maintenance management — done the right way. We take a mobile-first approach to the traditional desktop-based enterprise software. We keep technicians out in the field working on the most pressing issues — saving precious time and money. Tracking the costs of assets over their lifetime is now easier than ever. We keep businesses more efficient and streamline their workflow by eliminating paper work orders.\r\n\nWe currently have over 2,000,000 registered users from small businesses to large enterprises. We offer low-cost solutions with transparent pricing to a common problem that many companies face. Our vision is to provide the best mobile solution for asset and work order management in a space that is dominated by traditional enterprise software companies. We've raised a total of $50 million from Y Combinator, Battery Ventures, Bain Capital, Emergence Capital, and Insight Partners. \r\n\n-Assign work orders\r\n-Create and save tasks\r\n-UPC Label scanning\r\n-Create assets and assign work orders to assets\r\n-Preview for analytical graphs\r\n\nWe are a Y Combinator-backed company (YC W17)",
    "activity_status": "Active",
    "website": "https://www.upkeep.com/",
    "founded_date": 2016.0,
    "team_size": 150.0,
    "location": "Los Angeles, CA",
    "group_partner": "Dalton Caldwell",
    "group_partner_yc": "https://www.ycombinator.com/people/dalton-caldwell",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:saas; industry:iot; industry:b2b; location:los-angeles",
    "founders": [
        {
            "name": "Ryan Chan, Founder/CEO",
            "description": "I helped build UpKeep!",
            "linkedin": "https://linkedin.com/in/ryan-chan-72aa6256"
        }
    ],
    "status": true,
    "generated_description": "UpKeep is a dynamic and forward-thinking company that was founded in 2016 and is based in Los Angeles, CA. The mission here is straightforward: to revolutionize maintenance management with a mobile-first approach. They recognized that traditional enterprise software often leaves technicians tethered to their desks, leading to inefficiencies and higher costs. By moving maintenance management to mobile devices, UpKeep empowers teams to tackle pressing issues right on the ground, all while tracking asset costs over time seamlessly. \n\nCurrently, UpKeep boasts over 2 million registered users across various sectors, from small startups to large enterprises. The company stands out for its transparent pricing and low-cost solutions aimed at solving common maintenance challenges faced by businesses. With total funding of around $50 million from impressive investors, including Y Combinator and Bain Capital, UpKeep is determined to lead the charge against outdated, desktop-centric software practices.\n\nTheir offering includes comprehensive tools that allow teams to assign work orders, create and save tasks, scan UPC labels, and preview analytical graphs—all from the palm of their hands. This suite of features supports maintenance management, enterprise asset management, and even connectivity with IoT sensors for real-time asset monitoring.\n\nUpKeep's clients are diverse, including big names like McDonald's and Aesop, highlighting their wide applicability in different industries. They are tagged in the SaaS, IoT, and B2B spaces, further showcasing their modern tech-driven approach. \n\nThe team at UpKeep consists of around 150 employees, and they provide 24/7 support to ensure that users have the help they need whenever they need it. This dedication to customer service reflects their overarching pledge to maximize efficiency and success for every client that chooses to adopt their platform.\n\nIf you’re looking for a solution that simplifies asset and work order management while enabling your teams to function effectively on the go, UpKeep might just be the answer. Dive into their offerings at [UpKeep.com](https://www.upkeep.com) and explore how they can help streamline your operations.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/07136965b73dd8b60be2eba66faedc6db1d63726.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192038Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=af1a4b919f7d9ad41f2b9d88534dd5edd08ebc5c8ce5b967ed6ad0578c16ca8f",
    "social_links": [
        "https://www.linkedin.com/company/upkeep-maintenance-management/",
        "https://twitter.com/onupkeep",
        "https://www.facebook.com/onupkeep/",
        "https://www.crunchbase.com/organization/upkeep-maintenance-management",
        "https://github.com/upkeepapp"
    ],
    "logo_path": "data/logos\\UpKeep_logo.png"
}