{
    "links": "https://www.ycombinator.com/companies/usergems",
    "name": "UserGems",
    "headline": "AI-powered sales solution based on your best customers",
    "batch": "S14",
    "description": "UserGems is an AI-driven prospecting solution for revenue teams to drive bigger pipelines, faster sales cycles, and larger deals.\r\n\nWhenever your customers change their jobs, UserGems automatically surfaces them as new leads to your sales reps directly in Salesforce. This enables reps to close more deals, faster.\r\n\nLeveraging machine learning, UserGems automatically identifies other prospects that match your best customers. That means you get a complete, up-to-date list of leads that match your ICP, persona and other key criteria so that reps spend less time sourcing leads, and more time selling.",
    "activity_status": "Active",
    "website": "https://www.usergems.com",
    "founded_date": 2015.0,
    "team_size": 60.0,
    "location": "Austria",
    "group_partner": "Michael Seibel",
    "group_partner_yc": "https://www.ycombinator.com/people/michael-seibel",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:b2b; industry:sales",
    "founders": [],
    "status": true,
    "generated_description": "UserGems is a pioneering sales technology company founded in 2015, initially hailing from the esteemed Y Combinator Batch S14. Their mission is straightforward yet powerful: to empower sales teams with an AI-driven prospecting solution that is grounded in the behaviors and traits of their best customers. The company is based in Austria and boasts a skilled team of 60 employees.\n\nAt UserGems, the game-changing feature is the way they leverage AI to enhance lead generation in an incredibly efficient manner. Whenever a customer transitions to a new job, UserGems automatically flags this change as a new lead within Salesforce, allowing sales reps to optimize their outreach and close deals more quickly. This kind of responsiveness is crucial in today’s fast-paced sales environment.\n\nUserGems employs machine learning to identify and surface prospects that closely resemble their most successful customers. This enables companies to build a comprehensive list of leads that fit their Ideal Customer Profile (ICP) without the usual grunt work of lead sourcing. The system frees up sales reps to focus on what really matters: selling.\n\nTheir flagship product, Gem-E, acts as an AI outbound agent, helping sales teams personalize communication by drafting emails, call scripts, and even LinkedIn messages based on real-time signals and historical CRM data. This results in outreach that feels personal and relevant, significantly increasing the probability of conversions.\n\nThe company has rightly positioned itself within the B2B sales arena, offering benefits that include a measurable ROI—many of their clients have reported substantial increases in their pipelines and deal sizes since integrating UserGems into their workflows.\n\nMichael Siebel, a prominent figure in the startup ecosystem, serves as their Group Partner, adding to the credibility of their innovative approach. UserGems is tagged under sales technology and has attracted recognition for its exceptional data quality and ease of integration with existing sales tools like Salesforce, HubSpot, and Outreach.\n\nIf you're part of a revenue team looking to double your pipeline without doubling your effort, UserGems offers a compelling solution that not only streamlines the lead generation process but also ensures your outreach is timely and effective. Check them out at [UserGems](https://www.usergems.com) for more insights into how they can revolutionize your sales strategy.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/2681737b68679df3cc19d5ec44c536064d9bd428.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192038Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=ac2bb3e56f9475366ce76bf2a419a5f3115189af679c0a34b269da96458554f8",
    "social_links": [
        "https://www.linkedin.com/company/usergems",
        "https://www.crunchbase.com/organization/usergems"
    ],
    "logo_path": "data/logos\\UserGems_logo.png"
}