{
    "links": "https://www.ycombinator.com/companies/vance",
    "name": "Vance",
    "headline": "Single account to manage money across the world",
    "batch": "W22",
    "description": "Vance is a Global Neobank that lets you make international payments at live google rates, avail credit in new countries, and invest around the world. We are building a bank that is not bound by borders.",
    "activity_status": "Active",
    "website": "https://vance.tech",
    "founded_date": 2022.0,
    "team_size": 14.0,
    "location": "Bengaluru, India",
    "group_partner": "Tom Blomfield",
    "group_partner_yc": "https://www.ycombinator.com/people/tom-blomfield",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech",
    "founders": [
        {
            "name": "Parth Garg, Founder",
            "description": "Stanford Dropout | 2nd time founder | Passionate about building",
            "linkedin": "https://www.linkedin.com/in/parth29/"
        }
    ],
    "status": true,
    "generated_description": "# Vance: A New Frontier in Global Banking\n\nImagine a world where managing your money knows no borders. That’s precisely what Vance is aiming to create—a single account designed to manage your finances effortlessly across the globe. Founded in 2022 and incubated in Y Combinator's W22 batch, Vance operates out of Bengaluru, India, with a lean team of 14 passionate individuals.\n\n### The Vision\n\nVance is not just another financial service; it's a global neobank striving to redefine how we think about banking in a hyper-connected world. Their mission is to enable international payments at real-time Google rates, offer credit in new territories, and allow investments worldwide—all without the usual constraints of traditional banking systems. The goal? To make banking seamless for Non-Resident Indians (NRIs) and expats everywhere.\n\n### Key Offerings\n\nAt the core of Vance's product suite is its money transfer service, which allows users to send money to India with zero hidden fees and real-time exchange rates. Aside from money transfers, Vance enables users to open NRE, NRO, and FCNR accounts digitally, offering savings interest rates of up to 8.25%. It's all about providing robust financial tools for NRIs looking to invest and save smartly.\n\nThe company acknowledges the unique needs of NRIs with several added resources—like financial insights, currency converters, blogs, and calculators—crafted to make navigating international finance less daunting.\n\n### Security and Trust\n\nSecurity is a top priority for Vance, which promises a 256-bit encryption layer on all transactions, ensuring end-to-end security. By partnering with regulated financial institutions, Vance assures users that their money is handled securely, maintaining transparency and trust.\n\n### Recognition and Reception\n\nDespite being relatively new, Vance has garnered significant attention and praise, recently highlighted by media outlets like CNBC and Economic Times. User feedback reflects satisfaction, with many praising its competitive exchange rates and superb customer service.\n\n### The Path Forward\n\nWith a clear focus on innovation and user experience, Vance is determined to reshape the financial landscape for NRIs. Their vision of uniform banking is ambitious but grounded in actionable strategies that prioritize customer needs. \n\nFor more information or to start managing your international finances without the hassles, check out their website: [Vance.tech](https://vance.tech), or download their app to get started today!\n\nIn this evolving landscape of fintech, Vance represents a significant step toward a world of banking without borders, a concept that feels like the future—because it is.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/163e0839787d8f4d1a5921cf1f3a6576fc871da7.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192040Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=3aabcddb596d84183768615f1b56ae697dd778a4c8f399013f754d74c04b545c",
    "social_links": [
        "https://www.linkedin.com/company/joinvance/",
        "https://twitter.com/vance_app",
        "https://www.facebook.com/vanceapp",
        "https://www.crunchbase.com/organization/vance-0d39"
    ],
    "logo_path": "data/logos\\Vance_logo.png"
}