{
    "links": "https://www.ycombinator.com/companies/varos",
    "name": "Varos",
    "headline": "AI-based market research, competitive intelligence and benchmarks.",
    "batch": "S21",
    "description": "Varos is an AI Market Research firm, providing competitive intelligence, benchmarks and market research.\r\n\nWe sell to both Marketing Executives and Tech Executives.\r\n\nFor Tech Executives: \r\nCutting through the AI chaos, we deliver clear, actionable insights & market research that drive real ROI for enterprise tech leaders.\r\n\nOur proprietary approach—blending expert interviews, robust data analysis, and deep vendor insights—cuts through the noise and delivers the customized guidance you need to make faster, smarter AI decisions.\r\n\nBacked by top-tier venture capital and steered by a team of former enterprise CIOs, Varos Research transforms market intelligence into tangible success.\r\n\nFor Marketing Executives: \r\nWe have built the largest first-party data co-op in digital marketing, offering highly granular and real-time benchmarks & market trends in a give-to-get model. \r\n\nGet an instant McKinsey-level audit of your account, benchmarked against 7,000+ companies, including many similar to yours for your Meta/Google Ads.",
    "activity_status": "Active",
    "website": "http://varos.com",
    "founded_date": 2021.0,
    "team_size": 9.0,
    "location": "San Francisco",
    "group_partner": "Brad Flora",
    "group_partner_yc": "https://www.ycombinator.com/people/brad-flora",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:saas; industry:b2b; industry:analytics; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Yarden Shaked, Founder",
            "description": "Co-founder at Varos.\nPreviously Private Equity at Apax and Investment Banking at Rothschild. Occasionally angel invest.",
            "linkedin": "https://www.linkedin.com/in/yarden-shaked-b2011082/"
        },
        {
            "name": "Lior Chen, Founder",
            "description": "CTO and Co-Founder at Varos,\n15+ years building enterprise grade data and cyber security products, both for Fortune 1000 companies and his own startups. Alumni of the prestigious 8200 Unit",
            "linkedin": "https://www.linkedin.com/in/lior-chen-2a939127/"
        },
        {
            "name": "Gil Shaked, Founder",
            "description": "Co-founder at Varos\nFormer CTO of Dun & Bradstreet. Previously Managing Director at Morgan Stanley and Citadel.",
            "linkedin": "https://www.linkedin.com/in/gshaked/"
        }
    ],
    "status": true,
    "generated_description": "### Varos: Your Guide to AI-Driven Market Intelligence\n\nFounded in 2021 as part of Y Combinator’s Batch S21, Varos is an innovative company based in San Francisco that specializes in AI-based market research, competitive intelligence, and benchmarks. With a lean team of just nine employees, Varos is making waves in the SaaS, B2B analytics space—and it's clear why.\n\n### Mission and Offerings\n\nAt its core, Varos strives to cut through the noise of the overcrowded AI landscape by providing actionable insights tailor-made for both marketing and tech executives. Their unique combination of expert interviews, thorough data analysis, and in-depth vendor insights empowers organizations to make informed decisions that drive real ROI.\n\n#### For Tech Executives\nVaros acts as a beacon amidst the chaos of AI. They deliver clear, actionable insights aimed at enterprise tech leaders who need guidance in navigating their decision-making processes. Their approach not only distills complex information but also transforms data into tangible strategic moves.\n\n#### For Marketing Executives\nOn the marketing front, Varos has managed to build the largest first-party data co-op in digital marketing. This enables them to offer real-time, granular benchmarks and market trends—effectively providing a McKinsey-level audit of advertising accounts against a database of over 7,000 companies. With metrics such as CPM, CAC, and CTR at your fingertips, marketing leaders can leap ahead of the competition.\n\n### Backing and Leadership\nVaros is backed by top-tier venture capital and led by a team of former enterprise CIOs, ensuring that the insights provided are not only market-tested but also strategically sound. Brad Flora serves as the Group Partner, lending his expertise to guide the company’s evolution.\n\n### Where to Engage\nYou can explore all that Varos has to offer on their website: [varos.com](http://varos.com). From product demonstrations to case studies and a variety of resources—it's a treasure trove for anyone looking to elevate their market strategies.\n\n### Summary\nIn a nutshell, Varos is on a mission to demystify AI market research for tech and marketing executives alike. It combines expert insights with data-driven analytics in an accessible way that empowers clients to make smarter decisions faster. Given its robust foundation and innovative approach, Varos is poised to redefine how companies leverage market intelligence for success.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/0c495a181e23051cbf8d7b6d7a007e83ccfca9e6.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192041Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=b3f7226674ee8407243679b42fa9e1d8e766837ad2efbdde8c44522242154c54",
    "social_links": [
        "https://www.linkedin.com/company/varos-io",
        "https://twitter.com/Varos_io"
    ],
    "logo_path": "data/logos\\Varos_logo.png"
}