{
    "links": "https://www.ycombinator.com/companies/vaultpay",
    "name": "VaultPay",
    "headline": "Digital banking platform for the 30 million smartphone users in DRC.",
    "batch": "S23",
    "description": "Vaultpay is building a digital banking platform for 30 million smartphone users in DRC and the country's largest agent network. For example, a young Congolese entrepreneur who just won a subcontract with a major mining company can now easily open a personal and business account, receive payments, all from their smartphone, instead of spending hours at bank branches.",
    "activity_status": "Active",
    "website": "https://vaultpay.io",
    "founded_date": 2023.0,
    "team_size": 2.0,
    "location": "Kinshasa, Congo (Dem. Rep.)",
    "group_partner": "Michael Seibel",
    "group_partner_yc": "https://www.ycombinator.com/people/michael-seibel",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:payments; industry:b2b; industry:neobank",
    "founders": [],
    "status": true,
    "generated_description": "VaultPay is a fintech company founded in 2023, specifically aimed at the 30 million smartphone users in the Democratic Republic of the Congo (DRC). The mission is clear: to simplify banking for young entrepreneurs and everyday users alike, leveraging mobile technology to transform how people manage their finances.\n\nImagine you’re a young Congolese entrepreneur who just landed a contract with a major mining company. In the past, the only way to set up your business banking was by spending hours waiting in line at a physical bank. With VaultPay, you can open both personal and business accounts directly from your smartphone, receive payments, and carry out transactions—all without the hassle. This is not just innovation; it's a revolution in how banking is approached in the DRC.\n\nLocated in Kinshasa with a team of just two employees, VaultPay is part of Y Combinator’s Summer 2023 batch. They boast an impressive backing from notable investors, including Group Partner Michael Seibel. Their services are streamlined and hassle-free, promoting a user-friendly interface that allows anyone to open an account within a minute. They even offer a virtual VISA card that users can start using immediately after signing up, and a physical card can be delivered in just 24 hours—something that’s a bit of a big deal in the region!\n\nVaultPay is categorized under terms like fintech, payments, B2B, and neobanking, which reflects its innovative approach to financial services. The app offers the convenience of 24/7 access to funds, real-time expense tracking, and even cashback incentives on card payments—the sort of features that are commonplace in more developed markets but quite rare in the DRC.\n\nSecurity-wise, they are committed to safeguarding user data with top-notch protection practices, including PCI-DSS compliance. Their application has been developed by a team with experience from top tech companies, ensuring a robust and reliable user experience.\n\nIn short, VaultPay is not just another banking app; it’s a tool designed to make financial management straightforward and accessible for everyone in DRC. By eliminating queues and complicated banking procedures, it frees up more time for people to focus on what truly matters in their lives. If you’re looking to simplify your financial life in the DRC, VaultPay appears to be an exhilarating option to watch.\n\n[Visit VaultPay](https://vaultpay.io) to learn more!",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/4a0667ab344e4da9c7571154612efc768d055773.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192041Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=422599e321824e767526ee9ca641c2e3c70acc63cb5b8ef0edc1cf4873894950",
    "social_links": [
        "https://www.linkedin.com/company/getvaultpay"
    ],
    "logo_path": "data/logos\\VaultPay_logo.png"
}