{
    "links": "https://www.ycombinator.com/companies/veera-health",
    "name": "Veera Health",
    "headline": "We treat women with Polycystic Ovary Syndrome in India",
    "batch": "W21",
    "description": "Veera Health is helping 110M women in India get treated for Polycystic Ovary Syndrome (PCOS).  Our app combines evidence-backed therapy with coaching & specialist support for a subscription fee.\r\n\nPCOS is the most common cause of infertility in women, and can lead to diabetes, depression and cancer. Patients spend up to 10 years and thousands of rupees searching for the right treatment, yet 90% are dissatisfied with existing options. With our program, 85% patients report feeling \"in control\" of their PCOS after just 1 month and are 4-times more likely to complete treatment.\r\n\nThe founders, Shobhita (COO) and Shashwata (CEO) got an inside view into this massive need when the former was diagnosed with PCOS. Shashwata studied data science at Yale University, holds an MBA from Wharton, and helped grow Fortune 100 and growth-stage consumer health / product companies at McKinsey. Shobhita studied Biology & Psychology at Tufts University and has worked with leading healthcare companies, such as GlaxoSmithKline, Accenture Life Sciences & UnitedHealth.",
    "activity_status": "Active",
    "website": "https://www.veerahealth.com",
    "founded_date": 2020.0,
    "team_size": 4.0,
    "location": "India",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:consumer-health-services; industry:femtech",
    "founders": [
        {
            "name": "Shashwata Narain, Founder",
            "description": null,
            "linkedin": "https://www.linkedin.com/in/shashwatanarain/"
        },
        {
            "name": "Shobhita Narain, Founder",
            "description": "Deep healthcare expertise with experience in the pharma, hospital, and health payer space. I've worked previously at UnitedHealth Group, Accenture Life Sciences & GlaxoSmithKline.",
            "linkedin": "https://www.linkedin.com/in/shobhita-narain-a668b971/"
        }
    ],
    "status": true,
    "generated_description": "**Veera Health Overview**\n\nVeera Health is a pioneering health tech company founded in 2020, positioned as a front-runner in addressing Polycystic Ovary Syndrome (PCOS) among women in India. The company aims to transform how the roughly 110 million women affected by PCOS are treated, providing a comprehensive solution that combines evidence-based therapy with personalized coaching via their app. They operate on a subscription model, which gives patients access to a support system that has demonstrated impressive results—85% of patients report feeling \"in control\" of their PCOS following just one month of treatment.\n\n**The Problem They Solve**\n\nPCOS isn’t just a reproductive issue; it’s the leading cause of infertility in women and can lead to grave health complications like diabetes, depression, and even cancer. Unfortunately, patients often endure a frustrating journey of up to ten years and substantial financial burden seeking effective treatments, with 90% dissatisfied with available solutions. Veera Health is changing that narrative by streamlining the treatment process.\n\n**Founders and Team**\n\nThe company is founded by Shobhita, who serves as COO, and Shashwata, the CEO. Both have valuable insights into the challenges faced by women with PCOS, particularly with Shobhita’s personal journey with the condition. Shashwata graduated from Yale with a focus in data science and holds an MBA from Wharton, alongside experience at McKinsey where he helped scale businesses in consumer health. Shobhita's background in Biology and Psychology from Tufts, coupled with her experience at leading healthcare firms, nicely complements Shashwata's expertise.\n\nDespite being a small team of four, their collective experience positions Veera Health for substantial impact in the femtech sector.\n\n**What They Offer**\n\nVeera Health provides a range of supplements and personalized health programs designed specifically for women. Their offerings, which include products aimed at addressing sleep, weight management, skin health, and PCOS support, are designed with clean, natural ingredients to effectively work with women's hormones without harmful additives.\n\n**Market Position and Recognition**\n\nVeera Health is part of Y Combinator's Batch W21, demonstrating its potential in the startup ecosystem. Their products and services are designed with a clear focus on women's unique health needs, challenging traditional health paradigms that often overlook specific requirements.\n\n**In Summary**\n\nVeera Health is pioneering a much-needed service in women’s health by addressing the complexities of PCOS with a modern digital approach. With a focus on effective treatments, personalized support, and clean formulations, they are poised to become a go-to resource for millions of women in India seeking comprehensive health solutions. You can explore more through their [website](https://www.veerahealth.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/065b27c930f051784d7b31a3ea89328a936465a2.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAFJSOQ65W%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192043Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELT%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDHe2krNA4Wz4ZdbboNJG%2B0zG6MmRspOJ5Kex%2FWuhFzDwIhAK4JNrLJx7V6Lp69aumcmLj570j2DR2Eh3hPcEuQGW3%2FKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgweLBjNRNugVRDPT8gqwgPiLGnMwjgQOiNH7FMTInTVKCCJLDe5fdDWlactIzRh2XOtRjauQZptst9ejdBs3vj590lIr07sFFKCWuGV%2B%2BJkmRqS%2BXBC6caH3J97%2FH7W3ch4kKAyKE3TuVCMVl%2BqNFww29jX%2BimNvDUNvCgQtjVE03FWSnfbJrDf3NUx8wttW6l2EC5fgOealDp0Ne7xA51qGtDKfIYSJUUyj6d2WgcNp66ilXSYF5HX3L4wid4xRepJ9Vt1krkNG6bsNoITqg8zMlLgZ7QT5uVwuoY%2Fhv%2F89O661Pa6%2FtGfz6gcZjx3JmkvJh2yaephzjfzpFg43OFS%2B3NnORgMbCqTEcn9piGJokbf9a5xoR2Qt8E4L2AdZTypzC0scYqz%2BA1CsQiK1RrvedAjSsaEw4%2FqFaR6rBrZ4SBiKqlmStv67nu5CMG6DF414F2WlGbkeS8C%2BJYZ2iky%2B19B0K9e4J7Tik78PRFNXoN8lSqP4k%2BLhdrqVq5b2d4m7UHeeProhr%2Fv5HV%2BORFSiFow%2Fhbxt6GN2P2YWxzdIHA32IkBqYD%2BeZ3eFOZSk%2B1Pldgq4PSaiU5lQlEewufIwxcnWXTzGkzSJ%2BLlLlzWX4EwrKPjvQY6pAEqZgWN8cooHP%2FeegIX6R3Pun8lUwrTM2csrvVF8K2udU7KUu1EoXzzxsupULfK9AN%2Bcef1HwWg3GN0hRmtduP9znDwqy7B09eErZHX3iCWPeVm7m2HUwQH0BM7NBnkw%2BBNh35scX3c4lMIghjRFyw9b8VEOGAbUjAxbgvLqemFdd8Zq7DGRWXDbhLqcGd2hHliZLchEjlQhzfD3wdeSwzTgvkJMw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=a88e8ffb6238a5dfbb7a695ce2808aab3caa9accf603158790a089780668357e",
    "social_links": [
        "https://www.linkedin.com/company/veera-health"
    ],
    "logo_path": "data/logos\\Veera_Health_logo.png"
}