{
    "links": "https://www.ycombinator.com/companies/veles",
    "name": "Veles",
    "headline": "The Sales Calculator",
    "batch": "W24",
    "description": "Veles – The Sales Calculator. Veles empowers sales reps to deliver pricing effectively and craft dynamic options that maximize deal size. By integrating seamlessly with CPQs And CRMs, Veles makes every sales rep a top performer. \r\n\nKey Features:\r\n\n✅ SaaS Pricing Calculator: Easily standardize pricing and track sales rep behavior in one intuitive platform.\r\n\n✅ Standard Deal Definition: Define sales strategies and terms to expedite onboarding and maintain negotiation consistency.\r\n\n✅ Performance Analytics: Gain insights into sales rep behaviors that lead to closed-won deals through comprehensive deal scoring.\r\n\n✅ Alignment & Optimization: Foster team alignment by sharing negotiations and strategies for successful negotiation calls.",
    "activity_status": "Active",
    "website": "http://www.getveles.com",
    "founded_date": 2023.0,
    "team_size": 3.0,
    "location": "Santa Barbara, CA",
    "group_partner": "Brad Flora",
    "group_partner_yc": "https://www.ycombinator.com/people/brad-flora",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:artificial-intelligence; industry:b2b; industry:sales; industry:enterprise",
    "founders": [
        {
            "name": "Simon Ooley, Founder",
            "description": "Simon is co-founder & CEO of Veles. Prior to founding Veles, Simon held multiple sales and sales leadership positions. Most recently at Procore Technologies (PCOR), Buildr CRM, and SINAI Technologies.",
            "linkedin": "https://linkedin.com/in/simonooley"
        },
        {
            "name": "Patrick Koperwas, Founder",
            "description": "Co-founder and CTO at Veles. Early employee at Procore & Tegus. Degree in Machine Learning and Applied Statistics UCSB.",
            "linkedin": "https://linkedin.com/in/patkoperwas"
        }
    ],
    "status": true,
    "generated_description": "**Veles: Elevating Sales Performance with The Sales Calculator**\n\nFounded in 2023 and backed by Y Combinator’s W24 cohort, Veles, headquartered in Santa Barbara, CA, is on a mission to revolutionize how sales reps approach pricing and deal-making. Their flagship product, aptly named \"The Sales Calculator,\" is designed to empower sales teams, making each representative a top performer in their field.\n\n### What Does Veles Do?\n\nVeles seamlessly integrates with existing CPQs (Configure Price Quote systems) and CRMs (Customer Relationship Management systems), effectively minimizing the time spent wrestling with spreadsheets and complicated deal discussions. The objective? To enable sales reps to deliver accurate pricing, create flexible proposals, and close deals faster.\n\n### Key Features\n\nVeles packs a punch with an intuitive suite of tools:\n\n- **SaaS Pricing Calculator:** A user-friendly platform that not only standardizes pricing but also tracks sales behaviors.\n  \n- **Standard Deal Definition:** Streamlines onboarding by clarifying sales strategies and ensuring consistent negotiation terms.\n\n- **Performance Analytics:** Offers insights into successful sales tactics, helping teams understand which behaviors lead to closed deals.\n\n- **Team Alignment & Optimization:** Builds cohesiveness among teams by sharing negotiation strategies and outcomes.\n\n### Why Veles Stands Out\n\nVeles isn’t just another tool—it's a game changer for enterprise software sales. By automating deal desk workflows and providing real-time pricing recommendations derived from deal benchmarks and call transcripts, Veles not only enhances productivity but also equips salesforces with data-driven insights to capitalize on every opportunity. \n\nWith a lean team of three, including their Group Partner Brad Flora, Veles is quickly establishing itself in the competitive SaaS market, evidenced by healthy endorsements from industry professionals who have experienced tangible benefits from its usage.\n\n### Conclusion\n\nIf you're looking to optimize sales pricing and recover lost revenue through smarter quoting and thorough analytics, Veles might just be the partner your sales team needs. Visit [getveles.com](http://www.getveles.com) to explore how they can transform your sales process today. \n\nIn a nutshell, Veles offers a compelling blend of technology and strategy, making it an essential tool for any ambitious sales organization.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/39d5754abb2b0cd9f837a6d864bee12b757972ea.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192042Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=78dfa8aadbbdf88a81fd9a5b08a8d1e8f87855cacfba9961a82cf83b47847da8",
    "social_links": [
        "https://www.linkedin.com/company/velesinc",
        "https://twitter.com/VelesInc"
    ],
    "logo_path": "data/logos\\Veles_logo.png"
}