{
    "links": "https://www.ycombinator.com/companies/velos",
    "name": "Velos",
    "headline": "Platform to automate manual back-office work",
    "batch": "W23",
    "description": "Velos helps non-technical operations teams automate complex, manual back-office tasks with AI workers instead of overseas teams.\r\n\nUnlike traditional robotic process automation (RPA) platforms like UiPath, Velos automations use machine learning to reliably handle ambiguities in their tasks, eliminating the need for an army of maintenance engineers and consultants to build and maintain your automations.\r\n\nWe're automating the repetitive work people hate to do.",
    "activity_status": "Active",
    "website": "https://www.tryvelos.com",
    "founded_date": 2021.0,
    "team_size": 3.0,
    "location": "Austin, TX",
    "group_partner": "Nicolas Dessaigne",
    "group_partner_yc": "https://www.ycombinator.com/people/nicolas-dessaigne",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:artificial-intelligence; industry:generative-ai; industry:reinforcement-learning; industry:robotic-process-automation; industry:automation; location:austin",
    "founders": [
        {
            "name": "Oscar A. Martinez, Founder",
            "description": "Economist turned data scientist. Building tools to make natural language processing accessible to anyone.\n\nGive me a shout if you want to talk about using reinforcement learning or NLP in your product.",
            "linkedin": "https://www.linkedin.com/in/o-am/"
        }
    ],
    "status": true,
    "generated_description": "**Company Overview: Velos**\n\n**Founded**: 2021  \n**Location**: Austin, TX  \n**Team Size**: 3 employees  \n**Y Combinator Batch**: W23  \n\n**Mission**: Velos is on a mission to automate the repetitive, manual tasks that bog down operations teams, allowing them to focus on what truly matters.\n\n---\n\n### What They Do\n\nAt its core, Velos is designed for non-technical operations teams looking to cut through the clutter of manual back-office processes. Unlike traditional Robotic Process Automation (RPA) solutions like UiPath, Velos employs sophisticated machine learning to address the complexities and ambiguities that often come with automation. This means you don’t need multiple engineers on staff—or even a tech team—to implement and maintain effective workflows.\n\nVelos is the antidote to the tedious work that no one wants to do. By leveraging AI workers, they enable teams to streamline their processes dramatically—without the added overhead of hiring extra hands or sacrificing efficiency.\n\n### How It Works\n\n1. **Connect Your Data**: Velos integrates seamlessly with various data sources, whether it's via API or simple manual uploads.\n   \n2. **Create Custom Rules**: Users can set specific rules for automating workflows in an intuitive platform that accommodates a range of tasks.\n   \n3. **Validate and Improve**: With a feedback loop in place, any corrections made are automatically fed back into the system, continually enhancing the automation’s performance.\n   \n4. **Push Data Out**: Velos ensures you can integrate with the existing apps you depend on, bridging the gap between old and new technologies.\n\n### Why Velos Stands Out\n\nThe challenge of automating manual tasks often requires hiring an army of engineers or offshoring the workload. Velos flips this model on its head, giving non-technical teams the power to automate complex workflows on their own, making it a game-different player in the AI automation landscape.\n\n### Target Markets\n\nVelos is particularly helpful for industries dealing with repetitive tasks such as healthcare clinics, educational institutions, local governments, and insurtech companies. These organizations often have legacy systems and processes, making Velos's capabilities crucial for transitioning to more efficient workflows.\n\n### Key Features:\n\n- **Ease of Use**: Designed for those who may not be tech-savvy, making automation accessible to a wider audience.\n- **Machine Learning**: Tailored for handling real-world complexities and ambiguities with ease.\n- **Integration Ready**: Works with both modern applications and \"dinosaur\" software, ensuring flexibility.\n\n---\n\n**Conclusion**\n\nIn a world that is increasingly driven by technology, Velos is carving a niche for itself by simplifying the automation process for teams that typically fall outside the tech bubble. If you’re weighed down by the busywork that keeps you from innovating and growing, consider exploring how Velos can elevate your organization’s efficiency without the usual headaches associated with complex automation systems.\n\nFor more information, or to see how Velos can transform your workflow, visit [tryvelos.com](https://www.tryvelos.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/854b2c5d238876aff09c11fed5a414e2d0c1c160.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192043Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=36343d0c53c16ad8b9149c58dacb9bd71d4a4dbcda421f4ddb73444fb4136a3c",
    "social_links": [
        "https://www.linkedin.com/company/tryvelos/",
        "https://twitter.com/gradientjai"
    ],
    "logo_path": "data/logos\\Velos_logo.png"
}