{
    "links": "https://www.ycombinator.com/companies/velontra",
    "name": "Velontra",
    "headline": "Hypersonic space plane that can take-off from any location and weather",
    "batch": "S22",
    "description": "Velontra is building a hypersonic space plane that can takeoff from anywhere in any weather.  This horizontal takeoff increases launch reliability and enables customers to directly access any orbit.  Our air-breathing propulsion system is up to 6 times more fuel efficient than any rocket, and uses oxygen from the air which creates thousands of pounds of additional payload capacity. \r\n\nWe have millions in current government/commercial contracts and LOI’s. \r\n\nWe have assembled a team of industry experts, government senior executives, and a NASA astronaut. \r\n\nThe hypersonic space plane will work by taking off from any runway with a jet propulsion system.  Next, it will climb to over 100,000’ and Mach 5.  At this point, it will launch a 2nd stage rocket directly into the desired Low Earth Orbit. \r\n\nVelontra is “boldly going where no one has gone before.”",
    "activity_status": "Active",
    "website": "https://www.velontra.com/",
    "founded_date": 2021.0,
    "team_size": 5.0,
    "location": "Cincinnati, OH",
    "group_partner": "Jared Friedman",
    "group_partner_yc": "https://www.ycombinator.com/people/jared-friedman",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:commercial-space-launch; industry:hardware; industry:drones; industry:aerospace",
    "founders": [
        {
            "name": "Joel Darin, Founder",
            "description": "Most recently first employee at Hermeus where I designed, built and tested a Turbine-Based-Combined-Cycle prototype demonstrator up to Mach 4+. Prior to that I worked at GE Aviation in Afterburner Design. Before GE I was at Georgia Tech where I did research in computational fluid dynamic simulations of reacting flows while obtaining a MS in Combustion. I started at Michigan State University with a BS in Mechanical Engineering.",
            "linkedin": "https://www.linkedin.com/in/joel-darin-b329041a/"
        }
    ],
    "status": true,
    "generated_description": "**Velontra: Pioneering Hypersonic Access to Space**\n\nFounded in 2021 and a proud member of Y Combinator Batch S22, Velontra is on a bold mission: to build a hypersonic space plane that can take off from virtually anywhere and in any weather conditions, revolutionizing how we think about launching payloads into space. Their innovative horizontal takeoff design enhances launch reliability and provides customers direct access to any orbit.\n\n### What Sets Velontra Apart\n\nAt the heart of Velontra's technology is an air-breathing propulsion system that boasts fuel efficiency up to six times greater than traditional rockets, using atmospheric oxygen to boost payload capacity significantly. This makes Velontra not just another rocket company; it’s a game-changer in the aerospace industry.\n\nWith millions in existing government and commercial contracts, Velontra is making strides in a sector ripe for disruption. Their team, consisting of industry veterans, former senior government executives, and even a NASA astronaut, brings a wealth of expertise to the table.\n\n### How Does It Work?\n\nThe hypersonic space plane takes off using a jet propulsion system, climbs to over 100,000 feet, achieving speeds of Mach 5, and then seamlessly launches a second-stage rocket into Low Earth Orbit (LEO). This process allows Velontra to maintain low costs while providing rapid deployment capabilities—transforming space access into an on-demand service.\n\n### Economic Advantage\n\nCompared to existing launch providers, which typically charge around $62 million per launch and require a lead time of up to nine months, Velontra offers a more economical solution. They are aiming for cost reductions of up to 90% and lead times of less than one week, positioning themselves as the fastest and most affordable option in the market.\n\n### The Team Behind Velontra\n\nWith a dedicated team of five employees based in Cincinnati, OH, Velontra is led by experts like Eric Briggs, COO, formerly Head of Engines at Virgin Orbit; and Joel Darin, CEO/CTO, a pioneer in hypersonic technology. Their combined experience provides a solid foundation for the company's ambitious goals.\n\n### Looking Ahead\n\nVelontra’s vision extends beyond just launching satellites—it’s about building a future where access to space is quicker, cheaper, and more flexible than ever before. By embracing innovative technologies and a robust business model, Velontra is truly “boldly going where no one has gone before.”  \n\nTo stay updated or to learn more, check out their website [here](https://www.velontra.com/).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/b00c103824dddf1d4b04ddfd9fd3bbbf41686399.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192042Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=f4a92a3f9a4d3ae84db447d12ecc8f32b1f93ed739d623d19af8c109d469a753",
    "social_links": [
        "https://www.linkedin.com/company/velontra/",
        "https://twitter.com/Velontra"
    ],
    "logo_path": "data/logos\\Velontra_logo.png"
}