{
    "links": "https://www.ycombinator.com/companies/velt",
    "name": "Velt",
    "headline": "Add powerful collaboration features to your product ridiculously fast.",
    "batch": "W22",
    "description": "Our mission is to make the web more collaborative. We're not just making collaboration faster—we're crafting it to be the best.\r\n\nToday we’re all using online platforms more than ever before - building, researching, learning, connecting etc. And we're not doing it alone. We're doing it together with other people and machines, turning the internet into the world's biggest team.\r\n\nYet, the web was built for solo voyages. We saw a shift when platforms like Figma and Google Docs brought a multiplayer approach, breaking down walls and inspiring seamless teamwork.\r\n\nAt Velt, we're taking it further. We're on a mission to infuse the magic of collaboration into the fabric of the web—one app at a time. We aim to erase the lines between online and offline co-working, crafting an environment where distance is irrelevant, and 'flow' is the norm.\r\n\nRight now, more than half of work hours are spent on coordination and communication—less on creating. With Velt, we're setting out to reverse these figures, reducing time spent on logistical issues by over 90%. Imagine what we can create when we spend less time talking about work and more time doing it!\r\n\nWe're building a better web—a web for us, for our team, for everyone. Join us, and let's accelerate the future of web together 🚀\r\n\nOur Products:\r\n\n- Velt Collaboration SDK (https://velt.dev/): JS SDK to add powerful collaboration experiences to your own product for your end-users. This helps you ship such experiences ridiculously fast, increase user growth and engagement.\r\n- Superflow (https://usesuperflow.com/): JS plugin to enable product, marketing and design teams to comment and collaborate directly on their websites. This helps them iterate and ship their products 10x faster.\r\n\nWe’re a team of ex-Googlers. We've launched products like Augmented Reality in Google Search & Maps.\r\n\nCome build a better web with us 🚀",
    "activity_status": "Active",
    "website": "https://velt.dev",
    "founded_date": 2020.0,
    "team_size": 15.0,
    "location": "San Francisco",
    "group_partner": "Jared Friedman",
    "group_partner_yc": "https://www.ycombinator.com/people/jared-friedman",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:developer-tools; industry:saas; industry:collaboration; industry:api; industry:remote-work; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Rakesh Goyal, Founder",
            "description": "I am the co-founder & CEO of Velt. Previously, I was a Product Manager at Google for 9 yrs. I've launched strategic products like AR in Google Maps & Search.\n\nNothing great was ever built alone. Technology has made the world a small place. It enables people to work together no matter where they are. This was never possible before. Velt will make the world more collaborative & build more great things. \n\nI grew up in India & now live in San Francisco. I love camping 🏕 & star gazing 🌌",
            "linkedin": "https://www.linkedin.com/in/rmgoyal/"
        }
    ],
    "status": true,
    "generated_description": "**Company Overview**\n\n**Name:** Velt  \n**Founded:** 2020  \n**Location:** San Francisco  \n**Team Size:** 15 employees  \n**Accelerator:** Y Combinator Batch W22  \n**Website:** [velt.dev](https://velt.dev)  \n\n**Mission Statement:**  \nVelt aims to \"add powerful collaboration features to your product ridiculously fast.\" This is not just about speed; it's about crafting the most seamless collaborative experience possible on the web.\n\n### The Vision\n\nIn an era where collaboration on online platforms is no longer optional, Velt recognizes that most web apps still operate like solitary vessels. The inception of tools like Figma and Google Docs introduced a more connected approach, bringing teams together regardless of their physical locations. Velt's ambition is to elevate this concept further, integrating collaboration into every digital keystone, thereby creating a workspace where coordination and communication burdens are reduced significantly—ideally aiming to lower these by over 90%. Imagine spending less time discussing and more time creating!\n\n### Products Offered\n\n1. **Velt Collaboration SDK**  \n   A JavaScript SDK designed for developers to seamlessly integrate collaboration features into their own products, enhancing user engagement and accelerating growth. More information can be found [here](https://velt.dev/).\n\n2. **Superflow**  \n   A JS plugin aimed specifically at product, marketing, and design teams. It allows them to comment and collaborate directly on websites, boosting their workflow efficiency up to 10 times faster. For more details, visit [usesuperflow.com](https://usesuperflow.com/).\n\n### Team Background\n\nThe Velt team comprises ex-Googlers who have previously rolled out significant products, including Augmented Reality in Google Search and Maps. Their experience lays a solid foundation for pioneering new collaborative tools.\n\n### Product Impact\n\nUsers of Velt have reported dramatic improvements in productivity and engagement:\n- Companies have seen a **26% increase in weekly active users** due to Velt's integrations.\n- Customers saved months of development time by implementing Velt's features, which took weeks instead of quarters.\n\n### Customer Success Stories\n\nVelt has been praised for its responsive support and the speed of iteration on the product. Here are a couple of testimonials:\n- **Yuri Kleban, Senior Product Manager at Google:** \"Velt provided outstanding support with very customizable components.\"\n- **Jeff Cunning, Chief Product Officer at MetaCX:** \"They saved us at least six months of development time.\"\n\n### Why Choose Velt?\n\n- **Efficiency:** With its advanced collaboration tools, teams can significantly reduce time lost in coordination.\n- **Speed:** Velt enables companies to build collaborative features rapidly.\n- **Trust:** Major organizations like Google and MetaCX have recognized Velt's capability to enhance their products, validating its impact in real environments.\n\n### Conclusion\n\nVelt is on a mission to revolutionize collaboration on the web. By removing and re-engineering the traditional silos of digital workflows, they are crafting a future where work can be done more efficiently and collaboratively than ever before. So, if you're ready to transform your product's collaboration experience, Velt could be the ally you've been searching for. Join their journey to accelerate the future of teamwork and productivity! 🚀",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/31c46200ad657aafec4097b3fbc02dc90ab054cf.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192043Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=7cc66721b31b1b00a199297167e55fbc58889d377ebd97db502614d82ec42f7d",
    "social_links": [
        "https://www.linkedin.com/company/veltjs/",
        "https://twitter.com/veltjs"
    ],
    "logo_path": "data/logos\\Velt_logo.png"
}