{
    "links": "https://www.ycombinator.com/companies/vendy",
    "name": "Vendy",
    "headline": "Vendy is a marketplace on WhatsApp",
    "batch": "W22",
    "description": "Vendy is a marketplace on WhatsApp. We provide customized WhatsApp shops for sellers, allowing buyers to browse inventory, place orders with automated invoicing, and make payments, all within WhatsApp. No app download or sign-up required.",
    "activity_status": "Active",
    "website": "https://myvendy.com",
    "founded_date": 2022.0,
    "team_size": 20.0,
    "location": "Lagos, Nigeria",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:payments; industry:b2b; industry:e-commerce",
    "founders": [
        {
            "name": "Kayode Disu, Founder",
            "description": "Passionate about transforming the digital payment landscape in Africa with an emphasis on mobile consumer products, I bring over 15 years of expertise in building digital security and payment solutions for leading banks and payment switches in West Africa. Beyond technology you'll find me on the basketball court or enjoying a refreshing swim.",
            "linkedin": "https://www.linkedin.com/in/kayode-disu-55629a17"
        },
        {
            "name": "Peter Ekunkoya, Founder",
            "description": "With two decades of experience in finance and strategy, I've navigated the intricacies of CPG multinationals. Now, my focus is on leveraging this wealth of knowledge to foster startups while immersing myself in the ever-evolving tech space. \nPeter@myvendy.com",
            "linkedin": "https://www.linkedin.com/in/peter-ekunkoya-13b76113"
        }
    ],
    "status": true,
    "generated_description": "**Company Overview: Vendy**\n\nFounded in 2022 and part of Y Combinator's W22 batch, Vendy is revolutionizing e-commerce in Nigeria by leveraging the ubiquitous nature of WhatsApp. Based in Lagos, Vendy offers a marketplace that allows sellers to create customized WhatsApp shops. These shops are designed to streamline the buying process: potential customers can browse products, place orders, and complete transactions—all without downloading a separate app or going through a complicated sign-up process.\n\n**Core Features:**\n\n1. **WhatsApp Integration**: Vendy makes commerce as simple as a chat. Buyers can engage directly through WhatsApp, utilizing familiar messaging to interact with merchants and make purchases.\n   \n2. **Automated Transactions**: After placing an order, buyers receive automated invoices. Payments can be made directly within WhatsApp, eliminating the need for receipt screenshots. This ensures a smoother, hassle-free experience for both sellers and buyers.\n\n3. **Product Delivery**: Vendy doesn't stop at facilitating sales; it also ensures efficient delivery options. This includes both physical products and digital items like event tickets or courses, which can be sent directly to buyers.\n\n4. **User-Friendly Setup**: Setting up a shop is quick and intuitive. Sellers can create their shops in minutes, share links with customers, and start selling right away. \n\n5. **Transformative for Sellers**: Vendy facilitates easier customer interactions through faster automated responses, helping businesses retain customers and drive repeat purchases.\n\n**Team and Development**: With a dynamic team of 20, Vendy is spearheaded by a group that understands the nuances of both technology and the local market. Their partnership with industry leaders adds a layer of credibility and support to their operations.\n\n**Market Focus**: Vendy targets the B2B segment in the e-commerce space, specifically through payment solutions that align with modern consumer expectations. As mobile payments are gaining traction in Nigeria and beyond, the company's focus on easing transactions through popular platforms places it ahead of many traditional e-commerce solutions.\n\n**Website and Contact**: Interested in learning more or starting your own shop? Visit Vendy at [myvendy.com](https://myvendy.com).\n\nIn summary, Vendy isn’t just about selling; it’s about creating an ecosystem where commerce happens naturally through the platforms people already love and use daily. It’s a refreshing approach that emphasizes convenience, accessibility, and efficiency in the buying and selling experience.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/339ce0d471b4e1afa9a7c485541d01a8728c0a74.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192043Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=216e467835e8e8c220cd44ff087408f35ea2588a10b45b84ac62c3cafb1919cf",
    "social_links": [
        "https://linkedin.com/company/paywithvendy",
        "https://x.com/UseVendyHQ",
        "https://web.facebook.com/usevendyhq/",
        "https://www.crunchbase.com/organization/vendy-inc"
    ],
    "logo_path": "data/logos\\Vendy_logo.png"
}