{
    "links": "https://www.ycombinator.com/companies/verdn",
    "name": "Verdn",
    "headline": "An API to bundle trackable climate donations with any transaction.",
    "batch": "W22",
    "description": "Verdn is a climate-impact API for companies and their end-customers. \r\n\nWith Verdn, companies direct a portion of sales towards ecosystem restoration projects (like tree planting, ocean-plastic cleanup, and coral planting), carried out by vetted NGO partners. After each sale, we send the end-customer a tracking dashboard where they can engage with updates about their positive impact.\r\n\nOur mission is to Ctrl+Z global ecosystem collapse by making sustainability profitable. We have planted 1,500,000 trees, recovered 400,000 kg of ocean-bound plastic and 150 m2 of coral reef, and have over 100+ paying customers that are seeing a 10x boost in engagement.",
    "activity_status": "Active",
    "website": "https://verdn.com",
    "founded_date": 2020.0,
    "team_size": 4.0,
    "location": "London, United Kingdom",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:saas; industry:b2b; industry:climate; industry:api; industry:climatetech",
    "founders": [
        {
            "name": "Christopher Mjelde, Founder",
            "description": "Working to avoid global ecosystem collapse with Verdn. Background in green tech, performance marketing, and consulting. BSc business management from KCL. Occasionally I climb mountains, or write screenplays.",
            "linkedin": "https://www.linkedin.com/in/chrismjelde/"
        },
        {
            "name": "Rory McMeekin, Founder",
            "description": "Full-stack web developer and designer. I like hacking on web apps, drawing, painting, making music (preferably on a computer!).\n\nI'm most interested in the intersection between art, design, and technology.",
            "linkedin": "https://linkedin.com/in/rorz/"
        }
    ],
    "status": true,
    "generated_description": "Verdn is a company with a clear mission: to make climate donations a standard part of any transaction through an API. Founded in 2020 and part of Y Combinator's Batch W22, Verdn operates from London and consists of a team of four dedicated employees. Their goal is ambitious yet straightforward: reverse global ecological damage by transforming sustainability into a profitable venture.\n\nThe core of Verdn’s offering lies in its climate-impact API, which enables companies to direct a portion of their sales revenues toward various ecosystem restoration initiatives, such as tree planting, ocean plastic recovery, and coral reef restoration. These projects are executed by vetted nonprofit partners, ensuring both transparency and efficacy.\n\nWhat sets Verdn apart is its post-purchase engagement strategy. After making a purchase, customers receive access to a tracking dashboard, allowing them to see the positive impact of their contributions, enhancing engagement and loyalty. The results speak for themselves; Verdn has managed to plant over 1.5 million trees and recover 400,000 kg of ocean-bound plastic. With more than 100 businesses using their service, many customers report up to a tenfold increase in engagement.\n\nThe platform suits both businesses and nonprofits. For companies, it allows seamless integration of giving back into their operations, enabling them to tell a compelling impact story and measure the effectiveness of their donations. Nonprofits benefit from easy collaboration with corporations, helping them track and report on positive key performance indicators.\n\nVerdn's approach appeals to a growing market of consumers who prioritize sustainability, allowing businesses to not only enhance their brand image but also drive actual sales growth. Plus, the integration process is quick—often taking just ten minutes.\n\nIn essence, Verdn is at the intersection of commerce and environmental stewardship, enabling businesses to look good while doing good. The potential for this model is vast, and if you're in the business scene, it's certainly worth paying attention to how Verdn is leveraging API technology to make a positive impact on our planet.\n\nFor more details, visit their website: [Verdn](https://verdn.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/c818746dc74056ac0bf312bbd9c10a79f8ed0339.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAFJSOQ65W%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192045Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELT%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDHe2krNA4Wz4ZdbboNJG%2B0zG6MmRspOJ5Kex%2FWuhFzDwIhAK4JNrLJx7V6Lp69aumcmLj570j2DR2Eh3hPcEuQGW3%2FKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgweLBjNRNugVRDPT8gqwgPiLGnMwjgQOiNH7FMTInTVKCCJLDe5fdDWlactIzRh2XOtRjauQZptst9ejdBs3vj590lIr07sFFKCWuGV%2B%2BJkmRqS%2BXBC6caH3J97%2FH7W3ch4kKAyKE3TuVCMVl%2BqNFww29jX%2BimNvDUNvCgQtjVE03FWSnfbJrDf3NUx8wttW6l2EC5fgOealDp0Ne7xA51qGtDKfIYSJUUyj6d2WgcNp66ilXSYF5HX3L4wid4xRepJ9Vt1krkNG6bsNoITqg8zMlLgZ7QT5uVwuoY%2Fhv%2F89O661Pa6%2FtGfz6gcZjx3JmkvJh2yaephzjfzpFg43OFS%2B3NnORgMbCqTEcn9piGJokbf9a5xoR2Qt8E4L2AdZTypzC0scYqz%2BA1CsQiK1RrvedAjSsaEw4%2FqFaR6rBrZ4SBiKqlmStv67nu5CMG6DF414F2WlGbkeS8C%2BJYZ2iky%2B19B0K9e4J7Tik78PRFNXoN8lSqP4k%2BLhdrqVq5b2d4m7UHeeProhr%2Fv5HV%2BORFSiFow%2Fhbxt6GN2P2YWxzdIHA32IkBqYD%2BeZ3eFOZSk%2B1Pldgq4PSaiU5lQlEewufIwxcnWXTzGkzSJ%2BLlLlzWX4EwrKPjvQY6pAEqZgWN8cooHP%2FeegIX6R3Pun8lUwrTM2csrvVF8K2udU7KUu1EoXzzxsupULfK9AN%2Bcef1HwWg3GN0hRmtduP9znDwqy7B09eErZHX3iCWPeVm7m2HUwQH0BM7NBnkw%2BBNh35scX3c4lMIghjRFyw9b8VEOGAbUjAxbgvLqemFdd8Zq7DGRWXDbhLqcGd2hHliZLchEjlQhzfD3wdeSwzTgvkJMw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=693e9b42405f6a2139489529cfeafc48307b9226e24cfe5090ce775d39a5cdd4",
    "social_links": [
        "https://www.linkedin.com/company/verdn/",
        "https://github.com/VerdnHQ"
    ],
    "logo_path": "data/logos\\Verdn_logo.png"
}