{
    "links": "https://www.ycombinator.com/companies/verge-genomics",
    "name": "Verge Genomics",
    "headline": "We use human data and AI to develop better drugs faster.",
    "batch": "S15",
    "description": "Verge uses artificial intelligence and human data to develop better drugs faster. Verge has an end-to-end technology-driven drug discovery and development platform, featuring one of the field’s largest and most comprehensive proprietary patient genomics datasets from human tissue. Verge uses machine learning to mine this data and develops these insights into new drugs using it’s human-centric biology and chemistry platforms.",
    "activity_status": "Active",
    "website": "http://vergegenomics.com",
    "founded_date": 2015.0,
    "team_size": 50.0,
    "location": "San Francisco",
    "group_partner": "Dalton Caldwell",
    "group_partner_yc": "https://www.ycombinator.com/people/dalton-caldwell",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:ai-powered-drug-discovery; industry:biotech; industry:healthcare; location:san-francisco-bay-area",
    "founders": [],
    "status": true,
    "generated_description": "**Verge Genomics: Revolutionizing Drug Discovery with AI and Human Data**\n\nFounded in 2015 as part of Y Combinator's S15 batch, Verge Genomics is carving a niche in the biotechnology sector by leveraging artificial intelligence (AI) and extensive human data to expedite drug development. Based in San Francisco with a dynamic team of around 50, the company champions the mission of delivering better drugs faster by harnessing cutting-edge technology.\n\nVerge has developed an innovative, all-in-human drug discovery platform known as CONVERGE®, utilizing a massive proprietary multi-omics database sourced directly from human tissue. This contrasts sharply with traditional methods that often rely on animal or cell models. By applying advanced machine learning techniques, Verge uncovers insights into the complex causes of diseases, aiming to transform these insights into promising drug candidates.\n\nThe company is focused on tackling significant medical challenges, such as amyotrophic lateral sclerosis (ALS), Parkinson's disease, and frontotemporal dementia—conditions currently without effective treatments. Notably, Verge's first drug, VRG50635, a small molecule inhibitor aimed at ALS, has already progressed to clinical trials in just four years. This rapid transition from research to clinic encapsulates their commitment to accelerating drug discovery.\n\nUnder the leadership of Dalton Caldwell, Verge is not just a biotech firm; it's a culture of innovation, collaboration, and relentless pursuit of breakthroughs in healthcare. They are actively seeking partnerships with industry leaders to reshape the drug discovery landscape.\n\nIf you're curious to learn more about how Verge Genomics is revolutionizing biotech and what they are working on, visit their [website](http://vergegenomics.com).\n\nIn essence, Verge Genomics stands at the confluence of human biology and machine intelligence, driving forward the next wave of therapeutic innovations. They are an example of how technology can fundamentally change the landscape of medicine and drug development.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/d4b8c3e8368d9b23d8e4fd9d9d72746a3c872a3e.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192045Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=065d2a7dd4d9aeaea9f238c2c57eedf10e77067585c219ce81a26a7c4c4b8d6d",
    "social_links": [
        "https://www.linkedin.com/company/verge-genomics/",
        "https://twitter.com/vergegenomics",
        "https://www.crunchbase.com/organization/verge-genomics"
    ],
    "logo_path": "data/logos\\Verge_Genomics_logo.png"
}