{
    "links": "https://www.ycombinator.com/companies/verihubs",
    "name": "Verihubs",
    "headline": "AI-powered Deepfake Detection",
    "batch": "S21",
    "description": "Verihubs is an Indonesian AI-powered verification company. We have helped more than 300 companies ranging from digital disruptors to Fortune 500 companies in Southeast Asia. Ranked #1 in Indonesia by the National Institute of Standards and Technology (NIST) in terms of performance and accuracy, our AI-based face recognition (FR) technology became a staple in fraud prevention in this new era of digital acceleration. Our solutions have been trusted by BCA—the largest private bank in Indonesia, IFG (one of the largest state-owned insurance), Commonwealth Bank, Maybank, Bukalapak, FAZZ, Ministry of Finance, and many other industry leaders.\r\n\nThe pandemic has accelerated the digital development and adoption of products, services, and processes by 4-7 years according to recent studies. However, the verification solutions and related data to meet these digital needs are still so behind the ideal mark. We at Verihubs are on a mission to build an all-inclusive automated and instant verification platform for Indonesia.",
    "activity_status": "Active",
    "website": "https://verihubs.com",
    "founded_date": 2019.0,
    "team_size": 63.0,
    "location": "Jakarta, Indonesia",
    "group_partner": "Diana Hu",
    "group_partner_yc": "https://www.ycombinator.com/people/diana-hu",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:artificial-intelligence; industry:saas; industry:b2b",
    "founders": [
        {
            "name": "Rick Firnando, Founder",
            "description": "Rick is a CEO at Verihubs who has 9+ years of B2B experience. Strong focus on business and customer development. Prior to this venture, he has worked as Head of BD at B2B CPaaS company focused on SEA digital apps and services and helped the company grew ARR by 3x within a year.",
            "linkedin": "https://www.linkedin.com/in/rickfirnando/"
        }
    ],
    "status": true,
    "generated_description": "Verihubs is an Indonesian company that has emerged as a leader in AI-powered verification solutions, becoming particularly well-known for its deepfake detection capabilities. Founded in 2019 and a proud member of Y Combinator's S21 batch, Verihubs has swiftly made a name for itself in Southeast Asia, serving over 300 clients ranging from digital startups to Fortune 500 companies. Notably, the company has been recognized as the #1 provider in Indonesia according to the National Institute of Standards and Technology (NIST), thanks to its exceptional performance in facial recognition technology, which is integral to modern fraud prevention.\n\nThe company's mission resonates deeply in a rapidly digitizing world, which, according to recent studies, has accelerated the adoption of digital products and services by several years due to the pandemic. Yet, despite this acceleration, the verification solutions businesses depend on remain behind the curve. Verihubs aims to bridge this gap by creating an all-inclusive, automated, and instant verification platform tailored for Indonesia.\n\nHeadquartered in Jakarta with a team of 63 employees, Verihubs has attracted significant attention and partnerships from major players like BCA, Commonwealth Bank, IFG, and Bukalapak, demonstrating its technology's reliability and efficacy in sectors such as finance, healthcare, and e-commerce.\n\nAmong its offerings are solutions like deepfake detection, face and liveness recognition, ID checks, and data extraction services, all designed to enhance security and streamline user experience in digital transactions. The company is also focused on making the verification process smooth for businesses, allowing for faster onboarding and improved operational efficiency.\n\nIn essence, Verihubs embodies the intersection of cutting-edge technology and a proactive stance against fraud, ensuring that businesses can operate confidently in a digital-first age. They aim not just to keep pace with technological advancements but to lead the charge in developing trustworthy solutions for identity verification. If you're looking to bolster your digital security and streamline compliance processes, Verihubs might just be the partner you need. Check them out at [verihubs.com](https://verihubs.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/3b7a4a1079f382e2033d772440f9581f86024c8e.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192046Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=65e53f629de9e0b6bd9b472b49caefc375bedbf64a2802507f66ad035aab5917",
    "social_links": [
        "https://www.linkedin.com/company/verihubs",
        "https://www.crunchbase.com/organization/verihubs"
    ],
    "logo_path": "data/logos\\Verihubs_logo.png"
}