{
    "links": "https://www.ycombinator.com/companies/veriff",
    "name": "Veriff",
    "headline": "AI-powered identity verification solution for fraud prevention.",
    "batch": "W18",
    "description": "Veriff is a global online identity verification company that enables organizations to build trust with their customers through intelligent, accurate, and automated online IDV. Veriff’s intelligent decision engine can analyze thousands of technological and behavioral variables in seconds, matching people to more than 10,000 government-issued IDs from over 190 countries. Veriff serves a global portfolio of organizations across fintech, crypto, and mobility sectors. \r\n\nFounded in 2015 by Kaarel Kotkas, today Veriff serves a global portfolio of internet businesses including fintech companies, sharing economy providers and marketplaces in the USA, Europe and other places in the world. Veriff is an alumnus of the startup accelerator Y Combinator and employs 350 people in its locations in Tallinn and Tartu in Estonia; New York, in the USA,  London in the UK and Barcelona in Spain.",
    "activity_status": "Active",
    "website": "https://veriff.com/",
    "founded_date": 2015.0,
    "team_size": 550.0,
    "location": "Tallinn, Estonia",
    "group_partner": "Gustaf Alstromer",
    "group_partner_yc": "https://www.ycombinator.com/people/gustaf-alstromer",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:saas",
    "founders": [],
    "status": true,
    "generated_description": "### Veriff: The AI-Powered Identity Verification Solution\n\nVeriff is an innovative company that emerged in 2015 to drive trust and security in the digital world through its powerful identity verification platform. Founded by Kaarel Kotkas, Veriff started with a mission to prevent fraud by leveraging AI technology for identity verification (IDV). With its intelligent decision engine capable of assessing thousands of variables in mere seconds, Veriff matches individuals to over 10,000 government-issued IDs from more than 190 countries. \n\n#### Company Overview:\n- **Founded:** 2015\n- **Founder:** Kaarel Kotkas\n- **Locations:** Tallinn and Tartu (Estonia), New York (USA), London (UK), and Barcelona (Spain)\n- **Workforce:** 350 employees\n- **Incubator:** Part of Y Combinator Batch W18\n\nVeriff caters to a wide array of sectors including fintech, crypto, and mobility, ensuring that digital businesses can conduct their operations safely and securely.\n\n#### Platform Features:\nVeriff offers a comprehensive identity verification solution that focuses on enhancing user experience while minimizing fraud. The platform enables businesses to build trusted digital communities by providing:\n\n1. **Identity and Document Verification**: Streamlining onboarding processes with efficient document checks. \n2. **Proof of Address**: Helping businesses approve more users with reduced friction.\n3. **Know Your Customer (KYC)**: Ensuring compliance through effective onboarding and ongoing monitoring.\n4. **Fraud Protection**: Tools to help organizations proactively combat identity fraud.\n5. **Biometric Authentications**: A passwordless authentication system for secure user access.\n6. **Automation**: An impressive 98% check automation rate, allowing users to be verified in about 6 seconds, with 95% achieving verification on their first try.\n\n#### Success and Global Reach:\nVeriff is growing rapidly, currently boasting support for 48 languages, offering global accessibility and expansion capabilities for its clients. With notable clients such as Monzo, AWS, and Deel, Veriff enhances conversion rates while protecting businesses against fraudulent activities.\n\n#### Key Takeaways:\n- **Mission**: Empowering trust through secure identity verification.\n- **Innovation**: A blend of AI and human verification to mitigate fraud with a focus on user experience.\n- **Growth**: Supported by Y Combinator and rapidly expanding across global markets.\n\nIn summary, Veriff stands at the intersection of technology and trust, enabling businesses to thrive in a digital landscape rife with challenges while ensuring their customers are always protected. If you're seeking to bolster your business's security and user onboarding process, Veriff might just be the solution worth exploring. You can learn more about their services at [Veriff's website](https://veriff.com/).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/2dcc837fbd696b05045793dec3fbd1fd39d422c2.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAFJSOQ65W%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192046Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELT%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDHe2krNA4Wz4ZdbboNJG%2B0zG6MmRspOJ5Kex%2FWuhFzDwIhAK4JNrLJx7V6Lp69aumcmLj570j2DR2Eh3hPcEuQGW3%2FKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgweLBjNRNugVRDPT8gqwgPiLGnMwjgQOiNH7FMTInTVKCCJLDe5fdDWlactIzRh2XOtRjauQZptst9ejdBs3vj590lIr07sFFKCWuGV%2B%2BJkmRqS%2BXBC6caH3J97%2FH7W3ch4kKAyKE3TuVCMVl%2BqNFww29jX%2BimNvDUNvCgQtjVE03FWSnfbJrDf3NUx8wttW6l2EC5fgOealDp0Ne7xA51qGtDKfIYSJUUyj6d2WgcNp66ilXSYF5HX3L4wid4xRepJ9Vt1krkNG6bsNoITqg8zMlLgZ7QT5uVwuoY%2Fhv%2F89O661Pa6%2FtGfz6gcZjx3JmkvJh2yaephzjfzpFg43OFS%2B3NnORgMbCqTEcn9piGJokbf9a5xoR2Qt8E4L2AdZTypzC0scYqz%2BA1CsQiK1RrvedAjSsaEw4%2FqFaR6rBrZ4SBiKqlmStv67nu5CMG6DF414F2WlGbkeS8C%2BJYZ2iky%2B19B0K9e4J7Tik78PRFNXoN8lSqP4k%2BLhdrqVq5b2d4m7UHeeProhr%2Fv5HV%2BORFSiFow%2Fhbxt6GN2P2YWxzdIHA32IkBqYD%2BeZ3eFOZSk%2B1Pldgq4PSaiU5lQlEewufIwxcnWXTzGkzSJ%2BLlLlzWX4EwrKPjvQY6pAEqZgWN8cooHP%2FeegIX6R3Pun8lUwrTM2csrvVF8K2udU7KUu1EoXzzxsupULfK9AN%2Bcef1HwWg3GN0hRmtduP9znDwqy7B09eErZHX3iCWPeVm7m2HUwQH0BM7NBnkw%2BBNh35scX3c4lMIghjRFyw9b8VEOGAbUjAxbgvLqemFdd8Zq7DGRWXDbhLqcGd2hHliZLchEjlQhzfD3wdeSwzTgvkJMw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=f086515969ab8e5e775fba02b49f8505c6cf35c72e73b9f8e86365e3ed45deca",
    "social_links": [
        "https://www.linkedin.com/company/veriff/",
        "https://twitter.com/veriff",
        "https://www.facebook.com/veriff",
        "https://www.crunchbase.com/organization/veriff",
        "https://github.com/Veriff"
    ],
    "logo_path": "data/logos\\Veriff_logo.png"
}