{
    "links": "https://www.ycombinator.com/companies/jetlenses",
    "name": "Verse Medical",
    "headline": "Software platform for in-home healthcare",
    "batch": "S18",
    "description": "As healthcare costs have increased, the patient's home has become incredibly important as a site of care. Yet, patients recovering at home are highly underserved.\r\n\nPatients can only get better at home if they receive the high-quality care that they need reliably. The existing in-home care process involves patchwork of different vendors, all connected through faxes by nurses. We're building modern, robust software that solves this challenge and brings this market online.",
    "activity_status": "Active",
    "website": "http://versemedical.com/",
    "founded_date": null,
    "team_size": 95.0,
    "location": "New York",
    "group_partner": "Gustaf Alstromer",
    "group_partner_yc": "https://www.ycombinator.com/people/gustaf-alstromer",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:consumer-health-services; industry:medical-devices; location:new-york",
    "founders": [
        {
            "name": "Dhaivat Pandya, Founder",
            "description": "CEO, Verse Medical.",
            "linkedin": "https://www.linkedin.com/in/dhaivat-pandya-2285b356/"
        }
    ],
    "status": true,
    "generated_description": "**Verse Medical: Revolutionizing In-Home Healthcare**\n\nVerse Medical, based in New York, is fundamentally reshaping how we think about in-home healthcare. Founded as healthcare costs continue to rise, it addresses a crucial need in our modern healthcare landscape—providing high-quality care in the comfort of one's home. The concept is simple yet powerful: true recovery happens at home, but many patients face a frustratingly fragmented care experience, relying on a hodgepodge of providers and outmoded fax-based communications. \n\nThat's where Verse Medical comes in. The company has developed a sophisticated software platform designed to streamline in-home care, making it more reliable and efficient. Say goodbye to the chaos of managing multiple vendors and hello to a robust, user-friendly system that connects all the dots. By centralizing care referrals, tracking orders, and reducing the administrative load, Verse Medical empowers healthcare providers to focus more on their patients rather than getting bogged down in logistics.\n\nPart of Y Combinator’s Summer 2018 batch, Verse Medical is a team of 95 enthusiastic employees committed to transforming patient care. Led by Gustaf Alstromer, this company is tagged under consumer health services and medical devices, reflecting its innovative approach to healthcare delivery.\n\nWhether you’re a patient seeking dependable in-home care or a healthcare provider looking to enhance your services, Verse Medical's platform ensures a streamlined experience. They operate across all 50 states, boasting robust partnerships to facilitate quality care nationwide. \n\nWhat’s more, their software is easy to use, promises to save clinics 10-15 hours a week, and caters to all insurance plans, making it a genuinely inclusive service. The feedback has been overwhelmingly positive, with healthcare providers praising the platform for being a \"game changer\" in simplifying their workflows. \n\nIn essence, Verse Medical is on a mission: to make high-quality, reliable in-home healthcare not just a luxury, but a standard. Their approach is practical, their technology is modern, and their vision is clear. You can learn more about their services and join their journey by visiting [Verse Medical's website](http://versemedical.com).\n\nSo, if you're interested in the future of healthcare, keep an eye on this company. They're not just building software—they're paving the way for a new era in patient care.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/f55bcff3ea24cd1b2028907fc462e9b65ee15014.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192046Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=a6c00b8d0bd14dcac483b8c860dc7d032afc1572ac6599d4d780b2eb9711aff6",
    "social_links": [],
    "logo_path": "data/logos\\Verse_Medical_logo.png"
}