{
    "links": "https://www.ycombinator.com/companies/verse-therapy",
    "name": "Verse Therapy",
    "headline": "Connecting All Ages with Speech Language Pathologists",
    "batch": "W24",
    "description": "At Verse Therapy, we're dedicated to making quality speech therapy accessible for everyone by empowering speech-language pathologists (SLPs) to launch and grow their own independent practices. We help therapists focus on what they do best—providing compassionate, personalized care—by taking care of the administrative tasks that often lead to burnout. Through thoughtful marketing and partnerships with care organizations like rehab centers, we connect SLPs with individuals who need their expertise. Our AI-enabled back office streamlines insurance processing, scheduling, and documentation, reducing non-therapy overhead. We're now live in 10 states with over 35 dedicated therapists and are in-network with leading insurance providers, making it easier for clients to receive the support they need.",
    "activity_status": "Active",
    "website": "https://versetherapy.com",
    "founded_date": 2024.0,
    "team_size": 3.0,
    "location": "San Francisco",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:consumer-health-services; industry:digital-health; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Adam Steinle, Founder",
            "description": "Former biomedical engineer, Goldman banker, and big tech PM going back to my roots as a founder in healthcare. Over 4 years at Facebook, I launched many successful products for Content Moderation, Community Growth, Gaming, and Creator Monetization.",
            "linkedin": "https://linkedin.com/in/adamsteinle"
        },
        {
            "name": "Danielle Yoesep, Founder",
            "description": "Grew up interested in science, always thinking I'd become a doctor (immigrant parents lol) but realized in university that practicing medicine actually wasn't the way I wanted to make my impact. Stayed in science, wanted to be on the cutting edge, did some research developing platform technologies that enable the synthesis of novel molecules. I helped spin a company out based on the work and built it up from (mostly) scratch. We ended up getting acquired, and now I'm doing it all over again :)",
            "linkedin": "https://linkedin.com/in/djyoesep"
        },
        {
            "name": "Shuying Zhang, Founder",
            "description": "I have a mixed background of biomedical engineering and software development. Prior to founding Hona.ai, I was a software engineer at Google and Amazon. My past work was centered on Document AI, knowledge graph and cloud infrastructure.",
            "linkedin": "https://linkedin.com/in/shuying-sofia-zhang-91902866"
        }
    ],
    "status": true,
    "generated_description": "**Verse Therapy: A New Era in Speech Therapy**\n\nFounded in 2024, Verse Therapy is redefining the landscape of speech therapy, driven by the mission of connecting all ages with speech-language pathologists (SLPs). The company is headquartered in San Francisco and is a proud participant of the Y Combinator Batch W24. With a small, dedicated team of just three employees, Verse Therapy is currently operating in ten states and has onboarded over 35 therapists.\n\n### The Vision\n\nAt its core, Verse Therapy seeks to make quality speech therapy accessible to everyone. They empower SLPs to establish and grow their practices, allowing them to focus on what they do best: providing compassionate and personalized care. By taking care of the often-overwhelming administrative tasks—think scheduling, insurance processing, and documentation—Verse Therapy significantly reduces the burnout that many therapists experience.\n\n### How It Works\n\nThe platform features an AI-enabled back office that streamlines the business side of therapy. This innovation not only facilitates insurance processing and scheduling, but also enhances documentation practices, enabling therapists to prioritize client interaction. For clients, the process is straightforward: you can expect to start therapy in a matter of days instead of months. \n\n### Affordable and Convenient\n\nVerse Therapy is making strides in reducing the costs associated with speech therapy. Clients typically pay less than half the cost of traditional therapies, as they work with a wide array of insurance providers. Furthermore, they offer self-pay options starting at just $95 per session.\n\n### Services Offered\n\nVerse Therapy caters to a broad range of speech-related issues, including:\n- Speech sound disorders\n- Voice disorders\n- Fluency disorders\n- Cognitive-communication therapy (essential for those recovering from strokes and brain injuries)\n- Gender-affirming voice therapy\n- Public speaking and professional communication strategies\n\nWhether for children or adults, the platform's therapists are equipped to manage various communication challenges. \n\n### Client-Centric Approach\n\nOne of the standout features of Verse Therapy is its commitment to ongoing support. Therapists are accessible outside of scheduled sessions, allowing clients to reach out for additional help when they need it most. This level of accessibility and flexibility is a notable differentiator in the therapy space. \n\n### Conclusion\n\nWith a clear mission, a smart use of technology, and a focus on affordable care, Verse Therapy is set to change how individuals access speech therapy. By placing therapists and their clients first, they are championing a new paradigm where therapy is not only effective but also approachable for everyone, regardless of age or background. \n\nFor more information, check out their website at [Verse Therapy](https://versetherapy.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/c2f62ed395b6fdd688264ca5116c5d97444d339a.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192046Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=3fabdd523f428218a7774c6490af18df92a2444fff9f433f721ba0f360de486c",
    "social_links": [
        "https://www.linkedin.com/company/verse-therapy"
    ],
    "logo_path": "data/logos\\Verse_Therapy_logo.png"
}