{
    "links": "https://www.ycombinator.com/companies/versori",
    "name": "Versori",
    "headline": "Add fully custom native connectors to your SaaS in hours",
    "batch": "W23",
    "description": "From operational automations to embeddable custom connectors. Save 10x of cost and time by building custom connectors and workflow automations in hours.",
    "activity_status": "Active",
    "website": "https://www.versori.com/",
    "founded_date": 2022.0,
    "team_size": 16.0,
    "location": "Manchester, United Kingdom",
    "group_partner": "Brad Flora",
    "group_partner_yc": "https://www.ycombinator.com/people/brad-flora",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:saas; industry:b2b; industry:api; industry:no-code; industry:data-engineering",
    "founders": [
        {
            "name": "Sean Brown, Founder",
            "description": "Previously Founder and CEO at Mercarto (eCommerce/marketplace platform - acquired) and Hatch (Influencer Platform Acquired by Social Chain AG), Sean is fanatical about building technology to provide critical business infrastructure. \n\nHis strengths lie in Product and Business Development, by merging the two results in great product that delivers best in class products that provide high value solutions to clients.",
            "linkedin": "https://www.linkedin.com/in/sean1brown/"
        },
        {
            "name": "Dan Jones, Founder",
            "description": "Dan is a CTO/Founder who loves getting stuck into code and is an advocate for all things cloud-native. With experiences in both public and private sectors, spanning industries such as Finance, Telecoms, Healthcare and Commerce, Dan has grounded himself as a versatile software engineer capable of solving complex problems in simple ways.",
            "linkedin": "https://www.linkedin.com/in/dan-jones25217"
        }
    ],
    "status": true,
    "generated_description": "**Versori: Integration Made Easy**\n\nFounded in 2022 and part of the Y Combinator Batch W23, Versori is changing the game in the integration landscape. Based in Manchester, UK, with a keen team of 16, the company’s mission is straightforward yet ambitious: to enable users to add fully custom native connectors to their SaaS applications in just hours, not weeks.\n\n### What They Do\n\nVersori started its journey focusing on operational automation and embedding custom connectors that can save businesses up to 10 times in both costs and development time. Their platform allows teams to build custom workflows and integrations without needing deep technical expertise—essentially democratizing the process of API integration. \n\n### Products and Features\n\nWith a no-code visual integration interface, Versori provides several key products:\n\n- **Integrate**: No-code visual integrations that are intuitive and quick to set up.\n- **Embedded**: Scalable native integration hubs that can be custom-built to suit specific needs.\n- **Assistants**: AI chat integrations to enhance customer interactions.\n- **Formulas**: A soon-to-launch feature promising pre-built integration templates catering to various needs.\n\nTheir flexibility allows them to cater to diverse industries including ecommerce, retail, business operations, supply chain, hospitality, and even AI/LLMs.\n\n### Key Advantages\n\n1. **Speed**: Custom integrations can be rolled out in days, with no need for engineering resources.\n2. **AI-Driven**: Users can leverage AI agents to automate the entire process of creating connectors and designing workflow logic.\n3. **No-Code**: The platform is designed for those who may not have a technical background but need robust solutions to their integration challenges.\n4. **Security**: Versori is SOC II certified, ensuring that client data remains secure and compliant while maintaining performance.\n\n### Noteworthy Partners and Clients\n\nVersori’s integration platform is not just theoretical; it has seen significant success across various high-profile clients. For example, ZigZag Global, a $2 billion returns logistics giant, successfully integrated their system with global brands in just a few days. Additionally, major retailers and service providers like Walmart and Uber have tapped into Versori's capabilities to streamline their operations.\n\n### The Future with Versori\n\nAs they continue to innovate, Versori is set to launch more features, including pre-built templates to further simplify integrations and broaden their appeal. \n\nIf you're part of an organization looking for seamless custom integrations without the complexity, you might want to **[book a demo](https://www.versori.com/<https:/calendly.com/versori>)** and see how Versori can revolutionize your processes. \n\nIn an era where efficiency is king, Versori stands out as the tool that enables businesses to harness the power of integration swiftly and effectively.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/8813a970705c92a787fc4c87278d5856fe9a08cd.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192046Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=312c7bc8994b1e2a5f1caca3163a5cf19205daf1e35a195b8c6fd11d333853a6",
    "social_links": [
        "https://www.linkedin.com/company/versori"
    ],
    "logo_path": "data/logos\\Versori_logo.png"
}