{
    "links": "https://www.ycombinator.com/companies/verto",
    "name": "Verto",
    "headline": "Cross-Border Payments and FX Simplified",
    "batch": "W19",
    "description": "Verto is a cross-border payment platform for businesses; our mission is to simplify cross-border payments in emerging markets, particularly Africa.\r\n\nWe do this by providing businesses with superb infrastructure that they can use to convert, hold, receive and make payments across 49 currencies.\r\n\nBy connecting Businesses, Liquidity providers, FX Brokers, and Payment Institutions, and banks through our marketplace, companies can choose their foreign exchange rates at the time that suits them, therefore, providing a constant liquidity flow cheaply.",
    "activity_status": "Active",
    "website": "http://www.vertofx.com",
    "founded_date": 2018.0,
    "team_size": 170.0,
    "location": "London, United Kingdom",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:banking-as-a-service; industry:fintech; industry:payments; industry:b2b; industry:api",
    "founders": [
        {
            "name": "Anthony Oduwole, Founder",
            "description": "Anthony’s experience includes co-founding an online education portal Tespoke – designed to bridge the gap between schools, parents, and tutors. He also served as a co-founder of property development and investment startup - Expedius. An ex-banking & capital market specialist with experience with Bank of America Merrill Lynch, Barclays & Lloyds Bank.",
            "linkedin": "https://www.linkedin.com/in/anthonyoduu/"
        },
        {
            "name": "Ola Oyetayo, Founder",
            "description": null,
            "linkedin": "https://www.linkedin.com/in/ola-oyetayo-02277516/"
        }
    ],
    "status": true,
    "generated_description": "**Verto: Making Cross-Border Payments Simple**\n\nFounded in 2018 as a member of Y Combinator's W19 batch, Verto is carving a niche in the world of cross-border payments, especially tailored for businesses in emerging markets like Africa. The company is based in London and has built a substantial team of around 170 employees. Its mission? To simplify cross-border payments and foreign exchange (FX) for businesses, making international finance as seamless as possible.\n\n### What They Offer\nVerto operates a cross-border payment platform that provides businesses with a robust infrastructure to hold, convert, receive, and send payments across 49 different currencies. The platform integrates various key players in the financial ecosystem—businesses, liquidity providers, FX brokers, payment institutions, and banks—through a marketplace model. This allows companies to choose the best foreign exchange rates at their convenience, enhancing liquidity and reducing costs.\n\n### Key Features\n- **Multi-Currency Accounts:** Facilitate global business operations by managing multiple currencies with ease.\n- **Expense Management Tools:** Help businesses streamline their financial processes and maintain control over international expenses.\n- **FX and Treasury Management:** Equip businesses with the tools to manage exchange rate risks effectively and optimize their financial strategies.\n- **Invoice Payment Solutions:** Simplify the process of sending and tracking invoices globally.\n- **Core APIs:** Allow for easy integration of Verto’s services into businesses’ existing systems, giving them flexibility and control.\n\n### Market Focus\nPrimarily, Verto targets businesses operating in emerging markets, with a strong emphasis on Africa. Their platform is a gateway for startups all the way through to enterprises, facilitating everything from payroll to marketplace transactions. \n\n### Why Verto?\n- **Innovative Marketplace:** Verto's unique marketplace allows instant negotiation and exchange at preferred rates, ensuring businesses can operate on their terms.\n- **Regulatory Compliance:** With a license from the UK's Financial Conduct Authority and adherence to international standards, Verto assures clients of security and compliance in every transaction it processes.\n- **Proven Success:** Trusted by leading industry players like Target Mart and Sun King, Verto has established itself as a reliable partner in optimizing cross-border payment operations.\n\nIn a world where businesses are increasingly required to operate globally, Verto simplifies the complexities of cross-border payments and FX management. Through innovative technology and strategic partnerships, it empowers companies to navigate the financial landscape with confidence and efficiency.\n\nTo learn more about how Verto can transform your business transactions, visit [www.vertofx.com](http://www.vertofx.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/c3249b7e28263584c31548a53f288b0098a0ed71.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAFJSOQ65W%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192047Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELT%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDHe2krNA4Wz4ZdbboNJG%2B0zG6MmRspOJ5Kex%2FWuhFzDwIhAK4JNrLJx7V6Lp69aumcmLj570j2DR2Eh3hPcEuQGW3%2FKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgweLBjNRNugVRDPT8gqwgPiLGnMwjgQOiNH7FMTInTVKCCJLDe5fdDWlactIzRh2XOtRjauQZptst9ejdBs3vj590lIr07sFFKCWuGV%2B%2BJkmRqS%2BXBC6caH3J97%2FH7W3ch4kKAyKE3TuVCMVl%2BqNFww29jX%2BimNvDUNvCgQtjVE03FWSnfbJrDf3NUx8wttW6l2EC5fgOealDp0Ne7xA51qGtDKfIYSJUUyj6d2WgcNp66ilXSYF5HX3L4wid4xRepJ9Vt1krkNG6bsNoITqg8zMlLgZ7QT5uVwuoY%2Fhv%2F89O661Pa6%2FtGfz6gcZjx3JmkvJh2yaephzjfzpFg43OFS%2B3NnORgMbCqTEcn9piGJokbf9a5xoR2Qt8E4L2AdZTypzC0scYqz%2BA1CsQiK1RrvedAjSsaEw4%2FqFaR6rBrZ4SBiKqlmStv67nu5CMG6DF414F2WlGbkeS8C%2BJYZ2iky%2B19B0K9e4J7Tik78PRFNXoN8lSqP4k%2BLhdrqVq5b2d4m7UHeeProhr%2Fv5HV%2BORFSiFow%2Fhbxt6GN2P2YWxzdIHA32IkBqYD%2BeZ3eFOZSk%2B1Pldgq4PSaiU5lQlEewufIwxcnWXTzGkzSJ%2BLlLlzWX4EwrKPjvQY6pAEqZgWN8cooHP%2FeegIX6R3Pun8lUwrTM2csrvVF8K2udU7KUu1EoXzzxsupULfK9AN%2Bcef1HwWg3GN0hRmtduP9znDwqy7B09eErZHX3iCWPeVm7m2HUwQH0BM7NBnkw%2BBNh35scX3c4lMIghjRFyw9b8VEOGAbUjAxbgvLqemFdd8Zq7DGRWXDbhLqcGd2hHliZLchEjlQhzfD3wdeSwzTgvkJMw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=6de80a209ba9cb3a3880ade13b7c0453585f42d673880945f42282b1a59c021f",
    "social_links": [
        "https://www.linkedin.com/company/vertofx/",
        "https://twitter.com/VertoFX",
        "https://www.facebook.com/VertoFX/",
        "https://www.crunchbase.com/organization/vertofx"
    ],
    "logo_path": "data/logos\\Verto_logo.png"
}