{
    "links": "https://www.ycombinator.com/companies/videopixie",
    "name": "Videopixie",
    "headline": "Marketplace for Video Production Services.  We help you hire the bestâ\u0080¦",
    "batch": "S11",
    "description": "Videopixie is a marketplace for video production that allows users to have great video on the website, such as promotional videos and etc.\n\nVideopixie is a marketplace where you can hire the worldâ\u0080\u0099s best video professionals at a range of price points, to fit any budget. Retailers use Videopixie to make weekly product videos. Game companies use Videopixie to make trailers, using in-game footage, to air on national TV. Newly-weds use Videopixie to edit their five hours of â\u0080\u0098big-dayâ\u0080\u0099 footage into a five minute keepsake for life.",
    "activity_status": "Active",
    "website": "http://videopixie.com",
    "founded_date": null,
    "team_size": 11.0,
    "location": "San Francisco",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:marketplace; industry:video; location:san-francisco-bay-area",
    "founders": [],
    "status": true,
    "generated_description": "**Videopixie: Your Marketplace for Video Production**\n\nVideopixie is fundamentally reshaping how people approach video production. Founded in the vibrant city of San Francisco and nurtured through Y Combinator’s Batch S11, this platform serves as a marketplace connecting clients with the world's best video professionals—whether you’re on a shoestring budget or seeking high-end production.\n\nThe core mission of Videopixie revolves around helping users hire the finest video talent to create stunning content like promotional videos, wedding montages, gaming trailers, and Kickstarter campaigns. With a diverse array of creators—ranging from talented freelancers to full-scale production studios—Videopixie tailors to every project's unique needs.\n\n### **What Videopixie Offers**\n\n1. **Streamlined Process:** It takes only five minutes to set up a project on the site. Describe what you need, and you'll receive bids from qualified videographers, animators, and editors. Choose your favorite based on their portfolios and production costs.\n\n2. **Versatile Applications:** From weekly product videos for retailers to heartfelt wedding edits, Videopixie's professionals can handle it all. Companies like Knox Avenue and Hunt House Pictures have found success leveraging Videopixie to create impactful visuals that resonate.\n\n3. **Thousands of Options:** Whether you're looking for individual freelancers or a full-fledged production team, the platform boasts a vast network of experts in various video production specialties.\n\n### **Team and Impact**\n\nWith a dedicated team of 11 vibrant employees, Videopixie is thriving in the competitive video production landscape. The company encourages creativity and innovation in video services, making it a go-to destination for those needing compelling visual content.\n\n### **Get Involved**\n\nIf you’re looking to start a video project or even get involved as a creator, check out their offerings at [Videopixie.com](http://videopixie.com).\n\nIn a nutshell, Videopixie is not just another service; it’s where creativity meets convenience in video production. Whether you need a simple edit or a complex animation, this platform ensures you’ll find the right match for your vision.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/b216fdc3e34d1f5bc1c28fc282c179367ad28864.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAFJSOQ65W%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192047Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELT%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDHe2krNA4Wz4ZdbboNJG%2B0zG6MmRspOJ5Kex%2FWuhFzDwIhAK4JNrLJx7V6Lp69aumcmLj570j2DR2Eh3hPcEuQGW3%2FKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgweLBjNRNugVRDPT8gqwgPiLGnMwjgQOiNH7FMTInTVKCCJLDe5fdDWlactIzRh2XOtRjauQZptst9ejdBs3vj590lIr07sFFKCWuGV%2B%2BJkmRqS%2BXBC6caH3J97%2FH7W3ch4kKAyKE3TuVCMVl%2BqNFww29jX%2BimNvDUNvCgQtjVE03FWSnfbJrDf3NUx8wttW6l2EC5fgOealDp0Ne7xA51qGtDKfIYSJUUyj6d2WgcNp66ilXSYF5HX3L4wid4xRepJ9Vt1krkNG6bsNoITqg8zMlLgZ7QT5uVwuoY%2Fhv%2F89O661Pa6%2FtGfz6gcZjx3JmkvJh2yaephzjfzpFg43OFS%2B3NnORgMbCqTEcn9piGJokbf9a5xoR2Qt8E4L2AdZTypzC0scYqz%2BA1CsQiK1RrvedAjSsaEw4%2FqFaR6rBrZ4SBiKqlmStv67nu5CMG6DF414F2WlGbkeS8C%2BJYZ2iky%2B19B0K9e4J7Tik78PRFNXoN8lSqP4k%2BLhdrqVq5b2d4m7UHeeProhr%2Fv5HV%2BORFSiFow%2Fhbxt6GN2P2YWxzdIHA32IkBqYD%2BeZ3eFOZSk%2B1Pldgq4PSaiU5lQlEewufIwxcnWXTzGkzSJ%2BLlLlzWX4EwrKPjvQY6pAEqZgWN8cooHP%2FeegIX6R3Pun8lUwrTM2csrvVF8K2udU7KUu1EoXzzxsupULfK9AN%2Bcef1HwWg3GN0hRmtduP9znDwqy7B09eErZHX3iCWPeVm7m2HUwQH0BM7NBnkw%2BBNh35scX3c4lMIghjRFyw9b8VEOGAbUjAxbgvLqemFdd8Zq7DGRWXDbhLqcGd2hHliZLchEjlQhzfD3wdeSwzTgvkJMw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=965c1b67470d34f33b9f226d27f37e14b86e563ab81ea21bcb96de83c59f6e80",
    "social_links": [
        "https://www.linkedin.com/company/videopixie/",
        "https://www.crunchbase.com/organization/videopixie"
    ],
    "logo_path": "data/logos\\Videopixie_logo.png"
}