{
    "links": "https://www.ycombinator.com/companies/village-labs",
    "name": "Village Labs",
    "headline": "Helping America's businesses become employee owned",
    "batch": "S24",
    "description": "At Village Labs, we help America's businesses become employee owned by helping them set up and manage an employee stock ownership plan (ESOP). \r\n\nESOPs are a federal retirement plan that enable businesses to give their employees a stake in the company in exchange for significant tax benefits. \r\n\nWith 2.9M Baby Boomer business owners set to retire in the coming years, there's a growing \"Silver Tsunami\" of businesses across the country in search of new ownership. For many of these owners, selling to their employees is a socially-minded yet financially pragmatic solution.\r\n\nBy selling ownership of their business to an ESOP, owners get a fair price, tax benefits, and the satisfaction of knowing their employees and legacy will be taken care of — things not guaranteed with traditional buyers like private equity. In turn, employees retain their jobs and get shares in the business that can help them create life changing wealth by the time they retire — imagine an office secretary retiring as a millionaire. \r\n\nThousands of businesses across America like Bob's Red Mill, Harpoon Brewery, and Recology already have an ESOP, benefiting over 14 million workers and creating 2.1 trillion in employee wealth. We're excited about the opportunity to massively grow these numbers by making it simple for every business to become employee owned.",
    "activity_status": "Active",
    "website": "https://villagelabs.app/",
    "founded_date": 2023.0,
    "team_size": 2.0,
    "location": "New York",
    "group_partner": "Dalton Caldwell",
    "group_partner_yc": "https://www.ycombinator.com/people/dalton-caldwell",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:human-resources; location:new-york",
    "founders": [
        {
            "name": "Roger Cawdette, Co-Founder & CEO",
            "description": "I'm the co-founder & CEO at Village Labs where we're building software for ESOPs. Our hope is that by creating great products and technology for ESOPs, we’ll be able to expand employee ownership across America.\n\nBefore this, I co-founded Finary (YC W21) where we were building a social network for the stock market (before WallStreetBets went viral!). I studied Technological & Social Innovation at Harvard and left after my sophomore year to do YC.",
            "linkedin": "https://linkedin.com/in/rogercawdette"
        },
        {
            "name": "Turja Chowdhury, Co-Founder & CTO",
            "description": "Co-founder and CTO @ Village Labs",
            "linkedin": "https://linkedin.com/in/tchowd"
        }
    ],
    "status": true,
    "generated_description": "**Village Labs: Empowering Employee Ownership Across America**\n\nFounded in 2023 and based in New York, Village Labs is on a mission to transform America’s businesses by making them employee-owned. The core of their approach lies in facilitating Employee Stock Ownership Plans (ESOPs)—a powerful federal retirement plan that allows employees to acquire shares in their companies, often with significant tax advantages.\n\nAs Baby Boomers retire, there’s an impending \"Silver Tsunami\" of businesses looking for new ownership. Instead of selling to private equity or external buyers, Village Labs helps owners transition their businesses to ESOPs. This process ensures they receive a fair price for their business while also supporting their employees—who can build wealth over their careers through ownership. Imagine an office secretary retiring as a millionaire—this isn't just a dream but a tangible outcome for many employees in ESOP companies.\n\nCurrently, thousands of businesses, including well-known names like Bob's Red Mill and Harpoon Brewery, benefit from ESOPs, collectively generating over $2.1 trillion in employee wealth and benefiting more than 14 million workers. Village Labs is striving to increase these impressive statistics by simplifying the process for businesses looking to make this shift.\n\nThe company is part of Y Combinator Batch S24 and is spearheaded by a small but dedicated team of two, under the guidance of Group Partner Dalton Caldwell. They offer a suite of AI-driven products tailored for ESOPs, including:\n\n- **VillageOS**: A centralized management system for plan documents and participant records, equipped with AI search and analytics.\n- **Repurchase Forecasting**: Tools designed to help companies model and understand their repurchase obligations.\n- **Third Party Administration**: Full-service administration for ESOPs, upcoming soon.\n- For service providers, they provide a **Custom AI System** designed specifically for ESOP service providers like trustees and valuation firms.\n\nVillage Labs is not just about numbers, though. They believe that employee ownership is critical for fostering a stable and motivated workforce—data shows that ESOP companies often experience lower turnover rates and greater employee satisfaction. \n\nTo connect with Village Labs or learn more, visit their website at [villagelabs.app](https://villagelabs.app). They are paving the way for a new business paradigm—one where employees are invested in their companies’ futures, creating a more equitable workplace for all.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/bf8ff183bd328a1be84b325d692717bf0ce4decc.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAFJSOQ65W%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192048Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELT%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDHe2krNA4Wz4ZdbboNJG%2B0zG6MmRspOJ5Kex%2FWuhFzDwIhAK4JNrLJx7V6Lp69aumcmLj570j2DR2Eh3hPcEuQGW3%2FKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgweLBjNRNugVRDPT8gqwgPiLGnMwjgQOiNH7FMTInTVKCCJLDe5fdDWlactIzRh2XOtRjauQZptst9ejdBs3vj590lIr07sFFKCWuGV%2B%2BJkmRqS%2BXBC6caH3J97%2FH7W3ch4kKAyKE3TuVCMVl%2BqNFww29jX%2BimNvDUNvCgQtjVE03FWSnfbJrDf3NUx8wttW6l2EC5fgOealDp0Ne7xA51qGtDKfIYSJUUyj6d2WgcNp66ilXSYF5HX3L4wid4xRepJ9Vt1krkNG6bsNoITqg8zMlLgZ7QT5uVwuoY%2Fhv%2F89O661Pa6%2FtGfz6gcZjx3JmkvJh2yaephzjfzpFg43OFS%2B3NnORgMbCqTEcn9piGJokbf9a5xoR2Qt8E4L2AdZTypzC0scYqz%2BA1CsQiK1RrvedAjSsaEw4%2FqFaR6rBrZ4SBiKqlmStv67nu5CMG6DF414F2WlGbkeS8C%2BJYZ2iky%2B19B0K9e4J7Tik78PRFNXoN8lSqP4k%2BLhdrqVq5b2d4m7UHeeProhr%2Fv5HV%2BORFSiFow%2Fhbxt6GN2P2YWxzdIHA32IkBqYD%2BeZ3eFOZSk%2B1Pldgq4PSaiU5lQlEewufIwxcnWXTzGkzSJ%2BLlLlzWX4EwrKPjvQY6pAEqZgWN8cooHP%2FeegIX6R3Pun8lUwrTM2csrvVF8K2udU7KUu1EoXzzxsupULfK9AN%2Bcef1HwWg3GN0hRmtduP9znDwqy7B09eErZHX3iCWPeVm7m2HUwQH0BM7NBnkw%2BBNh35scX3c4lMIghjRFyw9b8VEOGAbUjAxbgvLqemFdd8Zq7DGRWXDbhLqcGd2hHliZLchEjlQhzfD3wdeSwzTgvkJMw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=59689683c8d3ee0fc26cf4aa66277e2436bfab4b1d399e23946498e03c8eaf40",
    "social_links": [
        "https://www.linkedin.com/company/village-labs-coops"
    ],
    "logo_path": "data/logos\\Village_Labs_logo.png"
}