{
    "links": "https://www.ycombinator.com/companies/vinco",
    "name": "Vinco",
    "headline": "Retaining employees in LatAm via education",
    "batch": "S21",
    "description": "Vinco helps companies in Latin America pay for blue-collar employees’ online education. We do this by connecting employees to accessible programs (like High School, College, and Language Courses) and in turn, improve employee retention by at least 2x.",
    "activity_status": "Active",
    "website": "https://www.vincoed.com",
    "founded_date": 2021.0,
    "team_size": 35.0,
    "location": "Monterrey, Mexico",
    "group_partner": "Diana Hu",
    "group_partner_yc": "https://www.ycombinator.com/people/diana-hu",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:education; industry:marketplace; industry:saas",
    "founders": [
        {
            "name": "Lissy Giacoman, Founder",
            "description": "Lissy is CEO of Vinco, responsible for corporate matters, investor relations and overall company alignment. As a former BCG consultant, Lissy has experience in digital strategy, big data and analytics. Throughout her life, she has also taken on several teaching jobs. Currently, she teaches a Strategy course at the Tec de Monterrey. Although born and raised in Monterrey, Mexico, Lissy did her MBA at the MIT Sloan School of Management and her undergraduate degree in Economics at Yale University.",
            "linkedin": "https://www.linkedin.com/in/lissymgiacoman/"
        },
        {
            "name": "Miriam Fernandez, Founder",
            "description": "Miriam is co-founder and COO at Vinco, where she oversees academic and employer partnerships. Miriam is a graduate of Georgetown's School of Foreign Service. Hoya Saxa!",
            "linkedin": "https://www.linkedin.com/in/miriam-fernandezgg/"
        },
        {
            "name": "Sofia Sada, Founder",
            "description": null,
            "linkedin": "http://linkedin.com/in/sasegovs/"
        }
    ],
    "status": true,
    "generated_description": "### Vinco: Revolutionizing Employee Retention through Education\n\nFounded in 2021 and based in Monterrey, Mexico, **Vinco** is an innovative startup focused on a critical mission: enhancing employee retention through education across Latin America. It operates on a simple premise—if you invest in your employees' education, they’re more likely to stick around. And in fact, Vinco has shown that investment can more than double retention rates.\n\nOriginally, Vinco began by helping companies pay for the online education of their blue-collar workers. Through partnerships with accessible educational programs—ranging from high school diplomas to college degrees, language courses, and beyond—it creates pathways for employees to upskill. The outcome? A workforce that's both more educated and more engaged. This service targets the unique estuary of talent that’s crucial in today’s competitive market, especially amid the rising demand for skilled workers.\n\nVinco is proud to be a **BCorp Certified Company**, part of a global community that adheres to high standards of social and environmental impact. Being part of the Y Combinator Batch S21 also adds a layer of credibility, indicating their potential for growth and innovation.\n\nWith a team of 35 employees, Vinco is making waves. Their educational model doesn’t just benefit employees—the companies involved also gain. They see increased productivity and reduced turnover rates, thus getting a solid return on investment.\n\n#### Key Offerings:\n- **Diverse Educational Programs**: Employees can choose from over 5,000 programs—including secondary education, bachelor’s degrees, language training, and professional certifications.\n- **Custom Training**: Tailored training programs that meet the specific needs of both the employee and the employer.\n- **Financial Management**: Assistance with scholarships, payments, and benefits administration to ease the financial strain on companies while investing in their workforce.\n\n#### Trusted Partnerships\nVinco collaborates with notable companies like **Walmart, Oxxo, Metalsa,** and **DiDi**, indicating a broad endorsement from industry leaders. The effectiveness of their solution is underlined by impressive metrics: they have over a million employees enrolled, and their retention statistics speak volumes.\n\n#### The Vision Moving Forward\nVinco isn’t just about filling the gaps in education; they’re sculpting the future workforce. By harnessing the power of education, they position companies to not only keep their talent but also to elevate it. \n\nSo, if you're in a position of leadership at a company looking to enhance your workforce, it might be time to reach out to Vinco. After all, investing in education isn’t just good ethics; it’s good business.\n\nFor more details, visit [Vinco's website](https://www.vincoed.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/f912000fe73077f36762b6338f2ca2654e143fcd.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192050Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=f7cfe9aaf4c4b02a263bf3d6f3af59c9c5be5595e5b22eafaf02084b3f521047",
    "social_links": [
        "https://www.linkedin.com/company/vincoed",
        "https://twitter.com/vinco_ed",
        "https://www.facebook.com/vincoed"
    ],
    "logo_path": "data/logos\\Vinco_logo.png"
}