{
    "links": "https://www.ycombinator.com/companies/vitable-health",
    "name": "Vitable Health",
    "headline": "Affordable primary and urgent care health coverage",
    "batch": "S20",
    "description": "We're a team of engineers, clinicians, and operators redesigning how healthcare fundamentally works for the 80 million uninsured and under-insured Americans. We started with a simple vertically integrated primary and urgent care health plan through a network of nurse practitioners that come directly to members virtually or through in-home visits. We designed our plan to make high-quality concierge care accessible to everyone - from the Grammy winners that have used us to our uninsured members.\r\n\nWe're backed by world-class investors like First Round Capital, Y Combinator, Softbank along with incredible founders and operators with experience building and funding unicorns like Michael Seibel (YC, Twitch), Immad Akhund (Mercury), Allison Pickens (Gainsight), Jack Altman (Lattice), Dan Folkman (GoPuff) and others.",
    "activity_status": "Active",
    "website": "https://vitablehealth.com",
    "founded_date": 2020.0,
    "team_size": 28.0,
    "location": "Philadelphia, PA",
    "group_partner": "Aaron Epstein",
    "group_partner_yc": "https://www.ycombinator.com/people/aaron-epstein",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:digital-health; industry:healthcare; industry:health-insurance; industry:health-&-wellness",
    "founders": [
        {
            "name": "Joseph Kitonga, Founder",
            "description": "I grew up working at my parents' home health company interacting with their employees who couldn't afford the expensive health insurance plans that were offered, leaving them uninsured and over-utilizing the ER.\n\nI previously worked as a SWE intern at Microsoft on Xbox and studied Computer Engineering before dropping out and turning down my full-time offer to focus on Vitable with the Thiel Fellowship.",
            "linkedin": "https://www.linkedin.com/in/josephkitonga/"
        }
    ],
    "status": true,
    "generated_description": "**Vitable Health Overview**\n\nFounded in 2020 and part of the Y Combinator Batch S20, Vitable Health is a Philadelphia-based company aiming to transform healthcare for the 80 million uninsured and underinsured Americans. Their mission is straightforward: to provide affordable primary and urgent care through innovative health coverage. Their services focus on accessibility, offering a unique approach where nurse practitioners deliver care virtually or through in-home visits — an attempt to make high-quality, concierge-level healthcare accessible to everyone, from celebrities to the uninsured.\n\nThe company is backed by notable investors including First Round Capital, Y Combinator, and SoftBank, along with an impressive roster of advisors and founders who have previous successes in building and funding unicorn startups—figures like Michael Seibel from Twitch and Immad Akhund from Mercury.\n\n**What They Offer**\n\nVitable Health provides an enhanced primary care membership that covers a variety of services, such as:\n\n- **Direct Primary Care**\n- **Mental Health Services**\n- **Free Prescriptions** for over 1,000 medications\n- **Occupational Health**\n- **ACA Compliance Solutions**\n- **Cost Containment Solutions** for employers\n\nFor members, this means easy access to care without the hassle of high costs or long wait times. Their model emphasizes that $0 out-of-pocket expenses (no copays or deductibles) for visits makes healthcare both predictable and affordable.\n\n**User Experience**\n\nMembers appreciate the convenient healthcare access Vitable offers. What sets them apart is their commitment to a delightful experience. The company touts an impressive 4.8 average provider rating from its users, many of whom report that their once-overlooked health concerns are now promptly addressed.\n\nTheir platform allows members to schedule appointments easily, communicate with healthcare professionals in real time, and manage their health records all in one place. No one needs to travel or wait weeks for an appointment—significant time and stress savings.\n\n**Employer Benefits**\n\nVitable also caters to businesses by enhancing their existing healthcare strategies. Their flat and predictable monthly membership fees help employers manage costs while improving employee satisfaction and utilization—well above the industry average. They streamline administration, making it simple to manage enrollments and track usage.\n\n**Why It Matters**\n\nHealthcare is a pressing issue in the U.S., and Vitable Health is addressing this head-on with a unique model that prioritizes accessibility, affordability, and quality. By directly tackling the needs of the uninsured and underinsured, they aim to create a healthcare experience that may very well be the blueprint for future healthcare solutions.\n\nFor more information, check out their website: [Vitable Health](https://vitablehealth.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/0bf5bdcc01ac56c84e8e44ef26bcf6815c0bbb74.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192050Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=e4f30c755984c4706a625769d090fcfb5af8e96ded6c61ff110fdedd32eeb109",
    "social_links": [
        "https://www.linkedin.com/company/vitable-health",
        "https://twitter.com/vitablehealth"
    ],
    "logo_path": "data/logos\\Vitable_Health_logo.png"
}