{
    "links": "https://www.ycombinator.com/companies/voicepanel",
    "name": "Voicepanel",
    "headline": "Customer research on autopilot",
    "batch": "W24",
    "description": "We use AI to help product teams gather customer feedback over chat, voice, or video.",
    "activity_status": "Active",
    "website": "https://voicepanel.com",
    "founded_date": 2023.0,
    "team_size": 3.0,
    "location": null,
    "group_partner": "Pete Koomen",
    "group_partner_yc": "https://www.ycombinator.com/people/pete-koomen",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": null,
    "founders": [
        {
            "name": "Asa Schachar, Founder",
            "description": "Asa is the co-founder and CTO of Voicepanel (YC W24). Asa met his cofounder, John, while working at Optimizely, where they collectively led the creation of Optimizely’s fastest growing $40M developer-focused product. After Optimizely, Asa cofounded Level (YC S21), which was acquired by Vouch. At Vouch, Asa managed half of the engineering team. Asa’s engineering career started at Microsoft after graduating from Harvard with a degree in Applied Mathematics & Computer Science.",
            "linkedin": "https://linkedin.com/in/asaschachar"
        },
        {
            "name": "John Provine, Founder",
            "description": "John is the co-founder and CEO of Voicepanel (YC W24).  Prior to Voicepanel, John spent over a decade at Google working in product & engineering roles across Search, Ads, and Maps.  He also spent three years at Optimizely, where he led products for developers.  He holds a BA in Computer Science from Harvard and an MBA from Berkeley.",
            "linkedin": "https://linkedin.com/in/john-provine"
        }
    ],
    "status": true,
    "generated_description": "**Voicepanel: Customer Research on Autopilot**\n\nFounded in 2023 and part of Y Combinator Batch W24, Voicepanel is a fresh player in the field of customer feedback. Imagine a tool that automates customer research while using artificial intelligence to gather insights through chat, voice, or video conversations. That’s Voicepanel’s promise. \n\nWith a compact team of just three, located (insufficiently stated), and advised by mentor Pete Koomen, this startup is already making waves in how product teams approach customer research. Their mission? To streamline and simplify gathering valuable feedback, transforming chaotic data into actionable insights.\n\n**Key Features of Voicepanel:**\n\n- **Conversational Surveys:** Step away from tedious forms. Voicepanel offers dynamic, interactive surveys that can adapt in real-time, much like a conversation. This makes it easier to drill down into specific queries and gather richer data.\n  \n- **Built-in Recruiting:** You can recruit respondents via your app, email, or QR codes, tapping into a network of over 3 million consumers in more than 100 countries in a matter of minutes.\n\n- **Interactive Analysis:** Voicepanel doesn’t just collect data. It crunches through responses to deliver clear, thematic insights that are easy for your team to digest and act upon.\n\n- **Multi-Language Support:** This is huge for international businesses, providing automatic translations for surveys and responses in 29 different languages.\n\n- **Enterprise-Grade Security:** Keeping your data safe is crucial; Voicepanel is SOC 2 Type II compliant, ensuring a high standard of data protection.\n\nWith a simple onboarding process, Voicepanel makes it easy for teams to hit the ground running. Just state your objectives, invite respondents, and watch as the insights roll in without the fuss.\n\n**Why the Hype?**\n\nIn a world where product teams are often flooded with unstructured feedback, Voicepanel cuts through the noise by providing direct answers focused on what truly matters. Customers are already singing its praises, reporting not just time savings but profound improvements in understanding their target users.\n\nFor anyone looking to level up their customer research game, Voicepanel is worth a look. If you're interested in utilizing their platform, remember—starting is free, and impactful insights might just be a few clicks away. Check it out at [Voicepanel.com](https://voicepanel.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/88bfd3cbc3b3213223dcbe9255a54d1a7c10ad9a.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAFJSOQ65W%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192051Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELT%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDHe2krNA4Wz4ZdbboNJG%2B0zG6MmRspOJ5Kex%2FWuhFzDwIhAK4JNrLJx7V6Lp69aumcmLj570j2DR2Eh3hPcEuQGW3%2FKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgweLBjNRNugVRDPT8gqwgPiLGnMwjgQOiNH7FMTInTVKCCJLDe5fdDWlactIzRh2XOtRjauQZptst9ejdBs3vj590lIr07sFFKCWuGV%2B%2BJkmRqS%2BXBC6caH3J97%2FH7W3ch4kKAyKE3TuVCMVl%2BqNFww29jX%2BimNvDUNvCgQtjVE03FWSnfbJrDf3NUx8wttW6l2EC5fgOealDp0Ne7xA51qGtDKfIYSJUUyj6d2WgcNp66ilXSYF5HX3L4wid4xRepJ9Vt1krkNG6bsNoITqg8zMlLgZ7QT5uVwuoY%2Fhv%2F89O661Pa6%2FtGfz6gcZjx3JmkvJh2yaephzjfzpFg43OFS%2B3NnORgMbCqTEcn9piGJokbf9a5xoR2Qt8E4L2AdZTypzC0scYqz%2BA1CsQiK1RrvedAjSsaEw4%2FqFaR6rBrZ4SBiKqlmStv67nu5CMG6DF414F2WlGbkeS8C%2BJYZ2iky%2B19B0K9e4J7Tik78PRFNXoN8lSqP4k%2BLhdrqVq5b2d4m7UHeeProhr%2Fv5HV%2BORFSiFow%2Fhbxt6GN2P2YWxzdIHA32IkBqYD%2BeZ3eFOZSk%2B1Pldgq4PSaiU5lQlEewufIwxcnWXTzGkzSJ%2BLlLlzWX4EwrKPjvQY6pAEqZgWN8cooHP%2FeegIX6R3Pun8lUwrTM2csrvVF8K2udU7KUu1EoXzzxsupULfK9AN%2Bcef1HwWg3GN0hRmtduP9znDwqy7B09eErZHX3iCWPeVm7m2HUwQH0BM7NBnkw%2BBNh35scX3c4lMIghjRFyw9b8VEOGAbUjAxbgvLqemFdd8Zq7DGRWXDbhLqcGd2hHliZLchEjlQhzfD3wdeSwzTgvkJMw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=b3fc57392b54b124a7ee7a5f2789b76fff5882798d7ff02fa4cd6882031071b4",
    "social_links": [
        "https://www.linkedin.com/company/voicepanel",
        "https://twitter.com/voicepanel"
    ],
    "logo_path": "data/logos\\Voicepanel_logo.png"
}