{
    "links": "https://www.ycombinator.com/companies/volantio",
    "name": "Volantio",
    "headline": "Post-booking revenue and capacity optimization for airlinesâ\u0080¦",
    "batch": "W09",
    "description": "Volantio is a leader in travel technology software focused on revenue and capacity optimization for airlines.  \r\n\nBased in Atlanta, GA, Volantio partners with major airlines globally such as Qantas, Iberia, Alaska Airlines, Volaris, Jetstar Airways, Emirates, Ethiopian Airlines, Scoot-Tigerair, and others. \r\n\nThe companyâ\u0080\u0099s Yana platform enables airlines to generate incremental revenue and reduce operational costs, while putting greater predictability and control back into the hands of their customers.\r\n\nWe are backed by institutional and strategic investors from around the world including Ingleside Investors, JetBlue Technology Ventures, International Airlines Group (IAG), and Qantas Ventures.",
    "activity_status": "Active",
    "website": "http://www.volantio.com",
    "founded_date": null,
    "team_size": 19.0,
    "location": "Atlanta, GA",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:airlines",
    "founders": [],
    "status": true,
    "generated_description": "**Volantio: Revolutionizing Revenue and Capacity Optimization for Airlines**\n\nVolantio is at the forefront of travel technology, dedicated to improving post-booking revenue and capacity optimization for airlines. Founded during Y Combinator's W09 batch, this Atlanta-based company is making significant waves in the airline industry with its innovative solutions.  \n\n### Mission and Services  \nVolantio's mission is clear: empower airlines to harness greater revenue potential and manage capacity more effectively. Their flagship product, the Yana platform, provides airlines with the tools to generate incremental revenue while controlling operational costs. It enhances the customer experience by offering flexibility and predictability during and after the booking process.\n\n### Key Partnerships  \nVolantio collaborates with some of the biggest names in the airline industry, including Qantas, Iberia, Alaska Airlines, and Emirates. These partnerships not only validate Volantio's technology but also demonstrate its capability to tackle real-world challenges faced by airlines globally.\n\n### Innovative Solutions  \nVolantio offers two primary solutions:  \n1. **Recapture Revenue**: This solution allows airlines to leverage customer flexibility to dynamically increase service availability and capture extra demand.  \n2. **Resolve Overbooking**: Volantio helps manage both commercial and operational overbooking through its Confirmed Pre-Move solution, ensuring a better experience for customers and staff alike.\n\n### Impact and Recognition  \nWith over $60 billion in revenue analyzed each year and backed by renowned investors such as JetBlue Technology Ventures and Qantas Ventures, Volantio has proven its mettle. They’ve consistently delivered significant financial impact, as highlighted by client testimonials. Alaska Airlines, for instance, has experienced over $20 million in annual revenue impact from Volantio’s platform, showcasing the potential for scalability and efficiency that their technology offers.  \n\n### Conclusion  \nIn a world where customer experience and operational efficiency are paramount, Volantio is not just another tech company—it’s a transformative force in the airline industry. By intelligently applying AI to optimize revenue management, Volantio is turning flexibility into profit while enhancing services for customers. If you're looking to understand how data can reshape your business, take a closer look at what Volantio has to offer.\n\nFor more information, visit [Volantio's website](http://www.volantio.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/5cc0aaa9263280df2c88de38a34f53cacf02ae7b.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192052Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=eef7a4a632c6d2405e0ab8a0fcb2ddec5c4c9ed3667682d26717555641577d62",
    "social_links": [
        "https://twitter.com/volantio",
        "https://www.crunchbase.com/organization/adioso",
        "https://github.com/volantio"
    ],
    "logo_path": "data/logos\\Volantio_logo.png"
}