{
    "links": "https://www.ycombinator.com/companies/vouch",
    "name": "Vouch",
    "headline": "Insurance and risk management tools for startups and growth-stageâ\u0080¦",
    "batch": "S19",
    "description": "Insurance... sounds slow, old-fashioned, and unexciting. Exactly. Insurance is broken, and it's failing fast-moving, innovative startups.\r\n\nVouch is a new, technology-first insurance company backed with $185M in funding from world-class investors. Like Stripe for payments or Brex for credit cards, Vouch is creating the go-to business insurance for high-growth companies.\r\n\nWe're doing this by making insurance fast, responsive, and focused on our high-growth and innovative customers. Instead of printed PDF applications and week-long waits, Vouch is building new technology to solve real problems, writing policies that actually cover relevant startup scenarios, and designing simple experiences in an otherwise frustrating industry.",
    "activity_status": "Active",
    "website": "http://vouch.us",
    "founded_date": 2018.0,
    "team_size": 190.0,
    "location": "San Francisco",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:b2b; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Sam Hodges, Founder/CEO",
            "description": "Co-founder and CEO of Vouch, better business insurance for technology start-ups. Previously co-founder and MD of Funding Circle US (IPO in 2018, FCH.L), and various operating and investing roles focused on financial and insurance technology and B2B software. Live/work in SF.",
            "linkedin": "https://www.linkedin.com/in/samhodges/"
        }
    ],
    "status": true,
    "generated_description": "### Vouch: Innovating Insurance for Startups\n\nFounded in 2018 and backed by a hefty $185 million in funding, Vouch is on a mission to revolutionize the insurance landscape for startups and fast-growing companies. Operating out of San Francisco, this company emerged from Y Combinator's Batch S19 and has quickly positioned itself as a leader in tech-driven insurance solutions.\n\n**The Problem with Traditional Insurance**\n\nTraditional insurance is often cumbersome, bogged down by endless paperwork and extended wait times. For fast-moving startups, this antiquated model simply doesn't cut it. Vouch recognized this broken system and set out to create a streamlined alternative—think \"Stripe for payments\" or \"Brex for credit cards,\" but for insurance. \n\n**What Vouch Does Differently**\n\nVouch is focused on technology-first solutions that reduce friction in the insurance application process. Instead of lengthy PDF applications and unclear coverage, Vouch offers a seamless digital experience tailored specifically for the unique needs of high-growth startups. Their policies are designed to cover scenarios that matter, whether it's Cyber, AI, Directors & Officers, or General Liability insurance.\n\nThe company prides itself on being fast and responsive. With a dedicated team of around 190 employees, Vouch enables startups to activate their insurance online within minutes and provides access to exclusive coverages that you won’t find elsewhere.\n\n**Vouch's Innovative Solutions**\n\nVouch provides comprehensive insurance options suited to different stages of a startup's journey—whether you're in the nascent Seed stage or scaling to Series B and beyond. They offer specific coverages for various sectors like HealthTech, Fintech, AI, and Web3.\n\nOne of their standout offerings is AI Insurance, which addresses the unique risks associated with artificial intelligence products—an emerging area of concern as technology continues to advance.\n\n**A Customer-Centric Approach**\n\nWhat sets Vouch apart is their commitment to understanding customer needs. Their policy design is iterative, incorporating feedback directly from clients to refine and enhance coverage options. The company emphasizes direct communication without the traditional maze of intermediaries, ensuring that startups receive their policies and support directly from Vouch.\n\n**Awards and Recognition**\n\nVouch has not just disrupted the insurance sector; it has gained recognition as one of the best places to work, featured in lists like BuiltIn Best Places to Work and CB Insights Fintech 250.\n\n### Conclusion\n\nIn a world where insurance is often seen as boring or frustrating, Vouch stands out by bringing energy, innovation, and a tech-savvy approach to the table. By focusing on the needs of startups, they’re not just selling insurance—they're rethinking what it means to be protected as you build the future. For more information, head over to their website: [Vouch](http://vouch.us).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/6ea5d87ce7d36eda47144cc563cf3f0bd8f1c8a3.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192053Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=fd779b9c19e9499ab8e5cecea359756345734d913b995d4438f7baa1b4919895",
    "social_links": [
        "https://www.linkedin.com/company/20358430/",
        "https://twitter.com/vouch_group"
    ],
    "logo_path": "data/logos\\Vouch_logo.png"
}