{
    "Links": "https://www.ycombinator.com/companies/vovana",
    "Name": "Vovana",
    "Headline": "AI recruiter built for frontline hiring",
    "Batch": "W25",
    "Description": "Vovana is an AI recruiter designed specifically for frontline hiring. We leverage conversational AI to instantly engage and screen applicants via call or text, then autonomously schedule interviews with candidates who qualify.",
    "Activity_Status": "Active",
    "Website": "https://www.vovana.com/",
    "Founded_Date": "2024",
    "Team_Size": "3",
    "Location": "San Francisco",
    "Group_Partner_YC": "https://www.ycombinator.com/people/jared-friedman",
    "Group_Partner": "Jared Friedman",
    "Company_Linkedin": "https://www.linkedin.com/company/vovana/",
    "Company_Twitter": "",
    "Tags": "industry:saas; industry:b2b; industry:recruiting; location:san-francisco-bay-area",
    "social_links": [
        "https://www.linkedin.com/company/vovana/"
    ],
    "logo_path": "data\\logos\\Vovana.png",
    "Active_Founders": [
        {
            "Name": "Corey Anderson, Founder",
            "Description": "Founder and Head of Growth of Vovana. BS in Economics from UW-Madison. I built two startups by the time I was 22, worked in sales at Box and Datasite, and have also done frontline work as a pool attendant and countertop installer.",
            "LinkedIn": "https://www.linkedin.com/in/corey-anderson-3875a11aa/"
        },
        {
            "Name": "Cameron Hake, Founder",
            "Description": "Former tennis instructor, tutor, warehouse worker, food delivery driver, retail salesman, handyman, bartender, and most recently developer working on sonar systems for the Navy. Now I'm working on Vovana to help companies hire frontline workers.",
            "LinkedIn": "https://www.linkedin.com/in/cameron-hake-651062194/"
        },
        {
            "Name": "Charlie Maki, Founder",
            "Description": "Founder and CEO of Vovana. Prev: Cashier at Jerry’s Foods before earning a CS degree from Harvard and helping launch and scale Chorus to $1M ARR as a founding engineer.",
            "LinkedIn": "https://www.linkedin.com/in/charlie-maki-40543617a/"
        }
    ],
    "crawl_status": true,
    "generated_description": "**Vovana: Revolutionizing Frontline Hiring with AI**\n\nFounded in 2024 and part of Y Combinator's W25 batch, Vovana is an innovative player in the HR tech landscape, headquartered in San Francisco. With a nimble team of just three employees, the startup takes on a critical challenge: frontline hiring. \n\n**Mission and Product**  \nVovana is all about streamlining the recruitment process for businesses looking to fill frontline positions. They’ve harnessed the power of conversational AI to engage applicants swiftly—think phone calls and text messages that kick into gear as soon as someone applies. The AI not only screens candidates but also takes on the responsibility of scheduling interviews for those who make the cut. This is a game-changer for companies dealing with high volumes of entry-level roles, where speed and efficiency are paramount.\n\n**Operational Impact**  \nVovana's platform is designed to ease the burdens on recruiters and hiring managers. By automating initial screenings, they help organizations decrease their time-to-hire and reduce the administrative clutter associated with candidate management. Imagine cutting 20+ minutes off the typical screening process and slashing costs per hire by up to 50%. That’s not just efficient; it’s transformative for businesses eager to avoid the pitfalls of understaffing and high turnover rates.\n\n**Why It Matters**  \nIn an age where customer experience can make or break a business, Vovana positions itself as a critical ally in ensuring that frontline roles are filled quickly and effectively. The outcome? Well-staffed locations lead to enhanced customer interactions and better overall service.\n\nFor businesses intrigued by this novel approach to recruitment, Vovana offers a user-friendly interface, extensive support, and a 30-day money-back guarantee—a sign of confidence in their solution.\n\n**In a Nutshell**  \nVovana is not just an AI recruiting tool; it's a strategic partner for businesses facing the challenges of frontline hiring. It’s about making the hiring process faster, cheaper, and ultimately, more effective. If you're interested in putting your hiring on autopilot, you might want to check them out [here](https://www.vovana.com/)."
}