{
    "links": "https://www.ycombinator.com/companies/wand-solar",
    "name": "Wand Solar",
    "headline": "We enable landlords to generate income from solar panels.",
    "batch": "S22",
    "description": "Wand Solar enables Solar Revenue for Income Properties owners. By empowering landlords to sell solar energy directly to tenants, we make it a no-brainer for landlords to adopt solar energy.",
    "activity_status": "Active",
    "website": "https://www.wandsolar.com",
    "founded_date": 2023.0,
    "team_size": 2.0,
    "location": "Tel Aviv-Yafo, Israel",
    "group_partner": "Jared Friedman",
    "group_partner_yc": "https://www.ycombinator.com/people/jared-friedman",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:solar-power; industry:real-estate; industry:climate; industry:climatetech",
    "founders": [
        {
            "name": "Idan Shahar, Founder",
            "description": "I always operate at the forefront of technology, curious about Kubernetes, App Innovations, Cloud Native, and OSS technologies.\nI enjoy partnering with developers and C-level executives to realize the value of Cloud Native through, public speaking, communities, and hackathons.\nI've been a backend developer most of my life, and in the last few years, I helped companies build and modernize Cloud Native applications.",
            "linkedin": "https://www.linkedin.com/in/idan-shahar/"
        },
        {
            "name": "Itai Peri, Founder",
            "description": "I'm super passionate about entrepreneurship, and have been in this area for the past 6 years.\nI come from a background of Software Engineering and Machine Learning, and love to solve complex problems using these two disciplines.\nIn the past I've been CTO of a B2C startup, and as a Data Scientist in another startup led a project for identifying diseases in trees using advanced Computer Vision algorithms.\nNowadays I'm working to help companies better manage their delivery pipelines.",
            "linkedin": "https://www.linkedin.com/in/itayperry/"
        }
    ],
    "status": true,
    "generated_description": "### Wand Solar: Empowering Landlords through Solar Energy\n\n**Founded**: 2023  \n**Location**: Tel Aviv-Yafo, Israel  \n**Team**: 2 employees  \n**Y Combinator Batch**: S22  \n**Website**: [wandsolar.com](https://www.wandsolar.com)\n\nWand Solar is on a mission to help landlords monetize their solar investments by allowing them to sell solar energy directly to their tenants. The idea here is simple but powerful: by streamlining the solar billing process, Wand Solar transforms what can often be a complicated venture into a straightforward, income-generating opportunity for real estate property owners.\n\n#### The Concept\n\nAt its core, Wand Solar offers a platform that enables landlords of single-family and multi-family properties to easily integrate solar energy into their rental offerings. This approach not only adds a new revenue stream but also cultivates a more eco-conscious environment for tenants. By leveraging existing solar installations (or facilitating new ones), Wand Solar ensures that landlords can earn from the energy produced while keeping their tenants happy with potentially lower energy bills.\n\nIn a world where climate tech is becoming increasingly vital, Wand Solar positions itself within the broader context of real estate sustainability. The tagging of the company across categories like \"solar-power,\" \"real-estate,\" and \"climate\" reinforces its commitment to innovation in the renewable energy space.\n\n#### How It Works\n\n1. **Connection**: Landlords can connect their properties to the Wand Solar system without needing extra hardware. The platform smartly tracks tenant energy consumption to help landlords accurately bill them for solar energy used.\n   \n2. **Billing**: Wand Solar manages billing by generating a single, clear invoice that encompasses both energy sourced from the electricity provider and the solar panels installed.\n\n3. **Earnings**: This billing structure ensures that landlords can enjoy a consistent income from their solar investments while promoting fair practices—every tenant pays only for what they use.\n\nBy charging just a 10% fee on the bill charged to tenants for their solar energy use, Wand Solar maintains transparency while still incentivizing landlords to embrace the solar option.\n\n#### Impacting the Community\n\nBeyond the financial benefits, Wand Solar aims to create a community of rental owners who are invested in advancing solar energy adoption. They’ve particularly stood by the Californian solar industry amid recent policy changes, showcasing their commitment to supporting the broader solar landscape.\n\nTestimonials from landlords reveal real impacts: increased cap rates, monthly income boosts, and attracting eco-conscious tenants. It’s a win-win scenario—more income for landlords and a step toward reducing carbon footprints for tenants.\n\nIf you’re a landlord looking to blend your rental business with innovative climate tech, Wand Solar is your partner in solar success. You can explore this opportunity further by visiting their website or scheduling a call for personalized guidance.\n\n### Summary\n\nWand Solar is not just about solar panels; it’s about transforming properties into sustainable income sources. With straightforward billing and support for landlords, they statistically make the adoption of solar energy a no-brainer. Whether you're already equipped with solar panels or looking to install them, Wand Solar is ready to guide you toward maximizing your investment in a greener future.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/a1cde9a0ea5beabaae12fa4e9e74720731765e91.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192055Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=93d3bc80985cb29b67d8db99f889f878e4db29994a35244f3bd8b81cc91179c1",
    "social_links": [
        "https://www.linkedin.com/company/wandsolar/"
    ],
    "logo_path": "data/logos\\Wand_Solar_logo.png"
}