{
    "links": "https://www.ycombinator.com/companies/warpfy",
    "name": "Warpfy",
    "headline": "Building Shein of Home: tech-driven, design-mfr Home Lifestyle Brand",
    "batch": "S21",
    "description": "The Fine Living Company (Warpfy) is on a mission to revolutionize the $800B home and kitchen market, building a tech-enabled cross-border Home Lifestyle brand from India—think Shein for Home or Williams Sonoma. \r\nOur Design-to-Manufacture-to-Consumer model cuts out the middlemen, delivering high-quality products directly to consumers (D2C), through marketplaces, and via our proprietary B2B channel, The India Wholesale Company). \r\nWith a fragmented market where 70% is dominated by single-store boutiques and online penetration is just 20%, Home and Kitchen segment is ripe for disruption. India’s share of products has been minimal due to 60%+ value inflation from intermediaries. We’re changing that.\r\nOur full-stack approach: AI Copilot-driven product design, ERP for multi-channel distribution & manufacturer retention, and optimized supply chain—offers unparalleled speed & value.",
    "activity_status": "Active",
    "website": "https://warpfy.com/",
    "founded_date": 2021.0,
    "team_size": 3.0,
    "location": "Singapore, Singapore",
    "group_partner": "Harj Taggar",
    "group_partner_yc": "https://www.ycombinator.com/people/harj-taggar",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:artificial-intelligence; industry:marketplace; industry:e-commerce; industry:retail",
    "founders": [
        {
            "name": "Deepak Garg, Founder",
            "description": "I am an entrepreneurial business and technology executive, who loves to solve complex real-world problems. I believe in disruptive vision, inspirational people leadership, data-based approach, and love to roll up my sleeves to drive results. I helped found Wayfair Asia, building multi hundred million $ businesses, Ex Digital McKinsey Partner, have been an investor, founded a tech startup, amongst other things",
            "linkedin": "https://www.linkedin.com/in/deepak-garg-03675911/"
        },
        {
            "name": "Harris Cheng, Founder",
            "description": "Computer engineer who followed the traditional finance path (IB, PE)",
            "linkedin": "https://www.linkedin.com/in/harrischeng/"
        }
    ],
    "status": true,
    "generated_description": "**Warpfy: The Shein of Home**\n\nFounded in 2021 and hailing from Singapore, Warpfy is on a mission to reshape the $800 billion home and kitchen market with a tech-driven model that cuts out intermediaries. Think of them as the Shein or Williams Sonoma for home goods, but with a strong twist of Indian manufacturing flair. Initially known as The Fine Living Company, they aim to make “Made in India” not just a label, but a powerful global brand.\n\n### What's the Problem?\n\nThe home and kitchen sector is fragmented, with over 70% of it dominated by single-store boutiques and online shopping barely reaching 20% penetration. That leaves a massive opportunity for disruption, particularly when you consider that more than 60% of the product value is lost to middlemen. Warpfy's direct-to-consumer (D2C) approach, coupled with marketplace sales and their proprietary B2B channel—the India Wholesale Company—means consumers can access high-quality goods at better prices.\n\n### How Do They Operate?\n\nWarpfy employs a robust \"Design-to-Manufacture-to-Consumer\" model. They use AI to streamline product design, manage enterprise resources for multi-channel distribution, and optimize the supply chain to deliver exceptional speed and value. This full-stack approach allows them to launch new products quickly, boasting an impressive 80% success rate for new releases, with 25% leading to significant scaling.\n\n### Their Product Range\n\nThe company offers a diverse array of products within the home and kitchen realm—everything from organizers and kitchen essentials to home decor and bath organizers. Each product is thoughtfully designed, merging innovation with functionality, ensuring that customers get impeccable quality and durability.\n\n### Industry Position & Future Plans\n\nWarpfy is strategically positioned to tap into lucrative markets such as the USA, Canada, and the UK, establishing offices across various regions. This global outreach is supported by in-house design capabilities and expertise in cross-border trade, allowing them to sidestep traditional dealer networks and deliver directly to consumers.\n\n### The Team and Vision\n\nOperating with a compact team of three and supported by Y Combinator (Batch S21), Warpfy's vision is clear: to make a significant mark in the home lifestyle sector, transforming it with technology and streamlined processes. They are backed by investors who believe in their journey, including notable names in the startup ecosystem.\n\n### Conclusion\n\nWarpfy is poised to disrupt the home goods market in a big way. With a compelling value proposition that merges quality with affordability—without the clutter of middlemen—they're crafting a new narrative for Indian products on the global stage. If you're looking for stylish, functional home solutions, Warpfy is definitely a name to keep an eye on.\n\nFor more information, check them out at [Warpfy](https://warpfy.com/).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/24d184dc6d1ecb82efd30ef0f71d69bf9f470bec.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAFJSOQ65W%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192055Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELT%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDHe2krNA4Wz4ZdbboNJG%2B0zG6MmRspOJ5Kex%2FWuhFzDwIhAK4JNrLJx7V6Lp69aumcmLj570j2DR2Eh3hPcEuQGW3%2FKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgweLBjNRNugVRDPT8gqwgPiLGnMwjgQOiNH7FMTInTVKCCJLDe5fdDWlactIzRh2XOtRjauQZptst9ejdBs3vj590lIr07sFFKCWuGV%2B%2BJkmRqS%2BXBC6caH3J97%2FH7W3ch4kKAyKE3TuVCMVl%2BqNFww29jX%2BimNvDUNvCgQtjVE03FWSnfbJrDf3NUx8wttW6l2EC5fgOealDp0Ne7xA51qGtDKfIYSJUUyj6d2WgcNp66ilXSYF5HX3L4wid4xRepJ9Vt1krkNG6bsNoITqg8zMlLgZ7QT5uVwuoY%2Fhv%2F89O661Pa6%2FtGfz6gcZjx3JmkvJh2yaephzjfzpFg43OFS%2B3NnORgMbCqTEcn9piGJokbf9a5xoR2Qt8E4L2AdZTypzC0scYqz%2BA1CsQiK1RrvedAjSsaEw4%2FqFaR6rBrZ4SBiKqlmStv67nu5CMG6DF414F2WlGbkeS8C%2BJYZ2iky%2B19B0K9e4J7Tik78PRFNXoN8lSqP4k%2BLhdrqVq5b2d4m7UHeeProhr%2Fv5HV%2BORFSiFow%2Fhbxt6GN2P2YWxzdIHA32IkBqYD%2BeZ3eFOZSk%2B1Pldgq4PSaiU5lQlEewufIwxcnWXTzGkzSJ%2BLlLlzWX4EwrKPjvQY6pAEqZgWN8cooHP%2FeegIX6R3Pun8lUwrTM2csrvVF8K2udU7KUu1EoXzzxsupULfK9AN%2Bcef1HwWg3GN0hRmtduP9znDwqy7B09eErZHX3iCWPeVm7m2HUwQH0BM7NBnkw%2BBNh35scX3c4lMIghjRFyw9b8VEOGAbUjAxbgvLqemFdd8Zq7DGRWXDbhLqcGd2hHliZLchEjlQhzfD3wdeSwzTgvkJMw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=372afbd9930df3c8b37d3f38b390e8b277195f80ac6df048d9b6efa9a3a52e9d",
    "social_links": [
        "https://www.linkedin.com/company/warpfy/?viewAsMember=true",
        "https://www.facebook.com/Warpfy-102286585414161"
    ],
    "logo_path": "data/logos\\Warpfy_logo.png"
}