{
    "links": "https://www.ycombinator.com/companies/wasmer",
    "name": "Wasmer",
    "headline": "The Operating System for Edge Computing",
    "batch": "S19",
    "description": "We are working on the software that will power the next generation of Cloud Computing (Edge Computing) platforms using WebAssembly.\r\n\nYou can see us as a mix between Docker (but 100x more performant in startup time, and with 100x more lightweight containers), npm (we released the first WebAssembly package manager: wapm.io) and the JVM (but more universal).",
    "activity_status": "Active",
    "website": "https://wasmer.io",
    "founded_date": 2019.0,
    "team_size": 11.0,
    "location": "San Francisco",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:developer-tools; industry:open-source; location:san-francisco-bay-area",
    "founders": [],
    "status": true,
    "generated_description": "### Wasmer: A New Paradigm in Edge Computing\n\nFounded in 2019 and part of Y Combinator's Summer 2019 batch, Wasmer is carving out a space as a key player in the rapidly evolving world of edge computing. Located in the heart of San Francisco, this focused team of 11 is driven by a singular mission: to create \"The Operating System for Edge Computing.\" \n\n### What is Wasmer?\n\nAt its core, Wasmer combines the best aspects of Docker, npm, and the JVM—but does so with a twist. It promises developers a significantly faster and lighter alternative for running applications, boasting startup times that are 100 times faster and containers that are equally lightweight. Essentially, Wasmer utilizes WebAssembly (Wasm) to build a runtime that enables applications to run securely and performantly across diverse environments, be it locally or in the cloud.\n\n### Key Features\n\n1. **Performance**: Wasmer's runtime enables applications to start in mere milliseconds, which is a game-changer for scenarios that demand quick responsiveness. Users can expect 15 times the speed and 20 times the cost efficiency compared to traditional solutions.\n  \n2. **Universal Deployment**: Whether you're working on web servers, mobile devices, or embedded systems, Wasmer lets you deploy applications without having to tweak the code. It's designed to integrate seamlessly with any framework.\n\n3. **Security**: By leveraging WebAssembly's built-in virtualization, Wasmer ensures applications are sandboxed and secure against vulnerabilities, making it an attractive choice for developers prioritizing safety.\n\n4. **Ease of Use**: With the release of the first WebAssembly package manager, Wapm, developers can easily deploy applications and scale them effortlessly to handle traffic without overpaying for resources.\n\n5. **Community and Support**: Wasmer isn't just building technology; it's fostering a community of over 20,000 users who have already begun to explore its capabilities. With an active Discord and GitHub presence, support and collaboration are just a click away.\n\n### Use Cases\n\nWasmer’s versatile capabilities open the door for numerous applications:\n- **WordPress Hosting**: Deploy traditional CMS solutions with unprecedented speed.\n- **Static Site Hosting**: Served with dynamic performance.\n- **AI & Game Development**: Innovative developers can harness Wasmer to create cutting-edge applications in real time.\n\n### Conclusion\n\nIn an era where the power of edge computing can mean the difference between success and obscurity, Wasmer stands out as a compelling solution for developers. With its ability to run applications anywhere, its focus on performance, and an active community behind it, Wasmer is poised to redefine how we think about application deployment and scaling in the modern software landscape. Interested developers can visit [Wasmer.io](https://wasmer.io) to dive deeper into their offerings.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/59c74247cb2ada856127415ac31e3ac272ea4bca.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192056Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=38fbcef1fb6e0ce2c5812d38f96fbde1e68abe05f9d9fc76b8b96ad5d72eac73",
    "social_links": [
        "https://twitter.com/wasmerio",
        "https://www.crunchbase.com/organization/wasmer",
        "https://github.com/wasmerio"
    ],
    "logo_path": "data/logos\\Wasmer_logo.png"
}