{
    "links": "https://www.ycombinator.com/companies/wasp",
    "name": "Wasp",
    "headline": "Configuration language for building enterprise web apps 10x faster",
    "batch": "W21",
    "description": "Wasp is a simple configuration language for building enterprise web apps with less code and best practices. If a developer wants to build an app like Instacart, they need to know a dozen different technologies and how to make them work together - Wasp solves this problem while still letting developers use React, Node.js and their other favourite tools.\r\n\nWe will enable enterprises to build modern apps quickly at scale, like Databricks did for data management.",
    "activity_status": "Active",
    "website": "https://wasp-lang.dev/",
    "founded_date": 2020.0,
    "team_size": 2.0,
    "location": "Zagreb, Croatia",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:developer-tools; industry:open-source",
    "founders": [
        {
            "name": "Matija Šošić, Founder",
            "description": "Comp Sci MSc & Software Engineer.\nI am excited about clean code, functional programming, web dev, building teams and useful products. In my free time I enjoy calisthenics and photography.\n\nExperience:\n- led engineering team at Lifebit Biotech\n- Techstars Tech Associate (London), cohort of 2017\n- CEO & Co-founder @ TalkBook (https://talkbook.co/home)\n- Noom, New York - SWE internship (2014)\n- A*Star, Bioinformatics institute Singapore - research internship (2011)",
            "linkedin": "https://www.linkedin.com/in/matijasosic"
        },
        {
            "name": "Martin Sosic, Founder",
            "description": "Software engineer, computer scientist (M.Sc.) and entrepreneur.\nI am excited about building a product, open source, functional programming, web development, clean code, customer development.\nEx algorithmic competitor, SWE intern at Google, Palantir and Bioinformatic Institute (Singapore), author of Edlib library, dev associate at Techstars 2017, founder of Talkbook (startup), led engineering team at Lifebit.ai.\nI love mechanical keyboards, emacs, calisthenics and playing instruments.",
            "linkedin": "https://www.linkedin.com/in/martinsosic"
        }
    ],
    "status": true,
    "generated_description": "### Wasp: Building Enterprise Apps at Lightning Speed\n\n**Overview of Wasp**\n\nFounded in 2020 and part of Y Combinator's W21 batch, Wasp is a developer-focused company based in Zagreb, Croatia. Their mission? To enable developers to create sophisticated enterprise web applications **10 times faster** than traditional methods. By minimizing boilerplate and providing a simple configuration language, Wasp allows developers to focus on writing the essential code while leveraging tools like React, Node.js, and Prisma. Think of it as a Rails-like framework for modern web apps.\n\n**The Problem Wasp Solves**\n\nDevelopers often face the daunting task of mastering several technologies to build a web app, which can be frustrating and time-consuming. Wasp elegantly bridges this gap, offering a streamlined approach to application development. With Wasp, you don’t need to juggle multiple technologies; rather, you can write your app using a single `.wasp` file that clearly outlines your app’s structure and functionality.\n\n**What Makes Wasp Unique?**\n\n1. **Configuration Language**: Wasp employs a simple configuration syntax, allowing developers to define their application's core components without delving into excessive coding.\n   \n2. **Full-stack Framework**: It combines the power of popular frameworks like React for the frontend and Node.js for the backend while managing the complexities of deployment with ease.\n\n3. **Open Source**: Wasp is fully open-source, encouraging developers to contribute and collaborate on enhancing its features. This accessibility and community-driven approach foster innovation.\n\n4. **Type Safety**: It integrates seamlessly with TypeScript, ensuring type safety throughout your application. This means fewer runtime errors, leading to more robust applications.\n\n5. **Rapid Development**: Developers can launch an entire app in just a day and make production deployments with a single command using a straightforward CLI.\n\n**Current Features**\n\nWasp supports a plethora of functionalities that simplify the development lifecycle:\n\n- **Authentication**: Built-in full-stack authentication options with various methods (Google, GitHub, email).\n- **Data Management**: A typesafe RPC layer that connects client-server logic directly, eliminating tedious backend calls.\n- **Job Scheduling**: Tools for defining and running scheduled tasks on the server.\n- **Custom Deployments**: Wasp's CLI helpers guide users through deploying applications to popular platforms.\n\n**The Road Ahead**\n\nWasp is continually evolving, with a solid roadmap that includes improvements like expanding Prisma support, introducing more social authentication options, and adding support for server-side rendering (SSR). The founders are laser-focused on making Wasp an invaluable tool for developers.\n\n**Community and Resources**\n\nYou can find even more about Wasp through their [website](https://wasp-lang.dev/), or join their community on [Discord](https://wasp-lang.dev/</discord>) to connect with fellow developers. The platform has garnered attention for its ease of use—some users have managed to launch full-stack applications over a weekend!\n\n**In Conclusion**\n\nWasp isn't just another development tool; it's a game changer for enterprise application development. By simplifying the process and providing robust capabilities, it allows developers to turn ideas into reality faster than ever. If you’re looking to build quickly while maintaining best practices, Wasp is definitely worth a look.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/77e2ad6b134fb971cf1dff96770a7007d831457d.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAFJSOQ65W%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192055Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELT%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDHe2krNA4Wz4ZdbboNJG%2B0zG6MmRspOJ5Kex%2FWuhFzDwIhAK4JNrLJx7V6Lp69aumcmLj570j2DR2Eh3hPcEuQGW3%2FKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgweLBjNRNugVRDPT8gqwgPiLGnMwjgQOiNH7FMTInTVKCCJLDe5fdDWlactIzRh2XOtRjauQZptst9ejdBs3vj590lIr07sFFKCWuGV%2B%2BJkmRqS%2BXBC6caH3J97%2FH7W3ch4kKAyKE3TuVCMVl%2BqNFww29jX%2BimNvDUNvCgQtjVE03FWSnfbJrDf3NUx8wttW6l2EC5fgOealDp0Ne7xA51qGtDKfIYSJUUyj6d2WgcNp66ilXSYF5HX3L4wid4xRepJ9Vt1krkNG6bsNoITqg8zMlLgZ7QT5uVwuoY%2Fhv%2F89O661Pa6%2FtGfz6gcZjx3JmkvJh2yaephzjfzpFg43OFS%2B3NnORgMbCqTEcn9piGJokbf9a5xoR2Qt8E4L2AdZTypzC0scYqz%2BA1CsQiK1RrvedAjSsaEw4%2FqFaR6rBrZ4SBiKqlmStv67nu5CMG6DF414F2WlGbkeS8C%2BJYZ2iky%2B19B0K9e4J7Tik78PRFNXoN8lSqP4k%2BLhdrqVq5b2d4m7UHeeProhr%2Fv5HV%2BORFSiFow%2Fhbxt6GN2P2YWxzdIHA32IkBqYD%2BeZ3eFOZSk%2B1Pldgq4PSaiU5lQlEewufIwxcnWXTzGkzSJ%2BLlLlzWX4EwrKPjvQY6pAEqZgWN8cooHP%2FeegIX6R3Pun8lUwrTM2csrvVF8K2udU7KUu1EoXzzxsupULfK9AN%2Bcef1HwWg3GN0hRmtduP9znDwqy7B09eErZHX3iCWPeVm7m2HUwQH0BM7NBnkw%2BBNh35scX3c4lMIghjRFyw9b8VEOGAbUjAxbgvLqemFdd8Zq7DGRWXDbhLqcGd2hHliZLchEjlQhzfD3wdeSwzTgvkJMw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=72085579e42d201d6562c12bf14de489204818a9a67a7463f96df587e5370b95",
    "social_links": [
        "https://www.linkedin.com/company/71519348",
        "https://twitter.com/wasplang",
        "https://github.com/wasp-lang"
    ],
    "logo_path": "data/logos\\Wasp_logo.png"
}