{
    "links": "https://www.ycombinator.com/companies/waterplan",
    "name": "Waterplan",
    "headline": "Water risk mitigation for industrial sites",
    "batch": "S21",
    "description": "Waterplan is the world’s leading climate platform to measure, respond, report, and monitor companies increasingly changing climate water risk. Customers include multinational companies like Coca-Cola, Diageo, Colgate & Ab InBev. The platform combines companies’ operational data with local water satellite imagery to provide a continuously updated financial assessment of water risk. Based on that, it offers tailored mitigation and adaptation opportunities, from conventional infrastructure to nature-based solutions. The company was founded by a team of tech and water 2nd-time entrepreneurs with two exits and almost ten years of experience working for Fortune 500 companies in water projects. Early investors include YCombinator, Giant Ventures, David Helgason, Leonardo DiCaprio, Richard Branson's family, Manu Ginobili, among others waterplan.com",
    "activity_status": "Active",
    "website": "http://waterplan.com",
    "founded_date": 2020.0,
    "team_size": 30.0,
    "location": "San Francisco",
    "group_partner": "Nicolas Dessaigne",
    "group_partner_yc": "https://www.ycombinator.com/people/nicolas-dessaigne",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:machine-learning; industry:saas; industry:b2b; industry:climate; industry:climatetech; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Jose Ignacio Galindo, Founder",
            "description": "Jose Ignacio is co-founder & CEO of Waterplan, helping orgs tackle water risk. Born in Patagonia’s Ushuaia, he’s a second-time founder with a background in software engineering. Before Waterplan, he co-founded Herolens (acquired by Innovid, NYSE: CTV) and was CSO at Wolox (now Accenture).",
            "linkedin": "https://www.linkedin.com/in/joseignaciosg/"
        },
        {
            "name": "Nicolas Wertheimer, Founder",
            "description": "New on the tech world. Medical doctor and social water entrepreneur for almost 10 years. Founder of Proyecto Agua Segura (Safe Water), a Latin American consulting firm that provides safe water access & hygiene training to more than 300k people and delivered 3260 water projects with Fortune 500 companies. Global Shaper of the World Economic Forum, member of the Youth Congress for Sustainable Americas, Forbes 30 under 30, Chivas Venture Finalist.",
            "linkedin": "https://www.linkedin.com/in/nicolas-wertheimer/"
        }
    ],
    "status": true,
    "generated_description": "**Waterplan Overview:**\n\nFounded in 2021 and based in San Francisco, Waterplan is at the forefront of water risk management for industrial sites. The company addresses one of the most pressing challenges of our time—how to mitigate water risk as climate change continues to affect water availability across the globe. As a participant in Y Combinator's Batch S21, Waterplan has quickly established itself as a leader in this niche. \n\n**Mission and Services:**\n\nWaterplan's mission revolves around providing organizations with the tools they need to measure, respond to, and report water risks. Its platform harnesses advanced AI to combine operational data from companies with real-time water satellite imagery. This powerful data combination offers clients—ranging from Coca-Cola to Diageo—a thorough, constantly updated view of their water risk, allowing for informed decision-making.\n\nThe service portfolio is robust and focuses on three core areas:\n1. **Measure**: Delivering high-quality, site-specific water risk data that helps businesses understand their localized water challenges.\n2. **Report**: Streamlining water reporting processes to align with major disclosure frameworks like ESRS, CDP, and GRI, ensuring compliance while saving time.\n3. **Respond**: Identifying and tracking risk mitigation opportunities. This includes guiding companies in adapting to their water-related commitments through both infrastructure and nature-based solutions.\n\n**Team and Expertise:**\n\nWaterplan’s team comprises seasoned tech and water entrepreneurs, many of whom have previous successes in the water sector and are dedicated to helping companies navigate their sustainability journeys. The company employs around 30 people, and their expertise is complemented by early support from high-profile investors including Y Combinator, Richard Branson's family, and actor Leonardo DiCaprio.\n\n**Key Features:**\n\n- **Granular Data Availability**: Unlike traditional data sources that can be broad and generalized, Waterplan provides detailed, localized water risk data, enabling companies to avoid the pitfalls of relying on inaccurate information.\n- **Automated Reporting**: The platform simplifies the complex landscape of water reporting, allowing clients to focus on taking action against water risks rather than getting lost in data collection.\n- **Collaboration and Support**: By facilitating collaboration between companies and local water initiatives, Waterplan ensures continuous improvement toward sustainability goals.\n\n**Conclusion:**\n\nIn essence, Waterplan stands out as a crucial partner for any organization looking to secure its future in a world where water risk is increasingly difficult to predict and manage. Their thoughtful application of technology and expert insights empowers companies to not only mitigate risk but also actively engage in corporate sustainability efforts. Want to know more? Check them out at [waterplan.com](http://waterplan.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/006dd7cdadb6bc016467873d434e5389801939a8.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192056Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=ac5e97e628c54e3da6a2ca818de4a17e3505d523b00152953fc201a466341553",
    "social_links": [
        "https://www.linkedin.com/company/waterplan-ai",
        "https://twitter.com/WeAreWaterplan",
        "https://www.crunchbase.com/organization/waterplan"
    ],
    "logo_path": "data/logos\\Waterplan_logo.png"
}