{
    "links": "https://www.ycombinator.com/companies/wattson-health",
    "name": "Wattson Health",
    "headline": "Software for pharmacies to manage RXs and automate manual workflows",
    "batch": "S23",
    "description": "Medication errors cost the healthcare industry $40 billion each year, the largest contributor being the manual processes employed by pharmacies. Wattson Health's automation platform integrates with pharmacies' existing systems and enables them to fill prescriptions error-free in a matter of seconds vs. hours or even days.",
    "activity_status": "Active",
    "website": "https://www.wattsonhealth.com",
    "founded_date": 2023.0,
    "team_size": 3.0,
    "location": null,
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": null,
    "founders": [
        {
            "name": "Justin Spitz, Founder",
            "description": "Justin is currently the CEO & co-founder of Wattson Health (YC S23). Previous work includes Head of Ops @ Maximus, Strategy @ Google, & Analytics @ Dropbox. Outside the office, he's an avid swimmer, basketball fanatic, fantasy football commissioner, points & miles enthusiast, & spicy food addict.",
            "linkedin": "https://linkedin.com/in/justin-spitz"
        },
        {
            "name": "Cleophus Robinson IV, Founder",
            "description": "Cleo is currently the CTO & co-founder of Wattson Health (YC S23). Previously worked at YouTube driving engagement and satisfaction metrics for key emerging markets, shorts and gen z. At L3 he created a new driver framework for controlling devices on naval vessels. Outside of work, he enjoys being competitive in sports and games; traveling, cooking, concerts and creating music.",
            "linkedin": "https://linkedin.com/in/cleor41"
        }
    ],
    "status": true,
    "generated_description": "**Wattson Health: Revolutionizing Pharmacy Automation**\n\nFounded in 2023, Wattson Health is a fresh player in the healthcare tech arena, born from the startling statistic that medication errors cost the industry a whopping $40 billion annually. The culprit? Manual processes in pharmacies. To tackle this, Wattson Health has developed an automation platform that seamlessly integrates with existing pharmacy systems to process prescriptions in seconds, eliminating human error and significantly slashing wait times.\n\nImagine going from hours or even days of prescription management to a smooth operation that takes moments—this is what Wattson Health promises. Their AI-driven technology automates essential pharmacy tasks like refills, adherence tracking, and transfers while sounding like your friendly neighborhood pharmacist—no robotic monotone here. The goal is straightforward: reduce phone calls to pharmacies and free up staff to focus on patient care.\n\nBacked by Y Combinator in its S23 Batch, Wattson Health operates with a lean team of just three employees, all committed to making pharmacy workflows more efficient. Their innovative AI voice agents not only handle repetitive tasks but also glean insights into patient needs, offering features like clear call summaries, easy access to conversation history, and intuitive analytics.\n\nWhat sets Wattson apart? They offer customizable workflows tailored specifically to each pharmacy’s unique challenges, allowing for swift integration that can happen in days rather than weeks. Compliance is also a priority; their systems ensure HIPAA standards are met, protecting patient information.\n\nFor those intrigued by the idea of streamlining pharmacy processes, Wattson Health invites you to book a demo on their website at [wattsonhealth.com](https://www.wattsonhealth.com). With this bold venture, Wattson Health is not just automating workflows; it's paving the way for a smarter, error-free pharmacy experience.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/f37a087883e6459b8ba650f4396847a48fcbe36a.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAJMV6TLGB%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192056Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFLa1ybFb1MW3YWarl6N2DZLtQ4R6h64JtRzg2nxAowaAiB3nTk9Wj2wgaQBuQdmXKSYUK01s%2FfzNcIsI%2FpnnVYrDCruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMbK4eHGyZbeOmKiEOKsIDEgeFqYzoIm9WYPES%2BanLfTcQEGyzIks%2Fal2Lmqxe4p56ewXYsETQE6xKLCXrmvzZNyUDpx5dtkyRoWAO6FYyXXGaPQzEZ3lyFdj%2BxmzYPjn73zyfO0POWT06n60Ss4FWi%2BsXTCqzCDlztmj5P3pe%2BccFf3AJ6Fob0iUEcgWZg86XqS2niw4lXPnalb%2Boq3NuXvHl2oVLzjcW3kqbNIZD4bJeuP%2BaiX3YtJ%2BJXjqRV4JMYzbegC89ld8%2FQ6Niu9GP6iWyA3Ij%2Frc6v9eF94GLnVFmDUIq%2FgOldm3US8WLOYW64cbfEYgRv4%2BZqFOZik7gMqvr0%2BAMO66zctStkeS7pQEndome2HMXzolZnAHIKHa7syJwRucmMBn1qLVqGHDFwDTWD66ZqASdClXaJEb6qKYFGBQM0HPz9IZYPkFD7FlZyifcWNrFEjlM4LJiyAQcunx30b5EMcz8oT7YjYIo5Bb2DOsnIt6uAdkOmUPUmY%2FzM3PmuL6ZYePw7XBzfBYcfiNqZPHWFO6x0%2FmP5sl5TFTspcBFiC1tU5q9L40pvlUpeAHA0lByHoziRM9b9aIUnBzO8cEmGGLYvEv9AlDEIduUMLKL470GOqYBeuzvU%2B1K1xvzamOk1TaDeko%2BJlQ8xUgcguCKvnE%2BpYSn9MQz0SIXrm4hUrSnIO%2FjFoTZ4esBSlXTCkXH%2F6%2BRHttOAoEAfv1XQWO8%2Bsv2qVS97SrODEBLVhY1tfEFQcw%2BZ93GUo5LYHe1U2PubGkf9wTLJ5AZCq5Vr1%2FKLwVlulVfHEhtz4E3fzOL1TPO7tIclZor0kZmzjAwtkky7VHrQVXehNV3Gw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=04278f8a233e07ac2a4b06a250e3f50ee2e1121d5628f915f1b5c29a13b18e2f",
    "social_links": [
        "https://www.linkedin.com/company/wattson-health/",
        "https://twitter.com/wattsonhealth"
    ],
    "logo_path": "data/logos\\Wattson_Health_logo.png"
}