{
    "links": "https://www.ycombinator.com/companies/waypoint-transit",
    "name": "Waypoint Transit",
    "headline": "We automate urban planning so cities can build cheaper and faster.",
    "batch": "W25",
    "description": "Waypoint Transit is an AI transportation planning consultant that generates technical studies and reports for municipal agencies. With Waypoint, cities can generate higher-quality reports faster, and at lower cost, reducing timelines from years to months.\r\n\nVarun and Ryan met at Stanford, where they graduated with degrees in CS and EE respectively. Before founding Waypoint, Varun worked on AI at Microsoft and Ryan worked on chip design at Apple.\r\n\nUS cities are facing three major crises: congestion, budget deficits, and climate change. At the same time, city governments are understaffed and frequently need to contract work out to expensive consultants. Leveraging recent advancements in AI, we empower cities to reduce their costs, build infrastructure, and respond to problems quickly.\r\n\nIn the United States, state and local governments spend $170B on transportation capital projects, with an estimated 10-15% of that cost going to planning and consultants. This represents an ~$20B market opportunity in the US alone. Through automation, we can redefine the existing transportation and urban planning consulting markets.\r\n\nFor more information, visit waypointtransit.com or contact us at contact@waypointtransit.com.",
    "activity_status": "Active",
    "website": "https://waypointtransit.com",
    "founded_date": 2024.0,
    "team_size": 2.0,
    "location": "San Francisco",
    "group_partner": "Brad Flora",
    "group_partner_yc": "https://www.ycombinator.com/people/brad-flora",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:artificial-intelligence; industry:govtech; industry:construction; industry:climate; industry:transportation; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Ryan Johnston, Founder",
            "description": "Co-founder and CTO of Waypoint Transit. Previously, chip design synthesis CAD at Apple. Then developed novel real-time transit signage for his hometown; this project eventually became Waypoint. \n\nB.S. and M.S. in Electrical Engineering from Stanford University.",
            "linkedin": "https://www.linkedin.com/in/ryan-johnston-b919a7180/"
        },
        {
            "name": "Varun Tandon, Founder",
            "description": "Co-founder and CEO of Waypoint Transit. Previously, led applied ML initiatives at Microsoft. Worked on diffusion models and LLM/LMMs for flagship Office products, including Copilot, Designer, and PowerPoint.\n\nB.S. and M.S. in Computer Science from Stanford University.",
            "linkedin": "https://www.linkedin.com/in/vrntandon/"
        }
    ],
    "status": true,
    "generated_description": "Waypoint Transit is an innovative startup on a mission to streamline urban planning. Founded in 2024 and part of Y Combinator’s Batch W25, the company seeks to help cities build infrastructure more efficiently and cost-effectively by automating the planning processes. With a focus on tackling the pressing challenges of urban congestion, budget deficits, and climate change, Waypoint Transit stands out as an AI-driven transportation planning consultant. \n\nThe founders, Varun and Ryan, both Stanford graduates, come from impressive backgrounds: Varun specialized in AI at Microsoft and Ryan in chip design at Apple. Their combined expertise allows Waypoint Transit to generate high-quality technical reports and studies for municipal agencies faster—reducing the timeline from years to mere months—while also slashing costs.\n\nIn the U.S., state and local governments spend a staggering $170 billion on transportation capital projects each year, with a notable 10-15% of that allocated to planning and consultancy fees. This creates a significant market opportunity—roughly $20 billion—ripe for disruption. Waypoint's automation-driven approach not only streamlines the consulting market but also empowers governments to respond swiftly to urban planning issues, improving overall service delivery.\n\nThe company, headquartered in San Francisco and currently consisting of a lean team of two, is making strides in offering various types of studies—including active transportation plans, corridor studies, and bus stop improvement plans. They're open to new opportunities and eager to explore how they can assist municipalities across the U.S.\n\nIf you're curious about what Waypoint Transit can offer, you can visit their website at [waypointtransit.com](https://waypointtransit.com) or reach out via email at contact@waypointtransit.com. The future of urban planning is here, and it’s automated.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/401e3cf6dffbe11878b8e69b208d04a85bccba9a.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAFJSOQ65W%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192056Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELT%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDHe2krNA4Wz4ZdbboNJG%2B0zG6MmRspOJ5Kex%2FWuhFzDwIhAK4JNrLJx7V6Lp69aumcmLj570j2DR2Eh3hPcEuQGW3%2FKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgweLBjNRNugVRDPT8gqwgPiLGnMwjgQOiNH7FMTInTVKCCJLDe5fdDWlactIzRh2XOtRjauQZptst9ejdBs3vj590lIr07sFFKCWuGV%2B%2BJkmRqS%2BXBC6caH3J97%2FH7W3ch4kKAyKE3TuVCMVl%2BqNFww29jX%2BimNvDUNvCgQtjVE03FWSnfbJrDf3NUx8wttW6l2EC5fgOealDp0Ne7xA51qGtDKfIYSJUUyj6d2WgcNp66ilXSYF5HX3L4wid4xRepJ9Vt1krkNG6bsNoITqg8zMlLgZ7QT5uVwuoY%2Fhv%2F89O661Pa6%2FtGfz6gcZjx3JmkvJh2yaephzjfzpFg43OFS%2B3NnORgMbCqTEcn9piGJokbf9a5xoR2Qt8E4L2AdZTypzC0scYqz%2BA1CsQiK1RrvedAjSsaEw4%2FqFaR6rBrZ4SBiKqlmStv67nu5CMG6DF414F2WlGbkeS8C%2BJYZ2iky%2B19B0K9e4J7Tik78PRFNXoN8lSqP4k%2BLhdrqVq5b2d4m7UHeeProhr%2Fv5HV%2BORFSiFow%2Fhbxt6GN2P2YWxzdIHA32IkBqYD%2BeZ3eFOZSk%2B1Pldgq4PSaiU5lQlEewufIwxcnWXTzGkzSJ%2BLlLlzWX4EwrKPjvQY6pAEqZgWN8cooHP%2FeegIX6R3Pun8lUwrTM2csrvVF8K2udU7KUu1EoXzzxsupULfK9AN%2Bcef1HwWg3GN0hRmtduP9znDwqy7B09eErZHX3iCWPeVm7m2HUwQH0BM7NBnkw%2BBNh35scX3c4lMIghjRFyw9b8VEOGAbUjAxbgvLqemFdd8Zq7DGRWXDbhLqcGd2hHliZLchEjlQhzfD3wdeSwzTgvkJMw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=bbd988205c43dc97cbb899f71f1781a9c463bdf8b957919899f0074da9dd6520",
    "social_links": [
        "https://www.linkedin.com/company/waypoint-transit/"
    ],
    "logo_path": "data/logos\\Waypoint_Transit_logo.png"
}