{
    "links": "https://www.ycombinator.com/companies/wevorce",
    "name": "Wevorce",
    "headline": "Changing divorce for good by making it a way less horrible experienceâ\u0080¦",
    "batch": "W13",
    "description": "Wevorce is fixing divorce by ensuring kids come first, costs stay affordable, and the transition is appropriately paced, so that couples can focus on parenting, not fighting. \n\nFor families, the Wevorce experience stands in stark contrast to the traditional adversarial approach. Instead of each spouse \"lawyering up,\"â\u0080\u008b Wevorce brings them together to work with a specially-trained attorney-mediator who guides the couple through a defined, but fully customized, settlement process. Additional experts in finance and parenting are brought in as needed to ensure the settlement g... See More",
    "activity_status": "Active",
    "website": "http://wevorce.com",
    "founded_date": null,
    "team_size": 11.0,
    "location": "Bothell, WA",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:legaltech",
    "founders": [],
    "status": true,
    "generated_description": "Wevorce is on a mission to transform the divorce experience, making it significantly less painful and more compassionate. Founded in 2013 and headquartered in Bothell, WA, Wevorce offers a refreshing alternative to the traditional adversarial divorce process. Instead of pitting spouses against each other in a legal battle, they promote collaboration, focusing on the needs of children, affordability, and a smoother transition for families.\n\nThe way Wevorce works is pretty straightforward. Couples engage with a specially trained attorney-mediator who helps them navigate the divorce process in a structured yet personalized manner. This approach encompasses additional support from financial and parenting experts as necessary, ensuring a holistic understanding of the settlement. The goal is to help families prioritize parenting over fighting.\n\nTheir platform is rich with resources, including tools like a Divorce Quiz and a Calculator to assess divorce scenarios. They also provide direct access to private judges for those looking for a quick resolution, and a wealth of information through their blog, podcasts, and community events. The support doesn’t end there – Wevorce also features a private community for ongoing mentorship and advice.\n\nThe testimonials from users are telling. People like Steve Huffman, CEO of Reddit, claim that Wevorce changed their lives, stressing the emotional and practical benefits of their services. They highlight a unique empathy in Wevorce's approach that’s often missing in the legal field.\n\nWith a team of 11 and a strong backing from Y Combinator, Wevorce is part of the burgeoning legal tech space, impacting how families approach not just divorce, but their long-term relational dynamics. Whether you’re in the throes of separation or just looking to redesign your relationships, Wevorce offers a fresh, supportive path forward.\n\nIf you’re interested in learning more or need immediate help, Wevorce invites you to visit their website at [Wevorce.com](http://wevorce.com) to start your journey towards a more peaceful divorce experience.",
    "logo": "/logos/medium/missing.png",
    "social_links": [
        "https://www.crunchbase.com/organization/wevorce"
    ]
}