{
    "links": "https://www.ycombinator.com/companies/wibond",
    "name": "Wibond",
    "headline": "Affirm for LATAM",
    "batch": "W22",
    "description": "Under \"Buy Now, Pay Later\" business model, Wibond is a 100% flexible digital payment method enabling the 200 million underbanked consumers without credit cards to shop online for the first time. \r\n\nWe integrate directly into the purchase flow of online merchants, and we offer consumers a credit, when they have already made up their mind that they want to acquire a specific product.\r\nWe provide financial and digital access to a large community of people offering payment options according to their possibilities and profile. Wibond is an inclusive and simple solution:\r\n - Consumers can create their free account to quickly access and pay without banks, in installments, and without a card.\r\n - Merchants with e-commerce channels increase their sales and integrate Wibond in a very agile way by offering a new form of payment and expanding their markets.\r\n\nWe’re also integrated in the purchase flow of more than 500 merchants, including Samsung, Musimundo (one of the Biggest retailers in LATAM) , and Motorola. And up to 65% of the payment transactions on these sites go through us.",
    "activity_status": "Active",
    "website": "https://www.wibond.co/",
    "founded_date": 2020.0,
    "team_size": 30.0,
    "location": "Córdoba, Argentina",
    "group_partner": "Diana Hu",
    "group_partner_yc": "https://www.ycombinator.com/people/diana-hu",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:banking-as-a-service; industry:cashierless-checkout; industry:fintech",
    "founders": [
        {
            "name": "Ezequiel Bucai, Founder",
            "description": "I studied Business Administration and Public Accountant. In 2013, with Alejandro Silvestre and Gonzalo Conde, created ClickyPass: a platform where users get access to a network of more than 2,500 gyms and sports centers located in 30 cities in Argentina, Mexico and Chile. Then Classpass, the US Unicorn, acquire Clickypass.",
            "linkedin": "https://ar.linkedin.com/pub/ezequiel-bucai/28/2a3/294/es"
        },
        {
            "name": "Lucrecia Porta, Founder",
            "description": "I am one of Wibond´s cofounders, and member of the board. Additionally, I am the Finance Director in Porta Hnos, a 140 years B-corp family company. I have always been in Financial Corporate area, working in JPMorgan as well.",
            "linkedin": "https://www.linkedin.com/in/lucrecia-porta"
        }
    ],
    "status": true,
    "generated_description": "**Wibond: Empowering Online Shopping in LATAM**\n\nFounded in 2020 and hailing from Córdoba, Argentina, Wibond has set its sights on transforming the online shopping landscape for the 200 million underbanked consumers in Latin America. The mission? To become the \"Affirm for LATAM,\" and they're well on their way, having integrated directly into the purchase workflows of over 500 merchants, including big names like Samsung and Motorola. \n\nWibond operates under a “Buy Now, Pay Later” model, which allows consumers to shop online without needing a credit card. Instead, they offer a flexible digital payment method where users can create a free account enabling them to pay in installments—no banks, no hassle. This approach not only democratizes access to online shopping but also expands market reach for e-commerce merchants, allowing them to boost sales seamlessly.\n\nKey Points:\n- **Inclusion at the Core:** Wibond focuses on providing financial access to the underbanked, giving consumers options tailored to their financial capabilities.\n- **Merchant Integration Made Easy:** With Wibond's agile integration, retailers can quickly adopt a new form of payment, attracting more customers and increasing their sales funnel.\n- **Significant Market Impact:** Up to 65% of payment transactions on their partner sites are processed through Wibond, showcasing their vital role in the fintech landscape.\n\nThe company boasts a team of about 30 employees, fueled by the support of Y Combinator (Batch W22) and backed by active partners like Diana Hu. As Wibond continues to grow, it remains committed to simplifying online transactions for consumers and merchants alike.\n\nFor those looking to learn more or get started, the Wibond experience is as easy as 1-2-3. Head over to [Wibond's website](https://www.wibond.co/) to create an account and dive into the inclusive world of digital payments.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/62e8bc5b97891b7690f12d6f6951424efa4e4a08.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192059Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=fc7fc55d53d5b54b14a289aa38b4c08227290a8d58a309348f6b9e94e894df63",
    "social_links": [],
    "logo_path": "data/logos\\Wibond_logo.png"
}