{
    "links": "https://www.ycombinator.com/companies/wifi-dabba-inc",
    "name": "Wifi Dabba, Inc.",
    "headline": "Decentralised broadband connectivity.",
    "batch": "W17",
    "description": "We enable humans & machines with internet connectivity at a price that they can afford.\r\n\nThe inspiration for Wifi Dabba came from the founders working together for the last decade in the mobile application industry and realising the biggest reason for user churn being access to cheap and affordable internet access. From having worked on ground onboarding users and facing poor connectivity issues all the time, we took it on ourselves to fix the internet access problem for the common citizen.\r\n\nAt Wifi Dabba (YC W17), we are building a low cost, scalable & distributed Wi-Fi infrastructure to connect next billion users online. We do this by deploying a grid of lasers (Free Space Optics) over the cities & town and bring cheap and fast internet for everyone. We enable anyone to buy 1 gig of data access at a time at a price they can afford. Sachetization of internet access is the foundation to rebuilding internet for all. We do this by leveraging crypto and blockchain to truly make internet infrastructure ownership distributed — our vision is to be connectivity layer for the Web3 world.",
    "activity_status": "Active",
    "website": "https://dabba.com",
    "founded_date": 2017.0,
    "team_size": 21.0,
    "location": "Bengaluru, India",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:hardware; industry:crypto-web3; industry:telecommunications",
    "founders": [
        {
            "name": "Karam Lakshman, Founder",
            "description": "Tech at wifidabba.com",
            "linkedin": null
        },
        {
            "name": "Shubhendu Sharma, Founder",
            "description": "building dabba.com",
            "linkedin": "https://linkedin.com/in/shubhendusharma"
        }
    ],
    "status": true,
    "generated_description": "**Wifi Dabba, Inc.** is pioneering a new era in connectivity with its mission of decentralized broadband for everyone. Founded in 2017 and part of Y Combinator’s Winter 2017 batch, this Bengaluru-based startup aims to address a common pain point: the lack of affordable internet access—especially vital for India's millions of potential users.\n\nThe team behind Wifi Dabba has over a decade of experience in mobile applications, where they saw firsthand how poor internet connectivity led to user churn. Realizing that the solution lies beyond conventional methods, they innovated a model that employs a distributed mesh of Wi-Fi infrastructure built on Free Space Optics (laser technology). This approach allows Wifi Dabba to offer internet access at very low costs, enabling anyone to buy data in flexible increments.\n\nBy harnessing crypto and blockchain technology, Wifi Dabba is reshaping internet ownership and access—creating a Web3 connectivity layer that emphasizes equity. Their offerings include Dabba Lite and Dabba Pro hotspots, which can be managed by local cable operators (LCOs), further empowering community-level deployment and maintenance.\n\nAs of now, Wifi Dabba's network boasts over 2,200 hotspots and has consumed 1,600 TB of data, illustrating the demand for their services. With a small yet dedicated team of 21 employees and support from notable investors like Multicoin Capital and Borderless Capital, they are working to connect the next billion users.\n\nThe Dabba Token (DBT) operates as the backbone of its ecosystem, incentivizing participants and aiding in managing supply through a burn mechanism connected to data consumption.\n\nTo explore more about their offerings or track their progress, you can visit their website at [Wifi Dabba](https://dabba.com), or join their discussions on [Discord](https://dabba.com/<https:/dab.ba/discord>). This is a classic example of leveraging innovative tech to solve real-world problems and democratize access to information.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/440ba086d7fb85258259b9bcfe1a0cea48adb9b1.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAFJSOQ65W%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192059Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELT%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDHe2krNA4Wz4ZdbboNJG%2B0zG6MmRspOJ5Kex%2FWuhFzDwIhAK4JNrLJx7V6Lp69aumcmLj570j2DR2Eh3hPcEuQGW3%2FKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgweLBjNRNugVRDPT8gqwgPiLGnMwjgQOiNH7FMTInTVKCCJLDe5fdDWlactIzRh2XOtRjauQZptst9ejdBs3vj590lIr07sFFKCWuGV%2B%2BJkmRqS%2BXBC6caH3J97%2FH7W3ch4kKAyKE3TuVCMVl%2BqNFww29jX%2BimNvDUNvCgQtjVE03FWSnfbJrDf3NUx8wttW6l2EC5fgOealDp0Ne7xA51qGtDKfIYSJUUyj6d2WgcNp66ilXSYF5HX3L4wid4xRepJ9Vt1krkNG6bsNoITqg8zMlLgZ7QT5uVwuoY%2Fhv%2F89O661Pa6%2FtGfz6gcZjx3JmkvJh2yaephzjfzpFg43OFS%2B3NnORgMbCqTEcn9piGJokbf9a5xoR2Qt8E4L2AdZTypzC0scYqz%2BA1CsQiK1RrvedAjSsaEw4%2FqFaR6rBrZ4SBiKqlmStv67nu5CMG6DF414F2WlGbkeS8C%2BJYZ2iky%2B19B0K9e4J7Tik78PRFNXoN8lSqP4k%2BLhdrqVq5b2d4m7UHeeProhr%2Fv5HV%2BORFSiFow%2Fhbxt6GN2P2YWxzdIHA32IkBqYD%2BeZ3eFOZSk%2B1Pldgq4PSaiU5lQlEewufIwxcnWXTzGkzSJ%2BLlLlzWX4EwrKPjvQY6pAEqZgWN8cooHP%2FeegIX6R3Pun8lUwrTM2csrvVF8K2udU7KUu1EoXzzxsupULfK9AN%2Bcef1HwWg3GN0hRmtduP9znDwqy7B09eErZHX3iCWPeVm7m2HUwQH0BM7NBnkw%2BBNh35scX3c4lMIghjRFyw9b8VEOGAbUjAxbgvLqemFdd8Zq7DGRWXDbhLqcGd2hHliZLchEjlQhzfD3wdeSwzTgvkJMw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=53806cdfb43ac3d7cd33283e80271d2a1bd90b618adefaf88ca64712268f6c19",
    "social_links": [
        "https://www.linkedin.com/company/wifidabba",
        "https://www.twitter.com/DabbaNetwork",
        "https://www.crunchbase.com/organization/wifi-dabba"
    ],
    "logo_path": "data/logos\\Wifi_Dabba,_Inc._logo.png"
}