{
    "links": "https://www.ycombinator.com/companies/willow",
    "name": "Willow",
    "headline": "AI-powered Revenue Cycle Management for Long-term Care",
    "batch": "S24",
    "description": "Willow is an AI-powered revenue cycle management software. Starting with the intake and coding process for skilled nursing facilities, we maximize reimbursement by converting complex clinical paperwork into accurate diagnoses and ICD codes.\r\n\nWe built Willow after seeing how nursing homes struggle with revenue cycle challenges that result in lost revenue and claim denials. Traditional processes are outdated and prone to errors, with no solution tailored to the complexities of long-term care. Our AI-driven platform addresses this gap, simplifying operations and reducing costly mistakes so staff can focus on delivering quality patient care.\r\n\nOver $490 billion is spent annually on long-term care in the US. With the growing demand and increasing complexity of insurance billing, Willow ensures long-term care providers capture the full value of their services.",
    "activity_status": "Active",
    "website": "https://seewillow.com/",
    "founded_date": 2024.0,
    "team_size": 4.0,
    "location": "Palo Alto",
    "group_partner": "Nicolas Dessaigne",
    "group_partner_yc": "https://www.ycombinator.com/people/nicolas-dessaigne",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:artificial-intelligence; industry:health-tech; industry:b2b; industry:healthcare; industry:health-insurance; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Allan Guo, Founder",
            "description": "Co-founder and CEO at Willow. Previously studied CS at Stanford. Researched ML + neuroscience at Stanford Medical. Worked on odd entrepreneurial endeavors since age 10, including an EDM music label, an app for dementia caregivers, and an e-commerce business targetting moms.",
            "linkedin": "https://www.linkedin.com/in/allan-guo/"
        }
    ],
    "status": true,
    "generated_description": "Willow is a promising startup that landed in the spotlight as part of Y Combinator’s Batch S24, and it's tackling a substantial issue in long-term care: revenue cycle management. Launched in 2024 and based in Palo Alto with a nimble team of four, Willow harnesses AI technology to revolutionize how skilled nursing facilities handle their intake and coding processes. \n\nAt its core, Willow converts cumbersome clinical paperwork into precise diagnoses and ICD codes, maximizing reimbursement and helping nursing homes navigate the complex world of insurance billing. This is crucial because the U.S. spends over $490 billion annually on long-term care—a market ripe for improvement. Traditional methods, fraught with outdated practices and frequent errors, leave much to be desired. Willow disrupts this norm, allowing staff to focus on what really matters: providing quality patient care instead of getting bogged down by paperwork.\n\nWillow also offers a voice dictation tool that boasts fast and accurate transcription, adapting smoothly to any workflow. The design allows users to talk naturally, auto-formatting text without tedious commands. It includes features like custom dictionaries, robust privacy controls, and seamless integration across various applications, which seems tailor-made for busy healthcare environments. \n\nWith a clear mission and a smartly designed product, Willow is not just another health tech startup. It aims to empower long-term care providers and ensure they capture the full value of their offerings in an increasingly complex billing landscape. If you’re in the healthcare sector and you want to decrease administrative woes while boosting revenue, checking out Willow’s offerings might be worth your time. \n\nFor more information, visit [Willow's website](https://seewillow.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/4004b6e2a7b60d5b89f6e7d2464ceb872c366327.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAFJSOQ65W%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192059Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELT%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDHe2krNA4Wz4ZdbboNJG%2B0zG6MmRspOJ5Kex%2FWuhFzDwIhAK4JNrLJx7V6Lp69aumcmLj570j2DR2Eh3hPcEuQGW3%2FKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgweLBjNRNugVRDPT8gqwgPiLGnMwjgQOiNH7FMTInTVKCCJLDe5fdDWlactIzRh2XOtRjauQZptst9ejdBs3vj590lIr07sFFKCWuGV%2B%2BJkmRqS%2BXBC6caH3J97%2FH7W3ch4kKAyKE3TuVCMVl%2BqNFww29jX%2BimNvDUNvCgQtjVE03FWSnfbJrDf3NUx8wttW6l2EC5fgOealDp0Ne7xA51qGtDKfIYSJUUyj6d2WgcNp66ilXSYF5HX3L4wid4xRepJ9Vt1krkNG6bsNoITqg8zMlLgZ7QT5uVwuoY%2Fhv%2F89O661Pa6%2FtGfz6gcZjx3JmkvJh2yaephzjfzpFg43OFS%2B3NnORgMbCqTEcn9piGJokbf9a5xoR2Qt8E4L2AdZTypzC0scYqz%2BA1CsQiK1RrvedAjSsaEw4%2FqFaR6rBrZ4SBiKqlmStv67nu5CMG6DF414F2WlGbkeS8C%2BJYZ2iky%2B19B0K9e4J7Tik78PRFNXoN8lSqP4k%2BLhdrqVq5b2d4m7UHeeProhr%2Fv5HV%2BORFSiFow%2Fhbxt6GN2P2YWxzdIHA32IkBqYD%2BeZ3eFOZSk%2B1Pldgq4PSaiU5lQlEewufIwxcnWXTzGkzSJ%2BLlLlzWX4EwrKPjvQY6pAEqZgWN8cooHP%2FeegIX6R3Pun8lUwrTM2csrvVF8K2udU7KUu1EoXzzxsupULfK9AN%2Bcef1HwWg3GN0hRmtduP9znDwqy7B09eErZHX3iCWPeVm7m2HUwQH0BM7NBnkw%2BBNh35scX3c4lMIghjRFyw9b8VEOGAbUjAxbgvLqemFdd8Zq7DGRWXDbhLqcGd2hHliZLchEjlQhzfD3wdeSwzTgvkJMw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=72c50e51aa99b019efb5f9484547f7c9c2b26790aa55a7182d8ca14e4080ba95",
    "social_links": [
        "https://linkedin.com/companies/willowtechnologies"
    ],
    "logo_path": "data/logos\\Willow_logo.png"
}