{
    "links": "https://www.ycombinator.com/companies/windmill",
    "name": "Windmill",
    "headline": "Open-source platform to turn scripts into internal apps & workflows",
    "batch": "S22",
    "description": "Windmill is an open-source developer platform to quickly build production-grade multi-step internal apps, workflows and integrations from minimal Python and Typescript scripts. \r\n\nOpen-source alternative to Airplane and Pipedream. Simplified temporal with automatic app generation. Usable as a self-hosted AWS Lambda. \r\n\nSync your scripts from your github repo or write them directly on Windmill, have them be converted to apps and no-code modules automatically. Use those apps as standalone or, build powerful flows using either those scripts or scripts made by the community on hub.windmill.dev. The experience is similar to no-code tools except that at any point, any module can have its code inspected and tweaked. Leveraging the open-source community, we will build an exhaustive library of scripts for all apis and generic tasks.\r\n\nYou may also wrap Windmill with your own frontend to provide automation as a feature on top of your own SaaS. \r\n\nFocus on your business logic for all kind of flows, Windmill is the platform to build, share and run them.",
    "activity_status": "Active",
    "website": "https://windmill.dev",
    "founded_date": 2022.0,
    "team_size": 6.0,
    "location": "Paris, France",
    "group_partner": "Nicolas Dessaigne",
    "group_partner_yc": "https://www.ycombinator.com/people/nicolas-dessaigne",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:developer-tools; industry:saas; industry:b2b; industry:workflow-automation; industry:open-source",
    "founders": [
        {
            "name": "Ruben Fiszel, Founder",
            "description": "Ruben was top of his class MSc in CS at EPFL, did research on compilers from Scala to Hardware at Stanford, built the first open-source library for reinforcement learning for Java, , built distributed systems at scale at Palantir and ran the engineering team at a Multi-Party Computation startup. He is now building Windmill, an  open-source alternative to Retool, Pipedream, Airplane that contains the infra to run it and that you can deploy at scale.",
            "linkedin": "https://www.linkedin.com/in/rubenfiszel/"
        }
    ],
    "status": true,
    "generated_description": "**Windmill: Turning Scripts into Powerful Internal Applications**\n\nFounded in 2022 and part of Y Combinator's S22 batch, Windmill is a developer-focused open-source platform designed to streamline the creation of internal applications and workflows using minimal code. Based in Paris, France, with a small team of six, Windmill positions itself as a robust alternative to tools like Airplane and Pipedream.\n\n### **Mission and Vision**\nThe mission of Windmill is straightforward: to provide an open-source platform that facilitates the transformation of simple Python and TypeScript scripts into production-grade multi-step applications. The goal is to empower developers to build, share, and run workflows without getting bogged down by the intricacies of deployment or integration.\n\n### **Core Features**\n1. **Seamless Workflow Automation**: Users can sync scripts directly from their GitHub repositories or write them directly within Windmill. The platform automatically converts these scripts into applications and no-code modules, drastically reducing the time from coding to deployment.\n\n2. **Versatile Integration**: Windmill supports a wide array of programming languages, including Python, TypeScript, Go, PHP, Bash, and SQL. This flexibility allows developers to work in their preferred languages and easily manage complex data pipelines.\n\n3. **User-Centric Development**: The platform includes features like auto-generated UIs, webhooks, and an intuitive low-code app editor that employs drag-and-drop functionalities. This makes building complex applications accessible, even to those with limited coding experience.\n\n4. **Community Collaboration**: Leveraging the open-source model, Windmill is building an extensive library of scripts through community contributions, enhancing its capabilities across various APIs and generic tasks.\n\n5. **Self-Hosting and Scalability**: Users can deploy Windmill easily on their own infrastructure or use it as a self-hosted AWS Lambda. It's designed to scale from a single worker to a thousand, accommodating any internal service needs.\n\n### **Use Cases and Adoption**\nWindmill is already trusted by over 3,000 organizations, including notable firms like Photoroom, Kahoot, and Bloom Credit. These companies use Windmill to automate back-office tasks, manage complex ETL processes, and streamline their internal operations.\n\n### **Get Involved**\nFor developers interested in contributing to or using Windmill, they can start building their internal tools in under ten minutes. The robust documentation and community support on platforms like Discord make onboarding smoother and foster collaboration.\n\n### **Conclusion**\nWindmill is not just another developer tool; it's a transformative platform that enhances productivity by bridging the gap between code and application in a seamless manner. Whether you're looking to automate workflows or build complex applications with ease, Windmill holds the potential to evolve how developers interact with their scripts.\n\nExplore more about Windmill at [windmill.dev](https://windmill.dev).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/25d0e1760a98d2e87d9ec2e70566e792718800b3.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192059Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=5377c7b1d5437a71b7979be679cda2b6cdb48d728210d6bbe7befee5f5c693be",
    "social_links": [
        "https://www.linkedin.com/company/windmill-dev"
    ],
    "logo_path": "data/logos\\Windmill_logo.png"
}