{
    "links": "https://www.ycombinator.com/companies/women-who-code",
    "name": "Women Who Code",
    "headline": "WWCode is a non profit that empowering diverse women to excel in tech.",
    "batch": "S16",
    "description": "Women Who Code (WWCode) is an international nonprofit dedicated to empowering diverse women to excel in technology careers. WWCode is building a world where diverse women and historically excluded people thrive at every level. The organization has executed more than 15,000 free events around the world, garnered a membership exceeding 320,000, and delivers programming to members in 147 countries. \r\n\nWomen Who Code Values\r\n\nFocus on the mission, Design for inclusion, Advocate for change, Journey forward\r\n\nWHAT WE DO: \r\n-Advance diverse women in their careers every step of the way\r\n-Provide a community of 320,000 that has become a movement in technology leadership\r\n-Build Global Leaders in Tech, effectively changing the industry \r\n-Offer low to no-barrier-to-entry programs, events, scholarships, and more for women to build tech and leadership skills \r\n-Job board (ask about a YC discount)\r\nLearn more at: www.womenwhocode.com or contact us at contact@womenwhocode.com",
    "activity_status": "Active",
    "website": "https://www.womenwhocode.com/",
    "founded_date": 2013.0,
    "team_size": 25.0,
    "location": "Atlanta, GA",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:education; industry:nonprofit; industry:community",
    "founders": [
        {
            "name": "Zassmin Montes de Oca",
            "description": "Zassmin most recently led security engineering at Coinbase (2018-2022) and co-founded Women Who Code (YC S16), serving as their CTO & Board Vice Chair. Currently she's advising startups on security.",
            "linkedin": "https://linkedin.com/in/zassmin"
        }
    ],
    "status": true,
    "generated_description": "**Women Who Code: Empowering Diversity in Tech**\n\nWomen Who Code (WWCode) is a nonprofit organization on a mission to empower diverse women to excel in technology careers. Founded in 2013, the organization began as a grassroots movement in San Francisco in 2011, initiated by a small group of engineers seeking a supportive community. It has since matured into a global entity, dedicated to fostering a tech industry where women and historically excluded individuals can thrive at all levels.\n\n### Key Achievements\nWith over **320,000 members across **147 countries, WWCode has hosted **more than 15,000** free events, empowering participants through networking, technical skills training, and leadership development. The organization has awarded over **$3.5 million** in scholarships, facilitated **$2.5 million** worth of conference tickets, and shared **14,000 job opportunities**, creating a robust community that advocates for inclusion and equity in tech. Each of these actions reflects their core values: focusing on the mission, designing for inclusion, advocating for change, and journeying forward together. \n\n### What They Offer\nWomen Who Code provides various low- to no-barrier programs aimed at advancing the careers of women in tech. These include:\n- A vast **job board** with opportunities for finding positions in tech.\n- Events and workshops designed to enhance both technical and leadership skills.\n- A supportive network of **mentors and peers** offering guidance and encouragement in navigating the tech landscape.\n\n### Future and Challenges\nDespite its remarkable growth and impact, Women Who Code recently announced its decision to dissolve the organization, effective April 18, 2024. This decision, made by the Board of Directors, comes in light of significant funding challenges that hindered the continuation of its programs. While this marks the end of an era, the organization encourages its members and supporters to keep the spirit of advocacy alive in the tech community.\n\n### Conclusion\nThe legacy of Women Who Code will live on through the relationships formed and the skills developed within its community. As they wind down activities, the team expresses heartfelt gratitude to everyone who contributed to this vital movement for diversity in technology. Future advocates of inclusivity are called to carry forward the ideals of Women Who Code, ensuring that the fight for diverse representation in tech continues. \n\nFor more information or to stay connected, visit [Women Who Code](https://www.womenwhocode.com) or reach out at contact@womenwhocode.com.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/f193d070e480ede387ee00a9006482bee4a6b8dd.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192100Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=a123490cde53eee6125161b3cafa6e16cd8f26af23bc9f4bb4d6c4bf7c0c10c2",
    "social_links": [
        "https://www.linkedin.com/company/women-who-code",
        "https://twitter.com/womenwhocode",
        "https://www.facebook.com/womenwhocode",
        "https://www.crunchbase.com/organization/women-who-code",
        "https://github.com/WomenWhoCode"
    ],
    "logo_path": "data/logos\\Women_Who_Code_logo.png"
}