{
    "links": "https://www.ycombinator.com/companies/workpay",
    "name": "Workpay",
    "headline": "Payroll, Benefits and HR solutions for local and remote teams.",
    "batch": "W20",
    "description": "Workpay provides businesses with tools to manage their employees better and more efficiently. Workpay’s products include time management tools, Payroll (Local & Remote), Statutory Compliance, Benefits, salary disbursements and core HR functions.",
    "activity_status": "Active",
    "website": "https://myworkpay.com",
    "founded_date": 2019.0,
    "team_size": 90.0,
    "location": "Nairobi, Kenya",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:saas; industry:b2b",
    "founders": [
        {
            "name": "Paul Kimani, Founder",
            "description": "Paul is an Electrical and Electronics engineer from the University of Nairobi in Kenya. He worked with Equity Bank (East Africa’s largest bank by asset/capital). He is an alumnus of Y Combinator, Google for Startups Africa and eFounders Fellowship (UNCTAD and Alibaba Group)",
            "linkedin": "https://www.linkedin.com/in/paul-kimani/"
        },
        {
            "name": "Jackson Kibigo Kungu, Founder",
            "description": null,
            "linkedin": "https://www.linkedin.com/in/jackson-kibigo/"
        }
    ],
    "status": true,
    "generated_description": "### Workpay: Revolutionizing Payroll and HR Management in Africa\n\nFounded in 2019 and hailing from Nairobi, Kenya, **Workpay** is a rising star in the fintech world, providing streamlined payroll and HR solutions tailored for both local and remote teams. The company is backed by Y Combinator (Batch W20) and boasts a diverse team of about 90 employees, all driven by a single mission: to simplify Payroll, Benefits, and HR solutions for businesses operating in today's diverse work landscape.\n\n#### What Does Workpay Do?\n\nIn essence, Workpay equips organizations with comprehensive tools to manage their employees efficiently. Here’s a breakdown of their key offerings:\n\n- **Payroll Management**: Modernize salary disbursement processes and ensure compliance across various jurisdictions.\n- **Time and Attendance**: An automated system for tracking employee working hours, eliminating arduous manual calculations.\n- **HR Management**: Streamlines workflows, making employee information management straightforward and efficient.\n- **Benefits and Compliance**: Helps organizations offer tailored benefits while ensuring that they meet local statutory requirements.\n- **Employer of Record Services**: Allows companies to hire top talent across Africa without the need to establish subsidiaries.\n\nTheir platform is especially suited for various sectors including startups, banks, hospitality, healthcare, manufacturing, and even gig workers.\n\n#### Why Choose Workpay?\n\nCompanies prefer Workpay because it’s not just software—it's an all-in-one solution for effective people management. With features that cater to growth and operational efficiency, businesses can focus more on their core functions while leaving the complexities of payroll and HR compliance to the experts at Workpay.\n\nPlus, recent Series A funding of **$5 million**, with Visa as one of the investors, is a testament to the company’s potential and market trust. As the demand for remote working solutions continues to rise, so does Workpay's relevance and importance in the HR tech space.\n\n#### Customer Insights\n\nUsers have praised Workpay for its innovative solutions that save time and money. A recurring sentiment among clients is that it allows for seamless payroll processing—running in minutes instead of days. Additionally, customers appreciate the accessibility and ease of use, which translates into better employee experiences.\n\n### In Summary\n\nIf you're a business looking to simplify your payroll and HR needs, especially if your teams are spread across different regions, Workpay is definitely worth a second look. With a strong focus on automating tedious tasks and ensuring compliance, Workpay stands out as a promising partner for businesses navigating the complexities of modern workforce management. \n\nFor more information, check out their website at [myworkpay.com](https://myworkpay.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/508f1907b9a3a0429fc0b13e4563267888e2b217.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192103Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=083ec916555f80f9ea00bc7ab73fddc502f5d835585aba686ada78c89e318860",
    "social_links": [
        "https://www.linkedin.com/company/workpayhq",
        "https://twitter.com/Workpayhq",
        "https://www.facebook.com/workpayhq",
        "https://www.crunchbase.com/organization/workpay"
    ],
    "logo_path": "data/logos\\Workpay_logo.png"
}