{
    "links": "https://www.ycombinator.com/companies/x-zell",
    "name": "X-Zell",
    "headline": "Early, pain-free cancer detection.",
    "batch": "W15",
    "description": "X-ZELL™ is a global start-up specialising in rare cell detection technology. \r\n\nBacked by Y Combinator and various high-profile angel investors from around the globe – among them Gmail creator Paul Buchheit – X-ZELL™ has developed a world-first platform technology capable of isolating and visualizing rare and abnormal cells such as Circulating Endothelial Cells (CEC).\r\n\nX-ZELL™’s platform technology is based on four core modules covering the entire spectrum from blood processing through to cell analysis and reporting – with every step performed in-house using patented and proprietary technology.\r\n\nBy combining the wisdom of 4,000 years of pathologic research with X-ZELL™’s own, cutting-edge technology, \r\nX-ZELL™ ensures robust results and maximum clinical utility across a broad range of medical applications – from research through to medication management, companions diagnostics, relapse control and diagnostic decision-making.\r\n\nMore information on www.x-zell.com and @XZELLInc",
    "activity_status": "Active",
    "website": "http://www.x-zell.com",
    "founded_date": 2014.0,
    "team_size": 19.0,
    "location": "Singapore, Singapore",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:medical-devices",
    "founders": [
        {
            "name": "Sebastian Punyaratabandhu Bhakdi, Founder",
            "description": "Sebastian started out as a physician at the University Hospital of Freiburg, Germany and earned a Degree in International Health at the Autonomous University of Barcelona, Spain, which made him realize that health services have to be accessible for all. A Research Fellowship from the German Research Foundation helped him to create his first patent which he used to found X-ZELL. He remains its CEO and Principal Investigator, growing the company to solve the world's cancer screening challenge.",
            "linkedin": "https://www.linkedin.com/pub/sebastian-chakrit-punyaratabandhu-bhakdi/4a/357/8a3"
        },
        {
            "name": "Prapat Suriyaphol, Founder",
            "description": null,
            "linkedin": "http://th.linkedin.com/pub/prapat-suriyaphol/17/5b0/3b2"
        }
    ],
    "status": true,
    "generated_description": "**X-Zell: Pioneering Early Cancer Detection**\n\nX-Zell is a groundbreaking company on a mission to revolutionize cancer diagnosis with early, pain-free detection methods. Founded in 2014 and part of the prestigious Y Combinator Batch W15, this Singapore-based startup is at the cutting edge of medical technology, specifically in the detection of rare cells. \n\nWhat sets X-Zell apart is its innovative platform technology, which is the first of its kind in the world. This technology specializes in isolating and visualizing rare and abnormal cells, including Circulating Endothelial Cells (CEC). Backed by an impressive roster of angel investors—most notably Paul Buchheit, co-creator of Gmail—X-Zell has positioned itself as a leader in the realm of medical devices.\n\nThe heart of X-Zell’s system comprises four core modules that span the entire process from blood sample processing to detailed cell analysis and reporting. Each step is meticulously handled in-house, leveraging patented and proprietary technology to ensure reliable results and extensive clinical applicability. This dual approach melds 4,000 years of pathologic research wisdom with advanced modern techniques, aiming for maximum utility across various medical landscapes, including research, medication management, companion diagnostics, relapse monitoring, and diagnostic decision-making.\n\nWith a modest team of 19 employees and a strong focus on innovation, X-Zell is not just a medical device company; it’s a key player in the future of diagnostics. Their work holds the promise of making cancer detection more accessible and less invasive, which is a significant leap forward in healthcare.\n\nFor more information about their innovative solutions and ongoing projects, visit their website at [www.x-zell.com](http://www.x-zell.com) or follow them on Twitter at @XZELLInc. Keep an eye on X-Zell—this is a company that could very well change how we detect and understand cancer.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/b5d26a7a31058121f95a4af46946b49acd68abcf.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192104Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=e3e706f16bb906f43e400d144082361deef094edc5d8ee54cbf4178248e56752",
    "social_links": [
        "https://www.linkedin.com/company/xzell",
        "https://twitter.com/XZELLInc",
        "https://www.crunchbase.com/organization/x-zell"
    ],
    "logo_path": "data/logos\\X-Zell_logo.png"
}