{
    "links": "https://www.ycombinator.com/companies/xgenomes",
    "name": "XGenomes",
    "headline": "XGenomes is building the sequencing technology of the future.",
    "batch": "W19",
    "description": "At XGenomes, we are building a technology comprising novel biochemistry, hardware and  algorithms for sequencing DNA. Our product will be streamlined: there is zero library preparation;  we sequence directly on unadulterated single molecules of DNA; DNA extraction will be integrated with sequencing; there is no bioinformatics bottleneck. The sequence we produce will be of unprecedented accuracy due to several layers of in-built redundancy including the sequencing both strands of the double-helix concurrently. The sequence we produce will be complete, encompassing: structural as well as single nucleotide variants; long-range haplotype phase; the repetitive \"dark matter\" of the genome. The cost of goods (consumables) of sequencing will be <$10, which will allow us to price our product at a level that will help grow the market while still achieving >90% margin. We will start by offering access as a service to high value customers, which be followed by a razor and blade model of selling instruments and consumables.",
    "activity_status": "Active",
    "website": "http://www.xgenomes.com",
    "founded_date": 2017.0,
    "team_size": 6.0,
    "location": "Cambridge, MA",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:genomics",
    "founders": [],
    "status": true,
    "generated_description": "**Company Overview: XGenomes**\n\nFounded in 2017 and hailing from Cambridge, MA, XGenomes is revolutionizing the world of genomics with an ambitious mission: to build the sequencing technology of the future. As part of the Y Combinator Batch W19, they've positioned themselves at the cutting edge of DNA sequencing, aiming for a simpler, more affordable, and vastly more accurate solution.\n\n**What They Do**\n\nAt its core, XGenomes is creating a novel sequencing platform that integrates biochemistry, hardware, and algorithms into one seamless system. Here’s where they shine:\n\n- **No Library Preparation:** Unlike traditional sequencing methods that require extensive preparation steps, XGenomes sequences directly from unaltered single DNA molecules.\n- **Integrated Extraction and Sequencing:** This innovation eliminates time-consuming separate DNA extraction processes.\n- **Concurrent Sequencing:** They improve accuracy by sequencing both strands of the DNA double helix at once, providing multiple layers of redundancy.\n- **Comprehensive Insights:** The sequences generated capture a complete picture of the genome, covering single nucleotide variants, structural variants, haplotypes, and even the often-ignored repetitive \"dark matter\" of our DNA.\n\n**Market Impact**\n\nThe cost effect is particularly striking: XGenomes projects a cost of goods for sequencing at under $10. This financial strategy positions them well to penetrate the market, aiming for over 90% profit margins while delivering an accessible service. Initially, they plan to operate on a service model for high-value clients before transitioning to a \"razor and blade\" model, offering instruments and consumables.\n\n**Current Activities and Vision**\n\nXGenomes is not just about technology; their vision extends to making health monitoring a lifelong affair. They leverage artificial intelligence and optical super-resolution imaging to decode molecular interactions, enabling real-time health monitoring, early disease detection, and tracking of individual responses to treatments.\n\nIn a world plagued by high error rates, complex workflows, and prohibitive costs of existing genomic technologies, XGenomes steps in with a sleek, user-friendly solution that aims to democratize and streamline genomics for everyone.\n\n**Team and Location**\n\nCurrently, XGenomes operates with a lean team of six employees, harnessing expertise and innovation at their Cambridge base, but their ambitions stretch far beyond. They're eyeing expansion and collaboration, potentially to the Bioinnovation Centre at Cambridge Science Park in the UK.\n\n**Final Thoughts**\n\nXGenomes is not just another player in the genomics field; it's a bold bet on the future of health, data, and personalized medicine. As they continue to refine their groundbreaking technology, they stand to redefine our understanding of genetics and its implications for health and longevity. For more on their journey, visit [XGenomes' website](http://www.xgenomes.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/b27de65fa31c1a953f99cfcc8d9b7d1a3d797e24.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192103Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=549bc6fb7a0ad44f578ef61f794f4a1d68d3605d21104105d10ed8a2e2006df2",
    "social_links": [
        "https://www.linkedin.com/company/xgenomes/",
        "https://www.crunchbase.com/organization/xgenomes"
    ],
    "logo_path": "data/logos\\XGenomes_logo.png"
}