{
    "links": "https://www.ycombinator.com/companies/xtraffic",
    "name": "XTraffic",
    "headline": "Technology for cities to automate and manage their traffic lights.",
    "batch": "S24",
    "description": "XTraffic is at the intersection of advancements in sensor technology and affordability. This means entire cities can affordably upgrade their infrastructure - and some already are. We are live in multiple cities, with both ongoing and successful pilots, corridors of multiple intersections, and soon to be entire cities. Our customers enjoy less traffic, better safety, and data on which to build their future.",
    "activity_status": "Active",
    "website": "https://XTraffic.com/",
    "founded_date": 2022.0,
    "team_size": 5.0,
    "location": null,
    "group_partner": "Dalton Caldwell",
    "group_partner_yc": "https://www.ycombinator.com/people/dalton-caldwell",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": null,
    "founders": [
        {
            "name": "Everett Ivy, Founder",
            "description": "Hi! I have studied computer science, worked on control systems/robotics at Amazon, and been a professional gamer. Now with my team at XTraffic where we are making cities and traffic lights smarter.",
            "linkedin": "https://linkedin.com/in/everett-ivy-b686b0248"
        },
        {
            "name": "Luke Adams, Founder",
            "description": "Aerospace Engineering + Computer Science. 3 years @ SpaceX wearing many hats on the Starship program. \nNow, working to bring traffic and city infrastructure into the modern age @ XTraffic!",
            "linkedin": "https://www.linkedin.com/in/luke-adams-8528b72b1"
        },
        {
            "name": "Brian Payne, Founder",
            "description": "Background in control systems and embedded hardware at Amazon. Love all things robotics, now building hardware and software systems to solve traffic!",
            "linkedin": "https://linkedin.com/in/brian-payne-a1460511b"
        }
    ],
    "status": true,
    "generated_description": "### XTraffic: Innovating Urban Mobility\n\n**Overview**  \nFounded in 2022 and part of Y Combinator's Batch S24, XTraffic is on a mission to revolutionize how cities manage traffic lights—making them smarter, safer, and more efficient. At the core of their technology is an innovative approach that blends cutting-edge sensor technology with affordability, allowing cities of all sizes to upgrade their infrastructure without breaking the bank.\n\n**What They Do**  \nXTraffic provides AI-driven signal control systems that streamline traffic flow and improve safety at intersections. Their technology not only alleviates congestion but also offers cities valuable data to further enhance urban mobility in the future. They’ve already launched successful pilots in multiple cities, and some are even rolling out their solutions across entire urban areas. \n\n**Why It Matters**  \nFor cities grappling with traffic headaches, the benefits are clear: reduced congestion, enhanced safety for pedestrians and drivers alike, and actionable data that can inform better urban planning. The affordability of XTraffic's system means more municipalities can partake in this technological advancement, paving the way for smarter cities.\n\n**Team and Leadership**  \nXTraffic operates with a tight-knit team of five, fostering agility and innovation. Dalton Caldwell, their Group Partner at Y Combinator, brings valuable mentorship and resources as the company navigates its early stages.\n\n**Get Involved**  \nIf you're part of a city or town looking to tackle traffic congestion, XTraffic is eager to hear from you. They encourage cities to fill out their interest form on their website, making it simple to start the conversation about implementing their cutting-edge solutions.\n\n**Connect with XTraffic**  \nFor more information, visit their website at [XTraffic.com](https://XTraffic.com) or check out their social media presence. They are positioned at the forefront of urban traffic innovation, and as they expand their reach, the impact on daily commutes and city life could be transformative.\n\nIn summary, XTraffic is not just about managing traffic; it's about rethinking urban transportation for a smoother, safer future.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/a13a32436abcafc2a6b4a4c3daad60a61538c302.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192103Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=d934d74aeabf019fa654c987dc7cb10860e8fc395711a952333c45bab83b126c",
    "social_links": [
        "https://www.linkedin.com/company/91163444/",
        "https://x.com/XTrafficAI"
    ],
    "logo_path": "data/logos\\XTraffic_logo.png"
}