{
    "links": "https://www.ycombinator.com/companies/yarn-2",
    "name": "Yarn",
    "headline": "Make sales and marketing videos with AI.",
    "batch": "W24",
    "description": "Yarn uses AI to help founders, salespeople, and marketers make product and sales videos.\r\n\nTeams are using Yarn to make sales collateral, launch videos, use-case demos, training guides, and feature updates for Twitter and LinkedIn.\r\n\nNo video experience needed and everything looks great out-of-the-box – think Notion, Linear, or Stripe-quality – but branded for your team.\r\n\nThe magic really comes from AI (TTS, CV, LLMs) – so you can zip through 5x faster than a Loom.",
    "activity_status": "Active",
    "website": "https://www.yarn.so",
    "founded_date": 2023.0,
    "team_size": 3.0,
    "location": "New York",
    "group_partner": "Pete Koomen",
    "group_partner_yc": "https://www.ycombinator.com/people/pete-koomen",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:artificial-intelligence; industry:b2b; industry:sales; industry:video; industry:marketing; location:new-york",
    "founders": [
        {
            "name": "Jasper Story, Founder",
            "description": "Co-founder and CEO at Yarn – create pro-level product and sales videos with AI. Before founding Yarn, worked at a bunch of different early-stage startups as a developer, designer, and PM. Also a high-school Math teacher and contractor at Google.",
            "linkedin": null
        },
        {
            "name": "Nicole Atack, Founder",
            "description": "Co-founder and CTO at Yarn – create pro-level product and sales videos with AI.",
            "linkedin": "www.linkedin.com/in/nicole-atack-98194b2b8"
        }
    ],
    "status": true,
    "generated_description": "**Yarn: Revolutionizing Video Creation with AI**\n\nYarn is a fresh startup that’s redefining the way sales and marketing videos are made. Founded in 2023 and part of Y Combinator’s Winter ’24 batch, Yarn is based in New York and operates with a lean team of just three. The mission? To empower founders, salespeople, and marketers to effortlessly create compelling product videos using the power of AI.\n\nIn a world where video is arguably the most engaging medium, Yarn recognizes the reality that even a minute of video content can take hours to produce. By leveraging advanced AI technologies like text-to-speech (TTS), computer vision (CV), and large language models (LLMs), Yarn allows users to speed up their video creation process by five times compared to traditional methods, like Loom.\n\nWhat’s the secret sauce? You don’t need prior video editing experience; everything is designed to look sharp and professional out of the box. Think of platforms like Notion or Stripe—Yarn's videos can achieve that same quality but tailored to your brand.\n\nTeams are already using Yarn to create a variety of sales collateral. This includes launch videos, use-case demos, training guides, and feature updates, specifically tailored for platforms like Twitter and LinkedIn. The goal isn’t just to produce more videos but to enhance the quality, making them more authentic, entertaining, and visually appealing.\n\nYarn is ultimately on a mission to amplify the volume of video created by software companies—aiming to achieve a 1000X increase. The vision here is clear: in five years, the landscape of video creation will be transformed, thanks in large part to AI.\n\nIf you're interested in being part of this revolution, Yarn invites you to join their waitlist [here](https://www.yarn.so/<https:/form.typeform.com/to/gZowgb1M>).\n\nFor more information, check out their website [Yarn](https://www.yarn.so).\n\nSo, to sum it up: Yarn is not just another video tool; it’s a transformative approach to video creation that is simple, sleek, and smart. They’re making sure that video remains at the forefront of effective sales and marketing strategies—because in a world where videos speak volumes, you want yours to stand out.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/07fd51bba68a5dcfbdd98ace77989290e3881f24.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192104Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=9ad25a6a3c87a74cca10c86386bd9cbb147b32a9620908c36ee57b7ef80634e2",
    "social_links": [
        "https://www.linkedin.com/company/yarn-so",
        "https://twitter.com/yarn_so"
    ],
    "logo_path": "data/logos\\Yarn_logo.png"
}