{
    "links": "https://www.ycombinator.com/companies/yassir",
    "name": "Yassir",
    "headline": "Yassir is the leading Super App for French Speaking Africa",
    "batch": "W20",
    "description": "Yassir is the leading super App in the Maghreb region set to change the way daily services are provided. We currently operate in 45 cities across Algeria, Morocco, and Tunisia with recent expansions into France, Canada, and Sub-Saharan Africa, with backing (~$200M in funding) from VCs from Silicon Valley, Europe, and other parts of the world.\r\n\nWe offer on-demand services such as ride-hailing and last-mile delivery. Building on this infrastructure, we are now introducing financial services to help our users pay, save and borrow digitally. Helping usher the continent into a digital economy era.\r\n\nWe’re not just about serving people - we’re about creating a marketplace to bring people what they need while infusing social values.",
    "activity_status": "Active",
    "website": "https://yassir.com",
    "founded_date": null,
    "team_size": 200.0,
    "location": "Algeria",
    "group_partner": "Dalton Caldwell",
    "group_partner_yc": "https://www.ycombinator.com/people/dalton-caldwell",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": null,
    "founders": [],
    "status": true,
    "generated_description": "### Yassir: The Super App for French-Speaking Africa\n\n**Overview**  \nYassir is revolutionizing everyday services in French-speaking Africa with its ambitious mission to be the leading super app in the region. Originally rooted in the Maghreb—specifically Algeria, Morocco, and Tunisia—Yassir has expanded its footprint to 45 cities and reached international markets, including France, Canada, and Sub-Saharan Africa. Backed by approximately $200 million in venture capital from notable investors across Silicon Valley and Europe, this company is set for significant growth.\n\n**Services Offered**  \nYassir began its journey with ride-hailing and last-mile delivery services. It’s not just a convenience app; it's about creating a comprehensive digital marketplace for users. Building on this strong foundation, Yassir is venturing into financial services, enabling its users to pay, save, and borrow digitally, which is crucial for advancing the digital economy in the region.\n\n1. **Yassir Ride:** A ride-hailing service promising safety and convenience.\n2. **Yassir Grocery and Delivery Services:** Meeting your grocery and delivery needs seamlessly.\n3. **Financial Services:** Emerging tools that help users manage their finances digitally.\n\n**Company Culture and Values**  \nYassir prides itself on its core values of ambition, transparency, quality, and performance. The team of 200 employees shares a commitment to innovate and deliver excellent services while fostering trust through open communication.\n\n**Engagement Opportunities**  \nYassir isn't solely focused on consumers; it invites partners to drive with them, sell products, or deliver services through its platform. This reflects an inclusive approach to growing its ecosystem, making it an appealing choice for those looking to collaborate in the African digital landscape.\n\n**Foundational Background**  \nFounded in 2020 and a part of the Y Combinator Batch W20, Yassir is strategically located in Algeria. The company is led by Group Partner Dalton Caldwell and is rapidly becoming a hallmark of innovation in the super app space.\n\n**Conclusion**  \nAt its core, Yassir is all about making people's lives easier while fostering a sense of community and trust. With an eye toward expanding its suite of services and making financial tools accessible, Yassir is poised to play a pivotal role in shaping the future of day-to-day services across French-speaking Africa.\n\nFor more information, explore their website at [Yassir.com](https://yassir.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/a680cc524bdc5e979e0791830658a1d054f1b0d6.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192105Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=519b9b7b355474aa180b0448b5caf097b8d13f8a06b6c86a3b01c4c484a663ad",
    "social_links": [
        "https://www.linkedin.com/company/yassir/",
        "https://mobile.twitter.com/yassir_global",
        "https://github.com/YAtechnologies"
    ],
    "logo_path": "data/logos\\Yassir_logo.png"
}