{
    "links": "https://www.ycombinator.com/companies/yemaachi-biotechnology",
    "name": "Yemaachi Biotechnology",
    "headline": "Diversifying precision cancer diagnostics and treatments",
    "batch": "S21",
    "description": "Yemaachi Biotech is diversifying and expanding access to precision cancer diagnostics and therapeutics by collecting  and sequencing samples from all across Africa, which is the most genetically diverse population on the planet. We then use this data to either optimize existing diagnostic tests, or help other companies discover new ones.\r\nWith our research activities based in Africa, we are able to leverage access to the most genetically diverse population on the planet to build a first-of-its-kind clinical and molecular knowledgebase on cancer among African people.",
    "activity_status": "Active",
    "website": "https://yemaachi.com/",
    "founded_date": 2020.0,
    "team_size": 16.0,
    "location": "Accra, Ghana",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:biotech; industry:diagnostics; industry:therapeutics",
    "founders": [
        {
            "name": "Yaw Bediako, Founder",
            "description": "With extensive expertise in cellular and molecular immunology, Yaw has a keen interest in immune function as relates to non-communicable diseases among African populations. Yaw is very active in efforts to promote the development of a sustainable research ecosystem across sub-Saharan Africa. He is one of 5 scientists selected in the inaugural round of the prestigious Crick Africa Network Fellowship, an affiliate member of the African Academy of Sciences and a fellow of the Ghana Young Academy.",
            "linkedin": "https://www.linkedin.com/in/yaw-bediako-ph-d-8082a152/"
        },
        {
            "name": "Yaw Attua-Afari, Founder",
            "description": "Finance and Investment professional with experience in investment banking and private equity (covering various sectors) in the US and Africa. Keen interest in high impact businesses. Co-founder and CFO of Yemaachi Biotech.",
            "linkedin": "https://www.linkedin.com/in/yaw-a-930b8312/"
        },
        {
            "name": "David Hutchful, Founder",
            "description": "I am passionate about designing and building tech solutions that are informed by a nuanced understanding of the socio-economic and cultural contexts of the problems.  I've worked in the private (Microsoft Research) and non-profit (Grameen Foundation) sectors and built companies that use technology to improve peoples' lives.\n\nWhen I am not hacking ideas or technology, I love to read, travel and experience different cultures. I am always available to play or watch football.",
            "linkedin": "https://www.linkedin.com/in/dhutchful/"
        },
        {
            "name": "Joyce Ngoi, Founder",
            "description": null,
            "linkedin": null
        }
    ],
    "status": true,
    "generated_description": "**Yemaachi Biotechnology: Pioneering Precision Oncology in Africa**\n\nFounded in 2020 and part of Y Combinator's S21 batch, Yemaachi Biotechnology is on a mission to diversify precision cancer diagnostics and treatments. Located in Accra, Ghana, the company brings together a dynamic team of 16 experts committed to transforming cancer care across the continent.\n\n### What Sets Yemaachi Apart?\n\nYemaachi leverages Africa's unique genetic diversity—the most varied population on earth—to create an unparalleled clinical and molecular knowledge base on cancer. By collecting and sequencing samples from the continent, they aim to optimize existing diagnostic tests and pave the way for the discovery of novel therapies. This focus isn’t just altruistic; it uses the rich genetic tapestry of Africa to fuel innovation in precision oncology, offering insights that might otherwise be overlooked in more homogenous populations.\n\n### Current Endeavors\n\nYemaachi is actively involved in several initiatives, such as:\n\n- **Cancer Research**: They are pioneering clinical genomic research, targeting various cancer types while building collaborations with global partners to enhance their impact.\n- **Knowledge Dissemination**: Through webinars and partnerships—like the recent collaboration with Roche for The African Cancer Atlas—Yemaachi is at the forefront of raising awareness about cancer prevention and treatment tailored to the African context.\n- **Public Engagement**: They engage in events and publications that share findings and research insights with both scientific and public audiences.\n\n### Team and Partnerships\n\nThe strength of Yemaachi lies not only in its innovative approach but also in its robust network of partners spanning public, private, and nonprofit sectors globally. The team comprises scientists, engineers, and business operators who blend global expertise with a deep understanding of local health challenges.\n\n### Final Thoughts\n\nYemaachi Biotechnology is more than just a biotech company; it embodies a new era in cancer treatment that acknowledges and embraces the genetic diversity of its population. With a commitment to inclusive, innovative science, Yemaachi is setting the stage for breakthroughs that could redefine cancer diagnostics and therapeutics—not just in Africa, but around the world.\n\nFor more details, check out their website: [Yemaachi Biotechnology](https://yemaachi.com)",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/63f00162d44cd7ee0a855b236763ae5e28661aba.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192104Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=d704848cbe5847ea7a99bf67319c3e9cfc3d1ec2729e9749c4d15b953006f719",
    "social_links": [
        "https://www.linkedin.com/company/yemaachi",
        "https://twitter.com/YemaachiBio"
    ],
    "logo_path": "data/logos\\Yemaachi_Biotechnology_logo.png"
}