{
    "links": "https://www.ycombinator.com/companies/yenmo",
    "name": "Yenmo",
    "headline": "Secured consumer lending in India",
    "batch": "W24",
    "description": "Yenmo offers a better way to access cash for India’s 65 million investors who either resort to personal loans at over 18% interest or have to liquidate their investments when in need of money. With Yenmo, they can pledge their investments digitally and instantly get a loan at a fixed 10.5% interest rate.\r\n\nOur Insight - In India, over 30% of personal loan borrowers have active investments and are paying double the interest rate they qualify for with us.",
    "activity_status": "Active",
    "website": "https://yenmo.in/",
    "founded_date": null,
    "team_size": 5.0,
    "location": "Bengaluru, India",
    "group_partner": "Tom Blomfield",
    "group_partner_yc": "https://www.ycombinator.com/people/tom-blomfield",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:lending; industry:consumer-finance",
    "founders": [
        {
            "name": "Ashutosh Purohit, Founder",
            "description": "Passionate about providing the best financial solutions for Indians! \nAt Navi, I led the creation and growth of their Mutual fund arm, going from 0 to $625M AUM in a year. Previously, at Swiggy, I spearheaded expansion from 30 to 500 cities in 1.5 years.",
            "linkedin": "https://linkedin.com/in/ashutoshpurohit97"
        },
        {
            "name": "Aryan Agarwal, Founder",
            "description": "Finance and Tech enthusiast working towards empowering Indians with new and innovative credit solutions. Worked at Browserstack for 2 Years before starting a Capital Management Company based out of India with over $2 million AUM.",
            "linkedin": "https://linkedin.com/in/aryanag15"
        }
    ],
    "status": true,
    "generated_description": "Yenmo is a fintech startup based in Bengaluru, India, embarking on a mission to redefine consumer lending in the country. With over 65 million investors often caught between high-interest personal loans (above 18%) or liquidating investments in times of need, Yenmo provides an appealing alternative: loans against investments at a competitive fixed rate of 10.5%. \n\nFounded as part of Y Combinator's batch W24, Yenmo is gaining traction in a landscape where over 30% of personal loan borrowers have active investments yet are paying significantly more interest than they would through Yenmo. Their approach allows users to digitally pledge their investments, getting quick access to funds without the hidden fees that plague traditional financial institutions. \n\nWhat really sets Yenmo apart is the simplicity of its process. In just five minutes, users can complete an instant KYC verification, pledge their investments, set up auto-pay, and sign an agreement. There’s no need to worry about foreclosure or prepayment charges, and users pay only interest without the burden of EMIs. This flexibly alleviates financial stress, aligning perfectly with the needs of modern consumers.\n\nBacked by notable partners like CAMS, Bajaj Finserv, and KFin, and led by a compact team of five, Yenmo operates under the guidance of Group Partner Tom Blomfield. The company is poised to make significant inroads in the consumer finance sector, as evidenced by glowing testimonials from users who appreciate its straightforward, user-friendly service.\n\nFor more information or to try the app, you can visit [Yenmo's website](https://yenmo.in). In a market that's often shrouded in complexity and hidden costs, Yenmo shines as a beacon of transparency and innovation.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/9cfd9705af8301978be61bac9c5fb1c32279836e.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAFJSOQ65W%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192104Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELT%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDHe2krNA4Wz4ZdbboNJG%2B0zG6MmRspOJ5Kex%2FWuhFzDwIhAK4JNrLJx7V6Lp69aumcmLj570j2DR2Eh3hPcEuQGW3%2FKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgweLBjNRNugVRDPT8gqwgPiLGnMwjgQOiNH7FMTInTVKCCJLDe5fdDWlactIzRh2XOtRjauQZptst9ejdBs3vj590lIr07sFFKCWuGV%2B%2BJkmRqS%2BXBC6caH3J97%2FH7W3ch4kKAyKE3TuVCMVl%2BqNFww29jX%2BimNvDUNvCgQtjVE03FWSnfbJrDf3NUx8wttW6l2EC5fgOealDp0Ne7xA51qGtDKfIYSJUUyj6d2WgcNp66ilXSYF5HX3L4wid4xRepJ9Vt1krkNG6bsNoITqg8zMlLgZ7QT5uVwuoY%2Fhv%2F89O661Pa6%2FtGfz6gcZjx3JmkvJh2yaephzjfzpFg43OFS%2B3NnORgMbCqTEcn9piGJokbf9a5xoR2Qt8E4L2AdZTypzC0scYqz%2BA1CsQiK1RrvedAjSsaEw4%2FqFaR6rBrZ4SBiKqlmStv67nu5CMG6DF414F2WlGbkeS8C%2BJYZ2iky%2B19B0K9e4J7Tik78PRFNXoN8lSqP4k%2BLhdrqVq5b2d4m7UHeeProhr%2Fv5HV%2BORFSiFow%2Fhbxt6GN2P2YWxzdIHA32IkBqYD%2BeZ3eFOZSk%2B1Pldgq4PSaiU5lQlEewufIwxcnWXTzGkzSJ%2BLlLlzWX4EwrKPjvQY6pAEqZgWN8cooHP%2FeegIX6R3Pun8lUwrTM2csrvVF8K2udU7KUu1EoXzzxsupULfK9AN%2Bcef1HwWg3GN0hRmtduP9znDwqy7B09eErZHX3iCWPeVm7m2HUwQH0BM7NBnkw%2BBNh35scX3c4lMIghjRFyw9b8VEOGAbUjAxbgvLqemFdd8Zq7DGRWXDbhLqcGd2hHliZLchEjlQhzfD3wdeSwzTgvkJMw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=e1511dae2b220c10070e26f9c1c74a6ccbd24558a3c4db66e6a65ce3a7a55c07",
    "social_links": [
        "https://www.linkedin.com/company/yenmo-in/",
        "https://twitter.com/yenmo_official"
    ],
    "logo_path": "data/logos\\Yenmo_logo.png"
}