{
    "links": "https://www.ycombinator.com/companies/yourchoice-therapeutics",
    "name": "YourChoice Therapeutics",
    "headline": "YourChoice therapeutics is revolutionizing the contraceptive marketâ\u0080¦",
    "batch": "W19",
    "description": "YourChoice Therapeutics is revolutionizing the global contraceptive market. Our vision is to develop non-hormonal contraceptives to provide both women and men with birth control options that lack the associated risks of hormone-based options but are equally effective. Traditionally, it has been the womenâ\u0080\u0099s financial and health burden to have a contraceptive in place. Our first goal is therefore to  bring a novel non-hormonal, on-demand and low cost female contraceptive to the market that will substantially improve their quality of life and well-being. Our second goal is to develop the first ever non-surgical and highly effective non-hormonal contraceptive for men. Currently, male contraception is limited to two main options â\u0080\u0093 vasectomy or condoms. Having such options available to both women and men will globally allow for much better family planning, reduce the number of unwanted pregnancies including abortions and therefore reduce costs and ensure contraceptive health and well-being.",
    "activity_status": "Active",
    "website": "http://ychoicetx.com",
    "founded_date": null,
    "team_size": 3.0,
    "location": "Berkeley, CA",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:health-tech; industry:biotech; location:san-francisco-bay-area",
    "founders": [],
    "status": true,
    "generated_description": "**YourChoice Therapeutics: Revolutionizing Contraception**\n\nYourChoice Therapeutics is setting out to change the contraceptive landscape by focusing on non-hormonal birth control solutions. Founded in the Bay Area and backed by Y Combinator (Batch W19), this innovative company aims to address longstanding issues in contraceptive options that disproportionately burden women.\n\n### Mission and Vision\nThe primary goal of YourChoice Therapeutics is to develop effective, non-hormonal contraceptives for both women and men. The company acknowledges that traditional options have often come with serious health risks and financial burdens, especially for women. Their vision? To provide equitable contraceptive choices that enhance the quality of life and well-being for all. \n\n**For Women:** The company is committed to bringing a novel, on-demand, and affordable contraceptive to the market that women can rely on without hormonal side effects. \n\n**For Men:** They are also venturing into male contraception, aiming to create the first effective, non-surgical contraceptive option. Right now, men have few choices—primarily vasectomies or condoms. A new solution here could lead to better family planning and less unplanned pregnancies, ultimately reducing societal costs associated with unwanted pregnancies and abortions.\n\n### Current Developments\nLocated in Berkeley, CA, YourChoice Therapeutics consists of a tight-knit team of three, all laser-focused on research and development. They have reported compelling test results indicating their drug is 99% effective and entirely reversible, as demonstrated in animal studies. The non-invasive nature of their contraceptive approach means it could open up a new world of options for men—effectively allowing a temporary, daily regimen that surpasses the efficacy of condoms.\n\n### Why It Matters\nThe implications of their work extend far beyond industry innovation; it's about social equity in reproductive health. By diversifying contraceptive options, YourChoice Therapeutics aims to empower individuals in shaping their family planning strategies while reducing the socially and financially burdensome consequences of unplanned pregnancies.\n\n### Conclusion\nYourChoice Therapeutics is at the forefront of a pressing health-tech challenge, combining biotech innovation with a keen awareness of societal needs. As they continue to develop effective, affordable contraceptive solutions, they might just be rewriting the narrative on birth control for the better. \n\nFor more information, check out their website: [YourChoice Therapeutics](http://ychoicetx.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/a964e60c1ee217dc10bd56164377f1007eb80a20.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192105Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=aaba550a36187fdf37ff6a28dc8c9181fd2ad56579310db0f9de5f3b263126c3",
    "social_links": [
        "https://www.linkedin.com/company/yourchoicetherapeutics/"
    ],
    "logo_path": "data/logos\\YourChoice_Therapeutics_logo.png"
}