{
    "links": "https://www.ycombinator.com/companies/zeo-route-planner",
    "name": "Zeo Route Planner",
    "headline": "Route Optimisation platform for SMB in delivery & home services.",
    "batch": "W20",
    "description": "Experience cutting-edge route optimization with Zeo, a versatile platform designed for both mobile and web. Our innovative app, trusted by over 1 million drivers across 146 countries, revolutionizes last-mile delivery by minimizing delivery times and reducing costs.\r\n\nZeo Fleet, an essential tool for fleet managers and businesses, offers a seamless, no code solution to manage and assign stops to drivers, streamlining setup in under 15 minutes. Join 5,000+ businesses that rely on Zeo for daily route planning.\r\n\nZeo caters to a diverse range of industries including last-mile delivery, waste management, healthcare, home services (like lawn mowing, pool maintenance, handyman services, HVAC), real estate, building inspection, and national park service.\r\n\nKey features of Zeo include advanced stop assignment, efficient route optimization, real-time driver tracking, comprehensive proof of delivery tracking, effective load assignment, and precise geo-fencing for drivers.\r\n\nChoose Zeo for a smarter, more efficient routing solution.",
    "activity_status": "Active",
    "website": "https://zeorouteplanner.com",
    "founded_date": 2019.0,
    "team_size": 15.0,
    "location": "San Francisco",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:saas; industry:b2b; industry:logistics; industry:supply-chain; industry:transportation; location:san-francisco-bay-area",
    "founders": [
        {
            "name": "Kshitij Dixit, Founder",
            "description": "Kshitij has been building products for over 4 years now. He set up the first data pipeline at OYO, built a co-working office space aggregation platform and worked on tons of failed products in between. Before Zeo, Kshitij led product for Mutual fund and Digital gold platforms at Jio. At ZeoAuto, Kshitij looks after product, tech and growth. He drives inspiration from Zoho founder Mr. Vembu and wants to see people in smaller cities in India find opportunities in technology and entrepreneurship",
            "linkedin": "https://www.linkedin.com/in/kshitijdixit/"
        },
        {
            "name": "Nimit Mehra, Co Founder",
            "description": "Prior to building Zeo Auto, I worked as a product manager, private banker and management consultant at Reliance Jio, Standard Chartered Bank and Accenture Strategy.  I am interested in working on ideas which have the potential to make a large impact. Through Zeo I want to make last mile logistics seamless for everybody.",
            "linkedin": "https://www.linkedin.com/in/nimitmehra/"
        },
        {
            "name": "Ritesh Singh, Founder",
            "description": null,
            "linkedin": "https://www.linkedin.com/in/ritesh-singh-a5028a160/"
        }
    ],
    "status": true,
    "generated_description": "### Zeo Route Planner: Revolutionizing Route Management for SMBs\n\nFounded in 2019 and nestled in the vibrant ecosystem of San Francisco, Zeo Route Planner is a cutting-edge route optimization platform designed specifically for small to medium-sized businesses (SMBs) engaged in delivery and home services. With a mission to streamline last-mile delivery logistics, Zeo has already gained the trust of over 1 million drivers across 146 countries.\n\n#### What Makes Zeo Stand Out?\n\nZeo is not just a routing tool; it’s a powerful ally for businesses that need to efficiently manage fleets and deliveries. With over 5,000 businesses relying on Zeo for their daily route planning, the platform stands out by ensuring that **fleet managers can assign stops seamlessly**, all without needing to write a line of code. Setup is swift and can be completed in under 15 minutes.\n\n**Key Features:**\n- **Advanced Stop Assignment:** Prioritize stops for optimal routes.\n- **Real-Time Tracking:** Keep tabs on drivers and deliveries.\n- **Proof of Delivery:** Customers can receive confirmation that their deliveries have arrived.\n- **Load Assignment and Geo-fencing:** Tailored for various industries like healthcare, waste management, and national parks.\n\nZeo shines with its customizable tools and integration capabilities, supporting businesses in sectors ranging from healthcare and HVAC to lawn care and pest control.\n\n#### Supported Industries\nZeo caters to an extensive array of industries, including:\n- Last-Mile Delivery\n- Waste Management\n- Healthcare\n- Home Services (like lawn mowing and HVAC)\n- Real Estate\n- National Parks\n\n#### The Team Behind Zeo\nWith a committed team of 15 employees backed by the renowned accelerator Y Combinator (Batch W20), Zeo has a strong foundation of expertise and innovation. Their ethos embodies a robust commitment to solving common logistical challenges faced by delivery businesses on a day-to-day basis.\n\n#### Users Love Zeo\nMany users laud Zeo for reducing delivery times and costs, enhancing overall productivity. As one courier put it, using Zeo transforms their work process, making deliveries efficient and punctual.\n\nIn summary, if you’re looking for a smarter, automated way to tackle route management and delivery operations, Zeo Route Planner is a compelling choice. It’s a solution that’s not just about getting from A to B; it’s about optimizing every step in between.\n\nTo learn more about how Zeo can elevate your delivery strategy, visit their official website: [Zeo Route Planner](https://zeorouteplanner.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/1d9ec67f446d5c043eef8563a6c8239833ab31e5.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECANZTIEPER%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192108Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIFK7AaY6pLW7VXlabKqUnsti6Yla%2FSCoewpy2UpIVCaCAiA8ht7ARDxEtPYflXgJ6GN5bEZeebWfnDTKyeidmcTC1CruAwjc%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDAwNjIwMTgxMTA3MiIMCT%2BNNvy1oYZVQ2WfKsIDC8tFQP9udIDUz7fPe0Dzhi3kRbDHT6z1su5L4S2TNId9sdGLXlMH5QJEjIRQ0rRGFxtFwHq3Ei%2FFUMz8Ks%2BREJfMgSTVpukyJgwEShybEje0ZmE8QmQZfZHBoB3xkrE%2BBayG5FX4vDwLgpeUOm2x0Sme6SqEGp0U2HdP5J9we04xpSN6O3pOAmTuuCsb%2BQPYCH1mXWSVmvNh2pUbfVpEuA1sb0Wiptbpfnhy4N1sMbsvgcVHnJWsfFM7KpvOlLi74Nr4Vc0xdBaCVKFI%2F41dQ8B4Kzz9dYpoaJusn%2BzTCogghYP7kOh6JJVWY35TuATGcnfRj43am6HEi642klk52iMuE3ArHBew3k4kXFjbnK43UVyRzTS05n6rrFGghTnrTREChlc9QCNp9k3yv2JDnt3mmhgvF7SgDPlQjN30occWCFX7TKX0SeOYyEtGYGTfIgd7vhxYn9lJ4oKAdWFyyag09TH2uQboF8DUZi4%2Fg8KcUmexxB%2F6WrTdTaOmKfNgD1HgHc3rUIip1aKJOxhl%2FK2vVvuv24UBvRE8k9cA9IRmUWpABHCRsWHi18byrwhB8loeVL%2B%2FJ0OsbjBfCFm%2Bw6q1MLKL470GOqYBVYJ7J0xnXg6%2FzqB9gfoZM97xPrmQD13S%2F2Fk8gtkTcxCMI3BWSeNqsOoiP1%2Fd0GbOsuEccJaBnW%2B4rCnpLm49esEX6GFb5TSj2RJpw0MiIDCBDehJEL0xBmL41NHVEKuK%2Fj6JCSGHAzPKoaj%2FQs%2BQ0%2BmDRURurQUk6EIMYr867Y%2BX2Rq%2FtjXqF5VR7HKdT0IVHTM96uCnswQE%2FjhiCPclPGbctMWJQ%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=1dc36aa8d9760f4e9fe18e52be9f79947db6509231f8b075dbb4aeb96bd64f80",
    "social_links": [
        "https://twitter.com/zeoauto"
    ],
    "logo_path": "data/logos\\Zeo_Route_Planner_logo.png"
}