{
    "links": "https://www.ycombinator.com/companies/zerocater",
    "name": "Zerocater",
    "headline": "Zerocater is revolutionizing how companies feed their employees",
    "batch": "W11",
    "description": "Zerocater builds revolutionary corporate catering and cafeteria solutions employees love while saving companies millions of dollars as they transition to the hybrid workplace. With its Cloud Cafe, Hybrid Cafe, Managed Cafe, and Event Cafe products; Zerocater has built corporate cafeteria and office catering programs for companies of all sizes from growing startups to the Fortune 500. Thousands of companies like Robinhood, Datadog, Airtable, and McKinsey choose Zerocater for the customized, consistent, and diverse meal experiences its products offer, while also reducing costs by giving companies the flexibility to only pay for the employees who come into the office. Zerocater currently offers its corporate cafeteria and office catering products in the San Francisco Bay Area, New York, Chicago, Los Angeles, Boston, Austin, Denver, Seattle, and Washington D.C. with additional markets in the U.S. and Canada coming online every month. Since completing YCombinator in Winter 2011, Zerocater has raised $38.5M from leading investors including Cleveland Avenue, Remus Capital, Romulus Capital, Struck Capital, SV Angel, Keith Rabois, Yuri Milner, Paul Buchheit, and Justin Kan. For more information visit zerocater.com and follow @Zerocater on Facebook, Instagram, LinkedIn, and Twitter.",
    "activity_status": "Active",
    "website": "http://zerocater.com",
    "founded_date": 2009.0,
    "team_size": 140.0,
    "location": "San Francisco",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:food-tech; location:san-francisco-bay-area",
    "founders": [],
    "status": true,
    "generated_description": "**Zerocater: Revolutionizing Workplace Catering**\n\nFounded in 2009 and emerging from Y Combinator's Winter 2011 batch, Zerocater is changing the landscape of corporate dining. The mission? To make employee meals better while saving companies significant costs, especially in an age when hybrid work models are becoming the norm.\n\nTheir flagship offerings—Cloud Café, Hybrid Café, Managed Café, and Event Café—cater to organizations ranging from nimble startups to Fortune 500 giants. Companies like Robinhood, Datadog, and McKinsey rely on Zerocater for tailored meal solutions that fit their unique needs. \n\nWhat sets Zerocater apart is their flexibility. They thoughtfully provide meal options that allow clients to pay only for the meals consumed by in-office employees, significantly trimming down waste and costs. Their services are currently available in major U.S. cities like San Francisco, New York, Los Angeles, and Chicago, with plans for expansion into more markets across North America.\n\nAfter successfully securing $38.5 million in funding from notable investors like Keith Rabois and Justin Kan, Zerocater has built a strong team of 140, based in San Francisco. Their innovative approach blends technology with gastronomy—using an app that simplifies meal ordering for employees and a dashboard for administrators to track spend and menus.\n\nOffering services in multiple forms—from daily catering to fully-managed cafeteria setups—the company emphasizes quality and personalization. From sumptuous local cuisines to branded events, the dining experience has been tailored to foster collaboration and a strong workplace culture.\n\nWith a forward-thinking outlook and consistent growth, Zerocater stands at the forefront of food tech in the workplace. Want to learn more? Check them out at [zerocater.com](http://zerocater.com) or follow them across social media.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/901a28deaa7de024108ee52302613b740919d041.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192109Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=7988dc8663e43b5e7ff22e728f9b1dfd2305f2e2e469309d6783a28f9a728907",
    "social_links": [
        "https://www.linkedin.com/company/zerocater/",
        "https://twitter.com/ZeroCater",
        "https://www.facebook.com/zerocater",
        "https://www.crunchbase.com/organization/zerocater",
        "https://github.com/ZeroCater"
    ],
    "logo_path": "data/logos\\Zerocater_logo.png"
}