{
    "links": "https://www.ycombinator.com/companies/z-imaging",
    "name": "Zeta Surgical",
    "headline": "Next-Generation Surgical Navigation and Robotics",
    "batch": "S19",
    "description": "We develop surgical navigation and robotics tools to make minimally invasive surgeries easier, faster and more accessible.",
    "activity_status": "Active",
    "website": "http://zetasurgical.com",
    "founded_date": 2018.0,
    "team_size": 12.0,
    "location": "Boston",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:medical-robotics; industry:augmented-reality; industry:ai; location:boston",
    "founders": [
        {
            "name": "Jose Amich, Founder/CEO",
            "description": "Founder/CEO at Zeta Surgical",
            "linkedin": "https://www.linkedin.com/in/josemaria-amich/en"
        },
        {
            "name": "Raahil Sha, Founder/CTO",
            "description": null,
            "linkedin": "https://www.linkedin.com/in/raahil-sha/"
        }
    ],
    "status": true,
    "generated_description": "**Zeta Surgical: Revolutionizing Surgery with Advanced Navigation and Robotics**\n\nFounded in 2018 and hailing from the esteemed Y Combinator Batch S19, Zeta Surgical is on a mission to reshape the landscape of minimally invasive surgeries. Based in Boston, this dynamic startup has roped in a team of 12 dedicated employees, all focused on a single goal: to make surgical navigation and robotics tools that are not only cutting-edge but also make surgeries easier, faster, and more accessible.\n\nAt the heart of Zeta Surgical’s innovation is the **RealTrack** system. This game-changing technology uses AI-powered computer vision to enhance surgical precision to sub-millimeter accuracy, streamlining both intraoperative and extraoperative navigation. What does this mean for patients? It means safer procedures with less reliance on anesthesia and traditional fixation, effectively minimizing complications and enhancing overall safety.\n\nZeta Surgical doesn’t just stop at improving surgical outcomes; their technology is designed for efficiency. By optimizing surgical workflows, it reduces procedure times and maximizes operating room utilization, making better use of resources that ultimately benefits patients.\n\nBut don’t just take their word for it. Zeta Surgical has garnered impressive recognition in the medical community, collecting a slew of prestigious awards including the 2023 iF Design Award and the 2023 NY Design Award for Design of the Year. Furthermore, they are endorsed by leading institutions, including Massachusetts General Hospital and Brigham and Women’s Hospital, and recently secured FDA 510(k) clearance for expanded indications and instrument compatibility.\n\nThe team behind this innovation is led by co-founders Raahil Sha (CTO) and Jose Amich (CEO), who were honored in the latest Forbes 30 Under 30 list, symbolizing a bright future for the company.\n\nZeta Surgical is not just about innovation; it’s about a fundamental shift in how we think about surgical procedures. With their sights set on improving patient experiences globally, they invite collaborations and partnerships to further expand their reach and impact.\n\nFor those interested in joining Zeta Surgical on this exciting journey, or simply wanting to learn more, you can reach out via their website [Zeta Surgical](http://zetasurgical.com).\n\nIn a nutshell, Zeta Surgical is combining the power of advanced technology with the human-centric focus of healthcare, paving the way for a new standard in surgical navigation and procedure precision. If you’re in the field of medicine or just curious about the future of surgery, keep an eye on them. They’re definitely worth watching.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/b4b45b98e7fb496656090f651c9ae2de6f07c932.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192109Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=2db15602c8ccb1c754a617ca4a96382d90caf70c02da5e7030433f38bc54da3d",
    "social_links": [
        "http://linkedin.com/company/zeta-surgical",
        "https://www.crunchbase.com/organization/zeta-surgical"
    ],
    "logo_path": "data/logos\\Zeta_Surgical_logo.png"
}