{
    "links": "https://www.ycombinator.com/companies/zidisha",
    "name": "Zidisha",
    "headline": "Direct P2P lending across the international wealth divide.",
    "batch": "W14",
    "description": "Zidisha is the world's first direct peer-to-peer lending service to bridge the international wealth divide, allowing individuals worldwide to lend to and communicate with borrowers in developing countries without local intermediaries.  The direct connection creates better transparency, more profit for the entrepreneurs and lenders, and greater wealth creation for the world's poorest communities.  We've been featured in numerous press and media for our groundbreaking work in using internet and mobile phone technologies to connect entrepreneurs in some of the world's most isolated and impoverished places with the international peer-to-peer lending market.",
    "activity_status": "Active",
    "website": "https://www.zidisha.org",
    "founded_date": 2009.0,
    "team_size": 1.0,
    "location": "Sterling, VA",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:fintech; industry:marketplace; industry:community; industry:crowdfunding",
    "founders": [],
    "status": true,
    "generated_description": "Zidisha is a pioneering fintech company focused on bridging the wealth divide between individuals across the globe through direct peer-to-peer lending. Founded in 2009 and part of Y Combinator's W14 batch, Zidisha operates from Sterling, VA, with a small team of just one employee. \n\nThe mission of Zidisha is straightforward yet impactful: it allows people worldwide to lend directly to entrepreneurs in developing countries. This innovative approach eliminates the need for local intermediaries, resulting in more transparent transactions, better profit margins for both borrowers and lenders, and ultimately fostering wealth creation in some of the world’s most impoverished communities.\n\nZidisha has made headlines in various media outlets for effectively utilizing the internet and mobile technology to connect entrepreneurs from economically challenged areas to the international lending market. The platform has facilitated an impressive number of projects, with over 305,889 life-changing endeavors funded and a staggering total of approximately $20.89 million raised to date.\n\nWith over 449,108 users (comprising both lenders and entrepreneurs), Zidisha promotes a unique model where lenders can contribute any amount to the entrepreneurs of their choice. Entrepreneurs not only receive capital to launch and expand their businesses but also share personal updates and success stories with their lenders, creating a sense of community and accountability.\n\nZidisha is tagged under categories like fintech, marketplace, community, and crowdfunding, encapsulating its role in the modern financial landscape. The platform makes philanthropy direct and transparent, ensuring that funds raised for a project can be reinvested in new entrepreneurs once their original project is complete.\n\nIf you're interested in making a positive impact in developing nations, Zidisha invites you to browse projects, contribute, and witness the tangible difference your support can make. Visit their website at [Zidisha.org](https://www.zidisha.org) to learn more and get involved.",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/b8041315f9380a1e6f226d553d9e311323317fe2.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAEHIR6H6F%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192110Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDt736ZW5EfzagAz1eKRSs%2FW4TfHu28RBSFaRNkZ9h47gIhANt6WXtwkgL07bQKDKYDGFxYKx7WOO9JX0BqaYrXnKNbKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgx8TqkMwTM2PLcRmr4qwgPGGtQBXv7gs7%2BXGteI1gQk%2FjkbIHwQ5hCKXJKVmVAPw3MeVLhZyp8Nf5%2FYigbwE%2BrFR7aZWKjrs7HxAE0JWit5dlINZLjZK%2BS%2FwMaCqoj%2BFDN0gw9iiAPu4Xn5c3b%2BuZe%2F5%2Flfk0EuxZAXVsZtShxXZy%2FERPQ0v%2FRZxSz5qUoaXpL1zj6VWdWVzoI7%2FPlB3bgJ2PpiF7DN%2BJeDsJPx%2FoKTo5ehP9pOeGbMNxoeegVJsCJ3zvzO3o4fcZYIf6c5iIJwM1Ot3Gg7Z3v9oLZjSRU%2FaRLL5j4n3II7DaroOCEVfPlWzTyZM7SNFZZAFSKM8vLKj1VdTr9s3How41zluf%2FOIp7sGNhG%2FjuYJoG%2FmkLFIlYP4wbGrLO69AWnenZyfi1UhAiV6N%2BlAqGnqvpOJh4vq8uNh2eRnXR%2BMVXdq9oVYkm7XFgprL5PDC4ULLyBWqA6kca4z7F4H56nkT%2FsDtT8ek2VOIRIv1Zgcz%2BeeVG7F7AHS4bdbR6eZ3ChY1iQhfPBErh4OiFQM7IqiUKw%2B1CTpvL68xcVN5gjiaDH0Jotw%2BUcW9dMSg9py8xH8qgyiWG5w3dDj9xaoA2G3NMYq6JOGKMwwIrjvQY6pAHDH54nhADhmb7YSEGxHkL3pqs%2B6aYOExStWbzLKzRb3lb2DAgGG8uU9COt8%2FqUEOtOcszTKp7yuCJwMVkfI7PDZ74h9uiRkRxjtH7%2BLlE1xrfd%2FrIq%2B%2BZr9hSFqZ9MUQ4yNHesyx2FYDbsIfCW9ntlrpmZUHCcrzpQDfufsAFcpe%2FudVT3tUqiF8WCN1Vd%2Bx%2FQ9d3i1HvBcJWV9AYAwM0W22VM%2BA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=db675fc215e1e9089832bf19e7fb733c6e7376d37ef1ac5a1975473490be6f0a",
    "social_links": [
        "https://twitter.com/ZidishaInc",
        "https://www.facebook.com/ZidishaInc?sk=wall",
        "https://www.crunchbase.com/organization/zidisha"
    ],
    "logo_path": "data/logos\\Zidisha_logo.png"
}