{
    "links": "https://www.ycombinator.com/companies/zimi",
    "name": "Zimi",
    "headline": "Platform for international brands to sell, ship, and get paid globally",
    "batch": "S24",
    "description": "Zimi is a cross-border commerce partner dedicated to simplifying global expansion for international brands. We empower businesses to thrive in new markets by optimizing cross-border logistics, offering seamless local fulfillment, and automating secure international payments—all in one streamlined platform. \r\n\nCross-border e-commerce is a $2 trillion opportunity by 2030, however, cross-border merchants face major challenges like high shipping costs, lengthy delivery times, and complex logistics. This is particular true for merchants in emerging markets. With Zimi, merchants reach their international buyers in 1-2 days instead of weeks and for a fraction of the price. Our aim is to make selling internationally as easy as selling locally - starting with merchants selling into the U.S. market.",
    "activity_status": "Active",
    "website": "https://www.withzimi.com",
    "founded_date": 2023.0,
    "team_size": 2.0,
    "location": "New York",
    "group_partner": "Dalton Caldwell",
    "group_partner_yc": "https://www.ycombinator.com/people/dalton-caldwell",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:saas; industry:b2b; industry:e-commerce; industry:supply-chain; industry:retail; location:new-york",
    "founders": [
        {
            "name": "Audrey Djiya, Co-Founder/CEO",
            "description": "Audrey Djiya is the Co-Founder & CEO of Zimi. Before Zimi, Audrey led international expansion and unlocked $M in revenue for e-commerce businesses like Peloton and launched fintech products to enable cross-border commerce at start-ups like Duplo (YC W23). \n\nAudrey earned her MBA from Stanford University and BA from Dartmouth College.",
            "linkedin": "https://linkedin.com/in/audrey-elodie-djiya-7a7a24101"
        },
        {
            "name": "Peter Nsaka, Founder/CTO",
            "description": "Software Engineer with 8+ years of experience. Previously a Senior Software Engineer and Project Tech Lead @ Shopify. Currently working on Zimi to bring Amazon-prime like fulfillment to African exporters - making it easy, fast, and cheap for these businesses to sell internationally.",
            "linkedin": "https://www.linkedin.com/in/nsakapeter/"
        }
    ],
    "status": true,
    "generated_description": "### Zimi: Simplifying Cross-Border E-Commerce\n\n**Company Overview**\nFounded in 2023 and operating out of New York, Zimi is an innovative platform dedicated to facilitating international sales for brands looking to expand globally. As a part of Y Combinator's Batch S24, Zimi’s mission is to make the complexities of cross-border commerce a breeze for businesses. With a small but passionate team of just two employees, the company is already making waves in the e-commerce landscape.\n\n**Problem and Solution**\nThe world of cross-border e-commerce is projected to hit a staggering $2 trillion by 2030. However, merchants often face significant hurdles such as exorbitant shipping fees, lengthy delivery durations, and convoluted logistics—issues that are especially pronounced for brands in emerging markets. \n\nEnter Zimi. The platform aims to radically shorten delivery times to just 1-2 days for US-bound orders, all while reducing costs dramatically. By integrating logistics, local fulfillment, and secure international payments into a single platform, Zimi empowers merchants to navigate international sales as easily as they do local transactions.\n\n**Service Offerings**\nWhat does Zimi provide? Here’s a quick breakdown:\n- **Storage and Order Fulfillment**: Zimi manages warehousing and delivery, ensuring a reliable timeline for orders.\n- **Returns Management**: Handling returns is seamless with local facilities taking the lead, enhancing customer satisfaction.\n- **Market Insights**: The platform provides data-driven insights into market demand, helping brands optimize inventory.\n- **Freight Services**: Access to affordable air and ocean freight options makes shipping cross-border a straightforward process.\n- **Payments**: As your Merchant of Record, Zimi processes USD payments, relieving you of the headache of tax compliance and security.\n\n**Results That Matter**\nZimi has already demonstrated tangible benefits for its users:\n- **20% average increase in revenue**\n- **80% average savings per shipment**\n- **2.5 days average time from checkout to delivery**\n\n**Integration Made Easy**\nZimi simplifies onboarding by seamlessly integrating with major e-commerce platforms like Amazon, eBay, Shopify, and more, paving the way for brands to launch and manage their international operations effortlessly.\n\n**The Zimi Advantage**\nThe core around which Zimi revolves is its unique ability to merge all elements of international selling—from fulfillment to payments—all in one place. With features like a multi-currency wallet, order management, and a dedicated account manager, Zimi positions itself as not just a service provider but a partner in global expansion.\n\nSo, if selling globally feels daunting, Zimi is here to change the game. With a commitment to supporting brands every step of the way, Zimi invites you to experience how easy international e-commerce can be. \n\nFind out more by visiting [Zimi’s website](https://www.withzimi.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/dd37e15d2b815f00d220e0d589e995b23f27e631.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192110Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=baae4f3278a365f76b0f5d3e6c114cc79e49aac94427c92d3a42479864d0ded8",
    "social_links": [
        "https://www.linkedin.com/company/withzimi",
        "https://x.com/withzimi",
        "https://www.crunchbase.com/organization/zimi-a057"
    ],
    "logo_path": "data/logos\\Zimi_logo.png"
}