{
    "links": "https://www.ycombinator.com/companies/zoios",
    "name": "Zoios.",
    "headline": "Help start- and scale-ups excel at People, Culture and Performance.",
    "batch": "S21",
    "description": "Are you looking for a platform that can help you overcome people and culture challenges? \r\n\nWe combine human expertise with advanced data analytics to help you achieve the results you dream about. Our platform helps organizations build a great culture, hire the right talent and lead their people.\r\n\nThere is no need to be guessing, and worrying all the time. Use Zoios to get real-time actions that will help you create an organization where employees thrive.",
    "activity_status": "Active",
    "website": "https://zoios.io",
    "founded_date": 2021.0,
    "team_size": 8.0,
    "location": "Copenhagen, Denmark",
    "group_partner": null,
    "group_partner_yc": null,
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:mental-health-tech; industry:saas; industry:b2b",
    "founders": [
        {
            "name": "Christian Højbo Møller, Founder",
            "description": "I moved to Mumbai, India alone at age 15. When I came home I built a fashion webshop in Flash - went terribly but I naturally learned a ton. Went on to work in marketing as the SEO Lead for GroupM in The Nordics, before venturing out into startup life again with a supplement platform (raised some money and had a good run, but never a great business case). Went back to management consulting for a few years before I convinced Mikkel to join me at Zoios!",
            "linkedin": "https://www.linkedin.com/in/christianhojbo/"
        },
        {
            "name": "Mikkel Agesen, Founder",
            "description": null,
            "linkedin": "https://www.linkedin.com/in/mikkel-agesen/"
        }
    ],
    "status": true,
    "generated_description": "Zoios is a Copenhagen-based company founded in 2021, and it's on a mission to help startups and scale-ups strengthen their people, culture, and performance. As a participant in Y Combinator's Summer 2021 batch, Zoios brings together human expertise and advanced data analytics in a unique SaaS offering designed to tackle the common challenges in organizational culture and employee engagement.\n\nThe platform works like this: it collects data to provide real-time insights that empower organizations to cultivate a thriving workplace. Instead of relying on intuition or guesswork, Zoios allows leaders to understand their teams' well-being at a granular level. This means recognizing stress signals, aligning goals, and utilizing individual strengths effectively.\n\nAt its core, Zoios has developed several key modules, including engagement pulse surveys, workplace assessments, and personalized feedback tools. These modules are crafted to ensure that leaders have everything they need to maintain a positive work environment while driving performance. The recent launch of their \"Leadership Copilot,\" which leverages team data to provide actionable insights, illustrates their commitment to innovation in the mental health tech sector.\n\nHere are a few noteworthy achievements and features of Zoios:\n- **Impact Metrics**: Clients report an 18% increase in well-being, a 14% boost in job satisfaction, and a 19% reduction in work-related stress within the first six months of using the platform.\n- **AI Integration**: Their use of artificial intelligence helps continuously analyze data and recommend best practices based on collective insights, ensuring leaders make informed decisions in real time.\n- **Diverse Clientele**: Zoios is already used by numerous prominent companies, signaling its effectiveness and appeal across various industries.\n\nThrough its intuitive design, Zoios steers away from traditional top-down management styles, emphasizing a proactive approach to well-being—an essential ingredient for sustainable business success. Their goal is simple yet profound: to empower every organization to go beyond intuition and cultivate environments where every individual can excel. \n\nFor anyone serious about enhancing their workplace culture and employee engagement, Zoios could be a game-changer. You can explore their offerings further at [zoios.io](https://zoios.io).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/ffc5337d3ba19d0f45ed3b7b930c7d41a5c9db39.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAKBB576US%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192111Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELP%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJHMEUCIFRjVxB%2FHxIJHUHkMazoRi02jYmaJVJGr3K7C9j9jiflAiEA6iszI4%2Fpn8hDzk7aMP6LlnqynbPgCG20CpdZqslTFdsq7gMI3P%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwwMDYyMDE4MTEwNzIiDNVC6v4lNMvTlUOjTyrCA7R4NjcD6pWk9Gjux5NdrMhwU67pNo%2F0JVDzkHcTjBsajnWXpXoyD3m%2FssX0rwYmnUDJB9VTgD%2FW2M8cWxeD93WFxLjs25juzzGj1%2BC1Ky9E0oNPwn5jGw%2BjokWylkxcouU18mjUtP8juH4uF9Xfmm%2FMAgvOPsNSAaYBQ%2BdA5Vwom66MCzynAPEJs6Nqxd5FqtgiiWFRhT5L9g%2FvfLTKqpdIg0XPF6s95lLCtwWDHST72Bn9JVH2zZmqjTgO2sao7Rg4M%2BPIRazg8JhbPoWk6xsB2yfG1f%2Bs8AFVxihyUnQj6TUnhrhezs7WYsaTfaaAoTIzhEsLwJDqBQDSptmSlUj%2BQ3KWwrXpJIm0b1uOmaylnrEpn5obECdRc%2FzdEfNt6DNEE5cbUhQo8Gjfd6MWfyV7JHtX7DwsLMssQPKNZ6qWJq2gP1fVHFkz5K0F%2F73p54AKB5gCkyOeRPJHmAzYMdfZpMF%2B8hE4eZU6k7m1EqPLEW2F9HVvcqPFp8T%2BZgbbDLBVWICSdX%2FfJ%2BniwyC72aHLaqjCxHLvJ6WyAawaepaDD9csEvz4DYD9lpHx9hJXqrFDyrT1vAaaBwuoXgulZ6gNmjCmiuO9BjqlATnnhPFnQUT7QmhXwrAFbGCqdgkRFIVCdDrNmasZJtz86frmIpB%2BlwZjavL0FMq46mN9RKFTuRNdMnOtOh1adMI%2BkC%2F%2Bs3m8pwR56JxErG%2B8nIBe7efeu5WiUZbGCsp85oXBCGY%2FoP1uWrJo843L0LVdmjtyXaDurxXSgzfeZo2RDONME7LNkPzuGzA19XefIc9OvA1QFcZr3VIdZe%2BLywfFgDpgwA%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=93623d588ddb4b7e92d75afc7564ad2694bf17f3eab3e4a1a420a2e739ef2d74",
    "social_links": [
        "https://www.linkedin.com/company/ZoiosHQ",
        "https://www.facebook.com/ZoiosHQ",
        "https://www.crunchbase.com/organization/zoios"
    ],
    "logo_path": "data/logos\\Zoios._logo.png"
}