{
    "links": "https://www.ycombinator.com/companies/zuddl",
    "name": "Zuddl",
    "headline": "Zuddl is a modular platform for events and webinars that helps eventâ\u0080¦",
    "batch": "S20",
    "description": "Zuddl is a modular platform for events and webinars that helps event marketers plan and execute events that drive growth. Event teams from global organizations like Microsoft, Google, ServiceNow, Zylo, Postman, TransPerfect and the United Nations trust Zuddl. Our modular approach to event management lets B2B marketers and conferences organizers decide which components they need to build the perfect event and scale their event program. Zuddl is an outcome-oriented platform with a focus on flexibility, and is more partner, less vendor.\r\n\nFUNDING\r\n\nZuddl being a part Y-Combinator 2020 batch has raised $13.35 million in Series A funding led by Alpha Wave Incubation and Qualcomm Ventures with participation from our existing investors GrowX ventures and Waveform Ventures.",
    "activity_status": "Active",
    "website": "http://www.zuddl.com",
    "founded_date": 2020.0,
    "team_size": 120.0,
    "location": "Hyderabad, India",
    "group_partner": "Michael Seibel",
    "group_partner_yc": "https://www.ycombinator.com/people/michael-seibel",
    "company_linkedin": null,
    "company_twitter": null,
    "tags": "industry:saas; industry:b2b",
    "founders": [
        {
            "name": "Bharath Varma, Founder",
            "description": "After studying Economics(Hons), Bharath went on to start an event management agency, Phoenix Live, in 2014. Phoenix Live works with Microsoft, Deloitte, Google, HSBC and many other large MNCs. Phoenix Live co-owns two music properties, Riders Music Festival in partnership with Red FM and Life in Color in partnership with Times of India.",
            "linkedin": "www.linkedin.com/in/bharath-varma91"
        },
        {
            "name": "Vedha Sayyaparaju, Founder",
            "description": null,
            "linkedin": "https://www.linkedin.com/in/vedharaju"
        }
    ],
    "status": true,
    "generated_description": "Zuddl is a modular platform designed for events and webinars that empowers event marketers to efficiently plan and execute events that facilitate growth. Founded in 2020 and based in Hyderabad, India, Zuddl operates under the mantra of being more of a partner than a vendor, offering a tailored, outcome-oriented approach to event management. Their clientele includes notable organizations like Microsoft, Google, and the United Nations.\n\nThe platform supports diverse event types, including user conferences, industry events, field marketing, and webinars. With a commitment to flexibility, Zuddl allows marketers to select the components that best fit their needs, facilitating the creation of customized experiences that resonate with attendees.\n\nZuddl has successfully raised $13.35 million in Series A funding, backed by investors such as Alpha Wave Incubation and Qualcomm Ventures as part of Y Combinator’s Summer 2020 batch. With a team of about 120 employees, they are poised to continue their trajectory of growth.\n\nTheir offering includes features that enhance various aspects of event organization, such as ticketing and registration, virtual and hybrid event management, onsite solutions, and event analytics. They emphasize user engagement through innovative tools like mobile apps and gamification strategies, catering to the evolving expectations of attendees in a digital-first world.\n\nThe company has garnered recognition for its ability to deliver substantial ROI for its clients, evidenced by case studies revealing significant growth in new pipelines for businesses leveraging their platform.\n\nFor more information or to explore their solutions, visit [Zuddl's website](http://www.zuddl.com).",
    "logo": "https://bookface-images.s3.us-west-2.amazonaws.com/logos/a7cc629ac5ce581a9d3fc8d575646457db7dd034.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQC4NIECAFJSOQ65W%2F20250221%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250221T192111Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjELT%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQDHe2krNA4Wz4ZdbboNJG%2B0zG6MmRspOJ5Kex%2FWuhFzDwIhAK4JNrLJx7V6Lp69aumcmLj570j2DR2Eh3hPcEuQGW3%2FKu4DCNz%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMMDA2MjAxODExMDcyIgweLBjNRNugVRDPT8gqwgPiLGnMwjgQOiNH7FMTInTVKCCJLDe5fdDWlactIzRh2XOtRjauQZptst9ejdBs3vj590lIr07sFFKCWuGV%2B%2BJkmRqS%2BXBC6caH3J97%2FH7W3ch4kKAyKE3TuVCMVl%2BqNFww29jX%2BimNvDUNvCgQtjVE03FWSnfbJrDf3NUx8wttW6l2EC5fgOealDp0Ne7xA51qGtDKfIYSJUUyj6d2WgcNp66ilXSYF5HX3L4wid4xRepJ9Vt1krkNG6bsNoITqg8zMlLgZ7QT5uVwuoY%2Fhv%2F89O661Pa6%2FtGfz6gcZjx3JmkvJh2yaephzjfzpFg43OFS%2B3NnORgMbCqTEcn9piGJokbf9a5xoR2Qt8E4L2AdZTypzC0scYqz%2BA1CsQiK1RrvedAjSsaEw4%2FqFaR6rBrZ4SBiKqlmStv67nu5CMG6DF414F2WlGbkeS8C%2BJYZ2iky%2B19B0K9e4J7Tik78PRFNXoN8lSqP4k%2BLhdrqVq5b2d4m7UHeeProhr%2Fv5HV%2BORFSiFow%2Fhbxt6GN2P2YWxzdIHA32IkBqYD%2BeZ3eFOZSk%2B1Pldgq4PSaiU5lQlEewufIwxcnWXTzGkzSJ%2BLlLlzWX4EwrKPjvQY6pAEqZgWN8cooHP%2FeegIX6R3Pun8lUwrTM2csrvVF8K2udU7KUu1EoXzzxsupULfK9AN%2Bcef1HwWg3GN0hRmtduP9znDwqy7B09eErZHX3iCWPeVm7m2HUwQH0BM7NBnkw%2BBNh35scX3c4lMIghjRFyw9b8VEOGAbUjAxbgvLqemFdd8Zq7DGRWXDbhLqcGd2hHliZLchEjlQhzfD3wdeSwzTgvkJMw%3D%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=dadb5783d85561bf4c4e722e7c03d9513734c0e36e8f7197d052c7c37ec9c58b",
    "social_links": [
        "https://www.linkedin.com/company/zuddl/mycompany/"
    ],
    "logo_path": "data/logos\\Zuddl_logo.png"
}